{
    "app_id": 233720,
    "name": "Surgeon Simulator",
    "release_date": "2013-04-19",
    "developer": [
        "Bossa Studios"
    ],
    "publisher": [
        "Bossa Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Comedy",
        "Indie"
    ],
    "achievements": 123,
    "positive_ratings": 11387,
    "negative_ratings": 2462,
    "price": 6.99,
    "description": "Surgeon Simulator is an over-the-top operation sim, stitching together pitch-black humour with life-saving surgery. Become Dr. Burke, a would-be surgeon with a less than conventional toolkit, as he performs procedures on patients including none other than Donald Trump, himself! ...is that a hammer?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233720/header.jpg?t=1526556372",
    "minimum_requirements": "OS:Windows XP Processor:2.0 GHz Memory:2 GB RAM Graphics:Nvidia Geforce 7800 GT or better DirectX®:9.0 Hard Drive:500 MB HD space Sound:DirectX9.0 compatible sound card Additional:Requires keyboard. Touchpad supported, but mouse strongly recommended for best play experience.",
    "recommended_requirements": "OS:Windows 7 Processor:2.0 GHz or better Memory:2 GB RAM Graphics:Radeon x850 or comparable DirectX®:9.0 Hard Drive:500 MB HD space Sound:DirectX9.0 compatible sound card Additional:Requires keyboard. Touchpad supported, but mouse strongly recommended for best play experience.",
    "reviews": [
        {
            "review_text": "I've always wanted to become a doctor, and this game fully prepared me. Not even kidding. I performed my first real life surgery yesterday.  Kidney transplant. With a motherf**king pencil. Ended up switching the man's kidneys with a fire extinguisher and a watch.  We laughed it off at the end though, so everything is cool. He likes his new kidneys.",
            "review_score": "1"
        },
        {
            "review_text": "As a real surgery man, i can confirm this is how hospital people do surgeries.",
            "review_score": "1"
        },
        {
            "review_text": "A hyper-realistic surgical procedure simulation program, likely used the world over to train medical professionals. Playing this intense game, you get put second-by-second in total control of a mans life.  The real world physics and photo-realistic graphics, combined with the Oculus Rift support makes this an unforgettable experience, almost identical to performing real open heart surgery yourself. As such, it is a very gory game and should not be attempted or even purchased by the weak of stomach or those with a tremorous disposition. It is also impossibly difficult, requiring a stready hand, a sweaty brow and utmost focus. Do NOT play if alone, under the age of 18 or have not had 3 years in medical school beforehand.   Highly difficult, very realistic, outstandingly educational. I look forward to future productions from this outstanding simulation company.",
            "review_score": "1"
        },
        {
            "review_text": "i dunno how to use my hands.",
            "review_score": "1"
        },
        {
            "review_text": "You broke my heart :((",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, it proves that I cannot be trusted with a scalpel and I should give up going to medical school.",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea if you are going to like this game. It's a weird, hard to control, bizarre game. People compare it to QWOP and to the extent that it relies on playing twister with your fingers that's true, but it's much more than that. Each surgery is like a puzzle, trying to figure out which tools work and don't, finding the most efficient route through it. Achievements incentivize creative play. I mean, the most amazing thing about the game is that it exists at all, it's so absurd. But I think if you get past the initial curve you'll find a compelling score/time attack game.  I'll also add that if you have people over to your house, non-gamers LOVE watching this. A casual hammer to the skull here, a drill dropped in a chest cavity there, accidentally throwing the replacement heart away. It's all good.  You're looking at 8-10 hours for completion of every surgery with good scores, maybe 12-15 if you want to go to A++ on everything. The developers have also repeatedly updated the game with new free content, so I think it's fair to say that if you're the type that buys games to support a developer, this is a good choice.",
            "review_score": "1"
        },
        {
            "review_text": "They made a Donald Trump surgery option, but we all know Hillary needs it more",
            "review_score": "1"
        },
        {
            "review_text": "Beyond the absurdity and the humor, Surgeon Simulator can only offer frustration. Poor controls are taken as a core design philosophy and buttressed with any restrictive obstacle that came to mind. This is not the hilarious but humbling exercise of realizing how difficult complicated basic movement really is, this is a constant fight against a game that not only has to struggle to understand what the player wants it to do but also has trouble preventing objects from phasing in and out of each other. The lesson this game has to teach, what it demands of its players, is that they put aside the anger born of uncooperative controls to practice patience and precision in a world that has none. It's quite clever really. Shame all that's left to look back on is annoyance after annoyance, which increases level by level in the name of some sense of progression.",
            "review_score": "-1"
        },
        {
            "review_text": "Saw a shortcut to this on my doctor's desktop.  8/9 Confident they're well trained.",
            "review_score": "1"
        },
        {
            "review_text": "can i be doctor now",
            "review_score": "1"
        },
        {
            "review_text": "Five million yotube hits on Pewdiepie's let's play of this game ought to tell you what sort of demographic this game caters to. The most atrocious controls and asanine precision hinder a title that rips off other surgery games (trauma center, etc), but since it's an EPIC MEME game the unweildy inputs get a free pass amirite? The same three procedures rehashed with slightly different scenarios, oh boy. Here's your ♥♥♥♥ cherry for this vomit-cake. Anyone who identifies this game for the ♥♥♥♥ it is can be refuted by being told to git gud. After all, artificial difficulty is still difficulty.",
            "review_score": "-1"
        },
        {
            "review_text": "+ Gameplay mechanics are novel, difficult, and absolutely hilarious + Everything about this game is side-splittingly funny + Music is priceless + Packed with additional pitfalls that challenge you in funny ways, like a drunk ambulance driver and various, unlabeled needles lying around  - Controls have a fairly steep learning curve and are very difficult to master - Poor replay value; by the time you finish all the procedures, you'll be kind of burnt out on the game",
            "review_score": "1"
        },
        {
            "review_text": "Make America great again   from trump",
            "review_score": "1"
        },
        {
            "review_text": "My ♥♥♥♥ gets hard everytime i play this",
            "review_score": "1"
        },
        {
            "review_text": "very silly game :)",
            "review_score": "1"
        },
        {
            "review_text": "6.2/10 - The hardest game on the planet!  Props for being so hard; everything looks easy to do but execution will make you pull out your hair and rage quit. I've accepted I will never complete a surgery, now I'm just looking to complete any achievements and get those drops!  Only play this if you enjoy a true challenge, you will use both hands to hold, grasp and perform difficult maneuvers. You won't breeze through this one. I think the $13 price is much too high. I bought on sale for $1.39, so look for sales.  Worth $5!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "This game has alot it can teach you. I learned real fast that I should never be a doctor, but I have a blast just reaching in there and ripping the lungs out or taking the hammer to remove the rib cage....needless to say the game is only as twisted as the player is. The great part of this game is that you will find yourself constantly going back to play it in the future. Or to show friends and family why you did not persue the medical field.",
            "review_score": "1"
        },
        {
            "review_text": "I now know how to do a Brain Transplant",
            "review_score": "1"
        },
        {
            "review_text": "Time to Operate! Thanks to playing hours of this game, and watching every episode of House and Scrubs TWICE, I am now fully prepared to be a doctor.",
            "review_score": "1"
        },
        {
            "review_text": "Ripped out a mans lungs, dropped my watch into his chest cavity, smashed his ribs with a hammer and dropped a pizza cutter on his face, A* Surgery techniques 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks i cant even perform a heart transplant i tried for 2 hours",
            "review_score": "1"
        },
        {
            "review_text": "I now have a degree in Surgery.   Thanks Bossa.",
            "review_score": "1"
        },
        {
            "review_text": "Frustratingly difficult, but very charming and entertaining; use a guide for best results. An amazing soundtrack and free content being added all the time are very praiseworthy.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, Yes, Yes, Yes, Yes! A comical surgery game! Everythin is just a yes! Buy this game! So worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "Take your anger out on Bob - oddly satisfying : )",
            "review_score": "1"
        },
        {
            "review_text": "I have cerebral palsy so this game really resonated with me",
            "review_score": "1"
        },
        {
            "review_text": "ever wanted to be a doctor, but did not have the grades or money to go to medical school? Well this games solves all that, by provideing a great experiace to Obama care first hand. Thanks Obama.",
            "review_score": "1"
        },
        {
            "review_text": "'Fry, it's been years since medical school, so remind me. Disemboweling in your species: fatal, or non-fatal?'-Dr.Zoidberg 3001 10/10 would Zoidberg again",
            "review_score": "1"
        },
        {
            "review_text": "It's fun the first couple of hours, but the limited options quickly makes the gimmick boring. But i feel it's with the 10€ for a few hours of fun entertainment",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is one of these short joke games where the core of the gameplay is the hilarity that stems from overcoming intentionally awkward controls and buggy physics. You play as a newbie surgeon - or to be more precise, a clearly disembodied hand - who has to successfully complete various surgeries despite being clumsy as all hell.  Don't look for any kind of anatomical accuracy or realism in this game - ripping off the patient's organs and throwing them on the ground just to get to the one organ that needs replacement is a regular practice in the game, and the mission is considered completed if you manage to throw the new organ onto the spot where it's supposed to be. Even if said organ falls out immediately afterwards while the game merrily displays the success screen (which clearly suggests that the patient wasn't going to survive one way or another). The only thing you have to worry about regarding the patient is making sure that the blood level doesn't reach zero. And yes, you can still finish the mission even if the patient is left with as little as 1 ml of blood. This game exists to be a source of dark humor, not to be realistic.  You are given plenty of tools to accomplish various tasks and it's only up to you to decide what is going to be useful. Obligatory scalpels, various saws for cutting bones, drugs that either slow down or speed up the blood flow, and even axes, hammers and drills. Many of them, more often than not, are going to be only a hindrance in your desperate efforts, blocking your way to the actually important tools, bumping into the patient and making him lose blood, or even getting you high. And that's just the beginning.  As I mentioned, the game isn't very long; there is 9 levels total, plus 2 hidden, and the exact time it will take you to complete them for the first time will vary depending on how badly you'll be initially doing. There are 3 kinds of surgeries in 3 kinds of environments, so at some point you'll end up in a situation where, for example, you have to do a brain transplant in an ambulance that rides on a bumpy road, with the objects jumping up at random and the back door opening from time to time. Probably the funniest moment you are going to see in this game is successfully completing said surgery and then watching as the brain you just put in the patient's head falls out right away and ends up on the floor or even on the road. The mission is still accomplished, so who cares!  Surgeon Simulator is the kind of game that you either just can't stand, or love coming back to it despite how badly it frustrates you. And yes, after the initial hilarity wears off and you get better at playing it, you'll most likely start seeing the game's frustrating elements more and more. Probably the biggest one of them is how it can be a pain in the butt to actually grab things; there's NO indication whether you actually grabbed the damn object or not, usually resulting in you spending some time on the ritual of pressing the buttons to grab something and then raising the hand to see if you actually grabbed it.  Another problem is that the game gives you next to no information on how various things work. There is no tutorial at all; the only thing you get is the info on how to control the hand, which is displayed on the computer in the main menu (and the said menu uses the exact same hand mechanics as well, to make matters even better). The rest you either have to figure out yourself (most likely failing numerous times before you successfully complete a surgery at least once) or just Google things up. The game DOES give tips on certain things, but that's only AFTER you completed a surgery, and only if you figure out that you can put floppy disks into the computer in the main menu. And let me tell you, doing so can be frustratingly hard as well, since the computer will only accept them if they're perfectly aligned.  In the end, Surgeon Simulator is a little curiosity that some people will like, and some people will hate. My recommendation is to first play the demo provided by the creators of the game and see how well you'll do in it. If you'll end up loving the absurdity of the game, then I think you'll like the full game as well. But if you'll instead end up getting frustrated and/or freaking out over the patient dying, then I think you're better off giving up on this one.",
            "review_score": "1"
        },
        {
            "review_text": "i don;t get the appeal of this game it's absolutly rediculous",
            "review_score": "-1"
        },
        {
            "review_text": "yum the blood really get my nipples hard imagine all the blood running down your neck while you stick your 'tube' in to there open woould and starting thrusting in ang out of there bullet wounds i also enjoy butting my head in side the pateins chest and masterbaiting while sing ing i shot the sherieff #ilovebloodorgies",
            "review_score": "1"
        },
        {
            "review_text": "Gave me cancer from how hard it was.  Decided to take my anger out on patient, flipped him off.  Got an achieve for flipping him off.  10/10 best game.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 'Malpractice makes perfect'.",
            "review_score": "1"
        },
        {
            "review_text": "Cards!",
            "review_score": "1"
        },
        {
            "review_text": "&gt;starts surgery &gt;tries to find hammer &gt;smashes the ♥♥♥♥ out of patient's ribs &gt;rips out lungs &gt;I think my work here is done",
            "review_score": "1"
        },
        {
            "review_text": "Take adventure as a disembodied hand and do master surgery. You are a master surgeon, on a journey, to save a human being known as...Bob...",
            "review_score": "1"
        },
        {
            "review_text": "   Will It Run?",
            "review_score": "1"
        },
        {
            "review_text": "HowToBasic Surgery Edition:",
            "review_score": "1"
        },
        {
            "review_text": "Got this in a Humble Indie Pack. One wonders... can anyone be dissapointed by a $1 game?  Surgeon Simulator has the dubious honour of answering that with 'yes'... a feat previously unthinkable. Stick to the Youtube vids... they can be somewhat enjoyable, unlike the game itself.",
            "review_score": "-1"
        },
        {
            "review_text": "you have to do operations with just a hand you can call that a handjob",
            "review_score": "1"
        },
        {
            "review_text": "Hardest Game Ever If You Have Skill I Recommend You Play This Game",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun! I play it so often and there is always stuff to do in it. Some levels are annoying but you feel good when you beat it! More updates please!!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like saving lives? Do you like blood spraying in your eyes? Do you like the satisfaction of flipping your patient off? This is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "i would literaly pay for dlc this game is realy fun if only their were dlc to do diferent surgeries and different characters",
            "review_score": "1"
        },
        {
            "review_text": "surgeon simulator sounds serious and boring, but thanks to the wierd controls the game is hilarious. 10 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "just couldnt get into. its a fun idea but not for everyone",
            "review_score": "1"
        },
        {
            "review_text": "i bought this game 37 minutes before it went on sale. still 8/10 fun game",
            "review_score": "1"
        },
        {
            "review_text": "its really funny because you can either mess about and put a spoon in his lung or you can be serious and complete the game in about an hour   its really fun and i think it should get a workshop ( if it doesnt have one already )  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing :D",
            "review_score": "1"
        },
        {
            "review_text": "You get to kill a man without the mess of an actual body!",
            "review_score": "1"
        },
        {
            "review_text": "A Smart Dokter =  &gt;Having random clutter on the table &gt;Wearing your watch during surgery &gt;Have the radio turned on &gt;Use one hand &gt;Stupididly drug yourself &gt;Have no diploma whatsover &gt;Killing more patients than saving  9001/10",
            "review_score": "1"
        },
        {
            "review_text": "I achieved an A rank by severing the patient's skull with a fire hydrant and swiftly cutting off the spinal cord from the brain itself. Talk about using tools at your disposal. Love the game.",
            "review_score": "1"
        },
        {
            "review_text": "I fricking love it!",
            "review_score": "1"
        },
        {
            "review_text": "-Parents ask me why I'm playing games so much, so I showed them this game. -They now believe I'm training to be a surgeon.  10/10 For teaching me how to be the best surgeon NA ",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is one of the hardest games I have ever played. It is darkly humorous, and I would totally recommend it to anyone looking for a challenging game. I would also recommend you get the anniversery edition, for it features a level where you operate on Donald Trump",
            "review_score": "1"
        },
        {
            "review_text": "This is ridiculous, it is a complete trivialisation of major conditions, and a mockery of medicine, you can put his lungs on his head, you can drop his ribs on the floor, you can 'accidentally' lose your scalpel in his open, bleeding body. UTTERLY RIDICULOUS.  THATS WHY I LOVE IT.",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting a top-of-the-line learning tool for medical studies, but am bitterly disappointed that this game is nothing at all like real surgery. I am shocked that they would even dare to call it a 'simulator'. The representation of the human body and its organs is laughable at best, the surgical processes are simplified to crude hammering, slicing, dicing and flinging, and my 'hands' act as if they're almost paralyzed, they're so cumbersome. Jack the Ripper himself would scoff at this brutal mess of a 'game'.  What could have been a helpful tool for the medical profession, and indeed for the betterment of humanity and the human condition, is reduced to outright nonsense. Look elsewhere if you are seeking a valuable learning experience. However, if utter mayhem involving helplesshuman bodies, all manner of blunt/sharp/shiny/pokey/breaky objects (medical and otherwise), and sheer unmitigated madness is your idea of a 'fun' time, then perhaps this offering is for you, you sad and demented person.  I know it's right up my street.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Now I know how to safely extract a heart from a dying patient. Thanks, Surgeon Simulator 2013",
            "review_score": "1"
        },
        {
            "review_text": "Get this game coz it like being a surgeon man but better coz is also like your handicapped!",
            "review_score": "1"
        },
        {
            "review_text": "When people ask me if I can drive, I say 'I don't know,' because I've never tried and I'm an optimist. This is the surgery version of that, and when I played it I laughed so much that a considerable amount of fluid came out of my face.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game to play on school XD",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty funny game; it's absurd controls, and premise, add a certain flavour of humour to the game. I've definitely enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is stupidly fun and frustrating all at the same time. I certainly never thought I would spend any amount of time actually enjoying it but was pleasantly surprised and find myself coming back for more time and time again. If you can find it on sale or have a coupon it is certainly worth the few dollars you will spend.",
            "review_score": "1"
        },
        {
            "review_text": "i'm a professional surgeon working at the most prestigious hospitals. i bought this game hoping to learn more about surgery. i tried the maneuvers they showed in the trailers and gameplays on a patient and he died. i blame this game for not teaching me about cardiopulmonary arrest.",
            "review_score": "1"
        },
        {
            "review_text": "this game taught me how to preform a bunch of various surgeries in a bunch of different senarios, not just on humans, but on aliens  brb going to go to a hosptial",
            "review_score": "1"
        },
        {
            "review_text": "If you were looking for a hyper realistic simulation this isn't it   10/10",
            "review_score": "1"
        },
        {
            "review_text": "it takes many triles and erors to complete levels but very fun",
            "review_score": "1"
        },
        {
            "review_text": " Surgeon Simulator 2013  taught me how to be doctor in less than a day! It changed my life! It's like Reading Rainbow on an operating table, you can do anything. Now I live in a mansion and am surrounded by girls and money. Thanks Surgeon Simulator 2013!  See what I learned to be great doctor for people in need    here! [/b]  ",
            "review_score": "1"
        },
        {
            "review_text": "Hello Ladies and Gentlemen and welcome to my review of Surgeon Simulator! in this cartoon style simulation game you play as the worst surgeon ever hired as you attempt to give several transplants and hope your paitents die so they can't sue you for malpractice.  pros +Very creative take using a first person perspective to desimate your pateints and then lazily toss a organ inside of them! +The Ambluance levels are very creative thought frustrating to watch the transplant organ fly out the back once you hit a bump in the road +Tf2 inspired Dlc for free where you operate on heavy!?  cons -Sometimes the controls are a little too frustrating for me  -the lack of other surgeons in the room seems rathe odd for me considering I've been to a actually surgery and watch professional surgeons operate with a team  So in the long run this game is a blast that I deffinatly reccomend buying and give a it a juicy score of 8.5/10. So heres to killing another paitent and never being sued!",
            "review_score": "1"
        },
        {
            "review_text": "As the best doctor from Arstotzka this is the best simulation of our glorious practises from our great Nation. You can't get this level of expertize from Kolechia. Their hospitals smell bad anyway. Glory to Arstotzka! 10/10 passports.",
            "review_score": "1"
        },
        {
            "review_text": "You should give Heron a raise for those amazing soundtracks",
            "review_score": "1"
        },
        {
            "review_text": "I replaced all of Bob's organs with surgery tools and a pencil. He lived. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Broke the ribcage open with a baseball bat. Ripped out the lungs, stomach, and liver. Replaced heart with baboon heart. Looks fine, He'll live.",
            "review_score": "1"
        },
        {
            "review_text": "Death To Mr.Bob",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious to watch someone play for the first time!",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious, but that doesn't mean its good. This is probably the most annoying and frustrating game i have ever played this year, i understand this is supposed to be so bad that its fun, but its not, its awful, i can only see myself playing this game for atleast 10 minute intervals every 4 months.",
            "review_score": "-1"
        },
        {
            "review_text": "8/10 a fun game to play when you come back from the pub/hospital  (just kidding)  It's still great, even if you don't have the DLC for it. Would reccomend to someone who plays hilarious games.",
            "review_score": "1"
        },
        {
            "review_text": "Hammer stuck inside of ribcage. Eviscerated organs. Magically stuffed glass beaker into lung. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I fricking love it!",
            "review_score": "1"
        },
        {
            "review_text": "Who knew being a Surgeon was so much fun?",
            "review_score": "1"
        },
        {
            "review_text": "Its a very very funny and good game reccomended",
            "review_score": "1"
        },
        {
            "review_text": "No game has given me this much joy yet.",
            "review_score": "1"
        },
        {
            "review_text": "This game may certainly be one of the most underrated games I ever played. There is all that is needed. From a joke, it went to be a fun and challenging piece of work. It is difficult to master, but when you finally do, you love it even more. Levels get harder, achievements are rewarding, riddles make you wonder for two days with the whole community... Not to mention the devs are really here for the players, always adding content. A pleasure !     EDIT : now can depilate brows &amp; mustache. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I didnt have to go to medical school to become a surgeon. Worst game ever i give it a 20/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun. I actually enjoy sawing bones out of someone and not killing them 'mostly'. The only thing I might change is how quickly things drop to the floor. Once somthing is out of sight, you cant get it anymore.",
            "review_score": "1"
        },
        {
            "review_text": "I don't think it is worth 10€ although it may be fun for few hours. Buying it in some sale is better idea. Also controlling of this game may be a small problem for a new players. Warming up in a main menu recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun. I actually enjoy sawing bones out of someone and not killing them 'mostly'. The only thing I might change is how quickly things drop to the floor. Once somthing is out of sight, you cant get it anymore.",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ allows me to rip your ♥♥♥♥ing heart out and throw it out the window :)",
            "review_score": "1"
        },
        {
            "review_text": "The best surgeon simulator I've ever played ;)",
            "review_score": "1"
        },
        {
            "review_text": "I am now a fully qualified brain surgeon. 8/10  You need a mouse for this game, no way to play it otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "I resisted this game for a long time, it looks frustratingly difficult based on poor controls but it actually isn't.  It's pretty great and not as difficult as youtube would have you believe.   It has a good mix of difficulty modes based on where the surgery is taking place. The surgery's make sense and everything has a specific purpose or method for being done.  Great game, Worth Playing.",
            "review_score": "1"
        },
        {
            "review_text": "This is definetly not a game for the faint hearted. I would recommend it to YouTubers as it is a common faviourite. It also requires some Skill to acctually perform a opertation succcesfully but i think it is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Heart Transplant: Completely smashed rib cage, removed every single organ, only added the new heart, game tells me he'll be fine.  Brain Transplant: They added a Steel Tomahawk from Assassin's Creed to help you replace a brain.  11/10  - IGN  ",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is a fun game! This game is really fun and challenging, which I like in games. It has nice smooth graphics/physics, and tactical controls. The best thing about this game is the fact that it's hilarious, from every gameplay angle. But why the low MetaScore?  Pros: . Really fun and a bit of a challenge! . Nice graphics . Really funny  Cons: . Can seem a bit repetetive sometimes . Not a lot of gameplay (But still a fair amount)  Overall I suggest you buy this game if you are looking for a challenge, and a giggle. It's a fun game with only few negatives. (8/10)",
            "review_score": "1"
        },
        {
            "review_text": "Ridiculous, fun and unusual.  You can slice open a man, Heavy from 'Team Fortress 2' or a freaking alien, throw all his intestines on the floor, then put one new organ in his body and be sure that he'll live.   11/10 Best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Genious game with amazing easter-eggs. Hilarious to play with friends. Too bad I've become so good at it, the funny 'wtf-is-my-hand-doing' moments is not as common anymore. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "As a surgeon, this is an accurate representation of my people.",
            "review_score": "1"
        },
        {
            "review_text": "Ah...Just a little nauseous during my first operation,and I think this game's real name is Various Ways to Kill the Patient...But it's so amusing,I like it. :)",
            "review_score": "1"
        },
        {
            "review_text": "Got an achievement for smashing Bob's head in with a tomohawk and killing him 5 seconds into the surgery. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Actually pretty good, played like six minutes",
            "review_score": "1"
        },
        {
            "review_text": "Dis game is c00L bro  10/10 IGN (I don't really now if it is)  Swag game!  I killed Bob!",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT!!!!!!!!!!!!!!!! #AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "this is amazing! surgeon simulator 2013 is the best simulator I have ever played and its the only simulator I have played but apart from that, I would recommend this game to all ages sure theres some blood but I guess thats surgery for you...",
            "review_score": "1"
        },
        {
            "review_text": "Very casual game.",
            "review_score": "1"
        },
        {
            "review_text": "I suggest rating this game for 'The 'Villain most in need of a hug' award' since he (You) has most likely killed about 500 people named bob or joe or some crap like that, So Yea, Id suggest this (Oh yea also this game is rage inducing so it's fun rated 10/10 great game would play again)",
            "review_score": "1"
        },
        {
            "review_text": "'Nurse! Hand me the sharp curvy thing!' 'This pinkish squish is in the the way. We must remove it.' 'What is this? A flesh scarf? He won't be needing that.'  Never before has a game caused me to need to create so many new words. This is a must-get language simulator.  Oh yeah, and there's something about surgery.",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend this game. Listen, if you think I'm in no place to be judging it, take this into concideration: I legitimately got an A++ on every mission, and I got a 100% no blood loss brain sugery. I know what I'm talking about.   Lots of people complain about the way this game runs, but it runs perfectly for me and I have a terrible pc. I can barely run skyrim on medium graphics. This game runs perfectly if you want to mess with the options a small bit.     The game's controls are terrible.  BUT THAT'S THE POINT. YOU'RE PLAYING AS A DRUGGED UP SURGEON. YOU'RE NOT MEANT TO BE IN CONTROL OF A SOBER HUMAN, YOU PLAY AS NIGEL BURK, A MAN ADDICTED TO PILLS.   Hence why he has drugs on his desk (pills) and why you can inject yourself with the hallucinatory drugs during the operations. If you still feel like I don't know enough about this game, I can tell you that I have all of the achievements :/  I definately reccomend this game, it's long, it takes a while to learn, and it's fun. Slamming radios into people's ribcages is fun. Drilling a hole in your patient's head is fun. Making your patient a timelord is fun. Getting every mission A++'d is fun.  This game is fun. I reccomend it especially with the new update for the anniversary coming out.",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013 is a massively enjoyable indie game and brings a new meaning to the word 'original'. The never seen before gameplay style is a fantastic novelty and matched up against the hilarious content, visuals and audio brings a new experience to gamers which you will no doubt have fun with. The one thing that this game does lack, however, is content. With just a few hours of purely original content available to the player, there isn't a great deal to do. Luckily for the player, the mechanics and style of the game make it such an enjoyment to replay that you can get hours of fun from repeating operations.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "Damn. I am at the last year of medical school, done a lot of procedures and some operations and I think it is easier to do these cases on real ppl",
            "review_score": "1"
        },
        {
            "review_text": "I've been inspired to attend medical school several times in my life. Once, on a sunny spring day in grade school biology, I eagerly tore at a nugget of owl droppings. Then I moved on to the frog dissection. There the frog was, splayed out on the table, its limbs pinned down and ready for some scalpel action. A chance I had been waiting for, to cut some intestines open, a snip there, a stitch here, and 'voila!' the frog would be healed from its current state of death, and it would go hopping off into the stream by the soccer field. A skillful procedure done with nerves of steel and a steady hand.   The abdominal cavity of said frog was some parts liquified, jelly-fied, and stank of formaldehyde. I didn't know what was what, or how the damn frog died in the first place. Thoughthe spaghetti-like mess of bowels covered my hands, I kept on cutting. Years later, I wondered if this is what Dr. Troy from Nip/Tuck felt on the day of his first scrub-in during his 3rd year surgery rotation. My own private practice plastic surgery center was in sight, with the lambo sitting outside. Finally, the last organ plopped out of the gaping incision... the frog remained dead with guts everywhere. I ended up with a D+ in biology that year.  That's what playing Surgeon Simulator 2013 felt like.",
            "review_score": "1"
        },
        {
            "review_text": "I can open a guys head with a spoon but cant eat anything.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Offensively raw humor and never a dull moment when playing. Challenging achievements with significant replay value. A must buy even at the asking $10",
            "review_score": "1"
        },
        {
            "review_text": "Hard as hell, fun as S***!!! Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "i love this game you should play it",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazingly fun game. But it is so ♥♥♥♥ing hard. Still, it's worth $20, and is sold for $10. A must-have.",
            "review_score": "1"
        },
        {
            "review_text": "Now i fear hospitals      10/10",
            "review_score": "1"
        },
        {
            "review_text": "In Japan, heart surgeon. Number one. Steady hand. One day, Yakuza boss need new heart. I do operation. But , MISTAKE! Yakuza boss die! Yakuza very mad! I hide fishing boat, come to America. No English, no food, no money! Darryl give me job. Now I have house, American car, and new woman. Darryl. Save. Life. My big secret: I kill yakuza boss on purpose. I good surgeon. THE BEST!",
            "review_score": "1"
        },
        {
            "review_text": "It's better than the Bioshock. The story of it.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT? A REVIEW AT 32 MINUTES???  Yep. WHAT THE HELL? 'cause, I wanna' share.. now ♥♥♥♥ off or listen. Ok, this.. is.. funny!!!!!  This game with its DLC is currently at 12$ USD and its worth it allready. I found it when I saw a friend post a pic about Ampu Tea.. both are the same genre... more or less. This game has really fun graphics. The start of the game in your office is funny in itself. The situation is funny. Organs flying around when you drop them is funny. Losing your watch, or dropping tools in the patient is funny. NEGATIVE: Its hard as hell. For me it was a BIG plus to remap my keys for my fingers... see, you control each finger individually with keys.. mine are a s d f, and your thumb is space. Mouse controls the up / down and forward / back. It will take some practice to not kill the patient, or even finish the operation.  SO: I am loving it. It actually stressed me out after two failed surgeries, so I took a step back. ( but laughing the whole time! ) Overall.. a good find IMO.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game it might give you some rage but at least try to play the game and you will like it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious! The absolute mayham is funny not because it's trying to be funny, but that it is just IN-YOUR-FACE WTF moments. The first thing to mention is the controls. Genius! Takes a while to get used to, but that's part of the fun! The acheivements have little comments about pop-culture that will make you chuckle, but some of the best things happen in the reception desk. Try and pick up the phone sometime, and you'll get a funny call from one of Nigel's friends. The best part of this game is the surgeries. 'Takes someone's lungs, intestines, and ribs to replace a heart. I think the patient will live.' The absolute neglect of carefulness with the patient (Bob) is hilarious. But hey, you can lodge a drill into a guy's skull, and that's always fun (I am not a murderous psycopath)! I highly reccomend this game. Best Simulator I've ever played. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I lost my watch in the patient. Demanded the watch back. Was Denied. Smashed patients face in with hammer.   But in all seriousness, they really need to fix that. I am SICK and TIRED of all of my watches being lost in these patients rib cages. I NEED that to tell me what time it is.",
            "review_score": "1"
        },
        {
            "review_text": "this is a rage game but its really really fun i recommend it 100% buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever! Better than any old RPG like the Elder Scroll Series!  Final Fantasy should learn from this...Last of Us, best game of the year...please don't make me laugh. This game surpasses both genres easily. Seriously guys, uninstall your League of Legends and Dota and play this game instead!! You think those are MOBAs, this is true MOBA!  For those of you fighting maniacs, Marvel vs Capcom, Tekken, and Street Fighter, you haven't played a true fighting game if you haven't fought for your patient's life in Surgeon Simulator!  What is Hearthstone...where is the heart?? Surgeon Simulator contains a real heart! Plus, it uses more imagination than Minecraft!! For those of you who hates your children playing violent FPS games like COD, buy this game instead, as it will teach your children to help save people instead of brutally murdering their brains out!  This game has a better ending than Walking Dead! Because you will experience the Walking Live!!!  You like Sims?? Then how about you try surgeon SIM- ulator!! :&lt;   Do you know who you are paying that enormous amount of money when you die in GTA?? IT IS NIGEL BURKE you are paying! Wish you can be like Yoda?? Well go in space to perform surgery and you can use the Force!  You want to save a princess like Mario? Why would you when you can save BOB!  Want to be like Le Bron? Throw a brain into a skull!   Half-Life and Portal - make way for Surgeon Simulator 2013!!! This game should even be remade in XBOX ONE and PS4!  I think that STEAM made a mistake of putting only three genres for Surgeon Simulator. Any genre you can think of, it's there! Romance - steal the heart of your patient! Multiplayer - take turns with your friends! Even racing - you need way more speed than Need for Speed!!!  Buy SURGEON SIMULATOR 2013 game now! Why would you want to buy anything I listed before?? And don't buy it as gift..put it in your library NOW...before it's too late :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, nuff said. It looks very polished, can get infuriating at times, but that's probably part of the charm.  For it's looks, style and polish, 9/10 Gameplay, 8/10 Story (or Comedy), 7/10   Overall 8/10, fun game to play with friends The TF2 'Easter Egg' was also pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": " A funny but frustrating game!",
            "review_score": "1"
        },
        {
            "review_text": "Ever watched House and wonder, man this look pretty easy. But then after thought to yourself 'But I don't want a degree' THEN THIS GAME IS FOR YOU!   Gameplay: You control one hand all fingers have keys. Controls take some time to get used to but after the first few ops you'll be fine. There are a nice amount of Ops you can do such as Heart Transplant, kidney transplant, brain transplant, eye transplant, teeth transplant. Yep ever wanted to smash a president rib-cage and give him a gold heart? This game is just for you.  Graphics/visuals: It's pretty standard looking for me considering I can only run this on normal sadly.  Bugs: This game is pretty buggy sometimes but most of the time it won't ruin the game. MOST TIMES...  8.5/10 Not enough presidents to give hearts to.  ",
            "review_score": "1"
        },
        {
            "review_text": "For a game your supposed to play for ten hours only and run out of fun, I nearly doubled that time and I'am still not bored at all. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 would kill again ;p",
            "review_score": "1"
        },
        {
            "review_text": "Ohhhhh, awesome game!! You are a doctor and you try to help the patient replacing his heart ASAP before he dies!! However, the controlling is too difficult !!!!!.",
            "review_score": "1"
        },
        {
            "review_text": "'oops, that vhaz not medicene!'",
            "review_score": "1"
        },
        {
            "review_text": "Somehow makes body horror hilarious. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "THE NURSE WON'T STOP CALLING ME GOD DAMNIT!",
            "review_score": "1"
        },
        {
            "review_text": "I find it very boring and didn't meet my expectations",
            "review_score": "-1"
        },
        {
            "review_text": "Its...its kinda like bearded girls...I don't know why I love them, but I do....",
            "review_score": "1"
        },
        {
            "review_text": "Not for everyone. The controls are impossible even when you are really, really, really trying, but that is what makes it hilarious. I recommend it, but not at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Be a Doctor! Be a Surgeon! Be a Murder! Be Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "This is good... Oh, don't worry Bob, ima keep ya safe!",
            "review_score": "1"
        },
        {
            "review_text": "I a cool game but is too hard to play :(",
            "review_score": "1"
        },
        {
            "review_text": "Not for everyone. The controls are impossible even when you are really, really, really trying, but that is what makes it hilarious. I recommend it, but not at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Just downloaded Surgeon Simulator: Anniversary Edition. Had a quick go for about ten minutes. I think this game is going to be very addictive. I look forward to not being able to turn it off!",
            "review_score": "1"
        },
        {
            "review_text": "You can't really go wrong with a game allowing you to do brain surgery with a hammer and cordless drill (while under the influence of a hallucinogenic drug.)",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013 has shown me the ways of becoming a magical unicorn doctor. I believe I am now ready for the real world of medicine! Look out real doctors! I've been playing this game so much I can now NEARLY preform a heart transplant with my pinky up.  In all honesty, this game is pretty hilarious. Frustrating at times - but overall I would suggest this game if you enjoy laughing at yourself.",
            "review_score": "1"
        },
        {
            "review_text": "I've never loved a game that has made me as angry and furious as this one.",
            "review_score": "1"
        },
        {
            "review_text": "Surgery is fun. Go to a local hostipital, pick up a scalpel and cut into some person who's knocked out! Or, for you who don't want time in jail...you could purchase this game. Very similar to the real thing, trust me. I'm a doctor in prison.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a very pecient guy, this game is for you, If you are a guy like me that isnt the most pacient guy on earth, this is a game for you",
            "review_score": "1"
        },
        {
            "review_text": "Easily recommended. Very fun, and very frusting. At some points you might question yourself why you bought this game, and why you even live. You will at almost every point in a surgery want a refund, but a voice in your head will keep calling you saying, 'Jonathan, come back. I just want you to play me for the rest of your life.' Anyways, hope your experience isn't as terrifying as mine. If you're looking for an easy game, this isn't it. The iPhone/iPad version is a lot easier though. Be prepared.",
            "review_score": "1"
        },
        {
            "review_text": "I dropped my watch into some random guys open chest. Didn't get fired. #BestWorkerEvar   ",
            "review_score": "1"
        },
        {
            "review_text": "i liked watching this game. it was amazing and the app was ok. but when i bought this with high hopes i was let down. i move at the fast speed of a turtle they didnt tell you the controls and they are all over the place. this game deserves to be thrown in a hole and ♥♥♥♥ on. sorry my hopes were let down",
            "review_score": "-1"
        },
        {
            "review_text": "This game is as short as your meaningless life",
            "review_score": "1"
        },
        {
            "review_text": "I love this game it is the best sergon game you can find ",
            "review_score": "1"
        },
        {
            "review_text": "I accidentally INJECTED myself in the middle of heart transplant operation!  Poor Bob...",
            "review_score": "1"
        },
        {
            "review_text": "SS2013 might be the funniest simulator game I have ever played. Let's say... 17/20 !",
            "review_score": "1"
        },
        {
            "review_text": "You can't really go wrong with a game allowing you to do brain surgery with a hammer and cordless drill (while under the influence of a hallucinogenic drug.)",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013 is the dark and gritty tale of Nigel. Nigel is an ex-surgeon who gambles away all of his money on internet poker, and is violentely thrust back into the dark and traumatic world of surgery to pay off his debt. This game features Gore filled and riveting scenes such as Nigel preforming heart surgery, heart surgery in an ambualnce, heart surgery in space, heart surgery on an alien, heart surgery on the Heavy, and much more. If you're tired of all of the crap that the games industry has put out and are in need of a dark, shocking, emotionally powerful, and overall graphically stunning masterpiece that will make you question your own morals, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I ENJOY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so challenging and i so, so, so, so wonna play it when i have enough..........!",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding sim game, very enjoyable yet a new challenging experiance with a very sick sense of humor in what you do. One of a kind game, and the best surgeon sim you can find!",
            "review_score": "1"
        },
        {
            "review_text": "Remember being a babie? I don't. But this game is like being a babie again. You are forced to learn all these weird mussle spasm controlls. You are literaly FORCED TO PUSH A BUNCH OF RANDOM BUTTONS to kill someone with some drugs you accidently injected into yourself. Your watch will fall off. Try beating some guys ribs out of his body with some orange drink.",
            "review_score": "1"
        },
        {
            "review_text": "Just downloaded Surgeon Simulator: Anniversary Edition. Had a quick go for about ten minutes. I think this game is going to be very addictive. I look forward to not being able to turn it off!",
            "review_score": "1"
        },
        {
            "review_text": "One Word. Blood.",
            "review_score": "1"
        },
        {
            "review_text": "This game is verry fun , but keyboard so hard to control btw i love it :D",
            "review_score": "1"
        },
        {
            "review_text": "More like Cluster♥♥♥♥ ♥♥♥♥♥♥♥t simulator, amirite? No, but seriously, this is good, stupid fun. It's like trying to masturbate on Ambien.",
            "review_score": "1"
        },
        {
            "review_text": "best hack n slash game",
            "review_score": "1"
        },
        {
            "review_text": "u ar e the giand ahdn and then you dhow a heart i n the brain transplant and then in the heart transplant si when to yth ing s come out of your armxz ir the brain and the nyou prefaein the transplant on yur aeeeeeeeea;ljkf and then a hamberger is on yuir shoulder and then u die. in all then all the ourter one s a neasdfdaslkjj bin cinder conmes and kill s uy and I rate thinss game 0/10000000000909090060-67p4532q054302995606095re984392wusdeuhjqwj zcxvhjfmdnx",
            "review_score": "1"
        },
        {
            "review_text": "This game is very Giuanni, nothing else.  Random, but still cake",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013 is the dark and gritty tale of Nigel. Nigel is an ex-surgeon who gambles away all of his money on internet poker, and is violentely thrust back into the dark and traumatic world of surgery to pay off his debt. This game features Gore filled and riveting scenes such as Nigel preforming heart surgery, heart surgery in an ambualnce, heart surgery in space, heart surgery on an alien, heart surgery on the Heavy, and much more. If you're tired of all of the crap that the games industry has put out and are in need of a dark, shocking, emotionally powerful, and overall graphically stunning masterpiece that will make you question your own morals, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "God this is a great game... Hilarious little game... Love it 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I dropped my watch in a man's stomach 10/10",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this game is one of the great games. There are plenty of funny things when you play this game for the first time. But sadly when you are done with the game and there is nothing to do else only get achievements and get everything on A++ expect TF2 update with Alien update, then the game shows you plenty of bugs like: 'That tool didnt attach to my hand and it is in my hand WTF?!' or like: 'how the hell I cant catch the tool in the space!!! My god damh fat fingers are pushing it away' :).  But though all bad bugs during my gameplay poped up, I would rate the game 87 of 100 and recommend this game to you because is sometiems so funny :) and worth to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Can this even be called a game?",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would replace a man's brain with a clock radio again",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game i like the Donald Trump dlc its funny and the normal game i played more then 4 hours in a day",
            "review_score": "1"
        },
        {
            "review_text": "i want a refund! i bought this game and ae dlc and they are terrible! lag is beyond compare and i cant control anything. my hand glitches through things. i cant play game its physically impossible",
            "review_score": "-1"
        },
        {
            "review_text": "It's a somewhat fun game highly rage inducing though not a game to be taken seriously at any point it's worth a couple bucks or if you can get it in a bundle",
            "review_score": "1"
        },
        {
            "review_text": "Imagine you are a 1 armed surgeon with little to no hand-eye co-ordination. This is that game.    Also, I killed Donald Trump  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game i like the Donald Trump dlc its funny and the normal game i played more then 4 hours in a day",
            "review_score": "1"
        },
        {
            "review_text": "Don't worry guys, I'm a certified Surgeon because of this game.  If you've always wanted to become a Doctor, Surgeon, or have a child who wants to be in the medical field in the future, then this is the game to get them. Trust me, it works as a way to help them get to medical school in the real life!",
            "review_score": "1"
        },
        {
            "review_text": "The concept is good, and while the game is hilarious because of the very bad controls I find the game difficult to legitimately play in a serious manner. If the game is cheap it's a worthy purchase because you can get some amusement out of it from time to time. I think the awkwardness of how it controls will kind of kill it for quite a few people, however. For that reason I can't really recommend it unless you're just looking to have a couple of laughs throwing stuff around awkwardly.",
            "review_score": "-1"
        },
        {
            "review_text": "Cheap af",
            "review_score": "-1"
        },
        {
            "review_text": "Screw people who think the controls are awful! (metacritic) the ridiculusness of the controls adds to the joy and bliss of playing this masterpiece! Once you get use to them its a piece of cake! we need an fps with controls like these!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game i think you should get this",
            "review_score": "1"
        },
        {
            "review_text": "best game i've ever played.   Gaurenteed to show you the basics on surgery and medical malpractice......",
            "review_score": "1"
        },
        {
            "review_text": "spent the first 5 minuntes trying to pull the guys face off 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Kill your patients as an apperently professionally trained surgeon.",
            "review_score": "1"
        },
        {
            "review_text": "best game i've ever played.   Gaurenteed to show you the basics on surgery and medical malpractice......",
            "review_score": "1"
        },
        {
            "review_text": "Featuring the worst controls of the century, this game is a must-play for everyone.  50% disgusting, 100% fun, it doesn't matter if you're taking it serious or throwing your pacient's lungs around the room, Surgeon Simulator 2013 makes sure you don't get bored.   *Occasional anger, frustration and anxiety to be expected while trying to find the right place to cut the intestine",
            "review_score": "1"
        },
        {
            "review_text": "This is trumperifically fun.",
            "review_score": "1"
        },
        {
            "review_text": "Piece of ♥♥♥♥ game. Not even worth a dollar. Why? --Terrible control.  --Game breaking bugs. --Poor Physics.",
            "review_score": "-1"
        },
        {
            "review_text": "Only get this game if you're looking for a laugh. Clumsy controls make for a frustrating experience.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, don't get me wrong.   But only for about twenty minutes.   If you've got the spare cash, and want a twenty minute fun 'game', I suppose this is for you. But if you're looking for a game that you'll replay every once in awhile, this isn't for you.   ",
            "review_score": "-1"
        },
        {
            "review_text": "this... game... SUCKS",
            "review_score": "-1"
        },
        {
            "review_text": "This is one game no matter how much I tried, could not get the hang of the controls. .",
            "review_score": "-1"
        },
        {
            "review_text": "*Sigh* I don't like this game. There, now that we got that out of the way I can review. This game is confusing for new players. I have only put 30 minutes in this because it is such a short game.It uses faulty controls as a gimic AND padding to make it go the game go longer. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "it's fun but after a while of playing it you never want to play it again",
            "review_score": "-1"
        },
        {
            "review_text": "Awful with awful pie... i don't like it but i can see why people do like it! 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Not everone's cup of tea,there are people that plays this game well;I on the other hand doesn't like it.The controls sucks,and grabbing something requires full mental focus.I'd suggest trying it out before buying it. Again,this is purely my opinion on the game 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "i smashed a guys ribbs with a hammer and trew his lungs out the back door of the ambulance. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Even if you get it for $1, it's a rip off. The absolute least fun game I've ever played. The challenge in a game should never be wrestling with the difficult controls. WARNING: Do not waste your time and money on this game!",
            "review_score": "-1"
        },
        {
            "review_text": "My patient was a whiny little ♥♥♥♥♥, so i gave him the bird then preceded to smash his skull open with a hammer. I then shook his brain in front of him.. Yeah you can see where this is going...   I then insanely threw it out of the ambulance along with any other vital organs i could get my hands on. Some would say that's unethical i say they're wrong!    10/10 would become a surgeon again!!",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed what Surgeon Simulator had to offer. It is challenging and often frustrating but that takes nothing away from the messy fun that is Surgeon Simulator. After all its not often you can play a drugged, negligent, maybe cannibal surgeon. But remember if you're not hammering away at a rib cage, or dropping office supplies in a poor most likely soon to be dead patient you just might be doing surgery wrong.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for $2 and it was not worth it. It's simply an exercise in frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "Surgeon Simulator is fun for the occasional giggle (or drunk party), but it is not a game I could easily recommend to anyone. Its novel appeal dies shockingly quickly, even considering how charming it is. At the end of the day, Surgeon Simulator does more to frustrate than provide an enjoyable experience. 6.7/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Its fun buy it",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game! We don't really know what we should do, what tools to use ... The controls are really ♥♥♥♥, or maybe it's me who is wrong. The first operation is already too hard for a start, the second .. this is where I stopped to play. I bought it for 2.49€.. Fortunately!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game was fun for a bit. It was very hard getting past the first surgery but it felt good when I did. Hey. it was worth my 2.50. I laughed pretty hard at some parts.",
            "review_score": "1"
        },
        {
            "review_text": "bad horbile dont understand so many bugs",
            "review_score": "-1"
        },
        {
            "review_text": "Ever wanted to play surgeon who had a stroke and can hardly control his one working hand? Stop dreaming and buy this damn game! Best played with alcohol, and friends.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, though I would not recommend getting on windows 8.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS SOOO HARD EVEN WHEN I GOT THE HEART OUT HE JUST DIED WTF!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is escapism turned up to 11. Use two hands IRL and half your keyboard space, plus your mouse, just to control one hand that doesn't even have a full motion range. Sound ridiculous? It is. Oh so hilariously ridiculous...  This is a game for those with a very broad sense of humour, or a well-hidden sadistic streak. When you tear out Bob's lung with a hammer, you have to either laugh, vomit or smile inwardly with sadistic glee. If you chose option one or three, then Surgeon Simulator is well worth the pricetag. If you chose option 2.... then don't watch the trailers.  The gameplay is really really hard to describe adequately; but it's like the drinking game version of the boardgame 'Operation'. Basically, you're taking bits out of Bob (all three patients are apparently named Bob), and then you put a couple of bits back in. All on two time limits - an actual clock, and the 'hard limit' of how much blood Bob can phyiscally lose before he/it dies.   And Bob will die a lot. Sometimes you'll even get an achievement for killing him. But there are a lot of 'oh great the drill is stuck in him, I'd better get the hammer to pull it out... great, now the hammer is stuck too, hand me the circular saw'. Eventually you get an understanding of how each tool works and how each body part works; and after a messy time learning all these things you can start performing surgical feats.   This game requires a mix of thought, motor skills, practice and patience. The patients, fortunately, are provided - make no mistake, if you tried performing surgeries in this manner IRL you *would* be going away for a long time. In fact, the thing you can leave at the door is realism - a working knowledge of anatomy may be helpful; but I'm thinking more of the kind of knowledge a butcher has than that of a medical professional. If you are a medical professional, leave all that Hippocratic Oath and 'duty of care' stuff behind in Surgeon Simulator; at least to begin with. One day it will come in useful as you make precision moves to complete the surgery, but in the early days it's just a case of beating and stabbing the internal organs around until they fall out.  I do reccomend this game as a casual, light-hearted bit of entertainment. Some people may like to take it further and develop the skills to be a 'pro surgeon', but a lot more players will just enjoy stabbing poor Bob with a drill. And that's an entirely valid way to play Surgeon Simulator; you can get all your money's worth and more out of that kind of slapstick 'hmm I wonder what happens when I...' messing around.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for oh so long, but the terrible collision does not get overshadowed by the comical glitches",
            "review_score": "-1"
        },
        {
            "review_text": "I could not want to play this game less.  After getting use to the loose (read: gimmicky) controls, you enter into you first surgery, a heart transplant. Step 1: crack open the rib cage as destructively as possible while also not causing massive internal hemoraging. While not causing your patient to bleed out is simple enough, cracking a rib cage with a hammer (or the less preferred bonesaw or dremmel) by controlling a flimsy wrist with the x and y axis on the mouse is frusturating and, worse, boring,   By my fifth try, I made it to the heart with my patient losing blood only at 3ml/s, but I felt nothing. No risk, no fun, and no pride in managing to become familiar with bad controls that were intentionally created to be bad.  It's like Demon Souls...if it were programmed by the old Titus team that made Superman 64.  Wait until it's on sale for $1 USD and then make sure you don't need that dollar for a pack of chips from a vending machine.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good and fun game. Awesome easter eggs and nice gamplay!",
            "review_score": "1"
        },
        {
            "review_text": "Fun for oh so long, but the terrible collision does not get overshadowed by the comical glitches",
            "review_score": "-1"
        },
        {
            "review_text": "I have one word to describe this game:   'BUGGER'",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is definitely an 'experience'. Most will likely find this game rather shallow and pointless, but as-it-is can be quite fun. I personally came into very skeptical but once booted I realized time had flown by and I was hooked messing around in someones body as chunks, bones, and tools went flying aroudn the room  My biggest frustration didn't reside with the completely intentionally absurd controls, but with the total lack of instruction of what to do next to perform a 'surgery'. Even passing the first surgery was a struggle only because it wasn't clear what was needed to be done. Maybe this was intentional, but on top of the wacky control system, this added an unneccesarry challenge I believe.  This will definetly not be a game for everyone, but if you have spare time and want to try something way out of left field, it can be worth a go for a bit. Don't expect it to be a long term satisfying game though.",
            "review_score": "1"
        },
        {
            "review_text": "Were this a 'calm player-objective driven sandbox' game where you could be fooling around for the most part, I could recommend this 'game' to be purchased. However, what we have in hands is actually something that tries to be as 'arcade' (read: pick-it-up-and-play-for-the-high score) as possible; and for the most part there is also only single solution, because of reason called 'developers dictated so'...  Controls aside, which have been already bashed enough already by others, there are some far more 'bugger' issues with this title. It all mainly comes down to both the limitation where hand/player can go around and the level layouts: Were one to drop the needed 'ingredient' or tool into floor, there is no way to retrieve these aside restarting the stage / 'murdering' the patient. Same thing happens when you accidentally push items far too away from your reach when 'magnet'-fingers of the player-hand fails to 'activate'. Then there are simply the item-layout causing huge problems when trying to achieve the main goal; either player-hand cannot be lowered enough due wrist boking into something and halting the decent. Or otherwise there are solid non-movable object preventing the operations itself.  The much advertised 'Meet the Medic'-stage is guilty of all the unplayability faults mentioned (and many other faults): Good luck    All in all, I certainly don't recommending to buy this game (at least alone). But otherwise if for some reason one gets this game to their collection, I for one certainly hope the player is going to face less of the bugs and such (Use bonesaw on ribcage -&gt; lungs phase through &lt;- ribcage still being intact, to name latest bugs I encountered alongside scalpel-immune innards).   On a random side-note, I've yet to still see or hear any other surgeon-sections or whole games that actually are not only more or less realistic, but fun to do than 'Life &amp; Death'-series (flawed, and certainly far too ahead its time) and that one 'mini-game' in 'Chaos Break' (which for goodness sake was sort of like more-actiony 'Resident Evil', but with non-Earth-invading-cretures (and first introduction to sudokus to me (*I was doing sudokus way before they were cool*)). I can always keep wishing and forget that 'Trauma Center'-series was a thing (aside music of course, but that's the 'unfortunate' thing with various not-so-good-things; music alone for the most part is far better than the product it was shipped with)...",
            "review_score": "-1"
        },
        {
            "review_text": "A frustratingly fun game that will, despite the amount of swearing I did trying to control the one hand your are given that can only move in a claw machine like fashion, entertain you if you are bored and don't really have anything better to do.",
            "review_score": "1"
        },
        {
            "review_text": "For every doctor-to-be the right game! After that game you can definitively operate on a human being.",
            "review_score": "1"
        },
        {
            "review_text": "This is a simulation game where you are Nigel Burke who operates on a surgeon named Bob. This is a game that is not one of the most realistic games but certainly humorous or disgusting. You can heart transplant him, make him pee blood with the kidney transplant or smash his skull in the brain transplant. The game is very amusing in many ways, especially the amublance mode and the space mode. If you like the Heavy, you can become the medic and perform an Uber Heart Transplant. This game is like Trauma Center True Blood and Surgery Simulator 2011, but if you want a amusing one where your stomach may churn, this is for you.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Who doesn't love throwing unnecessary organs out of the back of a moving ambulance?",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious and challenging. Very fun to play with friends. Now with the updates theres a ton of content and surgeries to do. Definetly an easy buy for me.  Gameplay: 9/10 Concept: 10/10 Graphics: 7/10 Sound: 6/10 Replay: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy it. Just don't. the controls are awful. It's rage inducing and should only be played if you want to get a reason to hate everything but put into one game. The blood mechanic as interesting of a concept it is, Is broken on some of the surgery missions.  Example: Heart surgery while on a ambulance. Not only is the chance to loose important items the worst mechanic ever implemented into this, I had several times where the blood-rating drops even thou it is on 0.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel i'm fully capable to perform surgery now. Who wants to be my patient?",
            "review_score": "1"
        },
        {
            "review_text": "A perfect simulator of the American healthcare system.",
            "review_score": "1"
        },
        {
            "review_text": "This game will ruin your life 10/10...",
            "review_score": "1"
        },
        {
            "review_text": "You cna dig around in the insides of the meat sacks so you can scope out your dinner. Great educational game for kids on what parts of the body to eat and what parts you don't. 8 Cannabalistic Whoopie Godlbergs out of 10 mutilated orphans.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ you patient. take this scapel",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes pulling out some guys intestines can make you think about chicken   Maybe they taste like chicken...",
            "review_score": "1"
        },
        {
            "review_text": "Great waste of time with friends, ESPECIALLY WHEN YOU GET PAST THE RIBS!",
            "review_score": "1"
        },
        {
            "review_text": "Ah Surgeon Simulator 2013. A very fun and funny game 'Doctor you shouldn't be pulling on the patients' SHUT UP NURSE! I KNOW WHAT'S BEST! Anyways.. Yes it's a fun game. You play as a surgeon named Nigel and you go through many surgery's. For example. Heart transplants, double kidney transplants, brain transplants. Then the same 3 in an ambulance. Or you could tackle the newly added Meet The Medic mode where you play as Team Fortress 2's lovely german medic. And you have to give a heart transplant to the heavy (you even have to get the big heart and put the uber thing in it then uber the heart). Overall there's plenty of things you can do in this game and there's plenty of achievements for it. I love this game and will spend plenty of time playing it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's... definatly unique.   ...  Patience, practice, and adjusting the mouse sensitivity as works best for you are all very important parts of this game.  I recommend it mostly because I think everyone should be just as frustrated with it as I am, beecause it's that fun sort of frustration that you want to share. No really.",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought this game was clunky and annoying. However I shortly discoverd it's increadible humour and found it to be very enjoyable. Now after hours of endless playing, I have added this game to my list of greatest games of all time!",
            "review_score": "1"
        },
        {
            "review_text": "I actually want to be a doctor. So this is my training experience :D",
            "review_score": "1"
        },
        {
            "review_text": "i would buy this game if you havn't already, besides the fact it runs slow on my one terra byte computer its really good 5 stars",
            "review_score": "1"
        },
        {
            "review_text": "silly game except the fact you need a monster pc to play it dont get it unless you have a alienware 7/10",
            "review_score": "1"
        },
        {
            "review_text": "so bad controlls!",
            "review_score": "-1"
        },
        {
            "review_text": "Surgeon Simulator 2013 - The game of all games.  Can't find a scalpel to gouge out some poor bloke's eyes? Just use a pencil instead!  But why use a scalpel, when you can use FRIGGIN' LASERS!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I performed a wristwatch transplantation to the patient. He'll never know.",
            "review_score": "1"
        },
        {
            "review_text": "This is like the guy from QWOP got a medical degree. It's impossible to control in anything resembling accuracy, but it's a hilarous time waster all the same. The achievements are also fantastic, and do a lot to add more stupid fun to the game.",
            "review_score": "1"
        },
        {
            "review_text": "Awful game controls are very hard to master and tutorial doesn't help much. Waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Too hard, I keep dropping my tools and I can't get them out of my patient!",
            "review_score": "-1"
        },
        {
            "review_text": "I had a life long dream to be a surgeon. But thanks to my Parkinsins and colorblindness, I was unable to acheive this goal. However, Surgeon Simulator has given me the opportunity to know exaclty what it is like to be a surgeon. Before, I had only operated on small marsupials. So I can't say for sure this is similar to the experience of operation on an actual human. What I can say is that from all of the Scrubs and Grey's Anatomy I watch, this is as close as you can get to real surgery without actaully putting someone's life in extreme danger.   I give this game 6 used band-aids.",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks It was not worth the money I paid and its a dissapointment.",
            "review_score": "-1"
        },
        {
            "review_text": "Made a scarf out of his guts then transplanted his kidneys. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "To me anyways, it's a Rage Inducing Simulator! Great game, just makes you rage a lot. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013 - The game of all games.  Can't find a scalpel to gouge out some poor bloke's eyes? Just use a pencil instead!  But why use a scalpel, when you can use FRIGGIN' LASERS!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "9/11. Would operate on Domeld Romp again under the influence of LSD.",
            "review_score": "1"
        },
        {
            "review_text": "A B@#$'s Hard game that want's you to fail!  Teach Surgeon #1678bsj0k3 how to get his shaky hand problem under control, And to save bob's life from his Gut and life threatening cheeto habit, Find more Next time on House MD: Gaming edition",
            "review_score": "1"
        },
        {
            "review_text": "There's not very much content and the controls are terrible. It's not really a simulation. It's supposed to be silly and outrageous, but ends up just not being very fun.",
            "review_score": "-1"
        },
        {
            "review_text": "OMG SUGERY SIMULATOR BEST GAME EVER. IT'S THE BEST WHEN YOU HIT HIM IN THE FACE WITH A HAMMER.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to this game I now know how to perform real surgery. I'm gonna try this out on the next hobo I see. Thanks Surgeon Simulator!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best get if you get the DLC for it",
            "review_score": "1"
        },
        {
            "review_text": "RThis Game is the best in the world to me i can just sit there playing it for hours and hours and still not get bored but its realy frustrating for my because iv got a slow laptop so it lags a little bit but i just put qualitys to medium and it works so Im giving a HUGE Thank You! to Bossa game studios for making this its very very very very [1 Million Years Later] VERY VERY FUN!.",
            "review_score": "1"
        },
        {
            "review_text": "The absolute worst game i've ever had the displeasure of trying to learn the controls of. Even remapping the keys didn't help this clunky, poorly designed travesty.",
            "review_score": "-1"
        },
        {
            "review_text": "i killed a man and a lung flew towards me as sad music played  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the most amusing game on Steam today.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 'Don't worry, i am a real doctor!' *proceeds to slash open his eyes and cut open his ribcage with a ♥♥♥♥ing hatchet*",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most fun games I ever played, its funny and addicting, I hope they make more updates and add more levels, they should also add co-op!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a piece of garbage. This is the most poorest excuse for a video game if I ever played one. I'm stuck on the Double Kindey transpant in the Ambulance since every godamn time I got close to beating it, one of the ♥♥♥♥ing kidney would phase the the bloody Ambulance. I once saw both fresh kidneys sitting on the table from a bump, I was cutting out the final kidney and the next moment later, one was gone. ♥♥♥♥ing hell. This game isn't hard because of me just sucking at it, it's because the developers have made it so that everything will try to stop you from doing the surgery. The glitches are the biggest problem and I there was a patch so that the previouly mention glitch was fixed or all of them in general, then that would be great but as of now, it's a pile of ♥♥♥♥. Don't buy this game unless you like being tortured throughout the entire game or if you're a YouTuber who's watchers like you freaking the ♥♥♥♥ out about how much this game sucks ♥♥♥♥.  If you can't be bothered to read that, here's just a list of Pros and Cons Pros -Nice Soundtrack -Ineresting Ideas -Moment of Achievery from beating surgeries -Funny Moments Cons -Annoying as ♥♥♥♥ Glitches -Glitches that can make some surgeries nearly impossible -Those annoying ambulance surgeries -Hard to get used to controls -Weird Physics Engine -Infuriating Gameplay You may like it but as of now, I don't.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh gosh! This game pulling my nerve out...  Update: Do you know what did it take for me to complete the 1st level ? &gt;5 hours of trials &gt;yelling and swearing &gt;finger ache &gt;terribly hot CPU  I hate it the most but I LOVE it! Give a it shot babe! and challange yourself. Tell the world that you're the most persistent drunk surgeon!  Note: I hate using mouse and using trackpad all my life.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the sense of realistic surgical operations, i disliked the fact the the hand is so damn shaky! I would not recommend this game to others",
            "review_score": "-1"
        },
        {
            "review_text": "A perfect simulator of the American healthcare system.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to smash bones with a fire extinguisher? Well then this is game for you",
            "review_score": "1"
        },
        {
            "review_text": "Hi, This game is really funny because you can mess about and stuff play around even try out the new Alien transplant really fun",
            "review_score": "1"
        },
        {
            "review_text": "first game i had on steam and i love it a lot ",
            "review_score": "1"
        },
        {
            "review_text": "How to lose medical license simulator 2013",
            "review_score": "1"
        },
        {
            "review_text": "I TOOK IT AND THROUGE ON THE GROOOOOOOOOOOOUND(throws the phone of the desk in office)",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely horrible. Bad controls, If you happen to get an instrument in your hand, you can't control it properly. Who ever thought this was a great game on ratings lists needs to have their brain examined by me.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the hole following adds and its very much secrets. Its a kind of ,,Entertaiment,, and also very funny with more peope. very,VERY GOOD!",
            "review_score": "1"
        },
        {
            "review_text": "Coolest game ever! I played it and I beat the TF2 part and it's a good simulator! Truly a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon simulator is for medicine what porn is for sex ed.",
            "review_score": "1"
        },
        {
            "review_text": "Check it out its fun!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Harding Control",
            "review_score": "1"
        },
        {
            "review_text": "it wasn't responding it worked once",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing can be more entertaining than ripping a patient's organs out of his body with bare hands. Dang that brain, it doesn't want to come out! Maybe this drill can do the job...",
            "review_score": "1"
        },
        {
            "review_text": "I hope my appendix was removed in a different way..",
            "review_score": "1"
        },
        {
            "review_text": "This is fun and very dificult but very fun to mess around in! :D",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately I went into this with something totally different in mind. I can definitely see the appeal for anyone who likes to kill time (no pun intended) doing infuriatingly difficult -- though somewhat entertaining -- tasks. Was I expecting an *actual* surgical simulation? No, not really; and to be honest the sound and blood effects are pretty entertaining on their own. I guess ultimately my disappointment arises from the fact that the sole purpose of the game really seems to be simply the fact that the surgeon's hand is incredibly imprecise and difficult to control. Yes, I can see to some degree the comedic value of accidentally knocking a jar into the patient's chest cavity or stabbing them in the heart when you meant to cut their esophagus, but at some point I had to ask myself, 'Am I playing this because I like fighting the game's insistence on not doing what I'm trying to control the hand to do, or because I like figuring out how best to perform the surgery and manage blood loss?' I will tell you that the game overwhelmingly shifts toward the former, and I realized that the vast majority of the time wasn't spent figuring out how to do the surgery and keep the patient alive, but simply and almost solely trying to control the surgeon himself. I got about halfway through before I decided I was tired of fighting the game itself rather than actually playing it. I guess I don't understand why the devs decided to put all the effort into developing decent graphics, sound effects, music, interface, etc., then phone it in on the controls.  If the point is the lack and difficulty of control, then I guess that wasn't something I understood going into it. So if a game based on fighting with the controls to manipulate an extremely difficult to maniuplate broken robotic quasi surgeon hand, then this game is for you. If that sounds like it would be a bit frustrating and unfulfilling, you'll want to pass on this game. I can assure you, the comedic value quickly gets replaced with frustration, annoyance, and regret at having spent the money.  6/10  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game combines cerebral palsy induced arm flailing hilarity and extreme frustration in such a perfect way that makes it a truly satisfying experience.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a good idea and I can understand why people might enjoy the game. It gets far too frustrating far too quickly for my tastes though, especially since it doesn't even give you a hint on how to perform the procedures.  4/10 Having to google how to beat the first level? Not enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Took out the rib cage barehanded... Smashed the heart out of the place with a hammer... Blinded myself with the laser... I got high then electrocuted... Threw the good heart out the ambulance...  9/10 will do the surgery again.",
            "review_score": "1"
        },
        {
            "review_text": "Bob Was Dead 2 Years Ago",
            "review_score": "1"
        },
        {
            "review_text": "difficult..... Need a controller to play relatively easy",
            "review_score": "-1"
        },
        {
            "review_text": "Well, playing this game made me realize one thing. I can never be a surgeon! That goes away my dream of being a top surgeon!  ",
            "review_score": "1"
        },
        {
            "review_text": "WORST Game I've ever played. Do not buy this - seriously. Wasted money and time on a ♥♥♥♥ game like that. If you are into boring controls and NO gameplay then buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "Its ♥♥♥♥, torrent it.",
            "review_score": "-1"
        },
        {
            "review_text": "I dislike the controls like how a, w, e, and r are the hands along with space.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want to kno wwhy you can't be a real surgeon - this game is for you.  The controls make you feel like a total ♥♥♥♥♥♥ who has no control over your own hand. Spend a good 10 mins knocking stuff around the table at the start menu! What fun! NOT!  Will delete the local content off and regret spending money on this crap!  DO NOT BUY THIS!",
            "review_score": "-1"
        },
        {
            "review_text": "The worst game ever, you know why because you cant pick things. And especially in space !!!",
            "review_score": "-1"
        },
        {
            "review_text": "Bit of fun for about 5 minutes, quickly gets incredibly reptitive, dull and frustrating. Not worth price. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "9/10  This game has a lot of secrets. There is such as the Alien Surgery, Space Surgery, TF2 Surgery. I like how this tries to be hard, but once you learn the stradegies and learn the basics, this game could be fun. The game can be hard at times but like I said you just have to live and learn.     ░░░░░░░▐█▀█▄░░░░░░░░░░▄█▀█▌  ░░░░░░░█▐▓░█▄░░░░░░░▄█▀▄▓▐█  ░░░░░░░█▐▓▓░████▄▄▄█▀▄▓▓▓▌█  ░░░░░▄█▌▀▄▓▓▄▄▄▄▀▀▀▄▓▓▓▓▓▌█  ░░░▄█▀▀▄▓█▓▓▓▓▓▓▓▓▓▓▓▓▀░▓▌█  ░░█▀▄▓▓▓███▓▓▓███▓▓▓▄░░▄▓▐█▌  ░█▌▓▓▓▀▀▓▓▓▓███▓▓▓▓▓▓▓▄▀▓▓▐█  ▐█▐██▐░▄▓▓▓▓▓▀▄░▀▓▓▓▓▓▓▓▓▓▌█▌  █▌███▓▓▓▓▓▓▓▓▐░░▄▓▓███▓▓▓▄▀▐█  █▐█▓▀░░▀▓▓▓▓▓▓▓▓▓██████▓▓▓▓▐█  ▌▓▄▌▀░▀░▐▀█▄▓▓██████████▓▓▓▌█ Doge approves of this game and gives it a 5/5.                     (Thumbs up for Sonic reference XD)",
            "review_score": "1"
        },
        {
            "review_text": "hydra support has pretty much never worked. devs said back in feb that they were working on it but instead they made another meme game about being bread.   if you can get it for under 4 bucks and just want to ♥♥♥♥ off, then yeah this is an okay time sink.  thumbs down because controls were bad",
            "review_score": "-1"
        },
        {
            "review_text": "I was able to kill the patient in 14 seconds.",
            "review_score": "1"
        },
        {
            "review_text": "Nigel pick up the scapel, Nigel, thats a pen for a easter egg &gt;I know its hard. NIGEL THE STUPID SCAPEL YOU DROPPED IT &gt;well i cant tell because i have no face stupid &gt;not stupid wait i am cuz im screwed up Nigel! the FREAKIN LASER! &gt;okay man okay stop just use the hammer on bobs rib cage okay? no Nigel thats a saw, &gt;yes no nigel the HAMMER! its right there! &gt;oh okay",
            "review_score": "1"
        },
        {
            "review_text": "The controls are so bad!",
            "review_score": "-1"
        },
        {
            "review_text": "You can slap trump with hsi own organs. What else do you need? Go buy the game.",
            "review_score": "1"
        },
        {
            "review_text": "'Oh, god! What have I done!?'",
            "review_score": "1"
        },
        {
            "review_text": "One of the best simulation game. I love the team fortress 2 mod! MEDIC!",
            "review_score": "1"
        },
        {
            "review_text": "Wow! This is the epitome of all simulator games. With true-to-life graphics, it is 'easy' to control. I bought this just to try it out, but ended up loving it. A minute to learn, a lifetime to master",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game when it was at the height of its popularity and thought to myself 'it doesn't seem that hard, I'll give it a shot'. Turns out, I can't figure out how to move my hand with a keyboard and mouse. I'll just stick to flesh and bone thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "the idea good.the game not good. it has the most ♥♥♥♥ed up movement system ever. waste of money. DO NOT BUY IF NOT ON SALE (by sale i mean that steam pays u to play the game)",
            "review_score": "-1"
        },
        {
            "review_text": "Ummm dont know why did i buy that game. Well game is ok but in im not playing it",
            "review_score": "1"
        },
        {
            "review_text": "Good god, do not buy this game. For any reason.",
            "review_score": "-1"
        },
        {
            "review_text": "I saved a mans life with a radio buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this. You'll regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "  I think i just farted steam",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this. You'll regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "if real surgeory was like this....we would all be dead. Surgeon Simulator, for some reason bodies don't need lungs anymore to live XD nah in all seriousness its a pretty challenging game and reguires alot of concerntration and paitence and carefullness but it can be very very funny as well. 9.5/10 not a game I'd like to keep playing but I still found it quite challenging",
            "review_score": "1"
        },
        {
            "review_text": "This game encouraged me to vote for Trump VOTE TRUMP FOR 2016 USA! USA! USA! USA!",
            "review_score": "1"
        },
        {
            "review_text": " &gt;how to make america great again &gt;buy this game ",
            "review_score": "1"
        },
        {
            "review_text": "While the regular missions are enjoyable, the TF2 and space ones are just plain horrible. The controls are absolutely crap, and the physics are worse than ET for the Atari 2600.",
            "review_score": "-1"
        },
        {
            "review_text": "it does fail it always says not respoding ",
            "review_score": "-1"
        },
        {
            "review_text": "Controlls are really awkward but overal the game is fun!  6/10 ",
            "review_score": "1"
        },
        {
            "review_text": "The novelty wears off very quickly. Buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A complete guide on how not to be a Surgeon. As engaging and fun as QWOP  WASD Athritis pains / 10  - 'basically carpeltunel syndrome and wasted potential.'",
            "review_score": "-1"
        },
        {
            "review_text": "for the price for this came...i guess i cant complain...its really hard to control the hand,so i do not recomend this game",
            "review_score": "-1"
        },
        {
            "review_text": "i put the heart in but it didnt count? ok  please program a better game next time",
            "review_score": "-1"
        },
        {
            "review_text": "I dropped my drill in donald trumps chest  I watched in delight   Would do again.",
            "review_score": "1"
        },
        {
            "review_text": "so hilarious i always drop a item in his body that shouldnt be in there but yeah i truly suck at This game but 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Less frustrating to dump quarters into the claw grabber at your local arcade.",
            "review_score": "-1"
        },
        {
            "review_text": "Best hallucination simulator  ",
            "review_score": "1"
        },
        {
            "review_text": "i have the surgeon simulator anniversary edition and it wont even launch.And i dont even get the white screen that pops up it just crashes PLZ HELP",
            "review_score": "1"
        },
        {
            "review_text": "This game Sucks i trying to call trisha i pressed the call button it did't work so This games sucks never play this game EVER ",
            "review_score": "-1"
        },
        {
            "review_text": "I hope this game looses a chromozome and lives the rest of its life as a vegetable. The first three operations are fun and normal but as soon as you get to the ambulance you want to kill yourself. I swear to god the ♥♥♥♥ing ambulance was being drove by an Asian 13 year old girl and its impossible to do anything.",
            "review_score": "-1"
        },
        {
            "review_text": "are you srs, theres no abortion simulation yet theres a donald trump surgery.  0/10 i cant believe this game is pro life.",
            "review_score": "-1"
        },
        {
            "review_text": "I r8 8/8 m8, I don't h8, it's gr8 I also r8 9/9 you should try it some time.",
            "review_score": "1"
        },
        {
            "review_text": "Buying this game is the most stupidest thing I've ever done in my life. Controls are ♥♥♥♥, mechanics are ♥♥♥♥, everything is ♥♥♥♥ with this game. No tutorial, no settings. And I don't ♥♥♥♥ing like staring at my fake palm closing my fingers for several minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "God awful controls. Unplayable. :(",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 - Ruined my life.   JK i hate this game.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is not funny and really bad and i dont know why i paid for it ok bye im writing a lot now see ya ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I WANT A ♥♥♥♥ING REFUND!!!!!!!!!!!!!!!!!!!!!! ",
            "review_score": "-1"
        },
        {
            "review_text": "So, it's okay to disect Trump, but not the ultra criminal Clinton? Real classy.",
            "review_score": "-1"
        },
        {
            "review_text": "You can flip the bird.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "awful game. Would be much better if the mechanics weren't ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "So hard to grab some tools but i finished the heart transplant",
            "review_score": "-1"
        },
        {
            "review_text": "I've had this game from the start and it wants me to pay extra for DLC which is from the mobile addition of the game? Why? Why not just give us the DLC for free?",
            "review_score": "-1"
        },
        {
            "review_text": "Early on I enjoyed haphazardly cutting away at bones. I enjoyed the addition of the ambulances, the hallways, and the other types of surgeries. I even dabbled in the TF2 one even though I have never touched that game. Donald Trump surgery is where I draw the line. I’m good with political jokes but this was too much. I liked the heart of stone vs gold… the makeup set made me sick... the miniature trump tower made me laugh. But overall I sat there thinking, this is a billion-dollar man who is running for president. PRESIDENT. The most respected chair in the United States. To dish out this kind of satire/criticism/whatever you want to call it so willingly is so remarkably sad. This is not based on my views on Trump alone, anyone running for the presidency should be respected and understood, not bashed by the public and media. Where is the dlc for Hillary Clinton, Bernie Sanders, Jeb Bush, Ted Cruz, Rand Paul, Rick Perry, Marco Rubio, Jim Webb, Darrel Castle, etc… This is poor taste.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS THE GREATEST SIMULATOR IN THE ENTIRE UNIVERSE! Get it right now. Do it. Go on. DO IT! DO IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "I just cant describe all the fun I had while playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game to play. I enjoyed it for about an hour on my own but it really shined for me when playing with friends around me and doing the most outrageous things we could to the patient. It was also a fun challenge to play with someone using the keyboard and someone on the mouse. Other than that, for me at least, the gameplay was incredibly difficult and I couldn't get past the second mission. It was easy to get the hang of the controls but I personally found it nearly impossible to beat any missions!  Overall Rating -&gt; 6/10  +Fun with friends +Easy Controls  -Impossible Missions -Gameplay gets monotonous after a while",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Grabbing hammers axes knives and then hitting things Well This is the game for you :D Very fun makes me angry but still fun :D",
            "review_score": "1"
        },
        {
            "review_text": "This game brought me one step closer to my dream of fisting dead bodies.",
            "review_score": "1"
        },
        {
            "review_text": "Rage left and right! Fun left and right! This game increases diffuculty as you ascend into the levels. you cant help but laugh when you fail!",
            "review_score": "1"
        },
        {
            "review_text": "Even though I've just started playing, I can tell that this game has a steep learning curve and less than optimal controls. However, after getting used to those, this game presents an enjoyable experience with a great deal of freedom and plenty of wacky antics to keep you occupied. While it is not necessrily a must-have, and may be more of an accquired taste, I would reccomend that you pick it up if it is on sale. You may just have a good time. If not, then it still would make good rage video fodder for your up-and-coming Youtube channel.",
            "review_score": "1"
        },
        {
            "review_text": "the most funny recent game",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is an overall wonderful game. The controls are difficult at first, but as you adjust to them the game becomes easier. There are a few bugs when picking up certain objects, such as the objects flinging across the screen or glitching out, but it is an overall fun experience. I highly recommend it if you have some time to waste.",
            "review_score": "1"
        },
        {
            "review_text": "ARRRGHH! Oh the Hours I've spent raging at this game! It's insane.... Insanely good, that is. If you buy this game, which you will, you will find yourself raging for ehhh about an hour or so. After you get the hang of the stupidly annoying controls, it starts to be fun! Surgery after surgery, succeeding, murdering, killing the most brutal ways possible, from hammering his organs to an axe to the face, or maybe stabbing Bob in his eyes with needles. Anyway, yes, it's a fun game, worth your money? I don't know, for me, yes definetely, but I can't say that for everyone. It's a game you'll either love, or hate. Remember, if you want to try out the concept of Surgeon Simulator, you can download the 48-hour GameJam version for free.  Pros- Much versetility in sergeon evironments Many achievements to aim for Many funny easter-eggs Secret levels  Cons- Stupid controls (which can make it fun though) Only 3 types of surgery (which, to me, seem to be ordened from hard to easy difficulty) 50% raging Does not come with first aid-kit to heal the wounds you'll get from raging.",
            "review_score": "1"
        },
        {
            "review_text": "You'd have better luck preforming an actual surgery than saving some guy here.  Pretty medically accurate tho.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really something else... Rip someones lungs out and replace them with a radio  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Brain surgery with a hammer. Would kill again.",
            "review_score": "1"
        },
        {
            "review_text": "The Game Isnt Too bad i guess and OH SNAP NIGEL IS IN MY ROOM !!!! AHHHHHHHHHH",
            "review_score": "1"
        },
        {
            "review_text": "I thought this was about fish and i was horribly disapointed. I wish there were a few youtube videos that featured this game but i couldn't find any.",
            "review_score": "1"
        },
        {
            "review_text": "I do not recomend this game, I cannot beat the first level because of some confusing controlls and annoying mouse sensetivity. you can also drop the heart which happened to me twice during the meet the medic and with bob, and it is extremely frustrating. It's extremely hard to get used to the controlls, and trying to pick things up.  this game is more of a game to play while friends laugh at you failing. which is pretty fun. I would recomend just watching markiplier play it. (It is kinda fun to play around with bobs lungs) 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Hahahahaha now this game is fun. REAL fun. Think to yourselves now; have you ever just wanted to cut someone open, mutilate their insides and wriggle your hand around in there? WELL NOW YOU CAN! With the all-new fratures of Suregon simulator, you can now have all the time for fun!(Opening people up and gutting them) and the best part: you don't have to clean up! Yes, this game is brilliant fun :D  ",
            "review_score": "1"
        },
        {
            "review_text": "the controls are really wierd",
            "review_score": "1"
        },
        {
            "review_text": "Be informed, this game is very diffcult. Its like the game qwop. Although its very diffcult it is also extremely addicting, and fun. I do recommend it if you like challenging games this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent sim. Just got in to med school and I can't wait to practice my new skills on real patients! Wish me luck!",
            "review_score": "1"
        },
        {
            "review_text": "Watched youtubers play this, and felt like I just had to get it!  Pros: The challenging aspect of the game is why you'd go for it. Expect to rage a little, but feel the relief once everything works out. Honestly, you get the hang of it after a while, so stick with it!  The idea of the game is pretty novel, to be honest! Usually simulators can be rather clunky and meaningless, but this one.. works just the way it is The music is pretty cool The achievements are quite fun to collect, and to aim for (A++ grades are no joke)  Cons: The tooth surgery for the ambulance can glitch out to a point where you are unable to complete the mission The corridor mode is pretty challenging, I cracked a few knuckles over that one. But it is the point (I guess)  All in all, this game is worth it, if you enjoy a rather unconventional game that kind of brings you to levels of frustration that is released by thrusting a middle finger in Bob's face, or by jamming a drill into his skull. I've done that so many times I should be arrested for manslaughter (haha). But still, this game is worth it, because gameplay is novel and with friends, the fun magnifies. :D Trust me, I'm a doctor.",
            "review_score": "1"
        },
        {
            "review_text": "What a pain in the ♥♥♥ of a game. Don't buy it unless you like spending countless hours not completing surgeries. It was amuzing for about 10 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "You play as FLIckface McGee, the drunk freebasing surgeon who sucks at surgery. Everyone depends on him because the rest of the surgeons are stoned off their asses. So he just murders all of the patients and no one sues because of this awesome legal loophole. and this is why surgeon simulator is an amazing game",
            "review_score": "1"
        },
        {
            "review_text": "how do you get the alien surgery because ive tried every thing ",
            "review_score": "1"
        },
        {
            "review_text": "GET IT!!!OR DIE :)",
            "review_score": "1"
        },
        {
            "review_text": "Got accepted into Harvard Medical School because of this.  10/0 Would operate again.",
            "review_score": "1"
        },
        {
            "review_text": "Less forgiving than Dark Souls! More realistic than Call of Duty! Bloodier than Bioshock Infinite! Better controls than Trespasser!",
            "review_score": "1"
        },
        {
            "review_text": "Would Recomend love the hell out of this you can get achivements left and right surgerys are hard but you can get past them  ",
            "review_score": "1"
        },
        {
            "review_text": "Firmly grasp it. Firmly grasp it. I SAID  FIRMLY GRASP IT",
            "review_score": "1"
        },
        {
            "review_text": "forgot to make half life 3 because i was injected with some sort of acid 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Worth it for the controls!",
            "review_score": "1"
        },
        {
            "review_text": "best game in the world ",
            "review_score": "1"
        },
        {
            "review_text": "Great game at the sale price. Tons of easter eggs and once you get decent at the controls, it becomes a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game may seem impossible to control but once you stick with it you can actually accomplish a lot. It seems like a joke but it's much, much deeper than you think.",
            "review_score": "1"
        },
        {
            "review_text": "Obama care caused this to happen to all the doctors in the world",
            "review_score": "1"
        },
        {
            "review_text": "It is a very nice game to waste some time with patience, incredibly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarioudly gory, death has never been funnier",
            "review_score": "1"
        },
        {
            "review_text": "Well i don't think i will be a doctor anythime soon.   SORRY BOB I KEEP KILLING YOU    Vote up if you don't want me to be your doctor and down if you do.",
            "review_score": "1"
        },
        {
            "review_text": "hard to figure out controlls",
            "review_score": "-1"
        },
        {
            "review_text": "It was neat.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody, yet recommended. When is S. Simulator 2014 Coming?",
            "review_score": "1"
        },
        {
            "review_text": "'Shh I doctor now'. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hillarious! Suprisingly good for a simulator XD",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "A great way to kill time in class!",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is, without a doubt, one of the hardest games I've ever played. On the outside, and from the various gameplay videos on the web, it seems fairly easy. However, once you get into the game, it is extremely difficult. It may just be that my depth perception is terrible, but the controls are difficult to master, and the tools are even more difficult. Either way, it is one hell of a time, and I recommend this game to those who are looking for a humorous challenge.",
            "review_score": "1"
        },
        {
            "review_text": "As it's on sale I would definatley buy it as it's original and is very funny to play!!+",
            "review_score": "1"
        },
        {
            "review_text": "I threw my keyboard playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "I say, 'Crap I dropped the electric blade in his abdomen' alot. Alot of fun for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "Hi, Im professor. PolioMcghee but you can call Me FDR or Maybe for short. This game is interesting especially when you the game doesnt think the awful music and the absolute terrifying hand seizure's werent enough to cope with, THEY PUT YOU IN A MOVING AUTOMOBILE WHILE THE DOOR IS OPEN! Although my points are negative towards the game itself, and kaiser permanente, the game is surprisingly fun to see how much your life would suck if you had polio in your arms.",
            "review_score": "1"
        },
        {
            "review_text": "GAME OF THE YEAR!!",
            "review_score": "1"
        },
        {
            "review_text": "Its a pretty hard game at first, but it starts getting easy once you get the hang of it",
            "review_score": "1"
        },
        {
            "review_text": "Some games are about winning, or at least improving and enjoying the learning curve. Not this one.  In Surgeon Simulator you get your fun out of failure, the more mistakes you make the more chance for hilarious situations, but don't worry, the game sloppy mechanics and controls will surely help you on your way to failure!",
            "review_score": "1"
        },
        {
            "review_text": "Not as much fun as I'd thought. Lazy design and constant re-use of levels ruins the hilarious premise and control scheme. Buy it when it's on offer and have a go because it is genuinely fun, but it's not worth shelling out more than a few quid for.",
            "review_score": "-1"
        },
        {
            "review_text": "not worth 10 dollars, get it on sale for 75% off",
            "review_score": "-1"
        },
        {
            "review_text": "i dare you to try and finish a surgery without killing anyone including the heavy",
            "review_score": "1"
        },
        {
            "review_text": "Its all fun and games till u on that table &gt;: )",
            "review_score": "1"
        },
        {
            "review_text": "This is how I am still alive. I shove hammers in my ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, good exercise in patients. *bada-bum*",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is a game filled with humor when you find yourself performing surgeries for different reasons in different environments. As the game gets harder and harder it becomes funnier and funnier and it's a great game to record for youtube! Try it for yourself! Warning: The controls and humerously difficult, you may find rage...",
            "review_score": "1"
        },
        {
            "review_text": "trust me, at the begining of this game...you will rage upon rage upon rage.  But then you get better and it is quite a fun game :D",
            "review_score": "1"
        },
        {
            "review_text": "Nice but more difficult than the original version.",
            "review_score": "1"
        },
        {
            "review_text": "It was good for a couple laughs",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. It is a really funny game that is really good to play when your bored or feeling stressed. I would recommend any game where you can take a guys large intestine and make him a nice scarf out of it.",
            "review_score": "1"
        },
        {
            "review_text": "Just yes.",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator isn't an easy game, but, it can be fun if you aren't taking the whole 'Surgery' thing seriously.  The Mouse Control is clunky, but I'm fairly certain that's the point. It's like performing surgery with an Excavator bucket.",
            "review_score": "1"
        },
        {
            "review_text": "my grandparents died in a botched surgery. lol",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game i didit know how much fun it is to kill bob guss that what he gets for try to take over google",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun and amazing! Go get it:D",
            "review_score": "1"
        },
        {
            "review_text": "I am now a grand-level space surgeon. I can operate on any patient that is comatose. Even aliens. I am the greatest surgeon, it made me a surgeon in real life.",
            "review_score": "1"
        },
        {
            "review_text": "Pulled a mans lungs out and put them on the table but they fell on the floor. I then accidentally droped a cordless drill into his chest cavity and he died 11/10 would commit malpractice/murder again",
            "review_score": "1"
        },
        {
            "review_text": "I killed a man with a tomahawk by stabbing it into his brain 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun to play, but can be challenging at times (damn kidneys...). Lots of achievements to get, most of them you'll have to work really hard for, plus a couple of cool DLCs to spice up your game. With stuff like that, it's definitely worth checking out. Though the kill/save ratio will not be in Bob's favour. :(",
            "review_score": "1"
        },
        {
            "review_text": "I made a Time Lord... 10/10 Would Create Again!",
            "review_score": "1"
        },
        {
            "review_text": "Bob, what are you worried about? I 'I DONT WANNA DIE' 'm a trained profession. You wont die. 'YES I AM, PLS NO KILL ME'  Bob dont say that! Ill tear your other lung out! 'WTF?!'  NOW SHUT UP AND LET ME SURGERY See bob? 4000 ML of blood left, and you thought you were going to di- oh..♥♥♥♥...sorry bob. -blood spewing out of bob and he dies-    10/10 would surgery again",
            "review_score": "1"
        },
        {
            "review_text": "How to kill your patient",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to dig someone's kidney out with a spoon? Ever wanted to wrap their intestines around their neck like some disgusting scarf? Ever wanted to do a surgery on an alien and transplant it's... Gobbleshaft?  Well, in Surgeon Simulator 2013 you can do all of this and more. This is a hilarious game and I definatly recommend it, although probably not to those who are sqemish. The physics and controls are hilarious and fun to use. There are lots of fun easter eggs to discover and great variety to the surgerys. Even though there are only three surgerys there are 3 different modes for each, Surgery, Ambulance &amp; Space. These are all fun with their own challanges and hilarious mistakes to be made.  You probably might don't want to use any of these techniques in real life, somehow hacking someone's ribcage open with a hammer isn't really the correct way to get access to any organs underneath.  Great for a real surgeon who needs a bit of comic relief. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "So realistic, it's like I'm operating on a real person.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game ♥♥♥♥♥♥ me off beyond words.",
            "review_score": "1"
        },
        {
            "review_text": "Firmly grasp it. Firmly grasp it. I SAID  FIRMLY GRASP IT",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely hilarious and fun to play. It's a guarenteed laugh, and it's fun to show other people",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Overall: Ha ha the control is horrible, the graphics are intentionally wonky and the music will make you want to die after a few minutes. Hell, the whole game does. Probably a blast for five minutes with a friend or two. Otherwise a piece of crud that thrives on the joke that it's a piece of crud. I get what it's going for (masochism can be ironic if you think it's funny), but as a game it fails, intentionally or not.  Pros: The above suggestion of playing for ten minutes while drinking with friends. Intentionally the way it is, so that's something.  Cons: Intentionally bad in a variety of ways. Watching people play this online while listening to their reactions is better than playing it, save for while drinking with friends (which coud be true of all bad games).  *1/2 / *****",
            "review_score": "-1"
        },
        {
            "review_text": "A frustrating though awesome game of surgeries and awesomeness. The game has an awesome concept and is very cool.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game and then I loaded it up and it crashed on me.",
            "review_score": "-1"
        },
        {
            "review_text": "I know that controls are suppose to be bad...but they are just plain bad. How you are suppose to pick up anything is beyond me...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is FANTASTIC! I recommend it to ANYONE, but the controls are very hard to learn and require some time commitment.",
            "review_score": "1"
        },
        {
            "review_text": "Finally, a game where I can actually grab a person's intestines!",
            "review_score": "1"
        },
        {
            "review_text": "Got spoon stuck under patient's brain  8/8 --- Most realistic sim ever",
            "review_score": "1"
        },
        {
            "review_text": "I got everything out, tried to cut the heart out Bob died... ♥♥♥♥ A YOU BOB! -earns achievement for flipping the bird- 100/10 BEST GAME EVER",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator looks great, sleek, and genuinely grosses out the squemish. However, there is one problem - control. Without a specially designed remote, Surgeon Simulator can be found to be extremely frusturating, particularly when you only have one mouse, and a keyboard to play with. In the end though, the detailed, subtle humor that's injected into the game is flawless. For example, if you care to notice, after you finish your surgery, the following screen displays text that say, 'Looks good enough to me . . .' Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Such a good day to save lives!",
            "review_score": "1"
        },
        {
            "review_text": "I keep killing off my patients. Who knew it would be so hard to perform surgery?",
            "review_score": "1"
        },
        {
            "review_text": "You play as psychopathic Dr. Nigel, who, by a miracoulous event, turned from a lowly secretary with arthritis to one of the world's leading surgeon professionals. In Surgeon Simulator 2013, you'll cut, slice, hammer, and laser your way through seven levels of brutal torture to your patient. The connectivity between the doctor and player gives off new insight into the future of storytelling in video gaming. You are Nigel Burke. The choices he has made reflects into your deepest darkest self. As you place your patient's intestines on his face, you cannot help but to giggle or laugh. It's one of these similar events that shows your dark side. Overall, this game might be the darkest and comedic game I have ever played and to this day, I still dream about doing some Indiana Jones and the Temple of Doom ♥♥♥♥ where I rip out a person's heart while shouting 'KALI MAH!' I wouldn't be surprised if this game was nominated for indie game of the year, but then I remembered that the controls are ♥♥♥♥ing difficult, so probably not.",
            "review_score": "1"
        },
        {
            "review_text": "watch flew into the open chest 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ripped out a patient's lung with bare hands  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nurse: 'Doctor! He's dying!'  Doctor Stupid: 'Hold on woman I forgot how to use my darn hands today!'   ~~BRUTAL MURDER ACHIEVED IN 10 SECONDS~~",
            "review_score": "1"
        },
        {
            "review_text": "this game changed my life and gave me the skills i needed to become a legit surgeon...........anyone seen my watch ? and why's this guy ticking ?",
            "review_score": "1"
        },
        {
            "review_text": "Like skyrim with guts.",
            "review_score": "1"
        },
        {
            "review_text": "Eh, it's faster on my PS4.",
            "review_score": "1"
        },
        {
            "review_text": "The game is ok in general but the controls was just too annoying and really was difficult.",
            "review_score": "-1"
        },
        {
            "review_text": "hard crazy gorey game where u can flick off ur pachet and slap him in the face and stuff like that",
            "review_score": "1"
        },
        {
            "review_text": "This game is super awesome even though some stuff in it like the large intestine in the double kidney transplant is super GROSS!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty great, despite how enraging it is at the same time. I love they way it controls and looks, minus the occasional bug. The different surgeries you can do make the game interesting and only mildly repetetive as you can complete those same surgeries in a variety of different places, including a moving ambulance and even outer space! There is a Team Fortress 2 easter egg surgery in this game that is really neat. I think that getting all the achievements would be impossible to do, but that's just me. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "whenever i try to start it it says 'ss2013.exe has stopped working' i've gone onto countless forums and websites and nothing has helped, it's a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Figuring out bad user interfaces is not my idea of a fun game.",
            "review_score": "-1"
        },
        {
            "review_text": "Surgeon Simulator 2013 is, to start with, a very fun game. Very fun.  very.  very.  very.  very.  very.  I could go on, but i have to get to the point. To give you an idea of how DIFFICULT it is, I have great hand-eye coordination, and after playing for- count it - 5 hours, I have yet to beat the first level. It makes me really tense and stressed when Bob is losing 20 mL of blood a second and the only thing covering his heart is one lung which won't come out because a chunk of rib is in the way.  10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game is challenging!  However, very rewarding if you try hard to beat it: So much fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's the perfect rage game. BUY IT. Whether on sale or full priced. I still haven't got past the 1st part.  Requires someone with pro control skills  (Apparently, I have none.)",
            "review_score": "1"
        },
        {
            "review_text": "100 out of 100 dying bobs",
            "review_score": "1"
        },
        {
            "review_text": "Gimmicky-fun, I've played more in depth flash gamres online, but it is the worth the Humble Bundle price I got it in.",
            "review_score": "1"
        },
        {
            "review_text": "So f****ing hard to play this game... i quit after 5 min cause the controls are just sooo stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "I gently tapped a mans skull with a hammer, causing his head to burst open.",
            "review_score": "1"
        },
        {
            "review_text": "This game make me rage sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "The only simulator to have more than 2 minutes of work put into it.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game... MY HAND IS STUCK IN HIS HEAD  10/10",
            "review_score": "1"
        },
        {
            "review_text": "You can shove a radio into the guy's rib then flip him off.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Was good, would surgeon again.",
            "review_score": "1"
        },
        {
            "review_text": "The game crashes every time I try to start the first level.",
            "review_score": "-1"
        },
        {
            "review_text": "Well errr...What can I say? The game is just kinda wired but good. Only one thing you should do is just throw everything out of the body for one heart or something else. It's a funny game,isn't it?",
            "review_score": "1"
        },
        {
            "review_text": "Funniest simulator i've ever played, also i think its more easy to make a Surgery in real life than this game lol, im going to give a 9/10 to this game for 2 things.  1.- You have to google to know how to make a correct surgery. 2.-We need more surgeries, there are only 5 different.",
            "review_score": "1"
        },
        {
            "review_text": "Open game, take saw, kill Bob, rage quit. 8/10 Nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Completely unrealistic surgery sim where your failures become your most treasured victories.",
            "review_score": "1"
        },
        {
            "review_text": "I was trying to do all surgeons and compelting them (Im a little achivment hunter :3). And later found the TF2 operation with the Medic, taht was realy fun. You need realy REALY REALY MUCH PATIENCE for this game. I had fun with it (silly game and glitchs are expected). 9/10",
            "review_score": "1"
        },
        {
            "review_text": "thanks people who made this game i passed my surgeon test and got my degree!!!!!!!! #imawesome #togoodforyou  #thankschumps",
            "review_score": "1"
        },
        {
            "review_text": "Am i doctor now ?",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game it's so annoying it stopped being fun after like 10 minutes!",
            "review_score": "-1"
        },
        {
            "review_text": "Its not fun at all un playable, glitchy, unfunny jokes and no potential. I demand a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is absolutly amazing. the humor is out of this world. well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Does stupid things with serios face!  11/10 would kill Bob!",
            "review_score": "1"
        },
        {
            "review_text": "Gave a man laser eye surgery while smashing his ribs with a hammer.    10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is kind of spooky for me becuz u go in someones body, but its ok i guess",
            "review_score": "1"
        },
        {
            "review_text": "gave up on my dreams after playing this game  never gonna be a surgeon :(",
            "review_score": "1"
        },
        {
            "review_text": "Im such a huge baby. I had to stop at the eye surgery.  11/10. I suck.",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator as you play is a proffesional surgeon named Nigel, and you must do various near-death transplants to Bob. (What did Bob do to have to get a heart and brain transplant!!?!?!?)  There are also a couple secret operations, (    alien and Heavy    ) that you can do. There are also 114 achievements such as a time lord one and a flipoff one.  Overall, I'd probably only recommend if you want to play a game where you will lose most of the time and your hand is paralyzed. *plays game* I can do it... Yes! Yes! YEEEE- DED. nuuu",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Graphics - AMAZING story - Lots of hidden goofs - It's just plain wacky!  Cons - Can't think of any",
            "review_score": "1"
        },
        {
            "review_text": "Doin it for the badge :P Enjoyable game for about 30 mins.",
            "review_score": "1"
        },
        {
            "review_text": "its fun but the loss rate blood level time pause menu are all extremely blurry and almost impossible to read ",
            "review_score": "1"
        },
        {
            "review_text": "Smashed all ribs with hammer and throws on floor  Removed all organs with ungloved hands and throws on floor  Work space is cluttered with cups, soft drink bottles, radios, tomahawks and spoons  Accidentally drops watch into patients chest cavity and fails to remove, adds $100 to medical bill   Slaps patient in face with lungs and gives intestine scarf    Still employed and completly trusted. 60bpm/60bpm",
            "review_score": "1"
        },
        {
            "review_text": "Cleared a ribcage with one swipe by grabbing a drill by the drillbit and letting rest of the drill helicopter the crap out of said ribs.  7.8/8 m8! Would drill again. . .",
            "review_score": "1"
        },
        {
            "review_text": "this game is madness in a funny way 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Very good, could do with having Xbox controller support XBox controller support though",
            "review_score": "1"
        },
        {
            "review_text": "All that you expect it is, amazing, is what I'm assuming you expected it to be. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great Simulator game i recommended you buy this game than 2 soda cans -Open the game -Drop everything on the floor -Check Bob's operations -Play with Bob -Bob died *sniff* -Close the game -Buy the DLC -Continue playing the game ( what did you expected ? )",
            "review_score": "1"
        },
        {
            "review_text": "Mouse controls are ♥♥♥♥♥♥ as ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Apparently you can earn achievements while in game but they don't show on Steam. Next time you relaunch the game, the achievements are wiped... Some achievements ( such as hand gestures ) don't work properly or become unlocked ( before being wiped ) at random times....  Some of the progress remains.  Right now the game is essentially unplayable because progress is lost each time the game starts up.",
            "review_score": "-1"
        },
        {
            "review_text": "Goofy, unique, hilariously frustrating. Give this one a try when one sale!",
            "review_score": "1"
        },
        {
            "review_text": "WHY CANT I USE XBOX CONTROLLER!?!?!",
            "review_score": "-1"
        },
        {
            "review_text": "Summary of the past 30 minutes of my life; -Meet Bob -'Try' to prepare Bob for surgery -Epic battle pursues with cloth covering Bob's chest -10 minutes later, surgery begins -Bob dies as his heart flies through his lungs and stomach, escaping the wrath of my hammer. -Try two more times, getting high both times with the needle, having nightmares about the organ that tried to kill me. -RIP Bob x 3",
            "review_score": "1"
        },
        {
            "review_text": "Could easily drive me to alcoholism. Would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "This game was already brilliant. Then came the Inside Donald Trump update that lets you play with Donald Trump and even brutally murder him. ",
            "review_score": "1"
        },
        {
            "review_text": "The best $7 I've spent all weekend! I have perfected my killing technique to just 6 seconds too. Marvelous!",
            "review_score": "1"
        },
        {
            "review_text": "I think the proper title for this game is One-Handed Surgeon Simulator with Numb Hand. The control is so bad. 20 minutes of fun, got frustated after. Played 40 minutes, Unistalled the game. It's more exciting watching other people play it honestly.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty funny. I don't know if it's just me or the developers intent but the controls are exceedingly hard. I feel like it's intentional. Scrub on!",
            "review_score": "1"
        },
        {
            "review_text": "A good indie game that made the rounds on Youtube when it came out because of the absurdity of performing surgery with the intentionally clunky controls. AWER keys and Spacebar closes the fingers and the thumb, the mouse is used to move and manipulate the hand. Then you attempt to use the various medical devices on the table to perform the surgery, and if you drop the bonesaw you will need to bash the ribcage open with a radio. The anniversary edition is the most complete edition of the game which includes a new game mode and more types of operations. The anniversary also includes the latest operation where you can operate on Donald Trump. You can save him... or kill him as you can do with any patient in this game. Depending on your political views either way, you can Make America Great Again.",
            "review_score": "1"
        },
        {
            "review_text": "No wonder the medical school kicked me out after my first surgery. I had to put the organs back in instead of throwing it to the floor. Hey at least I put the heart on the right place.  0/10 did not prepare me for a real life surgery. 10/10 taught me the perfect place for replacement organs.",
            "review_score": "1"
        },
        {
            "review_text": "sucks",
            "review_score": "1"
        },
        {
            "review_text": "Frustating beyond all reason. I whole-heartedly recommend.  No joke, I still wake up screaming some nights. 'WHY!?!?!'",
            "review_score": "1"
        },
        {
            "review_text": "Super rage simulator (if you really try to make the surgery)  10/10 Devil made it",
            "review_score": "1"
        },
        {
            "review_text": "I regret to inform you.... that this game is amazing! But as for Bob.... He's actually doing great, and is over in the ICU! After many hours of carefully deconstructing Bob bones, and replacing viatal organs I am finally a real Surgeon!!!! I would like to thank my many Nurses that backseated me while operating on Bob. I mean sure Nurse Joy says I should use a surgeon knife for some situations, but I feel it necessary to use the hammer sometimes. And maybe Nurse Joy was right that I should not try juggling the kid knees before putting them in becuase I drop them and lose my watch, but did that stop me on try 209 when i succesfully juggled his kid knees in, did it? Only thing I could ask for more from this game is a nameplate for my desk in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Second in Worst Collision Detection of the Century only to CS:GO.",
            "review_score": "1"
        },
        {
            "review_text": "good game its worth the money",
            "review_score": "1"
        },
        {
            "review_text": "  13/10 Game of the year",
            "review_score": "1"
        },
        {
            "review_text": "Brain surgery with a hammer. Would kill again.",
            "review_score": "1"
        },
        {
            "review_text": "is there a way i can get my money back  its not that i dont like it its because i want a diffrent game",
            "review_score": "1"
        },
        {
            "review_text": "'DONT TOUCH THE SIDES!' --- Surgeon Simulator is by far one of the most hilarious games i have ever played it will keep you laughing for hours, don't blow the whole Simulator out of proportion. This game is amazing in its own way. you are still performing surgery, just not like a real doctor would. i don't think anyone could make a game that could go into detail of the human body; the human body is just simply to amazing in detail for ANY game developer to similat. this game still goes into to detail and is 'something like surgery' its as close as your going to get to cutting someone open without really doing it.   Just don't sugar coat something like this. i think as gamer's we amp our self's up for something that we think is going to be amazing when really we need to be real about it. Not every game we play has to be game of the year.  This user gives this game a 8 out of 10 simply because it made me laugh, its everything i thought it would be by looking at it. i see something here, i think if they keep at this game it will be bigger then everyone is letting it to be. Then again i don't care i love this game, just try it!",
            "review_score": "1"
        },
        {
            "review_text": "Taught me how to kill a man in 15 seconds, I recomend it to all scociopaths and serial killers.",
            "review_score": "1"
        },
        {
            "review_text": "Can get vry annoying but fun game overall",
            "review_score": "1"
        },
        {
            "review_text": "Super hard, but you can't stop playing.. those intestines need to come out.. Save Bob!",
            "review_score": "1"
        },
        {
            "review_text": "No one liked Bob anyway.",
            "review_score": "1"
        },
        {
            "review_text": "I think he's all better now. Let's sew him up.",
            "review_score": "1"
        },
        {
            "review_text": "controls are hard to lern but the fun times will flow afterwerds wether its choping bob in the head with an axe or just drilling hes eyes out with a hair trimmer 9/10",
            "review_score": "1"
        },
        {
            "review_text": "a great simulator. some might say that this is 100% medicly accurate.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a doctor and I can say that this is pretty much how it works in real life...",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is completely ridiculous. Whether it's the achievement titles like 'Valve actually let us do this?' and 'I immediately regret this decision', the ridiculous gameplay, the cameo level, and just how fun and ridiculous it is to play. The difficulty is very high though, so do anticipate some rage. Especially in that damn kidney transplant...",
            "review_score": "1"
        },
        {
            "review_text": "Great game, would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game based on the gameplay and the entertainment value, I will say however, that it is likely not going to work well and crash on multiple occasions, I was excited to play it when I first got it but now I'm just frustrated trying to get it to work.",
            "review_score": "1"
        },
        {
            "review_text": "WHY HAVEN'T YOU BOUGHT THIS YET",
            "review_score": "1"
        },
        {
            "review_text": "This game is used to train real doctors in medical school, you will find yourself ripping everything in the man's body JUST to give him a new heart.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "This Game was so fun! Doing whatever you want to the patient or actually doing the surgeory  10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "good game to play for the first 2 hours but is way more funny to watch/take videos of",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever come home from a night out and tried to cook a microwave meal to the point it's edible, then you know how it feels. Think of this game as that, you walk in, no control over bodily functions or movements, picking anything you can to master your goal and probably causing mayhem and destroying someone's life. That is Surgeon Simulator. Hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "Very silly game, fun and exciting at times, if you liked the demo, get this! not a long game, but doesn't disappoint",
            "review_score": "1"
        },
        {
            "review_text": "A deep story about the value of human life and society as a whole. What lengths will you go to to save the life of this man. You are willing to give your all to save a virtual man who doesn't exist outside the level you are playing. What about when your all isn't good enough? What will you tell his virtual children? Child: 'Is my daddy coming home from the hospital soon?' You: 'I'm sorry little boy, but I dropped qtips in his brain and it killed him.' Child: '...'  The nature of your fellow humans reflects back on our feelings as members of society. You may be doing fine at your job, but then the ambulance driver takes a turn to quickly and a knife flys into his colon. You may desperately need someone to hold onto the lung so that you can save his life, but now matter how many timese you ask him the patient will refuse to help save his own life. You are the only one you can trust, and if you can't do it all on your own than you can't do it and you'll let everyone down.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fastest way to break your monitor 11/10",
            "review_score": "1"
        },
        {
            "review_text": "open heart surgery surprise",
            "review_score": "1"
        },
        {
            "review_text": "What? WHAT?!",
            "review_score": "1"
        },
        {
            "review_text": "its just a fun game that pisses you off at killing him instead of helping him.",
            "review_score": "1"
        },
        {
            "review_text": "fustrating yes, but not to bad that it makes u wanna keep trying ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing hard as cold ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "You should get this game!!! Its annoying but fun. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is surely worht its money. Fun and realstic (kinda)",
            "review_score": "1"
        },
        {
            "review_text": "Nurse 'He needs a heart transplant now doctor' Doctor 'fine just hand me that hammer' Nurse 'what?' Doctor 'It's okay I watched a Youtube video on how to perform a transplant it should be fine...'",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is partially gross in a good way. It delivers plenty of laughs if you have a slightly dark sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "i bought the game and it dont work :(",
            "review_score": "1"
        },
        {
            "review_text": "If your good at very hard to near impossible games this one is for you...",
            "review_score": "1"
        },
        {
            "review_text": "Hard, but really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Warning: highly fun and exciting ",
            "review_score": "1"
        },
        {
            "review_text": "what a load of rubbish do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "The game keeps crashing everytime I try to start the first mission. Pretty disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Who in thw world thinks that a game about Surgery will be THIS funny. You play it and you immediently say, 'What the F*** is going on?' Once you master the controls, it's time to get playing. You will have to do Heart transplants, Double Kindey (might be wrong) Transplant, and a Brain Transplant in the emergency room, ambulance, and outer space! This game is really short, but it will take a long time to beat it.   Score: 8/10  Pros:  -Funny -Challenging -TF2 Heart Transplant  Cons: -Lacks in Variety -Few stages",
            "review_score": "1"
        },
        {
            "review_text": "Hard as hell but funny to play",
            "review_score": "1"
        },
        {
            "review_text": "Many keys had to be rebound just so I could make a proper first because I can't press specific keys at the same time. This is a pretty godawful game.  I like it.",
            "review_score": "1"
        },
        {
            "review_text": "A very calm relaxing game, with great amounts of realism.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME! This game is so fun to have the feeling of being complete moron who has no idea to use his right arm and has the fate of Bob in his one hand. So cool how they made a Ipad version today! But for the Ipad version, can you make it so it is supported on at least Iphone 4 and lower/higher? Also add the eye transplant and training mode from the Ipad version to the steam edition? Thanks! Anyway, I love how 2/4 the time you have no idea, 1/4 you are raging YOUR BALLS OFF, and 1/4 the time you are being completely stupid but having fun with it. WARNING: NOT FOR THE WEAK STOMACHED, HEART, OR SANITY. Either way, it's a 8/10. ",
            "review_score": "1"
        },
        {
            "review_text": "What do you call the guy who graduated last in med school? A doctor. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "My patient now wears his iintestines as a scarf.",
            "review_score": "1"
        },
        {
            "review_text": "If your doctor's name is Nigel... Run.",
            "review_score": "1"
        },
        {
            "review_text": "Why is the co-op PS4 exclusive, you ♥♥♥♥♥?",
            "review_score": "-1"
        },
        {
            "review_text": "I want to play this high.",
            "review_score": "1"
        },
        {
            "review_text": "got a surge of ppoot",
            "review_score": "1"
        },
        {
            "review_text": "Replace all organs with a heart, scapels and watch. He'll live, I doctor.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT IS THIS!? IS THIS WHAT MY LIFE HAS COME TO!? Great game by the way!",
            "review_score": "1"
        },
        {
            "review_text": "The controls are bad...ok really bad. but if u think outside the box you could do so much with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Got spoon stuck under patient's brain  8/8 --- Most realistic sim ever",
            "review_score": "1"
        },
        {
            "review_text": "I was in stitches within 30 seconds of starting. 10/10. Absolutely hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "well it seems when I try to move an item I drop it and it doesn't make sense",
            "review_score": "1"
        },
        {
            "review_text": "Hilarity. PERIOD",
            "review_score": "1"
        },
        {
            "review_text": "Just throw this here, put that there. He's fine. Let him go home, he'll make it.",
            "review_score": "1"
        },
        {
            "review_text": "A fun mock-simulator that can have hours of gameplay when you need something to do. This hilarious game features many easter eggs, things to do, and tons of achievements to keep you interested. Worth the buy!",
            "review_score": "1"
        },
        {
            "review_text": "This game is more fun than it should be. Once you get used to the controls, no matter if you're trying to kid around or play seriously, you'll enjoy it and have a laugh. The Medic/Heavy level only makes it better.",
            "review_score": "1"
        },
        {
            "review_text": "its onee of the hardest games ive ever played but its worth the money if you buy this game you wont regret it",
            "review_score": "1"
        },
        {
            "review_text": "Get ready for frustrating, infuriating, eye-popping action! It's never been so fun to fail.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious, anyways if you're having trouble with performance in the game, i recommend you go on 'power plan' and select high performance, then go in the game and change your graphics to either medium or low. ENJOY!!",
            "review_score": "1"
        },
        {
            "review_text": "The only game in the Steam archives that allows you to perform heart surgery on drugs with nothing but a hammer. It's proof that people getting hurt because of clumsiness is ALWAYS funny. Dr. Nigel has a heart of a lion, the brain of a brain surgeon and the hands of a mentally challenged child with arthritis. It continually keeps you laughing despite its (and as a direct result of your) faults. Totally recommend. Got it on sale for 3. Laughs alone would make it worth 10.",
            "review_score": "1"
        },
        {
            "review_text": "Has difficulty recognizing when you complete a level.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is hard",
            "review_score": "1"
        },
        {
            "review_text": "much hammer very stomache 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would recommend this simulator. Quality.",
            "review_score": "1"
        },
        {
            "review_text": "Very hard but pretty darn entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great fun little game to pass the time. The downside is you will definitely need a mouse. I can't get the arm to move while holding things on my laptop's touchpad ( mouse thing?). Fun to use at group gatherings.",
            "review_score": "1"
        },
        {
            "review_text": "This game...is terrible. Pretty sure it was made in an attempt to frustrate, as it requires no skill - good luck grabbing any damn thing - and gives you no direction. It's honestly just a terrible game. It is not even remotely fun. You clumsily guide around a disembodied hand and used the A,W,E,R, and Space keys to act as you fingers. You can move your hand up and down with the left mouse button and rotate it using the right mouse button. It all feels as though you are moving around an arm on a stick and, if you are super lucky, pressing all the buttons will allow you to clumsily grab something - whether it was the item you wanted or not - in some orientation - which I guarantee will not be the way you wanted it.   You don't actually have to worry about anything, you can rip things out to your hearts content. You just need to replace what the objective is. And how you do that is not really clear. It all fells terribly amature-ish. It excels in making you want to throw your mouse against a wall thanks to it's terrible controls, but fails in everything else. I suggest you avoid this game at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably one of the best simulation I've ever played. Its just a game to have a lot of fun on.",
            "review_score": "1"
        },
        {
            "review_text": "Unless you are looking for a game to intentionally annoy you with the controls don't play this.",
            "review_score": "-1"
        },
        {
            "review_text": "According to this I'm the best ♥♥♥♥♥♥♥ surgeon on earth. 10/10 give me your kidneys.",
            "review_score": "1"
        },
        {
            "review_text": "difficult, fustrating at times, but can turn a crappy boring day into a laughtable one near the end of it 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "You have no idea how unnecessarily happy I was to see the birgirpall references in the achievements.",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Would buy again. Remember that the fun is in ♥♥♥♥ing up and you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "for everyone who never made it a real doctor and ended up as psychiatrist or dentist... this is the way to fulfill your dreams of losing your watch inside a patients body.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, just wow! one of the best games ever! Get it when it is on sale :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game and definitely worth the very reasonable price. You will rage quite a bit but will love every second of it.",
            "review_score": "1"
        },
        {
            "review_text": "Very challenging and addictive little game. Not worth the full $10, but definatley buy it if you see it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Don't bother blowing you money if you want to play this seriously. It's deliberately made just for people to make wacky hijink videos for youtube. Play a trauma center game or dig up a copy of Emergency Room if you want an actual experiance. This is just a toy and about as funny as one fart joke told on a cross country trip over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "According to this I'm the best ♥♥♥♥♥♥♥ surgeon on earth. 10/10 give me your kidneys.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game. DOWNLOAD IT NOW!!!",
            "review_score": "1"
        },
        {
            "review_text": "Funny, Fun And All-round Just Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely frustrating and fun, it's a mixed bag of watching yourself try not to mess up but if you do there's no harm done. Super fun to play but don't play it in a bad mood.",
            "review_score": "1"
        },
        {
            "review_text": "a really fun game which makes u happy!! :) support the developer by buying this ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game was literally the reason a got a Steam. My PS3's motherboard was fried, (rest in peace, little angel... *quietly sobs*,) and I needed modern video games. So, Nerdcubed, my favorite YouTube gamer, played this, and I said, 'Hey, that looks cool.' But, at the time, I didn't know what this mysterious and ominus 'Steam', was, even though I have the Orange Box and Portal 2 on PS3. It doesn't work correctly because of my laptop mouse, but it's fun. Long story short, I love this, and thank this for intoducing me to Steam. I replaced my PS3, but, thanks to Steam, don't play it as often. In closing, this game helped shape my gaming life.",
            "review_score": "1"
        },
        {
            "review_text": "Get sucked into the realm of never ending life of bobs, killed one? Thats ok, he has over 9,000 lives! (or he is deadpool)(spoiler(not really)) lol. Like TF2? Thats ok, Operate on the heavy as the medic, BTW glitch with the fridge, use the screwdriver to open the door, the head goes straight up then inbetween the door and the fridge.",
            "review_score": "1"
        },
        {
            "review_text": "HARD TO PLAY DONT GET IF UR BAD AT GAMES (GABRIEL AND HWA)",
            "review_score": "1"
        },
        {
            "review_text": "Who knows, you might just learn something. ;)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the unfairst game there is. There is a space level but you cant win because everything floats away and you have to restart to get the tools you need, I hate games that are unfair for the player and this game just made me hate it even more. Dont buy it cause you get so annoyed that you have to quite, I did that 3 times. It was ok but the levals got unfair.",
            "review_score": "-1"
        },
        {
            "review_text": "Live the nightmare that everyone thinks of when you mention what it would be like if you were a surgeon.",
            "review_score": "1"
        },
        {
            "review_text": "well that was......odd",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit funney not really funney but sort of. Now this game is sort of hard at first and after figureing out the conntrole's and changing them then it's time to play after getting the hang of it youl get in the grove and start getting A's on the heart transplant but I think the hardest is the kidney transplant in the ambulance and There are 3 or 4 easter egg in it but there isn't much to say about it exept that it is worth the money. 7.9/10",
            "review_score": "1"
        },
        {
            "review_text": "It is a very fun game. It has a lot of different surgerys like brain trasplant and heart transplant so i recomd this game. Plus it cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing but skull! Right on man EAC FTW!",
            "review_score": "1"
        },
        {
            "review_text": "Look, if you had, one shot, or one opportunity To perform all the surgery you ever wanted, one moment Would you cut it? Or just let it slip, yo  His palms are Glitchy, knees weak, arms are Spaghetti, There's vomit on the patient already, Interns Intestines, He's Cool, but on the surface he looks Untrained and deadly To cut arteries, but he keeps on forgettin' What he wrote down, the whole team goes so loud He makes the cut, and the blood just pours out He's hammering, how? Everybody's vomiting now The bloods run out, times up, over, blaoh! Snap back to reality, oh, there my medical license  sums up my experience in this game.  I r8 it 8/8 m8",
            "review_score": "1"
        },
        {
            "review_text": "Although it has its rage quits, it's a lot of fun ripping out body parts!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the hardest game i've ever played... i spent at least a hour just doing the heart transplant",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me want to ♥♥♥♥ on my keyboard",
            "review_score": "1"
        },
        {
            "review_text": "great and gory game if under 13 this would not be for you but it is AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, definitely worth playing with another person (one controlling fingers, the other controlling hand movement). Needs more levels!!!!",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Would buy again. Remember that the fun is in ♥♥♥♥ing up and you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, if you like a bit of challenge, as the controls are tedious, and the operations can take forever for you to figure out how to complete.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and funny game!",
            "review_score": "1"
        },
        {
            "review_text": "is rly gud ",
            "review_score": "1"
        },
        {
            "review_text": "I CANT GET TO HIS HEART D:",
            "review_score": "1"
        },
        {
            "review_text": "This game tought me how to masturbate 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Well i guess i should write a review for Surgeon Simulator. Normally when people play simulator games they are either bored or on the road to being board after a short while. this game is not like that. to put it quite simply, it's different from most simulators. it is a great game despite the flaws, one being the controls. The controls seem fairly odd and make the game difficult to play. It really takes time to get used to it but thankfully the menu you can practice your odd controls, even set your own if you cannot stand the default, which i did. I could stand it but moved a few keys so my hand was closer together (asdf and space + mouse)  other then that the game is quite difficult in working the hand and completing a few different surguries. it also plays with time, and working the needle to keep the patient from bleeding out.  I Recommend this game to anyone looking for a different take on the simulation games.",
            "review_score": "1"
        },
        {
            "review_text": "Frustrating and suspenseful, but strangely fun",
            "review_score": "1"
        },
        {
            "review_text": "Have you always wanted to be a surgeon? Save lives with breathtaking skill and dexterity while men and women alike swoon around you? Buy Surgeon Simulator, and none of this will happen! Plenty of people complain about the controls, but all it takes is a little persistance before you get sucked in to chasing that perfect surgery. It's inaccurate and hilarious when things go wrong, especially if someone else is watching your spectacular demise. This game had me the moment I used too much hand movement and buried the circular saw deep in Bob's chest cavity. 'WHATDOIDOWHATDOIDO' while the blood drained away. Priceless.",
            "review_score": "1"
        },
        {
            "review_text": "Killed someone with a saw  10/10",
            "review_score": "1"
        },
        {
            "review_text": "human guts flying everywere and glitches that make this game fun yep sugeon in a nut shell  what can i say well the graghics luckly are notthat great but in a game that has you flaling around inards, yea that would make this game discusting and not fun",
            "review_score": "1"
        },
        {
            "review_text": "Tis fu$cking game sucks the controls are crapy and when im trying to do a hearts surgey ill be holding the bone saw then all of a sudden when im holding the handle it freaks out and now im holding the blade . and it drops anything im holding after 2 mins when im still holding the buttons ",
            "review_score": "1"
        },
        {
            "review_text": "It's a bit tricky but it is still very fun. The game has a lot of hidden things as well",
            "review_score": "1"
        },
        {
            "review_text": "Complete madness, I got an A while I was totally smashed! XD",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator is what i dreamed of. A game that i can scream at becuase the controls are so hard to use, but thats part of the fun! I garentee you will get frustrated but i also garentee you will have tons of fun! 10/10 Would cut people up again.",
            "review_score": "1"
        },
        {
            "review_text": "STAY AWAY FROM THIS GAME........THIS GAME HAS MADE ME HAVE EMOTIONAL BREAK-DOWNS ITS THAT STRESSFUL SO HEED MY WARNING STAY FAR ♥♥♥♥ING AWAY FROM THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "Crack open a skull with a hammer. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "At least i dont need to put the other organs back",
            "review_score": "1"
        },
        {
            "review_text": "If you like to have a challenge so hard that you want to blow your brains out, go right ahead. Otherwise it's fun to put every tool possible into someones chest cavity.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun and totally outragous surgeon game. you controll the hand of a surgeon and you have to perform some surgerys like heart surgery and brain surgery yeah all fun but... you have to complete them before there blood has run out otherwise you lose!!! and no gamer wants to lose :o this game is well how do i put this awesome, and inraging damn those ambulance surgerys!!! but there are some secrets in the game which you can just find all over the internet now... but this five fingered surgery game has totally earned its spot in my awesome games collection",
            "review_score": "1"
        },
        {
            "review_text": "This game is an incredibly challening, tricky, interesting, entertaining, and AWESOME game. With the very well planned controls, and the detail of every little thing, this game has incredible graphics, it is worth every penny. Not to mention, it's a great game to play around with around your friends and family, and I strongly recommend it to people looking for a challenge, and a great experience!",
            "review_score": "1"
        },
        {
            "review_text": "Shhh I am doctor now.",
            "review_score": "1"
        },
        {
            "review_text": "The wackiest 'not my hand but I'll give it a go' kinda game I know.",
            "review_score": "1"
        },
        {
            "review_text": "So this game makes me feel like a 3-year old who is learning how to kill for the first time, legally. Get it before you do real surgery.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥in nige and his ♥♥♥♥. JUST GRAB THE BLOODY KIDNEYS YOU ♥♥♥♥ ITS NOT THAT DIFFICULT ARRAAGAGH.  10/10 would surgeon simulator again",
            "review_score": "1"
        },
        {
            "review_text": "This game will leave you frustrated and angry, but feeling very accomplished. Quite a bit of fun to be had, definitely pick it up on sale if you have nothing better to do.",
            "review_score": "1"
        },
        {
            "review_text": "A whole lot of random fun for when ur feeling like a doctor",
            "review_score": "1"
        },
        {
            "review_text": "This GAME is JOKES!!!! So Fun So Jokes! ♥♥♥♥IN' BUY THIS GAME!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the funniest games I have played in a long time.  The controls are amazing, the scenarios are hilarious, and the unlocks are awesome!",
            "review_score": "1"
        },
        {
            "review_text": "it is a realy good game i play it and the controls are realy good today i see that it is sale i buy right now the pack  i am realy happy with the game it's fun and not easy TANKS FOR MAKING THIS GAME!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Earth approves",
            "review_score": "1"
        },
        {
            "review_text": "Anyway, that's how I lost my Medical License.",
            "review_score": "1"
        },
        {
            "review_text": "God I love the British!",
            "review_score": "1"
        },
        {
            "review_text": "I love the game, it's fun and rewarding. FIRE WHOMEVER CREATED THE AMBULANCE LEVELS, I HAD TO TRY 9 TIMES BEFORE I COULD GET THE KIDNEY SURGERY DONE, THE KIDNEYS KEPT BOUNCING INTO THE UNREACHABLE AREA OF HIS CHEST CAVITY. F**K WHOMEVER CREATED THE ABULANCE LEVELS.",
            "review_score": "1"
        },
        {
            "review_text": "=)",
            "review_score": "1"
        },
        {
            "review_text": "Bought just so I could maybe one day have as much fun as gav and michael",
            "review_score": "1"
        },
        {
            "review_text": "Unless you're susceptible to blood and detached organs scattered around, this game should be yours!  In the beginning (who am i kidding.. even after days of playing) you'll struggle controlling your hand as if it were real, but surgery ain't easy.. and it adds to the fun. Throw in some friends who's never played and let them try to double the fun.  Also keep an eye on the achievements as they hint you some of the most hilarious events, like performing electrocuted/drugged surgery (why not both?).",
            "review_score": "1"
        },
        {
            "review_text": "Quite boring and frustrating, despite its primary appeal  I'd say this game looks like a tremendous idea from afar, but when it gets down to gameplay there are a lot of complaints to be heard.  Most annoying of all are the mouse controls, apparently the arm movements handle better with gamepads from other reviews I've seen. Even after the very first operation you'll be wanting to quit the game and only occassionaly come back to it to mess with the reception table.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game, it's fun, addicting and has many awesome secrets.",
            "review_score": "1"
        },
        {
            "review_text": "Nice but more difficult than the original version.",
            "review_score": "1"
        },
        {
            "review_text": "4 words... teh pinnacle of malpractice :)",
            "review_score": "1"
        },
        {
            "review_text": "Won't go fullscreen too small to play :\\",
            "review_score": "1"
        },
        {
            "review_text": "Always wanted to be a doctor now I can. Just dont let me ever operate on you. Decent game for a decent price",
            "review_score": "1"
        },
        {
            "review_text": "Great little game for a laugh, a nightmare to master the controlls but i honestly dont think I have laughed so much for a long time. A must have game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun.It has tons of content and you could never run out of it.This game all ways has a better part to it then the other and so it keeps expanding untill you have done it all.",
            "review_score": "1"
        },
        {
            "review_text": "I am ♥♥♥♥ at this. You will be too. There are few games that are actually funny... this is one of those gems. A must buy.",
            "review_score": "1"
        },
        {
            "review_text": "The stupidest thing ever, but it's a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pretend you are a Doctor and 'Save' people's lives, whilst having the Casualty playing in the background.",
            "review_score": "1"
        },
        {
            "review_text": "Ridiculous game. Frustrating and Hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Needs more of a tutorial, though.",
            "review_score": "1"
        },
        {
            "review_text": "I only played 33 hours on record and I beat the entire game. Everything from Heart Surgery to the space missions. Yes, including the ARG one. It took them 48 months to make the game, but still it's not short. It gains my seal of approval. Play it, or you won't know real fun. This game is really amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun.It has tons of content and you could never run out of it.This game all ways has a better part to it then the other and so it keeps expanding untill you have done it all.",
            "review_score": "1"
        },
        {
            "review_text": "Finally an accurate display of the events that really take place when you are anesthetized. It is also a perfect simulation of how the body of a well skilled and experienced surgeon may be affected by and refuse to obey because of the mental pressure that comes with the ability to decide over life and death with the right actions.",
            "review_score": "1"
        },
        {
            "review_text": "Lol this is so fun to mess around with. This game's stupidity makes it so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game was made to make fun of. It is absolutley hilarious... or rather Can be absolutely hilarious. It's not bad if you can get it for a low price just to screw around in.",
            "review_score": "1"
        },
        {
            "review_text": "IM NOT GIVING THIS A GOOD REVIEW TILL U FIX TH EBUGS ON KIDNEY LEVEL FOR GODS SAKE I WOULD HAVE FINNISHED 2 IF THE LEVEL WASNT SO BAD AND GLITCHY FIX IT AND I MAY GIVE THIS GAME A GOOD REVIEW",
            "review_score": "1"
        },
        {
            "review_text": "Its fun you make life happen",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013.... Where to start?  This is a really good game! Well worth the $2 I spent during sale :) Although I have already almost finished the main quests, I am on the verge of completing the achievements as well.  This is a highly addictive game and is a must before 2014! Go get it now whilst it's cheap!!  Rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun.  This simulator isn't a normal, boring simulator. It goes beyond the line between simulation and comedy. The game has amazing easter eggs too.  The game has 16 levels in total. It doesn't seem like much, but they are also challenging, and never get boring. The graphics are a good quality and so are the controls. In-game you only have one hand, and you control each finger seperately using the keys A, W, E, R, and Space. The other movement of the hand is controlled by the mouse.  Again, Amazingly fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's Tololol :)",
            "review_score": "1"
        },
        {
            "review_text": "The controls aren't very good. I feel like every mission I had to watch it on youtube first because it doesn't really make sense. A good example of the challenge would be cutting the intestine out, you have to look hard for the lines to cut... not exactly dotted lines, just darker, it's like a puzzle more or less. For a puzzle this might be a bit fun if not extremely annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the funniest games I have played in a long time.  The controls are amazing, the scenarios are hilarious, and the unlocks are awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I regret this purchase. People seem to really like it but i feel the control scheme to just be... well rather dumb I cant even play past about 3-4 minutes before my hands hurt.",
            "review_score": "-1"
        },
        {
            "review_text": "This is worth 'playing'!  You'll see surgeries with totally different eyes ",
            "review_score": "1"
        },
        {
            "review_text": "Finally, a game that can prepare you for a real life skill. After playing this game, I am now completely able to preform several different surgeries in a variety of settings. With my new-found expertise, I can be swapping out organs in record time. Definetly recommended to any soon-to-be or wish-to-be surgeons.",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013 brings the humorous web game to a more feature rich version that brings as much fun as the original prototype. The goal of each operation is to remove a failed organ and replace it with another, often with realism taking a step back for the gameplay. The controls can be likened to QWOP with its confusing and awkward controls, although getting a feel of them doesn't take too long to do each of the operations. Each operation can be summed up as break this bone or cut exactly here on the organ and remove it, and is loads of fun trying to flail around your hand. Graphically and musically it plays as parody of TV medical dramas like the first game with good music and funny yet semirealistic medical objects and organs. There's a small amount of operations with some variations, but the appeal is in the controls, physics, and humor. As an update to the popular web game, the full version of Surgeon Simulator 2013 brings humor and silliness to surgery to a very enhanced and appealing experience.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for everyone seriously interested in medicine.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly funny and frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "The power of Space!!  After I got this fun, addictive game it was hard to master the controls. It took me a few weeks to get the hang of it, but hey, why'd you think I said '*The power of Space!!*?' Because I got stuck on Regular Brain Surgery, then beat it with a B, and flew through Ambulance mode in about 2 tries for each. (Heart, Kidney, Brain..) And made it to...... SPACE! Now I'm stuck on kidney again... xD",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing awsome cause its a very fun game with frequently update and additional contenant So BUY IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "Its a pretty hard game at first, but it starts getting easy once you get the hang of it",
            "review_score": "1"
        },
        {
            "review_text": "This game's fun. It's like it's Simulating a surgery or something.",
            "review_score": "1"
        },
        {
            "review_text": "Just yes.",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator isn't an easy game, but, it can be fun if you aren't taking the whole 'Surgery' thing seriously.  The Mouse Control is clunky, but I'm fairly certain that's the point. It's like performing surgery with an Excavator bucket.",
            "review_score": "1"
        },
        {
            "review_text": "meow cakes",
            "review_score": "1"
        },
        {
            "review_text": "QWOP + Surgery. Why wouldn't it work?",
            "review_score": "1"
        },
        {
            "review_text": "In this game, it never ends there's always something to do",
            "review_score": "1"
        },
        {
            "review_text": "I haven’t played the game for real, but I’d recommend it to people who enjoy the thrill of gambling with their time and the romance of exploring where others fear to tread.",
            "review_score": "1"
        },
        {
            "review_text": "This is a hillarious and extremely fun game. I would recommend it to anyone who wants to play a hillariously challenging game.",
            "review_score": "1"
        },
        {
            "review_text": "Its similar to the free game released before this, but with more wacky surgeries, and even the surgery from the Team Fortress 2 'Meet the Medic'.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun as hell to pull the patient / victim's guts out and slap it across his face ^w^  Fun and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Very realistic and accurate. It taught me everything I need to know about surgery. If you ever need a heart replacement, give me a call.",
            "review_score": "1"
        },
        {
            "review_text": "I just cant describe all the fun I had while playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "You should play this because it is cheap and awesome and let's you drug yourself before surgery because that's awesome and then do a brain transplant in the back of a driving ambulance. What doesn't sound awesome about that?  Also, your watch seems to magically fall off of your wrist every time you have just opened the ribcage, abdomen or skull. Rather enjoyable.  Also the fact that you are probably having an IV of heroin or something in your right arm, as you can only use one arm, makes it even more awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun but so frustrating xD",
            "review_score": "1"
        },
        {
            "review_text": "haha it has intentionally terrible controls. so wacky and random and funny.",
            "review_score": "-1"
        },
        {
            "review_text": "what",
            "review_score": "1"
        },
        {
            "review_text": "This game is difficult to control and hard at first, but I seem to enjoy it as I get better &gt;:3 You run against time and tools, and get rewarded when done. I especially love the reception desk with all the easter eggs and things to toy around with, definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "What can you say about a game that has an achievement for flippin' the bird, and where you can murder people with a smile on your face and no punishment? 5 words: BUY IT, BUY IT NNNNNNNNNNNNNNNNNOOOOOOOOOOOOOOOOOOOOOOOOOOOWWWWWWWWWWWWWW!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "this game is ausome!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Games that don't take themselves serious can be fun. Surgeon Simulator 2013 is at times one of them. Controls (you need to hold 5 buttons to get a hold of something!) can be very annoying and ♥♥♥♥ you over so you'll have to restart a level. The same goes for the physics which are awful. When you keep failling and failling over and over again, this game will get really frustrating. However, when you finally complete a level, the reward you feel is great, while there isn't a real reward at all. 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Boring game..... Not worth the money",
            "review_score": "-1"
        },
        {
            "review_text": "'I'm a doctor, I know what's best'  Get this game",
            "review_score": "1"
        },
        {
            "review_text": "buy it, cause its worth it.",
            "review_score": "1"
        },
        {
            "review_text": "If you like giving people a slow painful death you'll enjoy this game. This game is HARD.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing; how much I want to bean Bob in the face, for always dying.",
            "review_score": "1"
        },
        {
            "review_text": "I got to give the middle finger to my patient which i am performing surgery on 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun but can get frustrating!",
            "review_score": "1"
        },
        {
            "review_text": "you can use lasers to blind the patient IN SPACE     10/10",
            "review_score": "1"
        },
        {
            "review_text": "I suck at this  And that makes me feel human",
            "review_score": "1"
        },
        {
            "review_text": "Harder than dark souls",
            "review_score": "1"
        },
        {
            "review_text": "Since some people who love games like Farmer Simulator 2014 and Football Manager 2014: Electric Boogaloo will most likely impulse buy this game, let me warn you. This is not an 'actual' simulator. It is QWOP mixed with Trauma Center.  That being said, it's not that bad. Obviously, there will be some parts where you go 'COME ON MAN I BROKE HIS RIBS AND I'M PULLING LIKE CRAZY WHY THE HELL ISN'T THE LIVER COMING OUT?' And there will be other times when a tool or organ you need juuuuuuuuust slips out of reach and you have to restart the level. Again.   On the other hand, it IS intended to be balls-to-the-wall difficult, and those little moments after minutes of hardship where you haphazardly throw a new heart into the guy's chest gravity and it accepts it or when you do a 180-degree spoon flip or when you throw a brain into a man's head like a basketball are the best moments you'll ever feel.",
            "review_score": "1"
        },
        {
            "review_text": "this may not be true of everyone's experience, but for me, it was fun for the first 3 operations, then it got a bit samey, and the odd 'physics' weren't helping, but it wasn't terrible, so if you really are curious, try it.",
            "review_score": "1"
        },
        {
            "review_text": "lasted 3 mins and hated it i might have well thrown 3 quid out the window becuase if this game was on a disc it would have got thrown out and probabaly hit my meigbours cat on the head. But throwing it out would have been easier and more productive than trying to control a drunk surgeon infact a pist up uncoordinated surgeon. infact if i had no arms i would be a better surgeon. this game is the pits along with other crap titles like goat simulator and rock simulator this could be sent over to the enemy intimes of war and they would kill themsleves after playing it for ten mins what a load of garbage. spectrum 16 k games were better than this cack",
            "review_score": "-1"
        },
        {
            "review_text": "it is a very fun but challenging game. I love all of the different ways to complete a surgery.",
            "review_score": "1"
        },
        {
            "review_text": "This game was an entry in the 48hour game challenge. Yes, this game was made in 48 hours. Don't let that turn you off. I haven't had this game for long, but I already LOVE it. It's like trying to perform surgery with a dead arm. If you want a game that is impossible to master and will leave you in stitches, get Surgeon Simulator. If you want to shoot birds at pigs, this is the wrong game.",
            "review_score": "1"
        },
        {
            "review_text": "As it's on sale I would definatley buy it as it's original and is very funny to play!!+",
            "review_score": "1"
        },
        {
            "review_text": "if you are a player of any age, never get this game. you need to have the most boss status to be able to defeat this game",
            "review_score": "-1"
        },
        {
            "review_text": "its surgically hilarious!",
            "review_score": "1"
        },
        {
            "review_text": "Got high on my own supply, threw a heart into orbit, put a floppy disk into a tv.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game tought me how to masturbate 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "While this game has its quirks and is actually okay (Still better than Guns of Icarus), the controls are horribly fiddley, and take hours to get used too. I quickly got annoyed at the game and bored of it and it is just the same ol;' concept for every level. I wouldn't rcommend you buy this as it just gets boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Completed surgery while drugged out of my mind. Only nearly killed the guy but whatever",
            "review_score": "1"
        },
        {
            "review_text": "If you want to have an experience of an expert surgeon in the universe who can do a lot of surgeries with just one hand, this may be your game. you know what? I killed 15 people every single day, it's the best. 11111111/10",
            "review_score": "1"
        },
        {
            "review_text": "Worth it for the controls!",
            "review_score": "1"
        },
        {
            "review_text": "1 of the funniest games ive ever played xD I would HIGHLY reccomend getting this game :3",
            "review_score": "1"
        },
        {
            "review_text": "My thumb hurts.",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't work for me  Im on a Mac, can anyone halp me out?",
            "review_score": "1"
        },
        {
            "review_text": "The game is amusingly difficult. The detail put in is impressive and there are 9 different levels, followed by a secret level that is ridiculously hard to unlock on your own...you'll likely need to use the internet to do it.",
            "review_score": "1"
        },
        {
            "review_text": "very funny but frustraiting at the same time. i give it 5 stars",
            "review_score": "1"
        },
        {
            "review_text": "Cut out Bobs eyes and replaced them with smiley faces. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i stabbed a mans eyes wile high.   10/10 would high again",
            "review_score": "1"
        },
        {
            "review_text": "here's my checklist for all my acheivments:  [] stop screaming at my screen for one second [] win one operation [/] ♥♥♥♥ my pants out of frustraiton [] burn something to calm down [/] woke up my neighbors by screaming (three times) [] kill my cat [] homicide [] kick a baby out of anger [/] question why the ♥♥♥♥ he can't use the other hand [] kill someone  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious in it's own way. Intentionally akward controls, and a macabre sense of humor make this one of my all time favorites. Also, after you actually succeed in the normal transplantation modes, you get to do them on an ambulance, in space and on an alien. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wanted to tear open someone's ribcage with a hammer, then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I just cant play it at all",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the best Simulator games I have played in a while.",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER IN THE HISTORY OF AMAZBALLS GAMES   IF YOU PLAY YOUR BETTER THAN PEWDIEPIE     SURGEON SIMULATOR + ME = HAPPY ME + 11/10!!!!!! EVERYONE MUST PLAY THIS GAME    PLAY THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "I've always been interested in medicine and even work in the medical field in real life (not as a surgeon, though). I always wondered how it would be, life as a surgeon.  In my humble opinion, Surgeon Simulator 2013 offers a considerably large insight to this interesting, yet bloody profession. I've never thought you only transplant organs, as a surgeon! Really interesting. Wow. I could totally see myself having this job, too, in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Frustrating but thats part of the fun",
            "review_score": "1"
        },
        {
            "review_text": "If you want destroy another life Buy this THIS GAME IS NICE !! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "deffently one of the hardest games to control make me fell like im on drugs",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, I personally find the desk the most amusing place to be.I couldn't get the hang of it but the idea of the game is simple genius. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I get that bad controls are it's schtick, but they're horrible. Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun game... Can get extremely frustrating, but fun none the less.",
            "review_score": "1"
        },
        {
            "review_text": "Frustrating but entertaining at the same time. I personally wont be spending a lot of time on this game but the time you do spend on it will be a blast. It was worth the buy since i got it on sale. Would i buy it for 10 dollars, hmm probably not, but it's still very fun game. Would still recommend tho. 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I flipped off my patient whilst operating on him.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "You can break someones ribs with a hammer. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Brother in Law replaced front teeth with Molars and I've been laughing for months.",
            "review_score": "1"
        },
        {
            "review_text": "Killed a patient immediately 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like to have a challenge so hard that you want to blow your brains out, go right ahead. Otherwise it's fun to put every tool possible into someones chest cavity.",
            "review_score": "1"
        },
        {
            "review_text": "If you want a chalange a lot of cursing and a lot of laughing!",
            "review_score": "1"
        },
        {
            "review_text": "If youre looking for a serious gaming experience, go somewhere else cause this one is absurdly hard and funny. Just lots of blood and broken bones and contaminated needles and dropping a running saw inside an open chest cavity",
            "review_score": "1"
        },
        {
            "review_text": "funniest game for ages bt really hard",
            "review_score": "1"
        },
        {
            "review_text": "not worth 10 euro",
            "review_score": "-1"
        },
        {
            "review_text": "Have you ever watched surgety shows and thought to yourself, 'Hey I could do that with one hand tied behind my back.'? Well, now you can! With surgen Simulator you can prove yourself useful with a handful of tools, a willing/ unwilling participant, and a nice dose on anti bleeding drugs for my wrist! you will never again wonder why the spleen is connected to your wrist watch again!  On a serious note, the game does have a bit of a learning curve. learning to pick up items by trashing the main menu desk was pretty fun. And a couple easter eggs await the paitent that take the time to look over everything on the desk.",
            "review_score": "1"
        },
        {
            "review_text": "You can make the heavy literally eat his heart out.",
            "review_score": "1"
        },
        {
            "review_text": "this game is ♥♥♥♥ing ♥♥♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, and surprisingly deep and challenging!",
            "review_score": "1"
        },
        {
            "review_text": "'Oops, that was not medicine.'  -TF2 Medic",
            "review_score": "1"
        },
        {
            "review_text": "i transplanted a guys heart and i only ♥♥♥♥ed up 348597134985 times",
            "review_score": "1"
        },
        {
            "review_text": "While this is indeed a lazy 'bad controls' game where the player fights the physics engine, there are actually objectives and arguably some design in play. You can do well, you can complete the game. You can also use an axe to perform brain surgery.  Good for a little chuckle as being a terrible surgeon and a world that does a good job highlighting this concept (you can earn a diploma with the main character's name taped over it) but also possible to get slightly invested.  Note: some players find this game highly frustrating. I'm no stranger to getting upset at a 'STUPID F***ING GAME' but that didn't happen here for some reason. Perhaps because it doesn't have online multiplayer lag.",
            "review_score": "1"
        },
        {
            "review_text": "This looked interesting so I figured, what the hell and picked it up. It's way better that I thought it would be! A little on the short side but fun, none the less. For $10 bucks, I say, it's definatly worth it. There's nothin like the feeling of violently yankin out your first lung after thinking, 'Should I be doing this? What the hell. Here goes nothin.' Heheh Good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, Truely.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilariously dangeorus. Some missions may freak you out. But in the end this game is epic lol.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Has about 4-5 hours worth of playability if you like it. It is funny though.",
            "review_score": "1"
        },
        {
            "review_text": "I felt exactly like a real doctor, which is strange because I got rejected from medical school, despite mirroring the techniques I had mastered in Surgeon Simulator.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It is really funny.",
            "review_score": "1"
        },
        {
            "review_text": "'Weird Al' Yankovic - Like A Surgeon - The Game",
            "review_score": "1"
        },
        {
            "review_text": "Yes. Pure comedy gold.",
            "review_score": "1"
        },
        {
            "review_text": "It made me a self made surgeon.",
            "review_score": "1"
        },
        {
            "review_text": "this game changed my life and gave me the skills i needed to become a legit surgeon...........anyone seen my watch ? and why's this guy ticking ?",
            "review_score": "1"
        },
        {
            "review_text": "So first of all I do not use Drugs and I do not know exactly how to get the fun out from this one ... I tried hard to get the Floppy-Disk inside the Computer, but the Mouse-Hand handling is too difficult for me ... I am more a serious player and serious operations are more than impossible Missions here ... ... hands up in the AIR .... certainly yours ...",
            "review_score": "1"
        },
        {
            "review_text": "You can litteraly rip out someones lung, smash their head open with a hammer, and brain them with an axe, need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "I love the game, it's fun and rewarding. FIRE WHOMEVER CREATED THE AMBULANCE LEVELS, I HAD TO TRY 9 TIMES BEFORE I COULD GET THE KIDNEY SURGERY DONE, THE KIDNEYS KEPT BOUNCING INTO THE UNREACHABLE AREA OF HIS CHEST CAVITY. F**K WHOMEVER CREATED THE ABULANCE LEVELS.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games on steam. First Point: It's a real game, unlike some of these stupid ones. 'Grass Simulator' For example.  Second Point: It's really god damn fun, especially while you're ripping peoples guts out.  Third Point: They have more than one mode, ex. Ambulance and SPAAAAAACCCCEEEEE.   To sum it up: THE GAME IS MOTHERFU*KING AMAZING!",
            "review_score": "1"
        },
        {
            "review_text": "it fun for whole famiry",
            "review_score": "1"
        },
        {
            "review_text": "I don't like it.And i wish i could get my monyer back.This game was so hard I couldn't get the first surgeon done.",
            "review_score": "-1"
        },
        {
            "review_text": "I used a hammer to cut through a stomach, whilst stabbed with a drugged needle. Best Simulation Game ~ 2013-2015",
            "review_score": "1"
        },
        {
            "review_text": "I stabbed bob in the face. Bob died. *sad music plays*  LETS TRY THAT AGAIN!  Drills holes in bobs lungs. Bob dies LOLOLOLOLOL  In all seriousness, THIS GAME IS SOOOOOO FUNNY!",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS ♥♥♥♥♥ ",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun and challenging game. Love the VHS tape bonus level.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game! You can just mess around with everything. Even preform an Uber Heart transplant! Many easter eggs. Some achievements are references to videos on the game.",
            "review_score": "1"
        },
        {
            "review_text": "Rage Simulator 2013  Hilariously fun though!",
            "review_score": "1"
        },
        {
            "review_text": "My KD is higher in this game then in CSGO. Surgeon simulator &gt; CSGO confirmed.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great substitute for a medical degree. 13.5/10 would flip off a patient again.",
            "review_score": "1"
        },
        {
            "review_text": "I think i'm ready for my first operation, looks like a heart translplant is really easy, just drop the new heart in and it automatically and magically reattaches itself!",
            "review_score": "1"
        },
        {
            "review_text": "i flipped the bean  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon simulator is really challenging, but I do love the challenge. You should get it if you dont mind blood and raging",
            "review_score": "1"
        },
        {
            "review_text": "really fun, but frustrating. i would definantly refer this to a friend.",
            "review_score": "1"
        },
        {
            "review_text": "This game is enjoyable for a couple of hours. After that it is boring, and becomes a waste of money. Just wait for a steam sale and you can get way better games for the same price.",
            "review_score": "-1"
        },
        {
            "review_text": "you can play with his colon. dat's awesome!",
            "review_score": "1"
        },
        {
            "review_text": "A fun piece of ludicrosity, with a brilliantly dark sense of humour. Even better when played with someone who wishes to be a surgeon.",
            "review_score": "1"
        },
        {
            "review_text": "This game simulates what it would be like to operate on someone with your non-dominate hand while it's asleep and you are a little drunk. This offers probably ~30 mins of total game. It is humorous to fumble about, but there really isn't much to it. If you can get it on the cheap, then go for it. This makes for a great party/drinking game. It is almost more fun to watch others fail miserably than it is to actually operate yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Funniest simulator i've ever played, also i think its more easy to make a Surgery in real life than this game lol, im going to give a 9/10 to this game for 2 things.  1.- You have to google to know how to make a correct surgery. 2.-We need more surgeries, there are only 5 different.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, go buy it. PREPARE TO RAGE",
            "review_score": "1"
        },
        {
            "review_text": "Hey Bob....Im giving you the bird :3",
            "review_score": "1"
        },
        {
            "review_text": "WORST GAME ON STEAM. TEH CONTROLS ARE ♥♥♥♥ED UP AND THERE IS NO REPLAY VALUE. I DONT ADVISE YOU TO PURCHASE THIS PRODUCT!",
            "review_score": "-1"
        },
        {
            "review_text": "Buy it, hours of murdering!",
            "review_score": "1"
        },
        {
            "review_text": "Thank you for makeing Surgeon Simulator 2013 it was a realy fun game and i hope you add more to it and Thank you and great luck on makeing more.",
            "review_score": "1"
        },
        {
            "review_text": "lemme stick my hand in yah.",
            "review_score": "-1"
        },
        {
            "review_text": "If it weren't for this game, I wouldn't be where I am today:    playing Surgeon Sim",
            "review_score": "1"
        },
        {
            "review_text": "Surgeon Simulator 2013 is what the title says, a simulator about surgery, but the game's controls are making the game a lot more challenging and fun. The graphics are of course not like Call of Duty or something like that, but it has it's own style, also the game has a bunch of hidden easter eggs and secrets and also a Team Fortress DLC (Now also another DLC called   Surgeon Simulator 2013 Annivesary Edition  . Generally the style, gameplay and topic is what makes this game simply fun. (P.S this game does not count as a medical license)    Story -/10 (There's none)   Soundtrack 8/10   Atmosphere 7/10   Scenery 8/10   Characters -/10 (There's none)   Graphics 8/10     Overall 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "1/100 Bob Recomended  99/100 Bob's Died are your fault If you like watching dead person this game is for you. :P",
            "review_score": "1"
        },
        {
            "review_text": "He once stole my kidney. I was eleven years old. I’m a doctor now, and he’s dead. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I dont recommed playing this game the day before you do your operation/transplant exam in hospital.  It's not gonna end well.",
            "review_score": "1"
        },
        {
            "review_text": "VERY HARD GAME  WILL TEST U INDEED  LOADS OF BLOOD well not really  but u will see if u buy it ps u cant wake bob up :( ",
            "review_score": "1"
        },
        {
            "review_text": "It was fun until I found out that the drill didn't go there...",
            "review_score": "1"
        },
        {
            "review_text": "Totally legit surgeon-ing, that is.",
            "review_score": "1"
        },
        {
            "review_text": "Somewhat frustrating at times, but if you want to giggle until you're ready to soil yourself then this game might get you there. You just have to get used to the controls. If you go in while in a reasonable mood, you'll find hours of fun and comedy - so many ways to kill a patient! You can also electrocute and drug yourself to make it more...colourful. If you go in while in a bad mood, you may find yourself getting more stressed out that you can't complete a level due to not holding an instrument properly or dropping a brain on the floor. 9 / 10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "Bash the ♥♥♥♥ out of people's ribs with a hammer, toss their lungs out the back of an ambulance, watch intestines float around in space, toss brains like basketballs. Surgery.",
            "review_score": "1"
        },
        {
            "review_text": "I BOUGHT THE GAME BUT IT WONT FLIPPIN OPEN!!! HELP ME!! ",
            "review_score": "-1"
        },
        {
            "review_text": "Can Somebody help me my first Patiant keeps dying. And it is 'not' my fault.",
            "review_score": "1"
        },
        {
            "review_text": "for starters great game but... every time i open the game the game shuts it self down i dont know why my computer meets the game req but it still wont ever load",
            "review_score": "1"
        },
        {
            "review_text": "Best trying to grab someting simulator 2013",
            "review_score": "1"
        },
        {
            "review_text": "IntestinalScarf4Life     Nigel would be proud.",
            "review_score": "1"
        },
        {
            "review_text": "I killed a guy by cutting his brain out and accidently dropping his new brain on the floor. 12/10",
            "review_score": "1"
        },
        {
            "review_text": "'GTA makes you a murderer'  I say this game makes me a doctor",
            "review_score": "1"
        },
        {
            "review_text": "Hahaha!! great fun even worth a replay!",
            "review_score": "1"
        },
        {
            "review_text": "GO INSIDE OF DONALD TRUMP 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It looks so damn hurt!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "My Med School professor said that this game is the closest I'll ever feel to actually performing surgery. I got A+'s on all the game modes and passed with flying colors. At the moment I'm living in the basement of a highschool, working as a janitor, living on stacks and stacks of lawsuit case files because I apparently killed 32 people during surgery. I don't understand how I could get such great grades in this super realistic simulator but kill someone because I bashed the man's skull with a hammer and threw in his new brain for his open skull surgery. I still think this game is a wonderful way for medical students and pre doctors to learn the human body and practice surgical skills.",
            "review_score": "1"
        },
        {
            "review_text": "How can I possibly recommend a game that provides a few minutes of excitement &amp; happiness when you first start, the majority of your hours playing it either looking up cheats or guides &amp; tiny little speckles of happiness everytime you beat an operation? I can't. I am stuck on brain surgery. There was a hack where you could get infinite blood using cheat engine but I think the developers made it so you can't do the hack now. Because it was posted a while ago &amp; I tried it &amp; it did not work. So I can't even play the rest of the game that I paid for, with my own money because I am stuck on one of your overally difficult levels. ♥♥♥♥.You!  1/10 IGN 'Would wipe hardrive because uninstalling just isn't enough again'.",
            "review_score": "-1"
        },
        {
            "review_text": "this game was hyped to be a great game, but turned out to be a bit of a mess. Controls are not difficult there just stupid, and when in space surgery try to grab scapels is a bad idea because the glitch out and kill bob. Every surgery was a rage-inducing, glitch session wich made the game unplayable. And the space levels are not even worth playing. The only place i could give the game credit is the Meet The Medic level wich i did enjoy. Overall if you must buy this game wait for the sale its not worth £7 pick it up at £3.49 and have less regret",
            "review_score": "-1"
        },
        {
            "review_text": "need i even have to write any thing",
            "review_score": "1"
        },
        {
            "review_text": "The best $7 I've spent all weekend! I have perfected my killing technique to just 6 seconds too. Marvelous!",
            "review_score": "1"
        },
        {
            "review_text": "you guys should really play seurgeon simulater, its really challenging! although its really fun, the only bad part i have encountered so far is that it does not have a tutorial. again I highly recomend this really hard to control game!",
            "review_score": "1"
        },
        {
            "review_text": "SHUTUP NURSE!!!.....IM GONNA BEAT THIS GAME, FOR WHAT IT IS, RIGHT NOW!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "I cant pick up something but it's quite funny!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game thinking it would be awesome and guess what? i was RIGHT the controls might be hell for some people so im just warning you that the controls for this game are kinda hard to use but eventually i just got used to it. That is litteraly the ONLY downfall of this game but i dont really see it as a downfall. But EVERYTHING else is just perfect",
            "review_score": "1"
        },
        {
            "review_text": "Option A: Try really hard and get frustrated  Option B: Get frustrated anyways   If you practise alot it'll become easier, but it stays frustrating.  I rate frustrating/10",
            "review_score": "1"
        },
        {
            "review_text": "in the tf2 part you cant open the frige like what the hell",
            "review_score": "-1"
        },
        {
            "review_text": "This game taught me a life lession.... I shouldn't be a doctor...",
            "review_score": "1"
        },
        {
            "review_text": "In this game, you can bash a rib cage open with a hammer.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME THIS GAME GETS ON YOUR NERVES",
            "review_score": "1"
        },
        {
            "review_text": "Funny game. Don't play it seriously, just enjoy putting the organs in and out without concerning about the results since your patient is just like a dead man.",
            "review_score": "1"
        },
        {
            "review_text": "I learned to be a world-reknowned surgeon in just six easy steps!!",
            "review_score": "1"
        },
        {
            "review_text": "I really hate this game you cant grab anything and if you can it is really hard it is a waste of money dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "Play game pretend to be a bad, you win try your best, you fail. rage 5 times and not play the game for 2 days and come back to the game and repeat.    10 out 10 would do this again  short version: the game is hard but fun",
            "review_score": "1"
        },
        {
            "review_text": "I dont know how anyone can even play this game doing even the simplest things like picking something up is ridiculously infuriating the controls are a joke and the game play itself is just bland and boring. If you want a good description how the controls are with this game, imagine trying to eat cereal with one chop stick but you have parkinsons.",
            "review_score": "-1"
        },
        {
            "review_text": "in the tf2 part you cant open the frige like what the hell",
            "review_score": "-1"
        },
        {
            "review_text": "My goal was to become da doctor. but when i get da 50 atar i be like wtf. Ok so i live my dream on the onlines now you know what im saying, cuz escapism is da ♥♥♥♥ dawgs  10/10 gameplay ",
            "review_score": "1"
        },
        {
            "review_text": "Played for 2 hours Laughed Quit 6/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is too frustrating for me. Sorry, not sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "well i'm glad it's not me on the table with my chast opend  but crap tone of fun so 10/10",
            "review_score": "1"
        },
        {
            "review_text": "dont play in the living room",
            "review_score": "1"
        },
        {
            "review_text": "the game runs like s**t, uses the unity engine, beware. otherwise a fun experience",
            "review_score": "-1"
        },
        {
            "review_text": "It's very frustrating and hard to control but still a good game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game but can be very enraging because of the controls but i alreaddy got used to them so i can play the game now.I still think there have to be updates for new surgeries on this game because once you finish you have nothing to do.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 helped me get my medical license",
            "review_score": "1"
        },
        {
            "review_text": "Feel like a surgeon with arthritis bash Bob's head with a hammer break everything what more do you want?  oh yeah, multiplayer. Still recommended though",
            "review_score": "1"
        },
        {
            "review_text": "This game is recommended if you dont get angry easy, it's easy to get angry.... for example..........THE FREAKING LEFT KIDNEY",
            "review_score": "1"
        },
        {
            "review_text": "Who knew Neurosurgery would be easier that toasting a pice of bread?",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. It makes me laugh every time someone dies. I laugh even harder every time someone survives. If you don't get the game, something is wrong with you.",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite simulator game.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ ",
            "review_score": "1"
        },
        {
            "review_text": "It's obviously not trying to be serious, but the game is really buggy, the physics are awful and the controls are tight. I wouldn't see anyone playing more than a few hours of this game.   But if you do want to try it out, buy it on a really good sale, or better yet just get I Am Bread. Also, be wary that the game constantly crashes on windows 10.",
            "review_score": "-1"
        },
        {
            "review_text": "Brian surgery is easy",
            "review_score": "1"
        },
        {
            "review_text": "'Kidneys are supposed to be on the inside of the body, Nigel... The inside.' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's very frustrating and hard to control but still a good game.",
            "review_score": "1"
        },
        {
            "review_text": "bob?! bob BOOOOOOOOOB NO BOB DON'T DIE ON ME NOW!!!! well he was a good friend and he thought this was a awesome game. this is a awesome game should get but if you don't like cartoony blood stuff dont get but is a good game",
            "review_score": "1"
        },
        {
            "review_text": "Great game overall, but for some reason it keeps crashing.",
            "review_score": "1"
        },
        {
            "review_text": "  controls very hard to use, but thats what makes it fun",
            "review_score": "1"
        },
        {
            "review_text": "Most of my patients dont survive. Would be a great surgeon.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "you guys should really play seurgeon simulater, its really challenging! although its really fun, the only bad part i have encountered so far is that it does not have a tutorial. again I highly recomend this really hard to control game!",
            "review_score": "1"
        },
        {
            "review_text": "Can become addicting really fast. Definitely a fun game to get your friends into. Also a good way to kill time if you only have a few minutes to put into something.",
            "review_score": "1"
        },
        {
            "review_text": "You buy it for the lolz. Pretty fun to mess around with.",
            "review_score": "1"
        },
        {
            "review_text": "Surgery (from the Greek: χειρουργική cheirourgikē (composed of χείρ, 'hand', and ἔργον, 'work'), via Latin: chirurgiae, meaning 'hand work') is an ancient medical specialty that uses operative manual and instrumental techniques on a patient to investigate and/or treat a pathological condition such as disease or injury, to help improve bodily function or appearance or to repair unwanted ruptured areas (for example, a perforated ear drum).  An act of performing surgery may be called a surgical procedure, operation, or simply surgery. In this context, the verb operate means to perform surgery. The adjective surgical means pertaining to surgery; e.g. surgical instruments or surgical nurse. The patient or subject on which the surgery is performed can be a person or an animal. A surgeon is a person who practices surgery and a surgeon's assistant is a person who practices surgical assistance. A surgical team is made up of surgeon, surgeon's assistant, anesthesia provider, circulating nurse and surgical technologist. Surgery usually spans minutes to hours, but it is typically not an ongoing or periodic type of treatment. The term surgery can also refer to the place where surgery is performed, or simply the office of a physician, dentist, or veterinarian.  In general, I like this game.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "hilarious! From the crazy tools to preforming surgery on Donald Trump, this game can always insure a laugh!",
            "review_score": "1"
        },
        {
            "review_text": "it's pretty fun: every time you complete a surgery, you get an amazing feeling of completion, plus the game has a lot of content, so yea",
            "review_score": "1"
        },
        {
            "review_text": "It's really funny. but really hard to. if you don't like playing really hard games then don't buy it. over all I like it",
            "review_score": "1"
        },
        {
            "review_text": "This game is so entertaining and fun. Buy it and enjoy it. you won't regret it guys. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "IntestinalScarf4Life     Nigel would be proud.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely frustrating game. you control the arms, hands, and fingers of a Dr. trying to do anything is difficult, while trying to pick up a pen i knocked the phone off my desk. I cant even pick up a phone how am i going to save lives!!! that being said, it is pretty damn fun. once you get the hang of it you want to master everything. it reminds me of how i felt when i first tried drums in Rock Band. There are funny achievements and other humor sprinkled in also which keeps my interest. Overall this is a good game, It reminds me of the old crane games you would find at the county fair, difficult to control but once you win a prize you are hooked.",
            "review_score": "1"
        },
        {
            "review_text": "  i love this game ",
            "review_score": "1"
        },
        {
            "review_text": "Why pay over 200k to go to medical school for 8 years when you can just be the surgical murderer for only a couple dollar investment? Plus, I can still play this when I'm retired. Can't work those brain surgeries at 100 now can I?  Plus, you can let Donald Trump bleed out... slowly.  ",
            "review_score": "1"
        },
        {
            "review_text": "I took a hammer and repeatedly slammed at a man's chest until he bled out.  10/10 would commit malpractice again  HIGHLY RECOMMEND FOR ANYONE WITH A SENSE OF HUMOR",
            "review_score": "1"
        },
        {
            "review_text": "Stressful at times. And okay at times. I R8 8/8 M8",
            "review_score": "1"
        },
        {
            "review_text": "  this is so fun trying to do surgery with on arm but what happen to the other? ",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the really sloppy controls (on PC, controls on my consoles [that's right, bow down before a TRUE gaming god that actually owns a large majority of gaming devices and doesn't s*** on others cause they prefer a certain device] are much better) this game is fantastic for some short term fun",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ ",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I can write a very short review on this. You need to save a life, you use stuff to fix the guy. I now have a degree in 'fixing' people. Yay! I only failed like ten times.",
            "review_score": "1"
        },
        {
            "review_text": "You love makeup? You love to make mess on someone's ribs? In this game you get to smear Trump's face with lipstick while crushing his ribs at the same time. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game , a lot of death and rage.",
            "review_score": "1"
        },
        {
            "review_text": "Fun thing to play through if you pick it up on a sale",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely glorious game, you can completely empty various people/things/fictional constructs of their organs. To save them. Obviously.",
            "review_score": "1"
        },
        {
            "review_text": "Can be kinda tricky and anoying but thats part of the game...? Anyway this game is great and i recomend it to almost anyone.",
            "review_score": "1"
        },
        {
            "review_text": "i can poke an eye out with a pen,10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I did a transplant with a pen, tomahawk and a hand drill... never got congratulated once.  How about instead of going to school for a number of years, learning about the medical field and actually being trained and authorized to operate... you instead do it by yourself in the most unorthodox way possible! This game makes being a doctor look real easy!  So if you've seen Goat Simulator... then you get the idea of the realism of this game. Reality does not exist in this game's dictionary, so don't expect to be a real life surgeon in this game... you'll get disappointed. Expect laughs, giggles, and bad chills down your spine as you realize you just chopped a guy's head open with a damn tomahawk... talk about dark humor.  All in all, if you're sick and twisted, here's your entertainment then.    Thanks for reading! Check out these other links!   My Curator Group   Other Game Reviews ",
            "review_score": "1"
        },
        {
            "review_text": "Not really much to say here but only hilarious game! :-D  Brain surgery, heart transplant, etc... FUN! :-D",
            "review_score": "1"
        },
        {
            "review_text": "I was once a great doctor. Until my facebook bleeped. R.I.P greg",
            "review_score": "1"
        },
        {
            "review_text": "Can get vry annoying but fun game overall",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game!!!! MUST BUY IT RIGHT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "the game is funny as but I haven't got past the first level yet.",
            "review_score": "1"
        },
        {
            "review_text": "I love this Game and recommend it just for the hours of fun you can have in this game. You can mess around in it or play it seriously.  Hope it helps :)",
            "review_score": "1"
        },
        {
            "review_text": "The mobile version is easier and more fun in my oppnion, but this is definatlly the king of the 5 bucks games",
            "review_score": "1"
        },
        {
            "review_text": "I only recommend Surgeon Sim on sale. Pay the full price and you will chuck your peripherals out the window.  Gameplay video of an attempt to help Bob...   Dr Giles Wilksmint   A quick run down in case you are thinking of getting this one:  + It's... different? + Sound effects are... meaty? + You can use a hammer.  - The controls... oh the controls... You will be bashing your keyboard and clicking your mouse harder than ever, often to very little avail. - It is... not relaxing. - Trial and error... trial and error... and then some. - You never really feel that you are in control of... anything. Part of the charm perhaps?  As stated above, only get it on sale for a lark and a laugh.",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice game and it's fun to play with your friends (I know, it's a single-player game). At the first time you'll find it's hard to control the hand, but you'll get it easy so long as you play the game. The graphic is good for a simulator game, and there are a lot of achievements that you can get. But still, it's not a logical surgeon, and it's quite strange for me.",
            "review_score": "1"
        },
        {
            "review_text": "As real as it gets.",
            "review_score": "1"
        },
        {
            "review_text": "First misson I'm incapable of grabbing the cloth covering the body - but it's able to pass through my wrist and be stuck on my arm? Randomly the character lets go of items I'm still holding onto? It's one thing to have a game that's hard to beat - it's another to have a game that's just hard to play (and in turn, enjoy). Give me a break. The fact that idiots have been paying anything more than 5 dollars for this turd is beyond me.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game must win WORST CONTROLS FOR 2K16 the game is almost unplayable with it's terrible control scheme (Very clever of them to make you able to work on Donald Trump)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Not bad of a game 4 a little bit much better on a portable device 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "For some reason, Brutal Murder is much more fun if you are trying to help your victim but are being hamstrung by intentionally awful controls.   Surgeon Simulator is the fun kind of frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 most realistic surgery simulation I've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Worthless piece of f@cking crap",
            "review_score": "-1"
        },
        {
            "review_text": "Worthless piece of f@cking crap",
            "review_score": "-1"
        },
        {
            "review_text": "Even though the idea behind this game is good and that is why I bought it, the hard controls make it nearly impossible for me to play it. Maybe you could update this since I am not the only one complaining about this issue....",
            "review_score": "-1"
        },
        {
            "review_text": "Very funny and occasionally frustrating game. This will probably have you screaming 'WHAT THE [bleep] IT'S [bleep]ING IN THERE!' and other such profanities. With a great range of frustrating missons, this'll give you an annoyingly long session of fun. *****",
            "review_score": "1"
        },
        {
            "review_text": "While not medically accurate, this game is hecka rad. It's also seriously funny which is why so many of my operations go south.",
            "review_score": "1"
        }
    ]
}