{
    "app_id": 23420,
    "name": "Europa Universalis: Rome - Gold Edition ",
    "release_date": "2008-12-18",
    "developer": [
        "Paradox Development Studio"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Grand Strategy",
        "Historical"
    ],
    "achievements": 0,
    "positive_ratings": 123,
    "negative_ratings": 52,
    "price": 7.99,
    "description": "Europa Universalis Rome Gold combines the epic strategy title Europa Universalis Rome with the expansion pack Vae Victis. Experience one of the most defining periods in world history in an experience crafted by the masters of Grand Strategy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/23420/header.jpg?t=1447351618",
    "minimum_requirements": "Operating System: Microsoft Windows XP/2000/Vista                     Processor: 1.9 Ghz Intel Pentium or similar AMD                      Memory: 512mb RAM                     Video Card: Direct X 9.0c compatible video card with at least 128mb &                    support for pixelshader 2.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I first started off playing startegy games using hex games, then with my first computer when I played a demo of CIv 1 for the Atari STE. Since then I have played most of the TW series. Especially countless hours on Rome Total War especially modded and yes I like Rome 2 with mods.   Recently this year I have started to get into the Paradox titles starting with Crusader Kings 1.   I therefore recomend Europa Universalis: Rome - Gold Edition very much.   It's Ironic to think that this game has content that the recently released Rome 2 hasn't. Ok it hasn't real time battles as a TW title but I haven't missed it in this game. The depth that is lacking in the former is in Europa Universalis: Rome - Gold Edition",
            "review_score": "1"
        },
        {
            "review_text": "My most played game on Steam, and it deserves a review.  Its very indeph with loads of micromanagement, and if you happen to like the timeline, you are welcome to buy it. You can tune it to play it with unlimited time, if that bothers you.  What sets it apart from normal EU games, is the barbarian mechanic. There are lots of uncivilized lands where barbarians are uprising all the time, and it takes near the end of the game, to civilize them all. If you play a nation that borders to them, it makes the game very 'fun' and unpredictible. Also, you can have children and start very long dynasties. Its fun to watch.  Combat is very much EU-like and simple. A good general is the most important thing. There is lots to know about the game, you can read on it for a very long time to understand everything indeph. Casus belli, how to play wars, the differences of the political systems and how they work, diplomacy, techtrees, jadda jadda.  I enjoyed this good micro/macro strategy for a very long time. Its really hard to beat it with something like a little gallic state that battles the roman empire. But if you make it, it was an experience thats worth it. If not, you want to try again. ;)  The only bad thing i have to say about the game, is that it has a nasty bug with soldier loyalty. It randomly applies it to characters that never led an army. But this bug is so nasty, it really dampens the experience. You can play around it, but it simply sux a-s-s, and its a shame Paradox never fixed it, because this is one of their very best games.",
            "review_score": "1"
        },
        {
            "review_text": "If, like me, you are an armchair general and a casual mega-lo-maniac - then you will love this game.   If you've played other similar turn based strategy games like Hearts of Iron(2 or 3), Europa Universalis III. Essentially they're not turn based but you can control time and pause the game. But this like the aforementioned titles is very good.   The game starts around 470 AD to about 700AD and the map is of the known world around the time of Caesar. The characters, political desires and backstabbing is brilliant. It is a dramatic theatre overlayed with a nation building game. Treat your Generals and politicians well and they will look after you, if you appease the Populists too much your nation will suffer!   It's not as easy as EUIII nor even HoI for that matter. While Hearts of Iron has a ton more detail and much bigger scale, the political juggling and people management in EU Rome is testing. It will keep you glued.",
            "review_score": "1"
        },
        {
            "review_text": "This game had a lot going for it but it is prone to crashing and freezing. Unfortunately Paradox is treating this game as abandonware and has walked away from support.",
            "review_score": "-1"
        },
        {
            "review_text": "Reign of The Ancients Mod. Mandatory.",
            "review_score": "1"
        },
        {
            "review_text": "You get to play as the ♥♥♥♥ing badass mother♥♥♥♥ing Romans, and I'm all for that. It's just that after about 5min into the game all the armies rebel and kick the ♥♥♥♥ out of you",
            "review_score": "1"
        },
        {
            "review_text": "Not a great game!  It is similar to Europa Universalis IV, but somehow quite lacking in everything!   The good: - Same as Europa Universalis IV, but with roman country and army name of the time - The sound and music were ok - The family tree and traits of the leaders of Rome are interesting and bring more color to the game. You can have children, friends and rivals! Some of your leaders are completely useless just like in real life! Internal political bickering from time to time is fun.  The bad: - The game doesn't even work after you install it via steam. You have to fetch the latest beta patch 2.36C from the Paradox forums to make it work (hassle) - Research seems to take forever. So you got nothing to build most of the time (i tried only the earliest campaign. Maybe you have already unlocked research in the later ones). Still its far too slow compared to EU4. Also the 5 leaders you assign to research don't seem to change anything at all. - The concept of claiming a territory is still present in this game, except you cannot claim new territories like in EU4. This concept is that when you invade a territory, you cannot annex it and add it to your empire unless you have (or forged) a claim on it. Most of my diplomats time were spent doing that in EU4. In this game, it seems you can't annex a territory unless you conquer the whole ennemy territories. That's pretty bad! Some of the ennemy has 15 or more territories and becomes an almost impossible task to do! - You can colonise unclaimed territories from barbarians, but not if the strength of the barbarians is too high! So you need to wait forever for them to do an uprising and crush it to lower their strength and then colonise (Never happened after years(in game) of play). That is a very bad concept right there.  - For some reason, a 2 territory empire can witstand the mighty rome empire consisting of 8 territories plus the super lucrative Rome territory(which is equalt to 4-5 territories on its own)! I swear the freakin...g Epirus had an army of 20 troops when i could barely foot 36 troops in the field. They also had an 11 trireme navy! And they managed to attack me 2-3 times with 11 troops? WTF! How could they make that much money to support their troops? How could they even build that many troops in the first place? You can only build one troop at a time on one territory and it takes 90 days for the cheapest troops, the other takes longer if you have the ressources for it. The guy had horses which even rome didn't have for god sake and elephants!!! - The game feel pretty flat compared to EU4. I don't know it's like its empty somehow.  Now i didn't play the xpansion vae victus. Not sure i will play either.  Verdict: Don't waste your money on this game. Play the much better Europa Universalis 4 which this game is based on. Or go play Distant Worlds, a faaaaaaaar better game than EU4 in my experience as a strategy game and its in spaaaaaace!",
            "review_score": "-1"
        },
        {
            "review_text": "About as exciting as watching paint dry and as time consuming as getting a degree in nuclear physics. The sheer randomness and volume of events makes any attempt at getting a handle on things almost pointless!",
            "review_score": "-1"
        },
        {
            "review_text": "Timeless classic",
            "review_score": "1"
        }
    ]
}