{
    "app_id": 234330,
    "name": "MARVEL Puzzle Quest",
    "release_date": "2013-12-05",
    "developer": [
        "Demiurge Studios"
    ],
    "publisher": [
        "D3 Go!"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Puzzle",
        "Match 3"
    ],
    "achievements": 0,
    "positive_ratings": 2341,
    "negative_ratings": 1051,
    "price": 0.0,
    "description": "The Marvel Universe comes to life in the original match 3 RPG!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/234330/header.jpg?t=1555462568",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Pentium 4 3.00GHz or better Memory: 1 GB RAM Graphics: Intel HD 3000 / Nvidia GeForce 8600 GT / ATI Radeon HD 4650 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Sound Card: Windows Compatible Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have played this game over 350 hours, and I have only put $1 into this game, which was when I first started playing. Personaly, I do not recommend that anyone put money into this game because a lot of people have already done that, so the outcome would be rather disapointing, but that is left to your discretion.   This game has very interesting machanics for a puzzle game and the fact that it is Marvel is very cool. I also enjoy the animations for the character abilities. Additionally, the story content is usually humorous and fun to follow.   The game has changed in a few ways over the last year.   First, when I started playing this game it was almost imposible to win in PvP or random events because people that put lots of money into the game had better characters at much higher levels. However, I continued to play and found ways to deal with it. But there is better news for new players. The game has been switched so that players are paired with other players around thier average level. So basically add all your character levels and divide by the number of characters. This machanic also tries to push people away from the idea of getting one high level character because it would offset your team average and put you at a disadvantage in a higher tier.   Originally, there were certain lower level characters with overpowered abilities, which have since been nerfed or changed to even out lower tiers because earning certain characters is a chance of luck and not everyone is lucky enough to get those characters early on.  I think the game has overall changed for the better, eventhough there were a few changes I didn't like.   As a new player it would be much advised to play through most of the STORY content in order to build a decent team and obtain COIN to purchase more character slots (I would advise that you use COIN ONLY to purchase character slots because you dont get a lot and it costs more and more for ever 3rd or 4th slot obtained).  I hope this was insightful. If so please rate it as helpful.   Thanks and enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "You can play or you can pay. People who cry this is pay2play, are kids who want to win without spending money, or wihout hard work. This game is free to play, without almost any limits because: - Premium currency can be obtained by playing/from daily rewards - 3 star heroes (mostly the best) can be obtained also from daily rewards, or from daily quest. - There is nothing that you can buy to ensure your succes in a ladder.  If you dont like progressive game, where you must do something to wind and build your 'army' , you will propably call this P2P. This game is not for people who dont want to spend time in it.",
            "review_score": "1"
        },
        {
            "review_text": "A good mindless time waster. Pay to win, but those with patience can avoid the need to do so. The PVP is kinda pointless, you're playing your team against anothers, but the other's is computer controlled. A good way to kill some minutes while working on something else.",
            "review_score": "1"
        },
        {
            "review_text": "Love it, it's free! Pay to win is not as bad as most say, it will always take time and patience to be in/win a tounament style game.  The old comic covers and the new ones are awesome art work that is always fun to look at.  Collecting heroes and using them to smash other players faces in is the definition of High entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "Many people says,this is pay to win game. I play this game for 2 months maybe.I havent spent single $ in this game.I already have 34 heroes.Without problems,i can end in TOP places in tournaments.Money mostly WONT help you with winning anything - only allows you get and lvlup heroes faster. This game is great,you can do everything without spending single $.But if you want to be really good,you must spend a lot of time in game.Especially tournaments need your time if you want to end at good place (and win good heroes,premium currency etc.).  Good is,premium currency can be obtained in game just by active playing (daily activity,quests,events ...)",
            "review_score": "1"
        },
        {
            "review_text": "This is good attempt to make F2P from Puzzle Quest. There are only familiar PQ battles - no pets, no equip, no locks - only the battles. But they are quite good. And the upgrading Marvel heroes instead equip makes it interesting too. There is one problem though - the new heroes requires a new slots, and without slots you most probably will miss your special rewards. But game was quite generous to give me 7 slots from initial questing money, and later... well, I shell be able to manage it later. But if you want the many different heroes, fast, prepare to pay.  As it's F2P, payment or grinding for battle wins expected, as usual. All your heroes lose life force during the battles, and it can be gained only with time - or with the health packs-&gt;donations. So if you want a long games, prepare to pay. For me and my half-hour sessions it's all right.  The game have quite a big amount of NPC-grinding locations, but most challenges came from PvP battles in special events. Unfortunately, most of time (but not always) it means losing. For my non-buffed heroes one-two battles per day is manageable, but rarely more. But as rewards are much bigger than loses, nothing to complain for me. If I cannot kill today's enemies, I'll farm NPC instead.  Bottom line: good PQ-like game for 20-30 minutes per day. Can be frustrating for longer.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game! Very similar to other block matching games, but the 'team-vs-team-esque' component was a new twist for me that I really like. Some characters seem really unbalanced, and a lot of the game seems kinda like a money-suck. However, you can still progress in the game and it is still thorougly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "OK, like the game overall. WISH IT WAS PROPERLY PLAYTESTED FIRST. Missions that are listed as 'easy' or 'normal' I'm losing repeatedly, because the oppositions 'powers' are 1) way too cheap on AP 2) way to damaging for the cost 3) non-named opponents gain AP too quickly. Combine those 3 and the missions are not easy or normal. Game has huge balancing issues in general. ",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game. Exceedingly better than my expectation.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun and addicing you shold try it and also its fun competing with friends in this stategey game with your favourite marvel heroes, this game keeps you entertained for long!",
            "review_score": "1"
        },
        {
            "review_text": "Funny addicting 3match puzzle game :)",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzle Quest 1 and 2. If you enjoy the Marvel Story from Avenger's Allience, this game continues the story! It's pretty cool :D",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun for the whole Family !  I really enjoyed the hours i had with this game! Unfortunatly it wasnt even 1. But the dialogues are so nice created , nobody really knows whats going on , because everybodys just saying his text without giving ANY attention to what other characters say. All in All the game is soooooooo nice , i really love it , i have to stop playing it otherwise im in danger being addicted to it. Keep care of yourself while playing , i dont want to live without that game anymore!. Byebye good old gaming world.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for 60+ hours and yes quite fun, especially if you liked the first PQ.  However, the more I play this game, there are just flaws which get a bit annoying: 1) Sometimes you don't get all of the rewards when you place in a tournament  2) Customer service hasn't responded after 4 days. 3) When you play against others, you're playing bots using their characters, not real vs.  I've enjoyed this game, but I find myself playing less and less...",
            "review_score": "1"
        },
        {
            "review_text": "An amazing Marvel themed Puzzle game that is 100% Free to play. You can have a team of your favorite Marvel heroes and villans which have unique powers. The game has Rpg elements like leveling up Hero/Villans, assigning moves that can also be Leveled up as well. Its a very inovating puzzle game and has me coming back to it again and agian and this is goming from someone who never plays puzzle games. Wether you're a fan of Marvel or a fan of puzzle games this game will appeal to you  ~Kappagaro",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This game is as addictive as cocaine, very strategic and tingles that CCG-player's collector sense, not to mention the fabulous Marvel attire. A must for Puzzle Quest fans.",
            "review_score": "1"
        },
        {
            "review_text": "Great game overall, the  best one in Puzzle Quest  series. If you ever had any interest in Puzzle Quest then look no further.  Characters are closely represented with their respective unique powers, and new heroes are added regularly.  Events and storyline are just perfect for newcomers and casual players, but players who spend more than a couple of hours a day may find it thin and repeating. With the addition of health system, the server load should be guaranteed and the ranking ladders will not be owned by marathon players.  It is truly a free to play game where you have no obligation to spend anything. As for winning, it's down to how much time spent against other players - just like every MMO games out there. Money can only help making the characters stronger, not the time needed to complete the matches.",
            "review_score": "1"
        },
        {
            "review_text": "Like WTF people keep saying oh no pay to win game is ♥♥♥♥ well go ♥♥♥♥ yourself I didnt invest a single dollar into the game and so far I am doing great got alor of 3 star covers there are 4 star covers from here to there but the important thing is you don't have to invest money in the game to be nbr1 just have to play hard",
            "review_score": "1"
        },
        {
            "review_text": "PC version:less player less completition easier to get rank rewards , inactive allience means its hard to get rewards in allience event(age of Ultron) Mobile version:more player more completition harder to get rank rewards , active alience means its eaiser to get rewards in allience event(age of Ultron)",
            "review_score": "1"
        },
        {
            "review_text": "PC version:less player less completition easier to get rank rewards , inactive allience means its hard to get rewards in allience event(age of Ultron) Mobile version:more player more completition harder to get rank rewards , active alience means its eaiser to get rewards in allience event(age of Ultron)",
            "review_score": "1"
        },
        {
            "review_text": "A fun addictive match 3 game, with a decent enough twist to keep superhero fans interested, be careful tho, you can easily sink real money into this game to level faster",
            "review_score": "1"
        },
        {
            "review_text": "I like this game alot. Fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "very fun and amusin for latenight hours when you are resting from dota2 :)",
            "review_score": "1"
        },
        {
            "review_text": "Game is a lot of fun and would recommend to anyone that likes Marvel or things like bejeweled, considering they are the same type of game",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Improves on the previous games.",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty fun, at first, then it gets incredibly frustrating seeing how many people are , from the look of it, months and months ahead of you..except that some actually pay for progress. You don't really have to pay if you don't mind moving along in a snail's pace, but you'll get there, eventually. They started requiring that you use certain characters to be able to progress through certain events in order to finish in a good place (good place has better rewards etc etc) , so you either won that specificy character last event, or you purchased it, or you are pretty much destined to finish in a place other than first throughout the event. You can also link up the mobile version with this one so you can play the same account on both devices, takes a few days to get them synced, however, it took them 8 days to sync mine. It's a nice game, though, hopefully they balance it out between F2P and P2W.",
            "review_score": "1"
        },
        {
            "review_text": "I'm having fun. On the surface, it's a simple colour matching game. Easy, right? Anyone can do it. As a Hard Core Casual gamer, I really appreciate that. No timer, no hand eye coordination and instant decision making required. Yeay!  It's also 'Free to play' or supposed to be. Don't believe it! It's addictive. Like... like... shopping for a shopaholic. I'm a shopaholic. Having said that, I'm well aware of my gaming budget limitations. So i've spent enough on this game to buy a PS4 or so my friend tells me. I don't really care since there are no games on a PS4 that I can actually play and my PS3 works just fine. The games on my Playstation watchlist are all coming out on PS3 anyway. So, my game budget can handle this. I just wish Steam would stop blocking me, all the time. I'm nowhere near $2000.00 in 24 hours.  Anyway, back to the game... Past the surface there are strategies and tactics that make the battles interesting. Different enemies change the feel and style of play required to win and so it keeps being fun. It's very grindy if your gaming budget or Steam doesn't allow you to buy what you need to level up your characters. BUT if you're not a PVP ♥♥♥♥♥ it doesn't really matter. Take your time, wind down after work with a game or two and eventually in a few... errr... years... ^_~ you'll get there eventually. I've only been playing for a few weeks, but I've paid for my character levels in cash. You get a present everyday you do play a game or two and if you care to play in the PVP arena, the rewards are more consistant than in the PVE games where the reward randomiser can give you the minimum reward heaps before surrendering the good stuff. It seems to be getting better, but that might just be my imagination. I didn't collect any data to compare last week's drops to this week's.  The only downside at the moment is that the PVE content seems very limited. There's a Prologue which I have completed, though not obtained all the rewards and no sign of 'Chapter 1'. There are PVE Events, but because they are of limited time... go on holidays without your computer and you miss them. If your team isn't at a sufficiently high level, you may only be able to complete the first few fights before the opponents get too hard to fight. Then you're stuck grinding those same few fights, your team can manage, to get enough points to reap the rewards on offer in the time that the Event is on for.   There's even PVP Events - lots more of these, with Lightning Rounds and Tournaments you have to pay to play in. I'm not much of a PVP player and once the teams I have to fight get too hard as my ranking climbs, I lose interest until I can level up my characters to get a chance at winning again. BUT by then the PVP Event, is over. Hmmm....  I'm much more interested in Chapter 1 and the continuation of the Story started in the Prologue. Don't tell me they continued the story in past Events, cause I wasn't there to play them and when do they become Chapter 1?  That's the MAJOR downside of this game. There doesn't seem to be anything beyond the Prologue.  So you ask yourself why I'm recommending this game?   Because I'm having FUN!   Read a few other reviews and the forums and there are all kinds of grumbles about its inadequacies. BUT when all is said and done, it is a FUN game. It is an easy game to pick up and play, and once you get started, the character and power combinations become intriguing. It gets addictive simply because someone like me whats to collect them all and see how well, or not, they work together.  I might wish for more permanent content... maybe there will be. I can only hope. In the mean time I'll be having fun with what is there.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Candy Crush for nerds...I like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game combines card game and bejeweled into a great mashup. It has a great variety of characters, and each event usually brings in a new character.  They have just introduced alliances as well. It is hard to search for alliances if you do not know the name.   Please search for the alliance name: FahQ[/b]   Send an alliance request for consideration. Enjoy! ",
            "review_score": "1"
        },
        {
            "review_text": "For another basic match three game, I have been remarkably entertained. I blame the plot and skills and leveling up. Best free game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "like candy crush (abd rumbling marbles) but much better",
            "review_score": "1"
        },
        {
            "review_text": "Marvel Puzzle Quest is a tipical block combining game that adds to the game the marvel universe/heroes to give some diversity and fun collecting/leveling the heroes.  Every heroe has diferent habilities and you can fight in 3v3 battles combining the strenghts of your heroes to progress through the game. You start with 3 basic heroes after doing the tutorial and you have to manage to lvl up using the ISO points you obtain by winning battles. Some battles on the campaign gives you extra heroes or hero points (hero points are the ones you need to have extra slots for more heroes).  Its a bit slow at the beginning because every time a hero takes damages, it needs time to restore his hp, so whe you have only 3 heroes it can be a bit slow to advance. But as soon as you have 5+ heroes and reach lvl 10+ with some of them, you can keep playing almost indefinitly without having to spend real money on the game. Paying real money on this game only gives you a faster progression, but you can manage to do everything just by playing the game.  If you like puzzle games its worth to try this one, just have in mind the first few hours are a bit slow if you dont invest real money.  ",
            "review_score": "1"
        },
        {
            "review_text": "Marvel puzzle quest is an Good version of Bejeweled with the addition of Marvel heros. If you like playing Bejeweled and like Marvel it will give you something to do.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Puzzle Quest 2, if you love the Marvel Universe, then you should give this title a try. If you say no to one or both, then skip it :D:",
            "review_score": "1"
        },
        {
            "review_text": "I'm not one to be suckered in my free games usually, but having enjoyed games like Bejewelled and Puzzle Quest in the past, I figured I'd give it a try. At first, I played a few times, and then stopped playing for a few months as I wasn't sure if it was really my thing or not. I'm not sure what made me decide to try it again one day, but as you can no doubt tell from the hours I've got recorded playing this game, I kinda liked it... just a little ;) It's likely that it was the whole 'feemium' thing that turned me off to start, but this game is generous enough to make you want to keep playing without NEEDING to spend money.  I've never been a comic fanatic or anything, but I've always enjoyed the characters from the Marvel universe, and loved watching the old cartoons like X-Men.  Over the years I've been playing this game, I have spent the odd bit of cash here and there, but I don't think the amount I've spent would only come to around $30 I'd say.   The team at D3 are continually adding new features and characters which keep my interest, and I am a member of an alliance with a group of firends who play, which makes it a little more fun, being able to discuss things with the group. It also allows you to get extra bonuses, as when your alliance members do well in events, the whole alliance will get rewards.  This is a great game to play while having my morning coffee, as it's quick, yet rewarding, but at times during certain events, can be brutally difficult (Damn ninjas!! *shakes fist*). It wouldn't be much fun if it was a walk in the park though! It's also great that they have daily events, which keeps me coming back to see what's new and what else I can get! (This unlocks after you've played through a certain amount of the single player, so don't give up too soon!)  If you've ever played match 3 games, and enjoyed them, I can't recommend this one highly enough. Building up an ever expanding roster of characters as fun as the game itself!  In my opinion, it's by far the best of all the Puzzle Quest games that have been released, and I even though I have spent many years playing this game, I can't see myself stopping any time soon!  I notice a lot of people don't recommend this based on their not being able to sync with their mobile version, but I've only ever played on Steam, and as such, I haven't come across any of those issues. They seem to say that they're given in game currency for free (Hero Points), but you can also get that in the PC version. Perhaps the amounts you get are different or something? I don't know as I've never played the mobile one, so if you only plan to play on PC, don't let that deter you, as you can get free HP in this version too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is entertaining and addicting. It is much more than your basic match 3 game and can have a much greater audience. The ability for growth in the game is there, and there is always something to do and new things to try. Highly recommend if you want a quick 5 minute game or to sit for hours playing this awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Bejeweled, but fun, and challenging.  I have put more hours into this game, than I have into my actual life.  I suggest everyone avoid getting sucked in, because I literally schedule my day around this, and the stupid Alliance I'm in, is so awesome, I'm afraid to take a hiatus.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for roughly two years on the iPad &amp; iPhone, and although I've taken a few breaks, I generally play it every day. I find it to be a somewhat repetitive but still enjoyable game. Mechanically the battles are done using a match-3 mechanic, like a bejeweled game. It's not hard, but I'd say it's more challenging than Candy Crush or other similar games. The tricky part is that there's a paper-rock-sissors element to the characters, and you need to match enough a certain color gem to enable a hero's power to be used. Like many other free-to-play games, there are two currencies, one common and another rare. (plus a third, command points, which was recently introduced and can unlock much stronger four or five star characters).  The real key to success in this game is patience and persistance. It's somewhat pay to win, but the truth is that I'd say it's pay-regularly-to-frequently-win, or play-frequently-and-do-ok. If you just keep plugging away, your characters will continue to improve, and you'll stay reasonably competitive for a long time. It's fairly easy to play entirely for free, though I'll admit I found there was a point somewhere around the mid-two-star level where I coughed up some actual money in order to not lose characters. In retrospect, this was unnecesary, but I didn't realize it at the time. I'd recommend reading through some of the great guides on the marvel puzzle quest forum for advice on which characters to keep and which to get rid of.  I think the most fun part of this game, over time, is that the developers truly seem interested in keeping it alive and interesting. I like how they keep introducing new mechanics. I feel like sometimes they don't entirely think through the result of their actions on the way that people play the game. For example, right now with new command points, rewards for people like myself working on their four-stars is definitely skewed to PvE rather than PvP. I don't know if the developers did this intentionally, or just don't realize it. But whatever. It's still fun, and somehow it's more fun for the fact that they're not entirely polished and thoughtful in their actions. Some people get bent out of shape about this, but I actually think the chaos that comes with each new game mechanic or meta-change keeps things fresh.   I'd recommend it for the tablet or phone. It's the perfect game to play once or twice a day over lunch break.",
            "review_score": "1"
        },
        {
            "review_text": "I read up on a lot of reviews before playing this and they heavily recommended against the free to play game because of the Pay-To-Win methods. Microtransactions are present and I can see where they're all coming from however this game is still a good game.  For being free it provides the basic advantage of being there for you to play if you've got nothing better to do. The game isn't really one where you can sit and spend hours upon hours playing but it is great for a few minutes between things if you need to burn the time. For example, I play league of legends with my friends and always find the wait between matches about 5-10 minutes long with champion select and the loading screen included. Therefore I can get a few matches of Marvel in and still enjoy the game for what it is.  After playing this game for almost a month I can finally see some serious problems as to why people wouldn't want to play this game. Even after a months time I'm unable to really collect higher level characters due to their rarity and the slow process of collecting coins to buy roster points. The game heavily presses for the purchase of coins however they're so damn expensive it would have been better for me to just buy the damn game for $60 to unlock everything. Which to be honest wouldn't even get you everything in this game since everything is given to you by chance.  Either way after this month of playing I've still found myself getting one for a few matches and putting it away. Having fun and still progressing through the game even if it is slow. I recommend everyone to pick it up as a game to have on the side but it is definitially not a game I would spend all day playing.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive, free to play, jewel matching. Hero powers and damage variation of colors help add an element of stratgey to the board play. The RPG elements of collecting heroes, leveling them, and building the best team combination are the driving motivation. The story and delivery are nothing great, but what are you really expecting from this type of gameplay? The down time (hero recovery) period can be frustrating sometimes, especially when just starting. There are always events and tournaments happening that are enjoyable and can provide great rewards. Overall, this game is a great pass time and does NOT require any real money to advance (as so many reviews claim), have spent $0 and havent had any issues. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. Micro-Transactions are there but it is possible to play without them very easily.",
            "review_score": "1"
        },
        {
            "review_text": "I am not the biggest fan of freemium games since most requrie that you spend money to progress through the game. I wouldn't say that this one is the exception to the rule, but you can certainly enjoy the basics of the game without having to pay money to continue playing. I put in around 30 hours before I decided to pay 9.99 to add some ways to preserve some characters that I started winning. If you're willing to grind or play smart then you can certainly put the time in without spending a dime. I highly recommend playing the multiplayer section in the Danger Room to add some quality upgrades in a relatively easy manner.   A couple quick cons - the newest update added a penalty for skipping hard multiplayer battles. It's not a huge penalty, but if you're in management or free mode then it's going to take a bite out of upgrading. I'd also like to see some of the prices come down a bit to make it easier to save your rewards if you don't want to spend money.   Otherwise, this can be something to enjoy between FFVII or Metro:Last Light games.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly fun time waster. There's more depth to it than initially meets the eye thanks to the character system. Play for free and spend gold only on more character slots and you'll have a fine game for the price of free.",
            "review_score": "1"
        },
        {
            "review_text": "I flipped a bunch of tiles or jewels or something, some comic book dudes got all aggro, and I won a bunch of times. I am not exactly sure what happened though, or why, but I like winning. Still, this type of win is not really that good. I think I'll play something else. But hey, the price is definitely nice. Meh. [ 5 / 10 ]",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Match 3 at it's addictive best.",
            "review_score": "1"
        },
        {
            "review_text": "Its like bejeweld but with Marvel charactors, WIN!",
            "review_score": "1"
        },
        {
            "review_text": "It's challenging yet fun.",
            "review_score": "1"
        },
        {
            "review_text": "free to play, quick match 3 play",
            "review_score": "1"
        },
        {
            "review_text": "I love puzzle quest 1 and 2. This one is just as great. This one trades the RPG elements in for more a trading card feel. Definatly a must get.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 This is a free-to-play Match 3 game. There are MANY others like it, but I'm a comic book fan, (Slightly more a DC/Vertigo fan but still love some of the Marvel lines.) and this isn't the worst thing to happen to the franchise, or even the top 3 terrible things. *If they got Halle Berry to VO the game, it could get there...) The game itself is adequately executed (as the producers of 'Electra' should be...) It's ... well, it's Puzzle Quest, with a few Marvel bits thrown in so your power-ups share the names of your chosen heroes' powers (Iron man's Repulsors, etc) The 'Story' arouond the game... They try, and didn't destroy a load of canon to beat a storyline around the missions.  The Free-To-Play bit... Obviously they're going to try to take your money, but they don't throw it in your face constantly, nor do they ask you to 'Share your victory with a friend' every 5 minutes. If you play a little bit every day you can easily get enough rewards to make up for not paying for stuff, but if you want you can speed up your success. Just remember to save all your 'Hero Points' for when you actually need them, and you'll have them when you do come upon a need.",
            "review_score": "1"
        },
        {
            "review_text": "The Puzzle Quest series of games is by far my favorite match 3 type game. Ever since the playing the first Puzzle Quest on my DS, I've played them all and spent more than a few hours doing so (see my PQ2 stats). Although I'm not a fan of microtransactions, the Marvel addition to the family does not dissapoint. The PvP tournaments add even more replay value to a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "I have only just started playing this game, but I disagree with the other reviewers right now...  I think 'Marvel Puzzle Quest: Dark Reign' is alot of fun, I know there are a ton of optional micro transactions that you can take advantage of (operative word being OPTIONAL), and I can see where this could become a 'Pay to win' scenario on all fronts if you want it to be. Brass Tax this is a fun game, if you keep your head where it belongs (between your shoulders not in your backside), and your pride out of the equation and just have fun... If you go into this game and you are a person with a pride problem who gets his feelings hurt and throw tantrums everytime you lose, knowing this is a potential 'Pay to Win' environment with no money to make yourself cpompetitive then that is your fault, not a flaw in game design nor concept.  The storyline is humorous and moves swiftly from battle to battle, the transitions and animations are top notch so far, and the over all design makes me want to play all the time and start collecting comics again.  From what I have seen, having so far finished the first story and half of the second... You DO NOT have to pay for, nor buy anything to have a good time.   Tip: If you run out of heals and you have to wait for your heroes to regen health or revive, go make a sandwich, or grab a drink, and when you finish you will be ready to play again. (You don't just have to buy a health kit right then and there... if you do that is your fault not a flaw in the game... Personally I go play the android version of the game on my phone while I wait for the heroes on my desktop to recover, that way I can play as long as I want to with no real interruptions .  -Peace-",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ all the haters, this game is very badass, think of it as like candy crush right, but more content &amp; leveling up your heroes, ive played it only a few hours and it is really amazing, those who dont recommend it dont have taste in games like these, amazing game, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "tis a really addicting game... PLAY IT!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The game is a simple Jewel Matching game. It's fun, as your team has a variety of abilities based on the matches you make. I've played it for an hour or two, an I find it to be a fun casual game.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Steam Cleaning - Marvel Puzzle Quest&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Super Fun! I was gonna buy puzzle quest but instead got this. I did spend some money on getting extra roster slots (10$) so that I can have a few different heroes, which was worth it. Today I just got a legendary drop, (Invicible Woman) which is sweet. I got her out of a standard pack which is crazy. I highly recomend this game, very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, you can't go wrong with a free to play match 3 game. However, it's nothing more than a port of the same game already on mobile devices. And the basic mechanic is a bit simplistic compared to Puzzle and Dragons. If you haven't already played this on your iPhone, give it a try otherwise it's a pass.",
            "review_score": "1"
        },
        {
            "review_text": "This game is getting a lot of flak for having micro transactions, which is true it does have a number of boosts or tokens you can buy to cheese your way through the game, but that can all be pretty much ignored. Each hero you use has HP which can get hurt during a stage, heroes automatically heal themselves over time or you can use a medikit for a full heal which auto regenerates over time. This kind of mechanic can be seen in a lot of F2P games like Farmville or Travian. I had gotten though the first level/city/whatever without needing to spend a dime and in the second area boosts made an appearance which yes, you can buy, but you will also receive free boosts just by playing. The only thing that got on my nerve is each stage has 2-4 rewards for beating the level which are unique the first time you receive it, but then if you would receive that same reward you get a paltry 20 ISO (in game resource) so if you want a full clear you have to continually do the same stage over and over.",
            "review_score": "1"
        },
        {
            "review_text": "Having played a ton of match-3 games I can safely say that Marvel Puzzle quest is one of the better options out there. Solid gameplay, frequently updated, tons of free stuff and new content roughly every 2-3 weeks. All of your favorite Marvel heroes in one game with many more to come. Unfortunately the game has become a bit of a grind fest with players having to sink in some 2-3 hours a day. I personally don't mind it but if you don't fancy playing for that long you might want to skip the game.   My advice - give the game a go. Solid, fun , decent match-3 game on par with some of the other similar titles like Gems of War and Duelyst.   Fan of the match-3 genre and superheroes? Give it a go, do it some justice and get hooked.",
            "review_score": "1"
        },
        {
            "review_text": "This another take on Sweet Tooth web browser game,just with a Marvel Flare and Power ups.Its a very casual game, so if thats your style of game its good past the time.I think you will like this one.",
            "review_score": "1"
        },
        {
            "review_text": "great game ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ yes Marvel Puzzle Quest you are Puzzle Quest with Marvel bits. And because you're F2P and I will never give you a penny, you have a built in 'stop playing this now Stu' feature.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good, if you are a Puzzle Quest fan, check this one out.",
            "review_score": "1"
        },
        {
            "review_text": "Is Very Gud Game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a FTP! esp if you love Marvel. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Enjoy the whole game. Only drawback is how often you have to play a mission to close out the rewards, had to replay one about 8 times before getting anything other than 20 ISO.",
            "review_score": "1"
        },
        {
            "review_text": "A highly polished amalgam of CCG, RPG, and match-3 puzzle, MPQ brings it all together seamlessly. MPQ features PvE and PvP play with a myriad of customization options, perfect for casual and hardcore players alike. Throw in frequent updates based on Marvel universe current events and releases, and you have a solid, free-to-play game any fan can enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet a very satisfying experience!",
            "review_score": "1"
        },
        {
            "review_text": "Mobile version is better in almost every way. The game is still fun but the GUI is very clumsy and the graphics are not as good as the Android version.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game to kill some time.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable game, been playing for over 400 days, still playing it daily. Not too F2P-friendly though, yet managable with time and effort. My favourite pair-3-game anyways...",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you have time to sink into ranking up your characters.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, but the computer CHEATS.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game love it!",
            "review_score": "1"
        },
        {
            "review_text": "GAMEPLAY Basic design is 3-vs-3 team of super heroes where each hero has 2-3 powers and they level up with XP. You do Bejeweled style color matches to build up the powers and activate the power which either affects the board to your favor (like forming defensive shields, invisibility for your character, bleed damage tiles, secret trap tiles, count-down timers that have some affect, and many other tile types that are essentially damage, buffs, debuffs, heals and so on). As time goes on and you win matches you gather both XP (called ISO-8) and character covers (new characters, new powers, or level-ups for existing powers). You build your character, you level them and have fun.  MODES There are two main Modes: 1) Story - You play a storyline with a lot of different types of teams you fight and this is called the 'PvE' side of things in the game.  2) Versus - You play matches against the computer where they other people's teams are computer-controlled.  Both modes very fun.  MICROTRANSACTIONS Microtransactions do speed up the game for you but are NOT required. You can start out easily and keep playing it and you will easily get good characters reasonably quickly. Alternately, spend $5 to $20 like a normal game and get your boost.  PROs The game is very well designed.  There is a lot to do and the devs are constantly working to add more and fix the existing,  Many fun events all week long.  Great gameplay that is easy to pick up but the strategy is deep.  All your favorite Marvel superheroes. It simply is a good addictive game.   YMMV Microtransactions help you speed things up.  CONs Currently the only downside is that the PC version and the Mobile version are kept completely separate so if you start on one you are stuck using that version as all your progress is limited to that version. This *needs* fixing but so far nothing. :/  TLDR You are doing your gamerself a disservice if you don't spend at least a few hours playing this game. :) It is excellent and strongly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so amazing! It's like candy crush with a story and choseable chrathers! It's extremly addictive! Mico Tranacions are the core of this game but I haven't and will never spend money on the game! It's just a whole lot of simple good fun! I have BF4 and GTA5 but puzzel quest is my favoriate thing to play since I got it!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I play it every time my five health have replenished and when my heroes are healed. I love the gameplay because it is very fluid and the powers are woven in to where you feel almost like you are playing a fighting game as opposed to a puzzle game. Great time killer and nothing feels better than when you unlock a 5 star character until the moment your realize you don't have enough hero points to buy another hero slot so you have to loose one, earn more HP before the card expires or delete a character you were working on previously. All of this I get and appreciate because it feels challenging to me. I think that for a F2P game I honestly do not feel forced to pay whatsoever. Other than not being able to link my account on my iPhone with the one on steam I recommend this game to everyone that loves puzzlers, super heroes and a blast!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, but wish it were easier to earn coins.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, the most addictive game I have played in a long time",
            "review_score": "1"
        },
        {
            "review_text": "Fairly decent FTP game",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. It's a lot like Bejeweled, and Candy Crush, and [stick Bejeweled-like game here]. Yes, it is. But, it also has RPG features. You can collect, train, and level up heroes. You can teach them new powers, and train those powers up. These powers play an essential part in each MATCH. Yes, I said match. Each level is a battle against numerous villians.  The story-line is the same as Marvel Alliance and Marvel Heroes.  I'd give it a 3.5 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "Like Candy Crush? like Marvel? well then this is the game for you!easy to learn but difficult to master with dozens of characters to choose from and several storylines this game will keep you occupied for days if you let it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the few match 3 games that don't actually suck.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended for Marvel fans. The game per se isn't very inspired just a Bejeweled clone. Fans of the franchise will have fun with character dialogues and art.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this one, it's simple to play and the combinations of heroes are awesome. Really worth all the time and money I've put into it.",
            "review_score": "1"
        },
        {
            "review_text": "Just 1 problem, you can't create a new games , 1 misstake you drop the game and 1 way to correct mistakes is use $$$$$",
            "review_score": "1"
        },
        {
            "review_text": "I would suggest this game to anyone who doesn't use an ipod or ipad and has access to the computer.",
            "review_score": "1"
        },
        {
            "review_text": "I've never played any other Puzzle Quest games before, but I am a big fan of Marvel comics and decided to give it a go. It's amazing! Simple tetris-style puzzling mixed with some RPG elements all wrapped in the skin of Marvel characters. If you like either puzzle games or Marvel comics this game has got you covered!",
            "review_score": "1"
        },
        {
            "review_text": "looks bad but is cool",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but requires decent amount of patience :D",
            "review_score": "1"
        },
        {
            "review_text": "It's an alright puzzle game. 5/10",
            "review_score": "1"
        },
        {
            "review_text": "I've never played any other Puzzle Quest games before, but I am a big fan of Marvel comics and decided to give it a go. It's amazing! Simple tetris-style puzzling mixed with some RPG elements all wrapped in the skin of Marvel characters. If you like either puzzle games or Marvel comics this game has got you covered!",
            "review_score": "1"
        },
        {
            "review_text": "So yeah, it's another match-3 color game. I saw a lot of people say it is not as good as the original puzzle quest and yet it is a very fun and addicting game. Beyond the basic mechanic of lining 3 colors to progress you have many interesting features. First of all, you have to collect hero cards(which drop randomly after a game was won, or you can buy them). Before the start of each game you can select 3 heroes to play with. Each hero has skills, which can be activated if you accumulated enough gems of a certain color.  The game is lacking in some social interaction options, but the developers update the game from time to time and balance heroes. In the end it's a very colorful and addicting game, and hey, who doesn't want to make their own superhero team.",
            "review_score": "1"
        },
        {
            "review_text": "Great platform and once you learn how things work, it's lots of fun. Hours of match-3 madness with a unique RPG twist.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best and only puzzle game i would consider playing good game play I espcially love the battle system wrapped withing a puzzle match em up style its clever and enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "Judging by a /massive/ negative feedback this game seems to generate in the review section, this is going to be unpopular.  To begin with, there is a false belief that the game is purely pay to win. In my humble opinion, that is totally untrue. Sure, the game offers a lot of things that make gameplay easier for irl cash.  But the core elements, are completely free to play. I mean, it's a friggin match-three gameplay, they don't tell you to pay for borad smasher or something similar.   Even the cards can be obtained without paying anything, just by playing the game.  What is more the things that you pay money for, are largely irrelevant in the grand scheme of things, as even the PvP is in fact done vs not-a-human.  The only problem, is the health regen ratio for characters.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun block breaking game similar to other puzzle quest games that let you use powers based on which colored blocks you break. You can level up your heroes by collecting iso-8 given after story matches or by playing other players and collecting multiple covers allows you to add to and increase your powers. You can play the game without spending any additional money but it will require some time investment - so be aware of that.",
            "review_score": "1"
        },
        {
            "review_text": "ok game, wish i could link it to have my phone/facebook to it and not have to start from scrach.",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun, but loses all elements of a fast paced puzzle game with the healing process and a trading 'cover' game to unlock powers/upgrade them.  Still can drag you in for a couple hours and that's what F2P is all about.",
            "review_score": "1"
        },
        {
            "review_text": "Fun match three game, certainly as a comic book fan and a match three fan I've been enjoying it very much. The game does have micro transactions but I haven't felt any need to use them and don't imagine I will. If you enjoy match 3 games I would recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I personally enjoyed this. While the game does push microtransactions at every turn, to buy slots for heroes, to merely upgrade heroes and beyond, I still got enjoyment out of this game. That being said, the actual puzzle quest titles are better, solely for the reason that they are games you've already paid for, thus play differently.  To actually get a hero, you'll have to have a comic book cover for them. To actually make said hero practical, you'd will search for 10-13 covers for each hero. In turn, you get a ton of comic book covers from all sorts of sources. It would be nice to have something to do with the 10's or 100's of covers, for heroes you've already maxed out, other than selling them for 100 ISO. It would be nice to perhaps combine 5 1-star covers for a 2 star cover, for example.  The hero slots are also quite limited, requiring premium currency to expand. That being said, by spending all the hero coins the game gives you on those slots, getting 10 slots of heroes is fairly manageable. You can get a lot of coins from events, as well as set rewards. It would be nice to have more of those rewards though. With the current event to recruit the Hulk, it's quite annoying when most of the level options are marked as 'impossible' since there isn't much for scaling. The difficulty might give a general idea, but it's far from accurate. I'm not sure if the difficulty marker is for my top heroes, or the current line up from the previous battle.   It's far from perfect, but playing a game I haven't paid for I'm expecting some rough edges. This is rougher than most. To give a scale of how much I enjoyed this game, it would range between 6 and 7.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice little game which can be played from time to time",
            "review_score": "1"
        },
        {
            "review_text": "The rightful successor of the first Puzzle Quest game.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best looking game but great addictive fun!",
            "review_score": "1"
        },
        {
            "review_text": "GAMEPLAY Basic design is 3-vs-3 team of super heroes where each hero has 2-3 powers and they level up with XP. You do Bejeweled style color matches to build up the powers and activate the power which either affects the board to your favor (like forming defensive shields, invisibility for your character, bleed damage tiles, secret trap tiles, count-down timers that have some affect, and many other tile types that are essentially damage, buffs, debuffs, heals and so on). As time goes on and you win matches you gather both XP (called ISO-8) and character covers (new characters, new powers, or level-ups for existing powers). You build your character, you level them and have fun.  MODES There are two main Modes: 1) Story - You play a storyline with a lot of different types of teams you fight and this is called the 'PvE' side of things in the game.  2) Versus - You play matches against the computer where they other people's teams are computer-controlled.  Both modes very fun.  MICROTRANSACTIONS Microtransactions do speed up the game for you but are NOT required. You can start out easily and keep playing it and you will easily get good characters reasonably quickly. Alternately, spend $5 to $20 like a normal game and get your boost.  PROs The game is very well designed.  There is a lot to do and the devs are constantly working to add more and fix the existing,  Many fun events all week long.  Great gameplay that is easy to pick up but the strategy is deep.  All your favorite Marvel superheroes. It simply is a good addictive game.   YMMV Microtransactions help you speed things up.  CONs Currently the only downside is that the PC version and the Mobile version are kept completely separate so if you start on one you are stuck using that version as all your progress is limited to that version. This *needs* fixing but so far nothing. :/  TLDR You are doing your gamerself a disservice if you don't spend at least a few hours playing this game. :) It is excellent and strongly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Not a big fan of micro-transaction games but hey, it's free, it's got Marvel characters. Good time sink for every now and then. Just be aware that your options are pretty limited if you don't want to spend a few $$$.",
            "review_score": "1"
        },
        {
            "review_text": "Yes its very fun the only thing I dont like is the whole option to buy 'hero points' I would rather their be ads even and thats annoying. I wish they had balanced out the money system in game and removed option to buy replaced with speacil character skins and characters, or even extra story arks or something. But dont let that keep you from enjoying this game. Perfect for passing time while multitasking or waiting on something, easy to pick up and leave going if needed.",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and fun, but typical puzzlequest game with Marvel storylines. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "More adictive than yo might think",
            "review_score": "1"
        },
        {
            "review_text": "Have been playing this on the IPad its fun, Could use a feature to sync up with the IPad version. Would give this game a 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I know it looks like a simple matching game but there is some strategy involved and the fact the Marvel Universe is used just sold it for me.",
            "review_score": "1"
        },
        {
            "review_text": "Well it is free. So you can't complain. If you do complain, you are likely a bad gift receiver.",
            "review_score": "1"
        },
        {
            "review_text": "GAMEPLAY Basic design is 3-vs-3 team of super heroes where each hero has 2-3 powers and they level up with XP. You do Bejeweled style color matches to build up the powers and activate the power which either affects the board to your favor (like forming defensive shields, invisibility for your character, bleed damage tiles, secret trap tiles, count-down timers that have some affect, and many other tile types that are essentially damage, buffs, debuffs, heals and so on). As time goes on and you win matches you gather both XP (called ISO-8) and character covers (new characters, new powers, or level-ups for existing powers). You build your character, you level them and have fun.  MODES There are two main Modes: 1) Story - You play a storyline with a lot of different types of teams you fight and this is called the 'PvE' side of things in the game.  2) Versus - You play matches against the computer where they other people's teams are computer-controlled.  Both modes very fun.  MICROTRANSACTIONS Microtransactions do speed up the game for you but are NOT required. You can start out easily and keep playing it and you will easily get good characters reasonably quickly. Alternately, spend $5 to $20 like a normal game and get your boost.  PROs The game is very well designed.  There is a lot to do and the devs are constantly working to add more and fix the existing,  Many fun events all week long.  Great gameplay that is easy to pick up but the strategy is deep.  All your favorite Marvel superheroes. It simply is a good addictive game.   YMMV Microtransactions help you speed things up.  CONs Currently the only downside is that the PC version and the Mobile version are kept completely separate so if you start on one you are stuck using that version as all your progress is limited to that version. This *needs* fixing but so far nothing. :/  TLDR You are doing your gamerself a disservice if you don't spend at least a few hours playing this game. :) It is excellent and strongly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the puzzle quest games you will likely enjoy this. There is a small twist with each character getting attacks by scoring gems but otherwise it is more of the same fun.",
            "review_score": "1"
        },
        {
            "review_text": "Such an addicting game that I have to uninstall it every semester in order to focus on school. Or maybe I just need to work on my self-discipline.....nope, it's totally the game's fault.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "this game is great and super addicting, but my only problem is you can't sync your mobile account  ",
            "review_score": "1"
        },
        {
            "review_text": "very fun game love it!",
            "review_score": "1"
        },
        {
            "review_text": "Dun gamr to play while watching tv. :)",
            "review_score": "1"
        },
        {
            "review_text": "Out of all the games that exist on steam, this seems to be my favorite. Simple time killers always get the most attention.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Free. And quite literally, at the moment I still haven't found any content unavailable for free. Should, however, one decide to pay for the premium bonuses, their duration is counted in actually played days rather than calendar days. - Quite an engaging and interesting combination of match-3+ with colour based character skills. - Apparently the little tidbits of dialogues are quite in character. Can't verify this myself, having never read any Marvel comic books, but even so I do find them fairly pleasantly amusing. - Grind is rather random, but still far from boring. Cons: - It can get somewhat frustrating at times. Untill one levels a character or two to breeze past the bump.",
            "review_score": "1"
        },
        {
            "review_text": "Just a match 3 game right? Well yes, but the heroes powers can be triggered to help you win adding extra strategy element. There's some level grinding and a card collection sytem to keep you coming back again and again.  You can do well with no money and patience but paying players can also get an advantage to ensure the developers get some money for their efforts",
            "review_score": "1"
        },
        {
            "review_text": "Micro Transactions galore.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game, but the path chosen by the developers makes this one of the most frustrating experiences with a game I have ever had. The hours I have listed on this game are not technically accurate as I had it running in the background for days/weeks at a time. However I have easily put in 100's of hours into trying to like this game, hoping that the devs would fix the issues and it would improve. Ultimately I finally realized that there was near zero chance that would happen because the devs want the game to be this way.  First the lets talk about the good - If you enjoy PuzzleQuest you will like the mechanics, the incorporation of the Marvel license is topnotch both with writing and character design. If you can be content with just playing the story missions and only a small subset of the available champions then go ahead.   However if you are like me and want to play with the new champions when they are released and play the special events then you will pay. And if you pay realize that it is only a matter of time before that which you paid for is nerfed or sidelined or otherwise invalidated by whatever the newest cash grab from D3 is.  Here is how it works, lets say you have a set of beginning characters (called 2 star for their rarity) and are having fun. You see that a new character is being released (omg Nick Furry?! I want to play that one too!). In order to get covers for that character you have to buy them with real money, oh except you can't really buy them straight you have to buy a 'pack' and hope you get the covers you want (along with a bunch of stuff you don't want). If you aren't willing to go that route then you will have to jump through some very specific hoops, namely you will be 'competing' with other players for a chance to win the cover. You do this by direct competition (through a very very broken PvP style contest that I am not even going to get into its so bad) or by grinding away at special missions, missions that are designed to be overpowering and that will wound or kill your characters (requiring you to 'rest' or buy medpacks with money). I don't know if I can stress how grindy these missions will be if you actually want a shot at the new cover, we are talking hours of playtime, but what is even worse is D3 picks the times you need to play. This is ultimately why I had to stop, in order to be successful with the rubber-banding and the like you had to be playing near the finish of each sub-event and each main event. That means you can't even just grind it out on your own time you needed to be hardcore during specific hours (forgot real life commitments). What I finally realized was there is no end game. That process described above is it. It doesn't get easier just harder, and not from a skill level just from a time commitment and frustration level. D3's entire model is to reward low level players greater then high level players to make them think rewards are quick and easy. Once you are hooked however you will constantly lose you chance at the new covers to the next wave of new players getting their hooks set. No only do I not recommend this to anyone I would be very cautious about ever playing anything from D3. ",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy the gameplay. It could be a really awesome game...... I said COULD be. But the DLC and the mecanics of the game that make it nearly a must buy totally ruin it.   I was in the top 50 in the opening competition and I have the Black Widow character to prove it. I have not spent any money in DLC yet but I see the mechanics of the game that make it nearly impossible to play long term without doing so. This is coming from someone who has spent a good deal of time playing this game. I've also played previous games in the series like original Puzzle Quest and Puzzle Quest: Galactrix.  In order to increase your roster size you have to pay coins, which are nearly impossible to get without paying real money. If you don't add a character to your roster within 7 days the character goes bye bye. That means you have to either delete a character that you've probably built up or spend real money.  If you want to continue to play you have to keep your characters healed. However, there's no way to get healing other than wait forever, which stops you from playing, or buy them, which requires real money again. If you want to build your characters up any faster than a snails pace you have to spend real money again. Around every corner of this game is a need to spend real money.  Folks, there is a good way to do DLC and there is a bad way to do DLC. This game is a shining example of the bad way to do DLC. I would have much rather paid $20.00 for a great game then had options to buy non-gameplay breaking DLC such as special skins for the hero's, backgrounds, or gem skins. As the game stands it deserves every single comment it receives about greedy developers.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, after moving to my iPad and playing for over 8 months, I can tell you how good this game was and how bad this game is right now.  To start with, the old Matchmaking system is fairly easy to adapt to. You get to see opponents based on the points you have earned. The old system is really harsh for new players to handle at first but you will be able to handle it without no trouble later. Before the recent health changes and the nerf to mulitple heroes, most of the new released heroes (Starting from Iron Fist onwards) are completely broken to the point that destroys the fun out of the entire game.  After the Matchmaking changes, only new players can find easy and fair fights while transitioners and most of the players without full level roster could no longer climb up the rank. Some heroes were nerfed to a point which are uplayable. The developer promised a buff for Inivisible Woman a year ago and ended up nerfing her even harder.  With all the recent disappointment, many veteran players are leaving MPQ. So if you are a new player and finding this game extremely easy, good luck, because you will find the game so hard to play with once you decide to level up your heroes. So, make sure when you play as a new player, keep all your hero unlevel for the rest of your life. I promise you, it will make your game, very enjoyable indeed.   This review shall be my parting gift to the developer and ♥♥♥♥ YOU VERY MUCH! (never in my life have I written a game review with a foul word, this time, I use it glady in your face)",
            "review_score": "-1"
        },
        {
            "review_text": "So, Puzzle Quest + Marvel sounds like a good idea on paper, doesn't it? Well it is, but not with this kind of execution. The short ammount of time I put into the game feels wasted, and here is why: The game tries to leech you out of your money where ever it can. You had a fight and your characters are injured? Too bad, that you have to wait until they are regenerated. Don't wanna wait? Better waste your money on some health packs so you can keep playing without downtime. This is the worst kind of F2P game you can get your hands on, because it actually punishes the player for attempting to play it. Don't waste your time with the download. Play Puzzle Quest and be happy, it's a much better game with less hassle for a small entrance fee.",
            "review_score": "-1"
        },
        {
            "review_text": "Supposedly this was a good game when launched. Since I've been playing, they have done nothing but made it worse. Characters that were depended on to heal (and therefor increase your playtime) had that ability taken away. Other characters were weakened as well - beware if you depend on anyone to long, that person will be nerfed without warning! Additions such as 'team ups' were added with obviously no testing put into them - everyone I read online and in my alliance pointed out horrible problems with them day one. This was yet another addition that removes health from your characters, in a blatent attempt to extort more money out of their userbase.  DO NOT think this is a 'free to play' game. It is not a 'pay to win' game, it is a 'pay to play' game. The developers have ignored user feedback and implemented changes that constantly make it more difficult to play any session longer than half an hour. God help you if you are in Europe (with horrible ending times) or here on Steam (where you can't play when the developers want you to).   To keep their older userbase they add the rarer characters every other week, but this means for the new user you'll have to pay cash up front for roster spots to have any chance to collect these. These rares are hard to find: it also means you'll have a year of playtime before you can compete with those who had their characters built up early on from a smaller character pool.",
            "review_score": "-1"
        },
        {
            "review_text": "Very hard to make significant progress in the game without spending a good amount of money.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun game but gets quite repetitive after a few matches.",
            "review_score": "-1"
        },
        {
            "review_text": "Grinding, money leeching free-to-play for those who love Marvel comics and match-three mechanics. Not a Marvel fan, not a fan of grind, not a great fan of match-three? Then skip it.",
            "review_score": "-1"
        },
        {
            "review_text": "Update 11/11/16: Yep, still negative. If you like games you can play in small bits and want an active player community, this delivers both.   If you don't mind massive amounts of time and moeny being burned to progress, you'll do well.  BUT if you insist on playing, DON'T play it on Steam. Play it on iOS or Android. The devs continue to offer better rewards to mobile players via in-game advertising and Facebook integration. They say Steam API will not support these features .... and offer NO compensation.   If you play on Steam you will be one of a small minority, competing against an ocean of better-compensated mobile players.  That's this year's disaster. See below for last year's 'high' point.  ______________________  Short version: Stay away.  Longer version: Gameplay is fun but very, very shallow. Content, in the form of characters to burn resources chasing, is continually expanding, while new story content or gameplay expansion remian few and far between. It's extremely repetitive and grindy.  This game launched in an anemic and hilariously unbalanced form, and has come a long way in 2 years. It's growing and being proted to consoles. Great.  It does still have a fun tightknit community that can be accessed via the dev's forum. That's the best thing about the game, the other people playing it, not the game itself. Hmmm.  It is probably the prettiest match-3 game around .... that isn't saying much. The game mechanics, after 2 years of bolt-ons, are held together by baling wire. Unintended results abound and are discovered the hard way by players.  Play it casually for awhile and then move on. God help you if you allow it to become a habit. (See those hours logged? There but for the grace of the gods go you.)  The worst is the dev's inept attempts at communication. Spectacularly bad. Here is a great example ...   This week is the game's 2-year anniversary. It centers on a new event, a battle against Galactus. The blance of the event is laughably out of whack; the ONLY way to win is to make use of exploits (which the inept developer failed to catch ...). Other events running concurrently are suffering from various bugs, and the anniversary rewards have been found to be WORSE than the normal in-game rewards (Happy anniversary!)  After the event runs for a day, and the online community is thoroughly hacked off, the producer posts the below. Judge it for yourself. _____________________ Hey all,  Wanted to share a few things about how Galactus works and what we're expecting versus what we're seeing.  To start, it seems like a lot of people are on a basic disconnect here, looking at the boss battle similar to how Ultron ran in terms of how things work. Meaning that Ultron should be going down pretty regularly. He's powerful, but his real power lies in the fact that killing his body doesn't stop him. You need to crush every one of his drones and main bodies to win. So winning rounds is a pretty regular occurrence. Game-wise, what this means is that players won fairly easily against Ultron and took their lumps against the drones. The stopping timer there was health packs based on when the drones finally wore you down. What this also meant is that the higher end Alliances would chew through the entire Event in about 12 hours and let it kinda sit for 3 days.  Galactus is different. The 'minion' fights against the villains are relatively simple. They're there as minor hazards but relatively easily winnable. Galactus on the other hand is a massive threat. He's not going to be stopped by gnats. Iron Fist punching him in the toe isn't very painful. So he gets bored and swats them away. In game terms, this means that players are going to be beaten. Winning a round against Galactus is an achievement. You're supposed to lose. Every time you do, you're still chipping away at his life. It's an exercise in damage in aggregate. Over the 3.5 days, hitting him over and over to finally bring down the big bad is somewhat slow, but certainly effective.  Overall, most of the higher end Alliances are in Round 6 or knocking on the door to Round 7. Which is actually slightly faster than we were expecting people to get just based on the math. So everyone's doing pretty darned well in terms of progression. There are some teams rockin' the Winfinite, other teams that are pushing through with some interesting strategies (who woulda thought OBW would be a rock star against Galactus?). Not many Alliances are getting anywhere near full clears. Which is actually intended. You're supposed to lose your Health Packs on Galactus, rather than against the minions like on Ultron. It's also why we changed up the play method for this round too so that it's not just a flip flop between Ultron and minions till you win. There's a set number of times you can hit Galactus before you need to take a break to let minions refresh. That break means that you have plenty of times for Galactus drained Packs to refresh while you can go in and get some Black Vortex in. Or play Simulator (up soon). Or get your Devil Dino on when that starts up. It's a different design than the rush of Ultron where that was pretty much all players did while it was open.  Long story short, you all are doing really well against Galactus. Yes, the gameplay is different. I'm sure most of you aren't used to going into a battle with the idea that you may well lose. But given that you're still pulling out wins with pretty strong regularity, I don't see any reason this wouldn't continue into Rounds 7 and 8, and on to Cyclops awesomeness.  At the outset, going into the boss battle, you're looking at winning like normal. After all, it works elsewhere in the game, and it worked against Ultron. So suddenly getting rocked by Galactus is a shock. Keep at it. If things are really going to go poorly, we'll look at doing refresh timer changes and the like that we can do server-side as a quicker band aid style fix for run 1. After that, we'll figure out what we want to do for difficulty on run 2 (and any other runs that we do in the future, of course).",
            "review_score": "-1"
        },
        {
            "review_text": "How I played the game is I didn't like it in the first hour or so of play, but for my hetic lifestyle I found that I was able to come back to it again and again because I'm a huge fan of the puzzle quest series.  It was the perfect game for me since I could do other things at the same time while playing the game. Needless to say why I've put so much time into it (although about 100-200 hours I accidentally afked in the game.)  However with the recent changes the game is more like a facebook game then an actual puzzle quest game. It's just a poor game now. It's become completely Pay 2 Win and if you want to play the game you need to do a bunch of BS and jump through hoops to play for longer then 30 minutes a day. Due to this I can't recommend the game to anyone anymore.  Before it was a nitch game that I'm sure some people could love (certainly not all) despite the setbacks it has, but now I'd say everyone should just walk away. Do not touch this game with a 10 foot poll.",
            "review_score": "-1"
        },
        {
            "review_text": "Started fun, then became pay to win. Not so fun after that.",
            "review_score": "-1"
        },
        {
            "review_text": "A decent game if you like Marvel and Puzzle Quest, but it's riddled with microtransactions.",
            "review_score": "-1"
        },
        {
            "review_text": "F2P, then become money grab",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, made much less fun by free-to-play ♥♥♥♥♥♥♥♥♥. Would love to be able to just buy the game and play, rather than have timers and energy and transactions - I don't think you can call up to $99.99 a 'micro' transaction.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't be fooled by the free to play label. The game is fun and addictive, the way most match three games are, but not worth your time. Recently the devs removed healing, while pushing their brand new health pack deal. Play time is now limited to a few minutes at a time. It is too late to join kids: you will never make it to the top. Enjoy your endless terrible one stars: three stars are next to unattainable. Unless you buy. And not just a little: this game eats money.   Hey devs. Fix the healing. Your forum thread has fifty pages full of complaints. Fix the healing.",
            "review_score": "-1"
        },
        {
            "review_text": "The customer support for this game is the most inept group of people I've ever had the pleasure of interacting with, not only does it seem like every response they send to you is a pre-written message, but you really get the feeling they're not even reading your emails. I've had better customer service from Time Warner and I'm not even joking. If you like Puzzle Quest this game is ok but God help you if you purchase anything because you will not get any help from the customer service. after my third email to them and again it just seems like pre-written messages back that have nothing to do with what I'm asking, they tell me I will not be receiving any more support because they think I'm harassing them or something even though they're not helping me. I will definitely be uninstalling this game and this has made me seriously think twice about ever making purchases in a game ever again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was fun and quite a nice addition to the PQ and Marvel universe... when It was in the preview. Now thats its up to Launch version it has changed.... Its no longer F2P with Micro-transactions.... Its now very much a Pay 2 Win model. They added a new 'reward' to the PvE events... a measly 20 crystals which literally is worthless that seems to be the standard payout for playing a sometimes long and drawn out battle with the AI. The 'Tournaments' that you play in are just other player teams controlled by the AI, which tends to make them either total blowouts or impossible. Its next to impossible to advance now without paying and most of the high end content in simply impossible to play effectivly without investing significant funds into the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a fun variant of puzzle quest, if you can stand the free to play wait 1h or buy more playtime now. A pc title should not have this nonsense!",
            "review_score": "-1"
        },
        {
            "review_text": "A 'free-to-play' puzzle quest with Marvel characters. If that's all it was, it might have been a fun game. There are a lot of issues working against it though. You're supposed to collect cards, but since you only have a very limited roster, you only want to keep the most powerful cards you can find or just stick with the main couple cards you start out with because they're the ones that level up. If you don't make room for them in your roster, new cards disappear. There's no way to measure your roster's progress on leveling up; when you do level a card up, you have to spend the crystals to actually increase the level. Most of the puzzle rounds have multiple rewards (I guess to push 'replayability') but evidently the rewards are randomized so that you could play a single round dozens of times but never get all 4 rewards. I don't mind that the cards must 'heal' when they take damage during a round, but the more powerful the enemies, the more damage, the longer time they have to heal. Eventually you can only play 2 or 3 rounds before your entire roster is down. So you have to grind for rewards but can't grind because your team's down. If this was a tablet game, it wouldn't be a big deal; on the PC, why play a game only as long as it takes to start it up? Of course, this is all not a problem if you're fine with paying lots of real money for the tokens.",
            "review_score": "-1"
        },
        {
            "review_text": "I love puzzle Quest and i understand how Free to play work.. But this game cost too much. Especially, the part that you have to unlock 1 hero slot for a money. and in this game they have like more than 100 + heroes with various version.   don't ever waste time playing it or you will end up spending with a wasted feature.",
            "review_score": "-1"
        },
        {
            "review_text": "I quickly felt like spending money was required to get through the game. I don't mind freemium games keeping the good content for the paying players. This game made me feel like I had to buy my way out of difficult levels by buying better characters. The game itself was a fun match 3, and the possible characters and the different versions were nice.   Skip this one, and play one of those Steam games you actually paid for and never played.",
            "review_score": "-1"
        },
        {
            "review_text": "really bad game. could be awesome and have great possibility but support don't do anything, to many cheater and to many bug like many missions who become impossible to play with ennemy level 255 or more. Pay to win, need to spent many to have a little chance to win. and sometime when you are on the top (4th) and playing a lot, just after 8hour to sleep all cheater wait last seconds to come and you down at 75th . you play a lot and do not downgrade and at 8 or 9 last hour you grow down a lot. support don't do anything to let you pay to bought card ... trust me or not, just try this game for 2 or 3 week and you'll know it. go to the facebook page, read comment ... but just be carefull don't spent any money in 2 or 3 month and after you'll know the true.   très mauvais, aucun support présent lors de probleme (sur facebook le groupe renvoie au site et le site lui ne répond pas lors de probleme meme apres 2 mois d'attente et des relances) tout est fait pour être du paye to win, si l'on débourse pas massivement ça ne sert à rien. le jeux avait un énorme potentiel et aurais put aller très loin seulement le cheat est énorméménet présent et les developpeur ne font rien pour pour exemple vous etes 4eme en jouant tout les jours un peux (et en pouvant faire de bonne pause) et lors des derniere heures a 8heures de la fin vous perdez et passez 75eme car les cheater (soutenu par les développeurs) prennent le top du classement ainsi cela incite a payer pour de meilleur capacité bref je vous déconseil totalement (au pire essayez jouez 2 ou 3 mois sans dépenser le moindre centime ne dépensé rien et attendez et seulement après vous déciderez et verrez si je ment ou pas) mais attendez avant toutes dépense car la triche et l'ignorance du support sont la source clef du jeu",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the utter definition of pay 2 win. With cash roadblocks at new characters, new skills, skill level ups, and healing, expect to find yourself grinding the same missions over and over hoping to make enough funny money to have a chance at earning a character that is strong enough to beat the next stage and having to wait up to a hour(at least for 30 and under) real time for your characters to heal back to full health. Since you can't level up without having more skill levels, and leveling up lower level characters is pointless anyways since their skills do not scale with the levels of HP, you're forced into this loop until you get a lvl 30 character that breaks the game for a few hours, until they are too weak as well. Stick with the first 3 games, because this is game is a great example of what the F2P greedy cashgrab can do to a series.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your time like I did. It's a huge P2W game now. I might also mention that the 'AI' some how manages to get huge chains of matches that instantly wipes out your team. Then you get to wait 6 hours to play those characters again only to have the same thing happen repeatedly. That's what I call fun.",
            "review_score": "-1"
        },
        {
            "review_text": "If you play for just killing the time it's ok.",
            "review_score": "-1"
        },
        {
            "review_text": "obviously a mobile game, ported with a minimal amount of care or effort to desktop. for a mobile game, I'd give it a thumbs up, but this is the desktop version, with higher/different expectations. the 'you can't play right now, you have to wait and come back again later' model just doesn't work for desktop.",
            "review_score": "-1"
        },
        {
            "review_text": "I play this one my phone, my son plays it on his tablet. and in each game you can link to your account through facebook to pull your roster and continue you progession. This version on steam... Doesn't. Don't bother if you already play on another device. not worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Not fun to play in later levels at all. Make one move and then watch my entire team get wiped out by everything falling into place for the NPC. While I enjoy a challenge I hate fighting against NPC oppponents who have extreme luck and everything goes their way. Just not any fun. Completely deleting from PC and will not be bothering with this again.",
            "review_score": "-1"
        },
        {
            "review_text": "The game play is really good... the rest of it is *terrible* and I fully recommend avoiding it. The sheer amount of money grubbing is unreal.",
            "review_score": "-1"
        },
        {
            "review_text": "Winner of worlds worst UI and Menu",
            "review_score": "-1"
        },
        {
            "review_text": "Much fun to play... only problem is your money greedy design",
            "review_score": "-1"
        },
        {
            "review_text": "This is more like a Facebook game, and the costs for things is nuts. Not to mention it glitches up quite often if you don't follow the actions it requests from you. Also, the registration for an account is rather dumb as well. Fun for a while but then there are too many things going on to understand everything, just basically this game is a puzzle with lots of bells and whistles. Pass.",
            "review_score": "-1"
        },
        {
            "review_text": "I play this one my phone, my son plays it on his tablet. and in each game you can link to your account through facebook to pull your roster and continue you progession. This version on steam... Doesn't. Don't bother if you already play on another device. not worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Been playing the Android version on my phone for about 6 months now and loved it. Hadn't been aware there was a version on Steam, so I gave it a go the other day when I found it. Why not, after all?  It's a Match 3 game. It's not complicated. It's not resource-intensive (or shouldn't be). And yet, it runs like absolute garbage (when it does load at all). My laptop is not weak, and yet you would think I was trying to run GTAV at max settings on it instead of a freaking Match 3 game.  Look the game itself is actually great when it works, one of the few Freemium games I've come across where you truly *can* succeed and make headway without spending a real cent of your money. It apparently does NOT work on PC though, so I can't possibly recommend it here from Steam. What a truly awful port....",
            "review_score": "-1"
        },
        {
            "review_text": "Recommend this game? YES!!! On Steam? HELL NO!   Get this game on your Phone or Tablet instead! Much better and runs hell of alot smoother and can be connected to Facebook... Why isnt it connected to the mobile game so I could play with my already awesome team?! Instead of having to start over... With a freakin Tutorial and then realizing I cant play with my excisting account.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Just release full version and enough for stupid micro-transaction system.",
            "review_score": "-1"
        },
        {
            "review_text": "Tedius gameplay. Over agressive with the cash milking.",
            "review_score": "-1"
        },
        {
            "review_text": "This game, instead of raising my IQ, like a puzzle game should, it drastically dropped my IQ and it sucked my ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a pay to win in the most extreme sense. RNG determines if you get good heroes and even then you'd have to invest alot of money to roll multiple times to get the good heroes. Even if you get good heroes you have to shell out even more money to level them up. They do daily quests but without a good team you're simply stuck completing low level quests for mediocre rewards. Your heroes are constantly hurt after a battle so you cant just do a bunch of quests; you can do 2 or 3 and then your done for the day",
            "review_score": "-1"
        },
        {
            "review_text": "Let me get this out of the way: this is a very nice game. It combines match-3 with cardfight (not sure what they are called) games where you level up your cards. Here you level up your (Marvel) heroes by earning Iso-8 and by earning their skills. There are events that give you big prices (lots of Iso-8 or recruit tokens for more heroes).  More heroes. That's why I wouldn't recomment this game. You start with roster of 4 heroes. For every extra hero you need to buy an extra slot for Gold. You guessed it, gold is real money. Four hero slots is nothing. I played less than a day and already had 10 heroes (5 rostered and 5 waiting to be recruited).  If that part of the game was any different or if buying with real money doesn't bother you: play this game. It's nice. Good graphics, nice sound effects, good skills and there's even a storyline. For me however that's a dealbreaker. You will not progress enough if you do not buy extra roster space.  So...byebye MPQ.",
            "review_score": "-1"
        },
        {
            "review_text": "It's ok if you're 10 , and there's nothing on tv.",
            "review_score": "-1"
        },
        {
            "review_text": "A good Puzzle game that can be fun and addicting, but a lot of bad things inside it, 1st of all a Bullcrappish on MICRO-TRANSACTIONS and this game is full of it, the power boost doesn't stack beyond 10 so anything acquired beyond that gets lost in a void.   Starting with 3 to 4 Character slots and acquiring more requires you to spend in-game currency which you will end up depleting in meer minutes if you recieve better and new characters, making you SPEND MORE ON MICRO-TRANSACTIONS and they ain't cheap. Did I mention that the character slots increases it value from 50 to 100 to 150, I don't know what goes beyond that, its just ridiculous.  Don't get this game if you don't wanna spend more than $5 which can only get you 3 to for new character slots, so its a waste of time esp. if the slot value increases everytime you buy a new one.   ITS A GOOD GAME, BUT LEAVES A BAD TASTE IN THE END. DEVS SHOULD FIX THEIR PRICING...GREEDY BEASTARDS.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is such cause you can't save and play in another computer.",
            "review_score": "-1"
        },
        {
            "review_text": "It eats up 75% of my i5's power, turning my PC into a space heater, just to play Bejeweled.   Good job Marvel, you're sticking to that low bar you have for your games.",
            "review_score": "-1"
        },
        {
            "review_text": "This game only gets a 3/10 from me. It's fun to an extent, but unless you're willing to dump some serious coin into a game its pretty worthless. Takes way too long to get any good characters (unless you're lucky) and even if you do, you're stuck using a level 40 with one move unless.... (you guessed it) pay money and try to get more cards. I understand that it's F2P but good god why all the microtransactions?!",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth Free!!! You can get better games on here for less than a $ and you won't be getting pushed to buy crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Although it incorporates many of the mechanics from its namesake, and art/characters from its theme, the game seems to lack depth and character development, instead relying on grinding or payment for character progression.   The character artwork looks nice in combat as well as cutscenes, and the party system with character based skills is interesting with a good amount of variety, using the puzzle quest style of gameplay. This is overshadowed by the unfortunate fact that you will most likely not get access to all of the character skills and upgrades without grinding or paying for 'hero tokens', or hoping that an upcoming event has a chance to win an upgrade for your preferred character. As the difficulty increases you may need to ditch interesting low level characters for random high level ones just to keep up with the stat scaling.  With better RPG and leveling elements I could recommend it, otherwise it feels like a chore to upgrade the characters you enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "More of a slot machine than an actual game.",
            "review_score": "-1"
        },
        {
            "review_text": "Marvel Puzzle Quest is meant to be a puzzle game with RPG-ish elements where you can level up your character and increase the damage of their attacks by spending points on them. The thing is that you rarely get these points (coins in-game). You can tell that this game is the typical free-to-play game when they hit you with the fact that you either have to waste health packs on your heroes to recharge their health or wait 10 minutes to heal your heroes. Marvel Puzzle Quest is really designed as the average mobile game where you come back after your characters are able to be used (i.e. Injustice Mobile). So this is a Marvel version of puzzle quest, which is basically bejeweled except your actions control characters' attacks. There is a cool factor to this where you can increase the powers of your heroes by using resources you collect (Iso-8 Crystals) BUT you can't even purchase these upgrades until you purchase another 'layer' of your character... AND THE THING IS that you can't do that without COINS, YES RARE ♥♥♥ COINS!!! Level 1 upgrades are 125 coins and I just want to point out that 200 coins costs 2 DOLLARS!!! Why do the creators try to screw us like this? But besides this In-Game-Purchase BS, the story really isn't even interesting, and the dialogue is quite boring. If only the heroes and villains had voices behind them it would be more interesting. This game does have some pros to it buy mostly cons. Not recommended...maybe to puzzle quest fans and very patient people but it doesn't change the fact that this game has tedious recharge times, boring dialogue and an uninteresting story.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't mind the game, but until I can sync my account with the phone version, I won't be playing this on steam",
            "review_score": "-1"
        },
        {
            "review_text": "This is game can not be more pay to win. In fact, it is the a pay to play game with typical waiting for 'health gauge to fill up or pay a price'. Even though the card arts are fansy and card types are abundent, it is no reason for develop to charge this much for a game. Please every one stay away from it. Play the classical puzzle quest, please.",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Reminds me too much of a Facebook game.",
            "review_score": "-1"
        },
        {
            "review_text": "  This game is one of the most exploitative games I have ever played. Everything in this game revolves around micro payments..... are your characters too weak? Well the only way to level them up to a competitive level is to spend real money. Want the best characters? Well by the time you get them, your roster will probably be full and you'll either have to sacrifice one of the characters you've spent a long time levelling up or spend real money to extend your maximum amount of heroes on your roster. You know who the biggest baddest Marvel villains are in the game? The Maggia ♥♥♥♥ing Muscle. Way to make you feel like a real super hero when you're getting taken down by some ♥♥♥♥ing thugish goon who boosts your enemy's strength way beyond anything you can compete with, Seriously. If the grid is just plain against you, these guys will murder you because the mafia produces guys that inspire strength beyond the ♥♥♥♥ing Hulk. Not recommended, even slightly.",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely boring. Money blackhole. Avoid at all cost.  0/10  Why a zero? Cause its a cow clicker game, that is designed to rob people of their money. And it's generaly a crap game all togheter.  Peace.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a win more game with small pay to win aspects. The way to gain levels and new powers is to win tournaments, so it's very hard to make ground if you aren't already one of the 10 strongest players in the world",
            "review_score": "-1"
        },
        {
            "review_text": "Ready for mindnumbing action? Presenting Marvel's Candy Crush Saga.",
            "review_score": "-1"
        },
        {
            "review_text": "Pay to win, just do yourself a favor and skip this game.  There are plenty of free games out there that are built more like 'pay to get a huge bonues for awhile' or 'pay to up your chances of getting hero cards &amp; upgrades.' . Not 'PAY TO PLAY OR DONT PLAY AT ALL'  This is more like a slot machine, oh yeah your gonna lose. The computer is built to FORCE you to lose some rounds. Its stacked against you because without that they make NO MONEY. So of course your gonna lose, and lose quite a bit. Then you'll see suddenly you'll win by a far margin.   Its just dumb...",
            "review_score": "-1"
        },
        {
            "review_text": "My experience so far...The first hour was fun! Really, really fun! The second hour wasn't bad.   The third hour, I'd realized that in fact, yes, you CAN play all the way through a game where you're only 'unlock' for that level left is a cover or charicter token, and get a 20 crystal card several times in a row for no discurnable reason instead. So, that's kinda a problem.  Do you like choosing between laying out significant real world money? Do you like deleting charicters you've spent hours leveling up? Do you like deleting charicters you JUST got in a drop but don't have a space left to play with it? If you can answer 'yes' to one of those questions, this is a great game for you.  Honestly, if I could get the entire game for $15-20, I'd say go for it. It's a fun little puzzle game...but I wouldn't put a dime into this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I just wanted a nice little Bejeweled clone with a Marvel theme and this is everything but. :(",
            "review_score": "-1"
        },
        {
            "review_text": "I tried this out when they first released it. Then with their new updates my characters got weaker because they fundamentally changed my character's ability in order to balance out the new characters they introduced. So I stopped playing.",
            "review_score": "-1"
        },
        {
            "review_text": "what just happend ? after i run the latest patch, my acc just reset. im starting from the beginign now. why ? how ?",
            "review_score": "-1"
        },
        {
            "review_text": "as the Devs clearly just want to get as much $$$ as they can and almost each patch introduces new ways to Pay to Win, I strongly discourage anyone to play this game other way than casually.",
            "review_score": "-1"
        },
        {
            "review_text": "UPDATE: after last R45 update game is still loading in cycles only and unable to start. Also don't understand, why such simple looking game needs graphic card GF 8600 GT equivalent and is not working on my notebook (with older card, of course) This is casual game, jesus christ...  game itself is much better and suitable for mobile phones. I tried first android version, quite better, playing a lot. Collecting cards, trying to level up, finding the strategies... perfect for pocket play:-) Not so good for computer...Also technicaly - horrible textures, almost no animations, user unfriendly interface, not much convenient controls.",
            "review_score": "-1"
        },
        {
            "review_text": "Addictive gameplay combined with all of your favourite Marvel characters (and Hawkeye) should make a great game, but this one is just a freemium cash-grab. The developers continue to nerf characters and scale back rewards, all while ignoring the game's massive progression wall. The pricing structure is ridiculously expensive and the characters and experience rewards necessary to progress are a very slow grind.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This is a F2P 'match three' game built on the standard Puzzle Quest model of 'matches do damage.' There's also a limited PvP element, as your team is matched up against other users' squads of three heroes.  It's a hugely grindy game, and you are pressured to make IAPs through a mechanic where you're granted new heroes pretty regularly...but they expire if you don't claim them. You're constantly squeezed for slots to keep the heroes, and the in-game currency comes far too infreqently to actually buy slots in a timely manner.  It's not a bad Mavel themed time waster, if you enjoy the basic Bejewled game mechanic, but I can't recommend it if you actually want to collect and play with good decently powered heroes.  Note: I've played both this and the iOS versions of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not play this game i can not stress this enough. At random intervals you will lose all progress and will not get any help back from support even if you have spent real money on this game. the game play was addictive but after losing 55 hours of progress and a 40 day play streak as well as $50 in real money down the drain to this game, i can not recommend this game till it is fixed or they get better support",
            "review_score": "-1"
        },
        {
            "review_text": "Huge cash grab, not horrible, but the original puzzle quest is much better.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like bejeweled and you're a fan of marvel super heroes than this is an awesome combination. For me the bejeweled basics with the hero element added on top is fun to play with. The way to progress through the levels however isn't.  The game mechanics work in a way that you use your hero during combat and you steal points from your opponent. Your opponent does the same to you. When the round ends, your hero ends with a number of life points left. This number of points slowly regenerates to full health. This makes the game a combination of waiting and playing.  The money to invest into the game to keep playing without interuptions isnt worth it. Although it got me a bit hooked on the game, playing regular bejeweled is more fun for the money involved.  If this game would be realeased as a paid title I will be interested to play it, but not in the current format.",
            "review_score": "-1"
        },
        {
            "review_text": "Sad that game tells you to buy starter heroes and once you waste your credits it doesn't give you the starter heroes if you already purchased one previously. If you buy Hawkeye or BlackWidow, dont buy the other one, you won't have space and you cannot delete heroes already attained to ensure room when you spend credits. So loose credits and no new character if you already have 4 heroes. Needs Work... 3 1/2 Stars of 10 based on the hour i spent playing it, and I have quite a few Puzzle Quest Games for many consoles.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a pretty cool game, though they still need to do a lot to improve it.  First, let's talk about 'freemium'. This is one of those games where you can buy tokens to get things faster. That's fine. But the prices are so outrageously expensive (as are most freemium games) that there's not a chance in hell that I'm going to actually buy anything. The prices are so high that it's clear that their only interest is in milking stupid people and teenagers (but I repeat myself) for every coin they own. And they'll make a lot of money doing that. I just wish the rest of us could play. The prices are set high, to milk about 5% of their players, while other people who are willing to pay (like me) are too smart to pay their current absurd prices. So, it's not going to last me more than a week, because they don't want my business.  Second, ever heard of tooltips? Right-clicking? Apparently this game's programmers haven't. I know it's basically a port of a mobile game, but that doesn't excuse anything.  All of its problems aside, it's actually a fun game, and I really enjoy collecting and leveling characters. But again, I wish they would allow me to participate more in that.  UPDATE: I played for a while after I wrote this, and discovered that after a certain point, it's impossible to progress without paying absurd amounts of money for characters, skills, character slots, etc., so I had to change my recommendation to 'no'.  I'm not expecting this game to be 100% free, but I do expect it to be reasonably affordable.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a cash grab pure and simple.  Seriously.  I started the game was forced to buy the default chars, fine. This game is PAINFUL to get started. Everything is painful unless you pay for coins to unlock better cards... no joke.. I can't upgrade my characters because I don't have gold, They don't reward you with gold that often... In my area one map I earned about 150 gold ... it takes 525 to buy an upgrade that way .... So now you have to grind the exact same level over and over for crystal and you need 400 to get a shot a crap pack in the hopes to get the same char you already have inorder to unlock and ability to ACTUALLY LEVEL THE CHAR UP SO THEY GET MORE HP.... Everytime you get hit with a progress blocker your reminded that you can pay real money to get past is.  I just fought Dr Doom in the first act. He blasted all my lvl 2 char's and my second attemp went worse than the first. So all my characters are dead and reviving then after that they have to heal ... UNLESS I PAY GOLD...  I say steer clear of this game.  If you want to see it in action for yourself you can watch Totalbiscut on youtube first look this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game still pay to win. Don't waste your time here.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't seem to link to android without facebook, uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "While i like this game... unless you are paying for stuff, it becomes to become difficult to play due to the difficulty of the enemies. and then i have losst my game progress not once, but twice so far. this last time i lost 75% of my progress and resorted to a very early save for some reason. I am no longer willing to put my time in this game if my progress is gonna keep getting reset.",
            "review_score": "-1"
        },
        {
            "review_text": "Not only is this a huge money making scam in the form of continous urging of microtransactions but it results in incredibly frustrating gameplay as it continually denies you due in-game rewards. It's the main reason I uninstalled this piece of ♥♥♥♥ after it wasted too much of my time. AVOID it all together! There are way more games out there deserving of your time.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a fun game. Now they just keep fing it up. They keep changeing it with out FIXING the BUGS. The game makers love to take your money then destroy your covers.  So as far as I can tell ther a buch of THIEVES.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent enough if you don't care about maintaining value. The devs have this nasty way of bringing out an overpowered character, drip-feeding covers so that only those who spend money can get it, and then nerfing the character. ♥♥♥♥ this noise.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't seem to link to android without facebook, uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "Played alot on mobile and i can tell you one thing this game is pure pay2win with ridiculous prices in shop.Although without this it could be fun game.For negative point it is also that you cant migrate your save from mobile:/",
            "review_score": "-1"
        },
        {
            "review_text": "I just wanted to match icons, not try to navigate an annoying UI and sit through just as annoying  clipart  cinematics.  This game is just a really awkward turn-styled, pseudo-rpg, Kind-of-a-strategy-game-but-not-strategic-enough-to-feel-like-it 'match 3 gems or more, and then wait 30 seconds before you can do anything' time sink. And not the good kind.  It is, however, free to play. So there's that.",
            "review_score": "-1"
        }
    ]
}