{
    "app_id": 234490,
    "name": "Rush Bros.",
    "release_date": "2013-05-24",
    "developer": [
        "XYLA Entertainment"
    ],
    "publisher": [
        "Digital Tribe"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Indie",
        "Racing",
        "Platformer"
    ],
    "achievements": 54,
    "positive_ratings": 553,
    "negative_ratings": 341,
    "price": 7.19,
    "description": "Rush Bros. “Discover gameplay with custom music” Rush Bros is a music reactive Platform Racing Game that features a single player and a competitive multiplayer either split-screen local or online between two simultaneous racers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/234490/header.jpg?t=1447357608",
    "minimum_requirements": "OS:Windows XP Processor:Intel Core 2 DUO @ 2.4 GHz/Athlon 64 X2 4200+ &amp; above Memory:1 GB RAM Graphics:DirectX 10 compatible graphic card with at least 512 MB RAM Hard Drive:1.5 GB HD space Sound:Stereo enabled sound card",
    "recommended_requirements": "OS:Windows 7 Processor:Intel Quad Core @ 3.05 GHz / AMD A8 3.6 &amp; above Memory:2 GB RAM Graphics:DirectX 10 compatible graphic card with at least 2GB RAM Hard Drive:3 GB HD space Sound:5.1 Surround Sound enabled sound card Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "Since playfire rewards made me play this piece of... worthless software again, it reminded me just how terrible this game is, so I thought why not review this and help potential victims avoid it.  If I had to describe this game in one sentence, it would be - demands perfection, doesn't offer precision.  The game tries to be an electro version of super meat boy, and while the music is fine and likable, the controls are just awful, everything feels very stiff, and unresponsive. The levels are by far the worst thing in this game, they are not built for speedrunning or fluent platforming at all, in fact I think they created a set of levels that were perfect for a game of this type, and then they just inverted them totally to make them this bad, they are just atrocious. Also levels sort of 'react' to the music - traps spring up quicker when faster music is playing... trust me it makes things even worse when you are achievement hunting as the ingame playlist is randomised and you can't lock it to a certain track that would actually allow a human being to beat a level in time for an achievement. Another HUGE minus would be that every time you restart a track, there is a stupid unnecessary 3 second long countdown till you get to play.  If you want an x/10, i'd give it a 4, only because of the decent music, but seriously, if you are looking for games like super meat boy, avoid this.",
            "review_score": "-1"
        },
        {
            "review_text": "Rush Brothers is a side scroller à la Knytt series with a knack for speed and precise platforming, a mix that sometimes performs well, other times lets you wanna throw your controller/keyboard off your room with the whole console or computer.   The game has been marketed as a competitive 'musically-driven' platformer and I could agree with the former adjective since the Steam multiplayer allows 'challengers' to hop in your game and play, and frankly, it's mainly not a single player experience the one granted by Rush Bros. However, aside some neat dance beats and speaker-like pulsating backgrounds it doesn't seem to me like music has ANY influence in the gameplay, whatsoever, as I was expecting something along the lines of Amplitude or Rez (the dawn of the PlayStation 2) -- at least THAT level of interaction.  But nope. We're stuck with a platformer where you can't trust springs or else you'll likely land on some sharp spikes and I'm sure that if Sonic the Hedgehog were in this game he would sue Xyla Entertainment for character abuse, and most puzzle sections throughout the levels can be pretty long and frustrating -- something that doesn't sound so 'fast-paced' after all, let alone played with other people on the interwebs.  Other than the blatant lies we were gently offered by marketing, however, this isn't a game I would consider abysmal after all. In fact, I liked the art style and I think it's pretty neat, something I haven't quite seen in other indie titles (Knytt Underground comes close but it was released AFTER Rush Bros). Not terribly original, but it's surely an upside. ...and that's it, really. I contributed to the game soundtrack as Forgotten Dawn back in the days, it was a good experience, but honestly, I always muted the in-game music. I preferred silence and the lonely game sound effects over the generally ear-shattering OST.  So overall, this game is pretty subpar compared to other platformers around and it had plenty of potential at hand for becoming a truly engaging musically-driven experience, with or without friends in your lobby.",
            "review_score": "-1"
        },
        {
            "review_text": "Rush Bros. Is basically what it says in the game desc. A fast pasted platformer. Although I normally avoid platformers because they cause rage most the time to me and others I got this due to me meeting the dev. of this game. He also said there would be a hat with it in tf2 called the fuzzy wub wub that never came out, o well. Anyways this games level design changes with whatever music you put in it, causing some obstacles to move faster or slower depending on what music is playing and when the base drops in the song. Of course like i said that does cause lots of confusion and makes it so you normally die 15~100 times depending on map and if there is a checkpoint system in the map you chose. Luckily deaths are fast and they spare no time throwing you back out there to continue. All in all this game gives you enough fun for its price and its fun to play with friends and share your music with them. I'd give it... 6.75/10 I think. Gives you enough fun for your buck. (I'd recomend getting it while it is on sale during winter or summer. Although it is fun I can't see to many people playing it over 4 hours.)",
            "review_score": "1"
        },
        {
            "review_text": "Rush Bros is a interesting platformer with a couple of cool concepts. But tries too much by using conflicting concepts. The game would be better as two separate games that only use the concepts that support each other together. Because it tries to be a speedrunner where you can run against each other or alone against time. But also have different styles of level designs almost each level. Most levels you need to backtrack for keys. That's fine but not when you're speed running. The randomness of the level reacting on the music is also goes against the speedrunning. And you have some trail and error dead traps in the level design.  The controls feel a bit off in the beginning and I think it's because of the stickiness when you wallslide. In most games where you can walljump the wallslide is fast but here it's really slow. And it's counter intuitive to the speed running. It's really annoying and I don't get why they made it like this.  I really want this game to live up to it's potential. The music is great and the art style is pretty cool. It just isn't working as a speed running game. If you just play too casually complete the levels it's fine. But the whole racing against each other and time just doesn't work for this game because the developers wanted too much. It could have been an amazing platformer like Super Meat Boy or Electric Super Joy.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid platformer with good controls, fun to play while in a Skype call with your opponent. The music in the game's quite good too.  Note: To everyone complaining that the achievements are too hard: they're supposed to be. That's why it's called an achievement, you have to achieve something hard to be rewarded, instead of being spoonfed worthless messages in easy games.",
            "review_score": "1"
        },
        {
            "review_text": "Control of the character is awkward, pace feels slow (in a racing game). Unlink most other custom music rythm hybrids (Audiosurf, Beat Hazard) it doesn't seem to change anything gameplay wise. What you end up with is a mediocre stylized platformer, of which the indie game scene has a nearly infinite supply of.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game, probably one of the worst platformers I've ever played and that's saying something. even though I got it for free, I feel scammed by the low quality it presents, the controls are quite clumsy as hell and the background music ends up being monotonous and boring incredibly fast. Don't waste your money or your time here, do yourself a favor and get super meat boy instead of this crap. completely unfun.",
            "review_score": "-1"
        },
        {
            "review_text": "Rush Bros is a hardcore platformer taking after the likes of Super Meat Boy, but fails to understand any aspect of why people enjoy these type of games. Precise controls, level consistency, and a feeling of fairness all elude this game and that makes it impossible recommend.  The game's gimmick is that parts of the level move with the beat of the current music track playing. It's an interesting idea but one that shouldn't have gone past the prototyping phrase, where it should have been discovered how badly it works out in practice. This includes traps and not every object responds to every beat, which when mixed together with the sub-par beat detection makes this movement almost impossible to accurately predict. This also causes certain songs to make certain levels ridiculously hard, if not impossible. A few of the later levels take this mechanic to such extremes, I firmly believe that they are some of the worst levels ever included in any game.  The other main issue with the level design is invisible traps. Pretty much every level has spikes, but some of them in some levels will shoot at you when you get close. There's no way to tell which ones will do this. Spikes will even shoot at you from off screen with no warning. What this unfortunately results in is rather than skill-based platforming, you simply have to memorize the levels to do well. That's not real difficulty, it's poor design.  These problems combined with sloppy controls can make this game very frustrating and it's not hard to see why over 90% of the reviews are negative. While I did enjoy the music the game has to offer, it would be better to save your sanity and pass on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a somewhat biased review, given Infected Mushroom is my favorite of all time. But! The game is a fun little platformer, with killer music. This is absolutely worth every penny, if only for the soundtracks! *jams out*",
            "review_score": "1"
        },
        {
            "review_text": "It's quite difficult when you play it without controller....  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Playfire, why would you do this to me? I thought we had something special :( In all seriousness though, this game is awful. Thank god I got this for free. The controls are just so unresponsive, so the game is nearly unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "It was a terrible design decision to make parts of the level 'move with the beat', while at the same time, having a randomly chosen music track. This ruins the speed and rhythm of the game. If the track deigns to, you'll be stuck behind an obstacle. Most obnoxious are the spike traps that block your path and move up and down, which again, 'move to the beat', so even if you wait for the specific moment it switches between up and down, and try to go under/over it, 'the beat' might still decide to change it again and squash you.  The controller often stops working when you open the start menu, which is annoying, as you'll be restarting levels over and over because the achievements are horribly unforgiving and one or two deaths is too many.  When racing your ghost(not optional) the camera will change focus slightly away from your character so you can watch your ghost. I don't see why you'd ever want to watch your ghost. The music will probably be different, so the level won't be the same, so things your ghost didn't have to deal with will smack you right in the face.",
            "review_score": "-1"
        },
        {
            "review_text": "I've put in quiet a decent amount of time into this game at this point and figured it was about time to write my own honest review of the game... As a tl;dr for anyone not looking to read through this entire review before buying: I give the game a 6/10, I'll give it a thumbs up because it's enjoyable enough, but I don't necessarily recommend it. The game itself isn't for anyone and if you're planning on buying it, wait until its $5 or less as the $10 price tag is too much for this game.  The game itself is exactly as it claims it is when it states that it's 'a music reactive Platform Racing Game'. The game itself is centered around competing against other players online (or against your own times) while avoiding obstacles that are   Somewhat  reactive to the music. But this 'reactive' element is where part of the problem I have with this game arises. Depending on the song currently playing, certain elements of levels can be virtually impossible to complete. As songs get more and more upbeat obstacles seem more aggressive and unpredictable. Be it those strange 'bass' obstacles that send you flying away from them, the pulsing buzz saws, or those obnoxious cannon like things, certain songs will make these obstacles about a million times more difficult. I myself would often find myself waiting for the brief moments of peace at the end of one song while another was preparing to start before trying to quickly rush through an obstacle I'd been stuck at for what seems like ages.   Next up, level design. While all the stages themselves are unique and different, there's a few major problems I've noticed in levels that just makes the game itself incredibly frustrating to play sometimes. On some levels you'll get a checkpoint nearly every 20 feet, so a death is meaningless and can cost you only a few seconds, while on other levels I felt like I'd spend a minute at a time avoiding obstacles only to die and be sent right back... And that without mentioning some horrible level layouts where I could miss a jump, fall down for about 15 seconds and land on a platform near the beginning of the level, forcing me to start almost the entire race over again.  Multiplayer itself seems to work well enough, however I haven't been able to play much online. Half the time I can't find a server with anyone to play against, and whenever I can, they'll often leave before we can even pick a level or make it any significant distance into a race. However racing against a friend while chatting over skype can be a blast.  Overall the game itself isn't bad... but I wouldn't by any means call it great or even necessarily good. It's a basic platformer, with controls that can be a little bit slippery, beautiful background images, and a diverse and enjoyable soundtrack. While I wouldn't necessarily recommend the game at full price unless you're really really itching to get your hands on it, I would recommend it if it drops to $5 or below. And at that point you may want to grab a 2-pack so you could send a copy to a friend if you ever wanna play a quick game to pass some time. ",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play with friends, not much of a single-player game though. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "At $10 its a bit steep, but regardless if you get it on sale or in a bundle the game has a lot of offer. The music was decent and I ended up getting a few of the tunes stuck in my head. The music also had some surpising variety to it, not a lot, but the fact that it was there was a pleasent surprise. The musical elements of this game take a back seat with only hazards pulsating to the beat, even then its hard to follow the pattern of music and try to listen when they'll trigger, making them feel more tacked on than part of the level. The best part of muscial incorporation are some of the genuinely interesting backgrounds as they pulse along with whatever the beat it, it adds to the visuals but doesnt annoy like some of the hazards can.   The controls feel solid and works well on both a controller and keyboard. The multiplayer is still surprisingly active, and is handled quite smartly. When playing you can choose to accept challenges and continue playing single player, once another player is found it will ask if you want to race against them. More games should make use of this and due away with having to wait in a lobby. It has split screen which is amazing, this is a dying feature and I always appreciate the option when included.   There are 47 levels currently total each taking about 5 minutes on average after counting deaths on some of the harder ones. You can change your racer, its color, and what music you are playing even while racing which is a nice touch.   Sadly 3D vision does not work with this game, I would have loved to see the paralax backgrounds and levels pop out",
            "review_score": "1"
        },
        {
            "review_text": "Got this for free and it still wasn't worth the money. This game is too busy trying to orchestrate an orgy between Audiosurf and Super Meat Boy to actually be good or fun or not absolutely homosexual. Kill yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice music (thumbs up), but repetitive and hard gameplay. However once you've got the hang of it, it'll be fun and challenging. I'm 1.5hrs into the game with 2 out of 54 achievement as of now (11 June 2014) and will definitely get into it and challenge all 54 achievements. Recommended for skilled platformer gamers, not so recommended for those who do not like platformers or beginners who wants to try up on one.  P/S: Definitely more fun with gamepad/controllers!",
            "review_score": "1"
        },
        {
            "review_text": "A game likes this needs perfectly smooth controls - a feature Rush Bros. unfortunately did not implement. Annoying levels, weird and stiff controls make this game a pain to play. Rush Bros. is by no means like any other rhythm/racing games - and I don't mean that in a positive way. Get   Electronic Super Joy   instead.  Gameplay: 2/10 Sound:4/10 Graphics: 4/10 Overall: 3,5",
            "review_score": "-1"
        },
        {
            "review_text": "An annoyingly addictive competitive, musical, hell of a platformer.",
            "review_score": "1"
        },
        {
            "review_text": "7/10 Good but not great",
            "review_score": "1"
        },
        {
            "review_text": "Rush Bros.; for those of us who didn't grow up on regenerative health and hand-holding platforming, Sonic 2 vs mode has never looked so good, or been so fun. My only negative experiences have been with low player base and the fact that with the exception of 1 person (who left after 2 loses) the majority of racers you find in this game are unable to take losing, and most races end with your opponent quitting.   Overall, it's much simpler platforming than something like Super Meat Boy; not to detract from its difficulty at all, it's plenty hard, but the races weren't meant to stop someone in their tracks forever. Which is part of the problem, players who are inexperienced tend to quit before they have a chance to learn to play. It's a game you have to get good, but the game is set up in a discouraging way.  I'd say with some basic interface modifications, some updates to multiplayer features, and a couple tweaks to the camera (which irrationally zoomed to a location that my player wasn't in a couple times) this could be a game that has a strong community for multiplayer, and see's its multiplayer population skyrocket. I enjoy it, but I've hit a player cap after only an hour and a half of practice. 15 games in a row disconnected or cancelled before they even started. What's sad is that it's like players don't know they can decline the song and pick something else; and I would have accepted it 100% of the time.  Potentially a 7/10 depending on how much you enjoy racing your own shadow if you don't have a friends list filled with Rush Bros. players.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game just isn't fun.  I tried to give it the benefit of the doubt, but the controls are not very responsive, the levels are repetitive and nothing in the game seems to be affected by the music - the main gimic that it uses to sell itself!  The level where you have to backtrack over the same part of the level 4 times was the final straw for me.  It doesn't matter how good the soundtrack you've got to accompany you, who enjoys doing exactly the same thing over and over again?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not much fun and very hard. But the music is nice. U guyz can try playing it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so unoriginal, the same levels put to different music that either you are forced to listen to oryour music which can indeed mess you up in some levels. Oh, and did I mention that all the levels are already unlocked? Yeah so much for an actual game.",
            "review_score": "-1"
        },
        {
            "review_text": "My wounds did not heal 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Ragemaking crap full of glowing stuff..  I hate this game... i'm dying all the time.. RIP 3 keyboards",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game for free, installed it, got the cards, now I've done all the fun things about it",
            "review_score": "-1"
        },
        {
            "review_text": " Awesome Game!  I love musics.. i love games.. And this game put it together awesomely! 8.5/10 :D",
            "review_score": "1"
        },
        {
            "review_text": "you need a freaking controler for this!",
            "review_score": "1"
        },
        {
            "review_text": "  This game is  AMAZING!  EXTREMELY TERRIBLE! I do not recommend this whatsoever. DO NOT BUY THIS PIECE OF GARBAGE! Why did this even get Greenlit?!",
            "review_score": "-1"
        },
        {
            "review_text": "The game is just not what I expected it to be. The trailers make it look like it's going a bit faster than it does. Sure you can set it to go fast, but it seems a bit overdone. The music is nice and you can set your own songs if you want. It's a nice game to play, but the controls do feel a bit odd. Would I recommend you buy it? Well, if you like Super Meat Boy, maybe. The game could just use a bit more work and maybe it would be a bit better.",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely good and not well known enough. Pick up a copy for yourself and a friend and you're guaranteed fun.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap ♥♥♥♥ Good ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "11/10 BEST GAME!!111ONEONEONE!!1111! Never before have i seen a game with such great story and depth of character, sometimes i had to stop the game and shed a tear for the characters. My personal favorite bit was when you break up the Blood orgy in the sewers underneath kushtown, it was very challenging and you had to adapt your playstyle several times throughout the battle, such as when Shrek cam along shouting Ear paep at you. This is the best game i have ever played. -69 out of 1",
            "review_score": "-1"
        },
        {
            "review_text": "Rush Bros is a fast-paced action racing platformer. You can play as 4 DJs and a zombie, but no more difference than the aesthetics of each other. Rush Bros has no plot, but that highlights its quick game style and I like it that way.   GAMEPLAY:  Rush Bros is all about the music, the enemies and traps attack along to the beat of the music, and the stage too shines along it.  For a fast-paced 2D platformer, Rush Bros isn't breaking new ground, however, it remains true to his style, returning to the formula of a platformer against the clock, and it couldn't do it better.  The game has all the levels unlocked right at the begining, and there's no unlockables, so the only thing the only thing that makes you keep playing are the achievements. It's short and there's no motivation to keep playing after you beat it, which you can easily do in 10~15 hours (assuming you played all levels before going for the achievements).   The controls are very responsive. You can jump, wall jump, slide and get power ups to get a better time, it has the typical obstacles; spikes, lasers, moving platforms, and a really nice touch to add in the versus side of the game are player-activated traps that you can use agains other players; there's nothing more hilarious than flip the controls of your friend and ruin his best time.   There's something to point out, the game has a lack of speed, don't get me wrong, the game move fast, but the animation of the characters DOES NOT fit with it, the sense of speed is just not there.   ART DESIGN, MUSIC, AND AESTHETICS:  Do I need to tell how wonderful this game Is? THE ART, THE LEVEL DESIGN, THE ATMOSPHERE, everything in this game look gorgeous. And the music, OH BOY THE MUSIC, this soundtrack is a masterpiece, it fits right in, BUT WAIT ¿You don't like the soundtrack? Don't worry little buddy, you can import your music into the game. This feature is one of the best in the game, because as I said, the level behaviour depends on the music. If you're a hardcore player, try to play with rock music.   SYNTHESIS:  For 10 dollars you're getting a great game, It is short of course, but its worth the money. I recommend you to play it online with friends, you will have a better experience.   To me, Rush Bros gets a 7/10.  -Good work XYLA, keep going.",
            "review_score": "1"
        },
        {
            "review_text": "Feels unfinished and is generally frustrating to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Rush Bros. is a nice game i think. There are many bad reviews but i like the style of it. It's like Super Meat Boy (smb is still better) and your own music! So you can put your own music in the game and i kinda like that. To the controls: I'm playing with a controller and that's easy to control; other say that the controls are very bad but a controller is recommend so you should it play with one.  6/10 It's a good game for 0,99€",
            "review_score": "1"
        },
        {
            "review_text": "Very basic 2D platformer with a timer added to justify the term 'rush'. Graphics and animations are MS Paint tier, the music is awful.",
            "review_score": "-1"
        },
        {
            "review_text": "A side-scrolling platformer that offers no motivation for the player to play it. It's got neat colors, level design and some decent mixes but other than those, that's it. It just doesn't push the player to rush an investment into the game. Even with everything it has, it's a surprisingly uninspired game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is my opinion and you have complete right to disagree and/or to think differently.  Broken controls - pushing a button for an action has about 40% chance to fail registering resulting in running into spykes, just sitting in a pit, falling down. Annoying music - levels are made for 30 sec - 2 minutes, songs are 3 minutes+, there is no music during the level load, there is no music during the start countdown, there is music just during the run, every time is a different song. Considering that you have time only to hear the starting chords of the song before the level is over and that next time you hear the start of a different song - it becomes increasingly annoying.  I would've seen playing this game at a party were quick action and short levels are perfect to keep the guests entertained without taking too much attention span away if only the controls were not broken and the music was more continuous (just keep playing the song through the countdown and level load so that there is a connected experience)  Anyhow, even with the controls and music intact, the amount of entertainment that this game would provide is maaaybe worth $5. But even for $2, considering that it does have bugs is a stretch and I would have to think about it.  P.S.: the video options are also broken - if you change more than 1 setting at a time, then there is a chance that some of your changes will not get applied. Navigating the menu after playing with my controller, somehow becomes impossible using the d-pad or the keyboard arrows, and after hovering over a menu item get the sound for a dozen or even more of selection change events. I wonder if there was a QA to check this game before they've released it to public?",
            "review_score": "-1"
        },
        {
            "review_text": "Sluggish and unresponsive controls cripple what could have been a unique platformer.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  Decent music Graphics are alright for what it is.  Cons: Hitboxes are pretty bad - especially around spikes. Controls and mechanics are iffy in general. 'Tutorial' wasn't very helpful.   I suppose it's priced fairly, but I wouldn't recommend picking it up.  Relating it to other games - It tries to be super meat boy with multiplayer, but it is far from SMB.",
            "review_score": "1"
        },
        {
            "review_text": "If u see dis words. what can i say is 'Its Free why dont u just try it ?'  Maybe u gonna like it , play ur own song on it, multplayer and but u cant chat / cant talk to other people too make it more fun.",
            "review_score": "1"
        },
        {
            "review_text": "Good ideas, but it isn't worth the price.",
            "review_score": "-1"
        },
        {
            "review_text": "Please don't buy this game. Terrible music game with flash game looking graphics. The only plus I can give is that it is multiplayer and you can use your own music, but that's pretty much it. These are one of the games that you can find in 'game' websites on Google. Not really worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely worth the sale price of 99 cents, and most definitely worth the regular asking price, as well.  It plays a little like Super Meat Boy. It plays to your own music library. It comes with awesome music, anyway. It has a competitive online aspect. An aspect that is absolutely amazing.   This game definitely deserves more attention than it is getting. Please, pick it up for you and a few friends if you are able. I want to see more games from the guy who made this one.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Spent over half hour beating one level. Get to level 40 and you'll see what i meant ;)  Some of the obstacles are probably affected by the music, but in game it feels more like it's random.",
            "review_score": "1"
        },
        {
            "review_text": "This game will help you Get some fun with friend -From IS-",
            "review_score": "1"
        },
        {
            "review_text": "This game was so bad that I wanted to refund it. But then I remember that I got it for free, so I asked Steam to refund my time wasted on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "TL;DR: The game seems promising but is plagued by several issues: controller was not recognized immediately in gameplay (can be remedied, but come on), there doesn't seem to be much of an objective besides just finishing the map, and the promise that it's 'music reactive' isn't really there. Overall a pretty stale experience, not worth checking out.",
            "review_score": "-1"
        }
    ]
}