{
    "app_id": 23450,
    "name": "Grand Ages: Rome",
    "release_date": "2009-03-05",
    "developer": [
        "Haemimont Games"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "City Builder",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 354,
    "negative_ratings": 138,
    "price": 6.99,
    "description": "Raise massive armies, embark on epic campaigns to expand the Empire, and take control of the known world! Engage in grand-scale city building and create magnificent cities with creativity and control like never before.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/23450/header.jpg?t=1537793487",
    "minimum_requirements": "Operating system: Windows® XP &amp; Vista                      Processor: 2.5 GHz Single Core Processor                      Memory: 1 GB RAM                      Hard disk space: 4 GB                       Video: 128 MB 3d Video Card (GeForce® 6600/Radeon® 9600 or better)                     DirectX® Version: 9c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought this game because years ago I was a fan of the Impressions Games city-building series, particularly Caesar and Pharoah. This game builds on the same premise, with the building of cities in Rome while raising armies to attack and defend. Like Pharoah, it is a blend of city-building simulation and RTS except there is a stronger implementation of the RTS elements here.   Visually, the game looks pretty good. Not the best graphics by modern standards, but bounds above the old Impressions games.   The biggest problem with this game is that it's a lot to learn and take in very quickly. There are some tutorials for that, though. It's not the steepest learning curve, it's nothing compared to some of the Paradox games, but it is a game that requires you take the time to learn it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a surprisingly solid game in the out of fashion genre of city builders, most comparable to the Caesar/Pharoah/Emperor series. It's got a weird learning curve since there are a shockingly large variety of different mechanics behind resources but once it's understood it's quite fun. There's a lot of content and a long campaign of reasonably bite sized missions.",
            "review_score": "1"
        },
        {
            "review_text": "Haemimont Games worked on a trilogy: Glory of the Roman Empire, Imperium Romanum and Grand Ages: Rome. In Spain and Italy, these games are known as Imperium Civitas I - III.  I still play them all to this date as they are all very unique. You can find Imperium Romanum and Grand Ages: Rome here on steam.  While Glory of the Roman Empire and Imperium Romanum work on a system based on slaves transporting goods and individuals working, Grand Ages: Rome uses a macro system where a building produces a fix number of products and individuals don't have names anymore. If you don't follow the tutorials, you may end up having the city burning down because you didn't really understand how it works. This is really important.  I highly recommend Grand Ages: Rome for it's huge replayabily, superb graphics, a very long an interesting campaign and nice music. And if you still haven't enough, take a look at Imperium Romanum.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite sure about the comparisons to classics like Caesar and Pharoh. Those games had much, much different mechanics! In those games, your strategy revolves around road and building placement, but you'll find zero roads here. Grand Ages: Rome reminds me of the game Children of the Nile, which I'm sure almost no one remembers. You'll find yourself free to build as you like, and where you like, but if you build too hastily or don't pay close enough attention to your resources your city will, quite literally, go down in flames. Angry plebs are pyromaniac plebs!  Some things about the game bother me and are incredibly frustrating, like the tight material constraints. It's very easy to overbuild and find yourself in a hole you can't escape. I also made the mistake of leaving ONE house without a job for a whole four minutes and the angry residents decided to burn down my outpost, which was an immediate game over. It is incredibly frustrating when there's no countermeasure to messing up. If you mess up, you lose, which sucks. Because games like this, no matter how 'simple' they may seem, definitely have a learning curve.  I feel like the game tries to channel parts of Caesar, especially with the overworld map and campaign... but doesn't quite hit the mark. On its own, it is an enjoyable game... just beware angry citizens and their stupid torches. Seriously. If they don't get their entertainment, they'll burn this mother to the GROUND! ",
            "review_score": "1"
        },
        {
            "review_text": "A very nice city management game, with warfare and pretty graphics. A steal at 2€ :D",
            "review_score": "1"
        },
        {
            "review_text": "Endless fun. many kinds of building, many kinds of unit, Rome-style battle and city management. Love it",
            "review_score": "1"
        },
        {
            "review_text": "Ok. I have complicated feelings about this game. Let me start out by saying that I definitely recommend this one, but have some serious issues with it.   Summary: Cities you build will probably be not the most aesthetically pleasing due to the building influence system. Combat is very poor with little depth and is just boring, but tacked on to many missions. Game does the setting rather poorly, giving little depth to the various characters you encounter.  On the upside, these are the only serious problems I have with the game. It’s actually a very good city builder, that you don’t get many of these days. With 5 families, replay value is actually very high.  Definite recommend.  End Summary   First of all, the building mechanics and resource management are actually very good, and make building a city and planning for expansion a lot of fun. On the bad side, the influence mechanic (every building that provides some sort of satisfaction, be it religion, entertainment or food, has an area of influence with all residences in that area benefitting from it) makes it very had to build aesthetically pleasing cities. However, cities that look like a tangled mess with practically no space between buildings function just fine, and all your cities end up like it, once you discover that building for aesthetics can seriously handicap you for harder missions. Roads, introduced in Augustus expansion, are land waste and you end up building short stretches of it as dots all over the city to get the bonuses for some buildings.  Combat system sucks and the weakest point in the game. Units can gain experience, which does not seem to do anything substantial as for their performance. Enemy units seem to be able to pass right through your front line infantry to attack your archers, and many battles devolve into comical mess. (Side note: why are there Hastati and Triarii in the game? It takes place post Marian reforms, which essentially abolished that system and replaced it with Legions...) It is also unfortunate that many campaign missions are combat oriented.   Campaign system is actually very good. You choose a family to play as, and level up as you go from mission to mission. The leveling up system is actually very good. There are 3 perk trees, 2 of which as same for every family and 3rd one being unique to each family. The bonuses you get from family tree may seem rather insignificant at first, but they may greatly change the way you play the game, adding great deal of replay value to it.   Setting takes place at the time of the Fall of the Roman republic and you end up being introduced to various historical figures from that era. From Cicero to Caesar. Unfortunately all the characters end up feeling like some puppets (poor quality of voice acting in some instances...Pompey.... does not help). It feels like opportunity was missed here to make campaign very engaging. ",
            "review_score": "1"
        },
        {
            "review_text": "this is an ok RTS, if you like the old type rts and eco running games this is for you!",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Anno 1404 you will like this.   Basic resource management sim, need a wheat farm to grow wheat, a watermill to turn it to flour and a bakery to make bread to feed your citizens etc they all need workers and workers need housing that is within range of their job etc. Fancier buildings need higher class citizens and they in turn need more complex resources and so on.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a city building game inspired by ancient Rome, look no further! Although this game does not capture the same zeitgeist as Caesar IV, it is still a lot of fun to pay for city managment fans. Meeting the needs of the different kinds of residents was challenging and rewarding but not overly so. Combat, however, was never that interesting or engaging for me - but I only did that on the rarest of occasions.",
            "review_score": "1"
        },
        {
            "review_text": "Good luck if everything in town doesn't catch on fire.",
            "review_score": "1"
        },
        {
            "review_text": "BUILD,BUILD,DESTROY!!!!!  Interesting game i must say, good campain, good Leveling system. Challenging gameplay! Yet you can build your own city and challenge nearby Barbaric villages. Gain resorces, gain money, and gain power. Custom cities. you can build forever DAYS AND DAYS OF ROMAN BUILDINGS AND POOLS. Godmode is an option also. I myslef do not use it because i like challenges. I only got the DLC for Multiplayer. BUYING MULTIPLAYER!!!!!! STUPID PEOPLE DONT BUY MULIPLAYER!!!! They like enjoying games not wasting money on it YOU MORONS! - not the people who play this game. you guys are nice and very smart most likely, i was speaking to the developers for being sellouts on there own game. They could have added THE AUGUSTUS DLC without the multiplayer. They should have put the multiplayer in the game itself not with a dlc who had that idea! a guy who wanted prophit. to be mean. goofy. nein, he did to add it to the game because they ment for the game to a solo game but it was to late, therefor they added it to the game because it was a popular game until medieval. so they added a DLC to add the muliplayer. for our enjoyment.They are nice guy i promise. *Cross my fingers*: So it is all in all a good game i love the developers for making it as it is a good experience. if you play with friends and family. solo is not that fun but, it will do so for now i will play but there is no-one to play it with sadly. GOOD GAME IF YOU HAVE NOTHING TO DO IT WAS A CHEAP MOVE PUTTING THE MULTIPLAYER IN THE DLC THOUGH!",
            "review_score": "1"
        },
        {
            "review_text": "Only played the tutorial so far, but it feels pretty good. Very much like Imperium Romanium (or however is it called). Nice graphics and nice ambience. Looks deep enough with tech trees and research. Look forward to playing more.",
            "review_score": "1"
        },
        {
            "review_text": "For the drought in good city builder games we have recently, this game gives you Romans! And plenty of them. On the other hand, all the citizens/slaves are really just eye candy and most don't perform their relative tasks. But, it's a solid city-builder with a nice window into Ancient Roman life on the frontier.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you are able to learn things on your own as the tutorial fails to touch on a great deal of content. The campaign can be fast-paced at times, but incrediby satisfying once you get the hang of it. Overall, one of (if not THE) best modern Rome city builder.",
            "review_score": "1"
        },
        {
            "review_text": "i really like this game. its not too easy and but you can complete the levels if you try hard enough.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite RTS. Many buildings and stuffs to take care of. Graphics are beautiful and missions interesting. Im not too much into RTS but this is one really impressed me.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun city builder/rts game about Rome. Coming from someone whon really likes Rome it may be a bit biased, but for someone trying to imagine it, imagine a mixture of Civ 5 and Age of Mythology. It took me a couple of days to get used to due to the interface, but once you figure it out it's a blast! Remember that things don't have to be next to each other to be able to use their resources as long as they're being produced (I had to learn that the hard way). Other than that, a very inexpensive and fun game! Very worthwhile. Valeat quantum valere potest. Valete fratres.",
            "review_score": "1"
        },
        {
            "review_text": "Horrid game spent another 4 hours on it, thought Id give it a little more time since my first review which was negative and some how did not get posted? So here I go again, If you like watching your buildings burn down every 30 seconds and having to rebuild over and over and over again, go for it. otherwise game has no flow or feel what so ever. I really enjoy RTS games such as Stronghold, Total war, and Empire of Ages but this is just a miss all around. Could go on but not even this review is worth the time I wasted on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "As much as I do like this game, it is the second time I've owned it. The first was on a cd collection with four other games so I had assumed that the problems with the game had been the cd. This game is unstable, it lags when buildings finish construction, and locks up at random points, I can't get past mission two, and I had actually made it half way through the game the last time. Until some sort of solution is brought up I would either suggest Ceaser 4, or even Tropico 4 if you want a game that works like this one and is much more stable.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, but very glitchy. Keeps crashing",
            "review_score": "-1"
        },
        {
            "review_text": "I am having troubles downloading this gave. It use to work but now it won't start.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a piece of crap.",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 with crashes, 7/10 if it worked perfectly. Fun game when it works... Poor tutorial and manual fails to explain some things. I have a good system(12gb ram/i7/560ti) and this game starts to crash nonstop if your city gets past a certain size regardless of what graphics settings you put it on. I am uninstalling it now because of the constant crashes as they make it just not worth playing. Game had potential to be fun but there are better options to spend your time on than this.",
            "review_score": "-1"
        }
    ]
}