{
    "app_id": 234670,
    "name": "NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 Full Burst HD",
    "release_date": "2013-10-24",
    "developer": [
        "CyberConnect2 Co. Ltd."
    ],
    "publisher": [
        "BANDAI NAMCO Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Anime",
        "Fighting",
        "Action"
    ],
    "achievements": 54,
    "positive_ratings": 8209,
    "negative_ratings": 882,
    "price": 14.99,
    "description": "Live the 4th Great Ninja War and its overpowering boss fights or defy your friends in ultra dynamic online and offline ninja confrontations!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/234670/header.jpg?t=1539273016",
    "minimum_requirements": "OS: Windows (64bit) 7 or higher up to date Processor: Intel Core2 Duo, 3.0GHz - AMD Athlon 64 X2 Dual Core 6400+ 3.2GHz Memory: 2 GB RAM Graphics: 1024 MB video card DirectX: Version 11 Storage: 23 GB available space Sound Card: DirectX sound device",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sakura is actually useful in this game",
            "review_score": "1"
        },
        {
            "review_text": "Time for a long essay about this game because that's just how awesome this is.  NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 Full Burst is a game based on the manga/anime franchise Naruto (obviously). Since this is the 3rd game, it starts the story in the middle so if you haven't played the other games (I haven't) but you have read/watched the entire series, it's all good. This game just goes on the story from the part right before the Great Ninja War. If you are a Naruto fan, this is a guaranteed 'You'll like this' game for you.  The game is a 3D style fighting game and you go can either go through the story to fight the battles that happened in the manga in the game. The one thing I like about this is that everytime a battle starts, it starts on the normal difficultly, but if you are having trouble with that battle and lost over three times, the difficultly gets lowered. I really liked that, caused me not to get stuck on certain battles.  The cutscenes are animated 3D models, and that is pretty amazing how they made them look beautiful with models, at the same level as RWBY, which is probably the best 3D animation(anime?) ever. The characters and voices were great (I think they used the same ones from the anime) and matched the story of Naruto overall.  There is one section of the game where you can play as Naruto's pregant mom and that part really cracked me up. Another thing is that everytime you buy ramen from the ramen guy in town, all your health and chakra gets restored. THE RAMEN IS MAGIC!!!!  This game is supposed to be on XBOX controllers but the PC version is also great, but has some problems. There are glitches in the game. Sometimes theres one battle that just causes the game to crash, or one specific move that will cause the game to crash. This is one of the reasons why I never actually completed the entire story within the game. One of the last battles during the Great Ninja War would keep crashing, so I gave up. (I already know what happens anyway)  I suppose one of the things I didn't like was the spread of save points. Some save points would be placed 2 minutes of each other while others are 2 hours from each other. That was one of the cons of this game since I can't play games in a marathon and I don't think I am the only one.  Overall, this game has its ups and downs but is a great game. It's also pretty long and hopefully you will enjoy it as much as I do. Thanks for reading this long essay. ^-^",
            "review_score": "1"
        },
        {
            "review_text": "I love this game to death its amazing if you love naruto or want your general beatem up. Its nice not impossible to get good at and its fun creating your own combos. Massive chaacter roster and story is nice. I like it a lot i reccomend this game",
            "review_score": "1"
        },
        {
            "review_text": "If Street fighter and Mortal kombat had a baby and the baby was on anime steroids it would be this.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! Online still works and this game is sick! I think I'll be watching all the Naruto Episodes now! I'm an instant fan!",
            "review_score": "1"
        },
        {
            "review_text": "Hi, for your notes, I use keyboard to play this game and it's fun. you can googling to find best keyboard setting. I just need 2-3 battles and I can enjoy this game with keyboard. Great games, easy to play and satisfy naruto fans.",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: You NEED an Xbox 360 controller Step 2: You ABSOLUTELY NEED TO FOLLOW STEP 1 Step 3: If you don't, YOU'RE GONNA HAVE A BAD TIME!",
            "review_score": "1"
        },
        {
            "review_text": "I'd be lying if I said I'd seen more than one episode of Naruto, and I'd be lying again if I said that I thoroughly enjoyed what I have seen of it. That being said, I recommend this game, albiet only circumstantially. I'll elaborate on what I mean by that.  Whether or not one considers his or herself an 'anime fan', there is surely a plentiful amount of people that find satisfaction in over-the-top ninja battles and explosive action in general. I, personally, enjoy this game because you are put right in the middle of the ridiculous madness that is a Naruto battle, and it feels very fun. I know practically nothing about the series, and by purchasing this game, I didn't hope to expand my knowledge on it. I only play the story mode (which isn't anything special except for the boss battles) to gain access to all the characters to use in multiplayer battles. There isn't much depth to that, and that is significant in  my  personal enjoyment, because if we want to get metaphorical, I didn't buy it as a game. Rather, an explosive Japanese cartoon ninja action simulator. And at being that, it excels.  If you want story, don't buy it. If you don't have friends to play with, don't buy it.  If you don't have a controller, don't buy it.   If you like fighting games on a large 3D plane, throwing fireballs at your friends or co-workers, or have ever dressed up like a ninja and run around your house yelling 'rasengan!', this one's for you.",
            "review_score": "1"
        },
        {
            "review_text": "All around great game and the bonus chapters make for good extras. My only flaw is that the controls are somewhat difficult for PC players that don't own a control pad, and aren't necessarily used to keyboard mashing.  Regardless, I definitely recommend this game to all Naruto fans - and even those who aren't fans.",
            "review_score": "1"
        },
        {
            "review_text": "Get it. The end.",
            "review_score": "1"
        },
        {
            "review_text": "Newcomers who persevere and keep on bashing away until they master the fundamentals will be rewarded greatly, but in all honesty, you might be best off tracking down at least the first NUNS game on PS3 and Xbox 360. For existing fans of the series, these are the ninjas you’re looking for. Network quirks aside, if you’ve got a PC capable of making NUNS3 sing, you won’t be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "grab it while it's on sale",
            "review_score": "1"
        },
        {
            "review_text": "Good fighting, which is fully in 3d.",
            "review_score": "1"
        },
        {
            "review_text": "Very Good Game , has an awesome story line and awesome graphics it has only 1 problem , While Playing online it has alots of lags and theres almost no one playing it , well at least in EU but its an 10/10 , it has all the dlcs and yeah its a most buy :)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, we need more anime games here on steam, like J Star Victory, Dragon Ball, and One Piece etc. Can't wait for Naruto Revolution, seems like it will be an amazing game just like this one and that it will have an even bigger online community!",
            "review_score": "1"
        },
        {
            "review_text": "I have been thinking about buying this game. But, I never really thought much out of a fighter game, even naruto-based game like this would be PC worthy. Well, I was wrong. It has sparked the Naruto fan inside me, even thought I was a big fan of it before. I loved this show then and kinda fell off after a while because they had a new artist change the entire look of naruto. But, I felt I should put it aside and play the game. The storyline is breathtaking, that might be a level of nerd that people aren't necessarily suppose to expose. But, it truly is one of the best storylines put into a game if you haven't watched the series. Please, if you want a single player game this is the way to go.   ALSO, KEY INFORMATION: If you don't have a controller, then this game will be dramatically less fun if you play it. Put the time and effort into getting a controller. It's super simple and costs less than the game itself. Especially since Xbox and Playstation are moving to the new console controllers. Go to google shops and or just best buy and they can sell you one, honestly cheaper than the game.   Lastly, I highly recommend this game to all my friends and gaming peers. It's well worth the time and money. However, the multiplayer I can not recommend because I don't play multiplayer on this game.",
            "review_score": "1"
        },
        {
            "review_text": "Some say that cutscenes never end...",
            "review_score": "1"
        },
        {
            "review_text": "Keyboard = BS? As my Dualshock 2 wasn't compatible with this game, keyboard was the only option I had and !'#¤% me was it hard to configure. Well the configuration per say was easy enough, but to actually bind all of the buttons needed for this game through a keyboard was a challenge in and upon itself. I believe the setup took apx 90min with some trial and error to get a grasp of the game mechanics and what worked or not.  That being said... It is most definetely playable through a keyboard given the correct settings! Don't get me wrong, a controller is a much better choice mind you... Still, you can enjoy the experience and get used to playing through the keyboard as well! Game itself? I honestly didn't feel much for it at firsthand, battles feels like a mixture between the Gekkitou Ninja Taisen series on GC and Ultimate Ninja on PS2. Overall it works but I don't enjoy them nearly as much! The overworld imo doesn't fill any meaning other than being an annoying slowdown between the progress of the game per say. Speaking of which - The game feels more like a movie! Now I've played the DBZ Budokai series and they too had fights followed by cutscenes along with various unlockables, however the game definetely was more challenging and fun due to customization of capsule skills, true you can customize your items for this particular game but at the same time I never found myself using them EVEN ONCE! Overall it is almost exactly like watching the anime with the exception of worse graphics and certain altered scenes, again for the worse.. I really !'#¤% hated it in the beginning, but as time went on and what it really comes down to is that it's still very much Naruto at it's core and naturally you DO have an interest in the characters and the story... As for the gameplay, it is extremely unbalanced! it goes from certain battles being a joke to some being insane, granted you can still S rank them within 5 tries or so. There are however during certain battles and these are mainly during the bosses when you have special objectives to be filled if you wanna achieve the highest rank. Some of these being purely !'#¤%&amp;/ LUCK BASED!!! For me this game goes to shiets at when you're supossed to rely on luck rather than skill..  Bottom line is that you will most likely enjoy the game if you are a fan! But truth be told, there are better installments of the franchise and it's by far not a masterpiece by itself either. I think metacritic was very generous giving this game 80 or what they did.. I wouldn't give it more than 65 at the most! My advice is to pick it up on a sale at 9,99 AND NOT HIGHER, if you are to pick it up at some point. All I can say is don't expect greatness from it other than feeling a bit of nostalgia from the series, as the manga is to end within 8 weeks from typing this, it's fun in a sense to remember the past 15 years that has been Naruto. At the same time though, I can't wait till the anime is complete in order to re-watch the series and TRUELY feel nostalgic the correct way",
            "review_score": "-1"
        },
        {
            "review_text": "The best game in the world. Game play 10/10 Fighting 10/10 Graphics 10/10 Dialogs 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very simple and fun fighting game. If you are a fan of Naruto I recommencd this game. As for the cons of this game, online is super laggy unless playing with a friend with a good connection.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever",
            "review_score": "1"
        },
        {
            "review_text": "This is really the best Naruto game that I have ever played. You must have it, you must play it. ^^",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, though it sucks if u don't have a joystick or something",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite fun. I recommend it to anyone who's a fan of Naruto or fighting games. Be sure that you have a good processor on your computer, though. I only have a Pentium and the gameplay just isn't exactly how it should be.",
            "review_score": "1"
        },
        {
            "review_text": "Alt-F4 closes the game immediately.",
            "review_score": "1"
        },
        {
            "review_text": "**If you are a Naruto fan** who always wanted a good Naruto game on pc go for it, its totally worth it :D Story mode is really done nicely tho ending is sort of an alternative ending which is not canon, can't blame them for that since the time this was finished cannon story was still going without any sorts of ending. Some cut scenes are very long but animated and voiced superbly so its not a torture to watch 'em. Also in story mode its not just fight after a fight after the cut scene, instead you can explore,so some side missions,send letters(sms equivalent I guess lolz) to your friends &amp; lot more. Even after finishing the main story mode there are so much to do if you are a perfectionist. Fighting mechanism is not complicated at all but its done really well considering this is an anime based game. To finish the story mode you don't need a controller, but its not easy with the keyboard until you get used to it. This edition have all the costume(apart from Goku costume for Naruto &amp; hello kitty costume for Sakura,Goku costume is already ported by the community) &amp; one story dlc included,complete edition.  About the multiplayer mode, this is where things went to hell,at least at the release. At the release netcode was so bad that was impossible to finish a single match without game getting disconnected. But I guess CC2 patched most stuff out &amp; it is more than playable now. But you will need a good connection with good ping to get everything working pretty well. Also beware in matches there will be guys who will spam long range technique characters like no tomorrow to increase their win rank, believe me I played this when it was first out on ps3 thanks to my cousin and it was much worst, most characters CC2 patched out to reduce the unfair advantages I guess so that's a plus.   As a pc port its not a superb port but for me its an okay port considering this was CC2 first PC release. This is more like a direct emulation on pc type of port. It don't have any advanced graphics settings(you can only set resolution,supersampling &amp; vsync) to play with. Game will need at least a good pc to run it on 1080p I guess since game is not greatly optimized to the pc platform. Also there is a 30fps cap that is hard coded to the game engine but it is not that noticeable but might change your decision. Game keys use the xbox style X,Y,A,B method and before starting the game you can map the controls of the keyboard, inside the game it shows X,Y,A,B keys.   As final thoughts this is the best Naruto game out there right now and a year ago nobody even thought there will be a pc port and the best thing is next Naruto game will be released to ps3,xbox 360 &amp; pc simultaneously. Its not a perfect port but its a very enjoyable game, I have 100+ hours on this &amp; this is the only game I've ever pre-ordered. Also this title is not going on sale very much so if you want it now go for it dattebayo :D  Hope my two cents helped someone with their decision =)",
            "review_score": "1"
        },
        {
            "review_text": "Just getting the game to work on the PC is tough. I have a console-like controller and it took me a good two hours to get it working.  I would suggest getting it on the console or paying for the recommended controller.  I haven't gotten much into the game because of this and I was stoked as hell to purchase it (finally).",
            "review_score": "1"
        },
        {
            "review_text": "An all-around ok game. I had to go through training or 'sparring' to discover the controls and how to fine tune the combos and basic attacks. It kinda throws you to the wolves when you start the first chapter, but it doesn't take long to understand the controls. Yet, some battles can be annoying during the story mode simply because some shinobi(characters) just spam long range attacks and yoou cannot do much. Other than that I give this game a solid 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "do you have problem to play the game with controller? because when i start the game ... i am try to options to registry my controller ....but he doesnt recognize the controller!! i see to youtube that they make video for this problem and give sollution to buy one program to play ...anyway i hope to fix this bug!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is good little fighting game. I just wish it had more of a Marvel vs. Capcom feel with the ability to tag different people in and out. The special moves are also way more frequent and limited than they need to be I feel, but overal a good game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play.",
            "review_score": "1"
        },
        {
            "review_text": "Post-Pain Invasion Arc Naruto Shippuden action. It's fast, button mashing fun, and it's pretty enjoyable. BELIEVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "preety cool !! if u fans of naruto , u should have this one :D no regret buying this game !",
            "review_score": "1"
        },
        {
            "review_text": "Great story, Fun multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fighting game !",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game!! Totally recommend it for every naruto fan, the cut-scenes and the boss battles are the BEST! Can't wait for the sequel. =)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. A little bit better than Revelation because of the story mode.",
            "review_score": "1"
        },
        {
            "review_text": "Very challenging game! So it's certainly worth your money",
            "review_score": "1"
        },
        {
            "review_text": "The Ultimate Ninja Storm franchise finally arrives to PC. A must have for Naruto fans!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good.  The fights are well done, the art is perfect. The gameplay is fluid, the controls are responsive as they should be (XBOX Controller). The story inside this game is really long and perfectly told to the user (a bit different from the anime/manga though). There is one downside in this game, the multiplayer feature. Until now i couldn't play it online against anyone without lag. Maybe the reason is because i live on Brazil and there isn't anyone here with this game but i don't know for sure.  I'm a big of naruto and i'm not disappointed by this game.  5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Better then the series by far!",
            "review_score": "1"
        },
        {
            "review_text": "Best game of the year for me! I also bought it for my Playstation just to play it through on PS3 aswell, and play with my friends online! The only bad thing is the internet connection IF you are going to play online, there might not be a good connection between you and your opponent. GAME OF 2013!",
            "review_score": "1"
        },
        {
            "review_text": "The cries of the small children I've defeated that echo through my mind help me sleep at night.  10/10 Would buy multiple copies of.",
            "review_score": "1"
        },
        {
            "review_text": "This is greatly Recommended to fans of Naruto but for those who are looking for an in-depth fighting mechanics this 'might' not be for you.  The game is fairly easy to figure out.  Ofcourse lore is good coz it's 'NARUTO' and this one has a bit of a different ending.  Fair Selection of characters(there are also characters with costume).  In ratings this is fair, a good amount of pvp, and finishing story mode and voila, you're done.",
            "review_score": "1"
        },
        {
            "review_text": "Very good fighting game with many game mechanics - easy to play, hard to master. Also this game is based on famous manga/anime so it also has great story (very large part of game is cutscenes). I would recomend this game to any who enjoys fighing games/anime/manga.",
            "review_score": "1"
        },
        {
            "review_text": "This is definitely the best game out there right now for 'anime action'. This game is based off of the amazing and still going anime, Naruto. There is so much story and action in this game that you will probably cry if you haven't already seen it. Anyways, this game is definetley worth the money. Get it now and have fun ^.^",
            "review_score": "1"
        },
        {
            "review_text": "Dis is Very good game. You punch ppl and u do awesome combo stuff oh and its anime. big boobs 10/10 ducks",
            "review_score": "1"
        },
        {
            "review_text": "Very Awsome game If you naruto Fan you would love it i would give this game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I've spent countless Hours on this game on the 360 and I expect to do even more so on the pc version. So far so good, seems the game had a lot of problems which was fixed right before I bought the game though.  I have played The Naruto series since the PS2's first release and of all of the Naruto games I've played so far, THIS is my Favorite of all time and therefore I recommend this to any and all Naruto fans.",
            "review_score": "1"
        },
        {
            "review_text": "Better than ultimate ninja storm 2 and now on pc. Fu-ck NUNS:revolution. Drive type minato with Hidan and Kimimaro support is a broken op pain in the as-s. Get this instead. Oh and you could change the language in this game to japanese, so all you digusting weeaboo fuc-ks could use this instead of your shi-tty  JapanesePod101.com  account.",
            "review_score": "1"
        },
        {
            "review_text": "I would only recommend this game to fans of the Naruto manga &amp; anime. Otherwise you be at a complete loss when it comes to the story in this game. Now the fighting mechanics are awesome, it's super easy to pull bad-♥♥♥ combo's off, and the animations of some moves are badass. It's not a complex system but that's just the way I like it. There are also tons of stuff to do after you finshed the campaign like, tournaments [with special settings], challenge missions, online battles, ninja timeline [let's you play all the previous battles from the manga/anime]. The only complaint I have about this game are the cutscenes. Some cutscenes can take over ten minutes or more, that's a bit too long if you ask me, but luckily you can skip them all.",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt my favorite anime fighter to date. Has a lot of content to keep replay value alive, combat is simple and intense meaning it's easy for new comers to pick up and enjoy, story while not exactly accurate to the manga and anime (Looking at you Kage vs Madara fight) still well told, absolutley beautiful visuals, an eargasmic soundtrack, incredible bosses and in the first 5 minutes completely trumping where Dragon Sword Chronicles failed miserably this is defintly a game that can satisfy a fan of Naruto or a fan of anime in general. For those of you who are fighting game fanatics I suggest looking at gameplay first before jumping in just in case the mechanics are your thing.  The only thing I can say needs improvement is the lip sync for the english voices is still pretty off. I know it's synced to the original japanese audio but I feel it could have been edited to fit the english voice. Hell it's like that for multiplayer.  Regarless this is still a great game. Defintly worth the wait.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing. The main story is about 10 hours long.(After the main story you still have many many missions to do) I really like the anime style of this game. This Naruto game currently has the biggest Character Rooster. (Even though some characters of the older games are missing)  I am a big Naruto fan. But you do not have to be a big fan of Naruto to like this. Even Fighting-Games-Fans are going to love this game.  If you are planning to buy this game... THEN DO IT! Its worth every Cent.  There is one tip i'll give you. Dont buy this game if you dont have a controller. Its really hard to play without a controller.  But still... THIS GAME IS AMAZING! ",
            "review_score": "1"
        },
        {
            "review_text": "Ok this is not a game for everyone.  If you do not watch Naruto i bet that you will be having loads of fun with the great gameplay but the story will be a mess for you as it picks up just in the middle if it.  But as a simple figher its the most fun i had in ages and for those that worry about the 30 fps lock i will say that the game feels so much better then i expected and i usualy have a big problem with low fps.",
            "review_score": "1"
        },
        {
            "review_text": "Naruto... nothing to say. Just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "The most broken multiplayer that Ive seen.BEST GAME EVER!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a horrendous port.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros : Nice gameplay, good graphics, It's a Naruto game for crying out loud, alternative story based on decisions.  Cons : Doesn't support non-360 type gamepads(You'll probably have to use an emulator), Continuing the story mode after you finish the main story line may get a bit boring despite the various side missions, doesn't have the goku's gi as a skin for Naruto(I think it's region specific). All in all a good game. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "UNS3 is a strong fighter in it's own right, but also a good pick for people like me who more often than not, just don't enjoy fighters. This game has a very Beat-em' up feel to it.. it's also very simple by nature, with simple controls, combos and easy to perform moves. With that said, it has enough depth in the way that you can use those simple moves and turn it into a truly exciting game, full of satisfaction and devious trickery.  This game shines most in it's multiplayer. The best way to experience this game would be locally, with a mate or seven. Failing that, you can of course take to the online mode. The netcode looks like it needs work but disconnects are a thing of the past- the real beast to worry about is latency. Fighting any friend further than my own state (Western Australia) resulted in anywhere between a few milliseconds to half a second of latency, with those in my state being as responsive as a local match. Unfortunately, and this is likely due to poor Australian internet but it's still worth noting, playing any friend overseas was unplayably laggy, resulting in only frustration for both players. It kind of draws from the game, but it's more of an issue for us here.  When you do get connected, it is undoubtedly the most fun part of the game.  That is of course not to say the single player doesn't excel too, oh it does. One of the best stories in a fighting game in thanks to the rich and interesting world provided by the Naruto franchise. The story itself takes place in the same arc the currently-airing anime does at time of release, the Fourth Great Ninja War. The story is solid, it has many moments that will blow your mind and a lot of them are fully playable. Each fight is as memorable as the last, nothing feels too forced or unnecessary and the pace is set nicely too, with the exception of an almost hour-long scene that just sucks the life out of the middle of the game for a while. If I were to pick some nits I'd say that the characters are a bit too stiff and they don't move during dialogue unless it's a big scripted cutscene, but when things get good, they get fantastic. Even flashbacks are implemented into story fights as you play, giving you some GREAT perspective. Some of the story is very simpified, and it focuses more on the Main characters than the Anime does, leaving out some very interesting and emotionally impacful backstory.. but it does the job. It teaches you how to play, offers hours of entertainment and will make you excited for the franchise all over again. Sadly, the ending is a little different to what happens in canon Naruto, likely to avoid spoiler territory for the anime, and thus is a little unsatisfying. It'd be nice to have gotten that little surprise at the end- for that, I highly urge you to watch the anime, the person behind that mask.. ooh! Amazing.  For a Console port, it has it's issues. There's a lack of tweakable options.. you're given a choice of resolution and Anti-Aliasing and that's about it. With that said.... the game runs very smoothly, even at it's locked 30 Frames Per Second, and the Anti-Aliasing does it's job well, there's a very noticable difference and the quality is greatly improved over it's console counterparts, especially in just how smooth and clear the lines are, it helps solidify the feeling this is an Anime. It doesn't really 'Feel' like a port, if that makes sense- while you're playing it, it looks great, sounds great and controls great while running smoother than butter on any decent machine.  With all that said, I'd definitely recommend you give it a shot. It's got plenty of hours in store for you and is certainly a blast with friends. It's the definitive version of the game and I'm very happy it came to PC.  I'll give you guys a hint for when you start playing.. don't rely on your subs too much. It's easy to think spamming them will win you a fight but if you learn to play while conserving them and recharging often, you will dominate your friends. The Chakra dash is your best friend!",
            "review_score": "1"
        },
        {
            "review_text": "Rock Lee is op nuff said",
            "review_score": "1"
        },
        {
            "review_text": "Just start playing though, but I have to say this.... It's Awesome! Combat is simple but hard to master, and plus with the engaging story! Fans will be enjoying this, surely.  fps limit is not really a problem! I mean it!",
            "review_score": "1"
        },
        {
            "review_text": "The best anime!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I've always loved Naruto, and enjoying the story in the form of a video game makes it 10x better. Good story, fighting mechanics. Not very popular on PC when it comes to online play, but it's still worth your time if you enjoy the Naruto series.",
            "review_score": "1"
        },
        {
            "review_text": "'N-Naruto-Kun...d-daisuki.' - Sasuke Uchiha  This game is pretty cray cray. It's like DBZ with 5 times the cutscenes. The music is really good and the game looks really awesome (especially in my laptops glorious 360p). Also has cute anime girls.",
            "review_score": "1"
        },
        {
            "review_text": "Very exciting",
            "review_score": "1"
        },
        {
            "review_text": "Naruto Storm 3 stands alike, following the tradition of previous Storm games, has the gameplay mechanics you might like or may not like. But otherwise, the story telling this game achieves is excellent, the GRAPHICS are strong in this one. But beware this game may not follow the storyline of the actual Cannon Naruto Manga/Anime itself at some point. But overall this game is a must for any Fan. Online experiance is Average.  Overall, I would recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "played this till my thumb bruised. super fun!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Naruto, and haven't played the previous Ninja Storm games but are fairly up to date with the manga or anime then quickly pick this game up today. I say it's well worth it, the story mode is linear, the English VO work is a little weak, but over all the fighting mechnics in the game are fun in their own right. It's nothing new from the previous Ninja Storm games, but if this is your first foray the camera might need a little getting used to. But once you do it's very fun. Also the ninjitsu's and ultimate-jitsu's are extremely entertaining to watch. And honestly there are very little button combos to remember if any really at all. Simple and flashy.",
            "review_score": "1"
        },
        {
            "review_text": "The Short: Awesome fighting game (even if you aren't a Naruto junkie!), but make sure you have a controller and the patience to sit through the annoying matchmaking  The Long: I can't compare this game to earlier entries in the Ninja Storm series because I haven't played any; I picked this game up while it was on sale a while ago because I liked similar style fighting games (DBZ Budokai Tenkaichi) and was very pleasantly surprised.  Unlike the aforementioned Tenkaichi, all of the characters feel like they have a different playstyle and most of them have at least one unique trait that makes them viable. At first the game seems like it is all button mashing because there are no arcade-style button combos to put in, but it is not! Timing and managing your substitutions is critical otherwise you will be crushed by a more skilled player.  The storymode is great in this game. All of the critical scenes in Shippuden are re-enacted for the most part, and the cinematic battles are great.  Most people probably care about Online Mode the most though, so I'll put a good bit of my thoughts in here too:  The fun you will have Online depends on who you play with. The netcode can be spotty with this game, as I've had it drop inputs playing with someone who lives in the same town. The community can also be very frustrating, as you will see a lot of TenTen/Temari/Deidara spammers who are looking for stat-padding and spend the whole match throwing projectiles, or people who turn off assists to do infinite combos with Neji/Rock Lee.  Eventually you will find people who aren't trying to cheese out the game though, and when you do, you will have lots of fun. I recommend building a list of friends who play this game and doing tournaments, as this game can be insanely fun when your opponent isn't spamming jutsus or using cookie-cutter teams.  I haven't tried to play this game on the keyboard, I imagine it is dreadful, so make sure you bring your wired 360 controller before you buy. Cheers.",
            "review_score": "1"
        },
        {
            "review_text": "NARUTO SHIPPUDEN is the game for ninjas",
            "review_score": "1"
        },
        {
            "review_text": "Alright. Let me start off by saying that this was my first 'Ultimate Ninja Storm' game that I've completed. So if you've never played one of these, I can help you out. First off, this is a 3D fighting game that is based off of the anime 'Naruto'. This game in particular takes place during the 'Fourth Great Ninja War'. If you have never seen the show or have never read the manga of Naruto, it's going to be a bit confusing for you. I would recommend watching the show or at least doing a bit of research on Naruto if you want to understand this story. Anyways, you can move Naruto around the game map and talk to other characters to progress the story. Although, this is honestly kind of a little pointless. There's barely anything on the map aside from a few collectibles every now and then, and you can buy pretty much every thing you find in the in game shops. And sometimes, it takes quite awhile to get from one area to another. While I thought the world was pretty cool at first, it got pretty tedious running back and forth. If you were expecting a big open world game to explore in the Naruto universe, prepare to be disappointed. Anyways, the story is mostly made up of cutscenes which can be preeeeety lengthy at times. There's this one chapter where there's a cutscene that's like 50 minutes long. So if you plan to see the story, you'd better be prepared to sit back and watch. The story also has boss battles ranging from fighting regular characters to fighting massive monsters. The fights are great and in the middle of some of them, a mini cutscene activates where your character moves on their own and you have to do quick-time events for them to do a pretty cool, flashy move. These are only in the story though, not in the normal game. So if you enjoy looking at em, you'll have to replay that story mission. If you don't like QTE's, well then you don't have to worry too much as they're not in every battle and you don't need to do them much anyways. And the graphics of this game look very nice. The PC version compliments the art style nicely and everything looks so soft and smooth. It is a console port though so don't expect super high textures and jaw dropping visuals or anything. It's locked to 30 fps btw. That's kind of disappointing but the way the game plays with its smooth animations kind of makes up for it. It's still playable if you ask me. Also, something really weird which hasn't gotten fixed from past UNS games is the lip syncing of characters. Their mouths don't match with what the characters say at all and they still move even after the voice of the character has stopped which is just embarrasing. Just letting you know if you notice this happening, there's nothing wrong with your game. Moving on to the gameplay, the characters all have their standard combo attacks and can use special attacks which consume 'chakra'. This chakra can also be used to do a super move which uses up all your chakra and looks pretty cool! When you're fighting in the story against AI, their difficulty raises depending on the story conditions. For the most part, they are pretty easy. But those bosses that I mentioned earlier can also be pretty cheap at times. For example, some parts of the story make you fight multiple enemies at once and they are so annoying trying to hit you all at the same time. For them, sometimes you can't just fight normally and try to do combos. And you might end up having to just spam some moves to get them heck away from you while you focus on one of em. But like I said, most of the fights are pretty fair and there aren't too many bosses like that until you get towards the end of the game. Another thing to mention is that there's a ton of characters in this Naruto game. All the regulars like Naruto, Sasuke, Sakura, Tsunade, Kakashi, etc. And a lot of characters from Shippuden like Raikage, Mizukage, Kazekage Gaara, etc. Also, this version is Full Burst which contains all of the DLC from the regular version and the most notable addition being the extra DLC chapter which focuses on a fight with the two Uchiha brothers vs a powerful villian who I won't spoil. However, I suggest you only do this fight if you're really brave or want to complete everything the game has to offer. As this fight is far more difficult than anything in the regular game and he is by far the cheapest piece of garbage in the entire game. (I eventually beat it, but I cannot tell you how many times I died) Overall, I say it's a decent fighting game. It's worth a try but it is far from perfect.  PROS -Excellent graphics -Follows Naruto story -Tons of characters -Decent fighting system -Great animations  CONS -Bad character lip sync -Barren game world -Locked to 30 fps -Some cheap boss battles -Long cutscenes  If you're a Naruto fan, I recommend checking this one out. If you're not and just want a fighting game, feel free to get this on sale. But there's definitely better fighters out there.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "The graphics of this game are somehow better than the animation of the anime ( it sounds weird ). Well, for all weeaboos out there who are fans of Naruto, I recommend this game. Really, buy it. Now ! The gameplay is really nice, even if you use a keyboard instead of a controller... So, grab it while it's on sale and smash Sakura's face ! It worths all the money !",
            "review_score": "1"
        },
        {
            "review_text": "Got this today and played it all day, this game is worth every penny a must buy! :D",
            "review_score": "1"
        },
        {
            "review_text": "beast game ^^",
            "review_score": "1"
        },
        {
            "review_text": "Hey, that's pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "For some reaon this game refuses to work on 2 monitors.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun fighting game for the fans!!!  Spoilers though for the people who haven't really watch the anime that far.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "The Naruto games have always been fun to play, and this is no exception. Enjoyed beating it over a day with my friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the most perfect fighting systems I've even played with. It's been perfected over the course of the series and I believe this is the best yet. Great whether you know/care about the story or not as all characters can be unlocked without playing throught the story. The game will, however, probably be more interesting if you understand the story.  Great game, but don't buy it without a PC gamepad.  14/10",
            "review_score": "1"
        },
        {
            "review_text": "I have now finished the entire Naruto series by reading the manga. If you are one of the only anime readers, or just can't catch up, here is one of the games in this epic saga that'll bring you up to speed. NSUNS3FB is an amazing game that takes place in the Great NInja War, and ends just when things are really getting intense. You go through the struggle of seeing Naruto trying to befriend Kurama and gain his abilities and powers. You go to see Sasuke find out the truth about Itachi. You go through epic boss battles and fights. The visuals are amazing, and DLC is included. Expect people to ask you for SoSP Naruto Mods, those are epic as well. Enjoy the 4th installment of the tale of Uzumaki Naruto",
            "review_score": "1"
        },
        {
            "review_text": "although i'm not that big into fighting games this is pretty much a good game to understand and play plus. I can't wait to see what CC2 do for Storm 4. plus I recommened using a gamepad if you have one.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game for Naruto fans thats my opinion",
            "review_score": "1"
        },
        {
            "review_text": "NEEEDD TO FIX the slow motion lag. Plzzzz have a update. This game is great looks great but without the slow motion lag for most pc's that are having trouble with the same problem. :/",
            "review_score": "-1"
        },
        {
            "review_text": "If You Like Ninja Storys You Will Love The Story Of Naruto SHIPPUDEN: Ultimate Ninja STORM 3 Full Burst If You Like Good Game Play &amp; Good Ninja Fighting Games &amp; Ultimate Powers As A Ninja Get This PC Game",
            "review_score": "1"
        },
        {
            "review_text": "Since I don't know what to put here, let me give you a recipe for Japanese rice balls.   You will need:  1 lb short-grain rice  8 servings of umeboshi (dried plum)  8 servings of nori (dried seaweed)   Directions:  Cook the rice.  Keep it warm, but let it cool enough so that it won't burn your hands.  Cut each nori sheet into 9 strips.  Wet your hands and sprinkle them with salt to prevent the rice from sticking to them.  Mold a handful of rice into a triangular shape with an indentation in the middle.  Press a piece of umeboshi into the indentation you left.  Wrap the rice and umeboshi in Nori strips.  Serve immediately or save for later.",
            "review_score": "1"
        },
        {
            "review_text": "Everything in this game is just perfect, the battles , the story, the emotions, the characters, if Final Fantasy series count as anime then the Naruto Ultimate Ninja Storm series are the second biggest anime gaming franchise that exists after Final Fantasy",
            "review_score": "1"
        },
        {
            "review_text": "terrible. low fps. controls for pc is stupid. dont recomend getting this game unless you have a controller. its made ofr a console not a computer.",
            "review_score": "-1"
        },
        {
            "review_text": "It says partial controller support, but they basically mean that if you don't have a controller, you will have to pick a key on your keyboard for every button a controller would have. There are no preset keyboard options, making the game very hard.",
            "review_score": "-1"
        },
        {
            "review_text": "bad because it does not have any naruto ost...",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS Someting!!! Best Game Ever!!! AND at last for PC! YOu can fell the shinobi world atmosphere with all consequences. All shoud buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Must have controller, very difficult learning curve with keyboard.",
            "review_score": "-1"
        },
        {
            "review_text": "This is pretty fun/hard and if your a fan of the Naruto series (my friends on steam aren't lol) then you should buy this! though the online is laggy and the game is locked at 30 FPS but still runs great!",
            "review_score": "1"
        },
        {
            "review_text": "I never go back on my word! That's my ninja way!!",
            "review_score": "1"
        },
        {
            "review_text": "So after playing this game and completing it I have made a few conclusions: If you're a Naruto Shippuden fan and follow the series, there is no point to having this game, unless you follow the games also.  if you are new to Naruto Shippuden this is a good series to start to get an idea of what has happened in the anime and manga series, (but if you are unfamiliar to the the original I would suggest looking that up before starting this series) although it doesn't have as much of the content that the anime and manga series contain.  The main purpose of this game is for you to know what is hapening in the series not for an original storyline or amazing gameplay, it's to tell you the story of Naruto Shippuden so expect a hell of a lot of cutscenes, enought that I admit drove me to the point where I stopped playing this for about a month from the bordome of sitting through all of them.  So onto what it does right and wrong, first I'll start with the pros: -It tells the story really well and does the franchise justice.  -This is one of the very few games that actually make QTE matter as you get rated on how quickly you complete the QTE with stars leading up to a maximum, if you get enough stars you wil get a secret factor which is a couple of shots from the anime and has a little bit of dialogue which is the same in the games 1 and 2 also,  -The music for the boss fights are amazing and the boss fights themselves are handled really well with the rating systems coming in to make it so much better.  -The scenes that want to make to envoke an emotion are outstanding.  -There are changes to the battle system occasionally, where instead of fighting one on one in a circle type arena, you play more like a hack n slash game where you run through different corridors and defeat a number of enemies, it's done alright but it can get annoying after a while.  So now onto the cons: -There are so many cutscenes, this game seems more like storybook than an actual game, they are also extremely long, wih most being around a good 2 or 3 minutes of just dialogue and nothing exciting happening in them, you'll find yourself skipping them towards the end just cause there was so many, like I did.  -The main battle system is nothing special, it's ripped from the second game this time adding a few more characters that feel different which is good, but it's just kind of bland with each character having a melee combo and one or two jutsu moves depending on how long you hold the attack button. Also some characters have spammable moves that are really cheap whch can get extremely annoying especially if you find someone plaing them online.  -The difficulty spike is awful, unlike ninja storm 2 where the opponents became more difficult over time, this one just has enemies towards the end spamming you with moves you can't dodge and just get overwhelmed with nothng to do about it, and throwing as many enemies as possible at you, either one at a time or all together, neither is fun.  -There is no free roam and most side quests are taken out, once again unlike ninja storm 2 there is no free roaming, the game tells you where to go and you can't do anything to stop it. The side quests have devolved to fetching items for one or two people where you can only get back to them once you complete the game, where you do get to free roam when you complete the game it's not as good due to the sour taste left in your memory having to fight through the main story's corridors.  -The lip synching is laughable, there is no attempt to match the character animation with the english version script. I know it's difficult but it looks like they made no effort with the characters lips still moving for a litle while even after their dialogue is finished (I would suggest to have it in japanese and put on english subtitles, the voice actors are much beter and it looks like the characters are actually talking).  All in all the game isn't bad, but it's nothing special, The story is great (apart from all of the cutscenes) but the combat is nothing out of this world, I would say that if you wanted a better naruto game go back to Ultimate Ninja Storm 2, it was much better done in basically every aspect.  I'm not going to give this game a rating cause that is usually just the person that is reviewing its thought, so I will just say if you enjoy Naruto and want to start Naruto Shippuden but don't feel like going through 350+ of episodes, this game sums it up pretty well.     ",
            "review_score": "-1"
        },
        {
            "review_text": "I've spent the last 3 hours trying to fix a sound issue that, while not game breaking (thus far anyways, I've barely played due to trying to fix this), causes most game music to stop and restart in very short (3-10 seconds) intervals, while some audio dialogue and effects do work and others dont, without any discernable pattern. I may yet find a fix to this, and I've not seen any topics online that seem to deal with this problem as I've described it (plenty of other issues though), but I do not recommend anyone risking their money on this faulty product. Thank god I got it on a throwaway sale.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best Naruto games out there! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game already simply amazing when it came out.  Here's is what's good about this game: ◘ Amazing Story but went different from the actual show(Naruto Shippuden) still amazing. ◘ Beautiful 3D Graphics, I tip my hat to you CyberConnect 2 from not failing at this from the first game especially. ◘ Good cutscenes. ◘ So many more playable characters than NARUTO SHIPPUDEN: Ultimate Ninja STORM Generations. ◘ Awesome music. ◘ Fairly easy to learn the combos and fighting style of each character. ◘ Fair ranking system. ◘ After the story has ended, you're able to roam free around the shinobi world along with more missions, requests, and survival. ◘ Multiplayer is better than previous games. The only thing I can really not like about this game is the community but I'm not surprised and you shouldn't be either if you have played the rest. But you'll find that only sometimes you'll find worthy opponents to beat fairly and actually enjoy the match. I'm still going to give it a 10/10. ☼",
            "review_score": "1"
        },
        {
            "review_text": "nice game ut laggy the XBOX IS WAY BETTER the story is okay but its so laggy well hope u lik it ",
            "review_score": "1"
        },
        {
            "review_text": "*saw Tsunade in swimsuit costume*  10/10 would fap to it",
            "review_score": "1"
        },
        {
            "review_text": "I liked too much! nice game",
            "review_score": "1"
        },
        {
            "review_text": "Good battle gameplay mechanic &amp; really has a high replayability value w/ online battle feature of course, awesome jutsu cutscene of each character, nice graphic with fresh atmosphere n amazing music. I'll recommend it. lol",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game, If you are a naruto Fan i Highly reccomend this game. Its a solid Fighting game and it has an epic Story. It also looks beautiful. the Only downsides of this game are well as a 'PC Game' i would like to be provided with the option between choosing 30 Frams or 60 Frames .. SPECIALLY for a fighting game thats online. And speaking of Online well.. (11/26/13) -&gt; As of Launch The online has been 'broken' I get lots of 'Transmition Errors' hence, cancelling my matches... Its very annoying and I hope it gets patched, they said it will and its well underway so cool. If that patch fixes this online than i would say the game is worth the 40 dollar value IF it ends up being another hot mess than ill say wait till 'it drops to like 20 bucks because Something that claims to be fully working online should be fully working online and that should be well represented by the price tag.",
            "review_score": "1"
        },
        {
            "review_text": "This would be a great game if it didn't crash while I'm in the battle fighting against Madara with the five kage. I would really appreciate it if this issue would be resolved, it's quite irritating.",
            "review_score": "1"
        },
        {
            "review_text": "Keeps crashing",
            "review_score": "-1"
        },
        {
            "review_text": "Got it at $10, worth",
            "review_score": "1"
        },
        {
            "review_text": "CAN ONLY UES A CONTROLER . thats stuped i cant play and i am sad .",
            "review_score": "-1"
        },
        {
            "review_text": "This was a great game, along with some great story with it! If you don't want any spoilers please don't read anymore, thank you :)  **SPOILERS**  It was great watching Naruto make his way up to be king of the pirates! A ripping good yarn that had me glued to it the moment he found out he was a Titan or Nine Tails or whatever! The combat is great and tight and feels like every punch has weight and strength to it, one downside though, the fight against Piccolo was quite cheap and was the only downfall to the whole game. Most of all this game really is a fighting game, so don't expect much other game play, there are collectables to find like hidden tittles, costumes, names for the Death Note etc the list goes on. Though the core of the game is good enough to stand without those little extras! You can also play online with your friends :) Great game!   **SPOILER OVER**  I Might watch the anime after playing this! Highly Recommend giving this game a go if it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "It's an odd feeling enjoying a game only until you get good at it. The main fighting part of the game becomes repedetive quite quickly as the AI demands you pull no punches and rely on the same unblockable moves and counters in order to progress. The re-imagined scenes from the anime are spot on and the animations (on the most part) are smooth and responsive while actually playing the game.  It's not a perfect game by far but, for me at least, it was well worth it's sale price... I'm afraid I didnt have the time or inclination to try its online vs options so I can't comment on that.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun",
            "review_score": "1"
        },
        {
            "review_text": "If you like fighing in Naruto world this is game for you. Incredible missions and nice fights. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Rasengan meets Chidori. So breathtaking,",
            "review_score": "1"
        },
        {
            "review_text": "Its really hard to say, for the most Players this Game would be nice, but for me its crap.  The Reason is, it has a cap of 30fps and most times it feels like 10 fps, (this seems to be a general problem) And another big but is the slowmotion bug, i don´t know why but i just fight in slowmotion, no chance of fixing this problem and it keeping me from playing this game...  So if u wish to play this game, may check somehow if u have the same problems i have. ",
            "review_score": "-1"
        },
        {
            "review_text": "cant even play",
            "review_score": "-1"
        },
        {
            "review_text": "Chapter 2: 10/10  Game: 5/7",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy unless you are Naruto Fan. I played it to see what all the hype is about but didn't like at all. The duel does look stunning but all the 'limited' roaming around in between, nah.",
            "review_score": "-1"
        },
        {
            "review_text": "So far its really great. The blocking button for battle is a little slow :/ but other then that a great game! :D",
            "review_score": "1"
        },
        {
            "review_text": "The game is really good.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay isn't very good at all. The vast majority of the game is a repeat of the anime. Without good gameplay, it makes it very dry and unoriginal.",
            "review_score": "-1"
        },
        {
            "review_text": "It wasn't a very hard fighting game at all but all those moves are pretty easy",
            "review_score": "1"
        },
        {
            "review_text": "best naruto game ever!  cant wait to Naruto Shippuden Ultimate Ninja Storm Revulotion",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy it if you don't have a controller. Just don't",
            "review_score": "1"
        },
        {
            "review_text": "Great story, beautiful art, clean fighting... One of the best experiances i've had with a video game.",
            "review_score": "1"
        },
        {
            "review_text": "This is so good worth all the Freaking Money",
            "review_score": "1"
        },
        {
            "review_text": "why the ♥♥♥♥ is this on steam its impossible to configure keyboard controls so unless you got a xbox controller and adapter your screwed. keyboard users have to change all of the control settings wich is time consuming and when you do you cant use the block button or substitute. if your getting the game get it on  xbox or else your wasting your money like me. being promised a good game amd getting a peice of ♥♥♥♥ for this much money. its ♥♥♥♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I really wasn't expecting much from this game I only have it because a friend gave it to me and I felt obligated to play it, but I'm glad I did because the game is actually a lot of fun.  I don't like the anime, so I really don't think I have any kind of bias supporting it at all. This is probably why I am getting sick of the story mode right now since the cut-scenes can drag on for quite a while and I found myself skipping them a lot when I got the general jist of what the scene was about (sometimes even before that) and I would sometimes lose the context of a curtain fight.  But this IS a fighting game so the story isn't important what is important is the fighting system and I really like it. It's quite unique from other fighting games I've played and still manages to keep a kind of 'easy to learn, hard to master' element.   Most of the characters are pretty ballenced, except for the ones that have very fast acting far-ranged moves (like the exploding birds from what-his-face) that make fighting them with another character a real chore when it requires a lot more skill to beat someone who's just spamming the X button all day that is just as strong as special attacks, but doesn't use any energy for some reason.   I wish the game had a few more options though, it's basically a boring story mode, or fight other people online. With the amount of resorces the delveopers put into the story mode I feel like they could have toned it down a little to allow room for other features.  But I digress, the fighting system was enough fun for me to sink more then 10 hours into the game, I just feel like the game could have used at least one other feature instead of another 3 hours of cut-scenes for the story mode.",
            "review_score": "1"
        },
        {
            "review_text": "This story follows the adventure of Naruto for his search to find his long lost boyfriend Sas♥♥♥♥. Almost 40% of the game's script revolves around Naruto screaming and shouting 'WHERE'S MY BOYFRIEND!' at everyone and everyone telling him how much of a ♥♥♥♥♥♥ he is. But he don care, he just wants da D. Diehards fan will say that they're just like brothers but anyone in the right mind would know that he s a ♥♥♥♥♥♥. This is why we just read the manga, kiddies.  ALSO WHERE ARE MY EDO KAGES OMG AND THE SEVEN SWORDSMEN. I COULD BATTLE THEM BUT CANT PLAY AS THEM? WUT!?  11/10. great game.",
            "review_score": "1"
        },
        {
            "review_text": "A Very Nice Anime Game.  The Fighting is not too complicate to control and give the Feeling of Awesomeness like the Anime.  Totally playable with Keyboard, (Key bind setting in the launcher) But Controllers are recommended. (I play with Keyboard All this time)  Hours of Story Mode (~80% watching ~20% playing) Then Exploring the world afterwards, collect the history pages and Fight battles of the past. There are Some QTE in Story mode that rewards Special Cutscenes during the story gameplay. Some of the story battle might feels a bit lacking something (like the Beasts fight)  Also There's [Online Play] to test your Ninja skills Online. (Havn't try it much yet) And Free Fight mode where you can fight Locally or fight with A.I. or just Practice.  Overall I think This game is worth its cost. Totally.  Edit : PS. I've never read or Watch Naruto before playing this game. (of course i've seen it sometimes) But after playing this game I feel like i want to.",
            "review_score": "1"
        },
        {
            "review_text": "IT IS NOT WORKING ON PC ",
            "review_score": "-1"
        },
        {
            "review_text": "Putting the controller on my nuts while it vibrates is the most exciting thing I get out of this game.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend you buy this game if you have a gamepad. If you are a Naruto fans, buy it.So the storyline? It's amazing. You can feel the intense, you can feel like you are in Naruto's place Make Sure Don't Skip All The Stories In Story Mode..If you want to be a Naruto fans but you don't want to watch the Anime/Manga, BUY IT !!!!",
            "review_score": "1"
        },
        {
            "review_text": "999999999999999/10 LOVE IT ITS SOO GOOOOOOOOD AND EMOTIONAL IT MADE ME CRY WHEN I SAW NARUTOS MUM :)",
            "review_score": "1"
        },
        {
            "review_text": "its awesome",
            "review_score": "1"
        },
        {
            "review_text": "really good game for otakus like me but if u are a baka then stay away O.o",
            "review_score": "1"
        },
        {
            "review_text": "this game should'nt be on pc dont get it do something better with your time",
            "review_score": "1"
        },
        {
            "review_text": "Ok So here this game pro and cons !!!!!!!!!  1.Graphics are awesome 2. Story mode is sick trust me 10/10 3.Gameplay is fun 4.Ultimate jutsu and special finishers with animations from the series 5. Love japanese and english voices Now the bad!! 1. Console port but its ok still playable if you decent pc 2.. Ranked players not punished for rage quiting 3. Need more balance 4. Need more characters  All in all if your naruto fan and you didnt play it lol your missing a lot :O",
            "review_score": "1"
        },
        {
            "review_text": "very good game but has alot of bugs and crashers",
            "review_score": "-1"
        },
        {
            "review_text": "Great game so far buy it don't listen to the junk negatives just buy buy buy",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "weeb game 69/katana collection would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with awesome graphics! A must buy for all Naruto fans!",
            "review_score": "1"
        },
        {
            "review_text": "The game plays in nothing but slowmo so you cant even play it you will wast $40 dollars if you buy this game get it for console",
            "review_score": "-1"
        },
        {
            "review_text": "I am not recommending until this game gets fixed. A lot of crashes and no viable fixes.",
            "review_score": "-1"
        },
        {
            "review_text": "Pure cancer, nothing worked, rip $10",
            "review_score": "-1"
        },
        {
            "review_text": "I hate Naruto.. It's a foul example of what people think is good anime and manga much like Bleach....... hundreds of episodes much ado about nothing. That said, I played this game for 10 hours. Did a good job combining the show and the game together seamlessly almost. If the show was more like this game, id prob not hate on it so much.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "First i liked this game but it wasnt like i expected . Game was lagging and bad graphics . I want refund .",
            "review_score": "-1"
        },
        {
            "review_text": "Only for real naruto fans, imbalanced game.",
            "review_score": "-1"
        },
        {
            "review_text": "Even if you have never watched Naruto, I recommend this game. The most fun fighting game I ever played.  ",
            "review_score": "1"
        },
        {
            "review_text": "-be me  -have an old-ish PC  -run gamedebate's 'can i run it' for this game and revolution  -buy game in sale  -it runs at like 12-15fps  -goes to options, doesnt find ANY optimisation (as in textures, models, shadows, clouds etc.)   -even goes to nvidia control panel to try and optimise it  -didnt even get 20fps  -even worse, the controls are only for controllers, and the PC controls are either not there or require you to have 3 hands.  -suddenly realise its just a bad PC port.   -11/10 would be lied to by game debate and by a crap pc port again.",
            "review_score": "-1"
        },
        {
            "review_text": "  On Pc I Wouldnt recommend it because the controls for a keyboard is extremely difficult and if you have an xbox controller it might work but a ps3 controller your gonna have to download stuff that might give you viruses so no i do not recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "I've never ever seen a game more rapidly and severely fluxuate between being incredible and awful before this one.  Combat mechanics are well put together aside from the items which I refuse to use. Certain fights shift gears into excellently coreographed QTEs (take note every other game ever made, this is how you do QTEs).   The storyline hamfisted in between the combat almost felt tacked on and bored me to tears. I just browsed the internet half-interested in what they were saying on occasion. I can't openly advocate skipping the cutscenes though since you'll be completely lost. It just felt very slowly paced, especially if the target demographic should already know the storyline.   The horrendously tedious post-game content should be ignored EXCEPT for the side mission shards at the very end of the storyline, that is the content they added specific to this re-release.   The final fight(s) can be impossible-tier but if you can get past the first half you'll utterly crush the rest in a satisfying fit of cathartic, indignified vengance. Oh and of course on this one fight you need to use items, you can't.   It's not a bad game by any means, why am I the only person who bought it? Perhaps everyone else got the previous versions released on console.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This is pure anime fighting bounty.",
            "review_score": "1"
        },
        {
            "review_text": "roses are red violets are blue if you buy this game you're a weeaboo",
            "review_score": "-1"
        },
        {
            "review_text": "i dont like this because i cant play without xbox controller",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this game if you wanna play in online battles game for a long time looking for players in online and if game find people,they noobs or lagers ",
            "review_score": "-1"
        },
        {
            "review_text": "It really needs some bugs fixed in the adventure mode but over all its a very good game",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply put amazing! To be able to recreate or rewrite the story of the 4th ninja war is a dream come true. Amazing combo attacks and all the super powerful Jutsu really put you in the place of each character. A must have for all Naruto fans!",
            "review_score": "1"
        },
        {
            "review_text": "This is... no words... awesome game. :) Play it!",
            "review_score": "1"
        },
        {
            "review_text": "Before I bought and launched the game I wasn't really in to Naruto, but as soon as I gave in to the campaign it was an awesome experiance. It's a little hard at first, all the combos and what not. Make sure you have a controller(XBOX or PLAYSTATION)!!! The game is with great difficult without one.",
            "review_score": "1"
        },
        {
            "review_text": "I can't see a single Naruto fan who wouldn't enjoy this game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game , enjoying it pretty much so far :)",
            "review_score": "1"
        },
        {
            "review_text": "bought this game on discount. played 13 hours straight gg.   I'd give this naruto game a 9/10. get it when it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are beautiful, runs rather nicely. Action is very fluid and entertaining. Not to mention it's on sale right now for only 7.50...  If you're a fan of the Naruto series and have followed it, you may or may not enjoy the long and often cinematics compared to the fighting. If you've enjoyed Naruto games in the past, this one will blow you away...  The only downside i could think of is the Keybindings for Keyboard controls are fun to figure out, but once you get the idea down you'll be fine. If you pickup a controller you'll be breezing through the Story in no time. Then again there's always online matches...  First online match: -Deidara as the enemy, 1000 battle points worth of fights. Great! This should be a fun battle right? -Spams the SAME move over and over until my health is gone.  10/10 would get spammed again for the sake of pretty explosions.",
            "review_score": "1"
        },
        {
            "review_text": "i am so happy i bough this game :D",
            "review_score": "1"
        },
        {
            "review_text": "I Love The Game is sooo GOODD &lt;3 :)",
            "review_score": "1"
        },
        {
            "review_text": "i am having starting the game after i download the game and install it. It starts up and after i hit play for some reason it bring up the next screan blank and the game just wont start. Can anyone help me please or tell me what i should do?",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever, but missing some characters that I really want to play.",
            "review_score": "1"
        },
        {
            "review_text": "Great game the story ends different then in the manga and anime but thats because the game was finshed before the original manga and I think its nothing wrong with it. I played over 50 hours and still I have much to do until i can say that im finished with the game so you should pick it up if you are a Naruto fan or you just like fighting games with a new system (I play it on the keyboard :P) .",
            "review_score": "1"
        },
        {
            "review_text": "its not working for me ",
            "review_score": "1"
        },
        {
            "review_text": "good graphics  err gameplay great combat  8/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Follows the manga/anime pretty closely, however does trail off for entertainment purposes. Excentric cutscenes, Amazing fighting system and a popular anime, what more could you want? Only thing is, if you dont have a controller, you can't play this game. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "So far i'm not caught up on the story, but the combat reminds me of DBZ Tenkaichi Budokai 2 so I hope to play the Open Battles with friends and have a blast",
            "review_score": "1"
        },
        {
            "review_text": "Its naruto why not :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game but you should only buy it if you have a computer that meets its requirements other wise you won't be able to play at all",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of cinematics, game lloks great in 1440p, it is entertaining but not the best.",
            "review_score": "1"
        },
        {
            "review_text": "They have anime babes in their bikini underwear, it's hot as ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "If your a naruto fan buy it it was 5$ with the sales plain and simple",
            "review_score": "1"
        },
        {
            "review_text": "Even though walking through the campaign map is as boring as it ever was, the combat system is more smooth than previous entries. There are more fighting and less quick time events, which make it a more challenging game. The graphics are amazing, not in a technical aspect, but because the design nails the design of the manga/anime. It really looks like you're playing the manga. Someone would probably criticize the vast amount of cut scenes, but I don't mind. You really get into the story that way.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game for Naruto fans out there and there is a lot to do so many hours of gaming is expected",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10 short but sweet. the last battle is hell. like , its really long, like, super long. its tough too, until you figure out how to be super cheap. awesome graphics, its like wathcing an anime. which is something you do alot in this game. watch cut-scenes. the one in chapter 4 is , no joke, a half hour or better, long. its really sappy though, and hard to sit through. the actual fighting in the game is fun, and while some characters seem to be weak, and some strong, you can always win if you try hard enough or act cheap enough. Deidara, for example, is a really annoying P.O.S. seriously, he is a S.O.B.   I have watched a little past this part of the story in subtitled anime of the series, so the cut scenes and story were just a re-hash to me, but im sure, with fresh eyes, it is excellent. but the Raikage has 2 arms, and saskue cut one of them off in the anime.   cant wait for the next one, to bring new storyline to me. Its like watching the anime, but better. playing online is fun too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a work of art from the familiar landscape from the anime to the smooth combat, The story is very well written and pulls you in while you play, This game is a must have for any Naruto Shippuden fans.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing. it's super coold every one should play",
            "review_score": "1"
        },
        {
            "review_text": "I don't like Naruto. I am not a big fighting game fan. I only bought it because it was on sale.... and I don't regret it for once o.o.  Pros: -The story was very cohesive and actually well paced (i know...story in a fighting game. Who would have thought). I actually enjoyed the story  -The controls are surprizingly good if you use the controller.  - Somewhat of an open world feeling. I guess after you beat story mode, you can walk around the ninja world and do side quests (some which are very entertaining)  Cons:  -if you are an hardcore fighting gamer you might be disappointed. No tricky combos. Plays more like Super smash brothers.  -cut scenes can go on forever -no real tutorial so you just have to figure out how to do a lot of the actions yourself (tips in the loading screens help)  Don't judge this game by the title. It isn't utter ♥♥♥♥♥. Its a solid 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know if this is just me or anyone else but when I play story mode the final chapter Tsunade vs. Madara when its goes to the button mashing part,there is a certain part that makes my computer crash and also if I use Shikamaru Ultimate Justu the computer crashes -.- But other than that this game is pretty fun I wish there wasn't as much cut-scenes though",
            "review_score": "1"
        },
        {
            "review_text": "It's Just fun.   I personally haven't even cared for naruto games since about what... Clash of ninja... But this... It feels like someone took Dragonball Z Threw it on the floor and then smashed it with a gutted One Peice grand adventure.  As far as battling goes, It's your run or the mill kaiblast spam enabled fighter where you can either sweat it out with actual skill or 200 Million volts amal virtually the whole game. It does feel less enabled to do that seeing as the moves are very easy to do and a flick of the stick an change to varying combos. So it is very VERY easy to look and enjoy the game visually without buggering about specific moves or getting traped into a bind or ai that refuses to stop spamming you into the dirt. It's just fun. And it's sad that is the easiest way I can describe this game.  Just like most of the dragonball z series games, the game will give you the story while you play, though Naruto feels exponentially more immersive as to give you the mood and air of the moment while also letting you play, something that most attention to detail games like mass effect or such manage to so while you're playing. (or I really need to play newer games because a lot of newer games are just doing things right.) Nonetheless, instead of the normal something is about to happen here is what it is and a small flashback as to why, like sonic games and such. This game gives more of an RPG like place in the game, letting you observe details and characters from the beginning, and actively letting you use them, accompanied with allies who may have also been present. Long story short... It is really a great experience to be had.  Experience wise. The potential and overall delivery of the game is probably the best part to me. The menus and interface, the overworld and different types of battles as well as a grand sum of characters does very well as a fan service as well as a new game. Mob battles feel very much akin to games like dynasty warriors but multiplied by classic beat em ups. Small chechpointed areas and a fun way to see how your characters would work against everyone who isn't really a hero. It's beautifully presented, plays very smooth, and shows what the games can really become at any time provided people either ask for it or beg for a mod. It's hard to explain, But when you see two main characters and two assist characters on stage, it seems to really put up for some actual team battles. (Don't know if they exist)   All in all, It's surely a good time and plays as good as it looks creative. Shoot me in the foot though, as I wish whoever is pushing the art for borderlands would flip a few tables over here, because I'm almost too sure that the series could look like a tearfully joyous creation provided their models went through some other sort of process... You know... where bloom isn't a thing? But I know that that will probably never happen and if it did... I'd need to get some depends. No points against it at all for that, or anything for that matter.  I reccomend it for anyone who likes naruto or fighting games, open movement 3d fighting games to be specific, who also wanted to have rpg elements and unlockables along with scattered goodies that seperate it from normal fighting games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is frikin sick!!! But... it has some lag spikes, just so you know... IMO, wait til it's 75% off, $29.99 is pretty xpensive ;)",
            "review_score": "1"
        },
        {
            "review_text": "ruined my life 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, cant get this game to install right and Start! CP system is quite current and dedicated to gaming so there should be no reason for it not to work. Sighz!  EDIT: Finally figured out how to get it started, faulty controller (maybe) &amp; managed to sync keyboardd keys, apparently, it has to be done manually.. As in you have to key in your preffered keys for control..  The graphics blew me away, storyline seemed awesome, havent got to much actual gameplay yet but tested it out and it worked great! Now, to find other who have posted their controls screenshot so it'll be eassier to set up :)",
            "review_score": "1"
        },
        {
            "review_text": "Good game for any nartuo fan, tip for good performance, set resolution to something lower, turn off vsync. For those using keyboard and without controllers know this: keyboard works just fine.",
            "review_score": "1"
        },
        {
            "review_text": "this is a pretty game, if I had to rate it properly its around madaras level of pretty cool",
            "review_score": "1"
        },
        {
            "review_text": "its a very good game, however to play it on the computer without a proper controller its quite difficult",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst controlling fighters i have played and i have played a ♥♥♥♥ ton but at least they didn't have floaty flacide movement with spam to win gameplay. Bottom line get a copy of blazblue or motal kombat instead or if you are a naruto fan go on crunchyroll your not wasting your money that way.",
            "review_score": "-1"
        },
        {
            "review_text": "i cant even play it can i have a refund? its not working on windows 10  ",
            "review_score": "-1"
        },
        {
            "review_text": "Same as PS2 Naruto Graphics, Sounds, A lil of the gameplay  FUN!!!",
            "review_score": "1"
        },
        {
            "review_text": "It is so amazing, the graphics are awesome and I would recommend this for huge naruto fans.",
            "review_score": "1"
        },
        {
            "review_text": "Control scheme sucks on PC unless you have an xbox controller or whatever.",
            "review_score": "-1"
        },
        {
            "review_text": "this game so cool...i like to use uchiha itachi",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Do you enjoy simplistic combat with cool Naruto Artwork? Maybe it's for you. If you are looking for a combo reliant fighting game with any sort of strategy then this should not even be in the list of games you want to buy.",
            "review_score": "-1"
        },
        {
            "review_text": "one of the games that require you to be very patient and learn all the moves before you can actually get the game right. DO not recommend to those who does not have patience.",
            "review_score": "-1"
        },
        {
            "review_text": "i love this game in every way but there's one problem. it only works best with an xbox controller. but i still reccomend this game because i am a HUGE fan of naruto and this game is really awesome and one little problem wouldn't make me hate the game.",
            "review_score": "1"
        },
        {
            "review_text": "So much rubbish talking. 'Open-World' .. I rlly want to understand the idea. Check it first on Youtube, Rather buy sth else.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like visual novels pretending to be a fighting game? Do you like 30fps and a combat system that is half dynamic action button presses? Do you like watching the loading icon more than playing the actual game? Do you really really really like Naruto  If yes to any of these then this game is for you. I had never played any of the other games in the series but I figured It would be somewhat like mortal kombat, where the characters change as the story progresses. If only it had been more like mortal kombat. If you can manage to bear through the first hour or so of the game it starts to pick up...but what the hell is with the load times, sometimes it feels like the game is mocking you for wanting to, you know, actually play. here is a breakdown of how the game plays. loading screen/cutscene/loding/cutscene/loading/cutscene(yes you can skip them for the most part, however most dont have a dialog skip option so you have to wait for everyone to finish talking)/loading/pre battle planning/FIGHT/loading cutscene/cutscene/loading/walk naruto from one side of the path to the other/loading/loading loading.......I mean come on. Its more of an acion rpg/visual novel than a fighter. which is fine but when you have to load 3 seperate cutscenes before a fight it gets stupid, add on to that you have to load a (free world type) area where you just walk from one side of the screen to the other then it goes back to loading you might as well be putting in seperate disks for each fight, It feels like FFVII level of loading situations.  TLDR: loading screen/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't question it, me and my buddy GABEN approve",
            "review_score": "1"
        },
        {
            "review_text": "Ninjas, explosions, finger-in-♥♥♥♥♥♥♥♥ no jutsu, epic ninja star throwing action. 11/10",
            "review_score": "-1"
        },
        {
            "review_text": "Haven't played anything from the Ultimate Ninja STORM series, since UNS2, until UNS3 Full Burst in mid-2015. Unfortunately, online mode is empty, but there is still, bunches of fun to have with the rest of the game. So, excited for the 4th (numbered) installment.",
            "review_score": "1"
        },
        {
            "review_text": "Even though there's more cinematic than gameplay, it's still nice to play👍🏻 Great StoryLine (Exactly like the anime itself except for the ending)",
            "review_score": "1"
        },
        {
            "review_text": "If you like Naruto Shippuden then you should definitely get this! Although they do miss some parts out that are in the show, /TV Series it's still great all-round! The gameplay is awesome and the boss fights are epic! Also, I reccomend playing with a gamepad (preferably an Xbox 360 Controller) since in the boss battles you need to input some of the buttons but they're form the Xbox 360, although, you don't have to have one. (I got the game on a 66% discount) Also, it's better to get the game on a discount :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty alright. I really like how I don't have to play in god awful Japanese. It's got some pretty great characters, like in the closet puppet man, in the closet snake man, in the closet emo lightning weeaboo man, and last but certainly not least little boy who just wants some poon tang.   10/10 GOTY 2015",
            "review_score": "1"
        },
        {
            "review_text": "Me: A humble fan of Naruto who has been following the series through thick and thin. Me: Decides to buy this game to experience some nastolgia and revive an old love for Naruto. Me: Ends up crying about an hour straight because THE FEELS HIT.  Short in short, this is like all other Naruto games that are out. There's a story mode, a freeplay mode, and a nice combat system that somewhat resorts to combos. This game differs from other ones I've played, (mostly a few DS versions of Naruto games and one console one,) in which there are events that can be triggered if the player does something specific, a system that enables an awakening for the character to go through, (basically, a sort of power surge,) and that there is a long as heck story for you to play through.  So, do you wanna break your heart and relive the pain that is remembering Naruto's conception and his parents' horrible ending? Do you wanna fight as/against/with characters with iconic designs?  Then buy this game, hell yeah. It's honestly worth every penny if you're a fan.  Bonus: Hinata wears a swimsuit. *heart clutch*",
            "review_score": "1"
        },
        {
            "review_text": "This is the best narutimate game except number 1- the story mode on this one is the best from all the narutimate games. disclaimer: you might not share my oppinion but its k. it's all gonna be fine.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a big naruto fan I would recommend it. The battles in the story are super easy to breeze through to the end but you will enjoy playing as one of the many characters in the anime and using their attacks.  Online multiplayer is laggy and it can take a minute or two to be matched up against someone.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and worthy of the price tag!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!!",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for four hours--unable to stop myself until after I've progressed to Chapter 3, I can safely say that I REALLY enjoy this game. And that's coming from someone who does NOT like playing Fighting Games, I have a temper problem with getting hammered into the ground constantly and I have slammed my controller onto my table in a fit of rage once whilst playing this game but I can safely that was that due to the computer being a cheap ♥♥♥♥♥♥♥ and not so much my skill being obsolete! =P  The combat is VERY fluid and feels nice, the enemy will always adapt to the way you play.. if you beat on their face a lot they're going to teleport away a lot, if you hang at a distance and pelt them with ranged weapons they burst their way towards you to beat your face in. If you hammer them constantly with jutsu, they'll start blocking and dodging at the last second. Sometimes you have to alter your strategy on the fly and find ways to counter them, I've lost more than a few fights already and it's never a pleasant feeling when you 'DGAF' button gets pressed.  Story is pretty solid and makes you feel as if you're actually PLAYING the anime, not the game and draws you in. The pacing is perfect, the controls feel marvelous on my controller and it's not overly complicated like most fighting games tend to be. There IS no Right, down, circle down to right, b then wait 2 seconds then hit Y. It's just charge up, tap this button, now wait and avoid attacks and hit this button and BLAMMO, combo initiated. For that reason alone, I love the combat system. It's something that even a casual gamer like myself can enjoy. The difficulty of the story is unable to be altered, and the enemies scale in difficulty based on who you're fighting and how serious they're taking you, and if you lose to them too many times the game lowers their difficulty so you CAN beat them and progress so there's no wall blocking your progress.  You get rewarded for completing bonus objectives which are a lot of fun to do, especially when you finally land that specific requirement and can actually see what your new reward is! I tend to average either A's or S' for my ranks after defeating somebody, and it's very gratifying to see that high rank consisently. I honestly can find NOTHING wrong with this game, personally, and for that reason alone I'm giving this game a 10 out of 10. A must-have for ANY Naruto fan... though if you've never seen the end of the Series leading UP to Shippuden? You're probably going to be confused about a lot of things.",
            "review_score": "1"
        },
        {
            "review_text": "First of all let me first say this I've been playing and watch Naruto since I was little It's a really fun franchise .OK now for the review in this game it uses a nice processor so make sure you have that or the game will lag ALOT trust me but other than that thr game is awesome could've done better tho. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "a must play game for naruto fans!",
            "review_score": "1"
        },
        {
            "review_text": "Good games although pre-set pc controls would be nice.  ",
            "review_score": "1"
        },
        {
            "review_text": "this is a really good game if you haven't got yet get it",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT. Great and wonderful, it is clearly worked hard on and is awesome. Its all great, the series, the games, especially this one. The only negative about it was it used a game controler, i had to fix it out and change the keys, just takes time to get used to.",
            "review_score": "1"
        },
        {
            "review_text": "Why i can't pick yasuo at this game?",
            "review_score": "1"
        },
        {
            "review_text": "the best storm game so far :3 i bet storm 4 is gonna be the best when it comes out  - EDIT: Storm 3 is still the best, in my opinion :3",
            "review_score": "1"
        },
        {
            "review_text": "its alot of fun ",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and sweet game! The line was aweson :D -PS Without a controller is hard to play but I managed to play this game somehow &gt;:D",
            "review_score": "1"
        },
        {
            "review_text": "For any Naruto Fans out there...yes. I would recommend this game. If you are not interested in anime or fighting style games then don't. Also. Before you buy this game, I would highly recommend a game controller (like a wired xbox) because the interface is really only usable with one. You could program the keyboard in yourself but the controller is what the game looks for right away.",
            "review_score": "1"
        },
        {
            "review_text": "How can I review it? Well, I even couldn't play it! This game just trapped me by its awful fluidly. The game works in SLOW MOTION, this is right? I don't think so. I don't accept this. If anybody help me I'll just want my money back. Now I know why this ♥♥♥♥ is on sale! damn I want a solution! Another thing in additional at this review: The description LIES when says that the game comes with additional languages like Brazilian Portuguese for interfaces and subtitles... this is not true! Now what if I am brazilian and I would expected for this? I think now have a pile of troubles here. HELP!  EDIT: Now changing my previous review as I found the solution for the problems. Now I'll need a good videogame controller to play well this game. The game is cool of course in graphics, story, dialogs, cinematics and sounds... I liked!",
            "review_score": "1"
        },
        {
            "review_text": "To be honest at first when i got the game i thought it was just going to bee another normal story line. But i was blown away how amazing this one was. This is a must if your a fan. It goes to the extreme with the story. And combat is great like always. I like how they give you options on how you wanna go ( legend or hero ) But overall i really recommend its a MUST!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Graphic is not good as expected but it's OK, also my computer can't seem to run well on highest setting. The game was not originally made for PC, so the control is messed, that's why I'm thinking of buying a joypad ^^.  3 things I like, first one is the story, the way that the game is telling the story is really good, and it can attracts you well. The music is excellent, well at least I really like it. All the fightings are also great. I haven't explored much but I'm already starting to like it. Give it a try, it's a good game",
            "review_score": "1"
        },
        {
            "review_text": "i suck at this game but i love it ",
            "review_score": "1"
        },
        {
            "review_text": "Naruto Ultimate Ninja Storm 3, in my humble opinion, is a really fun game with a few flaws keeping it from greatness. As an avid fan of the series both manga and anime, I decided to pick this game up after doing some research on it, and have been very pleased.   Disclaimer: This is my first ever Gamefaqs review; you have been warned  Graphics: 9/10  I think that the game is just beautiful! The character models are all rendered and match their anime counterparts nicely. While the graphics don't look exactly like the anime, I think thats a good thing. because it looks like a video game instead.  As you fight through the story, you will face a wide variety of characters, fight huge bosses, and you will get to visit a multitude of iconic locations from the series. Not one time in my playthrough did I say 'well that doesn't look very good.' The color, scenery, and vividness of the game really do an excellent job of capturing the Naruto Universe that we all know and love. Even the opening menus have a great amount of detail put into them.  Another big part of this game is the large, large, LARGE amount of cutscenes and action sequences, and I believe that they all look fantastic! There are massive explosions, high paced action, and gripping story moments that are all captured very well within the games engine.   However, there is at least one major fault, and its mainly because the game can get a little big for its britches sometimes. I don't think I experienced this at all throughout the story, but when playing in tournaments or online, if multiple jutsus and teammates start getting called, the game does have framerate issues. This is the sole reason this portion doesn't get a 10 from me.  Story: 8/10  Now, if we are just talking Naruto as the manga, I would personally give this a 10; but we're not, we are talking about Ultimate Ninja Storm 3 the game, and it does have some setbacks.  The game follows the story immediatley after Naruto's confrontation with Pain, and continues up almost to where the manga is currently. The main form of story progression is through cutscenes, which there are a ton of! Not that that is bad though. One cutscene in particular lasts at least 30 minutes, but it does a wonderful job of getting you immmersed in the story and if you are invested in the series (like me) you may even find yoursef shedding a tear or two! How many times can you say a video game has done that to you before?  My biggest qualm with the story has to do with the so called 'Ultimate Decisions' you make throughout the game, as they really don't do anything to effect the way that the plot unfolds. I think that in theory it was a good idea, but basically all it does is ramp up the difficulty (slightly) on certain missions. UNS3 is not a difficult game to begin with, and I would have rather seen two different endings than come to the same road at the end for some additional replay value.  The story also expects you to already know what is going on, so if you are on the fence about getting this and don't know your Naruto lore study it up or you will not have a clue about what's going on.  Sound: 8/10  Not much to say here. I thought that the music fit the mood for the game very nicely. Sad moments had soft piano keys playing in the background, and intense moments revved it up the way you would expect a Naruto game to. Everything in between was pleasant to listen to, it's just... it wasn't the original soundtrack. As much attention to detail as was put into everything else, I really wish they had gone ahead and gotten it, because you just can't replace it. I guess there were some copyright issues preventing its use.  Gameplay: 8/10  A cast of over 80 characters unite for some seriously over the top action that you can take on in the story mode, locally with friends, or online against the rest of the world! This game is so much fun to play! So why does it get an eight instead of 10, I will explain.   One downside is the very limited free roam that is offered. I almost thought why even include it, but it does open up from otherwise linear paths after you have completed the story. Basically sometimes you will watch a cutscene, then get sent to free roam. After running a short ways you will then enter another cutscene or battle. There is really not much to it other than that. You can talk to NPC's and there are a few sidequest offered, but they really didn't seem worth it to me unless you are going for all of the trophies. It is mainly just a means to an end to get you to the next battle. And that is where the meat of the game is anyway, the battles.  The game has both single and team battles. Single being just you as your character of choice (or who is currently the story character), while team battle allows you to pick one or two support characters to help you. The combat is fast paced, but never too difficult to follow, with exceptions being online sometimes.   You primarily attack with the circle button, or B button if you are on Xbox, and have three varying combos you can perform by just pressing circle and using the analog stick. Triangle is your chakra load button, X is jump, and square is the shuriken button. You have basic, and chakra loaded moves that you can execute by pressing the chakra button followed by a different command. This is how you execute your jutsu and ultimate jutsu attacks. You can also block by holding R2, though it can be broken, and you can use a substitution jutsu by pressing L2 while being attacked.  There are a variety of cancels that you can perform when executing attacks that will allow you to create your own, flashier combos, and add some depth to the gameplay. The most common of these is the Chakra Dash Cancel (CDC). Basically, while comboing or doing another action, you can press triangle and then X immediatly after to cancel whatever you were currently doing. These cancels are what really add the tactical aspects to battles, as well as providing ways to score big damage if you know what your doing.  All that being said, you will have a blast playing through the story mode, but you may experience frustration if you try to take the game online.  For me, it has mainly been connection issues. Lag is very, very abusable in this game. I cannot tell you how many times I have eaten a jutsu because the game read one extra circle press. Basically, when you are fighting someone online you need to conserve your chakra and your substitution jutsus more than anything. Play well, make the other guy run out of substitutes, and then punish them with big damage, thats how its supposed to go. However, get into a room with a little bit of input lag, and your read on when your opponent is going to substitue turns into a Rasengan Barrage because instead of being able to block or chakra cancel, the game said you hit attack again. It is playable though, and playing in rooms with little lag is a lot of fun. Winning against a good opponent is a very rewarding experience, not to mention you get to do all with your favorite Naruto characters! Both ranked and player matches are offered, as well as a tournament mode that I haven't gotten to try yet, but has a variety of different rules.  I would also have liked for this game to have been made with a more competitive aspect to it rather than almost strictly fanservice and casual. There is a skill aspect to it, some players are simply going to be better than you should you pick up the game, but there are some mechanics, like awakenings, that I do not like.   Awakenings are very powerful 'super modes' that characters can enter. Don't get me wrong, they look AWESOME and make you feel like a boss when you use them, but they need to go IMO. You could be playing the match of your life, and have your opponent down to half a bar left, but if they manage to get their awakening off they could easily turn the tide back in their favor, and I do not like mechanics that reward players for getting beaten. Instant awakening",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "This game was fantastic on ps3 and I ready completing every mission, now there is the challenge of the steam achievements and also the full burst dlc :)  If you are not a fan of naruto this may not change your mind. BUT the fighting, free roam, story, challenges, participation, giant duels, twist endings, 1vs9 combats and the huge character list and accesorial desire will change your mind.  Platnium game on ps3, a great game on steam &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A buggy multiplayer that rarely works, and a story that has some boss fights that are just downright painful to play through. I want to recommend this game but as it stands you'll only enjoy this game if your a naruto fan, or a fighting game fan. This game will not be an ambassador to the genre.",
            "review_score": "1"
        },
        {
            "review_text": "good game need a good pc tho",
            "review_score": "1"
        },
        {
            "review_text": "If your a nuruto fan then buy this awsome cut sceans but multiplayer plays up a lot  ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and it tellls u all the bits u need to no about the story ",
            "review_score": "1"
        },
        {
            "review_text": "I like this game a lot. I definitely recommend this to fighting game or Naruto fans everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "Thisi game is amazing and this is the definitive version of the game. A MUST BUY for Naruto Fans!",
            "review_score": "1"
        },
        {
            "review_text": "why i can't play NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 Full Burst in steam by keyboard ,,do i have to buy a hand?",
            "review_score": "1"
        },
        {
            "review_text": "NS:UNS3FB is THE ultimate ninja game which I recommend to ALL Naruto fans out there, since it is recommended to know the basic story of Naruto before playing this game, as those having no idea of the plot will get lost easily in the story mode. This game is PERF!! Widest range of characters I have seen in a Naruto game thus far and the attacks are impressive and easy to use. Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "really enjoyable fighting game after all .  come join us .",
            "review_score": "1"
        },
        {
            "review_text": "that game is awsome :D multiplayer &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This game has reunited a childhood friend from many years ago. When we were both kids, we would play an old Naruto game, and finally, years later, this game brings it all back. The gameplay is extremely smoothe and the in-battle cutscenes are flawlessly excuted. I 100% reccomend this game! :)",
            "review_score": "1"
        },
        {
            "review_text": "If you want a killer fighter grab this game! This game on max settings does wonders to your eyes!!",
            "review_score": "1"
        },
        {
            "review_text": "It's HOT BLOODED!",
            "review_score": "1"
        },
        {
            "review_text": "I was waiting for this game on PC for a long time Not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "Would be nice if the online was playable but otherwise good game.",
            "review_score": "1"
        },
        {
            "review_text": "I've never watched Naruto before, but this game is a blast. The combat is fast and frantic once you get the hang of it and can make for some very intense battles. However, the story mode picks up at some kind of arc in the time line so there's some big spoilers if you ever intend to watch the anime. The cutscenes are super well done though. My only issue with the game was that the final battle was hard for all the wrong reasons. Otherwise this game is great.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good but the port is ♥♥♥♥! ",
            "review_score": "1"
        },
        {
            "review_text": "Hi, I bought this game, and it is realy good, even if you don't watch the anime. Know that it will be running, originally, at a very poor frame rate, but i'm gonna save you from a search and tell now: you are going to oplen the file NS3FB (the screen settings one) and, after thhe Vsync, you will write this:  iMaxDecalsPerFrame=100 framelimit=60 It should work. If you want to increse the fps even more by changing the values(100 and 60) for bigger ones, it will just lag your game, than, don´t loose your time trying it.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game,  Pros:  Fun game (great story mode) Really good animation Combos are easy  Cons: lack Various combos for moves. (one button spam) practically all the characters moves are the same If you already seen the anime(cutscenes) its not really worth getting ending not part of the magna/anime Loading time",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME IF YOU DO NOT OWN A CONTROLLER OR YOU ARE OK WITH USING A KEYBOARD.  I originally purchased this game on the PS3, and have many hours played on it. I recently purchased this game during the Steam Summer Sale, so regardless of my current time played on this game through Steam, I have alot of experience with this game outside of the PC version.  If you are a fan of the Naruto anime series, you will love this game. With that being said, the PC port for this game isn't what it should be. A controller heaps alot and the keyboard controls have to be manually set by the player in order to be used. Using a keyboard is highly discouraged with this game.  The game takes place just after the Pain Invasion Arc, and focuses on the Fourth Great Ninja War. The player takes the role of a few of the main characters as it follows each one through their perspective during the war. The story mode is a mix between long cutscenes, fights and free roam. The audio can be changed between English and Japanese (all with subtitles).  The cutscenes may be long but are necessary to develop the story. They can be skipped if wanted.   The fights are very fun and challenging, requiring certain techniques and strategies to be used to defeat the enemy. The fights can be considered 'button mashing', but skillfully uses certain attacks at certain points during the battle is a much better strategy than spamming the attack button.  The free roam can be very annoying and boring. Running from one village to another can take quite some time, and the side missions can sometimes be very boring.  The online battle mode could have been excellent if executed properly. It highly favours the host of the match, and adds artificial input lag to 'help' balance the connection disadvantages, but fails miserably. It is also very difficult to find anyone to play with within my region that has a decent connection. I'm sure with good connection, the online mode could be very fun.  The regular battle mode is very fun and can be customised to the players liking. It also features a tournament mode for those who want a fun and exciting challenge.  Overall, this is a very good game, but the PC port fails to live up to the hype. If you have a controller to use on your PC, this game is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like I'm an outlier here, but I don't like this game very much. In terms of fighting mechanics, it's very dull and not very creative, and the story doesn't diverge at all from the manga. Your money within the game buys pretty much nothing of value, there's a lot of pointless running around, and talking to characters adds literally nothing to the game. From a game dev and consumer standpoint, it's very poorly designed.   Would not recommend story mode at all. If you are a huge fan of Naruto, you'll have to force yourself through the story mode. Multiplayer is slightly more interesting, though I'd say it pales in comparison to something like Smash or Budokai.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of my favorite games. I'm a huge naruto fan and when I saw this game, I just went crazy. I really wanted it for some time and when i got it, i played for hours. Overall, this is a good game and you should really enjoy it when you get it.",
            "review_score": "1"
        },
        {
            "review_text": "ino is hot",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun overall, and the only complaints I have with it is the AI. It's way too easy on normal VS mode, so using Awakening forms that are dependant on you losing a certain amount of HP is often pointless, and you must suck on purpose to get to use them. Those are the fun bits, come on! Make the AI have different levels of difficulty on VS mode. There is a special mission mode which will set battle conditions, but the only ones that are fun are those who have much more HP so you can feel like it's a challenge instead of a chore to win.  Tl;dr: Great and fun game except for poor AI and VS battles. Make the AI better and let us customize the VS battle condition with HP, Strenght, Speed, Chakra, etc",
            "review_score": "1"
        },
        {
            "review_text": "One of the best fighting games i have played. I really like the style of the drawing of this game. the view looks like awesome. For this moment i almost ended this game, but i really getting fun playing thru. I got this game as the gift on my birthday. Before game i waste really a lot of time for Naruto anime and i don't regret of it. There are you will meet a lot of characters from Naruto story. Obvious it is the good fighting at all:-) you can play with your friends and get a lot of fun ( let them beat you a bit (: ) So, let us summarize - 9/10 (in my opinion) The game is worst this price! enjoy Naruto!  ",
            "review_score": "1"
        },
        {
            "review_text": "Even if you are into anime-games, or if you are not - this game is still enjoyable for everyone! This is probably my favourite fighter-game. LOTS of characters (around 70-80 playable), many maps with unique features, many combos, overall moves, special character-unique moves and ultimate moves. There's nothing that I can think of that is bad with this game. When I heard about the next 'Naruto Shippuden' game being released, I didn't even hesitate about pre-purchasing it. And what about you reading this review? Hell, just go buy it and stop reading! :D",
            "review_score": "1"
        },
        {
            "review_text": "If you watch the Anime you will enjoy this game. It moves the story past the American Release shows. Easy to play and plenty of time watching cut movies to properly Medicate one's self.",
            "review_score": "1"
        },
        {
            "review_text": "Great fighting game, with simple button combos allowing players to immediately try out a new character. However, the main story mode is basically watching the anime with a few fights.",
            "review_score": "1"
        },
        {
            "review_text": "Simple game fighting game with some advanced mechanics for the pros. Definitely worth the 20 dollars to play with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Very great Naruto-game. Best of four Storm games.",
            "review_score": "1"
        },
        {
            "review_text": "so far i regret buying it.. u NEED a xbox controller hooked up to the pc.. or else u can not play, the game itself is cool.. i hope",
            "review_score": "1"
        },
        {
            "review_text": "doesn't work!!!!!!!! ♥♥♥♥!!!!!! I payed 100 RM for this on molpoint  cannot open the game,,,, !!!!! only white screen comes out and continue to not responding!!!!!! what the ♥♥♥♥!!!! ",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a fan of Naruto this is the game for you. It is honestly a better experiance of the the plot than the anime. Gameplay is solid and boss fights feel great. Nothing has really changed about these games since the last entries into the franchise so only buy if you care about the series or is a first time purchase.",
            "review_score": "1"
        },
        {
            "review_text": "a Grat game for any naruto fan",
            "review_score": "1"
        },
        {
            "review_text": "yes this game is awsome but there a bug were it can't found it files but in all 10 out of 10 and the keyboard setup is not done you have to do this and it tricky to set it up right",
            "review_score": "1"
        },
        {
            "review_text": "If you like Naruto, you must to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. My only gripe with it is the audio syncing during the cut scenes. But other then that, if you love the Naruto series, you'll love this game.   Side note: This game also reminds my of the old Dragon Ball games which I loved.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Wold definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "If you have a wireless gaming receiver for your PS3/XBox 360, the game is super fun. I tried a couple keyboard layouts, but I felt so cramped when trying to play.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good if you are a Naruto fan. It follows closely to the story but actually starts at a point in shippuuden. The fighting controls are hard to use, even on a 360 controller. It's hard to be 'good.' If you haven't been watching the anime for a while and trying to get back into this series, you might be annoyed with Naruto's antics.",
            "review_score": "1"
        },
        {
            "review_text": "*The* ultimate hot seat fighting game. Made me interested in the Naruto saga.",
            "review_score": "1"
        },
        {
            "review_text": "The best game Butttttttttttttt why the ♥♥♥♥ is there no tailed beast form for gaara :(",
            "review_score": "1"
        },
        {
            "review_text": "I should perhaps start off this review by stating that, while I am a fan of anime in general, I'm not really that into Naruto. The obvious question then is why did I play it, the answer to which is that I figured it would be like other game adaptations of bad source material that turn out good. Which, in some aspects, this is.  The main part of the game, which is of course the combat, is pretty good. I don't think I've actually played a 3D fighting game before this, but it's pretty accessible. The combos are simple enough to remember (and are optional to the overall experience anyway), the controls aren't deliberately broken so you have to buy a separate controller (I swear a lot of fighting and racing games actually do this), etc. and the characters seem balanced enough from what I can tell (I didn't really try the multiplayer stuff so who knows).  The visuals also manage to pull off the cel-shaded effect quite well and have a nice overall cinematic feel, and the soundtrack is fantastic. Voice acting is okay as well, with perhaps the exception of the main character. Seems to have the same actors as the anime series so fans of the actual series (whoever they are) might like that.  But with all this great stuff I'm saying about this game so far, you may wonder why there is a red thumb down at the top of this post. And it really boils down to the overworld parts in single-player when you aren't fighting, plus the save system.  It has a sort of open-world-but-not-really JRPG sort of feel with it. That's not the bad part, it's not a bad idea if it pulled it off that well. There are a few main problems I have with the execution here. Firstly, the damage you take in one fight remains in the overworld, and carries over to the next fight. This means that you will probably lose the next fight, and be given an option to either retry the battle with that same amount of health or to restore your health. You will be penalized for choosing the latter. Even when, and this is the second thing, there are like 5 battles in a row without a chance to go to any noodle shops or buy some healing items or anything at all. Normally this wouldn't be a problem, but combined with the first point, and the third point that I'm about to mention, it is simply painful.  The third point is the save system. Despite being a game released in 2013 (i.e. not in the 1980s, where perhaps technical limitations were an excuse for bad design) it still has save points. That doesn't make the game fun. I really don't know why some developers are incapable of understanding this. Most games with save points at least give you the option to do a quicksave which exits the game and gets deleted when you launch it again, but this doesn't even give you that. Just a couple of bird houses that you hardly get a chance to go to because it's just fighting non-stop, and at the end of each chapter.  This does not combine well with the fact that the first chapter at least (I don't know about later ones because I stopped playing when I finally finished it) is about an hour long. That's not even including cutscenes. As I said, I'm not a fan of the anime series, but I figured I'll watch the cutscenes anyway to give it a chance and to try and make sense of the plot (I think you have to play the first Naruto games first). Said cutscenes are around... 11 minutes long. I think they're skippable, but when you've finally got through 5 full fights and you wanted to stop playing 40 minutes ago but the game's lack of saving won't let you, an achievement pops up that says you apparently completed the chapter finally any cutscene that comes up with a 'better not skip this because it sounds important' vibe to it just feels like a slap in the face. Please stop, game.  I just want to go home. I feel kind of rude saying this, but I actually have other things to do than play this game non-stop. I really wonder how this part got past playtesting (if there was any). Did they not take into account that people actually have jobs, or kids, or whatever?  It's a shame really, because I wanted to like this game, and through the prologue and beginning of the first chapter I thought I was going to (minus the plot which I expected to not be great anyway, I'm not going to complain here about how this Sasuke guy is edgier than Shadow the Hedgehog made out of razor blades because it would be ignorant of the 'Naruto' in the title).",
            "review_score": "-1"
        },
        {
            "review_text": "THE game is excellent although this idiotic 'steam' won;t let me access it after closing the dispute on PayPal ",
            "review_score": "1"
        },
        {
            "review_text": "At first I couldn't believe the lack of button use in this game. This is also the first one I've played in the series, so you know. I loved to story as of course I knew I would. But the gameplay here is what really matters! I actually learned that the fighting system in here seems to be too simple at first. After some hours though, you'll learn that even though it seems like the fighting system might be too simple, it's really all about the timing. Really fun game and lot of play value out of it with friends! Once you get used to the fighting system and play against others, they may get mad. It feels like cheating once you get really used to timing and all. :P",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, I wasnt a fan before now Naruto is one of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "Great fighting game, plenty of play time. Worth buying if you love naruto",
            "review_score": "1"
        },
        {
            "review_text": "would be way better if it was 60 or 120 fps but its still a good casual fighting game",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy the anime, this game is a must.",
            "review_score": "1"
        },
        {
            "review_text": "Result: buggy as hell, same goes for the sequel!  Asked for a refund as the game froze to a black screen on startup and froze on exiting settings.  Tried fix listed in Discussions setting sound card to 16-bit/48 KHz without luck... As a programmer this made no sense to me at first... now that I think about it, the reason is with 99% certainty that it's a ♥♥♥♥♥♥ console port. VERY below par.  Get this &amp; sequel for console, at least that will rule out hardware difference issues!  Shame, since i'm somewhat of a fan, and still looking for a proper Naruto game...",
            "review_score": "-1"
        },
        {
            "review_text": "10/10  Pros - Great story - Great fighting mechanics - I love it  Cons - Wierd camera angles (Especially at the    time where you fight the tail beasts.    - Long loading times in between menu's and some areas  I cried at    naruto's parent scene &lt;/3   ",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing rad. The story mode may have been easy, but they captured the feeling you get from watching the anime, with the added bonus of being able to feel as if you're there yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Way better than Generations. And it looks amazing with SSAA, just like the anime.",
            "review_score": "1"
        },
        {
            "review_text": "the worked good at the start but now its not working",
            "review_score": "-1"
        },
        {
            "review_text": "Combat is exciting as any DBZ fighter, and the storyline is much better driven than I have seen to date. Even those that are not fans of the series will get a great deal of enjoyment out of this game. You need no Naruto knowledge in order to have a great deal of fun with this game. With the way that the story mode is set up, it will just draw you in.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Solid single player with again more upgrades compared to the older versions, and ofcourse pc quality graphics.  The online seems to work smoothly ofcourse connecting to people who have a slow ISP will need more time to pick a character and load a map.  As for combat itself, theres 4 keys. Melee / Ranged / Chakra / Dash. But its not as simple as that. chakra+melee = special / chakra chakra melee = ultimate and so on, you can combine chakra activations with attacks and movement.  Also you can combine movements with attacks like holding down while tapping melee will result in a diffrent combo this will make your oponents timing on defending harder.  And each character has a special ranged/melee combo wich can be accesed with forward forward melee how it is followed up depends on character you are using  Minor downside for me personally is that in single player fights some finishing moves involve buttons to be pressed in time or mashed wich distracts from the amazing jawdropping scenes running in the back.(sadly they have done this as long as ive played ultimate ninja games)",
            "review_score": "1"
        },
        {
            "review_text": "If you love Naruto your gonna love the game, Story is bleh we all know it but the game wasnt made for the story it was made for the fighting mechanics and how in depth they really go. I swear every time I play online I just get this adrenaline rush lol! The only bad thing i can say about the game is that they need more chraracters :)",
            "review_score": "1"
        },
        {
            "review_text": "i love this game but with 3 gripes one lack of video settings two online sucks sometimes (mostly against friends) three the biggest one in all caps you have been warned     THE F-ING SAVE FILE KEEPS RESETING ITS SELF SO EVERY TIME I PLAY I LOSE ALL OF MY UNLOCKED CHARACTERS WHAT THE FUDGE!!!!!!!!!!!!!!!!!!!!!!!!!!!!! other then that this games okay.",
            "review_score": "1"
        },
        {
            "review_text": "This is even better than Storm Revolution. It has more feature too",
            "review_score": "1"
        },
        {
            "review_text": "Great game even if you've never really payed attention to the anime or manga itself. It's on of those fighting games that even if you lose, it's fun enough that you don't really care. I would recommend this game if you are looking for a fighting game to play with friends that isnt frustrating or hard to control.",
            "review_score": "1"
        },
        {
            "review_text": "this good game",
            "review_score": "1"
        },
        {
            "review_text": "Really good fighting game  especially if you are naruto fans!",
            "review_score": "1"
        },
        {
            "review_text": "Even if you aren't a Naruto fan, the story will bring out feels you never thought you had. I owned the regular version on the PS3 but it's hard to pass up the major discount so I bought it for my pc. They really improved a lot and kept the addons from the previous game. All the characters are there, the xtra clothing, and the battles are fun.   I know that some people had complaints about the graphics, but I think with some tweaking, it can be fixed. I had it run on my GeForce GT 650M and at first, the ultimates were messing up my visuals. After setting the V-Sync and making NVIDIA take over, that was gone and I pretty much still enjoy it hooked up to my HDTV.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but could be better. The only 2 things that are bothering me, are Loading Screens, and unnecessary 'free world'. Example: Cutscene where you are running towards the battle, but then you control the character for like 10 s and looses the whole momentum, and then the cutscene where he runs like a ninja :).  Fights are awesome, but still it could be a lot better. I would reccommend it if you are a fan of Naruto series or if it is on sale. I would recommend you to wait for UNS4. But an enjoyable experience.",
            "review_score": "1"
        },
        {
            "review_text": "Shippuden is a good example of arena-based fighting games. It sticks decently well to the story of the manga/anime. The graphics are great, and the combat system is impressive. Definitely worth the buy",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty good and looks good for the requirements",
            "review_score": "1"
        },
        {
            "review_text": "If you like anime, Naruto, button masher and cel shader, grab this one!  Campaign is a very nice story adaption and not too hard. Playing it through unlocks all characters, too (takes less than 30h if you watch all scenes and hunt for rank S). But for unlocking, MP will work, too, as every fight rewards you with some money and unlocking works by gaining total amount X for each character and outfit.  Multiplayer works good: local 2 player, turnament mode for up to 8 player, online battles and is relativerly good balanced so far.  Fighting style is the most important, at least for me: You don't have to remember tons of combos like in Tekken or Mortal combat; there are some general combos working for every character and if you have your favourite, there are 3-4 more for each character; but you don't loose just because you don't know them by heart. Most of the time you 'just' have to react fast and correct instead of hammering 10-varying-button-combos. That makes it also a nice alternative for party games like Smash Brothers since it's relatively easy to learn, only mastering takes some time.",
            "review_score": "1"
        },
        {
            "review_text": "Being a fan of the 'Clash of Ninja' series I was really excited to play this Ninja storm series mainly because its on computer. Although this game has the best story i've seen in a 'fighting' game and its also very well polished I do find myself dissapointed in the combat mechanics.  You only have 1 ninjutsu and 1 ultimate ninjutsu per charecter. Along with a simple combo system I tend to get bored of each charecter quickly. Instead of quailty ninja with a variety of abilites they made a lot of the same ninja but with alternate 2 ninjutsu's for a overall higher number of ninja on the box. Theres about 4 or 5 different Naruto's and Sauske's to choose from all being about the same just 1 or 2 different abilities and costume.   Also theres no 2v2 or survival mode. Huge dissapointment if you have friends over. Your only option is to fight against your friend you can never fight WITH them like in Clash of Ninja.   The main reasons this game is better then Clash is for its Story mode and how it runs perfect on my computer. The Wii can't run a Naruto game without slowing down from the graphics, maybe the Wii-U could do it.   I'm going to finish this game mainly for the story but i've yet to find a ninja I like to play more then one battle at a time =\\",
            "review_score": "1"
        },
        {
            "review_text": "brilliant fun amazing character choice great gameplay and a fantastic story",
            "review_score": "1"
        },
        {
            "review_text": "was ultd three times.",
            "review_score": "1"
        },
        {
            "review_text": "Fighting as Kurama vs all other Bijous - absolute win! Bought an XBox PC gamepad for this, installed it, after a prologue battle with Minato against Tobi i was shocked. Was it really possible to create such an amazing anime fighting game? As a Naruto manga/anime freak since day one I was trying to be objective, but I was blown away. Simple controls, cool combos, amazing animations, catchy soundtrack, excellent japanese voice and other audio - 100% immersive and true to the Naruto setting. You can play as 80+ characters! C'mon, that alone was reason enough for me to buy the game - finally trying out what it's like to play as Mifune, Danzo and all the other kages and jinchurikis:) blown away once again. You will have many many hours to play if you are like me and wanna try out every character, every combo, every mission, challenge and full story. I also forgot to mention that cutscenes are like watching an anime show:) My only downside was lack of little-ping online battles and slow loading when doing 100% challenge missions, but other than that I give it a total 10/10. Funny, amazing, a must have for a Naruto fan - for all you others interested in a good fighting game don't worry - the game will pluck you in the Naruto world like a you've been struck by Kage Bunshin Rasengan:) now gtg, Naruto season 1 rewatching:)",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥t .",
            "review_score": "1"
        },
        {
            "review_text": "You Naruto be kicking some ♥♥♥. Wish multiplayer was actullay mutliplayer",
            "review_score": "1"
        },
        {
            "review_text": "Naruto is the best!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 made kill my whole family",
            "review_score": "1"
        },
        {
            "review_text": "There is one part where you are playing as who the ♥♥♥♥ puppet ♥♥♥. Where bomb ♥♥♥♥♥ completly ♥♥♥♥s you. Like wtf.",
            "review_score": "1"
        },
        {
            "review_text": "its my favorite game",
            "review_score": "1"
        },
        {
            "review_text": "The game is really good but it does have its downsides  Pros: -The game has a really nice art style -The single player follows the storyline -There is a whole range of characters to play from -The combat is really fun  Cons: -The multiplayer was a huge let down, lan or offline games are fine and have no problems but as soon as you play online you start to get connection issues with everyone and during a game it comes up transmitting, there is also delay sometimes between what button you pressed and the character doing it -This one isnt a major issue but since the game isnt english when the characters speak in dubbed its over the wrong mouth actions and sometimes the dubbed finishes speaking but the character will continue to move there mouth for awhile after   I Would recommend this game to anyone who enjoyd the game series or the show",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "very fun game love it",
            "review_score": "1"
        },
        {
            "review_text": "Naruto is overrated!!! ~ Weeaboo",
            "review_score": "1"
        },
        {
            "review_text": "I gave this game a bad review when i first played it my first time and... it still deserves a bad review. It may be good for console but not at all for PC. The controls you have to set up all manually, they are based off of an Xbox controller so if you are not familiar with it you are screwed in the story mode. Dont even get me started on online battles. theres hardly no connection literally every 3 seconds or less it freezes the game and says something along the lines of 'connecting' or something. the community is nothing but people who run away if you get close and spam you with ranged attacks so you cant do anything. i just feel there was literally no concideration for PC gamers at all when they put this game on steam and just used it as a way to grab more cash. Dont even get me started on the story mode. i got this game expecting.. well.. to play a game! The story mode is pretty much an almost never ending cutscene. i found myself skipping every cut scene just to get to a battle and even then you might have to skip probably up to 6 just to fight one battle. I have played the old narutos on my gamecube back in the day and they did an amazing job with the story modes but they have really ruined it now.",
            "review_score": "-1"
        },
        {
            "review_text": "This is game is amazing i give it a solid 10 i can't wait for the 4th one to come out just wish they would bring the Clashes back like they did on Naruto Ultimate Ninja Storm for the PlayStation 3 (Fat Model)",
            "review_score": "1"
        },
        {
            "review_text": "keyboard is the best 1321/10",
            "review_score": "1"
        },
        {
            "review_text": "TIs Is A Naruto Game. Tis Gud, Very Gud.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. The problem before was that I had a crappy computer, but it runs fine on my new rig.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game for a local vs fight. Story is really awesome and graphics are beautifuly, controls are smooth. Should get a positive review but...   The save system is completely broken, after the 3rd time discovering my game was not saved i just gave up just one chapter before the end of the game. And it had gotten a bit repetitive by that time so it felt like a punishment replaying pretty much the whole chapter all over again.  also it lacks a quit item in menus. alt+f4 for the win. I managed to find it once... still no idea where it was...   ",
            "review_score": "-1"
        },
        {
            "review_text": "Its a great game, although the 'Transmitting...' sign could do a lot of work.... although i dont blame it, its a pretty big game.... it cant properly live up to the standards of hi-speed connection abroad....",
            "review_score": "1"
        },
        {
            "review_text": "Good game! Worth to buy",
            "review_score": "1"
        },
        {
            "review_text": "Good pve, bad pvp. Acceptable game.But anyway to expensive buy only with some offer.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge naruto fan and all i can say is:  - Good graphic like its anime - Great fighting gameplay, i mean not like that 2D or 2.5D fighting games - Ofc, story is related to the anime  but one huge problem is:   THIS GAME IS LOCKED AT F*CKIN 30 FPS, SO F*CKIN ANNYOING,   and i hope that Revolution and Storm 4 isn't locked at 30 FPS...",
            "review_score": "1"
        },
        {
            "review_text": "This game is hands down the greatest fighting game I have ever played, With a huge roster of characters and the most indepth and lengthy story mode that I have ever seen featured in a fighting game. It includes tons of content and much fanservice for the naruto fan. Sadly the multiplayer is dead but you can get endless hours out of the singleplayer alone thanks to its lengthy and rewarding storyline.  10/10 A must have for any fighting fan.",
            "review_score": "1"
        },
        {
            "review_text": "Reflex training simulator .",
            "review_score": "1"
        },
        {
            "review_text": "This one has a better story mode. But ultimate ninja storm revolution has better gameplay and more characters. You should get ultimate ninja storm 4 if you can afford it and if your pc can run it.",
            "review_score": "1"
        },
        {
            "review_text": "Would spam rasengan to fly enemies again 10/10 .",
            "review_score": "1"
        },
        {
            "review_text": "Love the new button prompts in the story line, definitely a good add to the game, keeps you thinking on your feet!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "As someone who isn't much of a Naruto fan. I can say that I enjoyed this game a great deal. Let's get into the pros and cons.  Pros Great graphics Easy to learn combat system Lengthy campaign Large roster to fight with The set pieces are well done.  Cons The side quests get too repetitive  Whilst the combat system is easy to learn. It feels like you could never lose. Ultimate survivor mode was a joke.  The English dub is garbage.   This game gets a 7 out of 10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of playable characters and epic boss battles that open up a lot of possibilities for strategy despite it being a fighting game. This game did what the anime couldn't: Avoid fillers and add in the possibility to skip.",
            "review_score": "1"
        },
        {
            "review_text": "it is not amizing that much but i like it",
            "review_score": "1"
        }
    ]
}