{
    "app_id": 234900,
    "name": "Anodyne",
    "release_date": "2013-03-22",
    "developer": [
        "Sean Han Tani",
        "Marina Kittaka"
    ],
    "publisher": [
        "Analgesic Productions"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Exploration"
    ],
    "achievements": 6,
    "positive_ratings": 856,
    "negative_ratings": 154,
    "price": 6.99,
    "description": "In this unique Zelda-lite game, explore and fight your way through surreal and creepy, nature, urban and abstract themed areas in the human Young's subconscious, evoked by a 16-bit-era visual style and a moody, dream-like soundtrack.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/234900/header.jpg?t=1554150763",
    "minimum_requirements": "OS:Windows XP Processor:1.5 GHz, single core Memory:1 GB RAM Graphics:Any Hard Drive:100 MB HD space Sound:Any Additional:This is not a GPU-intensive game.",
    "recommended_requirements": "OS:Windows XP or better Processor:(2.0 GHz, single core) or better Memory:2 GB RAM Graphics:Any Hard Drive:100 MB HD space Sound:Any Additional:This is not a GPU-intensive game.",
    "reviews": [
        {
            "review_text": "It's basically existentialist Zelda on acid with less combat.  This is a weird game. It's got the appearance of a classic zelda game, but there are more areas where you just wander around and talk to random people. You also don't so much unlock sexy new combat abilities and weapons, but just unlock new areas with new traps and puzzles to deal with. There are still boss fights, some of which will give you a challenge, but don't expect the non-stop action of a zelda game. This is much more of an exploration of the mildly dark and mildly bizarre. Not for everyone, but I think many people will find it worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to like this game, I really did. While I appreciate what the developers were striving for, I just can't recommend this game to others. On the surface this appears to be a Zelda clone. While that sounds promising, on delving deeper into this title nothing could be further from the truth. While Zelda relies on great combat and clever puzzles, Anodyne relies on unfair combat and ridiculously hard platforming. Enemies don’t stop in their tracks or bounce back when you hit them, so enemies that require numerous hits invariably result in damage to you as they just plow forward through your attacks. In addition, the number of times you die from attempting next to impossible jumps becomes too much to bear. Add in that native controller support simply does not work (in the forums the developers even go so far as to suggest getting a third party program such as xpadder or joy2key to make it work) even though partial controller support is listed on the store page, and I feel you have a product that could have used a lot more polishing before releasing on Steam. For every moment of fun I experienced with this game, I experienced several more of frustration. On a side note, towards the end of the game suddenly the F word appeared several times in dialog, whereas the rest of the game had been devoid of swearing. While I have no problem with swearing in video games, I was playing through this game with my young niece and this sudden unexpected change in tone was not appreciated nor did it seem to fit the game. Overall I would rank this game a 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "The experience was not worthwhile. This game really needed a plot, or some character development, or something for its lack of cohesion. The gameplay and engine are solid, but the rest isn't there.",
            "review_score": "-1"
        },
        {
            "review_text": "Dreams are pretty common tropes in all sorts of media, which is unfortunate because they're rarely used well. Too many games and movies and books use dreams as a cheap shock or an easy way to spill characterization, ignoring the unique sensations and aesthetic of the subconscious. The developers behind Anodyne didn't take the easy way out here, because they've crafted an expansive dreamscape to explore that actually feels like the product of an unquiet mind. And not only that, they built a fun and engaging game on top of that hook.  Anodyne is the story of Young, a... youthful, platinum-haired fellow plumbing the depths of his own subconscious. I won't go into anymore detail than that, but the diverse cast of characters you'll come across in your surreal trip will happily fill in the gaps for you, even if it doesn't seem like it at the time. You'll control Young in a manner very similar to classic Legend of Zelda, from a top-down and pixellated perspective. While most of the game is exploring the strange and meaningful world, there is some combat to be had with your trusty broom and some puzzling, including some occasionally challenging platforming.  The world of Young's mind is the big draw here, because it does a magnificent job of approximating a series of dreamscapes. I mean, it's going to be different for everyone of course but Anodyne nails the universal logic of dreams, the seemingly inexplicable connections and non-sequiturs that do indeed represent events in the waking world. You'll start in pleasant, wind-swept meadows and mossy ruins but soon find yourself in impossibly-sprawling apartment complexes, twisting dungeons, ghostly towns, and stranger places still. They exist as real places would in a dream but connect and change in unexpected ways, lending them that key sensation of mystery and unfamiliarity.  It's not a horror game but the way that every location and creature is a little bit off gives a feeling of foreboding to the adventure. And there are definitely some horrifying things that happen, so that feeling is not at all unjustified. The low-key soundtrack helps a lot here too, setting the tone just right for your imagination to run wild. As you progress the environments get stranger and the creatures spout more nonsense, but it really does come together in the end to give you an idea of what it's all speaking to.  I've gone on a bit much about the atmosphere, but the gameplay is plenty solid enough to keep it entertaining. Young is spry and controls well, allowing you to weave around tricky foes and pummel them with your broom. You'll find upgrades to your weapon and mobility as well, along with collectible cards that provide additional insight on the world's denizens. Save points are plentiful and there's an expansive fast-travel system for the expansive world, so don't worry about missing key items or dying at inopportune times.  There's hardly anything to criticize here if you're down for a journey into the surreal. The story is good, the gameplay is tight, and the environments are crafted with expert care. It'll last you a few hours even if you don't go hunting for every little secret, too. I love great atmosphere and I love great gameplay, so I can barely contain my excitement for any title that combines the two. Anodyne is an excellent adventure game from top to bottom, and one of the few to really do dreamscapes justice.",
            "review_score": "1"
        },
        {
            "review_text": "It's definitely a nice, well-detailed game exploring the subconscious thoughts of Young, the main character. If it were just that, I would definitely recommend this without a second thought.  However, when the game gives up on providing even the basest amount of a narrative, tells you to 'just fetch these 36 cards, then we'll let you finish the game', and starts throwing out some of the most irritating jumping puzzles I've seen in a while, I kind of start thinking about how much better this would be as a novel. Mainly because it's undesirable and almost impossible to implement a jumping puzzle in a novel.  It's a very narrow 'not recommended', because there were more jumping puzzles that were irritating than there was crazy ♥♥♥♥ to justify continuing to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Hmm. On one hand, I did enjoy the game. The Zelda-like description for gameplay is pretty accurate; top-down exploration, venturing through dungeons, powering up (although this game is a bit simpler than Zelda in terms of attacks and abilities). The plot was interesting; a bit obtuse at times, but overall an interesting take on what I assume to be self-reflection and issues with depression and anxiety. I enjoyed it... but I'm not sure there's $10 worth of play time here unless you're a 100% completionist or if what you've read about the plot speaks to you on a personal level. If it goes on sale at all though, I'd say give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me feel overcome with nostalgia, and I didn't even play NES as a kid. Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "Anodyne is not the greatest game and actually it is kind of average on the surface, but two things kept me playing throughout the entire game: the music and the art. The music was great; a lot of it is very creepy and all of it fits the perfectly with each environment. The artwork, on the other hand, is your typical 8-bit style, but something about it really grooves with me.  Where it gets bad is the controls. There are several points in the game where you must platform your way through some room but the controls just are not solid enough, it can become very frustrating. The gameplay is also your Zelda style adventure game; platforming, puzzles and some simple combat and boss fights. This is not really a complaint, since I love the Zelda style games.  Overall the controls are frustrating at worst, but the music, art, and style kept me engaged. It is not for everyone, but for a cheap price I would recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really sure I can explain the story of this one.. I'd go so far as to say that the game is like a cross between Link's Awakening and Yume Nikki.  The gameplay is very much reminiscient of the Gameboy era Zelda games (Link's Awakening, Oracle of Seasons / Ages), so much so that I'd say if you enjoyed those games then you might enjoy this one. The game ran just fine and had good remappable control options. The aesthetics and environments are quite nice, as is the wafting calm and melancholy music. The story is very bizzare and not at all straightforwardly sensical, but it didn't feel forced. I really liked it, to be honest.   I really enjoyed this game, a lot. I'd reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Anodyne capitalizes on an oft-neglected area of nostalgia: handheld Zelda games. When I was growing up, one of my favorite games was Link's Awakening. I liked it more than the other Zeldas because of the unique dreamlike atmosphere it had. Anodyne copies the gameplay, and doubles down on the atmosphere to an astonishing degree. It's a truly unique specimen.  The gameplay is about what you'd expect. Walk around, solve puzzles, hit things with a melee weapon (In this case a broom, not a sword). It will feel particularly Zelda-y at first, but it begins to gain its own identity as time goes on. At first I considered the game's lack of items to be its biggest flaw, but on further consideration I think this is part of what gives it its identity. The limited number of options give the combat and puzzles a certain 'purity' to them. There are no ways to 'cheat,' no easy way to win, just you and the challenge presented by the game. It's extra impressive since the difficulty curve is very smooth, and provides some genuine challenge by the end. Kudos to the level designers.  The game takes several notes from Links Awakening, but it is not the only card that Anodyne has to play. As you progress further into the game, more and more levels appear that are influenced by other games. There are levels that remind me of Earthbound, Last Survivor, LIMBO, and a lot of Yume Nikki. In fact, Anodyne's hopping between mysterious dream worlds with different art styles is eerily similar to Yume Nikki. A couple of level themes are even shared between the two. I found Yume Nikki's lack of gameplay very disappointing the first time I played it (I have since gained a greater appreciation), and Anodyne fixes essentially all the issues that I had with it. Calling it 'Yume Nikki with story and gameplay' isn't quite correct, but it should give you a good idea of if this game would appeal to you. If you like Zelda, Yume Nikki, surreality, exploration, atmosphere, or just a well constructed game, I'd highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Clever puzzles, Incredible art &amp; atmosphere with fantastic music, and loads of secrets to discover post-game.",
            "review_score": "1"
        },
        {
            "review_text": "Play the game a lot and really like it. It fondly reminds me of the old school Dragon Warrior / Final Fantasy games. Well done guys!",
            "review_score": "1"
        },
        {
            "review_text": "I've played about 3 hours of this game so far. The gameplay and graphics remind me a lot of Link's Awakening. The story is great, the soundtrack is great, and the gameplay is great. If you enjoyed Link's Awakening you will probably enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've played about 3 hours of this game so far. The gameplay and graphics remind me a lot of Link's Awakening. The story is great, the soundtrack is great, and the gameplay is great. If you enjoyed Link's Awakening you will probably enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "(Spoiler) You are a boy- Young. Your weapon-a broom. You have been chosen to travel with a portal-system (Nexus) between different worlds to colect cards and finally defeated someone named Briar. PS: You a children killer...",
            "review_score": "1"
        },
        {
            "review_text": "If you like odd, creepy games, then I recommend this one! It's pretty simple but addictive. I would compare game play to something like Link's Awakening for the GB, with an odd twist. 8.5/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "The ending is disappointing, but the journey there is very fun. I wish I could discern it's theme (if it even has one). This is like classic legend of Zelda, but in a very esoteric, dream like work. It's fun if you like Legend of Zelda or Metroidvania games.",
            "review_score": "1"
        },
        {
            "review_text": "Find cards and battle bosses--that about sums up this adventure. There's a good number of different environments to explore, puzzles to solve, and monsters to fight. The gameplay is on par with other games in this genre. The story doesn't make a whole lot of sense and is probably the weakest part of the game. This is a great game had it been released 30 years ago. Today, it's just one of many attempts to copy The Legend of Zelda and just falls short of being anything but a clone.",
            "review_score": "1"
        },
        {
            "review_text": "A bit quirky but oddly familiar is one way I would describe Anodyne. It felt sort of like an inside joke that that, while not entirely in on, I could still relate too and appreciate on some level. The same goes for the plot specifically, there is little to no back story or context given but I suspect this was a conscious decision as it leads each player to get a different meaning from various parts based on the context of their own life. Unfortunately it is a little subtle and you're never hit with that moment of introspective clarity that other games manage to deliver.  Mechanics wise the puzzles are nicely balanced between single room puzzles and exploration/ labyrinth puzzles. A few of the platforming puzzles were a little rough, mainly because of bad spawn points, but overall it's straight forward and satisfying. The worlds and dungeons are nicely varied, very nicely actually, and interesting, as are the enemies.  In the end this is probably not for everyone but if you're looking for a throwback to the heyday of adventure gaming or are looking for something a little different with a lot of heart just to burn a few hours then this is as good a choice as any.",
            "review_score": "1"
        },
        {
            "review_text": "It's not a bad game, but not really a good one either. Relatively competent Zelda type gameplay, good yet creepy music, and the dialogue is interesting enough (though on the whole not as good as the city lights screenshots that get posted here periodically). Short enough that it doesn't overstay its welcome. Wait for a sale price.",
            "review_score": "1"
        },
        {
            "review_text": " Title : Anodyne  Genre : Action, Adventure, Indie  Developer : Sean Hogan and Jonathan Kittaka  Publisher : Analgesic Productions  Release Date : 22nd March, 2013   TL;DR, Verdict",
            "review_score": "1"
        },
        {
            "review_text": "On the surface, Anodyne looks like your traditional, top-down SNES-inspired action RPG. And while I'm thankful for this aesthetic, I'm even more thankful for what turns out to be a cerebral experience that evokes an array of emotions while playing. Many indie games do a decent job of this, but often at the expense of game-play. Not Anodyne. It looks beautiful, it sounds beautiful and it's FUN.",
            "review_score": "1"
        },
        {
            "review_text": "Pixel art RPG-ish game. Can't either recommend nor not recommend this game. It's not good but also not bad. So basically, the name 'Anodyne' (which means:  an·o·dyne ˈanəˌdīn/ adjective   1. not likely to provoke dissent or offense; inoffensive, often deliberately so.)  is fitting to the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the mature Zelda game that we've always wished for but never received. Not faux-mature in the bloodspattered, profanity-laden Gears of War style, but one that trusts in the player's intelligence. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Zelda-esque styled gameplay with a modern feel. The story goes far beyond any fantasy setting. Well worth the time, and a good solid 4-5 hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "It's sort of like a Zelda game, but extremely annoying and full of ♥♥♥♥♥♥♥t. Imagine controlling a wet dish rag through a maze while having bricks thrown at your head.",
            "review_score": "1"
        },
        {
            "review_text": "Explore Young's dreams A great and strange adventure Zany world and poor jumps",
            "review_score": "1"
        },
        {
            "review_text": "Others like this game, probably because it's similar to old school Zelda. I thought it moved pretty slow and, the broom/dust mechanic to solve puzzles was more odd than fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A bunch of Zelda puzzles without the item diversity of a Zelda game. But hey, this game beat Steam when it comes to collecting cards, so if you like cards and Zelda puzzles you will like this game. Also the story makes no ♥♥♥♥ing sense.",
            "review_score": "1"
        },
        {
            "review_text": "A very different Action RPG in the vain of a 2D Zelda. Short but fun and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game in the style of the gameboy zelda series. Lots of puzzles and very hard jumping/timing mechanics, but a good and twisted story to keep you intriqued. Incredible game for a two-man indie crew.",
            "review_score": "1"
        },
        {
            "review_text": "Meh.  I've played Anodyne on a couple of different platforms, but have never really been able to get into it. It's not particularly difficult, it's just not a game that's won me over. It sits there in my library just not getting played because it's of no real interest. It's the type of game that you have to really be interested in beforehand to get going with it.  If you're looking for intuituve or intellegent gameplay look elsewhere. This isn't it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fun Zelda-esque game with some clever puzzles and some excellent atmosphere. Even though I think the story might try too hard to be deep and the jumping physics are a bit wonky, I totally recommend picking up Anodyne if you ever see it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "On the whole, if you want a fun and unique Zelda-like action-adventure game with puzzles you couldn't go wrong with Anodyne. The music is good, the look is interesting, the gameplay is generally solid. It's not without flaws. When it comes to jumping, you will probably be swearing a lot because the game feels 'slippery' when it comes to edges. There's also a fair bit of tedious exploring at the end of the game to get the necessary items to progress to the final area. But overall, it's a pretty solid and fun game that will take you between 3-6 hours to beat on your first try.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute garbage. Interface sucks and it's a cheap Zelda knock off. I still don't know how to exit the game properly. I'm glad I got this as part of a bundle with good games in it.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't think this game is that great. As a person who's a HUGE Legend of Zelda fan, I think this game is trying to hard to be a paradoy that mixes in some (realatively stale) Comedy. I tried to like it, but I really just can't get into it. To me it's just another indie game that's abusing pixel art to Jab at someones nostalgia sector, and I know that's very harsh. However, the best way to decide weather or not this is a good game, is by playing it yourself. I recommend trying it but I can't however, recommend it as a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game, but not great either.",
            "review_score": "1"
        },
        {
            "review_text": "8-bit 2D RPG game... it's OK!",
            "review_score": "1"
        },
        {
            "review_text": "sometimes if you're good at drawing and making music, you don't have to make a video game about it.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad Game. Not worth any money.",
            "review_score": "-1"
        },
        {
            "review_text": "The humor and style of Earthbound with the gameplay of Zelda. Its only a few hours long, but Anodyne is fun, quirky and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "A very solid 16-bit, Zelda-ish Indie game. It's got a beautiful art style and soundtrack which gives a very nice ambience. The combat is okay; smacking around enemies with your only weapon, a broom. The story isn't that great as it gets confusing and it's not very straight forward on what to do, so you get lost at points. It's a very nostalgic type game and has a few Easter Egg secrets found in it such as The Binding of Isaac, Pokemon, and Legend of Zelda. It's surprising that this game was made by only two college students. I'd definitely recommend it to anyone who is looking to take a trip back to the good ol' Gameboy era days. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "I loved at that time Zelda Link's Awakening and this game did his job keeping honor to the series and adding something new with his distinctive and ironic character.",
            "review_score": "1"
        },
        {
            "review_text": "This is so good.  The environments and the journey are unsettling, introspective, pretentious, and self-aware of how pretentious they are in a great way. The actual gameplay is a competent old-school Zelda clone; it doesn't ever detract from the exploration and ideas, and sometimes it has its own moments of greatness.  It reminds me a lot of Zelda Classic quests or ROM hacks in its taste in difficulty level, so it may be on the hard side for some players.",
            "review_score": "1"
        },
        {
            "review_text": "Just the soundtrack for this game is well worth the money, besides that there is pretty sweet zelda-esq feel to the whole puzzle and dungoneering part. Although the story gets kind of fuzzy I can say that I didn't regret playing the game for even a second. The game gives you some general direction in the begining and then you are pretty much free to explore the mysterious world how you like.  It took me about 9 hours to beat the game, once i started playing I was stuck and I ended up doing it in one session :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is very much like the original Legend of Zelda.   However, TLoZ did not include weird inexplicable mass-murder or a talking bear named James who tells you how many times he has had sexual intercourse this season. Anodyne apparently decided to fix these oversights, so you will encounter both of those things! ",
            "review_score": "1"
        },
        {
            "review_text": "This game was really fun until I received the ability to jump, which caused me to rage until I almost threw my laptop across the room.",
            "review_score": "1"
        },
        {
            "review_text": "I loved at that time Zelda Link's Awakening and this game did his job keeping honor to the series and adding something new with his distinctive and ironic character.",
            "review_score": "1"
        },
        {
            "review_text": "Despite loving the Zelda/exploration/adventure genre, and despite enjoying several parts of this game, I cannot in good faith recommend it. There is a lack of polish--simply too many flaws for me to consider this game 'complete' and worth the price:  --The jump mechanics are among the worst I have ever encountered. This might not seem like a major issue, but jumping becomes an essential aspect of the gameplay, and it is incredibly frustrating to repeatedly die at certain points due to vague collision detection and poor controls. It didn't feel difficult because it required skill, but instead because it felt clunky and unpolished. I never found myself thinking, 'I did it! Cool! That was hard but rewarding!' but rather, 'Thank god that's over--hopefully I don't encounter that sort of thing ever again!'  --There were bugs noticeable enough to hamper gameplay. On several occasions, I fell into a pit, respawned, and then randomly found my character teleported back into the pit (thus taking double damage for a fall). In one instance, I somehow respawned from one room into another and found myself irreversibly stuck in a pit until I died. There were also a few times where the game went unresponsive, but I suspect that this is a mac compatibility issue. (These weren't the only bugs--there were troubles with water, for instance, and collision detection in general--but the ones mentioned were the most salient and annoying.)  --The story seems like fragments from a crappy pseudo-philosophical dream. There is no real development,* the dialogue does not make a great deal of sense (though 'dream'-like and ambiguous enough to lend it an illusion of depth and wisdom); in short, the game didn't really take off or make me 'feel' anything. It was entertaining at times: there were glimpses of interesting story ideas and a coherent 'style'; there were characters I tried/began to like; there were some exciting discoveries; there were interesting/unique areas that I wanted to somehow develop a nostalgic fondness for...but it all just fell sort of flat. In the end credits, the enemies are named in a 'cast', but they are given extremely boring or otherwise obvious names ('The Wall'; 'Frog'; etc.); I think this epitomized my experience: there were things, and things sort of happened, but ultimately it felt unmemorable and like something(s) was missing. I won't look back on this game with any feeling of warmth but instead with an attitude of 'Yes, I played that. It had some good ideas, but meh. It was okay.'  If you like exploration enough to disregard some bugs, frustrating mechanics, and lack of compelling narrative, go for it! Otherwise, I'd recommend maybe picking this up on sale and seeing what you think.   *Even if lack of development is part of the 'point'--e.g. existential uncertainty, absurdism, etc.--it doesn't 'feel' right in this sort of game. Character development, surprising turns of narrative and anagnorises ('HE was the bad guy all along??' or 'So THAT'S what that thing was!'), moments where the story 'coils back' upon itself and redefines what has come before...this is all missing. There might be a place for bold Zelda-esque dream-like existentialism (where, perhaps, the clues unravel nothing and the journey leads to nowhere in particular), but it was not well executed here: the game is too 'conventional' (it has a general sense of progress/story) and non-experimental enough for me to justify the lack of some sort of satisfying, interconnected, overarching narrative.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great, a beautiful example of how you can put a robust, fulfilling experience in a relatively short game.",
            "review_score": "1"
        },
        {
            "review_text": "Noun: A pain-killing drug or medicine.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Anodyne brings Zelda to mind, in a good way. Although the game is quite short and not particularly hard, the puzzles, dungeons and enemies are very pleasant. If you like Zelda-like bosses with clear patterns (only easier), go for it. The storyline is not very clear, but it's not really a drawback: the universe just seems like a big weird dream/nightmare. And the music is nice, especially in the Cliffs section.  Major con, though : diagonal jumps. F*** diagonal jumps.  TL;DR : Fun Zelda-like in a weird universe, about 5h long in one playthough + extra hours for 100% the game.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the coolest top down rpgs I've played in a while. It captures that feel of exploration and adventure from legend of zelda. While adding suspense and an interesting yet vague story.   Definitely worth buying",
            "review_score": "1"
        },
        {
            "review_text": "This game has fun game-play, reminiscent of the LOZ era, and great music that gives it a haunting atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Weird action kind of rpg. Some say zelda-ish. Short but I liked it, in fact it being short probably was a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "I'm very easily entranced by anything that takes me back to the days of Super Nintendo. So, it would make sense that Anodyne would catch my eye and take my money. This game is very entrancing. Very trippy storyline, haunting atmosphere, Legend of Zelda-esque game play, and a BEAUTIFUL soundtrack make this game worthwhile. If you're into the old action adventure 16-bit games, definitely add this to your Steam library. It's such a great game, and it's strangness pulls you right in. Did I mention this has a great soundtrack?",
            "review_score": "1"
        },
        {
            "review_text": "Zelda meets Yume Nikki. If you like that kind of game, buy it when its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Very quirky, Anodyne is. However, it is fun figuring out not only the puzzles but the strange world you explore. Only in Anodyne can you push a fisher into the ocean and open a portal to underwater hell. (?)",
            "review_score": "1"
        },
        {
            "review_text": "A strange experience, but worth playing for the zelda-esque gameplay. Not sure I fully understand the story/characters, but I actually think that's the point; Lot's here open for interpretation and discussion.",
            "review_score": "1"
        },
        {
            "review_text": "An adventure game like the good old SNES/GBC era Zelda's and Final Fantasy games, except the 'role-playing' elements are very light with this one as there is not really any EXP points or skill levels. Just a 'weapon' and some upgrades for it. The game is mostly exploration and puzzle-solving. The puzzles aren't from the hardcore end either and are quite manageable. Well, the game works for me, and I guess others of my generation would like it as well.",
            "review_score": "1"
        },
        {
            "review_text": "this was a fun game! I somehow missed that you're playing in the main character's dream world, and also forgot that the main character's name was Young, which probably would have made it make a lot more sense &gt;_&gt; (I blame the minor cold I've had recently.) but even being totally oblivious to two of the most important facts in the game, it was a trippy-weird, zelda-y fun-time.  P.S. I've read it compared to Yume Nikki. this makes much more sense after realizing that the game takes place within your dreams. I would have otherwise never compared the two, because unlike Yume Nikki, Anodyne has a much more structured, approachable game-play.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game. Very nostlagic to retro games, which I enjoyed. Very interesting story, I just wish there had been a bit more presented to me, and that the game hadn't been so short (you can beat it under three hours pretty easily). The secrets are alittle hard to find, but thats part of the fun. If you're looking for a long RPG this is not the game for you. If you want a quick romp through an interesting world give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "I don't really have much to say about it, so i won't say anything. It's kinda average.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like playing through someone's fever dream.",
            "review_score": "1"
        },
        {
            "review_text": "Anodyne is a traditional, top-down, Zelda-esque adventure game. The action is well balanced with the puzzles. The puzzles won't leave you scratching your head for long, but they are satisfying when completed. The soundtrack is a pleasure for your ears, and I recommend playing with quality headphones. The story is very abstract and leaves a lot open for interpretation, and I can forsee it being lost on most people. Overall, Anodyne is worth your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "It's gameboy style Legend of Zelda gameplay, but ♥♥♥♥ gets weirder and weirder as it goes on. It's pretty cool, but once it starts asking you to walk off the map to find secrets and ♥♥♥♥ it just gets to damn annoying to explore. Still the core game is a fun revisit to the old Zelda games that it starts off copying.",
            "review_score": "1"
        },
        {
            "review_text": "Great classic Zelda-esque gameplay, interesting mix of comedic writing and really cerebral subtext.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Starts out as a Link to the Past similar game, then after the main story line it gives you a new tool that lets you explore the levels in a totally different way and find new secrets.",
            "review_score": "1"
        },
        {
            "review_text": "Looks, plays and feels like a long lost Zelda game except that this game doesn't have the same target audience (the game is more mature). Plenty of dungeons and bosses and enemies, this is a must.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a lot of fun(it was part of a Humble Bundle). It has a lot of inspirations from the classic Zelda games. Only thing difficult was the jumping action sometimes didnt work as expected. I used a xbox360 controller and would have probably been better if I could have configured the d pad instead of the analog stick. Also for the first part of the game there is not much guidance so you are on your own to explore or use the guides created by people here.  TL;DR This is a great Zelda-ish game to explore.",
            "review_score": "1"
        },
        {
            "review_text": "So after Steam decided to not ♥♥♥♥ing work for a few weeks, I ended up just getting it on ♥♥♥♥♥♥♥♥♥♥ where the creator was kind enough to put it up. It's really good. I will probably replay it even, and I hardly do such things. The soundtrack is great and the whole thing just feels really dreamy and sort of melancholy/creepy.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't for everyone, but hardcores and nostalgics will both be mystified by Anodyne. This game is not at all what it looks like and it really is greater than the sum of its parts. At times playing this game struck such a chord in me that I couldn't really sleep at night. It gets you thinking, and it's not a comfortable experience. In order to get the full experience of this game, you'll need to play it obsessively. Then again, if you're not a completionist, this game's message wasn't really written for you.  TL;DR: This is a must play for hardcores, but don't expect it to be fun all the time and don't expect it to make you feel good. Ever.",
            "review_score": "1"
        },
        {
            "review_text": "*NO SPOILERS AHEAD*  If there is one thing you can expect of Anodyne, it's a superb sense of atmosphere. Every zone you explore oozes feeling, whether that feeling may be lonliness, wide-eyed exploration, or even general strangeness. This is thanks to quality atmospheric music and some above-average artwork. Each zone has their own feeling, and that helped greatly with the enjoyment of exploring them and finding new zones.  Gameplay wise, the game is alright. You have a broom weapon you hit dudes with, and you can pick up dust from the ground. You can use said dust to do things like wade across water (you cannot swim) and activate switches. Although simple, it makes the broom feel like an actual broom instead of a sword-that-isn't-a-sword. Combat wise, if you've ever played a top-down Zelda game (Link to the Past, Zelda 1), you will probably feel right at home with the combat. It lacks depth beyond dodging projectiles and hitting things, but it's definitely not unenjoyable.  On a combat note, the enemies of the game felt quite varied, and the bosses moreso. Each enemy has unique behavior and tactics on how to damage you, and always feel suited to the zone you find them in. The bosses of each zone test one's skills in a way that really impressed me, and they did kill me a few times in my playthrough.  I do have a few gripes with the game that hampered my enjoyment, which I will list in order of lowest-to-highest severity:  1) Although the music definitely builds atmosphere, this strangly also applied to boss battle music. I didn't expect the game to jump straight for atmospheric to Japanese shred metal when a boss fight occured, but the low-key tunes of the boss battles clashed with the threatening feeling of the bosses. The bosses definitely were challenging, and unfortunately the music does not reflect that.  2) I got lost many times, and felt that some 'ease-of-life' features would be nice. I am not someone who needs handholding in a game, and I can respect a game that requires some do-it-yourself thinking to progress. However, I could have saved a lot of time hunting down collectables and figuring out where to go if, for example, the map included icons for locked doors I've run into, or chests I hadn't opened yet. Furthermore, many times I found tiles where one part of the screen I could pass through, but another I did not. It was very difficult to realize (without going back to said tile) that I hadn't fully explored that part of the zone yet.  3) The story, even after seeing all the plot pieces and zones, felt utterly incomprehensible. I understand that the game is supposed to (or at least implied to) take place in a dream-like world. While the dream theme really helped make the game feel varied and enjoyable to explore, the interactions with NPCs and how the plot turns out didn't feel cohesive to me. Again, I get that dreams don't usually feel cohesive, and that the game is not supposed to feed you the story on a silver spoon, but many games with a non-direct story typically leave many bits and pieces that fit together after inspection. After thinking about the story for a while, I still can't understand what it's about or what the journey was meant to symbolize. If someone can clue me in, I would greatly appreciate it.  Don't let my negativity get to you though. Overall, Anodyne is a fine game and probably one of the better indie games I've played. I would definitely give it a look.",
            "review_score": "1"
        },
        {
            "review_text": "A really good and fun game, I super recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A flawless game, combining the original legend of zelda with platforming and a ton of other stuff. This is honestly one of the funnest, most addictive, games I've ever played. Also has one of the best soundtracks I've ever heard in any game, indie or no. Looking foreward from what else comes from these guys.",
            "review_score": "1"
        },
        {
            "review_text": "I leave precious few games with something to think about, but this is one that I will be mulling over for some time. A triumph of ideas, abstraction, incomplete narrative disclosure, and lovingly nostalgic level design... but the discomfiting soundtrack is what truly elevates the experience of playing the game.   Perhaps not for everyone, but if you have ever loved GBC/GBA era Zelda games--and Earthbound/Mother style JRPGs--that should be enough to get your foot in the door on this one. Support developers who are this committed to making old ideas mean something new.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. As a long-time die-hard Zelda fan, I found this game to be both nostalgic and a refreshing breath of maturity. The themes are thought-provoking, the soundtrack is catchy AF, and the puzzles are at times very challenging to pull off, even after you've figured them out. The only complaint I could possibly have is that the combat tends to be a little annoying, as some of the enemy attacks are very hard to avoid. However, there's plenty of variety and the game gives you plenty of life to work with, so it's definitely fine. All in all, 10/10 would play again. Buy now.",
            "review_score": "1"
        },
        {
            "review_text": "Anodyne is a proud, blatant Zelda-like, but it doesn't feel like a ripoff. Its world is uniquely both off-the-wall and melancholic. The atmosphere is what stands out most to me--the overworld is serene and mesmerizing to explore, the dungeons vary in tone, and the game in general has sort of paradigm shifts that caught me off-guard in a way I very much appreciated. The gameplay is very reminiscent of Link's Awakening, while subverting many of its key elements, and virtually eliminating item management by having the puzzles revolve less around items and more around how Young's broom interacts with the environment. As a result, the puzzles tend to be simpler and easier than those in Zelda dungeons, but they are also quite imaginative and manage to stay fresh.  If I had anything negative to say about this game, it's that the hitboxes are a bit too big, which gets frustrating on any screen with holes or big rolling spike columns. I also think that while it isn't necessary, it would have been nice if there were indicators on the map of where things like unopened treasure chests and boss rooms are, and more guidance for where to find the post-game items.  For anyone looking for the gameplay of Zelda, combined with Metroid's attention to atmosphere, in a package that's more than the sum of its parts, Anodyne is a fine experience.",
            "review_score": "1"
        },
        {
            "review_text": "A surreal experience, Anodyne provides fun, Zelda-style gameplay and interesting environments, puzzles, and story to go with it. The sound track is great, and the art style is simple, but satisfying. Definitely worth the price of entry.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the big reasons I love indie games. A heavily Zelda inspired journey through a surreal landscape with a gorgeous soundtrack. It takes a little while to truly feel engrossed in the games world, but once you do, it becomes a world that you're reluctant to leave. It won't be for everyone; it's not as difficult or challenging as a classic Zelda, yet it still feels rewarding when you make it through an area and finally kill the boss, and more of the enjoyment comes from the atmosphere anyways. The narrative was sparse, and I wished there was just a little more, as I enjoyed trying to puzzle out exactly what was happening, but I was left confused and wanting answers. Being able to glitch out the game as a feature at the end and continue exploring the world was a nice bonus thrown in by the makers, and neatly wrapped up a great experience.  8/10",
            "review_score": "1"
        }
    ]
}