{
    "app_id": 234940,
    "name": "The 39 Steps",
    "release_date": "2013-04-25",
    "developer": [
        "The Story Mechanics"
    ],
    "publisher": [
        "The Secret Experiment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 20,
    "positive_ratings": 982,
    "negative_ratings": 317,
    "price": 3.99,
    "description": "Prepare to experience the original man-on-the-run thriller in a completely new way! There are secrets to be discovered, locations to be explored and - above all - an incredible tale to be told in this ground-breaking interactive novel.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/234940/header.jpg?t=1556008903",
    "minimum_requirements": "OS:Windows XP Processor:2GHz Processor Memory:2 GB RAM Graphics:DirectX 9 512MB card Hard Drive:2 GB HD space Other Requirements:Broadband Internet connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Original example of how a novel can be transformed into a game    The 39 Steps  is a unique interactive visual novel, developed by  The Story Mechanics  and first released on Steam in april 2013. The game is based on the novel with the same title by John Buchan, which got quite well-known thanks to its being the inspiration for Ian Flemmings  James Bond  books. The novel tels the story of Richard Hannay, a bored-to-death gentleman who all of a sudden finds himself in the eye of an espionage storm. Buchans story has its flaws: some plot-turns come across as unbelievable, but the characters are drawn very fine indeed, as is the time period against which the plot evolves.  Buchans novel is followed very closely in the game, which does an excellent job in transferring the overall feel and atmosphere of the period and place during which the action takes place: London, Scotland and the English countryside early summer 1914, just before the outbreak of the First World War. The developers achieved this by using a brilliantly designed and executed visual style, with a lot of hand-drawn images.  Actually, the story is told in several different ways, all with their own level of interaction. The narrative part of the novel is being projected on the screen, with the player having to click through the different lines. But the game manages to introduce variety even in this simple mechanic: the tempo of the clicking varies: sometimes a screen is held onto longer, while at other times clicks has to done much faster. Dialogues are being voice-acted in a very convincing way, some self-contained stories are even being projected as short movies. There is some point-and-clicking too, although this is allways clearly indicated and not designed as a challenge or puzzle. All in all, the variety in interaction between player and game helps a lot to draw one into the story.  The awesome visuals and interesting storytelling are accompanied by a soundscape that mostly stays in the background, punctuating some important actions without drawing any attention to itself. A bit more of these, and a more convincing musical envelopment would have painted the period even better I believe. But this is only a minor quibble. More problematic are the click-and-drag actions one has to perform to unlock doors or achieve other minor tasks. These feel tucked on, and do not integrate well within the overall concept.   Highly recommended to anyone interested in visual novels, in literature or in artistic games in general. It's a real shame this development studio hasn't released any more games yet. ",
            "review_score": "1"
        },
        {
            "review_text": "'The 39 Steps' is, down to its core, a slightly-interactive-novel. That being said - it's not 'bad' by any means. For what it is, it's incredibly well done, and a means in which I would love to continue consume various forms of classical fiction.  Based on the original espionage thriller 'The 39 Steps' by John Buchan, you can definitely see where modern day spy stories came from - predating popular fictional characters like James Bond by at least 30 years. This story takes place on the verge of WWI and introduces a character named Richard Hanny, a man on the run after a young American spy divulges sensitive information to him. The game is presented mostly in beautifully painted backdrops, fuzzy silhouettes and the occasional shadow puppet show (of which are quite entertaining). These backgrounds take you from inner-city London, to the moors of Scotland and back again. There isn't much gameplay to be had (to my slight disappointment), but what is present is likened to that of a game like 'TRAUMA' - drawing shapes and clicking on things to carry through the cutscene-like chapters.  Simply put - the game is awesome for what it is - but it really needs a bit more interactivity. There is one part that involves the character decoding a notebook. I got really excited, thinking that I'd at least have a mini-game or a puzzle to figure out the code, but alas - the game just carries on like the book. They allow you to zoom in and out on objects you see in the environments - here I am, thinking that I'll have to do some Sherlock Holmes work and pick out clues from the zoomed-in objects, but alas - there isn't much to discover but a few timeline-appropriate advertisements and newspaper articles.  I would love to digest all sorts of fiction this way. From Sherlock Holmes to H.P. Lovecraft to Franz Kafka - I would love to have this sort of artwork and voice acting and sound effects, mood, pacing, attention to detail, and the ease of taking it in via separate chapters (just incase I need to leave and come back to it) - albeit, more interactivity would be preferred.",
            "review_score": "1"
        },
        {
            "review_text": " 'Reveal the WW1 conspiracy in an exciting adventure'",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed it a lot!   The 39 Steps is an animated, illustrated espionage-novel with sounds, music and linear narration - and without any real choices for the 'player' during the whole story. So don't expect a full pc game, but instead anticipate a classic digital novel adaption, which totally knows how to entertain the audience.  You'll find yourself in an authentic England of 1914 and you'll be able to enjoy wonderfully painted illustrations.  All actions one is able to do are: examining various objects, clicking at things, or moving the cursor from time to time into specified directions to simulate actions, like for example running away, shaving, building explosive devices, opening doors, etc. And it works - and raises the level of immersion during the narration.   It looks great, the atmosphere feels great and the narration has a fluent feeling to it. Plus it's easy to get the 100%-achievements just along the way.  Altogether its an exciting, enthralling Spy Fiction Story with a lot of moments of suspense! Couldn't have asked for more.   I recommend it for relaxed autumn evenings, when reading is just the perfect thing to do.",
            "review_score": "1"
        },
        {
            "review_text": "   Interactive visual novel with breathtaking art",
            "review_score": "1"
        },
        {
            "review_text": "As a point &amp; click adaptation, it loses something of the pacing, intensity, and imaginative power of Buchan’s rollercoaster, only really picking up towards the very end despite a 4 to 5 hour running time. Again, against more traditional video game experiences – even the likes of Dear Esther – it struggles to satisfy when players actions have comparatively little effect.  But it still contains many memorable encounters and if The 39 Steps can convince players to check out the original story (free from  Project Gutenberg  [www.gutenberg.org] ), or others like it, then perhaps this experimental foray has done its job well enough.",
            "review_score": "-1"
        },
        {
            "review_text": "This is probably the best book that you will ever play, and with a series of achievements that are unlocked just by going through the story the value is definately worht the price. 10/10 must buy, must read.",
            "review_score": "1"
        },
        {
            "review_text": "All visual novels i’ve come across seem to follow that choose-your-own-adventure line while catering to a very certain, slightly perverted, teenage fanbase.   This instead is what you could call a multimedia thriller, combining the classic narrative with beautiful hand drawn backdrops, fitting audio and some basic animations. All combined it makes for a very immersive experience, and with the excellent quality of the source material writing there is an actually gripping story driving the game forward.   It was a captivating 4 hours experience that changed my conception of what can be done within the rigid structure of a visual novel. Highly recommended as such.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to start playing all of my Steam games, so I began with this. Althought the novel's genre is not my type, after playing the first two chapters I kept thinking about the game through the day, and ended up playing the rest of it in one go. Wonderful art and voice acting, and the story itself is told interestingly. Would definitely recommend it to anyone, even if they think they don't have the patience to read so much.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic tale of espionage and skullduggery wonderfully put together in a digital format. I have never been a fan of visual novels but this i enjoyed immensely. It has taken the original book and given it a new lease of life in the digital age. The artwork is superb. Acting throughout is very well done. If you've read the original tale, it'll want to make you re-read it, if you haven't, i'm fairly confident that you will be picking a copy up from the local bookshop.   Great Tale, Great Fun.  9\\10",
            "review_score": "1"
        },
        {
            "review_text": "Playing through the whole story took me close to 4 hours, and having paid £0.99 for the game when it was on sale, I found it to be unbelievable value for money. It's a hard game to praise, or criticise, as it's not really a 'game' in the traditional sense at all. Self styled as a Digital Adaptation, it has varying levels of interactivity, but plenty of depth. Although I can't really praise the game makers for the story, I can say that it is beautifully exicuted.   My one complaint is a really daft set of sequences where you need to draw shapes with the mouse in order to make Hannay do things like open doors and windows, or run. They feel awkwardly shoehorned into the game and also make it feel much more like it should have been developed for a touchscreen device.  However, this minor complaint does not take away one jot from the overall experience. ",
            "review_score": "1"
        },
        {
            "review_text": "The story is ok although the first part is boring a bit.  Cinematic cutscenes are great. I like that style of this game.  And for the achievements hunters, you must play this game because it's way too easy to earn all achievements. Just play through the end.",
            "review_score": "1"
        },
        {
            "review_text": "As this being a visual novel and not a classic video game it might not be made for everyone, but I was pretty much hooked from the first chapter onwards. This digital adaption of an english literature classic is executed pretty well, with beautiful hand drawn background stills for most of the time and an overall excellent atmosphere. The rare voice acting is good overall, the animated portions are great and the reading of the text isn't painful. There are one or two game mechanics which could have been handled better, but as this being the first of its kind that I am aware of, I must say the developers did a pretty good job and I am sure they are able to improve the really small annoyances in potential next installments.  Highly recommended if you like to read (interactive) books/thrillers on espionage in the dawn of World War I, because this one is worth it and I really hope to see more digital book adaptions in the future.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I liked the soundtrack and the scenery.  Should be played in fast pace, otherwise it might be boring.",
            "review_score": "1"
        },
        {
            "review_text": "This is not realy a game, but a digital novel.  After my experience with another game in this genre (Dear esther) I did not think i would ever enjoy one. That's why i was even more amazed with the joy i got out of playing this one.  I realy can't find anything that could have been improved in this game.  I give this game a well deserved 10/10.  pros: * extremely well adapted digital novel * superb immersion in the story * superb arstyle * although the kind of interaction is very limited, it seems just right to add some value. * it has plenty of convenient stopping points, but the way i see it, those will only be very short intermissions  cons: * not realy a game * no replay value",
            "review_score": "1"
        },
        {
            "review_text": "The 39 Steps isn't necessarily a great book, but the way the novel has been made interactive is a step in the right direction. Personally, for me, the story contained too much politics, which I hate with a passion. I can't help it. I just have no interest in it. But the way this 'game' has been executed is done in a terrific way.   I was actually talking with my girlfriend about how I'd love to read books like this, with beautiful high res pictures and dynamic text in it, and the voices recorded like you're listening to an audio book, with each person doing his/her part instead of just one and the same person.  So, basically, this is an interactive novel. Reading this novel should take you anywhere between 3 or 4 hours. Short enough to keep you interested and long enough to tell you its story.  One thing I didn't care for was the fact that there are a few Scottish conversations in it, sometimes being spoken with a certain accent. It was hard to follow at times, so it would've been nice if there were extra subtitles for those parts. I really had to concentrate to understand it. It's the only flaw I can think of, so if you're an avid reader you might want to give this a read.  [Rating: 72/100]",
            "review_score": "1"
        },
        {
            "review_text": "This game, hmm better to say this novel is truly great. It almost felt like reading a book.  I'm looking forward for more good stuff like this in the future!",
            "review_score": "1"
        },
        {
            "review_text": "me and my mum climbed all of them",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS NOT A GAME. That needs to be made clear because someone expecting a game of some sort will be disappointed. It's not even a point and click that requires any thinking. This cannot even be compared to Phoenix Wright. This is a book with digital pictures and voice-work and rare animation. It is aptly described as a digital adaptation. How do we set it apart from a book with pictures? Sound, voice-work and interactive page-turning.  That said, here's the review: WHAT IT DOES, IT DOES VERY WELL. The sounds are crisp and very effective, the voice-work is professional level and well cast, the artwork is beautiful, the pictures (i think they are retrieved from actual existing sources of non-fiction, such as newspapers, museums, etc.) go the distance and the work put in to get them shows, to me, the passion with which this work was made. The soundtrack is also excellent and hightens the mood.  I enjoyed the craftsmanship here.  The thing is, it does harm to both the worlds it draws upon:   - as an interactive game, it never challenges you, never makes you think, never puzzles you, nor does it require any skill to advance. - as a book, since you don't go through it at the rate you read a book, at the pace the author envisioned, it ends up not being as thrilling. Plus, it gives sound and image to something that never lives up to the reader's imagination, a common complaint in film adaptations. You could say that, like a film, that's bound to happen. The difference is, when you're making a film, no matter how faithful to the source material, it frees itself from it because the author of the film knows it's a new medium and that, in that respect, it's something new. It's the film's author approach. Here, since it's just a helping visualization, there's never that approach. Just images, sounds and transitions.  To sum up, this is a very well made digital adaptation. Go through it and you'll see the passion about the project and the tremendous respect for the book. I loved this because i spent every second appreciating the level of craftsmanship (my hat's off to thee, Simon Meek. I'll buy the next one) and the fine words of a great book, but, since i'm on Steam, i'd suggest either reading a book or playing a game. Those of you just wanting to play a game or reading a book will end up frustrated both counts here...",
            "review_score": "1"
        },
        {
            "review_text": "The story is really interesting. I am really glad I bought this game. Not hard to 100%. You just need to not skip anything.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic visual novel of sorts with a very good immersion in 1914 London and Scotland. If you are looking for a casual point and click with very good art, music and a deep story, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Not a game, but a good interactive retelling.  The storytelling itself is solid and refreshing (HOPA genre game makers take note, but also take note this is not a HOPA), but pacing does get a little let down by some of the presentation in parts.   It is an interesting format for absorbing a text though. For those unfamiliar with this story. You can seek out the books or the James Bond series which was heavily influenced by this. The thrilling conclusion doesn't pack the punch that Hitchcock achieved in the film adaption, but Hitchcock rewrote the entire story and meaning of the 39 steps to get that ending.  I don't think this would take anyone 5-8 hours to complete as it says here. I missed one achievement in the playthrough I did because I was trying more to keep pace with the story than to gain all the badges.",
            "review_score": "1"
        },
        {
            "review_text": "“I believe everything out of the common. The only thing to distrust is the normal.” ― John Buchan, The 39 Steps",
            "review_score": "1"
        },
        {
            "review_text": "A profoundly enjoyable game... It may not a 'game' in the conventional sense however the narrative is gripping, the imagery beautiful and it's well worth a look!",
            "review_score": "1"
        },
        {
            "review_text": "Visual novels are usually not my cup of tea, so I might be biased here.  In any case, I don't find this one particularly good. Neither the story, nor the actions that have to be perfromed in order to progress with it.  Particularly, I don't get the concept where you have to make some specific mouse movement to open doors or perform any other trivial task. It seems as that was the only way the developers found to catch the 'player's' attention. Completely unnecessary.  Avoid.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Not really a game. More like an interactive story book. Really well made though.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay - The 39 Steps is like an interactive combination of a book andmovie with very limited gaemeplay. Essentially, there are parts where you have to click and drag the mouse up, down, right, or left and in a clockwise and counterclockwise manner. In addition there is pointing and clicking similar to point and click adventure games but without any puzzles. This undoubtedly sparks a debate as to is it a game or not? In my opinion it is, because you do have some interactions and you can miss achievements if you don't try to experience all of the options in the game. If this lack of gameplay does not sound good to you, I would recommend avoidng this game.  Story - The focus of 39 Steps is the story which is set right before World War I in England and Scotland. It is a spy thriller, but feels close to Sherlock Holmes in my opinion. Much like in Dickens, there is a lot of happenstance or good fortune that you don't see in modern stories, but I think that is part of the charm of a story like this. I love many things set in World War I and appreciate British literature so for me this was a very enjoyable combination. The story starts a little slow, but once it picks up, it is really good and I had trouble not wanting to play through the whole story as fast as I could to find out what would happen. There are some thick Scottish accents and a few British words that Americans don't know or use, but overall, if this story sounds at all appealing to you, then you will enjoy the story.  Presentation (Graphics and Sound) - There are a few simple cut scenes, but most of 39 Steps is painted background images with text over top. Fortunately, these are all very attractive and help you 'see' the story. There are also authentic looking maps and pictures from this era of history which was also appreciated. The sound is really solid and the voice acting is well-done. Hearing the protagonist pant after running or yawn after waking up makes the story come to life. For an Indie game, I thought the presentation of the game was very good and it enhances the story.  Overall - The 39 Steps may have limited appeal because of its lack of gameplay and historical setting, but I loved the four hours I played and thought it was totally worth buying on sale. If you're looking for perfect games, the achievements are very easy to get and only require that you play through the game and look at/inspect every item or option as you go through the story. It doesn't get any easier or quicker than this. If you think this game sounds fun or interesting, then I highly recommend buying it because I really enjoyed it.  8.0 (Out of 10",
            "review_score": "1"
        },
        {
            "review_text": "This game felt like a theater play where I was just in the audience watching from a distance. It tells you a story about murder and mystery. There are not puzzles, or challenges in this game. The story was very well done, and I enjoyed every minute of it. I liked that it made you use your mind to play out each scene and to put your own thoughts into the game as to how people look and move. You don't get to see your main characters face or anyone else's face for that matter. The game does let you click from time to time on certain things to get a better understanding about what is going on. This game was fun and I loved how it played out. Getting all the Steam achievements is extremely easy, all you need to do is just play it and you'll get them all. This is a delightful game and I suggest picking it up when you have the chance.",
            "review_score": "1"
        },
        {
            "review_text": "MAYBE if you like visual novels this game can get somewhat interesting, albeit I am not sure. In any other case it's the 39 steps to boredom. It doesn't have a gameplay, and the story seemed pretty banal and boring, a typical South Park episode has more convoluted and entertaining plot than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting attempt to work a new way to tell a story, yet, in my opinion, was a let down. Maybe is the interaction, or the lack thereof. Perhaps the original story isnt just that good.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I am sure the story is interesting later on or whatever, but this 'game' (visual novel being a more appropriate description) is boring. The characters are not interesting. The pacing is slower than a dead snail. The layout and overall design is awful. I would prefer to just read the book, but now I've played this game I can be certain I'll never pick up the novel for fear I will be put into a comatose state reading it.  It has trading cards, however, so it was worth the $0.50 or whatever I paid for it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Just finished this after buying it some time ago. I've never read the book or seen any of the adaptations, so the story was brand mew to me.   The story was fantastic. The atmosphere that was created by the music, sound, art, voice acting, and UI is top-notch. It was an immensely enjoyable experience. I'll be purchasing the next adaptation (when's that coming?).   Thanks for taking a chance on buildiung this (Unity *IS* a great tool), and also thanks to the Scotland Innovation for funding it. We need more experiences like this to go along with the conventional games.",
            "review_score": "1"
        },
        {
            "review_text": "actually,i dont like this game! May be im a bird!:D",
            "review_score": "1"
        },
        {
            "review_text": "I bought this as the novel is one of my favorites. Don't expect it to be anything other than a narrated story - because that's all it is. However, given the low price I paid for this game, I was actually pleasantly suprised at the enjoyment I got out of it. The music really helps set the mood for each scene and the voice acting is mostly spot on (exactly the right about of cheesy stereotypical early 1900s British accents, but they didn't do their homework well enough for the German ones, I felt). The UI was odd at first, but after a while I realised it was much more involving than just left-clicking all the time.  One word of warning to anyone who expects to be able to be allowed to work on breaking the code that is given to you: once you get the ciphertext, don't play on or the game will just give you the key without any obvious warning that it's going to do so. That was the one thing that I was sure that they would have worked on with this game, which was a tad disappointing.  All in all, good for a few hours of entertainment and bit of a nostalgic kick for me.  UPDATE 25-03-2014: I just saw this game priced at €9.99. It's not worth that at all. You'd be better getting the book at that price. Wait until it's at least under a fiver.",
            "review_score": "1"
        },
        {
            "review_text": "Take a classic thriller novel, add limited animation, mood-setting background music, solid voice acting at key junctures, and very simple point-and-click segments. You get The 39 Steps. As long as you expect absolutely no player agency whatsoever, you'll have fun clicking your way through the tale that inspired Ian Fleming to create James Bond.",
            "review_score": "1"
        },
        {
            "review_text": "It is not actually a game; looks like an interactive book. Interesting story, atmospheric music, nice drawings.",
            "review_score": "1"
        },
        {
            "review_text": "This digital book is kind of like a point-and-click adventure only there's not much interaction. The story seems truncated and trite, perhaps even a Reader's Digest version, although I've never read the original story so that's just my guess. This version is told fairly well and is nicely segmented. I think the timeline of the story is supposed to be just before World War I, but they do not make this obvious. There's some decent voice acting, illustrations, and a good story board, but it's really not something I would consider a game. If it weren't included in an indie bundle, I would have never considered purchasing it. As an interactive book, I'm not all that impressed, but there's some good effort put into it.",
            "review_score": "-1"
        },
        {
            "review_text": "I like reading. I read everynight before bed. I immediatly found this game frustrating. Everything just went so slow. I was ready to read. Instead, I would read a tiny bit, then wait... read a tiny bit, then wait... I'd say just read the book.",
            "review_score": "-1"
        },
        {
            "review_text": "I did it! I finished a campaign just for achievements. And what can i tell. My English language knowledge pretty bad to understand whole game, but it was curious sometimes. As someone said, this game is kinda 'book-reading-game'. But, it's better to read real book. More exciting and entertainment. Is this game for lazy people.. for those hard to get to read? (as me, yes)  Maximum is 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "  this game is great. Of course If you like visual novel type, you may want to pass this game but believe me, this game has some nice idea and excutes very well",
            "review_score": "1"
        },
        {
            "review_text": "Easy achievements and game completion. Could've have some more puzzles though.",
            "review_score": "1"
        },
        {
            "review_text": "- Click on images - Slow  - Boring - I read a book faster and is more enjoyable or you need to like these kind of story/novel",
            "review_score": "-1"
        },
        {
            "review_text": "The 'mash → for an hour and a half for free achievements' game. Truly a masterpiece, 9/8.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome way to tell a story - interactive and intrestingly made.",
            "review_score": "1"
        },
        {
            "review_text": "As the other reviews were clear about it. This is not a game in the sense we know about. As the other guys reviews also said, this is an interactive story telling. I couldn't get myself to go through it as I felt there is too much reading/listening and I would be better off using this time playing one of my many other games. If you're looking for any kind of action, then go away, it's not for you. If you are patient and like reading and have 4 hours to spare. Go ahead, you might like it.",
            "review_score": "-1"
        },
        {
            "review_text": "This to me, does not even count as a game. It's so boring, dry, and dull. As you can see I didn't even play for an hour. I got so bored. It's a narative story where there controls for progressing the story are disasterous.Don't stress yourself out. Don't get this 'game'.",
            "review_score": "-1"
        },
        {
            "review_text": "Its not a game, its a pile of garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "I just finished my playthrough of the game, taking about six hours to do so. As other reviews stated, this is a visual novel. If you want a nice, relaxing experience without quick time events or the need for quick reflexes, you'll enjoy the 'game'.  The voice acting is as good as any AAA title. Some of the scottish slang confused me, so just try to get the gist of what they say and you'll still be able to follow along, be sure to have subtitles turned on. The artwork is excellent, and a joy to look at. With many scenes, I would take the time to admire the detail, which is likely why it took me so long to finish the story. Sound effects, audio cues, a lot of attention to detail was paid to this adaptation.  I would play the game in the evening, with the lights dimmed in my living room, using my TV as a display to a PC running SteamOS. Thanks to the developers for porting this to linux / SteamOS for I would not have had as enjoyable experience sitting so close to my main PC in my computer room.  I am looking forward to the next title the developers release. I honestly, had never heard of the original book until playing this title, and may look into reading it now. The main character also appears in other books the author had written.",
            "review_score": "1"
        },
        {
            "review_text": "Breathtaking, ive never come across such a breathtaking game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very intriguing narrative game. For a couple of hours I felt like a living scotish guy fleeing from an immense conspriracy. Could'nt stop the game until the end  Good job! ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. really a fun game that just puls you in to the story. great job on the grapics and a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome history! Worth the playing time",
            "review_score": "1"
        },
        {
            "review_text": "Fine interactive book",
            "review_score": "1"
        },
        {
            "review_text": "This is a very weak recommendation. Anyone who considers buying this needs to know that it's not a game; it's basically reading a novel, with very minimal interaction. I wasn't going to recommend it, but I was drawn into the story enough to enjoy myself. The art was great, but I wish they had included the characters instead of just making them silhouettes. As long as you know what you're getting into, it might be worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "I like this way of experiencing a story. They could have picked a better story though. I hope we see more like these!",
            "review_score": "1"
        },
        {
            "review_text": "Like all other reviews have stated, this is not a game, but rather a visual novel. Do no expect a game. If you feel like reading a book, this purchase is for you. The story is compelling and the voice acting is well done. I was pleasantly surprised and entertained.",
            "review_score": "1"
        },
        {
            "review_text": "If you like visual novels, you should consider picking this one up. It's based on a book by Scottish author John Buchanan that was published in 1915. There is no gameplay here. This is purely a visual novel.  The story takes place in and around England and Scotland during 1914 when the United Kingdom is at the cusp of joining the Great War. It is an interesting and compelling work that drives the reader forward with good mystery elements and incredibly well-written dialog.  Please note that it is probably the easiest game on Steam to get 100% achievements for.",
            "review_score": "1"
        },
        {
            "review_text": "After the first 2 boring chapters The 39 steps become a very interesting interactive story even if it only lasts for a few hours",
            "review_score": "1"
        },
        {
            "review_text": "A visual novel, interesting enough story which starts off a bit slow. Get it on sale, play through it once then never again. Takes about three hours to beat.",
            "review_score": "1"
        },
        {
            "review_text": "This adaptation of a novel was an excellent experience. I was immersed in the environment and loved the way the gameplay unfolded the story. The gameplay is interesting where mouse movements are used to navigate the text – swirling the mouse in a circle moves to the next paragraph of text.  The voice acting was sparse and made the moments when it was used effective. They were short breaks where you could sit back and watch the story unfold.  The gameplay was subtle and propelled the story while involving you as the main character.  My only quibble with the game was sometimes the music did not loop perfectly which took me out of the moment. However, the next flick of the mouse brought me right back into it.   Greatly recommended and anxiously awaiting the next adaptation.  ",
            "review_score": "1"
        },
        {
            "review_text": "This was soooo British",
            "review_score": "1"
        },
        {
            "review_text": "I finally finished this game and overall I didn't really like it much.  Pros: 1. Great voice acting 2. Nice painted backgrounds 3. Nice sounds  Cons: 1. Incredibly boring story 2. Story relies on way too many coincidences, hardly believable. 3. Storytelling is extremely slow. I kept nodding off every time I tried to play it.  This is one of those games which I just wanted to finish as soon as possible so I could remove it from my computer and never see it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Not having the time to play a true game, I decided to try this, which, being a digital novel, I thought I could pick up and put down at will.  Well, I was half right... I picked it up alright, yesterday, and stayed up until about 4am until I fell asleep, then picked it up again at 8am this morning to get the story finished.  It's not that I haven't read the 39 steps. It was required reading at school, and having seen many BBC adaptations, and the hitchcock movie, I am quite familiar with the story. I remember being at school, reading the passages about when Hannay is cowering in the hayloft (in my memory, may have been the mill), desperately waiting for the pursuers to move on, my heart pounding along with his....  It's only many many years later that all the coincidences pile up and make me think 'Hmmm'. The game doesn't help the coincidences, instead accentuating a few of them, which might make someone who hasn't read the book think 'Uhhh.. that's highly unlikely'. Either way, if you can suspend disbelief, The 39 Steps is still a fantastic story, and I'm sure the base for many other stories.   So, I was very pleasantly surprised to find a game which managed to condense the book into a game, but seems to have somehow managed to maintain all of the feel and pacing of the book. Wonderfully, all of the adaptations vary from the base text, so every version you read or watch will be different in some way, so there's always a little freshness there. The version I watched on TV the other day had him being chased by spies just after his speech for the MP... which differs from the story somewhat...  So, even if you know the story inside out, the game is a good, faithful adaptation. But, is it any good as an experience?  Well, the artwork is beautiful. Created using something like Black Ink, I guess, the settings are all wonderfully rendered, smattered with little bits of black and white photography, period references, and quaint technology. The game designers opted to omit any live action, and instead went for a 'shadow puppet' approach, where the main actors would occasionally appear in silhouette to describe action. It works okay, and actually you start to really appreciate the simplicity.  The little 'puzzles', which amount to clicking in the right place, or swooshing the mouse, give you a little something to do rather than just clicking the mouse to 'turn pages', which is really nice...  The voice acting is excellent. The accents are all just a wee bit off for the period. They're 'modern posh' rather than 'georgian posh', but you'd have to be a real BBC drama officionado to notice.  The merging of graphics, the music, the artwork, the voice talent, and the story are all excellently done too. At points, when there 'context' information to present, it's given as a nonlinear 'wheel' of words, and you can delve into whatever you like. You know that you don't REALLY need to read any of it. In the book it would have been incidental padding, so it is faithfully recreated as such in the game.   I really enjoyed this, and I recommend it to anyone who likes a spy novel.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a very, very good a digital adaptation and the thumbs up goes to the devs for their work, especially for the stunning hand- painted backgrounds and historic material (photos) used in the game.  For the story itself - well, it is interesting, but it gets so far-fetched, that if it were a book, you'd probably stop reading it at one point because a good idea for a story is not enoough to make a good book. Game is short enough to finish it in one night and my advice is, that you do just so - finish it in one go, dont think too much about the story and let it run in the background afterwards for the cards to drop.",
            "review_score": "1"
        },
        {
            "review_text": "Interactive book. It's interesting and short enough to be worth looking at.",
            "review_score": "1"
        }
    ]
}