{
    "app_id": 235250,
    "name": "Super Sanctum TD",
    "release_date": "2013-05-09",
    "developer": [
        "Coffee Stain Studios"
    ],
    "publisher": [
        "Coffee Stain Publishing"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Indie"
    ],
    "achievements": 27,
    "positive_ratings": 1271,
    "negative_ratings": 169,
    "price": 3.99,
    "description": "Super Sanctum TD is a retro-styled Tower Defense game that focuses on strategy, customization and replayability. Build advanced mazes and construct powerful towers to prevent alien hordes from reaching the Core!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235250/header.jpg?t=1510129510",
    "minimum_requirements": "OS: Windows XP (SP3), 7 or 8 Processor: 1 GHz Memory: 1 GB RAM Graphics: DirectX-Compatible DirectX®: 9.0c Hard Drive: 100 MB Free Space Sound: DirectX-Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Super Sanctum TD is typical towers defense game, nothing more, nothing less. Yes, this game looks on screenshots like 20 years old game which may be repulsive. I don't even know why I started to play this game, but for sure I didn't have any expectations. And I realised that I have 13 hours playtime. That was good time for sure. This game is well designed, difficulty level grows with every level, so it's not so hard to start but it's getting difficult after some time. But you will want to pass only one level, and next after that, and maybe next... And so on. Generally very well designed, polished and properly balanced piece of a game. It's really hard to find something as good in such a price. Good job.  VERDICT: If you're a fan of tower defence games, this is good one. Try it, you won't regret. If you have only few bucks and want to play for long hours, this is it!  Like this review? Consider to join  Good Games Giveaways &amp; Reviews  group and maybe press big sexy 'Follow this curator' button on our  curation page  to read more reviews and win free games.",
            "review_score": "1"
        },
        {
            "review_text": "I only have roughly 15 minutes of playtime,and I can say this game is worth your money.  If you like tower defense games,this game is definetly a yes. Brings back the old skool feeling.   I'd say go get it,especially now that it is on sale for 39 cents.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a perfect example of how to keep a tower defense game interesting in 2013. Even though Super Sanctum TD has a top-down view and does not include a protagonist, you still feel like you are playing something else than a simple flash game.  The fact that you decide where you place foundations is most likely the biggest difference compared to other tower defense games. Some people are saying that the update in December 2013 changed the game, but that didn't stop me from buying the game. After a few hours I have to say I don't know what they are talking about. This game is not super-easy, it's challenging, but it should be.",
            "review_score": "1"
        },
        {
            "review_text": "It's an old acarde version of the first Sanctum game. Although this was just an added little game to the release of Sanctum 2, it's a pretty solid awesome game on it's own!",
            "review_score": "1"
        },
        {
            "review_text": "I wish for 'meh' option. I bought this game on sale, so it was dead cheap, but I would never buy this on my own, and I am fan of Sanctum games. Definitelly you can kill few hours of your time with this.",
            "review_score": "1"
        },
        {
            "review_text": "It's a simple tower defence game.  I honestly only see you playing this for a few hours and you'll get bored with it.  Not a half bad game if you can catch it on sale/find a coupon.  REALLY despise that the achievements are memes, seems extremely lazy and uncreative. ",
            "review_score": "1"
        },
        {
            "review_text": "Super Sanctum TD. Normally i don't play these,even less when they cost money.but it costed only 4€ so i wanted to give it a try.  But,What is Super Sanctum TD?",
            "review_score": "1"
        },
        {
            "review_text": "If you expect standard tower defence game, you won't be disappointed. Standard mechanics for TDs, interesting level design and about 20 different towers and enemies. This is that kind of game which you are gonna play for a few hours right when you buy it, however, after that time you will simply play one level and enjoy, but you won't feel that need to go to the next level and you will go for that next level simply another day.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of Habbo Hotel... But without the virtual ♥♥♥♥♥. Oh and I spent money on this.",
            "review_score": "1"
        },
        {
            "review_text": "totally worth my money! Give me more.....",
            "review_score": "1"
        },
        {
            "review_text": "Really great tower defense game with a retro look!",
            "review_score": "1"
        },
        {
            "review_text": "This game had a really tough rollout with lots of bugs and crashes, but even at its worst, it was loads of classic tower defense fun. Sanctum is know for putting a First Person twist on tower defense, and while this retro take comes with familiar tower mechanics and enviornments, it feels like a completely different experience, and a positive one. Outside of the traditional tower defense formula, you also get experience points and as you beat levels, you can earn perks to upgrade damage, enhance the economics of the game and boost your abilities.  As to the bugs, the devs have been working hard at improving the experience, and they seem to have the worst bugs whipped. They've also been tinkering with balance to create a tough but fair play experience. The fixes have been a little slow in coming, but I'm generally happy that they stuck it out and managed to get it fixed.  On Steam, this is my second favorite tower defense behind Defense Grid.",
            "review_score": "1"
        },
        {
            "review_text": "First off this game is a blast. It has fun retro graphics and an excellent level of difficulty for those of us that love tower defense games. There is a great combination of watching your towers tear apart enemy waves as well as hands on skills that you need to use when the going gets tough. It's fun to see the use of various Sanctum enemies and mechanics in a purely tower defense format. If you are a fan of either of the Sanctum games or are purely looking for a challenging tower defense game then this game is definitely for you. Great bang for the buck",
            "review_score": "1"
        },
        {
            "review_text": "Didnt realize how long I was playing... Felt like only half an hour or so, but nope, it was 5 hours.",
            "review_score": "1"
        },
        {
            "review_text": "For the money, perhaps the best 'traditional' tower defense game out there.",
            "review_score": "1"
        },
        {
            "review_text": "Super Sanctum TD is a tower defense game that's fun and addictive while it lasts, but considering the large amount of unused space on the world map, seems unfinished - or maybe it was supposed to have DLC that never got made.  Anyway, each level has a Normal and Hard difficulty setting, but 'Hard' is rather hit or miss as far as challenge goes. The problem is that once you've played enough on Normal, you'll unlock a plethora of skills to make the Hard difficulty that in name only. However, some of the stages near the end, especially the one with the boss that replicates itself, will take a lot of planning and strategy if you're going for the 3-star achievements.  It often goes on sale for less than a dollar. If you like tower defense games and getting Steam achievements, it's an easy recommendation for that.  Rating: 3/5",
            "review_score": "1"
        },
        {
            "review_text": "I didn't expect much when I got this game, but I was pleasently suprised with its outcome. It is a bare bones Tower Defence, great for beginners that want to learn a simple version of the gameplay. Allthough it is basic, it is not without great upgrades, tech trees and special moves. The game on hard provides a healthy amount of challenge without overwhelming you with techniques, your strategy is still extremely valuable. I have played the sequel to this game and it is completely different and strays from the game type. I enjoy both games #1 7/10 and #2 6/10. The multiplayer element of the sequel adds alot to the game and could provide tons of good competition and strategy. I can dig it! GET Sanctum 2  ON SALE PRICE IS HIGH",
            "review_score": "1"
        },
        {
            "review_text": "It's a good standard tower defence game.",
            "review_score": "1"
        },
        {
            "review_text": "Got it on sale ($0.79) and its fun. It will keep you busy for hours because it gets challenging later on. This might be my second Fav tower-defence game I've played besides StarCraft 2 arcade minigames.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty fun and well designed tower defence game. I don't think it's worth the price their charging however. Maybe wait for a sale, then buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense i have played in a few years, Well worth the money if you like TD games.  Lots of wepon choice and most items have 2 or 3 lv upgrades + effect towers can be placed (slow, extra damage etc) Good mix of bad guys (some fly, some are fast, others hard as nails) and you can re direct them around the maps making paths with tower bases.  Nice clear graphics, Lots of bad guys and wepons, Re-playable, Some new ideas but still keeps the old TD feel. 9/10 for a TD game.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and simple tower defence. Nice and beautiful soundtrack, interesting gameplay, detailed pixel graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Love thw game but it gets harder to the point that you have to level grind some of the previous levels. Overall great tower defense!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's a game. I think...",
            "review_score": "1"
        },
        {
            "review_text": "6/10",
            "review_score": "1"
        },
        {
            "review_text": "very td much wow",
            "review_score": "1"
        },
        {
            "review_text": "You can't go wrong for .39 cents.  I've played many TD games on PC and Android, and I can say this is a great TD. Upgradable perks, lots of different towers, survival mode offered after each level. 8-bit look is kinda cool too.  I don't know what people were talking about the game being too hard. This game has the same difficulty curve as any other TD. ",
            "review_score": "1"
        },
        {
            "review_text": "It's a tower defence game alright. Build towers, cannons and stuff and stop waves of enemies.",
            "review_score": "1"
        },
        {
            "review_text": "It's a tower defence game alright. Build towers, cannons and stuff and stop waves of enemies.",
            "review_score": "1"
        },
        {
            "review_text": "It's a tower defence game alright. Build towers, cannons and stuff and stop waves of enemies.",
            "review_score": "1"
        },
        {
            "review_text": "Nice tower defense , worth it !! Must have :)",
            "review_score": "1"
        },
        {
            "review_text": "best game you can get for 0,59 €",
            "review_score": "1"
        },
        {
            "review_text": "Small price for a surprisingly good tower defense game. Can be quite challenging. Skill distribution and creating your own maze by placing blocks make this real fun.",
            "review_score": "1"
        },
        {
            "review_text": "A smooth, simple, polished little gem.",
            "review_score": "1"
        },
        {
            "review_text": "Once upon a stone age ago I use to go to the arcade after school and drop a dollar in various machines and be on my way home in less then ten minutes. This one cost me a little more then a quarter as I recall and has already given me four hours of entertainment. Its a cute little tower defence game, nothing special, nothing new, but if you pick it up on sale it might suprise you. Prolly takes around 4-6 hours for most to finish.",
            "review_score": "1"
        },
        {
            "review_text": "If you like tower defense games, this game is definitely a yes. Brings back an old school feeling.",
            "review_score": "1"
        },
        {
            "review_text": "As far as TD games go, this is a very solid outing. The developers have done a great job updating the UI and artistic elements, keeping the game fresh. I love popping a video on my second monitor while playing--makes this a lovely time-killer. Tough, too.",
            "review_score": "1"
        },
        {
            "review_text": "I think I spent $0.40 on this, if I wanted to sell the cards, I'd make most of that back. It's a challenging game to master, tons of fun, perfect arcade-style time waster. Get it, sale or not, and you'll be pleasantly surprised and wholly entertained. The tower defense genre has an underrated frontrunner, and it's right here.",
            "review_score": "1"
        },
        {
            "review_text": "Classic TD at its best, with a hint of perk based player assitance Sanctum is known for. plain and simple. a retro 16 bit style, even runs on older hardware. it might be nice to see this one come to android, too.",
            "review_score": "1"
        },
        {
            "review_text": "Beat the game and finally figured out you can upgrade the towers XD. Fun as poop",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game overall. Good variety of towers, skills, and perks. There are a few issues though.  Tower selection is quite unbalanced, with a few overpowered towers. Sometimes tower animations does not work properly. There's also no way to see what enemy types will appear on the first wave of a map (only the first wave).  Recommend, especially if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Some levels present a good challenge especially on hard mode. On survival mode it occasionally will crash. It does not offer much over most other tower defense games.   Overall it's a fun game though.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played one TD, you've played them all. This one is no exception.",
            "review_score": "1"
        },
        {
            "review_text": "worth",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Nice pixel art. Enjoyed the retro soundtrack. The gameplay is similar to that of tower defense flash games. In this game, you build your own maze. Some levels can be challenging but not impossible. Personally, I enjoyed this game more than I did Sanctum 2. Note: Some acheivements are buggy.",
            "review_score": "1"
        },
        {
            "review_text": "It's a TD game alright.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Normally, Im not a huge fan of tower defense games. This game however, Im actually enjoying enough to write a review and recommend. Its fun setting up defenses and learning what works and what doesnt. The later maps get fairly complex and chances are, youll have to restart them multiple times to complete them. It gets pretty challenging after awhile, but it still stays fun. Fully recommend, especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "People might think this is just another Tower Defence game but no! This is a very enjoyable and time consuming game.You can play it for hours if you want because this game is too good to be true.Graphic are fair well that's what you get for buying Tower Defence game but I don't give a [bleeped] about graphics! The gameplay is the real deal and the gameplay so is awesome so this is worth your money!",
            "review_score": "1"
        },
        {
            "review_text": "The word addictive does not do this game justice....",
            "review_score": "1"
        },
        {
            "review_text": "Simply just fun. Addictive :D As any other well made TD Game. If you like old-looking game to relax, this is ideal piece to play. But do not expect something mega awesome ;-) 6/10",
            "review_score": "1"
        },
        {
            "review_text": "  Review       Let's Play     Ratings- Overall: 6 Gameplay: 6 Addictiveness: 7 Play Time: 6 Graphics: 4 Audio: 4 Music: 7  Super Sanctum TD is just like any other tower defense. The only distinguishable feature is the art and how they handle the upgrades and activated skills. As far as upgrading and customization goes, Super Sanctum has it in the bag. A talent tree that changes gameplay, and custom setup of the towers and activated abilities you are taking with you combine for a really unique and almost rpg experience. Definitely recommend, but I would wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Super Sanctum TD Is one of the best Castle Defence I have exprience and is worth the 3 dollars. There is loads of choices to begin with raising up your skills to learn and grab more powerful defensive weapons! It may look crappy but once you get into the game its a whole-nother ball game.. (Whole-Nother?) I dont even think that made since but Its a great game! Come and fight off against the alien horde!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Honsetly this game = Awesome even though my playtime isnt that much its still worth the money this game isnt worth just 4 dollars it should be worth 7 even old crappy games reach 10 dollars Whats Awesome About This Game .It works well on windows 8 and 7 .It never crashed .And its one of the best tower defense games because its not that old and has no crappy controls!",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually fairly entertaining, well-built, quite nice-looking, and all around pretty enjoyable. I can't recommend it at full-price however: I feel like this game should be on my phone rather than my desktop. Still, if you've been selling your trading cards or have change in your Steam wallet, this isn't a bad little game to spend it on.",
            "review_score": "1"
        },
        {
            "review_text": "i bought it for 39 cents. sold the trading cards for 25 cents. for 14 cents, this game is ♥♥♥♥ing awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Plays like a Sanctum-themed Defense Grid. Game is currently not too configurable (no ability to set screen resolution), but hopefully this will be addressed. It's something nice to play while doing other things.",
            "review_score": "1"
        },
        {
            "review_text": "money well spent",
            "review_score": "1"
        },
        {
            "review_text": "Just Sanctum 1/2, without the First Person Shooter part. Purely 8-bit Tower Defense. It's still a fun game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Superb little game! Reccomended :)",
            "review_score": "1"
        },
        {
            "review_text": ":))",
            "review_score": "1"
        },
        {
            "review_text": "So much fun to be had!",
            "review_score": "1"
        },
        {
            "review_text": "As a guy who likes tower defense games. I like this game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little old school TD. Win missions to get exp, level up to unlock more towers and powers (basically abilities with no resource cost. Just cooldowns). Also has a skill tree.  Unlike most old school browser TD's, this is balanced, challenging, and constantly fun. My 'time played' is how long it took for me to beat the whole game on Normal, so it isn't very long (unless you plan on trying to beat it on hard afterwards).",
            "review_score": "1"
        },
        {
            "review_text": "I play this on my Dell Latitude E6500 laptop which has no graphics card and just 1gig of ram. It starts up fine and doesn't lag at all. Each tower can be upgraded three times. Some towers attack just ground, some just air, and some ground and air. All levels have a survival mode, and every level has a leaderboard.  There are upgrades that carry from level to level in the form of commander upgrades which can be reset at any time without penalty which lets you experiment with different tower specs and loadouts. There are also special spell-like abilities that you can employ such as a bomb that resets every 20seconds, croud control effects such as freezing, and temporary tower boosts.  There are strategy elements to how towers are placed, how abilities are used, and what your spec is, and how they compliment each other. There are lots of options to play with, and it is fun to experiment. It is not as deep of strategy as a larger game, but this is not meant to be that kind of game. A basic level can be completed in 10 minutes. In survival mode a level can last an hour easily. This game is very very accesible and easy to drop in and out of.  The difficulty escallates rather slowly, but with survival modes and leader boards you are ensured a challenge. That said I am past the first half of the game, and did so casually from my baby's hospital room. I got this title on sale for under $1, and it has been well worth it. Very happy with this game and purchase, and replayability is awesome.  For the price, depth of strategy, and replayability I give this a solid 7/10, and if you like tower defense it is a no-brainer to pick it up I believe.",
            "review_score": "1"
        },
        {
            "review_text": "This game was like a retro TD Its easy to play and even cute too watch Since the graphic is so old either But even when you full screen its cant gave you a full But it will have a space in the right and left side of your screen 6/10 for me",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defense game. Nicely done and cool retro graphics. Would love more of the same.",
            "review_score": "1"
        },
        {
            "review_text": "Got it wiht the Pre-order deal for Sanctum 2, pretty fun to kill the time till the 2nd ones out",
            "review_score": "1"
        },
        {
            "review_text": "Offers mazing, but a limited amount of it as far as I played. The weapons never feel effective, and mine dispensers seem to be the only viable turret to build a lot of, at least during the levels that I played.  I think I got it free?",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable due to terminal bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "I'll admit the only reason I have this is because I got it for free in a giveaway... but this really is bottom of the barrel as far as TDs go. I'm not going to waste more time with this review than the developers did on the game... but I've played sh!t in flash on websites(5+ years ago) for free that was comparable to this, if not more entertaining(Canyon Defense comes to mind). I'm starting to miss the days when flash games like this were free. Now they're sold on Steam for actual money, and for some reason, people are willing to pay for them. Granted I did get this for free, but most people will have to pay for theirs.  If you want a TD, do yourself a favor and go get Plants vs Zombies or Defense Grid instead. If you're going to spend money on a TD, get one that's actually good. Could have gotten Plants vs Zombies for 5$ off a sale or in a humble bundle. I think I paid &lt;10$ for Defense Grid with all DLC. Don't waste your time with this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Super Sanctum TD is a competently-designed, retro-flavored tower defense game that takes few risks and offers an appropriate degree of Fun. An endless horde of horrible space monstroids is pouring out of a weird invasion portal cabbage and it's up to you to place a variety of defensive turrets in the way to stop 'em! Along with your chain guns and flamethrowers and gauss rifles, you also have access to a variety of special abilities you can activate to blast those determined jerkfaces who manage to scrape their way past your gauntlet. As you play, you earn experience, unlocking new turrets and abilities. Level layout and wave composition are well-balanced, keeping up the challenge and often requiring multiple level attempts to achieve any sort of victory. And when all is said and done, you can go back for further challenges by attempting earlier levels on Hard Mode or Survival Mode.  Unfortunately, this game comes from the same people who made Sanctum, which was a delightfully innovative tower defense / FPS hybrid. Dropping all the innovative aspects of the game just makes this seems like an attempt at cashing in on the franchise's name, which, y'know, isn't terribly exciting to the fans; the lore was never terribly compelling to begin with, and this entry contributes nothing new on that front. If you're an avid tower defense enthusiast, sure, the game isn't bad, but you'd be better off playing the other games in the series or trying out a more polished, well-developed tower defense game like Sol Survivor.",
            "review_score": "-1"
        },
        {
            "review_text": "+ classic, basic tower defense game + based on Sanctum-mitology, same enemies  - very linear, no grinding possible - lacks any FPS style from the other Sanctum games, you only have towers and some recharging powers - there is no detailed description about enemies and guns, hard to predict damage, outcome of levels - a bit clumsy interface, without an option to rebind keys  In overall: it is a very simple tower defense game, without anything outstanding, for me, it is only good for a few hours of entertainment.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate this game :( Cant find golden walker",
            "review_score": "-1"
        },
        {
            "review_text": "On first glance, Super Sanctum TD seems like a very nice addition to the genre, but beware as the game is unbelievably hard even at normal difficulty forcing you to grind the same levels over and over until you get enough points to unlock new abilities/equipment. I'm not new to the TD genre but this game simply doesn't have mercy on its players; you have to optimize your maze layout to perfection and be very careful of selecting which towers to employ or there's no way you'll progress far beyond the training area. The 16-bit graphics look nice and serve their purpose, but the sound design is weak and rudimentary.  Generally speaking, the game is way too hard and demands a far bigger commitment than I'm willing to make for what is basically a 2D flash TD game. Could've been much better if the devs weren't so hard-core. But I guess even the TD genre has to have its masochistic version of IWBTG.  Score: 3/5",
            "review_score": "-1"
        },
        {
            "review_text": "lol the games muliplayer functions are DEAD. if your looking to buy this game to team up with someone, look else where. the dev's dont bring new content to keep gamers interested.",
            "review_score": "-1"
        },
        {
            "review_text": "it crashes quite often, and if this happens during a long level, tough ****.",
            "review_score": "-1"
        },
        {
            "review_text": "Super STD needs to stop existing and just go. Just leave.",
            "review_score": "-1"
        },
        {
            "review_text": "  Forget it, developers don't give a ♥♥♥♥. Reading the forum and the bad reviews, people complain about 'crashing' since last year...",
            "review_score": "-1"
        }
    ]
}