{
    "app_id": 235340,
    "name": "Prime World",
    "release_date": "2014-03-31",
    "developer": [
        "Nival"
    ],
    "publisher": [
        "Nival"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Co-op",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "MOBA",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 1954,
    "negative_ratings": 1378,
    "price": 0.0,
    "description": "Prime World is a free online game in RPG / MOBA genre with a unique universe where tactical session battles, castle management, and hero development are mixed together. Gather your collection of talents, build an army of invincible heroes and become the champion!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235340/header.jpg?t=1553679284",
    "minimum_requirements": "OS: Windows XP SP2, Windows Vista SP1, Windows 7 Processor: Intel Core 2 Duo/Athlon 64 X2 - 2 GHz Memory: 2 GB RAM Graphics: GeForce 8600 GT/Radeon X1600 - 128 MB VRAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3000 MB available space Sound Card: Direct X compatible sound card",
    "recommended_requirements": "OS: Windows XP SP2, Windows Vista SP1, Windows 7 Processor: Intel Core 2 Duo/Athlon 64 X2 - 3 GHz Memory: 4 GB RAM Graphics: GeForce 9800/Radeon HD 3850 - 512 MB VRAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3000 MB available space Sound Card: Direct X compatible sound card",
    "reviews": [
        {
            "review_text": "Lag, long queues, poor match making, nothing special to make worth learning. Save your time, Play Dota.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't play unless you speak Russian.",
            "review_score": "-1"
        },
        {
            "review_text": "A foreword about me: I played a lot of DotA back when it was called DotA 3.3 as a WarCraft 3 non-expansion custom map. I played succeeding versions up to 3.7, Danite's Hell, and those that supported game modes such as -aram. I've also been a progression and hardmore raider in WoW and SWTOR. I play League of Legends casually.  Now about Prime World:  This is a MOBA but it's not just a MOBA.  It has the grind of an MMO that both casual and hardcore players can enjoy.  Casuals might like the city-building and city-management aspects of the game. You build buildings and order them to produce wood, ore, food, silver, crystals, or gold (cash shop currency). These resources can be used to buy heroes (like LoL champions), buy hero skins, buy talents, upgrade buildings, upgrade talents, send heroes on quests at the tavern, or rest heroes at the inn (heroes need to rest after a match or quest).  Casuals might also like the Zuma-type game in the actual MOBA part of the game. On the 5v5 map, you can have 3 laners, 1 jungler, and 1 playing Zuma, which helps your team maximize everybody's XP gain. When playing Zuma, a successful game rewards you with a one-time consumable scroll that you can send to anyone on your team, including yourself. The spell on the scroll, and the strength of the spell, is something you select before each Zuma game. For instance, you could start the 5v5 match and play Zuma to create a level 1 healing scroll for your jungler, or a level 5 AoE damage scroll for an early lane push.  Finally, for casuals, there is also a PvE map, ranging from easy, medium, hard, to very hard difficulty. And by PvE, I don't mean a 'vs AI' game, where you're still in an arena but fighting bot players. This map involves protecting a central location from waves of enemies. There are also side quests throughout the 'match', such as escorting an NPC down a lane or defeating all of a specific type of enemy on the map.   Hardcore players can enjoy the endgame, because there is quite a grind when you want to pwn with the best in the world. Your city can produce talents, but you are also rewarded talents when you play and especially when you win. Talent rarity is similar to WoW's, where some are junk and others are legendary, going from yellow, green, blue, purple, to orange. Each talent also has five ranks each, and you can, using WoW terms, disenchant all your junk talents in order to enchant your purples and oranges.  Endgame players can also enjoy the theorycrafting that comes with the flexibility of talent and stat builds. Using LoL terms, some heroes can be built for AD or AP (like LoL's Ezreal or Tristana), and some benefit from both (Akali). Most talents give you passive stat upgrades (+7 agility or +2.2 health regeneration), but others give you a usable skill (temporary invulnerability or immobilize enemy or self heal).   I have only three complaints about Prime World.  1) Matchmaking can sometimes fail you horribly (or benefit you immensely), matching up lesser geared/experienced teams against epicced out players. Mind you, bad matchmaking does not always guarantee a loss for the underdog.  2) Disconnects are an issue. On a good day, all my games go smoothly and everybody has good games. On a bad day, half my games turn into 5v4 or 5v3.  3) My biggest complaint is that all players globally play on the same server, and most are Russian, which leads to ZERO communication. The best you can do is to know the game, know every class, have good map awareness, and hope that your team is as good as you are.  Bottom line: I love this game now. I would say it's more casual than LoL, where people rage on you for being new and not executing your skillshots or timing your CCs perfectly. But then again, maybe they do rage here in Prime World and I just can't understand the Cyrillic alphabet. :)",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually write review but I do you know the game is HORRIFIC! First of all this game's matchmaking time is so long theres a farmvill clone to keep you distracted while you wait for the worst games of your life! Secondly theres a mini-game in one of the maps and its pretty much a maching colours mini game. The sad thing is this generic colour game is SO more fun than the game it self. Furthermore the matchmaking is so and unfair the game is completely broken. This is also a pay to win game because it is technically impossible to buy high end heros to play with unless you can play this sorry exuese of a game for months. I played this game before and i decided to give it another try. When I got into a match no one was speaking english EVERYONE and I MEAN EVERYONE SPOKE RUSSIAN. It is honestly a pain in the rear end to communicate with teamates. I really wonder why this game still exists and many game that are actually worth playing either dead and/or gone from existance.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics - 7/10 - Average - I did not participate in Beta just because of the Graphics, it deter'ed me from playing.  Gameplay - 9/10* - Spectacular~! Note*: However, the game is based off of having good talents which if you come a bit late or party with higher ranked people - It's extremely difficult, sometimes impossible to win. Against your own however, it's damn fun.  Community - 6/10 - The community is pretty ♥♥♥♥♥♥, but if I was comparing to other MOBA's it'd be average 7/8.  Customization - 9/10 - Just play and you'll understand, I'd give this a 10/10 but you can't really customize your Character Looks, nor does 'Castle Customization' have anything to do ingame neither (Like a Strategy Game set-up prior to MOBA).  Replayability 8.5/10 - The game's different characters/classes vary so much that everytime it's something different, each person brings a different build to the table, forever changing, and forever being different. However, it is still a MOBA, you just play it over and over.",
            "review_score": "1"
        },
        {
            "review_text": "I cant even install it it gets an upadate during the patch and it wont fix its self i've tryed redownloading plenty of times untill they fix it i cant recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Such a waste.  Really great game that is absolutely ruined by the worst matchmaking system ever devised. It's already dying due to a matchmaking system that's never been addressed even though the mechanics of customisation and power ratios mean there is already an easy fix that was just never implemented.  It allows top tier purple talent teams to stack against fresh new white/green players. This is regardless of any skill ratio beforehand where it should just tell them 'no match available, reduce power'.  The game has great customisation, great art and unique champions and playmodes. All sadly marred and not worth praising properly due to the glaring matchmaking problem. Coupled with the fact the playmodes are on a rotating basis rather than player choice means you may not even be able to queue for your favourite (or fairest) mode.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was meh. I tried replacing League with this game, but i just turned back to league because of it. It's just got too much going on, and they are in some serious need of balancing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't figure this out like why my queues don't load. It looks pretty but I'm not buying anything if it doesn't work sorry. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "You can afk in base and play puzzle bobble while russians try to insult you. I'd say it's an unique experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a mix of Standard Browser strategy games and MOBA games. Well made, as well. I would definitely recommend to friends.",
            "review_score": "1"
        },
        {
            "review_text": "sucks",
            "review_score": "-1"
        },
        {
            "review_text": "i tryed this just because is was free. was not really happy . guess it is not really me. it is dota more less . problem is there is no info on how to play this game really . you jump into battle and figer it out your self... no one at all talks english. so you or on your own. as for everything els. it is ok if your looking for a dota tipe game but i am no dota fan.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm surprised this made it off of Facebook/phones to masquerade as a proper game. Stick to LoL/DotA and the like. Good ideas, horrible business model.",
            "review_score": "-1"
        },
        {
            "review_text": "This is awsum :D",
            "review_score": "1"
        },
        {
            "review_text": "i have played this game for a while and it sucks now . the match making suck if your blue you can get in a team that all yellow . there is no way to report people how are bots and noobs or afks this is the worst excuse for a game hope the creator gets to fixing this ♥♥♥♥ . ♥♥♥♥ing ♥♥♥♥ im uninstalling this game",
            "review_score": "-1"
        },
        {
            "review_text": "a moba game where you also build a castle in the same way you build a town/village in so many browser/app games.  loot and rpg elements, wich does make it so you can change the way your hero lvls inside a battle, so dont have to worrie about what you need to upgrade in the fight.",
            "review_score": "1"
        },
        {
            "review_text": "If you look forward to no teamwork, people that dont understand what a map is, dont understand focus fire and instead target tanks! this is the game for you! great game just if you have a working team.",
            "review_score": "1"
        },
        {
            "review_text": "My review is about who have more than 1300 hrs played (me), so i really know about what i'm talking.  I like this game, but i stay playing it because its very addictive and i can solve 1 of the principal problem (Pay-to-Win) using my money to put heros strong and winning lane easy because 2 reason: 1) My heros are stronger than others, i paid to win / 2) People are not skilled in this game, with 320 ms ping i can beat players with 20 ms ping easily.  List about problems what need to be solved from developers to do this game something equal to all players:  - Have too much bugs and Overpowered heroes (who can kill you in like 1 hit or heroes too powerful on lane phase who can make other heros go to base all game and being underfarmed) and some half-useless heroes too;  - Have a lot of problems to reconnect: If you lose your Internet Connection for 3 minutes and try to back to the game, you can't;  - 30% of the players are abble to Trolling the game and they can do it because the fail actual raiting system (per hero). Developers can fix it doing changes on Raiting System, making it on Unique Raiting (per player), like in Dota 2, but they don't want to improve their game and the penalty to trolls are like inexistent and if people want to avoid trolls receive 5 minutes on penalty;  - Barrier language (95% are Russian/Ukranian players), and have no integrated translator to help about full communication;  - The Talent's upgrading system is PAY TO WIN;  - You need to pay about anything you want to change (Ex.: Unassing talent to put on another heros);  - If you want to get Good talents, prepare to PAY!;  - This game have server only in Europe (Netherlands), and he's not Supported to use WTF Fast Private Network, and the developers don't do anything about it... WTF Fast can fix the LAG problems on this game, but it is not available to players;  Then, if proplerly changed, this game can be nice.  Atm, the best moba is Dota 2.  PS.: This game need Private Network (WTFast) to change the problem about lags and need to be reworked to be like Dota2, in Dota we pay only to get Cosmectics, not to do interferences on gameplay (on Prime World 1 player who spend money have better talents or upgraded talents while other doesn't have it). To be strong on decent mobas, you need to farm creeps/jungle or kill heros/going assistences, not using money!  That's my tip.",
            "review_score": "-1"
        },
        {
            "review_text": "this is totaly trash game wen you se the price of the heroes what curency you get you gonna stop playing this game",
            "review_score": "-1"
        },
        {
            "review_text": "BEST MOBA ever... slight ping issues but best gameplay and depth",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "A nice alternative to DOTA 2 and League of Legends and posssibly more fun than both.",
            "review_score": "1"
        },
        {
            "review_text": "worst moba i've ever played.. the balance between heroes doesn't even exist,, Wondered many times during the play that do the developers even test the heroes. I played 2 games and instantly removed it. Don't waste your time in this game. The talent thing is bunch of horse **** melee heroes against ranged have 0 chance of killing because u cant by boots or shoots what ever so try to run and get your enemy :DD no flash or anything. Some melee heroes lack too much mobility which makes them useless. Devs pls think more how your game actually works before publishing something that could never beat other games like LoL or DotA, it's the year 2015 and some people still dont think much hahah",
            "review_score": "-1"
        },
        {
            "review_text": "Ready Classic but good.",
            "review_score": "1"
        },
        {
            "review_text": "In extreme shame watch as a worthy interpretation in the MOBA genre was transformed into red-yellow g n o th.",
            "review_score": "-1"
        },
        {
            "review_text": "There are many great MOBA's out there.  This is not one of them.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a gay game made for ♥♥♥♥♥♥♥♥s",
            "review_score": "-1"
        },
        {
            "review_text": "Better then Dota 2!",
            "review_score": "1"
        },
        {
            "review_text": "Even playing bots you have to have an internet connection. If you have any problems with your internet don't get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "decent i guess.. but just another league of legends copy with a twist and i cant stand that game.. plus this one seem to crash on my machine randomly for some reason.. i know its not my computer cause all my other games that r even more demanding run fine",
            "review_score": "-1"
        },
        {
            "review_text": "This game make by russians. Playing by russians. And ♥♥♥♥ by russians~!",
            "review_score": "1"
        },
        {
            "review_text": "This game is honeslty a joke. You can play Minigames in the MOBA, MINIGAMES! While you're doing that you can probably get better items from the gold you get killing creeps. Its like if you put a flash game into a ♥♥♥♥♥♥ Dota, then you get this piece of ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game I used to play LOL but I found their unique design to be much better! Just make sure to join a guild if you want to be competative early on! You have to farm your abilities!!",
            "review_score": "1"
        },
        {
            "review_text": "Gr8 m8, I rate 8/8. Not to sound ir8 but, John and K8 plus 8 diserved it's F8.",
            "review_score": "1"
        },
        {
            "review_text": "Rest in R.I.P !  The minigames are the best part about this game... Why did I even waste my time playing this?",
            "review_score": "1"
        },
        {
            "review_text": "Biggest pay to win game I've ever seen. And the queue times are terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Not that great really, LOL or DOTA is better",
            "review_score": "-1"
        },
        {
            "review_text": "wtf even i cant even potato",
            "review_score": "-1"
        },
        {
            "review_text": "An interesting game for sure, not only that you have two different games in one, but you can also get wrecked by level 1 player who thought he wants to sponsor the game and hired a hero for level 70 or higher (for real money of course). If you put that fact aside, it begins to get interesting - the game throws at you its two parts. Your castle (a base from which you manage battles, quests, building commands,...) and the battlefield itself, which changes depending on what mode you want to play - a pvp? Co-op? Pvp co-op? The game has it all. AND if its not difficult enough for you, you can alwys raise up the difficulty on the co-ops. The more you play each hero, the better it gets. Ability system is absolutely different from any other moba - you collect items which work as your hero´s abilities - sure some heroes are limited to some abilities, but by destroying other items you can upgrade the one you chose (making it VERY effective by the time you get to know what to do with it, and mainly when to activate it)  11/10, would DotA again.",
            "review_score": "1"
        },
        {
            "review_text": "hmm...... nothing special",
            "review_score": "1"
        },
        {
            "review_text": "As many reviewers have stated previously, the balancing in this game does need to be adjusted. Also, the pacing is clearly geared towards those that pay for additional help in game. I can already see that the pace is slowing down the longer you play and advance. But for a freemium title it isn't all that bad and is good for killing a few minutes when you're bored.",
            "review_score": "1"
        },
        {
            "review_text": "It wanted me to write a review for the game, which means I must've played it......but I dont remember playing it....must not have been that good of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "start of review   1 word - garbage -  end review - live long and suck it",
            "review_score": "-1"
        },
        {
            "review_text": "good game in the genre of MoBo))",
            "review_score": "1"
        },
        {
            "review_text": "Great",
            "review_score": "1"
        },
        {
            "review_text": "Good game to take your mind off of League of Legends and Dota 2.",
            "review_score": "1"
        },
        {
            "review_text": "I'VE HEARD GOOD THINGS. HAVE NOT PLAYED YET BUT LOOKS GOOD.",
            "review_score": "1"
        },
        {
            "review_text": "This game combines 2 different types of games.",
            "review_score": "1"
        },
        {
            "review_text": "Can play as a dota character.",
            "review_score": "1"
        },
        {
            "review_text": "13/37",
            "review_score": "-1"
        },
        {
            "review_text": "Very entertaining, but very challenging!!!",
            "review_score": "1"
        },
        {
            "review_text": "This review contains my past and present reviews of the game (sorry I couldnt put the future part in but I didnt wanna spoil anything for anyone) so you could see if the game has been consistent over time (with my opinion at least). The past review was written as I re installed the game and the reason im re installing is beause the game sent me an email saying im getting a free hero lol and I like free stuff. Oooh and ty for reading this :)  When I used to play this game It was fun to me but the only bad things about it was the long queue times and the different languages everyone but thats really all I remember about why I uninstalled it(there couldve been more but there could be a lot more) Something I do remember a lot of was positives :) The reasons why I liked this game so much was because of how different it was from other moba's and how much you could do. It was like a mix of clash of clans without having to upkeep everything and comeback everything and a simpler version of LoL with nice graphics. Overall it was a nice game but I just didnt have enough time for it. Maybe a 7/10~My thoughts of the older versions of this game.  Under construction yet lol~My thoughts of the newer version of the game.",
            "review_score": "1"
        },
        {
            "review_text": "fun MOBA has a few different features making it worth playing",
            "review_score": "1"
        },
        {
            "review_text": "Well... I really want to recommend it cause it might fix some of the issues with the game, but I cant. The game is great in theory, but it takes way way too long to get into a battle, and when you finally do get into a battle, there is nothing to keep people from just ditching if if goes badly. So since it takes so long, people just ditch at the first sign of trouble and queue up again. I like the concept, but it needs some serious adjustments if its going to become fun.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is a comletely joke. it can take up to 30min to find a session, and its just boring. nowone play it. its free so you can try it, but it is wasting of time.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing this on and off, coming back to the game to check out any new features... The game, while in early beta, was at a stage you'd expect the game to be in, slightly unbalanced, since they didn't have a lot of players to get feedback and stats from, but from there it went downhill. The game became more and more a money-♥♥♥♥♥ and they then tried to get old players back by giving them an ABSURD amount of premium currency. The game itself has gone downhill from there, as the balancing has been thrown more off... some heroes are stupidly overpowered, while others lack so far behind, they can barely kill creeps. The game can be won singlehandedly by a select few heroes, even if the rest of the team is so far behind, they are but a breeze...  Besides that, the game itself lacks pace and music, in other MOBA-games, you do not feel like falling asleep after 10 minutes has passed. If you ejoy watching master chess players with infinite time playing, along with watching paint dry, this is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "good for peole who like a good moba and strategy game",
            "review_score": "1"
        },
        {
            "review_text": "xD - great game.",
            "review_score": "1"
        },
        {
            "review_text": "Farmville meets League of Legends.  I'm an avid Dota player that started hitting a bit of a slump in the game so I decided to check out other free to play mobas. There's a lot of 'little' things I could rag on about this game in how it's somehow meant for casuals but the skill tree feels like I need a Masters degree in WTF DOES THIS ACTUALLY DO in order to figure out a lot of the random stats and buffs.  Lag is a huge issue in most games, primarily because I'll be the only American in a game with 9 Russian/Eastern Europeans so obviously I'm really only playing on Eastern Euro Servers.  Overall I enjoyed myself most of the time. It helped me appreciate Dota a lot more and the games felt really chill.",
            "review_score": "1"
        },
        {
            "review_text": "Love don't hate",
            "review_score": "1"
        },
        {
            "review_text": "Inspired by LOL, yet somehow feels totally uninspired.",
            "review_score": "1"
        },
        {
            "review_text": "good strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "At the start it looks pretty good it's a moba with a lot of customization, but it greatly fails at keeping the balance. You can add new active skills to a hero, and you define most of its stats ,well here comes the twist the rarer skills (grinding, luck) you use the stronger your hero will be and the matchmaking fails hard at measuring a heros power.   In most matches you either steamroll the enemy or you get steamrolled yourself..... I consider that a waste of time but it's up to you to try it for yourself or let it be forgotten forever!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is your average competetive pvp game like Dota 2 or League of Legends.   The matchmaking in it is fair. Several game mods. And of course a pretty decent community who are ready to help each other!  Uncommon is that you can build up your own village in which you generate silk and mushrooms etc. Later on you can generate skills for your heroes.   Try it out for yourself! It's pretty decent I gotta say and still lesser known.",
            "review_score": "1"
        },
        {
            "review_text": "TRY IT",
            "review_score": "1"
        },
        {
            "review_text": "this is the best moba ever .. suggest you try it out .. so much fun ... hit me up in game .. Ruggedy",
            "review_score": "1"
        },
        {
            "review_text": "This is a super fun MOBA for what it is. This is the first MOBA I have played and it is still fun. Although not as polished as League, it has better graphics and is akin to DOTA.",
            "review_score": "1"
        },
        {
            "review_text": "Some games you just need to buy for them to be good. Even though it says 24 hours gameplay time, that was just the download time honestly. I played for about 36 minutes, and even then the game was hard to understand. 4.5/10 I do understand it is a MMO game, so you can't expect a lot of things from it...",
            "review_score": "-1"
        },
        {
            "review_text": "Nival should stick to making tower defense games.",
            "review_score": "-1"
        },
        {
            "review_text": "Stick to dota. This game's code stacks matches so that regional players from Russia / Ukraine always have an advantage.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad ping and only russian players.",
            "review_score": "-1"
        },
        {
            "review_text": "The 2 worst possible game types, combined into one.... plain horrible.",
            "review_score": "-1"
        }
    ]
}