{
    "app_id": 235320,
    "name": "Original War",
    "release_date": "2014-01-27",
    "developer": [
        "Altar Games"
    ],
    "publisher": [
        "Bohemia Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Real-Time with Pause"
    ],
    "achievements": 22,
    "positive_ratings": 923,
    "negative_ratings": 66,
    "price": 3.99,
    "description": "An American geological expedition, under a UN mandate, assesses the natural resources in a distant part of Siberia, deep in the trackless steppes of Eastern Russia. But instead of oil, they discover a deposit of a hitherto unknown mineral.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235320/header.jpg?t=1521642344",
    "minimum_requirements": "OS: Windows XP/7/8/10 Processor: Intel Pentium® III - 900MHz Memory: 256 MB RAM Graphics: OpenGL 2.1 compatible with alteast 64 MB of VRAM Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Pentium® IV - 2GHz Memory: 512 MB RAM Graphics: nVidia® GeForce™4 - 256 MB Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "I have purchased Original War three times; first in a bargain bin in 2002, then on  gog.com  and finally on Steam. Let me tell you why this is one of the finest RTS games ever made. A truly exceptional example of the genre but mainly for reasons that set it apart from most strategy games.   Let's talk about what it does that may not be so different but is instead allows us a comforting familiarity with what we've come to expect from Sci-fi RTS games. As is a staple of the RTS Genre the single player comes with two campaigns, a Russian and American/NATO campaign. There is the cliché'd sci-fi super-rare-new-resource, and of course it's a green crystal.   What sets Original War apart from most RTS games is... Well, quite a lot actually. For one; it's set in a world where time-travel is possible. Russia and America are vying for control of a new-found substance called Siberite (known as Alaskite in the Russian campaign.) Both superpowers decide to use time travelling machines to go back and move all the green-glowing-good-stuff to their respective territories, so that when the future comes around they'll already be in possession of every valuable deposit of said resource. For the soldiers embarking on this mission; it means a one way trip. Speaking of soldiers...   Throughout the story you'll be given a single protagonist (American's get Macmillan, Russians get 'Gorky') and if they die, it's game over. The rest are cannon fodder. Likeable cannon-fodder. The problem with liking these human meat shields is if these characters die, that's it. They don't come back. Given that each character has stats based on what you had them do most (building vehicles, constructing fortifications, shooting enemies, or researching space-time anomalies) they get better at it through an EXP system. Even if you don't find yourself liking their dialogue (impossible), you sure as hell will miss their efficiency. Certain characters dying affects the story too, sometimes in a grim way (this is true of both campaigns).  This is but a brief overview of the game, there's a lot more off-the-wall design elements you should experience for yourself and for it's price, Original War will not disappoint. It's difficult to find anything to dislike; The RPG elements are unobtrusive, the cheesy dialogue is heart warming and with memorable characters such as Colonel Powell and Lisa Lawson (to name but a few) I cannot reccomend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I ever played,  excellent gameplay and great story . I definitely recommend to all RTS fans.  I give maximum rating ...  10 / 10 from me, for this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games you have never heard of. The story is very unique and overall fun to play. For $5 you can get many hours of gameplay with an active community despite the age of the game. Oh yeah it still gets updates and has higher resolutions available.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  Pros: Great RTS gameplay. Perfect for both casual and hardcore gaming. Features time progression control: can go faster or slower depending on the current situation. Intriguing although very silly storyline.  Cons: The AI, both your units and NPs, is finicky. Sometimes they are very smart and comparable to modern sophisticated AI. While at other times they are dumb as could be.",
            "review_score": "1"
        },
        {
            "review_text": "A mix of Jagged Alliance and C&amp;C. I like it. You can give orders while paused ! :)",
            "review_score": "1"
        },
        {
            "review_text": "My favourite game which is like an old lover... it just keeps coming back! I had been playing this game even before I got a stable internet connection (was using dial-up modem) and spend hours and hours every single day... Because it was and still is THAT AWESOME!  My guess? RPG + RTS met in a bar, got drunk and gave birth to this little marvel.  The graphics are not great for today's general public taste, but the gameplay and attachment to the characters... Priceless!  Unpopular due to lack of advertisement, though it had been scored very high in top gaming magazines at the time all these years ago. Only problem was the dubbing... English is, umm, slightly worse than any of the local versions, which were available in 2002...  BUT!!!  There was an amazing update... which added full Czech, Polish and other dubbings, which were like a core thing... like a soul for this game... and now IT IS COMPLETE! :D  Anyway, I encourage anyone hesitating to buy this game. It IS worth it.",
            "review_score": "1"
        },
        {
            "review_text": "decent game play in sum respects better than a few newer games this game makes you focus on keeping your people alive and not just spawn units till you overwhelm the computer player",
            "review_score": "1"
        },
        {
            "review_text": "13 years after release - still original and great!",
            "review_score": "1"
        },
        {
            "review_text": "A great combination of RTS and RPG. With a nice original story taking place in the far far past. The whole thing becomes even more interesting in multiplayer as all three sides are very different and apply different tactics.   A pity the planned arabian datadisc never came out (officially, one can play the mod version), but you can still enjoy the US and Russian campaing which allow you to see the conflict from both perspectives and enjoy the twists and turns temporal travel has on history.",
            "review_score": "1"
        },
        {
            "review_text": "I just love this game. I first time played it soon after release and till today I still enjoy it even after completing it like 20 times or more per side.  It has interesting story. Nice dialogues. Very uniqe game mechnics ie. you don't play to swarm your opponent. Here every character counts. Every decision have influence on future missions.",
            "review_score": "1"
        },
        {
            "review_text": "Great strategy game. It's not like a RA2 or other C&amp;C game. Most important unit in game is HUMAN. You need them for 'almost' everything. So there is RPG elements too for your characters. Game has SP and MP too but without skirmish, because there is no AI in this game. All 'AI' is scripted in SAIL programming language. This game with skirmish could be the one of best strategy...  A pro čechy, stáhněte si český dabbing, hra má jen české titulky. :)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 great value, pretty unique game with good story line",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever made! 10/10. Worth buying it. Totally.",
            "review_score": "1"
        },
        {
            "review_text": "This is an absolute fantastic strategy game with awesome and entertaining campaign. Very unique story. I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Trained an ape to kill my best friend. Then did it all again in the next map. He built a tank and i killed it with ape people.  10/10 would destroy my best friend with monkeys with assault rifles again.",
            "review_score": "1"
        },
        {
            "review_text": "For me this is one of the best and unique RTS games i ever played",
            "review_score": "1"
        },
        {
            "review_text": "Original war will never be all time classic outside its hard fans, but if you like resource oriented hard strategy with RPG elements and fairly solid wibly wobly timey wavy storyline, search no further!",
            "review_score": "1"
        },
        {
            "review_text": "After many years this game still looks gorgeous. Story is unique for each faction and allows you to see the conflict from each side. Graphic is hand-drawn that makes this game not being ugly after many years. I'm sure that if someone is a fan of real RTS games, not the new one RTS type, then he will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "An ingenious take on the rts genre, with each unit having its own portrait, name and personality, and a set of basic skills they develop along the way. A one of its kind game that is still as enjoyable as it was when I played it first many years ago. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game when I was younger I still have the box , but one of my discs was gone so happy this is on steam. The only thing that would make this game better would be comp stomp mode. People are thee most valuable resource you will have. 5/5 *****",
            "review_score": "1"
        },
        {
            "review_text": "Game where death of unit is so real and crucial.  I love difficulty of this game. The AI punishes you hard for mistakes you make at the end of campaign.",
            "review_score": "1"
        },
        {
            "review_text": "If you did play at least one of these legendary games listed below in your time, you'll probably be thunderstruck by this game's dynamics and scenario:  - Dune,  - Command &amp; Conquer - Jagged Alliance,  - Battlecry 3,   This game is a true gem!",
            "review_score": "1"
        },
        {
            "review_text": "I got this game back in 2001. Im re-playing it every year. I love it in phisical way.",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game has good mechanics, a nice gameplay&amp;story, your choices makes you wonder if it makes a difference, and yet it really does. Limited infantry, once dead, stays dead. I really recommend this game to those who likes hard strategy games.  And community is still active, all the mods are up to date and well-done overall.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, good story. Keeps crashing over and over and over.",
            "review_score": "-1"
        },
        {
            "review_text": "People can't move more than a walk away from gunfire Well, at least it runs at a silky smooth 5 FPS",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry, but the difficulty is ridicolous. You don't have a chance to play without safescumming. The first mission: You get told to get out of 'there' and 2 seconds later somebody shoots you. Reload. And there is only one place to hide. LOL",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty nice game and I had a nice experience playing. Thanks Steam!",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever, crashed only once. Can't turn it off since then. 6.9/11",
            "review_score": "1"
        }
    ]
}