{
    "app_id": 235600,
    "name": "Tom Clancy’s Splinter Cell Blacklist",
    "release_date": "2013-08-23",
    "developer": [
        "Ubisoft Toronto"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Stealth",
        "Action",
        "Co-op"
    ],
    "achievements": 0,
    "positive_ratings": 10016,
    "negative_ratings": 1982,
    "price": 16.99,
    "description": "The United States has a military presence in two-thirds of countries around the world, and some of them have had enough. A group of terrorists calling themselves The Engineers initiate a terror ultimatum called the Blacklist - a deadly countdown of escalating attacks on U.S. interests.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235600/header.jpg?t=1452184790",
    "minimum_requirements": "OS:Windows® XP (SP3) / Windows Vista® (SP2) / Windows® 7 (SP1) / Windows® 8 Processor:2.53 GHz Intel® Core™2 Duo E6400 or 2.80 GHz AMD Athlon™ 64 X2 5600+ or better Memory:2 GB RAM Graphics:512 MB DirectX® 10–compliant with Shader Model 4.0 or higher DirectX®:9 Hard Drive:25 GB HD space Sound:DirectX 10–compliant DirectX 9.0c–compliant Additional:Peripherals Supported: Windows-compatible keyboard, mouse, headset, optional controller (Xbox 360 Controller for Windows recommended). Requires UPLAY account.",
    "recommended_requirements": "Processor:2.66 GHz Intel® Core™2 Quad Q8400 or 3.00 GHz AMD Phenom™ II X4 940 or better Memory:4 GB RAM DirectX®:11 Hard Drive:25 GB HD space Sound:(5.1 surround sound recommended) Other Requirements:Broadband Internet connection Additional:Peripherals Supported: Windows-compatible keyboard, mouse, headset, optional controller (Xbox 360 Controller for Windows recommended). Requires UPLAY account..",
    "reviews": [
        {
            "review_text": "OK... given my playtime now, I think it's finally time for my review. No plot spoilers. A proper review would take a look at all aspects, but I don't have much time so I'll be brief.    The Good - Singleplayer",
            "review_score": "1"
        },
        {
            "review_text": "Is this game better than Chaos Theory or Double Agent? Not quite, but it does give the splinter cell series another variance, or at least a build off of Conviction.  The first probable thing the player will note is that Michael Ironside, the original voice of Sam Fisher is no longer in the game. This is brutally apparent as the new voice actor is simply way too soft and cannot be taken seriously. What is sort of nice though, instead of walking around in a warehouse like in double agent, Sam is now on a giant airplane which is his new mobile air base. This essentially is the RPG element to the game. You may update everything from your inventory, to your suit, even to the airplane adding special GPS features or infirmary upgrades. The main map table the player is able to approach allows the player to choose single player, co-op, or multiplayer game modes.   The story revolves around terrorists in which every few days they activate a new doomsday type of scenario (poisoning water, remote explosive, etc...). The pitch here is that Sam is to prevent the doomsday before occurring. Old faces prod up such as Anna Grimsdottir and new characters also join the team. At one point in the game, you switch from Sam's 3rd person view to his partners, Isaac Briggs first person view (there is also first person view in multiplayer spies vs mercs). The story is interesting and does provide good plot points, but I can't help feel it's a little corny at times.  The  game play  seems like a cross breed of Conviction and Double Agent. I like the game, but it seems like sometimes you can simply rush through and shoot anyone. Not certainly a bad thing as Sam Fisher is quick to shoot, but it went from a fear of being spotted, to now simply bouncing from cover to cover. The cover system is neat and let's you plant yourself where you want to be with a simple look (using the right thumb stick) and pressing A to initiate the action. Blind fire like Gears of War is available and outlines of where enemies think you are, show up when you move to another spot. Technical aspects such as these exist in the game with the complement of Sam's gadgets such as sticky cameras or grenades. The game play it alright, and feels sort of boxy and restricting at times unlike the other Splinter Cells. Lethal and non-lethal take down options are available and hiding the bodies (or throwing them for that matter) sometimes becomes fun and easy. Throughout the game, Sam receives cold hard cash depending on his performance on the mission. This money can be used to unlock further gear, guns, or gadgets that suit you. Sam's movements are smooth, but I feel Double Agent just feels a little better than this one. I like the three combat system score they have in game. Panther (silent kills), combat, and stealth all make up your unique performance. At times, you will feel Sam can take on an entire army. Then there are times where taking on a guy with armor suddenly becomes tricky. Stealth is still here, but it isn't as authentic as it was in Chaos Theory or the first.  The  sounds  and  graphics  are good. You will hear Sam make his usual remarks throughout levels. Side commentary relevant to the game, especially when Sam's calling out there's dogs up ahead, is certainly helpful. The menu music to background music is good. When you get caught though, it isn't as suspenseful as the first SC. They tried nailing every little last piece of sweat on everyone's face.  Sounds  are appropriate as multiple gun types are available. It's nice to hear a silencer do it's job or an AK go off and alert everyone in the vicinity.  The only way they could have made this game better (from the rating I'm about to give it) was to add a LOCAL co-op feature. I'm not sure why everyone thinks no one plays video games together anymore, but adding that would have been an astounding addition to the game. That, and getting Michael Ironside back. He literally made Sam Fisher who he is today.  Rating : 7.8/10.         Gameplay   B+     Story / Campaign   B+     Visuals / User Interface   B+     Sounds / Music   B     Replay-ability   B+     Overall    B+     Would recommend a buy on sale, it's a good game with a lot to do, but I feel previous Splinter Cells had much more ingenuity put into them. This feels like Conviction 2.0 + DLC. It does provide, however, a lot of replay-ability. Multiplayer, co-op, and singler player should keep you occupied just enough. It would have easily hit a 8+ with local co-op.  ***I should add, indeed you need uPlay, but if you take a second and set it up properly, you can run this game through steam without a problem. Again, yes, it's uPlay... but this is definitely a game worth  setting it up  for!   ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": "An Amazing game in the Splinter Cell Series ,    Gameplay : Some controls i dont like , but thats for everyone different , it has full controller support (XBOX 360) which works out really nice ,  they brought lots of features back that they didnt have in Conviction , like Carrying bodys , whispering to lure enemys , good combination of the previous Splinter Cell Series ,  and they added a new difficulty , Perfectionist , which is a great enjoyment :)  Story Line : Good, Because of the lack a bit between Sam Fisher in Conviction and Sam Fisher in Blacklist, im also not sure how they made the connection , i heard they wrote a story but i would still have to read it , for the rest i cant write much about it since i havent yet completed the entire story line at writing this at 02-02-2014 ,   Side Missions , I think they are good ,not sure since i havent played em yet  Costumization of Weapons and Sam Fisher , Agent / Merc : Great , you can atleast use the Scopes now , costumize weapons easily to your requirements , and their are many kinds available , which is very good :) , also you have 3 diffrent weapon types , Pistol , Secondary (Assault Rifle / Sniper such ) , and Special weapons like the Stun Gun or the Crossbow / Tactical Crossbow  and the Agent (In this case Sam Fisher in Story Line) , you can costumize his suit in Stealth , Armor or Ammo Cap which was shown in Conviction but not as Advanced as this one   Visual Quality : Great, the levels designed , the quality of the Weapons are very nice  Sound Quality : Great , voices , weapons everything sounds good  i do recommend this game , for anyone that loves Stealth , Action , and a good story line  AT - written at 02-02-2014, 14:44 GMT+1  Edit 12-02-201416:33 GMT  Played out the Story Line on Perfectionist , and aswell the CO-OP Missions are great , Great story , thanks to the creators , this is a great game , i will seriously recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Tom Clancy's games are amazing and if you never played one of them, you are missing ALOT.  He has alot of Game series like: -Rainbow Six series -Splinter Cell series -Ghost Recon series and more... Since this is in Splinter Cell series, I would say this is one of the best games of Splinter Cell series [writting in 20 of March, 2015] Maybe my computer is not the best and can't handle the game very well, but I am enjoying it because I am playing with my friends, or just enjoying how they made the game.  Singleplayer and Multiplayer are very nice, no delays, very good. Oh yeah, forgot... In Singleplayer and/or Multiplayer, sometimes it happens that bodies of Enemies/NPCs Breakdance on ground when killed x'D. And sometimes it happens, that when you kill someone, he continues standing in the position that you killed him [for example, if he is standing and shooting at you, and then you kill him, he will continue standing, but he is actually dead... just standing .. lol]  Doe, there is nothing much more to say, this is an awesome game, one of the best Stealth/Action games made... atleast for me... Buy this if you have a chance, or on discount! :)  Rate: 30/10",
            "review_score": "1"
        },
        {
            "review_text": "Uplay is cancer",
            "review_score": "-1"
        },
        {
            "review_text": "I don't get why so much hate on this game just because of Uplay, I've played it perfectly fine and Co-op is a blast! All you have to do is just connect to uplay to play the game, thats all. Nonetheless the story is okay and it has co-op in some of the story campaign. Whether you want to play it yourself or with your friend. The game uses slight micro-transactions, but that doesn't affect the game since you can use your money earned from any finished missions. You can also earned money by shooting the security camera or take out lights which is kinda cool I guess. The gameplay is solid to the original Splinter Cell and no doubt this game is worth your money. If you want a third-person stealth game then this is for you. I can't recommend enough",
            "review_score": "1"
        },
        {
            "review_text": "I am a normal human who is not some super games geek who plays at tough levels. I play 1-2 hours a week, I like games which are cool, run quite well and feel contemporary-ish in terms of plot and action and move along at a fair pace. This game rocks.",
            "review_score": "1"
        },
        {
            "review_text": "Oh dear, after so many years and when I stared at how much time spent on this boy, I guess its a time to write a review.  First of all, I take game developments and maintenance seriously. So based on my experience I won't suggest you obtain this game unless it's on sale or you can play the cracked version because the multiplayer is BROKEN. Yes, it's all in caps like I'm very serious. The only part that is broken, is the anti-cheats. When the game was out, it was hot and popular, but the competitive multiplayer mode was a sheyt-hole. So many hackers that I spotted that I can literally say everyone was probably hacking (me 2 ;] cuz everyone was hacking). This phenomenon totally destroyed the PvP experience. Wall hacking, super-speed, there were even hacks that I don't even know what it is, like I was a redneck in a apple store and my mind blown. Enough notions for that, since a PvP without anti-cheat sound horribly enough.  BUT.The co-op mode was one of the best experience I've ever had. Since TCSC series have always been a thrilling spy-action title, playing with your friend is awesome that will make you tities hard as rocks. I'm just implying the intense moments the game will give you. The story is absolutely amazing, I have never read the original Tom Clancy's novels but playing something like 'Mission Impossible' or 'Bourne Series', special agents, spy, fancy gadgets &amp; equipments, never gets old. Even sometimes my brain can't really catch up with the 'intellectual' conversations sine English is not my first language, but all it matters is the momentum. Not to mention Sam Fisher looks perfect for a agent even his face changed a LOT, I remember I was questioning if they changed the main character when I saw him in Blacklist for the first time.   Above all, I always love the spy titles, and TCSC has always been nice stealth games. Despite the bad efforts on PvP maintenance, this game is good to play with a best friend (yes two players only in co-op) through the whole campaign. I might just play it again, just for fun.  Post edit:  I mentioned PvP was not satisfying, but the PvP design is unique and amazing (subjective), I wouldn't say it is well balanced since they never updated any PvP content or a major fixes. (may contain spoilers) Playing in two factions as Merc or spy sounds awesome and looks amazing. Mercs literally looks like badasses and beefy and limited with first person view, Spies look very slickly in terms of the armor design and the weapon specifics, stealthy black-shadow with high-end gears attached and with third person view only. Spies can instantly kill a Mercs just like you would do in the single player mode, if you handle the kill with good timing because with proper responds and/or cooperations Mercs can counterattack in the close range combat. Only dropping from a higher ground or ledge kill cannot be reversed. Different weapons and modifications make the PvP mode even more interesting, both Mercs and Spies have a special view, different types of radars (thermal, motion-tacking, sound detecting, etc.) supporting Mercs on spotting or locating Spies, different goggles (electronic, sonar, thermal) are provided to Spies as well. PvP mode is sure, very competitive and intense, for me it was all about my skills and techniques, and how slippery or sharpen you brain react. It is very easy to get paranoid while playing as Mercs since your vision is limited, and you can get cocky and shot in the back because of taking too much advantages while playing as Spies. Even though the game is old, the server is still activating, you can still find a lobby with bunch of hardcore fans still playing. I would say that is a conscientious move of Ubisoft, even you will still get rekt by hackers. lel..",
            "review_score": "1"
        },
        {
            "review_text": "Sooo, the game itself is amazing, I like the story, the gameplay and graphics, however due to UPlay, the game is unplayable. What does that mean?, it means that the game will not connect online, making coop and multiplayer useless, as well as any DLC that you might have bought, although it says it does, the game will crash exactly every 30 or so minutes (google it) due to several errors that are related to DX11, which is not true, since if you switch to using DX9, it still does the same thing. There are some fixes around that work here and there, and they are aware of the problem (supposedly) but do nothing about it. The achievements you get do not count as actions and are not cosidered through Uplay points. If you try to play the game offline, due to the beauty of Uplay, it won't save, so once you leave, you will have to restart everything again. Oh, and also their tech support is very dissapointing. My reply to the problem, was that because I use a laptop graphics card (NVS 5200M), it is not supported so tough luck, ticket closed. My recommendation, DO NOT BUY.",
            "review_score": "-1"
        },
        {
            "review_text": "Strong return to form for the Splinter Cell series. Some over-the-top locations drag down the believability, but the gameplay is rock solid. Rewards players who meet it halfway, though.",
            "review_score": "1"
        },
        {
            "review_text": "In my mind the words Ubisoft and Uplay have become synonymous with Broken and Terrible. I bought the game over 3 months ago, and I am yet to finish the introduction because the game crashes at a specific point. Ubisoft support have run me around in circles and dodged questions. They don't care, because at the end of the day they've made their money and they move on to their next broken PC port 'cough' Assassin's Creed 'cough'. Everywhere on forums people are having issues, DO NOT GET THIS GAME, unless you want to be robbed of £15. To be honest, there is probably a crack version out there that works perfectly. Screw Ubisoft, screw Uplay, the fact that this game remains broken after nearly 2 years show that steam are happy to sell a broken product as long as they make money and don't suffer a backlash. So to sum up, go buy something else, as long as it's not Ubisoft.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic addition to the series, I personally disliked Conviction after changing so much what was great from the older SC games.  This one thankfully returns to the stealth roots, although it does allow those COD gamers to 'pew pew' there way through as well. However best way to play this is as a ghost and stealth your way through.  There are a couple of times where you are forced to act like a John Rambo wannabe which is annoying, but thankfully the rest of the game makes up for this.  Top notch graphics, good difficulty scale, story is largly forgettable but is enough for you to play it through.  Co-Op mode is a nice addition as well, just as long as you have mates to play them with as randoms all seem to be 10yr old COD players. Shooting everything in sight and alerting all the guards.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "i had no problem downloading the game but whenever i log into uplay it gives me a message saying 'A Ubisoft service is unavailable at the moment.' and i cant even activate my key to play the game offline",
            "review_score": "-1"
        },
        {
            "review_text": "'Amazing coop experience in 30 fps 720p glory' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "I miss Michael Ironside. The new actor here that plays Sam sounds way too young and doesn't fit the charater at all. I'm not saying he's bad. In fact I would have been really impressed with him if they decided to completely reboot the franchise and have the game take place earlier in Sam's life. Also the story is probably the weakest in the series but it's presentation is excellent.   Those are my only gripes. Period.  This game is the greatest stealth game I've ever played. Play it on perfectionist and ignore the other difficulties. The gameplay is perfect. The level design and gameplay alone will keep you coming back again and again for more even after you've finished it. Also I think it's a nice touch that the guard patrols and spawns in the side ops change up a bit if you restart or fail. This game will make you feel like a sneaky badarse and hate your real life unless you are already a ninja.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome for stealth lovers, i recommend this game to all who tried hitman and other sneaky stuff, splinter cell is a well known franchise in gaming's most famous titles and in addition this newest game by Ubisoft, titled Splinter Cell: Blacklist... well the gameplay are epic... much customization and we could master our own style of play.  The bad part is... everythime i play onlone... there seem to be no one there... its like the multiplayer has no players in it.  My Rating 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Combining some stealth mechanics of Chaos Theory with some awesome set-piece executions with the Conviction mark and execute system makes a great game worthy of the Splinter Cell name. My only complaints would be Michael Ironside not retaking his role as Sam Fisher. The new voice actor Eric Johnson looks a lot like a younger Sam Fisher, but his tone makes him sound like a 30 year-old when Sam at this point is in his 50's. Other then that its damn good. It may not have the say amazing stealth gameplay that Chaos Theory had, but at least it does not over the top action like Conviction.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A good campaign, and good fun co-op but when you go online, some reason some of the controls change and it feels weird  The graphics are pretty decent. Not amazing and certainly not bad. Easy ultra this game. Controls are annoying and keyboard and mouse is complicated for me some reason.  I have played ALL splinter cell games and enjoy them but this one I found the trickiest with the controls for some odd reason. The audio usual spot on to the key, and has no issues.  The campaign is really good and decent fun to play. The co-op is good fun provided you have good players with you. The multiplayer is where ALL the fun is. It can be extremely annoying playing your first time because you die so many times, no matter what your rank but you play more and more and become good and enjoy the game, even more for what it is. (I even have a Twitch video of myself raging at dying all the time)  Anyway is the game worth it? Yes. It is Splintercell grown up, with more toys and gadgets and updated, and now that co-op and multiplayer has been added to a more adept game, it is worth the money and time you put into it :)",
            "review_score": "1"
        },
        {
            "review_text": "So, I had a pretty good time with this game. I only have a few issues with it.  While it is far more reliable (crash speaking) than any other splinter cell game that I've played, I ran into some glaring balance issues while working my way through the campaign. I realize that I'm not the sharpest gamer in the world, but the fact that completing Normal difficulty was neigh on impossible, with more 'checkpoint' reloads than I care to admit to, I will likely not be making an effort to complete the game on any higher setting.  On the note of checkpoint reloads, have developers forgotten that we're on a PC platform, and have access to an exponentially higher capacity hard disk than exists on consoles? Checkpoint saves are mind numbing, especially when the checkpoint is spaced so far behind where you are, and you've accomplished very difficult objectives and then you happen to run into a bad guy with heavy armor and a shotgun and when he finishes redecorating the room with your brain matter you have to work through laser traps, patrols, and god knows what else you may have already dealt with.  That brings me to another issue, goggles have always been a big part of the splinter cell game series. The ability to see in the dark, see magnetic resonance, thermals, even footprint vision. Cool stuff right? This game introduces a foe called the 'drone operator' which jams your goggles, somewhat arbitralially I might add.. as no other electronic gear you carry is affected by their presence. They don't just do this after you've been detected mind you, but constantly. And the drones they send after you, while easy to dispatch with a single shot from your pistol, if you do happen to be detected nothing is more annoying than some dog biting your arm forcing you through the 'Mash the 'E' key sequence' while drones roll up to you and explode over and over again. Especially on the missions where you have to survive waves of enemies, horde style, necessitating yet more endless reloads in a vain effort to work through the missions. On these horde missions, the drone operators were consistenly the biggest pain in the ♥♥♥ of all other enemy types, even the juggernaught types which I'm pretty sure are supposed to be the apex foes. I'd rather deal with superman in body armor (the jugs) than deal with a single drone operator, largely because he could be ANYWHERE and regardless of his positioning will constantly send those irritating drones out whilst simultaneously rendering your goggles inert.  That rant down, I don't typically attack a game for being hard, but if it's supposed to be a stealth action game than why do I constantly feel like the game wants me to kill everyone? There really isn't anyway to argue against that the easiest way to complete a given mission is to go heavy armor with your nastiest guns and shoot your way through. Stealth is possible, but invariably ends up with you killing everyone anyway... and the routes in various level which REQUIRE a co-op team mate? I get it, we need to encouarge people to play these games, and fill out the various co-op campaigns, but the truth of the matter is that nobody is ever on for it. Even the multiplayer games are an endless stream of watching people join 'Oh this guy is only level 1, screw that!' and leaving the game lobby. It's impossible to get it done unless you have some cadre of friends which love games that seem designed to give them a headache.  At any rate, I finished this game through on normal difficulty, despite the fact that very VERY few games make me actually rage while I play them. This game did it. I was going 'Seriously?' to my computer, followed by 'Is this for freaking real?' And finally, 'I'd rather go play... basically anything else.' I love splinter cell, the storyline has always been excellent, and I finished it to see how the story would play out. But again, I wouldn't try to push this on anyone after the headache that NORMAL difficulty provided.   As a complete footnote to everything else, replacing Michael Ironside with some twenty something kid to 'jazz up' the franchise probably had the exact opposite effect. You lost your 30-40's cold war demographic, who could relate to the 'old man' that was the gravely voiced, dry humored, Sam Fisher. This punk kid who you've turned him into is not only unrelatable, but serves to undermine the ENTIRE story of the series.   Or is it a Michael Bay reboot?  /rant",
            "review_score": "-1"
        },
        {
            "review_text": "Now I usually never spend a full on AAA price for games... but this one? It's an exception. 5/5 Booyahs",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell Blacklist the game I was hoping for since the annoncement back in 2012 (or '11). The sequel I was so excited for I preordered the digital deluxe edition as soon as it was avalible on steam. The game which made me download the gameplay videos for in 1080p hd and watch them every night till the game got released. Then I got it....  Splinter Cell Blacklist is an amazing game but i suffers from what many ubisoft pc ports have since time immemorial. I got the game at 1 in the morning and stayed up to play it for 6 hours after that on a school night. The single player was fun so was the coop but that is not why i bought the game. I bought it for the Multiplayer (Spies vs Merc). Now this is the holy grail for me but I realised the longer i played it the duller it became. Now i am a fan but I dont know how but they managed to mess it up not from a gameplay point of view but technical. I guarentee you play about 3 matches of this and if you dont live in the US or any country which heaps of people play the game you will scream at your monitor and curse because of hideous lag and poor net code, overpowered weapons and the Merc Melee 'Dun Dun Dunnnn'  The net code for starters is horrible. The game constantly kicks you in the ♥♥♥♥ as you are always being shot from behind cover, melee'd through walls and being shot at in unbelievable situations. Like for example you see a spy camping behind cover, you constantly aim at him and start walking towards him and he kills you without taking a scratch. Half time your the spy the same situation and when you try you get blown up in the face.  Now the overpowered weapons, In this game you can tell if your versing n00bs or pros. Pros usually have ak-47s or some assault rifle, its a balanced gun and not too cheaty. And then there is shotguns, These things are way to op most of the time insta kills to enemy (or friendly) spies and you don't want to go near anyone carrying these things cause if they see you first you die there is no way you are getting them which is a bit ♥♥♥♥ because the only way spies can effectively kill mercs is with melee.  Finally the Merc Melee 'Dun Dun DUNNNNNN'.This is probably the most unbalanced thing because most people(including my self) just rock up there in adrenaline suit and sprinter boots which automatically makes them fast at spies and almost win every melee encounter. Did the devs not see this in testing. If your stuck with a match full of pros and your a low level i am almost certain they will pull out their pistols and rush you trying to melee. And you know how i was mentioning lag before, one time i had so bad lag i managed to melee a merc as a spy and then after the animation had finished he had got back up then melee'd me then dropped over from bad luck(battelfield reference).  Anyway i've done enough fanboy raging final thoughs the single player was fun but nothing to come back to the coop was alright but Ubi really let me down with this one and they didnt even bother to put ded servers or better stability. Ubi thinks all they have to do is change the controls around and give the game better graphics and put a PC sticker on it to make a good port. Well the game was a real let down and a bad pc port giving it 5/10  The end.",
            "review_score": "-1"
        },
        {
            "review_text": "I absolutey love this game. Bugged my friend to gift it to me, got it eventually and now am in love. Every single time i fly down 15-20 metres to bury a karambit in an enemies neck, it feels good (well that was sadistic). The singleplayer is immersive and free, allowing you to play 3 different ways: ghost is leaving enemies or non-lethally subduing them, panther is stealthy taking down and killing enemies, and assault is going in, getting noticed and then causing a whole load of clips to be emptied. Now the multi-player. The multi-player here is much different to anything else. Yes there is FPS shooting, but this is merc only. In the main mode, the spies (third person stealthy kinda guys) have to hack terminals and not get killed while inside the area, while mercs have to find the spies and kill them. Spies use shadows and cover to melee insta-kill the mercs, while the opposite side have the advantage of heavy firepower. So you might look at it and say the spies have advantage, but trust me, they do not. Being dropped from long range in 2 seconds is not an advantage. So all together, I love this game, and I would recommend it to anyone else who likes stealthy third person games (can't even think of another one). So yeah",
            "review_score": "1"
        },
        {
            "review_text": "Contrary to popular opinion, I still love Spies vs. Mercs. Always will.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic stealth game. Basically an improved and heavily upgraded version of Conviction, and worth every penny. The addition of choosing to go into each mission with one of three strategies, Panther, Ghost, and Assault, makes every mission much more replayable. With Panther, you basically do what you did in Conviction and the other Splinter Cell games. Kill silently. With Assault, you still kill all the baddies, but with loud weapons and explosions. Ghost is trickier (and a bit more frustrating, to be honest) but provides more score. Ghost basically means don't kill anyone. You can still use non-lethal takedowns on enemies to knock them out, thankfully. But you get the most points from avoiding enemies entirely.  Definitely worth the buy. 9.5/10!",
            "review_score": "1"
        },
        {
            "review_text": "Despite being somewhat casual (you know, mass culture means profane more often than not, especially with Ubisoft latest trends), this game's exception in that it has surprisingly polished playstyles and difficulty settings to fit every taste - whether you're a sissy one button shoot'em up grunt or hardcore stealth fan that feels aroused when actually ghosting around without touching or disturbing anyone. Yes, the game can be played like Conviction OR like Chaos Theory - the choice is yours and it's great to see that Ubisoft have learned from their past mistakes with Double Agent and Conviction. One can say that this game takes and combines all the best feats of other Splinter Cell installments - except for the split jump of course... We miss you, mate!  The main plot is a bit dumb... Dramatic, with good scriptwriting (scriptwriters know the trade more than you'd expect - Guantanamo Bay, Stuxnet, Denver Int. Airport bunker and etc.) but still closer to Hollywood reality than to actual life...   Yes, this game has coop and multiplayer. I haven't tried the latter yet but coop is nice - probably even better than in Chaos Theory since you have more missions to play and they're more diverse.",
            "review_score": "1"
        },
        {
            "review_text": "If you have always wanted to be an agent, this is the game for you! Pros (+) +Lots of equipment and gadgets +Many ways to sneak through the guards +Many ways to kill the guards too. +Fun missions +Co-op option Cons (-) -Needs more levels -Some stages can't be completed without partner",
            "review_score": "1"
        },
        {
            "review_text": "Superb stealth and multiplayer game",
            "review_score": "1"
        },
        {
            "review_text": "Uplay is horrible piece of sh!t, lost all my save progress, but the game is fun.",
            "review_score": "1"
        },
        {
            "review_text": "So far, this is my least favorite game in the Splinter Cell series. The game puts more of an emphasis on movie style action than on the stealth game on which it was based, and worse still is the fact that this game doesn't do it nearly as well as Conviction did. Instead, this game is trying to a hybrid of earlier games with the cinematic style of conviction, and it fails to live up to either expectation.  Other things that are bothersome include the voice acting (none of the original voice actors apparently returned for this entry) and the changing of characters. Somehow, Sam Fischer is becoming younger all the time. When I first started playing, I didn't even realize that we were playing as Sam and friends, until they beat you over the head with his name a few times. Using a mouse and keyboard to play this feels like a no-no. Blacklist was definitely created with consoles in mind, so you'd want to pick up a PC-controller in order to really play this.  Overall, I'm unhappy with this game. It's not unplayable, but it lives far from my expectations set by previous installments in the series. I must even commend Double Agent for its ability to be a better game than this one, and it was previously the worst in the series. This one has fitted its way into that lowest slot now, leaving me waxing nostalgic about the previous adventures of Stealthy Sam instead of this Keifer Sutherland in 24 wannabe.  Do not recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're good at being stealthy or just like to plain old assault the ♥♥♥♥ out of the enemy, then this game is for you! plenty of Customizatin, Weapons, Challenges, Online Game Modes, Maps, etc.. Great Game IMO.",
            "review_score": "1"
        },
        {
            "review_text": "I actually played Blacklist back when I was primarily using my PS3 (hence the low play time on Steam). I must have sunk a good 100 hours into it - not a ridiculous amount of time but enough to consider myself a big fan of it. Like Hitman: Absolution, it gets a lot of stick from longtime fans for not staying true to the original formula and, as a longtime fan of both myself, I was afraid I wasn't going to like them.   Thankfully (and surprisingly), I was mistaken in both instances. However, on further reflection, I began to think that perhaps change wasn't necessarily a bad thing in this case. It's not like the Splinter Cell formula was infallible after all - there were some definite issues present in the other games. It wasn't like Blacklist came along and tried to screw with perfection; it came along and tried to do things a little differently in a series that probably could have done with a little revitalisation anyway. To that end, I think it did a bang-up job of refreshing the series.  There are a lot of great features in this game. The fact that it rewards you for approaching each mission differently is a nice touch. For once, I didn't feel like a stealth game was guilt tripping me for going the 'Screw stealth - let's go nuts' approach. Going in guns blazing is now a viable option - even if it's not what Sam Fisher would conventionally do. Actually, plenty of the equipment on offer is directed at precisely the type of people who prefer that distinct lack of subtlety. The little mini-missions given out by your team members are also a good way of breaking up the main missions. They also help you to unlock better equipment for Sam to use in the main missions, so they're well worth doing.  Long story short - it's not a conventional Splinter Cell game, but don't let that put you off. Convention is overrated anyway. There's plenty of things to like in Blacklist as long as you don't get hung up on how different it plays to previous games. Enjoy it for what it is and you'll walk away happy with your purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Good Story 9/10 Cool animations 10/10 Multiplayer 0/10 Because it doesn't work -_- ----------------------------------------------- Game 8/10=Good",
            "review_score": "1"
        },
        {
            "review_text": "nc game btw",
            "review_score": "1"
        },
        {
            "review_text": "by jingo this is a really good modern console game",
            "review_score": "1"
        },
        {
            "review_text": "Dogs are american soldiers now.",
            "review_score": "1"
        },
        {
            "review_text": "Would be a nice game. Unfortunally it crashes every 25 minutes. There aren't many savepoints so be prepared to replay some lengthy parts more than just a few times.",
            "review_score": "-1"
        },
        {
            "review_text": "Best Splinter Cell since Chaos Theory!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun, my buddy and I play coop missions and just have a blast. A must have for fans of this amazing franchise!",
            "review_score": "1"
        },
        {
            "review_text": "Game does not work for a lot of people and the solution straight from Ubisoft tech support was to reformat and many people state that was the only way this game worked properly. Absolutely awful. Could not get a refund as I did not know it didn't fully work until playing it a bit and then steam wont refund as you've played 'too much' of a broken game. Out of 10 or so hours logged, 90% was spent troubleshooting trying to make multiplayer function what so ever and to access the coop missions. Single player functioned but it was nothing special, all done before by the series and felt empty to me. NOT RECOMMENDED TO ANYONE! Forums are full of veterans to the series quitting and calling this one the worst one. The series is done for me now as is Ubisoft yet again. Welcome to the gamingblacklist... where I never buy your crap again.",
            "review_score": "-1"
        },
        {
            "review_text": "the best way to feel you need a new computer :D",
            "review_score": "1"
        },
        {
            "review_text": "Not for the price I bought it at, wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I love Tom Clancy's ! very good game :)",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell Blacklist is a stealth game, or it is when it wants to be. At the begining it is really fun and easy going but as the game progresses more annoyances start to arise. In order to take someone out you can start making noise which will get you kill or you can go quiet. If you go quiet you can sneak up on enemies and either kill them or knock them out. But, when sneaking up on enemies they will hear you unless you do it fast. Until you start seeing heavys that is. They have heavy armour and the only way to kill them quietly is to sneak up on the but they will always hear you so you can't stealth kill them. Another annoying thing is that enemies start to wear helmets so you can't one shot them and are forced to sneak up on them. This is usually fine until in almost every level you will be in the middle of enemies all close to one another. The gameplay as I stated can be very annoying but the stroy is pretty solid and should be played through. Lastley the voice of Sam Fisher is different from a deeper darker voice to a higher (yet still manley) voice. It was annoying at first but you get used to it.",
            "review_score": "1"
        },
        {
            "review_text": "So, I am a little torn up about this game. There is some good writing, some great gameplay, and some good graphics, but I have just been playing some of the side missions and dang, this game can be punishing.  Now, I do not mean difficult here. It can be. What I mean is that some of the side missions will require complete and total stealth and force you to completely restart if you do not perfectly stealth it. These would be the Grim missions. Look, Ubisoft, mid-game checkpoints ARE GOOD. I like stealth games, but if you are constantly asking me to retrieve 3 objectives and then extract on the other side of the level without a single mid-level checkpoint, that is a recipe for rage, not tense and gleeful stalking. Don't go Super Meat Boy on your checkpoints but at least give us something.  Now, I do say this as both a warning and a message to any stealth developer: this game is good but seems to have occasionally missed some good stealth game design points. Overall, I enjoy my time with this game, but its memory is marred by the somewhat crummy side-mission designs. Currently, I have played some of side missions for Kobin (kill x terrorists, y more will show up if you are detected), Charlie (defend position from x waves... no it is not that easy) and Grim (get these 3 objectives and then extract without being spotted, complete mission redo if you are). Grim's missions are punishing, and you will probably rage-quit if you screw up on that last objective (which I have done several times, because PRECISE TIMING IS REQUIRED in some cases). Charlie's missions can be a drag (kill a guy or two, run and hide, wait until everyone calms down, repeat; also it has a checkpoint after each wave), and Kobin's missions can be just as boring if you are trying to stealth them (also no checkpoints here). Thankfully, there is some decent level design, and the campaign missions are pretty tight (complete with checkpoints, thank heaven). I have not played any of the co-op missions yet as I have yet to get my friend over to try them out.  For mechanics, I like how the mark-and-execute mechanic is now a set number across all weapons, that you can REMOVE weapon mods and select your own loadout (it is fun to see what you can do with a loud-only setup), and that there is a large amount of weapon and gadget variety. I also like that there are multiple ways to get through a level, and that there are new non-lethal ranged weapons (only 2-3, though, but that's better than hand-to-hand only). Additionally, the ability to carry more gadgets is a huge plus in my books, and the new stealth notification of your lights flaring up in shadow doesn't marr the visuals by doing that black-and-white thing that Conviction did (although it does make me want to scream 'How can you NOT see me!?!' to every enemy when it comes up).  I do feel that the new 'press B to attach to walls' is a step backward though. I really liked the smoother hold-left-trigger-to-stay-attached-to-walls mechanic from conviction, even if it made gunplay a tad more difficult (but it did make for a smooth stealth system with a decent incentive to not go all gung-ho and stay in cover).  In the end, I tenatively recommend this game. Good graphics, good gameplay, and the new voice actor for Sam Fisher is pretty good (although I do miss Michael Ironside's growly quips on getting older from Chaos Theory and his threatening tones from Conviction). However, expect the game getting a lot more rough when it comes to the side missions, which need to learn the difference between punishing and difficult.  SIDE NOTE: I am playing this game on 'Realistic' difficulty only, so I cannot comment on Easy, Normal, or Perfectionist difficulties and their changes.",
            "review_score": "1"
        },
        {
            "review_text": "It definitely adds to the experience when you can't hide in the shadows. I wish all the bullet holes I got afterwards could keep me appreciating it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic ♥♥♥♥ing game. Been playing this game regularly with a buddy of mine for about a year now and it never seems to get old. Great game mechanics and singleplayer missions, but the coop is where it is all at. Have your buddy's back while he has yours as endless hordes of insurgents rush the two of you. ♥♥♥♥ing awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Too Hollywood for my taste, steered clear from its original roots of previous games of the franchise. But at the same time it kept the Splinter Cell name some what relevant in todays gaming market. Would only reccommend buying on sale.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is Dope AF! &lt;3 Loved it!  Idk I just love stealthmode games! :D",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely the greatest stealth game in the history of gaming. Coop is superb, so many options and roads to take on how you play your character in singleplayer. I would suspect myself to be upset that i bought this game at full price and it is now half price in the market. But Ubisoft deserve the money i spent on this because it was damn well worth it! DLC's however are rather disapointing. I felt that i was paying for new weapons even though they were much worse than the default weapons that you can unlock for a few thousand dollars. However, the DLC maps are outstandingly made!  If Ubisoft does make another i would please recommend them to make it just like this of course with new ideas and story. But i honestly disapointed if the franchise changed back to the conviction gameplay.. :(  STEALTH 10/10 ASSAULT COMBAT 8/10 STORY 9/10 CHARACTERS 9/10  GAME 10/10    Uplay 1/10 :( Sorry Uplay..",
            "review_score": "1"
        },
        {
            "review_text": "Best Splinter Cell since Chaos Theory. The co-op mode is terrific as well.",
            "review_score": "1"
        },
        {
            "review_text": "Dot this game to play with my friend but the coop dosent work, saying that we dont have the game when we try to invite each other after a hour looking online found this to be a common problem that they have known about for awhile and not fixed but hey what do you expect from Uplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those games that show you what kind of person your friends really are, and it's fantastic.  Story is cool, gameplay is great, has a lot of replay value especially if you're an achievement perfectionist.  I definitely recommend this, even if you've never played a Splinter Cell game before.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell is back to the good ol' days where you can actually choose wich playstyle you will defeat the enemies.  Coop is very good also, there are 4 missions that can be only played in coop.  But stay away from MP on this game: lot of bugs, game crashes and gameplay is terrible.Mercs feels more OP due to the control scheme.",
            "review_score": "1"
        },
        {
            "review_text": "Tactical stealth gameplay, fast and fluid striking system, power filled combat and the inclusion of Spies Versus Mercs makes Splinter Cell Blacklist a value pack of four games in one beautiful package that any Splinter Cell fans cannot miss or any newcomers to the series must try.",
            "review_score": "1"
        },
        {
            "review_text": "fun stealth game as always!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the Splinterest Cell. This is by far my favorite game out of the series and I've played all of them since the original. For once, the game largely lets you play the levels you want (with one caveat, there are optional levels where an alarm is instant failure, so you can't go loud on every level). If you want to Ghost through without leaving a trace, that's valid. If you want to kill everything in your path and never be detected, also valid and rewarded. I haven't really tested how the run and gun plays yet, but that mode isn't really for me anyway.  Don't let the first mission turn you off (Where you get heard by enemies from 20 feet away while moving crouched). Apparently, you have 0 stealth rating in the first mission, so it feels really hard to sneak up on anyone. That goes away once you move on into the next missions. The game has 11 missions that must be done in order as part of the campaign, but between each of those missions, you can complete any number of side missions that you want, which are every bit as fun if not more fun than the core missions, to me. The side missions I've seen so far take the flavor of 'Kill/knock out everything in the level' or 'plant 3 wiretaps/bugs/etc without setting off any alarms'. In addition to the side missions and campaign missions, there's a healthy number of unlockable upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "An honest game with a history of all other Splinter Cells into one amazing game. Its a definite recommend to all Splinter Cell fans.",
            "review_score": "1"
        },
        {
            "review_text": "i really like this game but the problem is when ever i trie to play it the game freezes like every 30 mins i have tried multipile things if you know what it is please tell mke. ",
            "review_score": "-1"
        },
        {
            "review_text": "can't stop playing svm",
            "review_score": "1"
        },
        {
            "review_text": "Like any gamer that played any of the old Splinter Cell games, stealth is the most important and useful weapon in the game. Blacklist allows you to continue using stealth, but it is not the only choice. For those who choose not to use stealth there is an alternative too, Blacklist let's players go guns blazing if they so desire. Overall this game appeals to many different styles of playing. While not a classic Splinter Cell game, it still can still hold its own as a very good stealth game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like to sneak, this game is for you. If you like to co-op sneak with a friend, this game is definitely for you. Super nice visuals and awesome spy gadgets. One of my favorites ever!!!",
            "review_score": "1"
        },
        {
            "review_text": "Overall I've really enjoyed this game. Great story as well as co-op and multiplayer. Although nothing compares to the Chaos theory multiplayer, this spy v merc was actually decent. Do know that some days you will not be able to find games other than against a group of 4 that play together all the time. Too often teams are uneven in this game, but you get used to it. Other than that, the only thing that bothered me was the new voice of same fisher. It just didn't feel the same. This is my favorite video game series and little changes like that can really bother someone who is really into the franchise.     ",
            "review_score": "1"
        },
        {
            "review_text": "The best of the best really.. Wonderfull stealth game..i already completed it(perfectionest,ghost mastered),but am playing it again to unlock achivement and to play the coop mission(anyone interested u can add me as a friend and lets play togather)",
            "review_score": "1"
        },
        {
            "review_text": "This game is definitely worth the money. Campaign, CoOp missions &amp; Spy vs Mercs. All this tied in with the economy/upgrade system makes this game really fun with a lot of replay value. The controls are really fluid and intuative if using a gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "Actually pretty ♥♥♥♥in fun. I'd recommend playing on the highest difficulty as the wallhacks and instakill ability thing you have from the start makes it a bit too easy, but this is a really solid game with surprisingly excellent co-op (despite myriad bugs and some really dreadful enemy wave sections). Spies vs Mercs is pretty fun as well. Uplay is a bit ♥♥♥♥ though. At least it's better than Conviction.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter cell is the perfect game for any stealth lover like myself. it combines awesome gadgets, takedowns, weapons, and overall gameplay, must buy if you love stealth gameplay",
            "review_score": "1"
        },
        {
            "review_text": "In Tom Clancy's Splinter Cell Blacklist you have the choice between 3 styles.   1st one is a style called GHOST.   In this one, you need to operate completly stealth by using undeathly methods and also without beeing seen.  2nd one is a style called PANTHER.  This style is a mix between Ghost and Assault style. You need to operate stealthy but you use deathly methods.  3rd and last one is ASSAULT.  This style can also be called as the 'Rambo' style. Just kill and destroy everything and forget the stealth methods! (Do NOT use this style if you are a Splinter Cell fan!)   I personally preffer the GHOST style because it's similar to the style used back in the first Splinter Cell games.",
            "review_score": "1"
        },
        {
            "review_text": "Very hard game with no way of saving the game so if you die or get soptted you need to do the mission from the start! Even though its hard I like the graphics and its very realistic too. Oh and there is dogs in here :P yay ♥ ok its more open world than the previous splinter cell games, you get to walk around and talk to your crew and each person you meed has side misisons and things you can do for them.. I love this game ♥",
            "review_score": "1"
        },
        {
            "review_text": "brilliant stealth game franchise, awesome mix of stealth and action in the Single Player campaign though with a rather generic storyline. I've not reached the best part yet. Beyond single player lies the underrated, Spies VS Mercs multiplayer segment which pits a team of spies, played in third person perspective, against heavily armored mercs, played in first person mode a la CoD. There are several modes in SvM to choose from, ranging from classic to my recommended and favorite Blacklist mode.   Though my complaints in MP come from regular lag issues due to the obvious absence of dedicated servers and several glitches and buggy moments, if you look beyond these flaws, this is a seriously unique and very, very fun experience, especially when playing in the same party as your friends. If you get sick of SvM, there is an alternative co-op mode which allows you to take on 4E missions as well as the DLC missions which are also a great deal of fun.  All in all, i'd give Splinter Cell Blacklist a solid 9 out of 10. HIGHLY RECOMMENDED to action game junkies or even FPS fans for those who want a solid and rewarding multiplayer experience. To my fellow countrymen, Singaporeans, for once, dump DOTA 2 or LoL and at least give this game a try. Plus this game is always on freaking sale most of the time. It's calling out to you.",
            "review_score": "1"
        },
        {
            "review_text": "Much more a kin to the older games in the series, Blacklist is thankfully a much better game when compared to SC: Conviction.  Its is entirely possible to Ghost your way through the game. You also have the ability to just go balls to the wall guns blazing, but that's not very satisfying nor very challenging.  You get a meaty arsenal of weapons and gadgets, for whatever play style you should choose to adapt, you can mix and match as you see fit.  The campaign was pretty decent, it won't win any Oscars or anything, but i felt it was very focused and to the point. The antagonist is very menacing and the voice actor gives a really good performance. Which brings me to Sam Fisher, who is no longer voiced by Mr. Ironside, but as much as that pains me, his replacement is doing a very good job. One you get over the hump of Sam having a different voice, you start to tune it out.  Co-Op missions are a bit harder than the ones found in the single player campaign, well at least if you do them solo, which i found to be the most fun, I really enjoyed that challenge.  Worst part about the game is sometimes the controls are a bit too sticky in the places where you don't want them to be, and way too loose when you don't want them to be.  Oh and also why Ubisoft has made a game in 2013 with Unreal Engine 2.5 i will never know, the game looks dated, even with DX11 features and max settings cranked up. Still, it does the job and it doesn't ruin anything. But it would have been nice for it to look like a 2013 game.  Any way if you enjoyed any of the other games, you should give it a go. And even if you havent played the others, you can still pick this up and dive right in. It doesn't really require you to have played the others.",
            "review_score": "1"
        },
        {
            "review_text": "  great game",
            "review_score": "1"
        },
        {
            "review_text": "Tom clancy splinter cell blacklist review   Story    The United States has a military presence in two-thirds of countries around the world, and some of them have had enough. A group of terrorists calling themselves The Engineers initiate a terror ultimatum called the Blacklist - a deadly countdown of escalating attacks on U.S. interests  Gameplay    Offen you'll like the game experiment. the game is almost everything . Do you like stealth games? this game appropriate, Do you like assault games? this game appropriate Do you like first person shooter and third person multiplayer ? this game appropriate. If you don't like this game so know that you're a strange!  graphics    Over the top graphics, graphics is just fantastic and fancy the water looks fancy , the sand looks amazing , the looks dirt is fantastic . it's too easy to compare the graphics to the last of us , far cry 3 , crysis , uncharted. even i can only run this game in low settings . imagining when running this game in ultra!! what it could be?  Sounds and music    it's impossible to hear bad sounds and music from ubisoft game , the sounds and music is 10/10. the music and sound in the trailer is a masterpiece   Story : 9.6/10 Graphics : 10/10 gameplay : 9.2/10 Sounds : 10/10 music : 10/10   + positives  + multiple choises to kill  + Replayable campaign  + No bad mission  + Good story  + A new multiplayer idea  + Fun co-op   + Over the top graphics  + Diverse game     - Negatives  - Tiny game (5-7 hours)  - a bit difficult to zoom while your hiddin   Tom clancy splinter cell blacklist can be nominate for GOTY:)     Final score is : 9.5/10 Amazing!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!      ",
            "review_score": "1"
        },
        {
            "review_text": "Tom clancy splinter cell blacklist review   Story    The United States has a military presence in two-thirds of countries around the world, and some of them have had enough. A group of terrorists calling themselves The Engineers initiate a terror ultimatum called the Blacklist - a deadly countdown of escalating attacks on U.S. interests  Gameplay    Offen you'll like the game experiment. the game is almost everything . Do you like stealth games? this game appropriate, Do you like assault games? this game appropriate Do you like first person shooter and third person multiplayer ? this game appropriate. If you don't like this game so know that you're a strange!  graphics    Over the top graphics, graphics is just fantastic and fancy the water looks fancy , the sand looks amazing , the looks dirt is fantastic . it's too easy to compare the graphics to the last of us , far cry 3 , crysis , uncharted. even i can only run this game in low settings . imagining when running this game in ultra!! what it could be?  Sounds and music    it's impossible to hear bad sounds and music from ubisoft game , the sounds and music is 10/10. the music and sound in the trailer is a masterpiece   Story : 9.6/10 Graphics : 10/10 gameplay : 9.2/10 Sounds : 10/10 music : 10/10   + positives  + multiple choises to kill  + Replayable campaign  + No bad mission  + Good story  + A new multiplayer idea  + Fun co-op   + Over the top graphics  + Diverse game     - Negatives  - Tiny game (5-7 hours)  - a bit difficult to zoom while your hiddin   Tom clancy splinter cell blacklist can be nominate for GOTY:)     Final score is : 9.5/10 Amazing!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!      ",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel that brings the franchise back to traditional stealth. Varied gadgets, solid AI systems and great level design. Offers quite a good amount of content in the single player along with co-op and Spies vs Mercs. Much better than Conviction and up there with Chaos Theory.",
            "review_score": "1"
        },
        {
            "review_text": "this game is he boss i am so happy that i am on rank 47 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a amazing game when it comes to stealth! Love this game but Sam Fisher lost his sense of humor in this game. Overall its a good game. I rate it 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "udownload uplay  The End.    uinstall",
            "review_score": "1"
        },
        {
            "review_text": "good game it would be better if the mercs team was 3person",
            "review_score": "1"
        },
        {
            "review_text": "Very very good my comrade.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games of all time. Super clean and super fun. Would definitely reccomend 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best in the series. For me Blacklist is up there along with Chaos theory. The only negative point of this game is Sam's personality change and the new Voice Actor. Michael Ironside's voice was a must, being used to his voice throughout the series and it suits Sam pretty well. For the best experience, play panther or ghost playstyle on realistic or perfectionist diffiicutly. Assault playstyle and anything below realistic difficulty spoils the game. Atleast for me.",
            "review_score": "1"
        },
        {
            "review_text": "This iteration of the Splinter Cell series really puts my feelings for Ubisoft to the test. As far as single-player goes this is by far the best stealth-game I've played. Multiplayer (especially co-op missions) has the potential to make it one of the all-time greats, but that's where Ubisoft just didn't pull through for whatever reason. It's full of bugs that make prolonged game-sessions prone to all kinds of glitches that rarely turn out in your favor, mostly they screw you and potential hour-long efforts over for good.  Of course as it is with most Ubisoft games it is pretty much abandoned now update-wise so as much as I hate Ubisoft for their ways of doing business I have to admit that the game and its mechanics are pretty much as good as it gets as long as the god of multiplayer-bugs has mercy on you.  Bottom line: This game is too much fun for me not to play it but I would prefer it if Ubisoft at least delivered a finished product, be it on launch-day or through updates at a later time.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME YOU CAN NOT PLAY MULTIPLAYER AND UBISHIT ARE NOT FIXING!",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this if your a PC master race type. This is your typical quicktime jammed console game that prompts you every step of the way, they were too cheap to do a decent port to PC, you have to use a gamepad to control it, no mouse look and wasd. Yuk.  ",
            "review_score": "-1"
        },
        {
            "review_text": "They tried to make a new splinter cell. And they failed. This game is buggy, and stupid in many ways. Rooms with moving lasers like some terrible movie and forced shoot outs this game is nothing like the old ones. However. If you like me love the old splinter cell and just want something that resembles just a little, this might be for you. I spent a long time swearing over this game. Changing the difficulty to easy during each long forced shoot out, only wishing they wouldve given me a 'skip' option. But occasionally, I actually felt like the old Sam Fischer (whenever he would STFU). Some levels you can pass completely without interfering with anyone at all, which made quite happy, and made me feel I got my moneys worth. This game is for the people who want to sneak but wont freak out when they suddenly gets stuck in first person mode and MUST kill everyone on the whole level. Get it on sale. Its a ♥♥♥♥ game like almost all other games nowadays. But maybe half of it wasnt TOO bad. Id say its like a mix of the worst missions on Pandora Tomorrow (which is the worst of the first three and only real Splinter Cells) and of some new Call of Duty XX third COD of the year. Luckily you get more sneaking than shooting if you try really hard",
            "review_score": "-1"
        },
        {
            "review_text": "Rainbow six simulator 2045  siege/vegas",
            "review_score": "1"
        },
        {
            "review_text": "very awesome stealth game. The multiplayer is very crappy and they really need to fix it.",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw the game open and started the first mission, I was amazed. The combat is great, the stealth is great, and it's just overall amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend this game if you like Keldrona walking into mines.",
            "review_score": "1"
        },
        {
            "review_text": "I LIKE THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Tom Clancy's Splinter Cell LightBulbList. Anyway I've been playing this game for 2 years, and I'm really enjoy playing this game :P",
            "review_score": "1"
        },
        {
            "review_text": "Fu**ing Cool Game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.. Stealth is my favourite thing.. CO OP with friend is gonna be challenging and pretty fun (a lot of fun and replays because someone messed up) :D",
            "review_score": "1"
        },
        {
            "review_text": "Overall I enjoyed my time playing the game. However as a Splinter Cell fan since day one I felt let down. The voice actor change probably left the biggest dissapointment for me, especially knowing Michael Ironside supposedly coached the new actor. Somehow every game as Sam gets older, he gets buffer and more agile. I wished at this point they did a batman beyond thing and just had a new splinter cell be the main character, like briggs. As with conviction, parts of the story are impossible to do 100% stealth although I tried very much on perfectionist to hand to hand kill only without getting detected. The story itself isn't bad but doesn't leave a sense of urgency for what's actually happening. Most of that is done through calling your daughter which feels weird considering both actors sound to be the same age. They nicely took from Conviction though and improved upon its faults gameplay wise and took on a more Double Agent (next gen version) style of knowing if you are hidden or not, basically no more color desaturation.  Co-op itself was very fun for the most part. The briggs missions started and ended fun but some missions seemed near impossible to stealth or literally were impossible to stealth, especially with the highly annoying re-addition of dogs since I believe Pandorra Tomorrow. The briggs missions also were the only story based co-op missions. The 3 others were very much like deniable ops from conviction. Charlie missions are wave based and after doing one for the full 20 rounds with loud weapons, my friend and me decided we did not enjoy them whatsoever. Kobin missions did give the more classic splinter cell vibe and can be compared to hunter missions in conviction. Grimm missions were also quite fun as they were similar to infiltration from conviction with a mix of added objectives.  Multiplayer is back in its true form. I've not actaully touched on mutiplayer in the PC version too much but I did play it considerably on console. At this point if you are just getting into the game, you may want to play with only friends or else you will find yourself unable to do much as the learning curve has always been high with SvM. I found that the new SvM blacklist mode to be the best of them all giving you 4 mercs vs 4 spys and having to try and hack 3 terminals. Unlike Double Agent, you dont actually need to maintain presence at the terminal, just in the region. There is a throwback mode to Chaos Theory/Pandora Tomorrow which is 2v2 Classic. I didn't actually enjoy it too much considering how much I played Chaos Thoery SvM. There's nothing wrong with it, it plays quite well but I found myself liking the 4v4 mode with new stuff more. There are also other modes which combine spies and mercs on one team however they just don't feel that much fun to play even though I liked the old gen SvS in Double Agent. The addition of loadouts added a much new feel to SvM. I personally liked it because it gives you more ways to counter the opposition. If you dont like that though, the Classic mode will be perfect as it limits loadouts.  Overall I do recommend this game because it is fun and well put together, but at this point its only worth getting if you desperately want the story or have a friend to play co-op with. If you've never played a Splinter Cell game before, then I think it is a great game to get into as there isn't really any expectations. Getting it for multiplayer is questionable as the community is small and learning curve high with most people playing max level now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the greatest games i have played its high in gameplay and intense gameplay too. I would totally recommend you buying this game for your own injoyment",
            "review_score": "1"
        },
        {
            "review_text": "This is the best stealth game hands down 9/10 but, Uplay you have to ruin it, when i buy a game on steam  EXPECT IT ON STEAM SO STOP FORCEING EVERYONE TO USE YOU CRAPPY SOFTWARE.",
            "review_score": "1"
        },
        {
            "review_text": "Just like a one night stand. Fun for the first 5 minutes then get's old.",
            "review_score": "1"
        },
        {
            "review_text": "  best Splinter cell game you can customize your gear and there are lot of missions and different ways to pass lvl there are ghost panter and combat you can kill or don't kill its up to you but because ubisoft it has its own faults multiplayer is not working and it and it has its owns bugs but still i have 180 ours in pc but it is still great game",
            "review_score": "1"
        },
        {
            "review_text": "Super fun stealth game, with a lot of customization available. The best part is the co-op, which reminds me of Chaos Theory, and it's always fun to play with another person",
            "review_score": "1"
        },
        {
            "review_text": "My first Splinter cell was Conviction,and it was perfect for me from story to gameplay,so I actually compared Blacklist with Conviction.  STORY: I think both Stories were good Conviction showed Sam Fisher as a person who has no hope for future and just want to find those who killed his daughter,and Blacklist is like a action movie with a lot of unexpected scenes.However I think Blacklist wanted to show Sam Fisher as a patriot person as you will see in some scenes in game,and I think they were successful.  GAMEPLAY: Blacklist is better.It's like a remastered version of Conviction's gameplay,with full of new options,gadgets and guns.Exactly like Conviction you can finish your mission with a lot of actions or stealthy,but finish your mission in action mode is a little bit harder in Blacklist even in Normal difficulty.  SOUNDS: I didn't see any special dialogue between characters or maybe I forgot it,however it had some mistakes like some soldiers speak Persian (Farsi) altought accent was good,but radio was playing Arabic music instead of a Persian music,however it is so respectable for me that sometimes Ubisoft mentions Persian language or other things in this game ,or other games like Prince of Persia.  I recommend this game if you are looking for a stealthy game without any obvious bug or something.  Overall: 9.10",
            "review_score": "1"
        },
        {
            "review_text": "That is NOT Sam Fisher or Anna Grimsdottir, bring back Michael Ironside and Claudia Besso the true voices of the series.   i have been a fan from the start and am greatly disappointed in this latest instalment,  i am struggling to even play it with the amount of changes that have been made since Conviction,  there are too many problems for me to mention, so I'm not going to bother.",
            "review_score": "-1"
        },
        {
            "review_text": "The perfect blend of action and stealth. Best stealth game since the original Splinter Cell.",
            "review_score": "1"
        },
        {
            "review_text": "As a generic, cover-based third-person shooter, it's an average game. Think 'Uncharted' or 'The Last of Us', except all the exploration, environmental puzzle solving, and character development is stripped out, leaving only the combat.  The single-player experience is a series of combat arenas littered with waist-high walls. Each zone punctuated with a resupply cache at every checkpoint. It feels like a compilation of maps meant for the co-op mode of Conviction and it shows. Aside from the story missions, there are several game modes for the missions (no detection, clear the room, and clear the room for X waves).  It's arguable that replayability is built in to the maps due to the score attack mechanism which grades you on your performance in non-lethal (Batman), silent lethal (Solid Snake), and noisy (Michael Bay) playstyles. Why a secret agent -- with a history in covert wetwork -- would be rewarded or even commended for kicking down doors and emptying an auto-shotty into a warehouse full of armored goons is beyond me.  Once again, the concept of darkness is binary, as it was since Double Agent (PC/360). Due to the large number of enemies with night vision goggles and flashlights or the environments which are lit with dozens of light sources per square foot (many of which are ambient or otherwise indestructable), using shadows -- the original hallmark of the Splinter Cell series -- is pretty much useless, anyway.  Stealth is no longer about stalking your prey, waiting for the perfect time to strike from the shadows. Instead, 'stealth' has devolved to camping at a corner, dangling from an overhead ledge, or just sprinting up behind an enemy (provided you've specced your equipment for maximum stealth) and mashing the kill button. Speaking of overhead ledges, senior citizen Sam Fisher is more nimble and spry than ever before, able to scale the 10-foot high walls of an office building with the ease of a young assassin Ezio Auditore.  Haven't bothered with the competitive multiplayer mode, so I can't comment on it.  Much like Conviction, this is Splinter Cell in name only. If you must buy, wait for a deep discount. Better yet, just buy an Assassin's Creed title as that's pretty much the direction that this franchise is headed.",
            "review_score": "-1"
        },
        {
            "review_text": "My review for Metal Gear Solid 4.5 The Splinter Glitch.  In the latest installment of the 'Gears of Metal' sereis you ditch the lameass character Solid Snake for the new guy Mr. Splinter Cell. Being the last man in your agency you blast your way through hoardes of enemies in this non stop action game. Its insane the amount of sheer explosions there are, its like micheal bays wet dream. Be warned pansy ♥♥♥ stealth fans, this game is like 'Just Cause with guns' being an off the rails sidescrolling shootem up with a in depth story and amazing uplay action.  Seriously though, its a good game, get it.",
            "review_score": "1"
        },
        {
            "review_text": "Quick review: The game is really amazing if you like stealth games such as hitman or the rest of the series. I recommend lots of tom clancy games such as the splinter cell, ghost recon and rainbow six series if you like tactical/stealth shooters. Of corse each series is much different from the other but each has suspensful gameplay. I have not yet tested co op but will soon and so far solo missions have been great fun. You have 3 options on how to play the game, either going 'ghost' and never use lethal force (which i prefer and is also the hardest), 'panther' which is keeping all your kills silent and never being seen, or 'assault' which is go loud, breach n clear, shoot em up style gameplay. Graphics are great as well as sound, missions arent dragged out and theres a lot of missions. I definitely recommend this game if youre interested, especially if its on sale! :D",
            "review_score": "1"
        },
        {
            "review_text": "I like this game.",
            "review_score": "1"
        },
        {
            "review_text": "The Game itself is generally ok and that is generious of me.   I like the customisation aspect and the gameplay but a few things have really P***ed me off.  First thing first SMI is a pain in the a*** to use .... Everything should be simple just use a main menu instead of getting all fancy and crap. Yes the plane upgrades area good idea but it needs to be more thourghtout. Secondly for the PC version is seems that joinig online games with Random people is ok at best, If your at home using your own internet and you have the time to be fiddleing with ports and crap like that then eventually you will get it working so that you can actually host and get friends to join. Otherwise for people using a internet like me (At a University Halls) the you have very little chances of playing with the people you wish to.   Lastly not least should you find urself in a boring one vs one match you cannot leave unless im being silly but it seems i have to close the whole game down and reopen which opens the uplay launcher then loads the game and its a real waste of time.  If I was you dont play Uplay games for PC they have a consistancy of letting you down Generation after Generation",
            "review_score": "-1"
        },
        {
            "review_text": "i dunno i liked it   ai can be a little strange sometimes but i can forgive it, its predictable  the counter-op multiplayer is weird; the co-op is fun  environments are very detailed; you can climb on almost everything ala assasains creed (another ubisoft game ;)  maybe not as hardcore stealth as some would desire, but its still a stealth game ♥♥♥ da purists",
            "review_score": "1"
        },
        {
            "review_text": "I rather liked this. Splinter Cell is still on top in terms of the stealth games. Plenty of content and replayability here,",
            "review_score": "1"
        },
        {
            "review_text": "i personally feel the game is closer to the gameplay back in chaos theory and pandora tomorrow, i throughly enjoyed the campaign. the multiplayer is jsut as much fun, balanced enough that each team can overcome the oposition.",
            "review_score": "1"
        },
        {
            "review_text": "Fun though I really suck at this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the newer games that I actually enjoyed. While I was disappointed by Conviction and its amount of forced action, I was pleasantly surprised with Blacklist, it kind of felt like I was playing Chaos Theory again. I fancy games with upgrade systems and well shoot this game has one, weapons, weapon upgrades, fancy different colored lights, cool suits. You can play the game any way you want, run in and blast people, stealthily kill people, or even just completely avoid everyone maybe knocking some guys out on the way. Theres quite a few missions you can play cooperatively with a friend or so, as well as there being the reintroduction of the SvM game mode, where Spies have to hack terminals while Mercenaries have to take them out and defend them. Of course its not as glorious as Chaos Theory's was but this game has its own cool things about it. I still prefer the maps and the progression through said maps in Chaos Theory, where as each terminal would unlock the next area and the Spy team would win by hacking all of the terminals. The campaign in this game is actually fun to play through and very interesting, though I do miss Michael Ironside voicing Sam Fisher. Definitely a step up from the unplayable Double Agent and the more actiony Conviction.",
            "review_score": "1"
        },
        {
            "review_text": "'Fisher is a king' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Too bad uplay was made by an Orangatang, it was gifted by a friend just so i can play play with them but that wont even work.",
            "review_score": "-1"
        },
        {
            "review_text": "Requires you to install a ubisoft game library manager &amp; forces you to create a ubisoft account. First 30 mins is just cutscene. New voice actors and bad graphics make it difficult to recognize any of the characters from the previous games. Matchmaking finds no matches.",
            "review_score": "-1"
        },
        {
            "review_text": "great plot but pc user interface sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: gameplay mechanics are great and fun to use very addicting looks pretty assortment of weapons &amp; gadgets allow for many different battle styles AI is mildly intellegent  cons: story characters",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game but the moment you go in to SvM blacklisst rather than classic there is so many hackers no pun intended... Was just playing right now and some dude missed every pistol shot next thing i know i die from his melee when i'm not even in melee range and he was a merc...",
            "review_score": "-1"
        },
        {
            "review_text": "Been on menu for 7 minutes, so far so gud  10/9",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant assassin-stealth game. Good graphics, plot, gameplay, voice-acting, model animation, almost everything.  I like the new weapon purchase and upgrade system. It makes things a lot more interesting. Being able to pick up bodies is also fun. I love being able to hide bodies, or even throw them down the cliff or into the sea.  Some downsides though. Crouching no longer makes your footsteps totally silent, and it makes things really hard and annoying sometimes, especially when dealing with heavy infantries (they always turn around really quick and counter me). Also, I really liked the unlimited pistol ammo in Conviction. It made destroying lights effective as you wouldn't waste ammo. Hardly any enemy carry pistols and every pistol ammo is too important to waste on lights now.  Although the optimization has improved from Conviction (where I could only play on 800x600 resolution), it is still not very good (I can only play lagless up to 1280x720 resolution). As a comparison, I can play Batman: Arkham Origins on 1600x900 resolution, which was also made on the Unreal Engine, with no lag.  Also, there was a bug at the start where it wouldn't respond when I pressed the key to open weapon selection when they asked me to, and I got stucked for a while, until I figured out that I needed to change the key settings to 'Hold' from 'Toggle'.  Rating: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "'A Ubisoft service is not available at the moment. You can try again later or switch to offline mode.' It's offline about a month and i can't activate the game in offline mode.   F U ubisoft!",
            "review_score": "-1"
        },
        {
            "review_text": "We're gonna get a Christmas tree  My momma &amp; my daddy &amp; my sister &amp; me Come on everyone let's go see  Come on Sue &amp; Sally   Cold December days are here  Ringing the warmth of Christmas cheer  We'll find the perfect tree this year  The loveliest tree in the valley   Down the woodland path and over the bow Children follow tumbling thru the snow  Following the woodland way  We're gonna find our tree today  'Cause daddy knows exactly where to go   All at once we clapped our hands in glee  Daddy's found the perfect Christmas tree  We can hardly see the top  Daddy's axe goes chop chop chop  And down as a tree as perfect as a tree can be   We're gonna get a Christmas tree  My momma &amp; my daddy &amp; my sister &amp; me Come on everyone let's go see Come on Sue &amp; Sally  Cold December days are here  Ringing the warmth of Christmas cheer  We'll find the perfect tree this year  The loveliest tree in the valley   Daddy plants his stake about 3 feet high Baby Sally looks and wondered why Daddy smiles at momma's glaze In the gentle light-felt rain We'll plant another tree right here by our side  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The second best Splinter Cell.",
            "review_score": "1"
        },
        {
            "review_text": "The activation key I was given had already been used.",
            "review_score": "-1"
        },
        {
            "review_text": "If Ubisoft had kept good old Michael Ironside as Sam Fisher, I would've enjoyed the parts when the character opens his mouth and makes a sound. Really, the new voice is way too young to be Fisher. At least Hideo Kojima knows what he's doing when trying to find replacement voice actors to Metal Gear series.  I recommend this newest installment of the Splinter Cell series only to people new to the series, not to true-fans.",
            "review_score": "-1"
        },
        {
            "review_text": "Splinter Cell is ruined. The style is totally bubbly and Conviction-like. The game is WAY too action based. This game reminds me nothing of Chaos Theory. The SvM is totally dumbed down and action based.  Ubisoft also refuses to patch this game. It's rampant with issues... ",
            "review_score": "-1"
        },
        {
            "review_text": "Let me begin by saying that Splinter Cell Blacklist plays very smoothly, and at times, can be very intense. The AI is smart. The motions of Sam as he vaults, shoots, executes, stabs, snaps necks, climbs, or whatever are very impressive. It never got old watching Sam execute enemies in a variety of ways using the classic Karambit.  This is a kind of game where you sneak into battle knowing that your armor can hardly stand intense punishment, and you may use your wallhack goggles immensely to make sure you don't get snuck up on by a stray patrol. You listen intently for the pants of dogs or time when the camera moves so you can pass through certain corridors. Depending on your playstyle (Panther, Ghost, or Combat) the outcome of battles vary. Sometimes, you can avoid a gunfight entirely.  However, there is little variation in the actual outcome of the story (except a line of dialogue) when you are faced with actual decisions. Your actions are literally meaningless, regardless of whether or not you spare this guy or that guy or sneak through a map or go through the map guns blazing. Replayability is difficult since the patrols are all the same. Enemies telegraph their movements too easily by shouting out their positions (if you haven't spotted them via wallhacks), or how snipers have stupid red lasers that mark exactly where they are looking.  Some missions in the single player story force you to follow conditions, such as not killing/disturbing anyone or only using non-lethal weapons. Failing these conditions will instantly fail the mission. At first this was fun since it mixed up gameplay, but scenarios like these just BEG for multiple endings or branching missions. After two times I was sick of having conditions applied to my game.   tl;dr version: ++Looks visually stunning both graphically and in the animation ++AI is impressive at hunting you down (sometimes too impressive...) +Can get intense as you sneak through open rooms or during CQC/CQB  ---SUPER linear story ---Lack of replayability (thanks to linear story) ---Too easy (Even on Hardest difficulty) ---Air Support sections straight out of Call Of Duty ---No meaning to any decisions ",
            "review_score": "-1"
        },
        {
            "review_text": "+ Great game  -Have -To -Use -Tunngle -To -Play -CO:OP -On -A -Paid -For -Game  1 plus 12 minus Do not recommend",
            "review_score": "-1"
        },
        {
            "review_text": "Great !!!",
            "review_score": "1"
        },
        {
            "review_text": "Just buy conviction.",
            "review_score": "-1"
        },
        {
            "review_text": "Haven't actualy played much of this game yet but I forgot that Michael Ironside isn't Sam Fisher in this one so that's a drag.   rip drunk michael ironside now sam is a 28 year old with kinda grey hair :'(((((  Edit:  Now I've actually played a lot I can say that it is a good game - slap it on top difficulty, go full non lethal stealth and it actually feels like Splinter Cell, a vast improvement over the abysmal Splinter Cell: Conviction. Ultimately unsatisfying though. They went back in the right direction but in the end I still couldn't recommend it to fans of the original three games.  Chaos Theory is available on steam and people seem to think it is a good port, so get that instead and enjoy one of the best stealth games ever made. I still vividly remember most of its missions despite not having played it in years, whereas everything in blacklist will quickly fade from my mind.",
            "review_score": "-1"
        },
        {
            "review_text": "o m g spys vs mercs on black list is like the most f*cking ret*rded peice of sh*t thing iv ever seen if it wasnt for the f*cking awesom coop in the game BLACK list would be a steaming PILE OF F*CKING UBISH*T",
            "review_score": "-1"
        },
        {
            "review_text": "certain mission and ways to complete missions only in co-op, they throw you directly into the story with no sence of directiong, crap controlls, and last but definately not least UPLAY",
            "review_score": "-1"
        },
        {
            "review_text": "If you have friends and wanting to play CO-OP don't play this ♥♥♥♥ game, can't connect to each other 2/10 all the demand of 2 people wanting to join the servers clearly is to much",
            "review_score": "-1"
        },
        {
            "review_text": "Well where to start? At the beginning of course.  The game drops you right into the first mission - the tutorial/Exposé of the story - with no menu before hand. That's fine if you like auto-detected settings and default key binds, but not everyone does and I'd certainly like a real main menu for the game (all interaction is done via the Ingame Worldmap or interaction with characters on board the Paladin Airplane).  But those are minor points.  The introduction into the story feels like the game wants to be a movie but isn't. It is a very hollywood-esque story and as such feels a little bland. While the missions are (so far) quite fun and varied, they are by no means especially creative or challenging. You either get it right or you have to restart and getting it right is more often than not a choice between killing everything in your way or waiting until the next opponent has his back turned.  The enemies or scenarios don't offer much challenge either for the most part. The worst thing that can happen are armoured opponents or dogs (or both) in combination with 'Don't get spotted and don't trigger any alarm' objectives. There is also no lack of gadgets and while having a large selection of stuff is nice (although half the gadgets are essentially the same as the bolts for the crossbow) having too much of everything is not. Even using your gadgets very liberally for takedowns (rather than sneaking around and doing the hand-to-hand stuff) you will rarely be in a situation where you think 'Damn I wish I had more XY to take out those guys'. You will have enough.  Multiple routes are present in almost every mission/situation so there is no lack of choice there, however some lend themselves more to a certain playstyle than others. I like the customization the singleplayer offers, though again a bit more creativity would be fun - giving the suits for example extra abilities or special gadgets - rather than having simple liniear upgrades.  Customization in Multiplayer is another matter entirely. If you play this game online PvP rather than COOP, play the Classic mode. The classic mode with its default profiles is fun and challenging and the maps are far more entertaining 2v2. The 4v4 Blacklist modes are a cluster♥♥♥♥ of epic proportions.  It is still very much the best Splinter Cell Game since Chaos Theory as far as I'm concerned.  Update: As the game goes on, it goes out of its way to get you to shoot stuff. For every 'Don't get spotted' Objective there is one 'Neutralize all the Hostiles' and added to that you get situations forced upon you during which stealth is no longer really an option. The COOP in particular is filled with lethal situations that don't really work in a stealth game.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME REQUIRES UPLAY WTF and it says i already have a account WTF steam................. fix this -_- i think i wasted $14.00",
            "review_score": "-1"
        },
        {
            "review_text": "Being a huge fan of SC Conviction, I feel let down by Blacklist. The 'in-game menu' is impractical and feels clunky, it sometimes feels like the game is forcing you to play coop (looking at Brigg's missions), they took away the black-and-white aspect of the game when Sam's in the shadow which was awesome in Conviction.  Wouldn't by it unless it's a serious sale",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "This game is buggy as all hell, and the stealth portions are far and few between. This is not Splinter Cell this is Call of Splinter Duty. Did I mention the bugs, the ♥♥♥♥ing bugs!  DO NOT BUY if you like functional games!  If you want a good stealth game just go and get the classic Splinter Cell: Chaos Theory, it is way more fun and also has co-op, the game still holds up incredibly well.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ i bought game with friend and we cant play coop even multiplayer ♥♥♥♥  ",
            "review_score": "-1"
        },
        {
            "review_text": "This is game is the gamification of a perfect American thriller movie. 10/10 Sam Fisher is a beast.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell: Blacklist is Third-Person Shooter. It's also an awesome comeback of Sam Fisher. Plot? We have seen this a lot: terrorists are threatening America, so we send special unit to destroy them. Luckily, game is much better than its plot.  After events from Conviction, Fourth Echelon is formed to neutralise threat for The Engineers. Guess who leads it? Yeah, good ol' Sam. With other members of the team (Grimm, IT genius Charlie and soldier Briggs, who sometimes helps Sam on the mission) and Paladin crew they have to trac down and eliminate Engineers Leader. But what is Paladin? Your new Hq, Paladin is a military grade plane - where you spend time between missions. It offers weapon customisation (game offers quite a few guns), plane upgrades (like sonars enabling minimap while on mission, and things like that. All improvemnets are done mid-air), and chat to crew or Sam's daughter. And of course access missions, both story and e4 ones (could be played coop or solo, all except Briggs ones).  Finally missions. You visit some places, like Middle East, States, Britan or Guantanamo. Most of them aren't much diffrent. Blacklist introduces playstyles for Splinter Cell, each one with diffrent score (and money) rating. Ghost is something for veterans - challenging sometimes, but extremly satisfying. It rewards avoiding enemies, and quiet KOs and shocking instead of loud approach. Most challenging, but also most rewarding. Panther style is a lot like Ghost, but it focuses on quiet killing and leaving no witnesses. Gives around 75% of Ghost rewards. And final one, Assault. Created for people who love CoD, so they can also play Blacklist. It obviously focuses on blazing into the room, tossing a frag or two and killing everything that moves. Personally, I use Ghost style at the beginning, but after some time i gave Panther a try, finishing the game with this one. Better finishers with melee, and ability to use sniper rifles and pistols won :) Good thing is, that with upgrade of Paladin you can change your loadout on supply cases - nice idea when you grow bored of quiet approach and want to shoot something. To be honest it's good idea to have 2 loadouts - one for Ghost and Panther, and one for Assault, regardless of your preffered style. Why? One of Blacklists minuses is that sometimes it forces usage of one playstyle. Like Ghost only in Guantanamo, or full Assault during Plane takeoff (after one mission) and Charlie's missions.  To sum up, Splinter Cell: Blacklist is great game, no matter whether you look for some sneaking, or trigger happy shooter. Enemy AI isn't making stupid mistakes, and variety of gagets (there are a lot of them, like frags and incendiary granased for assault, tear gases for Panther, or Sleeping gas for Ghost. And some universal ones, like sticky EMP or noisemakers) will help you a lot. Playing it was a pure pleasure, and it's likely that i will come back to it in future.  P.S: Game features Multiplayer and Coop missions, but to be honest, i haven't played them.",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy this pice of ♥♥♥♥ if you're gonna play coop with a friend. Its impossible. Dont waste your money!",
            "review_score": "-1"
        },
        {
            "review_text": "Co-op is a nightmare. Looks like a great game, just terrible Ubisoft kills it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "loved the game for xbox thought i would get it for pc. i couldn't connect to the blacklist services spent 6 hours trying and ubisoft no help at all will never buy a ubisoft game agiain.",
            "review_score": "-1"
        },
        {
            "review_text": "It's aite.",
            "review_score": "1"
        },
        {
            "review_text": "there is an issue that myself and my friend are having which doesn't allow us to join each other, this issue seesm to afftec most of the PC players. What's new, another half baked crappy ubisoft port.  also Uplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This ♥♥♥♥ right here is waht ruined the franchise, not conviction.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, just wish more people were online!! But overall I would say this game is a 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Solid game. The co-op is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "The best game in the splinter cell franchise, in my opinion. Good story, cool dialogue, nice graphics, and smooth gameplay. A clear 8/10 for me.  Like the previous installment, 'Splinter cell: Conviction', you're a lot more mobile than you are in the first three games. You're also free to choose how you want to deal with enemy units. Not only do you have a variety of weapons and ways to dispose of your enemies; you can also use multiple non-lethal methods - like sleep gas, stun gun (like the sticky shocker in Chaos Theory), proximity shocker, and a couple of items to distract your foes. You can also avoid most enemies entirely, which really pays off at the end of the mission.  It may be hard to believe, but the reward system in the game is also pretty well integrated. It's very RPG-like. You get money to buy items and upgrades at the end of each mission (depending on your performance), as well as by picking up dead drops and hacking PCs you find. You'll be able to upgrade Sam's gear in several ways by buying different clothes (boots, gloves, torso, etc), as well as by buying different weapons and weapon upgrades (of which there are many).",
            "review_score": "1"
        },
        {
            "review_text": "If I could sum this game up in one word it would be: Frustrating.  I have literally restarted two different missions at least two dozen times. I spent over three hours doing a ♥♥♥♥♥♥ side mission. Why? Because the game designers have decided that instead of going with a smarter AI approach, they're instead going to make enemy mobs that are 100% impervious to any gadget attacks in the game.   Oh and with a gas mask, helmet and 200 lbs of armor on, they can also magically hear you sneaking up behind them for a stealth kill. I have 100% stealth armor, the navy camo upgrade for night missions and I've carefully shot out every light within a 10 mile radius.   None of this matters as you approach him from the rear while he stares pensively over the railing of a ship. He can hear a feather fall onto a cloud from 10 miles away inside his gas mask. Which is utter ♥♥♥♥♥♥♥t. I spent the better part of a decade in the Army and I've worn gas masks more than David Caruso wears sunglasses. You couldn't hear a Harley Davidson driving through a jet engine with one of those things strapped to your face.  They can't be electrocuted, they can't be gassed, they can't be snuck up on and God help you if you decide to shoot them because it will take more ammo than was used in the entire siege of Stalingrad just to knock their helmet off.  Also, the game now forces you to go 100% down one of three paths for each mission. Personally I like to use the entire toolbox of gear that I bring on Sam Fisher when doing missions. However, this is penalized as some gadgets will automatically incur a Ghost kill while you're trying to go 100% panther route. Don't like it? Can't use that gadget, then.  Oh right, the Sniper Rifles. This one kills me. No literally, my sides are splitting open as I slap my knee and guffaw at how idiotic this is. Sniper Rifles are about as powerful as a large handgun. The only bonus they have over other guns is range and control. In the real world, if you built a military grade sniper rifle that couldn't penetrate a helmet at 100 yards, then you'd scrap the design and go back to the drawing board.  Not only do Sniper Rifles not penetrate helmets, it takes 2 shots or more just to knock the helmet off. This is pure garbage and designed to further frustrate the player. It's almost as if the devs have taken extreme pains to ensure that you have to tediously crawl through every mission choking out everyone with a helmet.  Lastly, Sam Fisher must have Parkinson's disease because he can't hold a pistol or assault rifle steady to save his life. If I ever had a soldier on a firing lane that wobbled that much while holding a rifle, I'd rod him off the range and administer a breathalizer test.   Yet again, the developers making the game artificially difficult for no reason. I mean I get that Sam Fisher is in his 50's at this point, but hell my 55 year old mother can drill out the center silhouette of a target at 10 meters with her stock Glock 17. I'd think Sam Fisher, one of the most experienced field operatives in the world, could hold a heavily modified special forces pistol rock-♥♥♥♥ing-solid-on-target for at least the first 10 seconds he's aiming it.  It's more than just this, there's a good half dozen other things that just irritate the crap out of me about this game such as the climbing and movement models still being tied to extremely specific pieces of architecture. How long has Assassin's Creed been out now and Spinter Cell is still sticking to the early years of mobility limitations in game engines?  Sigh, so so much wrong with this game. Not even sure I have the patience to put up with it much longer.",
            "review_score": "-1"
        },
        {
            "review_text": "Would be an amazing game if uPlay actually kept a copy of your saved data on their 'cloud' servers.   Says i played 49 hours, though the game says i should start at the tutorial.",
            "review_score": "-1"
        },
        {
            "review_text": "such a smooth game. much satisfying assassin-like experiences. gives you confidence in your own abilities in life.  Rating: tom cruise/ tom clancy",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous.This game is even better than Chaos Theory! ",
            "review_score": "1"
        },
        {
            "review_text": "If you like killing brown men with a knife, this game is great.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 another good splinter cell by sam fisher",
            "review_score": "1"
        },
        {
            "review_text": "What kind of game nubisoft make,when you bye the game for the first time server will crash bla bla,how the time go on the game have so few players in the game so it's not worth buying like every nubisfot game!",
            "review_score": "-1"
        },
        {
            "review_text": "I miss the original voice actor. It really hurts the game without him. Gameplay is solid, but the story is pretty weak.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great... Err AWESOME... Going covert is really fun and all. But the story lacks depth and is extremely short... BTW uplay is the worst piece of spyware i've ever seen. That's why I don't recommend it",
            "review_score": "-1"
        },
        {
            "review_text": "I get more angry playing this then Flappy Brid",
            "review_score": "1"
        },
        {
            "review_text": "this game like all splinter cells is da bomb you have to play it excellent story and multiplayer ",
            "review_score": "1"
        },
        {
            "review_text": "very spy game. u do spy in it.  10/10 would spy again",
            "review_score": "1"
        },
        {
            "review_text": "These 20 mins i 'played' were all starting the game the see the same ♥♥♥♥♥♥♥ error of no uplay. Spent tireless efforts in finding solutions none worked. I couldn't even start UPLAY, when i install uplay and start it up, it goes into an endless loop of updates. Thats not all, AFTER that when i start it again it doesnt even ♥♥♥♥ing open, so i have to reinstall and hope for that one chance of this incompetant application to work. I would slap the person who thought it was a brilliant idea to make uplay. Uplay more like UDontPlay",
            "review_score": "-1"
        },
        {
            "review_text": "A fun and challenging stealth game sure to test your skills in stealth and patience. Great fun.",
            "review_score": "1"
        },
        {
            "review_text": "Unmatched campaign and multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Clunky controls, repetetive gameplay, and a lazy story make for a pretty weak game. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "its fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Nice, fun and if you are interested in this kind of game, this one is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Stealth, epic, graphic and gameplay all mixed together. One of the coolest stealth games on the market 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this games selection of weapons. Even better is the way to create loadouts I customise your play style through missions",
            "review_score": "1"
        },
        {
            "review_text": "cool but the nutshack is cooler",
            "review_score": "1"
        },
        {
            "review_text": "Very, very bland overall and the graphics are underwhelming. If you have a friend to play with it makes the experience far better. I personally preferred Conviction to this game. The running story is very generic and never accentuates on any interesting aspect of it, it just moves right along from one mess to another. Still a fun stealth game but it definitely has its faults.",
            "review_score": "-1"
        },
        {
            "review_text": "Too many hackers in the multiplayer, too many.... Cool game if you play coop.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't play it. Uplay crashes every time I boot the game. A dozen fixes later and still unresolved!!!",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME,YOU WILL NOT BE ABLE TO PLAY ONLINE AND UBISOFT WONT FIX THE ISSUE.CONTROLS AND MOVEMENT WERE 100 TIMES BETTER IN CONVICTION,YOU HAVE BEEN WARNED!!!  Edit:In order to play online I had to use another Uplay account which would be frustrating for those of us who played other Ubisoft games.Now then,the online portion is not too bad,for veterans the classic mode is a welcome gametype.The mercenary vision modes are pretty much gone,have been substituted by passive upgrades to your helmet and you can only have one at a time I beleive.Unless I am crazy there is also no flashlight in blacklist mode for mercs either.You can get melee kills on mercs from all sides rather than just from behind,something Im torn about but with the gameplay changes it makes more sense.What I think is really dumb is how they made the AK47 the most powerful rifle in the game even though the SA58 shoots a bigger bullet.  You can also use SMGs and pistols as a spy but they are best used as a distraction depending on the amount of armor the Merc has.The moving between cover system is also gone for the spies in multiplayer. I think they did a better job with tailoring single player to the new pacing they set for the game.There are some action sequences that seem like a direct confrontation is inevitable but you can still take them out with stealth if you are careful.While Ironside is gone I wish they at least got a older sounding voice actor for Sam.This game just took what they did with Conviction and made it all better with the exception of the context sensitive controls.Still it fails to reach the bar Chaos Theory has set and I doubt any other Splinter Cell they make will ever do that again.I would not recommend this for those who loved splinter cell before conviction unless you got it on sale like I did.",
            "review_score": "-1"
        },
        {
            "review_text": "I had a great time the first week I had the game. Everything worked fine ,but later uplay (the spawn of satan) screwed me over. I couldn't connect to the online services and now I can't refund this peice of garbage. Thanks uplay I wish you had never existed.  I am pretty sure the only reasoned it worked initially is so that i would play it with my friend for so long that I could not refund it. If you are looking for a great story this game is for you. ",
            "review_score": "-1"
        },
        {
            "review_text": "I have two major complaints about this game. The first one is game related: The controls are badly written and slow to respond to commands. The game seems to have it's idea of what you should be doing and seems to resent if you want to do something different. This is makes the game frustrating and unenjoyable.  However my biggest complaint is Ubisofts crapware DRM garbage: uplay. It won't let you play the game you bought unless you have an active account, doesn't give you the option of where it installs itself, and probably phones home with private information. I'm really sorry I bought this game now, and I for certain won't be so trusting of steam and certainly won't be making as many purchases since I'll need to read, research and investigate all the games from them in order to not get bent over again.",
            "review_score": "-1"
        },
        {
            "review_text": "very very easy",
            "review_score": "1"
        },
        {
            "review_text": "The game has negative mouse acceleration which should never be on a pc game that requires a mouse. The game also require UPLAY which is a third party install, if they want their product on steam they should not be allowed to use their own plateform. I already have steam and don't want UPLAY.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a good game but the only problem is UPLAY!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Online/Co-op is brilliantly done! Campaign could be improved. Not the kind of game you get obsessed with.",
            "review_score": "-1"
        },
        {
            "review_text": "It was all fun and games until I realized it was a DLC game last minute and it wasn't the full game and than this 'wonderful' thing called Uplayed just made it all that better. Loved splinter cell but probably shouldn't have bought it from steam.Yay to blowing $30.00 on BS.",
            "review_score": "-1"
        },
        {
            "review_text": "I have removed this game from my hard drive with sad wimper as my love for all things Tom Clancy died, It was, is, and will alwyas be extremely disapointing.   Unlike the first 4 or 5 games in the series this game feels more like a pvp game that had a campaign mode thrown together using the MP maps. Every board is a continual string of small linear walkway into our next square slightly asymetrical MP area with intermitant cutscenes. You can feel how the goal of the game mechanics was balanced for pvp play and not a classic stealth experience, using a shody cover system that you constantly move off of without warning. Thats before you get to the sound mechanics, so utterly stupid, as I creap up behind a NPC blasting an AK47 at someone else and he hears me, Really he can hear me moving over gunfire? I also constantly felt like they were forcing me into gun fights, or I would have to skip my ogh so sweat methodical killing. Stalking and Killing things in the darkness is why I buy a stealth game. After a while I just started playing it like a 3rd person cover dynamic game until I grew bored. But if you like playing dress up they got you covered, multiple outfits and guns that all do roughly the same thing but you can make them pink or blue, because we all want to be the first virtual stealth fashionista! Finally on two sperate occasions I cleared an area out only to have all the NPC's respawn after a cutscene, unforgivable, this isnt Game of Thrones, that which is dead, should stay bloody well dead.  save your money, unless you like PVP games",
            "review_score": "-1"
        },
        {
            "review_text": "Nice plot, great gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun enough, but Uplay is an absolute nightmare. Want to play multiplayer or coop? Ubisoft puts a big wall up with Uplay. Forcing you to jump through hoops and navigate in an out of the game just to connect. It interrupts the experience, feels cumbersome, and makes me not want to play. All so Ubisoft can try and sell me stuff i dont want to buy through their inefficient channel, and so they can presumably track every consumer data point they can about me.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY! It has been a very long time since Ubisoft was made aware of a problem with their DRM that causes the game to crash every25 minutes on many machines. They have done nothing to fix it. Stay away! Had they addressed that issue I would reccomend the game, but really, Ubisoft doesn't deserve your money, buy another game instead.  UPDATE: After updating my machine to windows 8, I managed to get the game to run. I really enjoyed it. It was a fun, engaging game with good replayablitiy. It's a pity that it's a Ubisoft game though, their front end interface and lack of any assistance to windows 7 users (During a time when many people still had windows 7) force me to leave a negative rview, It's a pity companies take no pride in their products anymore and just want to shovel them out to get onto the next one. I think long and hard before buying any game from Ubisoft because I know even if the game is good everything else will be terrible. Terrible support, terrible front end, and worse, the money I pay goes to the people responsible for all the terribleness, I hate rewarding idiot suits for their bad choices. Great game, awful publisher.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY! It has been a very long time since Ubisoft was made aware of a problem with their DRM that causes the game to crash every25 minutes on many machines. They have done nothing to fix it. Stay away! Had they addressed that issue I would reccomend the game, but really, Ubisoft doesn't deserve your money, buy another game instead.  UPDATE: After updating my machine to windows 8, I managed to get the game to run. I really enjoyed it. It was a fun, engaging game with good replayablitiy. It's a pity that it's a Ubisoft game though, their front end interface and lack of any assistance to windows 7 users (During a time when many people still had windows 7) force me to leave a negative rview, It's a pity companies take no pride in their products anymore and just want to shovel them out to get onto the next one. I think long and hard before buying any game from Ubisoft because I know even if the game is good everything else will be terrible. Terrible support, terrible front end, and worse, the money I pay goes to the people responsible for all the terribleness, I hate rewarding idiot suits for their bad choices. Great game, awful publisher.",
            "review_score": "-1"
        },
        {
            "review_text": "Tom Clancy’s Splinter Cell Blacklist nice gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Spend one hour to try make a co-op match. Ofcourse didn't work, thanks Uplay!",
            "review_score": "-1"
        },
        {
            "review_text": "I started playing splinter cell games when i was young, starting with the first one ive played them all, this is a good installment of the series, with hours of tension and fun, and a few things that hold it back from being a realy great game. The good: Splinter cell style fun, never gets old interesting story with a few parts that actually made me 'holy sh$t' out loud customization is both good and bad, but i had fun for the most part. splinter cell  The bad: characters are really cliche; the hot fast talking no nonsense female, the nerdy IT guy complete with smarmy lines and cardigan, the tough black dude with gravelly voice, the sumbag criminal whos always talking stuff There are bugs, if you see a checkpoint and you run towards it, you can get shot in the back and fall over the trigger dead, and the next part will start. Enemies are dumb, i mean elite iranian commandos will see 2 knocked out comrades, search around for a while and then declare ' i guess its nothing' crashes ocasionally  Overall i recommend playing this game, but wait till its on sale, its a lot of fun",
            "review_score": "1"
        },
        {
            "review_text": "Game-play/keyboard input is unpredictable (half the time I fire from a hidden position nothing happens). Linear play is overwhuelming, you have almost no ability to use the environment around you and can only follow a narrow path through the game. For example, in the initial missions roofs and alleys that you would think are part of the environment are locked off.  As an open-world game this would be great...but its neither open nor great.",
            "review_score": "-1"
        },
        {
            "review_text": "I jacked off to this game. 35 hours of man butts got me going. Man butts even look good with night vision too. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would stealth again.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't really know how to explain, it's just not really a splinter cell game, I can see it enjoyable for those that never played the classic games when it's just one way to that place and do that. You can't even interrogate the enemies anymore to get out information from them.   You get rewarded more for being loud and kill everyone instead of being silent and sneaky. Enter and leaving with no trace was like the main thing with Splinter Cell that made the game good. Now they encourages the player to go all 'TANGO 3 OCLOCK, RPG! FIRE AT THAT SOLDIER YEAH!!! BOOM BANG RATATATATATATATA'   The missions are boring and linear like I mensioned before, you go from point A to point B. That's it, When you do some cool stealth, well, that was suppose to happen in the game, you didn't do it, the game made you do it. The enemy don't go weary freely, something that I would expect to be a thing at this point when the game have existed for so long, they just patrol at the same places over and over and over and over again.   But for my rating, if you never played Splinter Cell, get it and enjoy. You're like me, played all the classic games and expect something like the old one with cool new graphics, well... tough ♥♥♥♥, don't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible. just ♥♥♥♥. I saw on options that there was first person. theres first person for 30 seconds of the game. And the 3rd person shooting and aiming is just ♥♥♥♥. Then you come to getting shot in co-op. You take 2 bullets and 10 seconds later your dead and you have to restart. Theres no legit way to pass this ♥♥♥♥ing game",
            "review_score": "-1"
        },
        {
            "review_text": "so good id suck its tampon if it was a girl and lick its diper if it was a baby i love it so much id but ♥♥♥♥ it",
            "review_score": "1"
        },
        {
            "review_text": "The clunky controls, the crashes, and UPLAY, don't make this game worth my money.",
            "review_score": "-1"
        },
        {
            "review_text": "attention: LETTERBOX EFFECT ! you cant deactivate the letterbox effect, some widescreen displays work without it.  but dont expect it to run properly on 5:4, for example (1280x1024) ubisoft stinks. ♥♥♥♥ing ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥t dialogue, no real use for gadgets, gunplay is horrid and inaccurate... Conviction with more shadows. Sam became a typical movie spy who makes stupid choices. Too many cheesy 'jokes' in dialogue, it's like 2005 Teen-rated game bad. Sam isn't a wise spy anymore... AND THE ♥♥♥♥ING FIRST PERSON SHOOTER SECTION. NO.  Really, just go get Chaos Theory. Hell, I enjoyed Conviction more than this. Every minute of this game, I was just boiling.",
            "review_score": "-1"
        },
        {
            "review_text": "My review for every Ubisoft game ever: Ubisoft has great ideas for games, and thats how they get you, but they never test or finish any of their games.  Like every Ubisoft game, this game is riddled with glitches.  I only recommend this game for people who like being unable to move their character, seeing floating stuff for no reason, encount terrible AI, deal with horrible menu layouts, bland characters, terrible story and boring missions. Ubisoft has apparently forgotten Sam's age and was not able to figure out that a 30 y/o dude wouldn't have a 24 y/o daughter.  R.I.P. Ubisoft  Splinter Cell Conviction was the last game I ever enjoyed from you and it was unfortunely a terrible PC port  I hate this company more than cancer, aids and the holocaust",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, a game deserving of the title Splinter Cell. Another Clancy masterpiece.   10/10 Story, co-op, and multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but Uplay bogs it down.",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy this crappy game:  - You can open fire kill through most of it. - Countless invisible walls (Sam likes to run against thin air). - Dumbed down stealth (forced in some areas). - Linear levels that force you down a path from one patio to another. - No Michael Ironside! The new voice actors sound generic and like hipsters. - Weak story like something ripped off of primetime TV (idiot box).  - Boring stereotype characters that spout mindless lines like a bro movie. - Marking targets makes for easy one click kills. - No freedom to make decisions (can't kill irritating story characters). - Forces you to instal UPlay (silly Ubisoft trying to compete with Steam).  It's soo bad I wish I could remove it from my library entirely. Out damned spot! Out! &gt;:(  Only play this game if you're the sort who embraces sim-walkers made by greedy corproations with writers and developers who think their audience is stupid. Don't questions my intelligence Boobysoft.   I loved the original three splinter cell games but things went downhill with Double Agent, worsened with Conviction and hit rock bottom with Blacklist. The series is now unrecognizeable from the original game. Looks like Ubiosft did with Splinter Cell what Eidos did with Thief, turn it into low grade mush for the masses. If you're a fan of stealth there are better options out there liek Dishonored, Deus Ex or Hitman. Even those don't compare to the first two Thief games. Stealth is dead and mass marketing gaming for morons with 2 second attention spans killed it :(   Onto better games! Play Witcher 3 or GTA V instead ;)",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Spies VS Mercs game ever made.  Second worst multiplayer.  Can't speak to singeplayer, oh well.",
            "review_score": "-1"
        },
        {
            "review_text": "i couldn't invite my friend to play coop and that made angry :/ i paid money for nothing",
            "review_score": "-1"
        },
        {
            "review_text": "Piece of sh*t port from a piece of sh*t company. Their own piece of sh*t Uplay doesn't cloud sync, nor does Steam. Every last issue that pisses PC gamers off about the money grab ports exists here as usual. Ubisoft should be ashamed, but will just continue to screw PC gamers over.",
            "review_score": "-1"
        },
        {
            "review_text": "If your looking for a review on this game you've come to the wrong place, but if your looking for an outstanding cheese cake recipe you've come to the right place.  Ingredients:  1 cup digestive plain sweet biscuit crumbs 3 tablespoons sugar 3 tablespoons melted butter 40 ounces softened cream cheese 1 cup sugar 3 tablespoons flour 1 tablespoon vanilla 1 cup sour cream 4 eggs  Directions: For The base:. If you're using a dark pan, preheat the oven to 350. If you are using a shiny pan, 375. Combine the crumbs, melted butter and 3 tbsp sugar well and pat onto the bottom of a 9 inch springform pan. I also like to very very lightly butter the sides of the pan so that the cheesecake will not stick later on. Bake for 10 mins in your preheated oven and remove. Let it cool while you prepare your batter. For the batter:. Make sure everything is at room temperature. Combine sugar, cheese, flour and vanilla in a big bowl and mix on medium speed till well combined. Don't forget to scrape the bowl as you're doing this. Mix in the sour cream till its incorporated well. Then, add the eggs one by one, mixing well after each addition. Pour the batter into the springform and let it bake for 1 hour and 10 minutes After the baking time, turn off the oven and leave the door ajar. Let the cake cool in there for about 1 1/2 hours. Remove the cake and let it cool thoroughly. Refrigerate overnight. Release the sides of the springform. Eat.",
            "review_score": "1"
        },
        {
            "review_text": "Tom Clunky's Utter Garbage. First of all no Michael Ironside (He's old, we needed a new actor capable of doing mocap, ♥♥♥♥♥♥♥♥, you just decided to cut corners and spare some money), The core concept of the game is flawed. The game doesn't reward stealth, there is no reason to use it whatsoever, it's just a plain console shooter with clunky mechanics. AI is terrible, taking down dumb ai-bots grants no satisfaction, this crap should have stayed where it belongs - on consoles. Oh yes, and coop connectivity issues that are still not fixed 3 YEARS LATER. Why bother. Yay, The good old Splinter Cell games are long gone. RIP.",
            "review_score": "-1"
        },
        {
            "review_text": "great game! hard to get used to the controls but once you master it, it gets very easy and you can start doing some pretty cool stuff in both multiplayer and singleplayer.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is perfect example of what modern stealth action should look like. Game is the great mix of traditional Splinter Cell games mechanics + slick movement and good narrative from Conviction. And most importantly Spies vs mercs is back! I am not the big fan of 4x4 matches, but classic 2x2 feels and plays amazing.  Cons: -Uplay(during my playtime uplay made me want to delete the game couple of times, good thing i am fan of Sam Fischer stories) -No DLC with maps for multiplayer\\co-op, which is really dissapointing  P.S. Ubisoft stop making ♥♥♥♥♥♥ games and get back to your Tom Clancy's roots!  And yeah, regional localizations policy is bs, will never buy another ubi game, untill they bring back multilang system",
            "review_score": "1"
        },
        {
            "review_text": "Great game once you get past the initial bugs and stuff. One of my favorite Splinter Cell games so far.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very fun to play &amp; just take out enemies. I fear for what this game has for you after you beat the story. But overall a very fun balanced game, a bit buggy. The main issue is Uplay-an essentially useless program for ubisoft gaames. Uplay sucks.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ ♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Great game, awesome storyline. The splinter cell series has always done it for me, and blacklist is at the top of its game.",
            "review_score": "1"
        },
        {
            "review_text": "when you download the game its going to make you download UPlay, but i already had it cause of far cry so not a big deal, but possibly problematic for other users",
            "review_score": "1"
        },
        {
            "review_text": "Both singleplayer and co-op modes are great :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Play it on the hardest difficulty and it's a ton of fun with great everything. I give it solid 9/10 and haven't touched the MP yet which everyone says is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Great concept for a game. Ruined by Uplay. Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "MOST UNDERRATED GAME OF 2013   I have over 293 games in my Steam account and I still keep playing everyday SC:Blacklist. This game is so good, the story, gameplay, graphics. I recommend this game to everyone in the real life. It must be played with a controller otherwise I think it wouldn't be that good. So many awesome items to purchase and customize with in-game money you earn when passing missions or playing online. Story mode is long enough to make you happy and quite a few extra missions that can be played in co-op with a net friend. The online mode is very hard if you use a controller and communication with other players is not that good. There is no server browser.   PROS: Music Gameplay Graphics Story Full x360 Controller Compatible Very realistic animations, including facial (They used actors and motion detection) Sound effects are realistic  CONS: Uses Uplay (Sometimes you may have troubles or forget password) Multiplayer game doesn't have server browser You can't switch to KB+Mouse in-game if you are using a controller (would've been useful to play as MERC online)  Personal Score: 9.6/10 Verdict: Game gets so intense that makes your heart pumping hard.  I purchased this game while on 75% sale but would buy full price when 2015 is launched.",
            "review_score": "1"
        },
        {
            "review_text": "Badass. The best Splinter Cell yet!",
            "review_score": "1"
        },
        {
            "review_text": "This game by far is one of the best games i have ever played so far in my life. It reminds me of the game Dishonored which the way you play it reacts on how the enemies are going to approach you. I personally prefer being stealthy, but sometimes i make a mistake and ends up going to have to run and gun. The multiplayer and the co-op part of the game is also unbelieveable (which i would to have more people have this game) I highly recommend it if you like a game like Dishonored or if you like being stealthy while having fun with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "If you are interested in playing CO OP or Multiplayer, dont bother buying this game. If you do get it to work it takes days if not weeks of troubleshooting. Waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, especially with friends. Splinter Cell rarely disappoints.",
            "review_score": "1"
        },
        {
            "review_text": "Best Stealth Series to exist.",
            "review_score": "1"
        },
        {
            "review_text": "Such a Stealth gaming i likee that.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game",
            "review_score": "1"
        },
        {
            "review_text": "Not bad at all, I think this Blacklist is like a perfect mix between the first SC chapters and the last one, Conviction, which was the one with more action sequences and less stealth, so one of the most criticized of the whole saga. Subterfuge is back again, but the fun part is that you freely decide how to take missions, three different approach styles are available and many different routes through fairly big levels give you a rather good decisional power.  Unfortunately the story is full of cliches and I think the 'USA under attack' theme has tired everyone, but fortunately Sam Fisher is a powerful main character as always; this together with the challenge given by higher difficulty levels (start from Realistic at least) and a well programmed AI, help the player in taking the single player campaign to an end. Then you can try the Spy vs Mercenaries multiplayer modes, or coop together with a friend in dedicated levels, but I had an hard time finding someone, so until now it was a solitary experience for me.  Technically Ubisoft made a very good work with the abused Unreal 3 engine, animations are smooth, facial expressions realistic, textures have a good detail, special fx on par with the actual generation, nothing jaw dropping but everything is at its place. The sound compartment fills the frame with a nice techno thriller soundtrack and good effects. I found that movements and acting were smoother and faster in this game, I was able to pass from action to stealth in a matter of seconds and in general Blacklist's gameplay is less restricted to fixed moves and let you experiment and be more flexible like never before.  I liked Blacklist, I don't know if more than my previous favorite (Chaos Theory), but the two are near each other. Don't be afraid, stealth is again a viable way to play, I played the whole campaign using Ghost mode, realistic difficulty , without killing a single man, and it took me about 23/24 hours. Now I have some coop mission to play solo and I hope to be able to try multiplayer. There is a lot of content in this game, if you liked and played all previous Splinter Cells I really suggest you to play Blacklist, you will not be disappointed at all!",
            "review_score": "1"
        },
        {
            "review_text": "Second best Splinter Cell game",
            "review_score": "1"
        },
        {
            "review_text": "I have finished the campaign only, and here is my review  Pros - decent gameplay, with DIY style combat or none of it if you so choose. -AI is kinda smart but predictable  Cons -Sam Fisher new voice, Huge NO NO... I understand the isonside is too old to do the motion capture but which smartass thought that you cannot mocap with one fit guy and record ironside for his voice..... - the cover system is a bit tacky or sticky at sometimes....  -fairly linear level designs, sure you have multiple entrance but it doesnt feel as large as it should -Did anyone play test the final boss fight on PC? because it seems that the devs thought the mouse behaves the same way as the analogue stick on a controller, you have to max your mouse sensitivity just too do that QTE..   ",
            "review_score": "-1"
        },
        {
            "review_text": "If you have played other splinter cell games, then you know what you are getting in to. You have the same mission designs as the previous games. The only big difference is the graphics, which are quite good. I never got the multi-player co-op stuff to work. I tried several times, but UBI's match making system never found a co-op partner. Perhaps the that part of the game scene is dead or UBI's servers just suck.  I need to remember, the next time I buy a splinter cell game, that I am getting tired of thier basic forumula. Also I am tried of the crappy game design as you get closer to the end. To me, this kind of game is supposed to be a stealth shooter. Tward the end, it seems to want to be a normal shooter where the non-leathal / stealth approch do not work. For example there are 'armored' dudes which for some reason are immune to stun mines / arrows as well as poison gas. You have to get into a fire fight if you can't avoid them which pretty much voids the stealth aspect. Often, toward the end, you have rooms full of these guys to cross. The only way to deal with them, I found, is to find a defensive spot, like an air vent, and just pick them off one by one.  Anyway, this is a good game despite being somewhat formulaic.",
            "review_score": "1"
        },
        {
            "review_text": "Got killed by a Roomba on multiple occasions. Although, I feel like this would produce a mess, rather than clean one up.  10/10 Would clean carpets again.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a great stealth game, look no further. This game has great controls, good 3rd person camera tracking, amazing visuals, and the stealth is pretty realistic (I think the shadows are a little OP though). I played on normal and the game was challenging but still fun and not frustrating in any way.  I give this game a 9.5/10 because there was one part I didn't enjoy, and without giving too many spoilers, there is a part where you jump through a window on a train, and even on normal I got shot down and killed before I could even move my character which made me have to restart from checkpoint about 5 times.  Anyways, all in all an excellently made stealth game, defintly worth a buy, especially when it is cheap as chips in the steam sales! :D",
            "review_score": "1"
        },
        {
            "review_text": "Way better gameplay, graphics, physics, and story (imo) than the previous games. Decent length and challenging as well. Only downside is I couldn't find anyone to play the several co-op only missions since the game has been out a few years now.",
            "review_score": "1"
        },
        {
            "review_text": "ive been a splinter cell fan since the first one blew syphon filter away, n i love the old syphon filter series. blacklist is the best sc to date n my ghost in the shadows has an itchy trigger finger awaiting the next sc if we ever see a new one",
            "review_score": "1"
        },
        {
            "review_text": "Great Story on Singgle Player, Funny Co-op and Multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining game; a good sequel to SC: Conviction. I recommend to anyone who enjoys stealth and action games.",
            "review_score": "1"
        },
        {
            "review_text": "Best stealth game 2014 by a mile.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool and nice game, nice gameplay etc... nothing bad ingame. BUT you cannot load saved games. you have to start a new game every time start the game. i m not the only one with this 'save bug'. lots of players have this bug. and this bug appears in 80% of the ubisoft gamesi bought. so dont buy any game from ubisoft, even if they are good games for a low prize. you have only one time fun with the game, at the second day you have to play everything again. but the worsed thing is, that the 'support' of ubisoft doesn't help you.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great masterpiece, still like the old Sam Fisher, brutal, sadistic and deadly. good story lines, filled with new gadgets and varied, unlike previous Sam Fisher in Splinter Cell: Conviction are all very limited and gadgets are not many. Splinter Cell: Blacklist like Splinter Cell in general, it's just that this game is set in modern times such as Splinter Cell: Conviction are fulfilled by the elite troops like Ghost Recon: Future Soldier.  I recommend this game for you, you have nothing to lose, long storyline and epic, a lot of new things you will find here!",
            "review_score": "1"
        },
        {
            "review_text": "Playing on perfectionist mode is such a thrill I can't even explain it. So I won't. Just know you can buy this game and not regret it if you enjoy stealth games.",
            "review_score": "1"
        },
        {
            "review_text": "Prettttttttttttyyyyyy good for a Splinter Cell without the Ironside. Still confused why and how Sam Fisher seems to keep getting younger, but hey. What do?  The MP is pretty fun, surprisingly. There IS a Create A Class system in play, and this game has a bigger emphasis on co-op than the previous Splinter Fishers. Missions are a bit more challenging than Splinter Sam: Conviction (which is good). You can try to be a Ghost's Shadow or play like it like a Dutch ♥♥♥♥♥ House, and you don't really get penalized unless the objectives say not to play like a Dutch ♥♥♥♥♥ House.  All in all, Sam Cell: Blacklist is good - when it works. I'd suggest disabling Uplay's Cloud Sync since it's works when it feels like it.",
            "review_score": "1"
        },
        {
            "review_text": "Worst Splinter Cell ever made! Side missions are impossible even on easy.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Another beta-phase game!  5 (short) coop maps .. and they are buggy",
            "review_score": "-1"
        },
        {
            "review_text": "First of all: i do enjoy this game a lot. it is very well done, the story adds up perfectly and seems to be thought through all the way (it's not even THAT predictable), the game mechanics work on a quite intuitive basis and the overall product seems to be of high quality. now in my opinion there are only two things wrong with the game. the minor problem is the controls. it has it's flaws but i can live with that. maybe it would be best to play the game with a gamepad but you'd have to sacrafice some accuracy while aiming. i don't like playing shooters with gamepads and that leads to the second MAJOR problem: i don't see Splinter Cell: Blacklist as a classic splinter cell game. splinter cell is not supposed to be a shooter. it should be about stealth and trying to keep your surroundings untouched. to be clear, it is indeed possible to play the game in this way but there are many situations and many circumstances that prevent this game from feeling like a real Splinter Cell game. in the last few years i noticed a certain 'dumbing down' of all the games out there and Splinter Cell was unfortunately a victim as well. Remember when there was a meter for visibility and for your level of sound that you produce? Gone. Now all you need is a shadow. Even in brith daylight a shadow will provide enough shelter to make you invisible. Remember when you actually were able to regulate how fast Fisher was moving? You still have that but you can choose between running and sprinting. Even while crouched he 'walks' way too fast.   Those are just two examples of the things that  I THINK  are wrong with the game(you can't count the thing with the controls. it could be me being too stupid to be able to use them correctly). I was promised a similar experience to the 'old' Splinter Cell titels. Well, I was dissapointed in that sense but as I said, I still enjoyed the game. Not because it's a great Splinter Cell game but because it is a great addition to the Splinter Cell series. It feels a little like a reboot to me. FYI    the story is pretty short but awesome :P   ",
            "review_score": "1"
        },
        {
            "review_text": "A mix of the old and the new Splinter Cells. Best of both worlds!",
            "review_score": "1"
        },
        {
            "review_text": "'I thought it was silenced'  *Exit game*",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty good, worth the price i paid. Still lacks the awesomness of chaos theory",
            "review_score": "1"
        },
        {
            "review_text": "best stalth coop series. story in this game is ♥♥♥♥ but... gameplay is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the series of Tom Clancy's, stealth is my style",
            "review_score": "1"
        },
        {
            "review_text": "This game is solid!!! Lots of fun and I like the options you get for completing a mission.   The way the game gives you money to purchase black market items is kind of lame but eh, not a deal breaker!!!",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Perfect for those who love Stealth Style games, and the best its CO-OP missions!",
            "review_score": "1"
        },
        {
            "review_text": "WOW I BOUGHT THIS GAME A WEEK AGO AND NOW THEY DROPPED THE PRICE $45.00 WTF.... SPEND HARD EARNED MONEY AND NOW OUT $45.00",
            "review_score": "1"
        },
        {
            "review_text": "Warning: You have to download UPlay to play. Ball ache I know. However: The games good. Go loud or go quiet. Murder everyone or just knock them out later.  The guns and equipment are set up for either play style or even a bit of a mix if you fluff up a little. Although the equipment screen isn't the most intuitive and honestly I haven't noticed much difference between the armour and the stealth levels the game is still pretty good. I typically gear up for all of the ammunition slots I can get.  Story is predictable but the mechanics are the gameplay is pretty smooth. The controls aren't the most intuitive on a keyboard but then I don't often play third person games with one so that's probably just me. Although the game is fairly linear the areas are wide enough with different routes that you can honestly play this game pretty much how you want. I'd still reccomend it just for the satisfaction of hiding behind a box, coughing, then pulling the resulting investigating guard around your cover and punching him in to unconciousness (or you know, stabbing him in the face).",
            "review_score": "1"
        },
        {
            "review_text": "Great and wonderful game. Immersive story that can be played either through by going stealth, guns blazing, or advoiding all the guards all together. Then there is co-op with a variety of missions that you can do. And the multiplayer is just amazing. Its first person stealth vs. third person loud. Only problem is that there are some hackers out there.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game in series.   Multiplayer is the higlight in this game. If you have friends to play with. You can play in numeros way:  Stealth Rambo style or something in between!  Lot of customisation, weapons, suits, gadgets...  This game is 95/100 for me!",
            "review_score": "1"
        },
        {
            "review_text": "Ghost man kill terrorist scum. Tis goodly for the soul.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good if you bother to spend time to go into 2 different platforms to play.  If you want to play CO OP or multiplayer, well... You can't. The server simply denies access, the only ways to resolve this issue is to troubleshoot your way through using several different methods that other users (NOT UBISOFT ) has found. The game is out for nearly 2 years and yet the problem is unattended for, simply disregarded. Spent money, time and effort to enjoy a game with your love ones or friends, just to face a error message. A virtual slap across the face, as a reward for trusting UBISOFT.  if you think you would like to play a game with your friends on the PC... Look for another game, trust me, your time and money is more well spent.  IF ANYONE THAT IS AFFILIATED TO UBISOFT IS READING THIS (doubt so)  Please help those who wants to play, enjoy and have fun. Many of us spent money on your game hoping for a complete game but what was given to us was book with half of the content missing, a bowl of milk with no cereal, an incomplete product. We love splinter cell, but this love doesn't feel welcomed. ",
            "review_score": "-1"
        },
        {
            "review_text": "Brilliant game. One of the best of 2013. I feel like its a game that returned to what made the series great in the first place, while keeping many of the better aspects of the previous title, and tossing away the over simplification of previous title in the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Brings back the good splinter cell series. I love it",
            "review_score": "1"
        },
        {
            "review_text": "I was enjoying this game but then had to get off. When I came back I had lost all of my progress, as if I had never even started. Can someone please help me, has this happened to anyone else?",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Rewarding kills -Fun stealth -Other styles of combat than just stealth  Cons: -Ubisoft -Ubisoft -Uplay -Ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "I love the action but just make sure that you have a good computer to play this besides that great overall",
            "review_score": "1"
        },
        {
            "review_text": "How can this game be cheaper than modern warfare 2???",
            "review_score": "1"
        },
        {
            "review_text": "Tom Clancy's Splinter Cell franchise has ultimately culminated into a shining, smooth, fluid gem that is Splinter Cell: Blacklist. That's not to say the game is without flaws, but overall, Blacklist is enticing enough to where even I, a relatively casual fan to the franchise, keep coming back for more.  Gameplaywise, the game is superb and offers players many different routes to complete their objectives, and though the story line is a little linear, it is very interesting and well acted by the cast (though we will all miss Michael Ironside). Overall, this game gets an 8/10, a very decent game and worth checking out",
            "review_score": "1"
        },
        {
            "review_text": "Just started playing after having it in my lib for a while, and yes, I like it! ",
            "review_score": "1"
        },
        {
            "review_text": "Insanely tight and fun single-player. Gorgeous graphics. Innovative and addictive multiplayer. Brimming with content. Seriously one of the most advanced and jam-packed games on Steam. Get it!",
            "review_score": "1"
        },
        {
            "review_text": "to sell more copies they tried to have more action sequences..... so if u like call of duty buy it i guess",
            "review_score": "1"
        },
        {
            "review_text": "Huge fan of the splinter cell series since the first one. good return to their roots after the last game but Ubisoft needs to fix online co op, a friend and i played fine together last night and this afternoon we cant even get into the same lobby. really looking forward to being able to play with my friends.",
            "review_score": "1"
        },
        {
            "review_text": "Co-Op is so much fun in this game, and the Single player is great! Reminds me of the original Splinter Cell.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome campaign absolutely flawless! Coop missions are great besides glitches in the later ones... Multiplayer is not worth playing if youre not into first person games, but hugely recommended for the campaign and sheer awesomeness! I have replayed this game over and over again on increasing difficulty and obtaining all available extras which adds extra spice to the missions. For replayability on a stealth game I rate another splinter cell game 8.7/10.",
            "review_score": "1"
        },
        {
            "review_text": "cool 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun characters. Fluent movement and action. Decent story (feels like a movie) but somtimes stealth isn't fully encouraged, but when it is possible, it is an amazing feeling. The game has creativty on your equipment, (unlike the linear designs of the first game) and each level gives you a way to acomplish your goal. If you like games that immerse you in the world and make you feel like an agent, this is most definetly your game. Overall rating 9/10. If the game was longer and put more emphasis on stealth, I would have given this game a solid 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Bought the game because it was on sale, finally. Was looking forward to it. Downloaded pretty quickly, only took less than an hour. BUT...  The game doesn't work at all. Keep getting an error 'Uplay.exe - Entry Point Not Found' saying 'The procedure entry point cef_v8value_create_object_with_accessor could not be located in the dynamic link library libcef.dll.' Personally, I have no idea how to fix this. Can anyone help me?",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty fun campaign. If you like stealth games you'll like this. As for the multiplayer, it currently has a pretty high skill curve due to the fact that there aren't many new players anymore so most still playing are veterans. However, once you get the hang of Spies vs Mercs, it's one of the more interesting multiplayers in my book.",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft has once again made the PC version of their game buggy to the point of being near unplayable. 15 hours in and after what must have amounted to over 30 crashes I've come to a point in the came where regardless of what I do I can't play for more than thirty seconds without the game freezing in place and refusing to close forcing me to sign out and back into my account on Windows simply to force close the program. As for the actual gameplay, it's basically the previous title, conviction, with unfun, out of character for the series action moments that completely derail the genre this game is supposed to represent. On top of that the stealthy areas of this game have been toned down from even conviction's lessened overall difficulty level. And the new voice actor for the main character is a significant let down, he now sounds like every call of duty protag thrown in a blender, gruff and bland. Also the character's faces are just weird I don't even know how to discribe it it's like their eyes don't match the rest of their face. Ultimately a huge let down. Reissue Chaos Theory you've killed this series.",
            "review_score": "-1"
        },
        {
            "review_text": "To me, Tom Clancy's Slinter Cell Blacklist was a great game. Splinter Cell Blacklist is a third-person stealth-based shooter. Through the use of a variety of weapons - ranging from assault rifles to sniper rifles to an electrifying bolts shooting crossbow - you usually have to infiltrate a building, capture a target, or kill one. When playing on the hardest difficulty it really is a challenge to remain undected, as shooting your way through the game will become very, very difficult. Like a large variety of modable weapons, there is also a large numbers of gadgets to aid you, for example a recon drone, sleeping gas, or - if you're more of an assault style player - proximity mines and breaching charges. Next to the singleplayer campaign there are also some co-op missions (2 players max.). Some of these can be played singleplayer as well - making them more difficult, of course. I really enjoyed the game, and I recommend it, but be aware of one thing: the singleplayer campaign is short, so you will have finished the game in approximately 15 hours. The storyline is not extremely good, but still okay; the gameplay is great, and that's what I value most. There is also multiplayer, but, unfortunately, there are no people who play that anymore. Finally, the graphics are pretty good, and the game does not require a very strong pc to run it.",
            "review_score": "1"
        },
        {
            "review_text": "Good storyline - 9/10 If you want to play Multiplayer, I highly recommend you play with friends. Some people you encounter playing random games don't have the brightest ideas.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter cell good players: The secret is stealth. I as a noob player :Just rush p90.",
            "review_score": "1"
        },
        {
            "review_text": "  Splinter Cell Blacklist; A unique and fun Stealth game that delivers hours of entertainment and scrathes the stealth genre itch",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.  Pros -Great graphics -Decent story -Time put into animations -Finished with story? play merc vs spies or something else -Voiceactings.... Well, meh.  Cons -No anti-hack -Bad music -Very expensive game",
            "review_score": "1"
        },
        {
            "review_text": "Co-Op is so much fun in this game, and the Single player is great! Reminds me of the original Splinter Cell.",
            "review_score": "1"
        },
        {
            "review_text": "The death of the Splinter Cell Franchise, horrifically unbalanced game",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game! Hoping for an expansion pack or follow on from here.",
            "review_score": "1"
        },
        {
            "review_text": "Does not support higher than 60hz. Update: they have updated the game to support higher refresh rates. Game is a worthy successor to conviction. Very similar playstyle. When everything is upgraded though and you have the crossbow, the game is still easy even on perfectionist, just like conviction was too easy.",
            "review_score": "1"
        },
        {
            "review_text": "  This game... is f*cking amazing! I love the stealth (although it is a bit wonky at times). So many options to customize the character and stuff such as sonar. And as someone who was born and lives in Estonia i love that there is a mission that takes place here! I did experience some issues with the key that is required to open the game, but that is fixed now (all you gotta do is wait with that issue). Basically this game is one of the best games i have ever played, i love it, and it's worth every cent (not that i bought it, a friend bought it for me lol).",
            "review_score": "1"
        },
        {
            "review_text": "  I like that teamwork",
            "review_score": "1"
        },
        {
            "review_text": "Never got tired.Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a game tha Ubisoft didn't ♥♥♥♥ itself while making, which makes it quite good.    7/10",
            "review_score": "1"
        },
        {
            "review_text": "Spend 4 hour on 1 mission with my fr...but its worth",
            "review_score": "1"
        },
        {
            "review_text": "awesome game ! rate it 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "ok i would say this game is ok for buying it do need a beefy sytem for you to fun it as long as u have 1gb gddr5 everthing low and fxaa on 45-60 fps ",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game with very amuzingly glitchy gameplay",
            "review_score": "1"
        },
        {
            "review_text": "The game's pretty fun. It can be frustrating at times, but what steath game isn't? Multiplayer is pretty buggy. It kind of sucks to finally find a good player for co-op, and then after getting almost to end of the mission having the game CTD. However, when it actually works it's extremely fun. The story is great. It only hints at Conviction's story line near the start of the game only to brush it off, and NEVER bring it up again. Which was a litte dissapointing seeing as I thought Conviction breathed new life into the series. The ending was more confusing than anything else. It just seems to end with no explanation as to why. If it was a ploy for DLC/ the next entry in the game, then it was done horribly. Although the game is really fun. Not worth full price, which made me glad that I wanted until it was on sale to get it. Still, it's worth a playthrough if you're into the Splinter Cell series.",
            "review_score": "1"
        },
        {
            "review_text": "I am a huge splinter cell fan. Played all of them since the original on the Xbox. I must say though... There hasn't been a good splinter cell game since chaos theory, and I saw they were bringing back spies vs mercs so I had to bite. It seems as though the fruit was forbidden. I am plagued with low FPS and game freezes even on minimum video settings. I play this on a custom built PC, no laptop. From what little I have played this game seems awesome. Until I can play it I will not be endorsing it to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best Splinter Cell games to date, really good single player campaign, the co-op missions are good fun alone or with someone online. The spies vs ops online is also enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "It's a lot of fun. You shoot mans, you play Barbie with Sam. If it goes on sale like in the Christmas sale again pick it up but pick it up with a mate so you can do fun co-op action.",
            "review_score": "1"
        },
        {
            "review_text": "buillshit... coop doesnt work. disabled firewall on both ends, opened ports. dont work.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has solid mechanics and it is beautifully rendered. The animations in this game are superfulous. If you loved multiplayer in any of the other splinter cell games that is here and just as fun. There are some minor glitches and game crashes but most games have those. I really like how replayable each of the missions are.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't really enjoy Conviction as it didn't feel like a stealth game. It was basically an action/adventure game with stealth put in. The older Splinter Cell games (such as Chaos Theory) were primarily stealth games and that is what us fans were used to and loved about the series. And it's because of that reason I decided to give Blacklist a chance because it looks like it's gone back to its roots. So what we have here is a combination of elements in past SC games and elements from Conviction, neatly bundled into one fun game where stealth is your best friend. Sure you can take the louder approach and shoot everything (and everyone) in sight but what's the fun in that? Shooting out lights while hanging from a ceiling pipe, and when your prey comes to investigate and passes it off as a faulty bulb, you leap onto him to finish him off with your knife.... Now that's what Splinter Cell is all about!  I haven't completed the SP campaign yet but what I did play so far is good. The graphics are slightly outdated but that's not to say it's poor. Plus, I get a consistent 60fps when playing this so that's defo a plus in my books. Spies vs Mercs online game mode is back where two teams of 4 face off. That was one of the most of fun and unique online memories I had since the PS2 days and I am glad this mode is available on Blacklist. Also, co-op. Lot's of co-op missions makes this the most complete SC game to date.  I don't have anything bad to say except for the lack of Michael Ironside. He will be missed as Sam's voice actor. The new fella is okay I suppose but he sounds too youthful and seems out of place at times. Ironside's voice felt powerful. He made Sam seem like this old timer with tons of experience on the field. Someone you don't wanna mess with in some dark alleyway. New fella..... sounds like a generic action hero. Well that's it from me! I do recommend this game! 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "aside from a few irritating bugs, this game is fantastic. It takes a little while to get used to, but it's a great game that goes back to Splinter Cell's stealth roots.",
            "review_score": "1"
        },
        {
            "review_text": "DAM THIS IS ONE OF THE BEST GAMES I HAVE EVER PLAYED! AMAZING MULTIPLAYER (unlike the standart shooters like BF3 and call of duty) TRY IT! WORTH EVERY BUCK!",
            "review_score": "1"
        },
        {
            "review_text": "For the most part, Blacklist succesfully combines the depth of the classics with the fluidity of Conviction. Sprikle in some added features and a fresh coat of paint and you have a game that while not perfect, is worthy of the Splinter Cell mantle.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell: Blacklist is a decent follow up to the much more action focused Conviction, but as usual with games form Ubisoft you have to deal with the horrible UPLAY experience; frequent crashes, stupid connection issues etc and the game suffers from 'consolification' (dumbed down, no proper save funtion, flawed Steam integration and crappy controls). Graphics and sound are ok but nothing special.  The single player part of the game is quite nice, ok but not excellent. You have a little more sandbox freedom than in Conviction and the tools at your disposal promotes a stealthy style. Most things are an improvement from Conviction, except for the NV/Sonar Goggles that are completely and utterly USELESS in Blacklist. (yes they can be used to spot mines, but what is the point when I can see the mines without goggles anyway?) In Conviction they were an important and essential gameplay mechanic. The game feels similar to Hitman: Absolution and the stealth mechanics have improved, but still not better than in good old masterpiece Chaos Theory. Sam has acess to a huge number of gadgets and weapons to fiddle with but none of them really feel game changing or more than occasionaly useful in the single player missions as a Ghost. It also feels quite weird to carry a pistol, an assault rifle, a foldable crossbow, plenty of ammo for all weapons, a small drone, grenades, mines, etc and still be an agile wall climbing ninja. It would be much more cool to have a carry weight mechanic that gives me better stealth when sacrificing equipment. Map design ranges from nice and open enviroments to closed one-way corridors and the difficulty does not scale at all with game progression. Some areas really stand out as great sandbox-stealth playgrounds though, with multiple paths and many ways to achieve your goals.  Enemies AI is no different than in other games but a really nice addition to the game is that some patrols change - one time a guard will block my ninja-stealth path, next time he will be in a different area of the map. Nice! Also the guard dog is a new type of enemy that can be very frustrating for the Sam the Ghost.  Controls work ok but not perfect, it feels like the game was made for console controls and then ported to PC without making use of the huge advantages in a keyboard and mouse interface.  About 80% of the game is quite easy to get through first time even on Perfectionist difficulty and mainly non-violent, that was a major dissapointment to me. Some parts was really tricky in a good way and makes the game shine! But when it comes to the remaining 10% someone on the dev team thought it a good idea to spice things up with forced action movie style scenes that are really corny and completely dispels immersion. Yuck. But then the story to begin with is not exactly original and interesting... Evil terrorists from the middle east and Africa are threatening 'Murica blablablablabla etc. The end of the game was one of the worst in any game that I have ever played - completely void of all logic, pointless and so annoying with stupid frustrating QTEs. Stop that ♥♥♥♥ you lazy ♥♥♥♥♥♥♥s!  Coop missions and Mercs vs Spies are great things and are really cool, with the small problem that you only rarely can connect to your friends so the concept kind of fails... The day Ubisoft learns to write proper networking code is the day we achive world peace and poverty and starvation is no more. Only in dreamland that is. If Ubisoft would start to sell their games without the Uplay-mess and with proper Steam integration instead I would gladly pay 10Euro more/game.  Do I recommend you to buy this game? If you can grab it at a discount price then yes if: 1. you like casual stealth action with a cheesy story 2. don't mind all the Ubisoft crap, a weak story and don't plan to play any coop missions with your friends. Just don't pay full price and expect a polished AA game. ;) 6,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! I just threw someone I knocked out with a stun gun into a hot tub! Game of the year 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is good in every aspect. Maybe this is not like splinter cell 1 or Chaos Theory, sure they had the best taste. But Blacklist just offers you more gameplay routines, you're bored by going soundless all the time? Bring that assault rifle with you and start shooting. Yes, it's not suits Sam Fisher, yes it is not how splinter cell should be. But we still have stealth don't we? Also, don't hesitate to use that karambit, because Sam surely knows how to make art with it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a stealth game, with limited paths, a feature that will play it for you, and ubiquitous lights that cannot be harmed with any gun or gadget. What an abomination. It's a complete mockery of the series, trying to be Call of Duty and killing itself in the process.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best stealth games I've ever played, you really have to think about every situation. It's not just go in kill them all complete mission.",
            "review_score": "1"
        },
        {
            "review_text": "Other than Sam having a different voice actor, this game kicks ♥♥♥. Lots of side-missions and it isnt as stealth-focused as the original games but it does have more stealth than Conviction so whatever.",
            "review_score": "1"
        },
        {
            "review_text": "First off let me just say when people comment saying how it wasnt that much of a stealth action game and that they ruined the franchise and how the other splinter cell games were better i played and beat some of the other ones and this one is the best splinter cell that was ever made if the gameplay was changed a little well im glad that it was. the way they changed it made me feel more bad A♥♥ so it was a good conversion the structure of the game was better than all the other ones. this game is one of my favorites on my steam library, get this game it will feel wierd to play and a bit hard to control during the first time you play but give it a little time and youll feel like a pro the music is also 10000% better than all of the other games. 100/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, true to Splinter Cell origins, splendid stealth action. Sam is a little 'grimm', but that comes with age. Storyline a little cliché but very action packed missions and side quests. Nice high-tech feeling, adrenaline inducing cutscenes and great voice acting. Interface design is above average and integrated to the gamplay. Metagames are also funny, sort of small scale Carmen Sandiego.",
            "review_score": "1"
        },
        {
            "review_text": "All around bad game.  Bad mechanics A step back in acting Bad mission goals Pathetic and supernatural (unbelievable) upgrade trees.  Rediculous mission requirments that stop you from playing the game the way you want.  Don't buy this, not even when it is $5. Go play Conviction (if it will run for you.) ",
            "review_score": "1"
        },
        {
            "review_text": "Boss as game but definitely get DLC Its AMAZING!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. While the decision to change the voice of Sam Fisher from Michael Ironside was a little offputting at first, the new guy utterly nails it! This game plays like a movie, one I'd gladly own at that. From the very beginning to the very end I was hooked on the story. New gameplay mechanics were done very well. I like the character development a lot. All and all, I think Ubi really nailed it.",
            "review_score": "1"
        },
        {
            "review_text": "Had this recommended by a friend really good game even with the new voice for Sam, doent let the series down.",
            "review_score": "1"
        },
        {
            "review_text": "No cloud saves for U play and you need to do Single-player to get the co-op missions to pop up.  Oh and the 'Stealth' in this game is laughable. All you do is whistle and the enemy strolls over even though Fisher is literally sticking his head out of the cover. Plus the new voice actor for Fisher sounds too young for somebody who is supposed to be 50+ years old.  Do yourself a favor and get Thief Gold or Thief 2 if you want a stealth game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the best games I have ever played, completed the campaign, which has an amazing storyline, I got the Deluxe Edition when it was on sale for around £8 and I've been having fun playing this ever since I bought it. Definitely recommend it to anyone looking to buy a stealth game...",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Conviction. Story was generic. Not much character development for Sam and the gang. No Michael Ironside. This game was just about a break even proposition for me, but the insistence on Uplay tips it into the 'No' category.",
            "review_score": "-1"
        },
        {
            "review_text": "very good game with lots to do,can be quite challenging",
            "review_score": "1"
        },
        {
            "review_text": "I confess, I am a Splinter Cell fan boy. The previous iteration (Conviction) gave me one of the best co-op experiences in my lifetime, but the single-player campaign was a bit too fast-paced/shootery for my Splinter Cell cravings... it was still a lot of fun, though. I just finished the single-player campaing of Blacklist, what a fantastic experience! The perfect equilibrium between a faster pace &amp; the good old Splinter Cell feeling has been found. I have not played the co-op levels yet, so can't comment on that yet unfortunately. I highly recommend this game, both to Splinter Cell enthusiasts and new players.",
            "review_score": "1"
        },
        {
            "review_text": "To keep things short: Blacklist finally dethroned Chaos Theory as the best game in the entire series.  Unlike previous Splinter Cells, you're not punished for using alternative methods. As a matter of fact, you're rewarded for doing things your way.  You want to play it classic without getting caught and knocking out as few people as possible? Welcome back to old school.  You want to kill your way through silently? That's fine.  You want to barricade up and just have firefights non-stop? Load up the ammo.  Blacklist gives everything to everyone while still maintaining its combat evolution from Splinter Cell: Conviction. Online multiplayer isn't completely dead and the coop missions as well as the side missions are great and give a lot of post-game content.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who has never played a Splinter Cell game i went into this game not knowing what to expect.  Turns out it's really ♥♥♥♥ing great.  - First of all the graphics are very up to date (atleast if you put them all the way up) - The look and feel of the game feels very polished, it does not feel like a bad console port. - The default control scheme is pretty much the way you'd expect it to be, almost perfect but there is always a few tweaks you can do yourself. - The only experience i have so far with the game is in CO OP. And the CO OP missions are all very different with good level design, interesting gameplay and high replay value. -There is a also a good bit of customization, upgrades and little gadgets to buy in the customization menu.  Conclusion? 8 / 10 Do recommend. Even with my limited playtime.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell: Blacklist is the return to the classic style of Splinter Cell if you want it to be. If you play in perfectionist mode and attempt to only go for the 'Ghost' playstyle, the game plays like the sequel longtime fans have been waiting for since Chaos Theory. The sole drawback might be the fact that the game will occassionally push you down a linear path or clearly telegraph the proper way to avoid detection when Splinter Cell in its heyday left that for you to discover. Other than that, it feels like a fair and modern update to what made the series great. I'm even willing to look past the jackrabbit cover to cover system because it does feel organic to the stealth.   However, Ubisoft and AAA gaming in general have changed a lot in the past decade. Game design simply does not allow people to get stuck anymore because frustration doesn't sell DLC. So you get the option to play the stealth lethally, as in Splinter Cell Conviction, which was a fun game, but far from a Splinter Cell game. You also get the option to just assault every enemy in the level, which quite frankly baffles me considering that completely changes the genre of the game (Just buy CoD instead). But mercifully, each of these approaches are entirely optional. Fair enough.  But what annoyed me was when the game would deliberately force you to use one of those play styles. It seems to me that if you're given the option to play your way, you should be allowed to stick with that option, considering you upgrade your equipment in the manner best befitting your playstyle. At the end of the first mission for example, you are assualted by waves of guards and told to protect an asset. The only option is to gun all the guards down, considering stealth is impossible because they are coming from all sides. I died over and over again trying to do it, because I had spent the bulk of the level avoiding detection completely and was not prepared to suddenly go the other way with it. Doesn't seem very fair.  Finally, there's the story and presentation, which is just, absurdly, D-movie quality bad. Those of us who've been around since the beginning of the Tom Clancy era might remember that Tom Clancy games traditionally didn't expend a lot of effort on a story. Bad guys were over there, and you had to go stop them. Even as recently as Rainbow Six: Vegas, this was more or less the case. I guess there's something about the fact that Splinter Cell features the same protagonist over and over again that made Ubisoft insist on trying to build a story and characters around him, which was never the strong suit of the Tom Clancy game universe. Double Agent was a strange divergence from the Splinter Cell formula, and Conviction followed in much the same vein. I at least give Conviction credit though for moving like a breezy summer blockbuster (and being about as challenging to get through as sitting and watching a movie). It was wacky, high flying adventure, but not really a Splinter Cell game.   The alleged 'return to roots' that Blacklist is intended as unfortunately carries far too much of the blockbustery cheese picked up in Conviction, compounded by some seriously terrible writing and compounded still further by the fact that Ubisoft apparently thought it was okay to change Sam Fisher's voice after Micheal Ironside made the character iconic across the span of five games. The new actor fits in with the rest of the cast though: the generic black guy serving only as operational support, the absolutely insufferable 'nerd,' and Anna Grimsdottir, a series regular whom Ubisoft also apparently saw fit to revoice after five games being played by Claudia Besso. The dialogue is cliched to the point of being cringeworthy. Micheal Ironside's iconic growl at least leant Sam Fisher a degree of credibility, but the twenty-something hipster voice he spouts out now: 'I want us on the ground yesterday' without a hint of irony would be well at home in a Micheal Bay movie.   And then you get the nerd making jokes at inappropriate times, and the black guy mumbling about 'operational readiness.' All this aboard some kind of plane that we never see the outside of that makes the members of the 'Fourth Echelon' (all five of them, counting the Asian guy who doesn't have any lines and sits in the corner) about as believable as government agents as S.H.I.E.L.D. Not to mention the horrific enemy dialogue. You'd think the writers would save themselves the trouble by just having the characters speaking their native languages, but instead I laugh my ♥♥♥ of when I hear two Taliban insurgents having this conversation (related to the best of my memory): 'Have you ever been in a fight?' 'Yes.' 'What's that like?' 'Well, when the bullets start whizzing past your head, you can only do too things: resign yourself to death, and start doing things that are going to get you killed, or resign yourself to life, and start doing things to kill the enemy.' I threw a noisemaker to draw them apart from each other during this conversation, one of them took a half step away and then said 'its probably nothing, anyway, about war-' I guess its impossible to stop such a compelling conversation.   In the end, treat Blacklist like a classic Tom Clancy game. Skip the cutscenes, don't listen to the dialogue, and just play the game. If you're a lover of Splinter Cell, its gonna come through for you. If you're new to the series, this is what real stealth should be, lurking under the surface of a cheesy presentation.",
            "review_score": "1"
        },
        {
            "review_text": "I like to ♥♥♥♥ people from above.",
            "review_score": "1"
        },
        {
            "review_text": "Great but better if played with an additional player.",
            "review_score": "1"
        },
        {
            "review_text": "Although the game was enjoyable, I still feel the game developer has lost some of the unique characteristics of the old Splinder Cell games. It is defintely a lot better than the last installment, i.e. conviction. Hope they will give us a more stealthy kick-♥♥♥ secrect agent game as the classic ones, and less shot-them-all.",
            "review_score": "1"
        },
        {
            "review_text": "I've really missed games like these. Fun... hard... incredible graphics. Mastering the paths takes good timing skill and patience. Overall a lot of fun through character progression. And the story line seems to be pretty good so far.",
            "review_score": "1"
        },
        {
            "review_text": "It needs another online account (uplay) to be created before you can play, which is a bit tedious and intrusive - if you look right down the bottom of the Steam page you can see this is mentioned on light gray text on a dark gray background, so they really do draw your attention to this annoyance up front.  (And, while it does not allow obscenities in the user name, it does on the email address you use...)  Note self - do not buy ubisoft games.  On this basis it gets a 'not recommended'.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, and a great Splinter Cell game. The SC1 &amp; 2 were some of my favorite games. The last few have been mediocre at best. This one really reminds me why I liked the first two. That said f***ing hate the dogs.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this Game ♥♥♥♥ u Steam i hate u",
            "review_score": "-1"
        },
        {
            "review_text": "Very good stealth game with a good story.",
            "review_score": "1"
        },
        {
            "review_text": "Worst Splinter Cell ever made! Side missions are impossible even on easy.",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked the gameplay mechanics of Splinter Cell: Conviction, then you will probably like this title. There is a lot of upgrading to do in this game: weapons, ops suits and home base. The money for upgrades comes from missions, challenges and finding collectibles. Each mission is scored on the number of accomplishments in three categories: Ghost (non-leathal stealth, highest reward), Panther (leathal stealth) and Assault (run-and-gun, lowest reward). Players are encouraged to stick to one style in order to 'master' the mission by reaching a certain point total, but the player can use any combination of the three throughout the mission. In my opinion, Assault doesn't fit very well in the context of this franchise, but maybe that's because the playstyle just doesn't appeal to me.   If you play games for the storytelling, then you might like this game. The voice acting and dialog are very good in my opinion, but there is a new voice actor for Sam Fisher. I thought he did a great job, but this change will surely put off some people. The story seemed like a typical Tom Clancy story to me, and I enjoyed it.  The game world looks very good in my opinion. Paladin reminded me a lot of the Metal Gear Solid aesthetic, which I liked. Unlike most Ubisoft games of late, the menu system doesn't have unnecessarily long transition animations.  The only issue that I had with this game is that the ending cinematics did not load for me. The audio and subtitles played, but I was stuck with a blank screen. I watched the ending on YouTube in order to see what I'd missed, because I was too angry to replay the entire last mission just to see if the cinematics would actually play correctly.  I enjoyed my time with this title, but I didn't feel the same urge to immediately replay it that I did with Splinter Cell: Conviction.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell Blacklist is my favorite stealth game of the year, perhaps even contender for GOTY. I loved Splinter Cell every second I played it! Stealth system is close to flawless, graphics are beautiful, and the upgrade system is amazing! One major problem with Splinter Cell is that the sound is pretty bad, I could never tell how far a enemy was from me, and it felt like a pretty big set back. Other than that the game is great!",
            "review_score": "1"
        },
        {
            "review_text": "A much better Splinter Cell game than conviction, which returns the series to the stealth side of the table while still retaining the mark and execute and more violent features of other recent titles in series. The story is so so and the graphics are visibly aging.   This game is running on an extremely updated version of UE 2.5 and while the lighting and level design can often be impressive characters can look like wax dummies and the game as a whole looks a little dated. The voice acting is solid and while the new Sam does a decent job he is no Michael Ironside (may not be an issue if you are not a series fan).   Nevertheless the gameplay is solid from start to finish in all three phases (SP,MP and Co-op). Levels feel varied and open, although more open environments are always welcome. A few small escort sections aside the game rarely holds your hand and this is a welcome change from other more action oriented games.  Whether you choose to tackle Blacklist as a stealth game, an action game or something in between you will almost certainly have fun with it. Play it with the lights down and the speakers up...few other games make you feel like such a bad ♥♥♥.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic addition to the splinter cell series.",
            "review_score": "1"
        },
        {
            "review_text": "Not as bad as conviction but nowhere near the greatness of the previous games. Alright/10. Cop on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Frigging great. Kept all the neat things Conviction added (mark+execute, focus on fluidity, etc) while also dropping all the trash. Most important of all, non-lethal playthroughs and hiding bodies are back!",
            "review_score": "1"
        },
        {
            "review_text": "Overall with all the hype over games now days there are very few that live up to their expectations. However, Splinter Cell Blacklist is unique in that it sways away on its own path away from all the multiplayer run and gun Rambo nadefests and actually has a decent campain solo and coop where the functionality runs somewhere between Ghost Recon Future Soldier and the old Rainbow Six Vegas 2 game. Actually the game is more adventuresome than most in that it causes the player to think like a true spec op and act as one. The run and gun form of play doesn't work in this environment. I think that the tactical squad approach as is in Splinter Cell Blacklist in gaming is the only pure part of gaming left these days amidst the the multiplayer Hackfests that the major name game makers allow to happen without enforcing fairness and hack prevention. This game is for sure an adventure in tactical gaming. I give it a thumbs up and would recommend to all comers.  Frag said it, SOK Fraggenstein Admin of Spec Op Killers Elite Tactical Team Gamers",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is so good and the game is so intense. Worth a try",
            "review_score": "1"
        },
        {
            "review_text": "If you loved chaos theory versus mode,you will find some things missing like nightvision the epic roll and some gadgets,but the mercs are much more versitile which is nice.one thing that i hate about this is that the spies can kill you from the front,so dont be surprised if you see a guy running straight at you,but it is still a lot of fun,the class customization is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "50% this Holday..  Great game for SOLO and COOP, and Multiplayer...",
            "review_score": "1"
        },
        {
            "review_text": "1 of the best games ever",
            "review_score": "1"
        },
        {
            "review_text": "Great game once you get past the initial bugs and stuff. One of my favorite Splinter Cell games so far.",
            "review_score": "1"
        },
        {
            "review_text": "This game really challenges you to do the best you can and become a ghost. Awesome gameplay and game style.",
            "review_score": "1"
        },
        {
            "review_text": "Back to the way Splinter cell should be. Good story, good stealth, and Sam's a badass with gadgets.",
            "review_score": "1"
        },
        {
            "review_text": "Splinter Cell has always been one of my favorite stealth games (right up there with Deus Ex) and Blacklist is cerainly no exception. I genuinely feel as if this is one of the few franchises out there that has consistently gotten better with each new entry. That being said, a good bit of Blacklist is taken from Conviction and revamped or overhauled while the rest is all new; this is speaking purely in terms of gameplay and mechanics mind you.  Everything can be customized this time around. Your weapons. Your gadgets. Even your suit - which is segmented so as to offer customization on a piece-by-piece basis. Said upgrades arepurchased with cash, which you earn by completing mission objectives and the like. You're given up to three loadouts to tinker around with for easy access, too. Your mobile command center - a flying fortress that puts Airforce One to shame - can also be upgraded in a variety of ways to help missions go more smoothly. Pretty straightforward stuff that still adds a lot of depth to an already amazing game.  There's a bit of an open-world free-roam aspect to the game. Don't get too excited though as it's not what it sounds like - and let's be honest, legit open-world free-roam would pretty much kill a game like this. Still. What they've done this time around is tie the multiplayer and co-op missions into the game in such a way that you can transition between them and the single-player missions seamlessly from the mission map aboard your mobile command center. You can even have the game find a partner for you if you're lacking chums who play the game or they're just offline and of course there is a matchmaking system in place for the multiplayer. All missions (single-player or otherwise) can be replayed at any time, just in case you missed something or you just happened to really enjoy yourself the first time through.  The story is great too, of course! Sam Fisher has aged quite well over the years and is still a proper badass, having finally been given command of his own team and operation. Unfortunately, the circumstances are rather grim - a group of extremists calling themselves the Engineers have threatened to attack a major US city once every week until every last US troop is brought home from overseas. An ultimate deadline of one year was given and it's anybody's guess what happens when the year is up!",
            "review_score": "1"
        },
        {
            "review_text": "Has got to be one of the best Splinter Cell games yet, I would highly recommend the game, Even better with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Like a love-child between Conviction and older Splinter Cell-games (DA, CT etc). Can be played fast paced or all sneaky-like. Several ways to neutralize hostiles (lethal or non-lethal). The multiplayer's balanced and fun",
            "review_score": "1"
        },
        {
            "review_text": "The closest we'll get to playing Chaos Theory again. It even comes with Spies VS Mercs!",
            "review_score": "1"
        },
        {
            "review_text": "Better than Taco Bell.",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining and somewhat underrated gem. So far I've only defeated the solo campaign and played a little bit of co-op (I'm yet to attmept Spys vs Mercs, but there are no indicators that it will be any less fun) and I've thoroughly enjoyed myself. What separates this game from other games under the 'stealth' genre (Assassin's Creed being one of it's competitors, another Ubisoft title, of course) is that it remains true to it's persona. In the most recent Assassin's Creed game, you will find stealth perhaps an effective but altogether entirely unnecessary style of combat. In Splinter Cell: Blacklist it is ESSENTIAL that you use all forms of stealth to your advantage, or you quite simply will not be able to complete any of the missions. Seriously, the game will alarm you when you alert enemies of your presence, and even provide a warning note when you equip an unsilenced weapon that will attract your enemies' attention. Often times, you're better off utilizing the 'Ghost' style of combat where you navigate through a section without alarming or killing anyone at all.   However, it's the wide variety of options at your disposal that makes this game so satisfying. You can take down people using a standard melee apparoach, with the option to do so lethally or non-lethally (although I can't say I see the point in ever taking them down non-lethally, unless you're prompted to do so because otherwise they will eventually regain consciousness). You can stun them with the crossbow or the stun gun, silently dispose of them using a silenced gun, (of which there are many) and even use an opponent as a human shield so their comrades will take them out for you. Then of course there are the non-violent tactics, which entails shooting out the lights so your enemies won't be able to see you in the dark, using ventilation shafts to silently crawl unnoticed above or beneath them, and even drawing their attention by causing a great bit of noise in an isolated area so as to draw their attention and enable you to make your great escape elsewhere.  That's just the tip of the iceberg in terms of abilities in this game, I didn't even touch on all the gadgets you have in your arsenal, or all the weapons available as well. Fantastic game, highly recommend, especially when it's on sale, you can't pass it up!",
            "review_score": "1"
        },
        {
            "review_text": "Blacklist gives a great equipment/weapon, combat and story combination the best you can expect from a stealth action game. Coop operations are amazing and requires good teamwork, you would experience great time with your teammate in missions. Daily, weekly, and between friends challanges are going to call you in duty!",
            "review_score": "1"
        },
        {
            "review_text": "Tom Clancy’s Splinter Cell Blacklist is, put simply, a masterclass.",
            "review_score": "1"
        },
        {
            "review_text": "Rex went for a swim.",
            "review_score": "1"
        },
        {
            "review_text": "First VERY GOOD SC after Chaos theory. Some buggy parts but overall its just bread and butter of SC. COOP is DIVINE experience if you have stealthy sneaky ♥♥♥♥♥♥♥y friends you should play coop with them its MUCH FUN SUCH WIN EPIC FEELZ! Ohh them headshots and animatons straight from assasins creed. LOT OF MADAFAKINGA FUN!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥iest multiplayer i've ever seen in my entire life. the multiplayer is so unbalanced that it ruins the whole gaming experience, i just started playing and i get put into games that are usually unbalanced, the opponents are far higher ranked, or both. this ♥♥♥♥ is ♥♥♥♥ing ridiculous that anyone would even consider playing this if they got to see the mltiplayer before hand.",
            "review_score": "-1"
        },
        {
            "review_text": "It´s a  great game  indeed, but  if you want it to play co-op game with your friend(s)  DO NOT buy it  . Search in the steam forums for 'Uplay problems and coop with friend' and you will understand. But the graphics, sounds, music and singleplayer gameplay is great. If you want only that part go for it.",
            "review_score": "-1"
        },
        {
            "review_text": "I played it on the Xbox 360 and it is a terrific game. I now am playing it on PC using an Xbox One Controller and it is like a Next Gen Splinter Cell game, the Campaign is awesome as well as coop. The game shines with Multiplayer though, Spies vs Mercs is one of the greatest online game modes of all time dating back for me to Pandora Tomorrow. This is the best stealth game out there and it really makes you feel like a bad ♥♥♥. I play usuing a controller as it feels perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.You can revisit and finish former missions with different loud-outs and in different ways.  Co-op is a great experience,though there are rather few number of players online.  The game has an ending bug.  Still highly recommended... ",
            "review_score": "1"
        },
        {
            "review_text": "Let me begin by saying that I like to play Splinter Cell the traditional way. Using a gun as little as possible and moving undetected.  I really want to like this game and I do. I only wish that I liked it a little more. I have played every Splinter Cell from Pandora Tomorrow (the second game in the series) to Conviciton (the one just before this). Really Chaos Theory was the height of this series in terms of stealth gameplay but I also loved Conviction as it was a breath of fresh air for the series. Blacklist is like a combination of the two, which sounds good in theory but is not so in execution. Guards are more alert than in previous games and have a greater field of view. This is good sometimes and frustrating others. For example when a gaurd spots me in the shadows, while I thought I was well hidden. The whistle makes a return in this game but this too can be frustrating. It is difficult to judge the distance at which it is safe to whistle. Whistle from the correct distance and a guard may come closer. Whistle when your too close to a gaurd and he will instantly know your position. This game also marks the entry of new enemy types such as sheilded opponents and heavily armored 'tanks'. This again sounds like a good things but can be extremely frustrating. Many of these enemies can only be taken out from behind which doesnt sound too difficult but remember that the AI in this game is far better at detection than in the past. More than once I have been behind an enemy, about to perform a takedown, when suddenly he detects me. Once a 'tank' detects you theres really no way to take him out until you go incognito again because attacks from the front wont work. Another new enemy is the drone operator. He will send multiple little rc cars driving around to detect you. These are easy to spot but still frustrating. If one spots you if will alert everyone, run into, and explode. The drone operator also blocks your goggles, so no sonar or nightvision until you take him out. Blacklist also features a number of daylight mission. A large number of daylight missions. These missions are not like the jungle in Pandora Tomorrow, these mission are much more like the ones in Conviction. Imagine playing Conviction but every mission is in broad daylight. I enjoyed seeing some new colors but sneaking around in daylight just isn't as fun as in shadows. Also forget about hiding bodies because hiding spaces are few and far between. There really is no point in hiding bodies other than a small point reward which is not worth spending the time to obtain. Stealth feels harder in this game, even more so than in Chaos Theory (which wasn't particularly challenging but I'm trying to make a point) and some how stealth feels less rewarding. The campaign has its moments and truthfully at the time of this review I have not finished the single player campaign. So far it has been pretty decent but it feels a little gimmicky at times. For example I think that one of everyones favorite moments in Conviction was (spoiler alert) runing through Third Eshcelon as it exploded. Well there are a lot of moments like this in both the single and multiplayer campaign. A lot of running through explosions, minus the infinite mark and execute. There are also a few 'Hey, check out our quadrotor' moments in the single player campaign. And making a return from Conviction, there is a first person shooter segment (I know it was third person last time but its a shooting segment) though this time there is a little more stealth involved. Some coop gimmicks work a little better such as a segment where one player controls a UAV providing support as the other makes their way through an alley. But there are also not so good ones such as a segment where both player must literally sit in place and fend off waves of enemies. Honestly the multiplayer is what felt the most like Splinter Cell and I should not that I have never played Spies Vs Mercs before. The game modes are all variations of the classic Spies Vs Mercs (this is included as well). None of these really require too much description as they are not very different from the classic Spies Vs Mercs. If you didn't like that game mode I find it unlikely that you will like the others. I really enjoyed the Classic Spies Vs Mercs game mode in Blacklist and it is some of the most tense multiplayer that I have ever experienced. The third person spies must hack the three merc computers and stay alive until the download is complete. Meanwhile the first person mercs must hunt down the hacker and kill him. It sounds like there would be an easy way to explit this game mode but I have not seen it. Occasionally some one will put a landmine on the computer but there are three of them (or you could destroy the mine) so even that is not too big an issue. When you hear about Splinter Cell Blacklist or watch the E3 demos you expect the best of both worlds. A good mix of Chaos Theory (or Double Agent) and Conviction. The reality is a game that feels like it does neither very well. I had fun with Splinter Cell Blacklist but not nearly as much as I was expecting. If you're a fan of Splinter Cell its probably worth picking up for $5. I got the Deluxe version for $13 and while I'm not disappointed with my purchase I would probably not pay that price for it again. It continues Sams Story, brings back Victor and Sarah, and theres even a few curve balls from Conviction but somehow this Splinter Cell game just feels off. Due to new enemies and daylight misisons this game does not play like Chaos Theory. Due to more alert (possibly too alert) AI and, again, daylight missions this game does not play like Conviciton either. I would give Splinter Cell Blacklist a 7 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "this game wont let me play ",
            "review_score": "1"
        },
        {
            "review_text": "Best Tom Clancy`s ever made, good co-op missions",
            "review_score": "1"
        },
        {
            "review_text": "Wishing i never bought this right now, playability v.poor, i'd go for the FREE Tom Clancy's Ghost Recon Phantoms multiplayer game which is way better than this in many ways from what i've seen so far, i give that game 9/10. dissapointed with this one, will unlikely play again if only to check the multiplayer as i may be surprised but the first few hours have put me off, it's one of those games where you spend forver trying to redo parts of the game. It's more of a stealth game(which i usually love) than a FPS and when you get found your 90% of the time dead...from what i can see. I paid £8.50 in 75% OFF SALE and still feel like i've been ripped! we live and learn, must google next time rather than look at the reviews on the synopsis bit.",
            "review_score": "-1"
        },
        {
            "review_text": "Best parts of Conviction and Chaos Theory in one game. Must play for light and shadow stealth fans.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is awesome, by far the best in the series.  The aesthetic makeover for Fisher and Grim are unexpected, but visually more appealing.  However, choosing to ditch Michael Ironside as the voice actor for Sam? Unacceptable.",
            "review_score": "1"
        },
        {
            "review_text": "Best Splinter Cell to Date!  I played 60+ hours, beat the campaign three times (twice on perfectionist), played all the co-op missions, and played a hefty amount of the spies v mercs, so i know this game inside and out.  Gameplay - Engaging, accurate, hair-raising steath and combat Graphics - Stunning graphics with unique areas, fluid animations, and relatively easy to run Story - Fascinating storyline that encourages unique play throughs each time Online - Co-op missions are fun to play with a friend and spies v mercs is just perfect  Overall - 9.5/10 As close to perfect as a game can hope for, this game will ensure another 10 years of splinter cell!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed Blacklist quite a bit. Heres pros and cons imo.  + Good gameplay + Good graphics + OK game mechanics + Multiplayer not bad + Tons of sneaking + Silent takedown and carrying the bodies + Nice storyline  - low selection of weapons - short story - boring end game",
            "review_score": "1"
        },
        {
            "review_text": "it is sopr flashy and pewpewpew and cool and and adna ada and adna and fun with betfol grafics",
            "review_score": "1"
        },
        {
            "review_text": "This has been one of the best stealth games i've personally played. i am a fan of stealth games, and have played pretty much every Splinter Cell, Hitman and Assassin's Creed (if thath counts as stealth) game out there. and even certain other indie stealth titles such as Mark of the Ninja etc.  To me Splinter Cell Blacklist is right up there in one of the top 10 games i've ever played. and this game is so underrated by many people... Sam Fisher FTW ..",
            "review_score": "1"
        },
        {
            "review_text": "Good Game got it on bargin WOuld spend over 20 bucks for the game though.",
            "review_score": "1"
        },
        {
            "review_text": "Splendiferous.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Very time consuming though.",
            "review_score": "1"
        },
        {
            "review_text": "For the SINGLE PLAYER ONLY... Multiplayer is good if you can find a decent room(1/25ish chance) as the hack users from last year are still around with their instakill at 400yrds while spinning and spamming nades. All in all, spend 2 hours finding a legit game, finally play it, start winning, other team rage quits or host drops, then people reconnect with blatent hackers yet again! The single player, however, is superb. Amazing gameplay that speeds things up a bit. Get ready to think on your toes.  Good: Great single player Well done graphics I personally like the new Sam  Bad: Multiplayer and Ubisofts lack of security(They always have this problem) Spies ARE truly OP in this one, but a good merc settup can help.",
            "review_score": "1"
        },
        {
            "review_text": "A combination of good storyline, graphics engine, and well crafted level design make this highly recommended. Blacklist incorporates lots of customization in regards to gear loadout. The gear loadout itself is impressive with a variety of gadgets and weapons. The level design is well crafted and allows you to choose how you will achieve your objectives; stealth or all out assault. Multiplayer is well designed with the option to play spies vs mercs or coop missions. Yes I recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Great voice acting, Good gameplay,good graphics, intriguing story, great ending. More than one way to play a mission, using stealth or brute force. Main campaign also includes side missions and multiplayer to improve your gear by earning cash.  I have played, and finished, all of the splinter cell games.  I loved this one. Check it out.    ",
            "review_score": "1"
        },
        {
            "review_text": "Great. Recommend this game to all who likes stealth games:)",
            "review_score": "1"
        },
        {
            "review_text": "simply the best",
            "review_score": "1"
        },
        {
            "review_text": "Has got to be one of the best Splinter Cell games yet, I would highly recommend the game, Even better with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Where do I start? The story in Blacklist is decent.. It's pretty much cliched from a lot of action movies.. IN terms it's pretty much 'Guy wants to end the reign of powe the USA has. You're our only hope for stopping him.'.. It's a decent plot but nothing you'll remember. However, the gameplay is what really shines in Blacklist.... Long time fans of Splinter Cell like me will feel right at home with this installment in terms of how it will take stealth gameplay... A variety of non lethal gadgets, google upgrades, level design centered around exploration and stealth, with so much more.. The game also takes your performance on three levels. Ghost, Panther, Assualt. Ghost is centered on all stealth. Avoiding enemy guards, non leathal takedowns, etc. Stealth in this game is the primary focus as playing in a manner for Ghost, will get you the most cash at the end for upgrades. Panther is still being sneaky but you take care of threats with lethal force. This includes but not limited to mines set up on patrol paths, using weapons, slitting a guard's throat, etc.. Assualt was created to appease the ones who wanted to treat it as a 3rd person shooter... Anything from unsilenced AK-47s to grenades that set people on fire... However, Panther is the way to go in this game if you want to kill everything in your path..... The AI in Splinter Cell is not the greatest in the world but for a stealth game, it's probably my favorite. Killing a guard and leaving the body in the open, will have all surronding guards go on high alert. They will change all patrol patterns and begin to hunt you down. If you're spotted, you have a few seconds to take care of the guard before he can shout out that he found you and open fire... Conviction players will notice a few key gameplay elements taken from the game and put into Blacklist. Last known position, is a highlight of Fisher on his last location if the guards are firing on you. This also plays a key factor in Blacklist as well. Once guards find where you are at, all guns are on you and they will supress you. Depending on your location, they might try to go around and flank you or just throw a grenade in your direction. Mark n Excute is there as well, but I barely used it since most of the time, I was killing guards with my sexy knife. In all, Splinter Cell Blacklist will not be a great jumping off point if you're new to the series. However, fans of games like Chaos Theory will be in love with how much Ubisoft had pushed for the game to have stealth.    ***AT THE TIME OF THIS REVIEW, SPIES VS MERC HAD A VERY SMALL COMMUNITY. IF YOU'RE BUYING THIS FOR SVM AS WELL, GO IN FOREWARNED THAT YOU MAY HAVE SOME TOUGH TIMES FINDING A FULL GAME.***",
            "review_score": "1"
        },
        {
            "review_text": "Actually it's more of a shooter than a stealth game, you can go brute-force just fine, except for couple of 'No-detection' missions. The main hook of this game, though is a COOP mode and I should say, it's just not good enough. There is a short story for 2 players that you can complete in half hour or so and several separated missions, embasy 'Stay and defend' kind of missions and classic deathmatch, only here is called 'Spies Vs Mercs'. But if you like Splinter Cell series and you have a friend to play with, it's a okay game. You will enjoy it for couple of hours or so.",
            "review_score": "1"
        },
        {
            "review_text": "Even on the hardest difficulty, the game is too easy. Otherwise, enjoyable. Deluxe Edition content can be unlocked in game (and isn't top tier gear, anyway. Save your ingame money).  Overally, I wish the game was more of a challenge and a little less linear. Still, 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great challenging game worthy of my time. Picked it up on sale makes it even better. Looks great. Responsive mouse control unlike Ghost recon which is sloppy. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Is the server down? how long would does a game server takes before they down it? :) awesome game in my opinion though.",
            "review_score": "1"
        },
        {
            "review_text": "Annoying construct. Silly interface and I don't get the games loadout concepts. 5 out of 10. And Uplay bites hard, deep and long. Game might be reasonably enjoyable (7/10) if I didn't have to deal with Uplay. But the two as a team......... I'ld rather chew aluminun foil. Boring but not as frustrating. I'll never buy another game that goes through Uplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Panther all the way.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best stealth games I've ever played, you really have to think about every situation. It's not just go in kill them all complete mission.",
            "review_score": "1"
        },
        {
            "review_text": "become a panther!",
            "review_score": "1"
        },
        {
            "review_text": "Why aren't we funding this?",
            "review_score": "1"
        },
        {
            "review_text": "Very good game with awesome graphics, story line and quality.",
            "review_score": "1"
        },
        {
            "review_text": "While it wasn't a bad game, it certainly wasn't great. It started grandiose with Call of Duty style action and than instantly lost pace when you were thrown into your plane, Paladin, where you have to choose you missions from a map. Do the side-quests even matter? Why is there coop/multiplayer-only content? ♥♥♥♥♥♥♥t.  The story arc was good, though the dynamic between the characters was a little weird at times. The gameplay was alright. It did feel more action focussed than the previous games. I feel like all Ubisoft games play the same at this point.  Though I can't really recommend this game at full price or even the time spent playing it, not recommending isn't fair either.",
            "review_score": "1"
        },
        {
            "review_text": "First splinter cell I played, and I am planning to play all of them and I have to say I'm impressed. Nice graphics, super gameplay, hardest game ever (on perfectionist) and hardest boss fight ever, I had to switch dificulty to beat Sadiq :) So together it's one of the best games ever...",
            "review_score": "1"
        },
        {
            "review_text": "Open a door, 3 enemies spot me Close said door, back to being undetected  11/10 bug free game would recommend",
            "review_score": "1"
        },
        {
            "review_text": "The best stealth game...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with stunning graphics. Must buy if your a fan of the splinter cell series.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent stealth mechanics",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the original Splinter Cell and Chaos Theory, and are hoping that Blacklist is a continuation of the saga, you are in for a rude surprise. The gameplay has drastically changed and the voice actors are different. Blacklist is barely related to Splinter Cell in name only. Although it is a very good game, it is not we expect from Spinter Cell and I'm disappointed that the developers strayed from the classic game style.   This game also requires UPLAY, which is the only reason give a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "i buy this game and got BEX.",
            "review_score": "-1"
        },
        {
            "review_text": "if they just added random mode, level editor and skrimish, loot and 100 more things, this would have gotten a 10 10. but I give it a 9 9 because it dont have",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: (about a year after this review) Despite having sync on with both installers (steam and uplay) it appears that uplay have decided to delete my save file which includes all my online levels (which took soooo long to get). If you buy this, be weary and backup all your save files or you might find that 100% save file you worked for dosen't exist anymore. YES I AM ANGRY!  While very quirky and strange to new players (such as myself) the controls can take a while to master, but once you do, you won't forget them.  The multiplayer is awful, if not just for the transition of 'Basic' to 'Way-Too-Overpowered' abilities meaning if you're against someone level 52 or higher, You have no chance. Also the matchmaking needs some serious work, Only once have i gotten into a fair game (where levels are equalish on both sides) and that was because it couldent fail, it likes to put max-level-players on one team and low on the other.  The Single player is absolutely amazing and is what turned my thoughts about the game. The story is quite nicely written and put together. It refrences previous games in the franchise but gives a small bit of exposition that feels natural and helps newer players understand.The characters are brilliantly written and feel very real. Well done.  If you like getting though a level without anyone knowing you were there, or leaving 40 unconcious bodies for the cleanup crew to find, you will have fun with this game.  If you think you'll like this title then you probably will.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good in every aspect. Maybe this is not like splinter cell 1 or Chaos Theory, sure they had the best taste. But Blacklist just offers you more gameplay routines, you're bored by going soundless all the time? Bring that assault rifle with you and start shooting. Yes, it's not suits Sam Fisher, yes it is not how splinter cell should be. But we still have stealth don't we? Also, don't hesitate to use that karambit, because Sam surely knows how to make art with it.",
            "review_score": "1"
        },
        {
            "review_text": "to sell more copies they tried to have more action sequences..... so if u like call of duty buy it i guess",
            "review_score": "1"
        },
        {
            "review_text": "Plays like a mix between Splinter Cell: Conviction and Splinter Cell: Chaos Theory. Thankfully, the story is pretty good and the set up is more akin to Chaos Theory than Conviction. If you're having second thoughts about it because you think it did away with stealth then don't worry, cuz it didn't.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of the original Splinter Cell games, then play this on the Perfectionist difficulty setting, which disables a lot of the new-fangled cheapness that was introduced in Conviction. If you play on a lower difficulty where you can use Mark and Execute I think it becomes too easy to systematically abuse it, without it you have to spend more time looking around to find all the alternate paths around things, or interesting ways to position yourself to make quick quiet attacks.  Overall I think the level design was very good. If I found myself struggling in a section, that was usually just a sign that I needed to step back and look around more to spot a better option. Exploration is very much encouraged in this manner, where leaving the the most obvious path will often find you in a far more interesting and rewarding way through the level.  The weapons and gadget upgrades sort of disappointed me, in that they make a huge difference. Once you get fully updated rifles you no longer have to worry about snipers at all, because you can quickly take them down from long range without making a sound. I dislike that the game scales up your situations in such a way that requires you to have more advanced weaponry. You can choose not to upgrade, but if you upgrade nothing you will land in situations that are near impossible without already having a particular upgrade/gadget.  The downside to this version is that there are two side paths of missions that you have to go outside of traditional Splinter Cell to complete. One the forces you to do a lot of gunplay and frontal assault killing, and another that requires you to do online coop play. As much as I've enjoyed Splinter Cell coop in the past, this works better on a console when you can just bring a friend over. It's harder to get another friend to have enough interest to purchase the game as well and I definitely don't want to just jump into what will probably be another terrible online community.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I enjoyed the story as well.",
            "review_score": "1"
        },
        {
            "review_text": "Great game lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Blacklist suffers from what all modern Ubisoft games seem to - extreme non-linier gameplay with more side-missions than main ones. With upgradeable clothing, weapons and gadgets, you're ensured to never be optimised until the very end of the game, and a mission-select map that includes all games-modes, including multiplayer and online, to make sure you always know what you're missing out on at all times.  If you like games that require x4 the amount of time to complete all optional missions than it takes to finish the main game, maybe you'll like this, but having just finished Conviction I was looking forward to a liniar, skill-based game. This one is so chock-full of social ♥♥♥♥♥♥♥t and time-wasting 'replayability' that I was already bored before the end of the first mission. The storyline and characters are so nothing that I zone out during every cutscene, and the gameplay is so trivially win-or-lose that it stops being fun and becomes a race to the end.  This game is a mess and completely forgets what it means to be a story-driven stealth game. But if you like shooting middle-eastern people then maybe it's just what you want. 'murica.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game overall i really like it!",
            "review_score": "1"
        },
        {
            "review_text": "A good Splinter Cell game. I owned it on Wii U and enjoyed it there so I wanted to buy it again and it was even better on PC. Optimization is fantastic and handles well with KB/M.",
            "review_score": "1"
        },
        {
            "review_text": "It isn't bad. Some of the game mechanics are not intuitive. That said, I still enjoy the Tom Clancy games.",
            "review_score": "1"
        },
        {
            "review_text": "Good GAME BUT WHO MADE THIS GAME ARE TO FAT ORE LAZY TO NOT FIX BALANCE in TEAMS AND CANT BAN WALLHACKERS TRY TO FIX IT, BUT campaign is awsome but who is creater this game to to FAt to fix autobalance and wallhackers",
            "review_score": "-1"
        },
        {
            "review_text": "Uplay took my kneecaps but other than that it's pretty maybe possibly okay",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why but in every single game im playing vs cheater speed hack inf and all gadgets no reload fly hack ... And matchmaking is so slow..  If Anyone know SvM Hack add me :D ( JK )",
            "review_score": "1"
        },
        {
            "review_text": "I really love to play this game. IF ONLY UPLAY DID NOT INTERFERED. ♥♥♥♥ up uplay causing all sorts of nonsense ranging from game crashing, failure to save my progress after completing 3 ♥♥♥♥ing long missions, as a result i had to source for solutions online while the support in uplay doesn't even give a single ♥♥♥♥. People who torrented this game are definitely happier than me.",
            "review_score": "-1"
        },
        {
            "review_text": "If once you brought this game from steam you have nothing to do with uplay then this game would be positive. Ubisoft Tornonto made an amazing game but it is uplay that ruins it. Uplay has deleted my save data 3 times consecutively. That's right it deleted my save data three times in a row. I got this game for steam because i thought i didn't have to deal with uplay cancer. I tried to get a refund but i have over 2 hours of playtime. Ubisoft doesn't realize why people pirate their games, they do it so they don't need to deal with this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont understand why people are blaming UPLAY all the time... I have this game through UPLAY and never once had an issue  it is just possible it could be a hardware issue instead of UPLAY   Anyway I love the splinter cell franchise i played every one of them and completed all of them I would highly recomends this game for people who likes freedom to do some missions how ever you like This game i would rate atleast a 4/5 star",
            "review_score": "1"
        },
        {
            "review_text": "  I dont think that there are people prefer the 'Metal Gear Solid' on this game؟؟ A great story, fascinating characters and Style of playing insipid, I think Splinter cell put its good mark in the world of spy games, i am sad because it's finished :) RIP tom clancy .. you made a history by this game . and as sam says : 'there's always different option' by the way this beautiful game its work on 'steam' 100% no problems with it :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, it has graphics",
            "review_score": "1"
        },
        {
            "review_text": "1: Download 14gb with slow internet. 2: Install Uplay. 3: Launch the game through steam which starts uplay. 4: Play the game, press E to kill an enemy which you are charging at &gt;&gt;&gt; Run right past the enemy who does a 420360720 ♥♥♥♥ing no scope and kills you. 5: Try again but in stealth. 6: Hide behind a wall. 7: Enemy who isn't even in the game spots you 8: Destroy everything you ♥♥♥♥ing see because this game is pure ♥♥♥♥ing ♥♥♥♥♥♥♥t",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥ story, pretty fun gameplay. My PC sucks so I get these annoying frame drops. 9/11",
            "review_score": "1"
        },
        {
            "review_text": "Great stealth game! Had fun, reminded me of my days playing metal gear soild on the gamecube",
            "review_score": "1"
        },
        {
            "review_text": "This is such fuc#¤ng ♥♥♥♥ game. Bought this to play with friends in COOP... surprise surprise Uplay ♥♥♥♥ network can't connect to friends... even when I see them online. Ubisoft... get with the times and scrap that ♥♥♥♥♥♥ Uplay for good. Use Steam instead.",
            "review_score": "-1"
        },
        {
            "review_text": "(Review for single-player experience only.) This is probably the best game in the series.  This game is absolutely great and lots of fun. It gives you many options and suits any playstyle compared to the highly stealth-oriented style of the first several games and the more aggressive tone of Conviction. All-in-all, avery aspect of gameplay is fun and very well-balanced.  The story is also interesting. It does not invlove the heavily-secret political espionage theme of the first few games nor the personal vendetta theme of Conviction, but is rather a high-octane thriller involving public political fear and plenty of action.  Overall, the single-player experience is very strong with an immersive story, balanced gameplay, and plenty of fun stealth action.",
            "review_score": "1"
        },
        {
            "review_text": "Hold up, why's the coop tag there again? Ubisoft? hello?",
            "review_score": "1"
        },
        {
            "review_text": "Cool single player and a blast to play on Co-Op.",
            "review_score": "1"
        },
        {
            "review_text": "As much as I despise ubisoft as a company, there's one thing they do better than any other game developer today; asymetric multiplayer. I love this game to death. Getting kills as the spy is one of the most satisfying things I have experienced in any game ever. I feel like such a badass whenever I chain multiple kills together. Dropping on enemies from above, sneaking around them and slitting their throats. Something about this game really gets me going. It's a shame very few people play anymore. I jump on the chance to play with friends whenever I can.",
            "review_score": "1"
        },
        {
            "review_text": "You are a panther.  +++PROS+++  The Story I liked that Splinter Cell had a very grounded protagonist; I thought Sam Fisher's emotional role as a father made his story uniquely about him over all the grand political schemes of other stealth games. The story in this game has returned to a simple Terrorist vs America fight, but it is very well done.   This story is well done for several reasons. We learn to love the team because through plenty of cinematics and dialogue with great direction. They also affect our gameplay; not directly while we're in the field, but we buy upgrades from them. Thanks Charlie!  The enemy is very well done. Cutscenes show us how smart and dangerous they are; we see how the team, the president, and the news reacts to them. We see them in action, operating and executing. The brutality is kept to a necessary minimum; it does not try to shock us with how bad they are with violence and gore; it presents, through the reactions of the world, the significance of their attacks. In addition, the enemy is given a face, the leader. This leader is as well made as the rest of the characters, and, like a good antagonist, attacks the team and gets in very close. We meet this enemy early on, and are fighting them throughout. I think another reason this game's story worked so well was because there was emphasis on the enemy being the whole organization, not just one man. That way, I'm fighting the enemy throughout, not just fighting fodder to get to one man.  The twists and turns of the chase provide a thrilling hunt, and joining the team in the close up shots around the SMI table make you feel like you're part of the team. You follow lead on lead in a game of chess against the enemy, trying to figure out how to catch this elusive enemy; it's not a situation of let's investigate, never encountering the enemy until we have proof to take them down at the end.  I would have liked a new character, as Sam Fisher is getting a bit old. I think the game tries to squeeze in a few years by giving a younger sounding voice actor. I miss the stone edge of Ironside, but this new voice is still gruff enough, though not with the same extreme of Ironside. The voice acting is still wonderful though, subtly threatening and suitably expressive.  Gameplay A lot of stealth games try to allow for varying styles of play; they do this because they couldn't make enough ability to evade pursuers. This game truly has room for varying styles of play. Ghost, Panther, and Assault are all viable and flexible, and players can switch between them; they can go as stealthily as is natural for them. The only things that encourage a player to keep reloading files is frequent checkpoints, the reward system, and a player's own perfectionist compulsion. For my own edification, the flexibility is done through making enough design decisions to accommodate all playstyles, including level design, player customization, multiple methods of execution, and pros and cons of each method.   The levels are a nice maze. There are plenty of corners, covers, lights and shadows, hidden spaces, and vertical spaces. This is what allows players to evade and ambush so well.   I like the enemies, more in terms of their gameplay than their visual design, and their audio dialogues help. Their designs inherently garner a different attitude from the player. The grunt riflemen are fearful fodder that a player hopes for many of. The helmeted ones are annoying, but still easy enough. The amoured ones are brutes to be feared, and the snipers worrisome. The AI itself are tough enough, eventually grouping up back to back, and each class has a different behavior style.  VISUAL/AUDIO The animations are great. Sam moves smoothly, and his poses are appropriately stylized. His crouch is like a panther's, his kills are artful, varied, impactful, and emotionless; you can feel his weight, quietly pouncing. The audio is well suited; most of the sounds are very quiet and minimal, but the necessary sounds of the sharp ticking spotter and voices of the enemies are very clear; you can hear what state the enemies are in.   GAME FEEL Here's a vague dynamic element for a topic. I liked that upon a first playthrough, a player can play very patiently, smartly surveying the area. As they become familiar with what they can get away with, mostly Sam's ability to kill from the front, they start rushing. Thus, they become swift plagues, brazenly speedrunning. This practiced mastery and the reward and upgrade system add considerable replay value to the game.  ---CONS--- I don't like that the weapons have straight upgrades, one loadout that is clearly better than all the rest.",
            "review_score": "1"
        },
        {
            "review_text": "The replay value is there. Nicely done!",
            "review_score": "1"
        },
        {
            "review_text": "Deluxe edition for 3 pounds ?  Yes please",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic, only problem I have is that it's a pain to actually launch the game, it automatically installed a Ubisoft program that try's to connect to the Internet and really slows the launch process if you have no internet, like it fails after loading for ages and then allows u to do it offline etc, really tiresome! Also I try to launch in full screen but it always 'forgets' the setting",
            "review_score": "1"
        },
        {
            "review_text": "So far, so good. This game actually made me fall in love for the Tom Clancy title. Probably the best graphics of 2013, a lot of work was put into that. Also, the gameplay and story, really nice.  One thing I should say is that I would really like tto play a title such as this that has local/couch multiplayer (sharing screen). For me it's something that would make Tom Clancy's new titles uncomparable, if they continue with the good work in graphics and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "so far i enjoy this game and i had played it in a console but this level after i complete the mission it starting to bug out it need to be fix",
            "review_score": "-1"
        },
        {
            "review_text": "The game is amazing. You really feel like this spider ninja ghost type creature as you lurk around varied locations taking out terrorists. The game allows you to customize each way you play meaning you can customize your character and also your loadout that you use. Depending on what you take, it can alter the entire way you play the game. The game provides frequent rewards which you can use to upgrade your weapons, base, gear, gadgets, etc. so there is always an incentive to try make these small achievements (e.g. kill X amount of enemies a certain way, not disturbing guards, etc).  As for the story, it is engaging enough that you care about what happens. There are plenty of side mission too and you can go back and replay missions, meaning there is a decent amount of replay value.  I think this is the best Splinter Cell game.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun to play coop missions, it really is - I haven't finished main storyline, I didn't cared about it.",
            "review_score": "1"
        },
        {
            "review_text": "After attempting to replay this game, and its predecessor Conviction. I find it really hard to recommend either of them. It's not nostalgia either, because SC1 and it's sequels were great in their time and have since aged rather poorly, but altogether I just think it's the Devs fault. It seems like a failure to understand what people enjoy about your game, and a failure to understand the importance of things being constant. I was never big into this series, but I loved the shadow system from SC1 and the speed that things didn't happen in; the slow methodical approach to infiltrating someplace, that is just missing here. A story that is nonsensical for the sake of having something surprise you, the jarring sound of new Sam Fisher's voice, the mission select screen that may as well be made by the Assassin's Creed team, this game and it's predecessor are giant signs of how not to handle a franchise and are likely the reason it has remained dormant. Ubisoft have ruined Ghost Recon as well, and The Division has been nothing less than divisive, but at the least R6 still has a decent game. These aren't games for people who are nostalgic for the classic SC, just buy the Splinter Cell you're looking for.",
            "review_score": "-1"
        },
        {
            "review_text": "awesome game ! rate it 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I respect this game. this is most cooperetive game i've have even seen so far. but it needs more maps for coops :3",
            "review_score": "1"
        },
        {
            "review_text": "Nice splinter cell  Nice story  Nice AI  Nice Gun  Nice Map Nice Stealth  Nice CO-OP 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Plays like a mix between Splinter Cell: Conviction and Splinter Cell: Chaos Theory. Thankfully, the story is pretty good and the set up is more akin to Chaos Theory than Conviction. If you're having second thoughts about it because you think it did away with stealth then don't worry, cuz it didn't.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with a friend!",
            "review_score": "1"
        },
        {
            "review_text": "Best Splinter Cell game behind Choas Theory.",
            "review_score": "1"
        },
        {
            "review_text": "If they had a fully First Person",
            "review_score": "1"
        },
        {
            "review_text": "yes,im splinter cell",
            "review_score": "1"
        },
        {
            "review_text": "Best Splinter Cell game behind Choas Theory.",
            "review_score": "1"
        },
        {
            "review_text": "I play the game every now and then, it's still really fun, even though MP sucks for noobs like me, and my uplay didn't save my progress so I lost all my in game currency. But whatever.",
            "review_score": "1"
        },
        {
            "review_text": "I've played the first game of the series and it was very tough with a very restrictive game play. Since then the series improved with each game. I really like the series more and more and especially splinter cell blacklist.",
            "review_score": "1"
        },
        {
            "review_text": "I've played the first game of the series and it was very tough with a very restrictive game play. Since then the series improved with each game. I really like the series more and more and especially splinter cell blacklist.",
            "review_score": "1"
        },
        {
            "review_text": "Another great installment of my most favorite series. I was sad to find they changed Sam's voice, but otherwise no complaints.  Edit: Ok, I found a complaint. The DRM sucks. Blacklist checks every 15-20 minutes to see if you're online. If you're not, Blacklist will force crash. Still a great game, but a little tarnished in my mind by this.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of the series, or stealth games in general, this one is for you. Devs at Ubisoft listened to our complaints about conviction, and made the game longer, and I think a bit more challengening. Like with Conviction you don't *have* to play Stealth, but some missions do require it.   The Stealth gameplay is great in my opinon, and it's left me wanting more.   My only real complaints are DX11 has issues with crashing on the Paladin, and the voice acting. For all previous games, Sam was voiced by Michael Ironside, whos voice helps give you an idea on who Sam Fisher is. The new guy sounds a bit too young to be the grizzled 50 something, still kicking terrorist ♥♥♥.    tl;dr if you like Stealth games, or Splinter Cell you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "Did not like it at first as I thought it was too hard but I just wasn't being patient enough. Like all splinter cell games it punishes you for being rash; only make a move when you know you will not be detected. Once I got into it the game is excellent with many ways of doing things.",
            "review_score": "1"
        }
    ]
}