{
    "app_id": 235620,
    "name": "Small World 2",
    "release_date": "2013-12-11",
    "developer": [
        "Days of Wonder"
    ],
    "publisher": [
        "Days of Wonder",
        "Asmodee Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards",
        "Steam Turn Notifications"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Board Game",
        "Strategy",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 520,
    "negative_ratings": 174,
    "price": 6.99,
    "description": "Based on the phenomenally successful Small World fantasy board game with over 500,000 copies sold! Take control of insanely fun fantasy race &amp; special power combos, such as Berserk Halflings, Triton Merchants, Alchemist Ratmen and Dragon-master Amazons, to grab all the land you can in a world that is just too small to share with your...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235620/header.jpg?t=1531495693",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 Processor: Dual Core 1.6 GHz or better Memory: 1 GB RAM Graphics: 1024x768 or better recommended with OpenGL 1.5 or higher Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "When Small World 2 functions properly, it's a fun and faster incarnation of its tabletop predecessor. The game is arguably easier to play than its tabletop incarnation because it prevents players from making invalid moves and sometimes indicates possible moves. It also makes it easier for players to keep track of numbers like turns and quantities of troops. The game also captures the aesthetic of Small World very well, and actions are played out rather pleasantly. However, the game crashes or bugs-out frequently. The game is locked at one specific resolution, which cannot be changed (except by maximizing the window, which may sometimes result in letterboxing). There are no settings options whatsoever, aside from game volume and music volume. And finding a game online is horrendous because creating and joining games is tedious, and that's if there's even anyone online to play with (which there more often than not, is not). Many of the UI elements can be confusing, especially since the tooltips (when functional) aren't always informative. Parts of the UI, particularly text, will even change the game's cursor to the system or text cursor, making the entire game feel cheap and poorly made. One would expect many of these issues to be solved, or at least addressed, shortly after the game's release, but since at the time I'm typing this the game has been released for over a year, I believe that it's safe to say that these issues will not be addressed any time soon, if at all. The entire game feels like a half-♥♥♥♥♥ money grab, and despite the genuine entertainment it may provide, albeit in small amounts, I cannot recommend this game while these issues continue to exist.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome port of world famous board game! You don't need to waste time for placing or collecting cardboard items after the game! You just make decisions and have fun! Moreover the AI won't let you make a wrong turn! AI won't make a mistake in counting victory coins. Again just relax make desicions and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Firstly let me say this.....I love Small World. It's one of my all time favorite boardgames, top 5 for sure (having played well over 300).  'So why don't you recommend it?!' I hear you collectively cry!  Because there are constant bugs and errors. This doesn't deserve to be released. It's a disservice to a great game! The developers don't care that it is putting people off as long as they keep selling right? Wrong. Lessions not learned from Small World 1.  How bout this devs.....stop developing DLC and get the damned game to frakking frelling work!  Constant connection issues when you have no connection problems. Game dropping etc etc. It's depressing and sad that a game this good can be ruined by people who can't make a game work.  When they do I will recommend this game. It may be some time!",
            "review_score": "-1"
        },
        {
            "review_text": "The boardgame feels way better. There is a huge lack of online players to play with. There is no undo button. Background music becomes soon a bit annoying. I hoped for something better. AI is nice by the way. Not a bad game but nothing great. My rating 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "It's an OK adaption of the board game, but the digital version lacks the role play and social interaction that makes the board game so endearing when played around a table with friends and family.  On top of that, they didn't exactly go the extra mile. The graphics are basically the same as the pictures in the board game, the music is irritating, and the implementation is buggy. Graphics twitch as they resize back and forth. The game crashes with regularity, bug reports no longer tended to by the developers. It's basically abandonware at this point, a cheap and cheerful digitization and monetization of the board game.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes in Linux whenever you pay to skip race/power combos. Devs claim to have fixed it, but they didn't. They also never respond in discussions.",
            "review_score": "-1"
        },
        {
            "review_text": "This game frequently bugs out when you're in interesting situations. Overall, the board game it represents is decent, though slightly flawed when it comes to the advantage given by turn order. The AI is terrible, and can frequently lead you to know if a game is won/lost very early on. Even with all those things. it would still be a decent game if it didn't bug out so often (once every 5 games for me)",
            "review_score": "-1"
        },
        {
            "review_text": "Totaly dissapointed. Not a single allusion of a deepness. This game (and board too) is just pathetic. I really fond of board games, but this one is killing me. If you want to try some board game's digital adaptation - try 'monjoie!', 'ticket to ride' (of same developer), MtG, 'talisman' or even 'the witcher' BG, but not this one.",
            "review_score": "-1"
        },
        {
            "review_text": "If the AI was any better I might enjoy solo play of this game. But since it is horrible, I really can't enjoy it solo. yeah there is multi player and pass-play, but if you're going to offer a feature, please do it right!",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy playing the board game and the Video game does not disappoint. It is basically exactly what you would expect. Enjoy. I wish there was more settings for the AI but other than that it is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Being a board game with 'pass and play' (i.e., local co-op), I thought this would be a good game to throw up on the TV for parties. It's not. As far as I can tell, there's no full screen mode, and you can't adjust the resolution, meaning that playing at 720p requires hiding the task bar just to see the entire screen. To make matters worse, the fonts are small and hard to read from any distance you'd normally expect to view a TV from. If you're looking for a party game, look elsewhere.  Also - there's no in-game tutorial, only a video tutorial that inadequately explains the rules. Be prepared to read the rulebook if this is your first time playing. You might also be unable to view the video tuorial from ingame, as I couldn't, because the ingame browswer 'doesn't support HTML5'. My guess is that it's trying to run internet explorer from within the game, and if it's not up to date (as mine isn't, since I don't use IE), you'll have trouble.",
            "review_score": "-1"
        },
        {
            "review_text": "So, I should preface this with the fact that I am, first and foremost, a board/card/tabletop gamer. I kickstarted this because I hate Small World.....let me back that up. I hate playing Small Wo...wait.....ok....I hate playing the board game Small World. The sheer number of tiny pieces that are hard to see on the colorful board makes it just the last game in my collection I ever really want to play. So when I found out they were going to put it out on PC and android (Yes, I know it was already available on ithings, butI don't have an iOS device) I was excited because I hoped it would eliminate the thing that makes me hate Small World....and it does!  There are some minor issues. The complaints I hear about it from other people is that you have to drag tokens rather than just click, that it doesn't fullscreen right or at all....but these really seem like quibbling things. Yes, it's obviously a PC port from tablets, but it still controls well. The day one DLC kind of sucks, yeah, but as a board gamer trust me....ridiculous add-ons are standard in some games...and this is still cheaper than the expansions for the physical game.  So far, my only actual criticism is how horrible the screen is for explanations of racial and bonus abilities....font size and style just looks tacked on, which is really bad for new players....but if you are familiar with the game mechanics and are just looking at that screen from time to time to refresh your memory, it's fine.  So....the tl;dr is: If you like the board game but hate how long the setup and breakdown is, this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "I truly love small world and own Small World Underground and several expansions. I have played and owned the Ipad version as well. That being said it is a sad sight to see such a terrible and buggy PC version. The game is slow and crashes. Making it frustrating to play.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game. Bad graphics.",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliant adaptation of the aweome board game... if you've played the board game then I assure you that this is an authentic replicate of the samne game, including the expansions. If you've never played it, then just watch the video, it's vair straight forward to figure out.  There's a major, and a minor, problem them; Trying to play online is like pulling teeth. Constant 'authentication' problems with people trying to log in. Getting a game going is extremely frustrating because of this. (That said, when you're actually playing it's a smooth ride IME).  The other minor problem is something that the board game suffers from too but it can't be helped there... they could have fixed it here and didn't. I play games like this with my family; there's 3 of us that play. That means when we play the board game we're always stuck on the 3 player board... never used the 2, 4 or 5 player board. In the computer game although you can play against the AI in single player, you can't have the same bots in multiplayer... if you could you could have 3 people, and 2 AIs. A big missed opportunity.  Like many people (probably) I got this from Humble, so it seems harsh to be negative about a game for charity, but if you're getting this for multiplayer, don't bother. Single player is fine though.",
            "review_score": "-1"
        },
        {
            "review_text": "Pro:   Incredibly solid core gameplay.   Power/race combinations stay entertaining.   Good for quick games against the AI.   AI is quite competent.   Con:   Computer moves too slowly, requiring constant skipping.   Scoring happens slowly as well, and is obnoxious for Leprechauns.   No variation in boards.   Lacks races/power/artifacts from Smallworld Underground.   No option to disable specific powers/races (Cursed/Leprechauns).   Players aren't shown in order when playing with random starting player.   Forgettable music.   Conclusion   Smallworld is a very fun game but it's a shame this digital implementation is more limited than the physical board game. The constant requirement to spead up AI movement also is a huge drawback.",
            "review_score": "1"
        },
        {
            "review_text": "Very good translation of game, with a very fast turn system and lots of instruction available.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT 1: 25.6.2014 - 2.5 Version  I decided to keep the old review as it was, because it was accurate at the time and a lot of people (20/21) found it helpful, as well as to show how the game has improved in both stability and gameplay.  First and foremost, the crashing issues. At least for me, they appear to be gone. I cannot claim that the game now works for everybody, but for me, I can honestly say that after trying it multiple times today, I haven't experienced any problems whatsoever.   Secondly, the new game features. In this regard the game has improved dramatically and became closer to the model of Days of Wonder's other digital board game, Ticket to Ride.  - Joining/creating games The 'Search for a game' model has been replaced with a Ticket to Ride-like arena, with a lobby and a 'create a game' and 'join a game' option. This removes a problem that sometimes occured previously, when in cancelling a search and restarting it (with different or same parameters) you ended up in multiple matches at the same time. It also adds a lot more customization to the game, including but not limited to the number of players (also present before), the amount of time each player has to act, password protected games, ranked/unranked games (previously only matches with your 'buddies' were ranked) and the option to play a single session game (fast paced, all players only play one game) or multi session (longer rounds, suitable for those who play multiple matches at the same time, or prefer relaxed long lasting games similar to correspondence chess).  - Gameplay Before the 2.5 update, you could spend 10 minutes or more waiting for an opponent to make a move, which made a match that could've been finished in 15 minutes, last an hour or more. A situation made worse when after 10 minutes of waiting, you got a message that the player disconnected which automatically aborted the game. The introduction of a timer makes matches run a lot smoother. It makes games (single session) shorter and more active, and the addition of bot replacements for disconnected players, means that the very frustrating situation of ending up with a 50 minute unfinished game is gone.   Conclusion I'm happy to change the review to a recommendation. Now the game is as it should have been all along. I just hope that new updates won't mess it up again. The only downside of the game right now, is the lack of players, which will hopefully change once the word of it's improvements spreads.  Also a recommendation for potential buyers of the game, who are not already familiar with the board game version. Check out the youtube show TableTop (hosted by Wil Wheaton) and their episode about SmallWorld, and get to know what the game is about in a very entertaining way.  ---------------------------------------------------------------------  Old review (26.4.2014)  While I do love the game itself, I simply cannot recommend the broken Steam version to anyone.   Aside from the high price (13.99 dollars/euros) and lack of features that would make online games less frustrating, the game simply does not work for a lot of people, myself included.   Upon purchase I was able to play it with no problems and clocked in a lot of hours. Though playing time is actually deceiving, since most of that time is spent just waiting to find opponents, waiting for them to move and wasted on unfinished games once an opponent leaves. But after an update 4 months ago the game simply crashes on startup, or in the 5-6 times I actually managed to get in, it never lasted long enough to finish a single game. Developers had done nothing to fix the issue and support tickets have been unanswered.  I wouldn't be writing this if the crashing problem would happen just to me, but since a lot of people are dealing with this, chances are you also might, so take that in consideration before purchasing a potentially faulty product.",
            "review_score": "1"
        },
        {
            "review_text": "If you're familiar with the board game but don't want to deal with all the pieces or have enough people to play with at home, this is a good option. It keeps track of your score, there's no clean up, and it keeps things simple. Was worth the $2 for a quick pick up game.",
            "review_score": "1"
        },
        {
            "review_text": "Port (which is getting better with each update and devs are taking community feedback seriously) of a really fun board game. I strongly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Seems to be a fully functional version of Small World the board game, faithful to the core, with no rules changes at all.  The online interface is a bit hokey, and requires you to use a 3rd party website instead of simply using steam play, but asynchronus turns is a pretty cool feature.  Fully endorse.",
            "review_score": "1"
        },
        {
            "review_text": "The game is great. The only issue is looking for matchs with other players. unless you look for 1v1, wait times can be as long as a half hour. Although 4 player matches tend to work out to about 5 minute wait times so it's not terrible. The game itself offers an almost infinite amount of replayablility with the race/ adjective combos. Very fun and addictive and would recommend this game to anyone looking for a good board game on the computer.",
            "review_score": "1"
        },
        {
            "review_text": "Big fan of the board game and this is an excellent adaptation for the PC. I held off buying it for a couple of months due to a lot of reviews complaining about it being buggy. But, I haven't seen that. The game's been stable and crashed maybe one time so far. So, no worries there, whatever was plaguing this game isn't anymore.  If you like the board game you'll enjoy being able to play a few games quickly. And the bots aren't awful, though they aren't aggressive enough. And that's saying a lot since I don't play aggressively.",
            "review_score": "1"
        },
        {
            "review_text": "A dynamic and varied strategy board game. Just enough to keep the avid gamer interested, but at a level that is accessible and enjoyable for casual gamers. Good stuff for everyone!",
            "review_score": "1"
        },
        {
            "review_text": "A quick casual strategy / luck game with awesome art and lots of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "VERY NICE simulation of the legendary success of the board game. Or atleast half of it at the time I am posting this. The whole base game is available sans Underground, Realms and the card deck. Perhaps those will be added to the DLC pile eventually. I got this on a half off deal and was beyond pleasantly surprised. Lets all be honest. Steam DOES NOT have a rather bright track record when it comes to cross-over or co-op games. This one happily is simple enough that they really could not mess it up.The bot play is about what you might expect at this level of programing tech. Not so clever but it will give you a run for your money if you stop paying attention for a round or two. The real gems (pun intended) can be found in the online play. I never had such seemless transition from start to finish in the regular table top board game version. All the tedium of bean counting and 'Risk style' clumsy stumbling about with a handfull of pieces is now relagated to point and click bliss. there is a somewhat annoying music track which thankfully can me muted and some sound effects that I suspect were ripped from the arcade era circa 1983. So to sum up, I am pleased and would reccomend this beer and pretzles pass time. Just don't expect more than what it advertises.  Jim.",
            "review_score": "1"
        },
        {
            "review_text": "I own the physical board game but havn't had much chance to play it with friends or family. So when I seen they made a steam version I jumped at the chance to try it out. Has a very simple interface and menu system nothing flashy and pretty rudimentary. But it's easy to use and gets games set up fast and easily. The game is almost a cross between Risk and Settlers of Catan if you want to simplify it down to it's basics. Gameplay is fun, tactical, and rewarding also only last 20-45 mins (relatively speaking). Interesting and familiar fantasy races to play that coupled with the seperate ability combos ensures you'll never have the same game twice. The toutorial video is a big help for newcomers and is a big help at laying down the basic rules. So very fun, entertaining, and good practice until I can get a proper board game setup to add the human interactive element (which can be obtained by local hotseat play for those with only the digital version).",
            "review_score": "1"
        },
        {
            "review_text": "I have the real boardgame, this is just an added bonus to play with friend across the world",
            "review_score": "1"
        },
        {
            "review_text": "Small World 2 pits you into an overcrowded world where you need to knock out the other race combos. Bring your swamp dwarves from out the depths to battle flying goblins. Your mutual opponent bivouacking pygmies creeps past your attention to take over your mountains. As the game moves you tastefully refuel your armies with new race combos. Small World 2 makes you play for gold coins. He who has the most coins shall claim victory in the end. A great game to play with your friends. The perfect 10 turns gives this a 10 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best board game conversions that can be played in single-player. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Someone play with me i'm so alone",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME!!!! From the second it loaded and went to windowed I had a bad feeling. No full screen mode available. No tutorial or walkthrough, just some bs video poste on Youtube. DONT BUY THIS GAME!!! The developers should be flogged!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This is such a fun boardgame! One of the favorites in real life. So awesome to be able to play over internets. ^__^",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Have the board game in real life. For sure one of the best board games out there!!",
            "review_score": "1"
        },
        {
            "review_text": "Summer 2014 addendum for Smallworld 2.5: Many of the horrible design choices, especially concerning the dismal online matchmaking, have been corrected and the game isn't broken anymore in that way, but it's still terribly glitchy and prone to crash. I doubt the developer's commitment to Sparkle Motion here – probably never will work properly, which is amusing for a boardgame port.  Original review: The board game itself is solid, casual multiplay, but jeeze is this version pretty lamely ported. Originally a touch screen mobile game, this Steam version looks nice but harbours some pretty dumb UX design choices and bugs that, mercifully, the developers have been patching from day one. It's a little broken, crashes and glitches out every now and then – and people that just stop doing their turns (or quit the game, aborting the match for everyone involved) are still a huge problem as of Feb 2014.",
            "review_score": "1"
        },
        {
            "review_text": "I have seen issues with this game from over a year ago regarding the game crashing, has any of this been resolved? I am still running into issues with the game crashing as soon as the game boots up. Have never even been able to actually play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Summer 2014 addendum for Smallworld 2.5: Many of the horrible design choices, especially concerning the dismal online matchmaking, have been corrected and the game isn't broken anymore in that way, but it's still terribly glitchy and prone to crash. I doubt the developer's commitment to Sparkle Motion here – probably never will work properly, which is amusing for a boardgame port.  Original review: The board game itself is solid, casual multiplay, but jeeze is this version pretty lamely ported. Originally a touch screen mobile game, this Steam version looks nice but harbours some pretty dumb UX design choices and bugs that, mercifully, the developers have been patching from day one. It's a little broken, crashes and glitches out every now and then – and people that just stop doing their turns (or quit the game, aborting the match for everyone involved) are still a huge problem as of Feb 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Nice adaptation of a very entertaining tabletop game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game, digital or physical. My recommendation is based solely on that factor - fun to play. This game is also an astonishing 'cash grab'. IAP for other games? Check. DLCs? Check. Third party registration? Check. Also it SCREAMS mobile. I would love to play it with friends on tablets for example, but this is Steam. I play on a laptop. I find the art a bit too undetailed, especially after having played The Witcher adventure game. I feel like it could have used a bit more work to utilise higher res displays and ACTUAL SETTINGS. Going to try the multiplayer now. I hope it works fine.",
            "review_score": "1"
        },
        {
            "review_text": "So much better than playing the physical copy! Even got clarification on a couple of rules we weren't sure on!",
            "review_score": "1"
        },
        {
            "review_text": "Download it and play a game aganist me! I dare you",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun and quick board game that can kill an hour  It is good tatical game that you can play solo or with freinds",
            "review_score": "1"
        },
        {
            "review_text": "Almost as much fun as playing the game in person. I usually play on my iPad, but it's nice having the expansions on the PC version =).",
            "review_score": "1"
        },
        {
            "review_text": "Risk with a twist. This game does a good job representing the best selling board game. You conquer regions of the world similar to Risk but the randomized Race and Ability tokens make it so that no two games are alike. There are some missing features that you'd consider standard in PC gaming like a proper full screen mode but I have hopes that they'll patch it down the line. The AI is brilliant most of the time but sometimes they stroke out and do stupid things. Online support is good so if you get sick of playing against AI, you can take on some real people. Highly recommended even with the bugs!",
            "review_score": "1"
        },
        {
            "review_text": "Crahed in my first game of multiplayer, not a great start.......",
            "review_score": "-1"
        },
        {
            "review_text": "I had heard good things about the board game so when I saw this on the Summer Sale, I figured I'd give it a shot. It's a ton of fun. Nice balance and enough randomness that even after several games I can get some wins but I'm far from dominant. At three bucks, it's a steal.",
            "review_score": "1"
        },
        {
            "review_text": "I do enjoy the fact that this wonderful board game has been converted to an online format, making it easy to play anytime. However there is one major flaw in this gem, match making. It take about ten minutes for a game to time out, and rather than just dropping the idol player it dumps the whole game. This is very irritating when you have a five player game going that you, and others have invested time in. Other than this snag the transition was very nice. ",
            "review_score": "1"
        },
        {
            "review_text": "Alomst as good as the board game! Love being able to play my friends when it is not possible for all of us to go to the same house. If only more board game developers would follow suit!  Cheers",
            "review_score": "1"
        },
        {
            "review_text": "Fine adaptation from the board game. Nice to have the points calculated if you wanna drink while you play.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that is let down by lazy software. The board game itself is fun, challenging and reinvents itself everytime you play. The software on the other hand disconnects if you switch windows and disconnects randomly even if you don't switch windows -- causing lost games and timeouts for no reason.  At the time of writing this review, the online servers have been down for at least 3 days, giving me an 'Unknown Auth Error'.   As much as I enjoy the game, I can't recommend it because of the shockingly bad and broken software that should have been fixed a year ago. Great stuff Days Of Wonder /s",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty much perfect. What ever bugs there were... not present 31/12/16. You can even resume muliplayer games very painlessly. Buy this game, it's working great... win10, R9 270X, 8core AMD cpu.",
            "review_score": "1"
        }
    ]
}