{
    "app_id": 235660,
    "name": "Eador: Genesis",
    "release_date": "2013-10-14",
    "developer": [
        "Alexey Bokulev",
        "Snowbird Games"
    ],
    "publisher": [
        "Snowbird Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Turn-Based Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 199,
    "negative_ratings": 38,
    "price": 3.99,
    "description": "Eador: Genesis is an indie turn-based strategy game created by Alexey Bokulev. It has inspired the development of Eador: Masters of the Broken World.Take the role of a mighty Master and shape the destiny of Eador, on land and within the astral plane itself.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235660/header.jpg?t=1530002981",
    "minimum_requirements": "OS: Windows XP, Windows Vista or Windows 7 Processor: 1 GHz Processor Memory: 1 GB RAM Graphics: 3D graphics card compatible with DirectX 9.0c Storage: 150 MB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista or Windows 7 Processor: 1 GHz Processor Memory: 2 GB RAM Graphics: 3D graphics card compatible with DirectX 9.0c Storage: 150 MB available space",
    "reviews": [
        {
            "review_text": "I would very much recommend this game, though if you already have 'Master's of a Broken World' or vise versa then this is essentially the same game (before it got the fancy graphics). This game is hard, so far as there is almost no documentation that can help you understand every singe battle/challenge/random event. About the only thing you can do is dive in, play, lose, and do it all over again (I re-ran the tutorial about 3 times). But once you do learn, and you conquer your first shard, well I for one was hooked.  This is not a game that you can ever just bide your time with, building up enough of an army, and a powerful enough hero. Yes these are the things you must have to win, but the computer opponents are doing exactly the same things, and in many cases, they are much more aggressive. You can find yourself surrounded, fighting to keep the enemy out of your strongholds, when only rounds earlier you thought you had the game well in hand. Yes it is somewhat repetative (part of the game getting easier is that you eventually start to know what pattern or solution to a given 'random' event is best), and there are times that it will feel unfair, but trust me. When you bull rush an enemy strong hold, kill off 2 of his heroes, siege his castle, then finally banish him, all before HE was able to break away, then you too will know how much fun this game can be!",
            "review_score": "1"
        },
        {
            "review_text": "A delightful old school mix of turn based stratagy and RPG.  The learning curve is steep but if the player just takes their time to understand how things work they will be rightfully rewarded. An awesome gem of a game.  Excellent amount of content for the money spent.",
            "review_score": "1"
        },
        {
            "review_text": "A fun TBS in the likeness of King's Bounty and Heroes of Might &amp; Magic III, though nowhere near as deep. You capture cities, build buildings that increase income and the like, buildings that let you recruit better and better units for your personal army, and conquer the enemies on the map.  It's a great TBS, however I recommend Genesis over Masters of the Broken World. It's basically an clunky-er update to Genesis, where other than the newer poorly optimized engine and and clunky UI, they're pretty much the same, so I recommend this cheaper version.",
            "review_score": "1"
        },
        {
            "review_text": "best game. get new horizon mod. good times are had",
            "review_score": "1"
        },
        {
            "review_text": "Strongly advise against this game unless you are a diehard strategy fanatic. It has an extremely steep learning curve and is completely unforgiving. The tutorial is rediculously long and yet teaches you very little of the game's actual mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "There are better, more detailed and more extensive reviews for this game, so I'm just writting why I wouldn't recommend it.  The main reason I bought Eador: Genesis was for the Hero and the combat system. You're the Hero, the commander of your army, you go explore the land and you actually fight. You improve your Hero and buy armor and weapons, and customize it to some sub-classes.  With all that said, all that fails: The customization is completely random; at every level-up you are given 3 RANDOM 'masteries' and choose to boost one. They're not useless but you can't choose what you want to become. If none of the masteries is what you want, then you HAVE TO choose the 'passive' or 'main' (say Magic Dmg for Wizard, Attack for Warrior, Range plus Attack for Scout). Sorry, but for a RPG feature this is a SHAME. You don't actually know how many masteries are or when are you getting the one you'll like. You don't even know which are the sub-classes or what skills will you need. You can't customize your Hero the way you want knowing NOTHING.  Then again, the army recruitment and management system is terrible: You pay many kinds of soldiers to help you in battle. They level up and get some stats, skills and stuff... then in some random not-favorable battle they die and... your time spent in that unit, developement and EVERYTHING is just destroyed and you have to hire a lvl 0 unit again.  There's only one 'save slot' for Campaign Mode, so if you want to try a class, you have to erase your previous game data. If you played lets say... 30 hours the Warrior and you need a rest or you want to try a new Hero, you're gonna LOSE 30 hours of your life just to find you hate the Scout and want your Warrior back.  The autosave is also annoying because every time you exit the Campaign, it autosaves. This means you learn the game from your mistakes, but the hardest way possible, and nothing can be undone.  Well, if you don't mind some of these features and just like the strategy and empire building... this game is maybe for you. Definetly not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "The stats say I've played 8 minutes - that's the short of it. The game is simply too old to be sold any longer.",
            "review_score": "-1"
        }
    ]
}