{
    "app_id": 235820,
    "name": "Element4l",
    "release_date": "2013-05-24",
    "developer": [
        "I-Illusions"
    ],
    "publisher": [
        "I-Illusions"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Action"
    ],
    "achievements": 20,
    "positive_ratings": 506,
    "negative_ratings": 99,
    "price": 6.99,
    "description": "Element4l is an immersive and experimental indie platform game, with a strong focus on flow and smooth gameplay, wrapped in an exceptional soundtrack by Mind Tree.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235820/header.jpg?t=1447357691",
    "minimum_requirements": "OS:Windows XP or later Processor:Intel / AMD 1Ghz Memory:2 GB RAM Graphics:NVIDIA or ATI - Intel: Shader Model 2 capable DirectX®:9.0c Hard Drive:500 MB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Beautiful, fun, peaceful, challenging and overall just a relaxed game to play.  A nice break if you're used to playing games full of action. It's a really unique puzzle game.  If you're thinking about buying it, it's worth the money. Or gift it to someone who likes visual stunning games and/or puzzles in general.",
            "review_score": "1"
        },
        {
            "review_text": "Element4l lets you control the four elements in this little platform game. You can switch between rock, fire, ice and wind on the fly while moving through a level. A fun idea, but there are a lot of trial-and-error moments.   It frustrated me more than I had fun with it which isn't a good sign. But if you do finish a (part of the) level without messing things up it feels really satisfying.   Also, it doesn't look bad, a bit simplistic and minimalistic maybe, but I liked it anyway. And the music was actually quite good.   In other words: an average game, but with heart.  [Rating: 71/100]",
            "review_score": "1"
        },
        {
            "review_text": "This game is so beautiful. Love the soundtrack and it has great mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, funny, epic music, hard but worth. 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Great Indie Platformer that takes you on a grand adventure. The soundtrack is just as good as the game itself.",
            "review_score": "1"
        },
        {
            "review_text": "Element4l was an incredibly difficult game to get through. 'Challenging' is not a word that even comes close to describing the experience that I encountered with this game. It was bought for me by a friend, so the desire to finish it, not just to its end, but to 100% was heightened. With eerie, yet beautiful colored backgrounds and darkened foregrounds Elemen4l can capture one's gaze with precision. The movement system, while challenging, has a precision all its own and requires immense skill in reaction timing and rhythmic pacing. A collection of wonderful cultural references mixed with exciting, and at many times, frustrating level span and design makes Element4l an absolute must for a determined gamer's collection. In closing, probably the most excellent aspect and feature of this game is the soundtrack. There are not words in existence that can describe how fantastic the music and sound effects are geared towards making Elemen4l an incredible experience. All in all, through frustration, determination, and all out giving up, Element4l most certainly made a better gamer out of myself. I am most certain it will do the same for you.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I've played this year, finally something different than running around killing stuff mindlessly.  Awesome music, Awesome gameplay which works perfectly fine, and some nice NPC kind of guy, a bit tough but that's probably what keeps the game interesting. I personally didn't find the controls that hard to master as some may believe you to be either.  BUY IT!!!!! YOU WON'T REGRET IT.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, and the soundtrack is amazing.  It's overall very VERY difficult though which is why I don't find the time or will to play it. It's a shame. But if you do have time to get a hang of the mechanics, then it's a fun, beautiful little trip through awesome stylized landscapes, coupled with an interesting gameplay.  Sit back, and enjoy this piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing little platformer of sorts. feels a bit like Limbo just more difficult.  Need to know Pro vs Con:  Pro: Fun Challenging Beautiful  Con: No Controller support at the time Controls felt cramped and forgetable i was constantly looking down to check that i hadn't slipped off of the arrow keys ",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun until it gets very stressful. Don't be fooled by the mild look of the game; it is HARD. Feels like every time I'm starting to get the hang of it, the challenge doubles down on me.   If it weren't for the fantastic music, I probly woulda smashed my keboard against something and given up half way through the game. Instead I just mashed a few keys and gave up on one of the last levels.  The race mode feature is pretty cool. You can race the 'ghosts' of your record &amp; others who just barely beat it. Would be cool to have an actual multiplayer feature.  I like this game a lot, but it's very difficult at times. That being said, I would lllloooooovvveeee to play a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "In summary, one of the critic's reviews states it perfectly.   'I’ll remember this platformer mainly as a torture. It’s really ruthless when it comes to making you feel helpless. [CD-Action 08/2013, p.81]'  I will start off by saying I did enjoy it... for the first 20 minutes. But the learning curve is rediculous. Shortly after you learn all the elements the difficulty just goes through the roof past the moon and all the way to pluto. After a few deaths it gives you the option to press 'h' which places a ghost you on the screen doing it the correct way. That's all nice and dandy, but at parts the tutorial ghost you will go off screen and you won't be able to see what to do next. On top of that, there is literally only one way to do it. If you do not copy exactly what the ghost does, you -will- die.   The physics... are off. Your momentum is something you will be constantly fighting with. As 'air' you can only move about two seconds before all your forward momentum (typically right on the screen) completely disappears. You can use 'fire' to get some momentum, but here is where (in my opinion) the worst mechanic lies. There is simply not enough energy. All your elemental forms cost energy except for ice. You can only use about three elements in quick succession before you are out of energy. So you have to perfectly time each use of your energy. If you're sliding as ice and need to use air to get up and to the right, you must switch to air exactly when the game wants you to. If you switch a half second too late you won't have enough momentum and you can't use air enough times to get high enough, or if you get high enough you won't have enough energy to use fire to get to the right. If you press it a half second too early then you will have too much momentum and you will crash into the wall and die.   This becomes quickly frustrating as more or less it is about just being lucky enough to hit the button at the right time. For the most part there was no guessing as to what to do next. With only four elements there was no confusion factor.   The other big flaw of the game is respawning. When you die, as you will most definitly die a lot, you respawn sometimes in seemingly random locations. You respawn as rock, which will almost immediatly slow your momentum, the most important factor in the game. If you spawned as ice, it wouldn't be quite so bad. Some places you spawn will be in a dead stop as well. This forces you to use air to get off the ground and then fire to get some momentum, which right off the bat uses up 2/3 of your energy.   I really did want to like the game. It is aboslutely beautiful and the sountrack is amazing. But the actual gameplay is just torture. I finally quit when you start in a hole and have to go back and forth trying to build up your -you guessed it- momentum! in order to get out of it. The 'help' button was basically worthless.   All in all, I do not reccomend this game. If you're a masochist and love constantly dying while trying to figure out the exact timing the game wants, then this is for you. Otherwise I wouldn't pay any more than $0.25 for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The trailer doesn't bring justice to this game. I thought very highly of this, thought it would be a glorious game with lots of fun. However, the music feels extremely electronic, it's good at times, but some pieces they use sound more like dubstep then anything else, to me. It's a good platformer, because it's actjually very hard. Something that makes it even harder, is that it sometimes just crashes in a weird way, instead of bouncing off the wall, or just hitting the enviroment, your 'dude' just floats out of the 'map' and keeps floating, the only way to restart is by restarting THE ENTIRE MAP. So if you say, tried a very long time to get past one obstacle, and this happens, well, let's say you get kind of ♥♥♥♥♥♥. If that gets fixed it's simply another platformer. I had high expectations about this game, and I was dissapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is way too hard, very early on. It's pretty frustrating for me, and after seeing Markiplier play this game, I thought it would be a bit relaxing. Well, to me it's not. It's a bit too hard for me, and I just got the game not even an hour ago. I wouldn't really recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, Element41... it's a really fun 'platformer' (I use that term loosely, I'll explain why later). You basically play as the four elements: Ice, Air, Fire and Stone (Yes, it's meant to be water instead of ice, but that'd be quite boring). You use the abilities of these elements to do platformer things: Air jumps, Stone drops down, Fire swooshes right and Ice slides around. It is very reliant on momentum. So yah, if that's what you're into, then get it...",
            "review_score": "1"
        },
        {
            "review_text": "This is an AMAZING game. It's a musy-have!",
            "review_score": "1"
        },
        {
            "review_text": "if you have the patience to sit though this boring long unending thing buy it , but if you have anything else to do (which includes killing yourself, school,work, or just lying there motion less waiting for your life to fade away as you slowly rot into nothingnes ) don't buy it .",
            "review_score": "-1"
        },
        {
            "review_text": "It charms and delights with its visuals and music, while providing challenging platforming fun.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game. it runs well on an asus t100 transformer book. no mouse required. the controls are the arrow keys but you need good timing. good for my train commute to work.",
            "review_score": "1"
        },
        {
            "review_text": "Game is short but awesome! Mastering the game is not easy. There are few annoying moments so it's really hard to actually get any gold flag/medal for the first playthrough, however it's very repeatable. You will want to complete it again and again with better and better time just because the mechanics are awesome and work great. Game is balanced and hard if you want to perfect.  2nd playthrough is even more fun since you already know how to operate and have a 'secret' (will not spoil the fun from game+)  Great game, lots of fun, hardcore if want gold and all the hidden shards. If it had editior I would give it 9,5/10, without editor it's 8,5/10 (due to minor physics mini-bugs)",
            "review_score": "1"
        },
        {
            "review_text": "Fun... apart from when I'm hitting ♥♥♥♥ after I can't get past a level. FAST FINGERS ARE NEEDED... ;)",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely brilliant. Even with only 4 elements, the game manages to introduce new obstacles at just the right pace to keep things from getting stale.  But beware, this game does seem to promote bashing your monitor in when those no-room-for-error moments pop up (more often than they should).",
            "review_score": "1"
        },
        {
            "review_text": "-Fun -Simple mechanics and mostly responsive -Astonishing soundtrack. Can't say that enough -Hard as balls, a real challenge -Pretty style -Quirky and hilarious dialouge  Despite this, there's plenty of issues.   Some of you might just think 'Oh he's just bad at the game' and to some degree, you'd be right, but the problem with Element4l is that the very specific button requirements make it sometimes almost impossible to complete. Especially as the landscape often doesn't provide any clues. I honestly can't count the number of times I've clicked the help button, wondering why I'm not hitting a ramp properly only to be shown at I wasn't turning into a bubble for 0.24 seconds which was apparently pivotal to making it. Speaking of the 'help', when you turn to the 'help' section, it's usually less than helpful (ironically), and often displays an action that I actually found impossible to replicate, thus leaving me with no choice but to find my own solution. There is also a distinct lack of checkpoints, which I feel was an attempt to make the game 'harder' although frankly it's just more fustrating to get through the majority of a complicated section only to die at the end have to do it all again, and overall, I honestly think the game would be far more enjoyable if it was much easier and had this really great sense of flow to it. Every time I even vaguely get the feeling that I'm getting into the rythm of the game, it's lost as I have to re-do the same section over and over until I want (and have) to hit my head against the wall in fustration.  So as much as I love this game and plan on continuing to play the ♥♥♥♥ out of it, I honestly can't reccomend it.... Not to my friends at least. Feel free to send this game to your enemies and enjoy watching them rage quit life.",
            "review_score": "-1"
        },
        {
            "review_text": "I love the art style, but the gameplay is too frustrating to be enjoyable because the controls don't always do their job.",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyable game and awesome soundtrack! +++",
            "review_score": "1"
        },
        {
            "review_text": "This game told me I was good at video games, so it's a good game",
            "review_score": "1"
        },
        {
            "review_text": "This game is so interesting,in this game you can control four elements who are bound together on a journey to shape life. Your only hindrances are nature and the sun. It takes a different, innovative approach to classic platform games and challenges you to rearrange your reflexes.  But the game is a little bit hard,so try your best to make it.The first time you play it, you will struggle... just like the first time you've learned how to ride a bike.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun game once you master the mechanics.  Simple - yet challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Frustratingly addictive game with a simple concept. The only controls you need to use are Up, Down, Left, and Right to switch between the four different elements: Air, Rock, Ice, and Fire, respectively. As a puzzle game, it's never too challenging to figure out what you need to do, but getting the element to actually do it is what will take up the biggest chunk of your time as you may find yourself trying one particular part upwards of 30 times (the longest it's taken me so far). This game will test the limits of your patience, yet at the same time you'll be unable to stop until you've finally conquered the game.",
            "review_score": "1"
        },
        {
            "review_text": "A lovely and creative way to recreate a puzzle platformer. If you become effecient at switching forms effectively, you can solve the levels in no time. I honestly love this game and plan to finish it in the near future.  It also helps that the art design behind the game is whimsical and cute.",
            "review_score": "1"
        },
        {
            "review_text": "This was a really fun and enjoyable game. It did get frustrating at times but it was definintely worth it. Nice soundtrack. The developer adds free DLCs and always keeps in touch with the community. It's on sale for $4.99 right now and I'd say that's more than a bargain. It's even worth the normal price in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Even on easy mode, this is really hard. I'm not a great fan of difficult games, nor do I usually like platformers, but even though I probably won't play this game much, I still really like it. I love the ambience, the colours, the music, the feel of it. I love the concept, but even just getting through the tutorial, it's hard to imagine I'll persevere any further. And yet, for some reason I do recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Worth giving a try but it feels like it wont be truly satisfying until you can spend the time to master the levels. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "So far I've only played an hour, but I know I'm gonna spend way more time playing this because it's an amazing, yet very simple, game. You only use 4 buttons and it makes for a great experience, works very well on laptops as well. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing. Can easily lose track of time.",
            "review_score": "1"
        },
        {
            "review_text": "very cool ambient, awesome gameplay with a bit of challenge i bought it with the remmendation of Markiplier y recommend it to",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun relaxing game but yet can still be difficult. It is a nice game for just something to play for a few minutes when you are bored. It has quite good graphics for what it is. I love how simple it is yet takes strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting concept with potential, but poorly executed. It seems simple enough at first; transform into verious forms with different properties to navigate the terrain and reach the end of the level. All movement is done using your form's properties and the terrain, such as falling into a half pipe as a rock, turning to ice to slide up the other side, then turning to a bubble to get extra height.  Unfortunately, the puzzles the game presents you require extremely precise timing of tranformation, and failing to execute a maneuver can often force you to respawn at the last checkpoint, which the game records as a death. And the game will inform you how many times yhou died on a level, as well as how many hidden collectibles you found and you much time you took. Apparently this is supposed to be a speedrunner game?  And say precision speedrunning is your bag. The game's artstyle and writing convey the exact opposite. Your character has the personality of a curious child, and the art, while pretty, is very soft and peaceful. It's all rather at odds with the gameplay.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful game, beautiful music, genius consept, someone else buy this game so someone can relate with my view on this game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful. The graphics and sound are amazing! Although it's hard enough to make me want to jump off a cliff, it's still really fun. Very nice game.",
            "review_score": "1"
        }
    ]
}