{
    "app_id": 235980,
    "name": "Tetrobot and Co.",
    "release_date": "2013-10-22",
    "developer": [
        "Swing Swing Submarine"
    ],
    "publisher": [
        "Swing Swing Submarine"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Casual"
    ],
    "achievements": 30,
    "positive_ratings": 371,
    "negative_ratings": 9,
    "price": 6.99,
    "description": "Tetrobot is the world's most popular and reliable robot, but he's not perfect. That's why I, Maya, have built him a microscopic little brother, Psychobot.Help me guide Psy through Tetrobot's cogs and circuits: by swallowing blocks of matter and spitting them out, we can repair anything.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/235980/header.jpg?t=1478090642",
    "minimum_requirements": "OS: Windows XP Processor: Pentium 4 3 Ghz Memory: 1 GB RAM Graphics: integrated supporting Shader Model 2.0 DirectX: Version 9.0c Storage: 600 MB available space Sound Card: integrated chipset Additional Notes: Xbox 360 Controller Supported",
    "recommended_requirements": "OS: Windows 7 Processor: i5 Memory: 4 GB RAM Graphics: dedicated hardware supporting Shader model 3.0 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Sound Card: integrated",
    "reviews": [
        {
            "review_text": "This is an excellent puzzle game, full of brain scratching problems that will keep you busy for ages. If you like to test your logical wits then this is an excellent game to do it with.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting and creative puzzle game. If you like puzzle games, this is a must-buy game. I will give about 9.2/10 if you let me score this game.   Eight chapters in total and levels are not repetitive. You will encounter different blocks and map environment. Some levels are quite tricky for collecting 3 pieces of golden blocks and maybe one further challenging achievement (for example, 3 golden blocks + 6 iron blocks). However, if you really get stuck in one level, you can check the community guides / solutions on youtube.  Its achievement system is good. If you want to 100% this game, you need to beat this game and replay some specific levels (by a smarter approach). Graphic and music are also satisfactory. I like very much 'FaceBlock', which gives you some hints for each type of blocks in a cute way.",
            "review_score": "1"
        },
        {
            "review_text": "Would I recommend this game? Absolutely! Tetrobot and Co. is really fun and challenging, each puzzle feels unique to the other ones and I'm amazed how well the puzzles were designed. Go get this game, it's definitely worth your time! :)",
            "review_score": "1"
        },
        {
            "review_text": "Smooth evolution of  Blocks That Matter  ( BTM ) and its ideas.   It’s about:",
            "review_score": "1"
        },
        {
            "review_text": "I'd been looking at this game for a while, wondering if I was un-sick of 2D puzzle games yet. It was on sale, so I figured, why not. I do not regret this decision.   What a brilliant little game. I was surprised at how quickly the game expected you to think for yourself and really take note of how the mechanics in the environment worked. Each memory block was an AHA! moment, that was then incorporated into later, more complicated puzzles. The pacing is great. The puzzles do become legitimately challenging, but in the way that makes you feel a little bit stupid once you get it, and at the same time, a little bit proud of yourself for figuring it out.   I recomend this game to anyone who wants a fun, well paced little puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Kick ♥♥♥ puzzle game with a wonderfull level design, and one of the best difficulty curve I've seen in a long time : you'll always progress, and finishing it at 100% will ask for some time spent twisting your mind, and feeling so clever once you find the tricky solution!  Highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little puzzler! Great idea, simple mechanism, PERFECT learning curve. Greatly rewarding whenever you find the way to combine the blocks and grab that seemingly impossible to grab 'yellow memory block'.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this title, and it's great. I want to correct a misconception I had about it though:  I thought it was a platform puzzler, however there's no platforming at all - this is what they mean by 'pure puzzle' This suits me very well, as the falling-off-stuff-reloading mechanism were the worst bits of, say, Thomas Was Alone. There's no frustrating 'fighting the controls' - just pure logic. There's very little in the way of timing puzzles either.  A great title - I can't recommend it more.",
            "review_score": "1"
        },
        {
            "review_text": "hard game.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended! Very clever puzzler.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic puzzle game by some really friendly french dudes. Plus my character Steak makes a cameo somewhere! See if you can find him :squirtheh:",
            "review_score": "1"
        },
        {
            "review_text": "What a lovely game. To be honest: I didn't expect it to be this fulfilling.",
            "review_score": "1"
        },
        {
            "review_text": "Top puzzlegame, clever, simple rules - hard solutions.",
            "review_score": "1"
        },
        {
            "review_text": "This game is adorable, the puzzle design is fresh and interesting throughout the entire game and it was challenging without actually being frustrating. And unlike most of the puzzle games I've played so far, it didn't feel too short. The game had enough content for me to feel satisfied and not beat it in one sitting. And the cute story and the likeable characters were a treat throughout the game.  I'm excited to see what the steam community will make with the puzzle level creator (I might even try my hand at it a bit)  But yes, this game is very worth it.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely fun little game. It's a puzzle game and has very simple controls (just click the left mouse button) but some of the levels really make you think. You control a little robot, you move by left clicking on a square. Using this robot you travel through various rooms in a given level searching for the end portal. As you explore the level you may find different blocks (wood, sand, stone, sticky jelly) which each have different properties and can react differently in various situations. For example, if you let a laser or fire get near a wood block it will burn and be destroyed, but a sand block turns to glass. In most levels you need to try and conserve as many blocks as you can.  Of course getting to the end portal on each level usually isn't very difficult. However there are three gold coloured blocks on each level, and obtaining all three of those and then getting to the end portal can lead you into some fiendishly brain-teasing logistical puzzles to think your way through. If you sit and think long and hard enough, nothing is beyond your grasp to figure out. If you get frustrated enough (or completely stuck) there is a brilliant guide with a video for how to complete every level, but it's very satisfying to solve everything for yourself (and if you look at a video you'll feel like hitting your head against the wall thinking 'it was so obvious, why didn't I see that').  Give your brain some gentle exercise with this charming, fun, and non-violent game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty neat Puzzle game. You have a set of rules for grabbing blocks and you have to make your way through a maze and collect hidden blocks while using those rules.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzles games I've played so far. Pretty hard at times, varied original gameplays, good soundtracks. Ending it 100% is really a challenge. I definitely recommends it to any puzzle fans.",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable puzzler, that mostly plays in short-to-medium segments. It's hard to avoid taking on 'just one more level', though. The mechanics keep adding elements to freshen up the gameplay as you keep going.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome puzzle game, with smart and sometimes tough puzzles, lots of polish, great art, and a lot of variety. There are always multiple puzzles to work on at once, so you can leave some along and let them simmer while you work on others. There are plenty of fun extras, the fact that there is a level editor and such is really cool, and there is a lot of mechanical variety.  Having now completed this game, I can reaffirm that I really enjoyed it. Some of the puzzles had me completely stumped, and a few of them rely on timing even though most others don't, so those often threw me off. Expect to have to find novel mechanics on your own in the midst of a puzzle - the basics are introduced clearly and easily, but the interactions between the various systems aren't always obvious at first glance.  This is an extremely enjoyable game that I would recommend to any puzzle fan!",
            "review_score": "1"
        }
    ]
}