{
    "app_id": 23600,
    "name": "Depths of Peril",
    "release_date": "2010-11-23",
    "developer": [
        "Soldak Entertainment"
    ],
    "publisher": [
        "Soldak Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 69,
    "negative_ratings": 24,
    "price": 6.99,
    "description": "Depths of Peril is a single player action RPG (role-playing game) with strong strategy elements. You play as a faction leader protecting the barbarian city, Jorvik, by destroying threatening monsters and completing quests. At the same time, you compete with rival factions to see who will rule the city.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/23600/header.jpg?t=1536792253",
    "minimum_requirements": "Operating system: Windows 98/2000/XP/Vista                      Processor: 1.2 GHz Pentium 4 (or other equivalent)                     Memory: 128MB RAM                     Hard disk space: 150MB                      Video: GeForce 2 (or other equivalent)                      Sound: DirectX compatible sound card                      DirectX® Version: DirectX 5 or above",
    "recommended_requirements": "Processor: 2.0 GHz Pentium 4 (or other equivalent)                     Memory: 256MB RAM                     Video: GeForce 3 (or other equivalent)",
    "reviews": [
        {
            "review_text": "arpg in the vein of diablo with many random stats. interesting 'political' system with some fellow npc adventurer 'factions'; meant to be replayed many times by restarting the game world on higher difficulties, similar to diablo multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "a true hack &amp; slash festival without any breaks in between. 20+ hours in two days !",
            "review_score": "1"
        },
        {
            "review_text": "Depths of Peril is an absolutely amazing (and indie!) Diablo-like. The world is randomly generated each session, and the goal of the game is to defeat the other barbarian tribes and gain control of the capital city.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wished for a single-player MMO experience, complete with NPC ninja looters who can take quest items and cause you to fail quests? If so, you'll love this game.  Sadly, I'm not one of those people. When the computer-controlled players can cause you to fail a tutorial quest, you've done something wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Dungeon-Siege type game with tons of different monsters and areas to explore, and lots of loot to find.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, the basic mechanics are done solidly. The trade and diplomacy mechanics are decent - they add an interesting flavor to everything, but they could ahve used a touch more polish.  Great little ditty from Soldak entertainment - they do solid work in this area of games and gameplay.",
            "review_score": "1"
        }
    ]
}