{
    "app_id": 236430,
    "name": "DARK SOULS™ II",
    "release_date": "2014-04-25",
    "developer": [
        "FromSoftware, Inc"
    ],
    "publisher": [
        "BANDAI NAMCO Entertainment",
        "FromSoftware, Inc"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Dark Fantasy",
        "Difficult"
    ],
    "achievements": 38,
    "positive_ratings": 30008,
    "negative_ratings": 3799,
    "price": 29.99,
    "description": "Developed by FROM SOFTWARE, DARK SOULS™ II is the highly anticipated sequel to the gruelling 2011 breakout hit Dark Souls. The unique old-school action RPG experience captivated imaginations of gamers worldwide with incredible challenge and intense emotional reward.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/236430/header.jpg?t=1553251192",
    "minimum_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 Processor: AMD® Phenom II™ X2 555 3.2Ghz or Intel® Pentium Core ™ 2 Duo E8500 3.17Ghz Memory: 2 GB RAM Graphics: NVIDIA® GeForce® 9600GT, ATI Radeon™ HD 5870 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 12 GB available space Sound Card: DirectX 9 sound device Additional Notes: Controller support: Microsoft Xbox 360® Controller for Windows® (or equivalent) recommended",
    "recommended_requirements": "OS: Windows 7 SP1, Windows 8 Processor: Intel® CoreTM i3 2100 3.10GHz or AMD® A8 3870K 3.0GHz Memory: 4 GB RAM Graphics: NVIDIA® GeForce® GTX 750 or ATI Radeon™ HD 6870 or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 15 GB available space Sound Card: DirectX 9 sound device Additional Notes: Controller support: Microsoft Xbox 360® Controller for Windows® (or equivalent) recommended",
    "reviews": [
        {
            "review_text": "Game is so hard I can't even launch it  11/10  ---------------------------------------------------------------  Review was based on a bug at launch that stopped the game from rendering through HDMI cables. Game is pretty sollid, only improvement over the first is graphics and playable framerate.",
            "review_score": "1"
        },
        {
            "review_text": "Apparently an 'HD' version of this game is getting released soon. Looks to be what Dark Souls 2 was meant to be initially, yet was downscaled for consoles. Namco Bandai want to charge FULL ♥♥♥♥ING PRICE for it too, regardless of whether or not you already own a copy of DS2.  Another company down the ♥♥♥♥♥♥♥, gone the way of EA &amp; Activision.",
            "review_score": "-1"
        },
        {
            "review_text": "Me and my bro pre-ordered on PS3, Collector's Edition. Me and my bro pre-ordered on PC, Collector's Edition. Me and my bro bought all DLC's.  From originally said there would NOT be DLC's. From released the pc version graphically 'capped' due to console limitations, while removing stuff they already showed and should have been in the pc version.  Now they're about to split the community and make us pay full price AGAIN for the same fuc*ing game we already got, finished ♥♥♥♥♥♥♥♥s of times, spent AGES on and telling us 'yeah let's just give us the full money again and start over 'aight?'.  If they don't make up their mind I will uninstall and won't play this ish again, when CDProjekt released The Witcher 2 enhanced they gave everything FOR FREE for those who purchased the game already.  From software suc*s from now on for me, just screw them and their ish seriously. I know gamers are kids most of the time and still want the toy but it's time to boycott these idiots, just DON'T BUY THIS GAME!  If I knew I wouldn't either, I feel so bad for giving my money to them now...this stuff should be illegal seriously.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is like meth. You can't stop using it and your family and friends become worried for your physical health and mental health as you're yelling at the top of your lungs about how you can't get past the Shrine of Amana. But it's some damn good meth.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to play to relax and unwind, or after a stressful day at work. Drangleic is the cool place to hang out. You can find most of the cool people there. In Drangleic you can just chill and do whatever and totally relax. 'Take it easy' is the Dark Souls motto, for example, that's how laid back it is there. Show up if you want to have a good time. Another good reason to show up is if you want to hang out with friends.",
            "review_score": "1"
        },
        {
            "review_text": "It wasn't even that dark™.",
            "review_score": "1"
        },
        {
            "review_text": "**1/30/16 update** After the HUGE pushback from the community fromsoft decided to do what every other game deveoper has done and has patched in DX 11 support. I still cannot support this game cause you dont simply forgive someone for trying to scam you when they apologize later, but it is worth mentioning that one point of contention has been fixed.  First and formost. I F###ING LOVE THIS GAME. Everything about the game itself is great.  It's not as difficult as dark souls 1 but this is a souls game and you can make it as difficult as you wish through the games own mechanics (I.E Use less armor, a bonfire estetic, or a weaker/non upgraded weapon)  However Namco Bandai and From Software have went all EA on us and decided the people who have already bought the game have no right to play the game's complete version. They are now pulling the single scummiest move of 2015 thus far and are re-releasing the game and charging owners of the original for content that has NO reason to not simply be patched in.  From Soft has spent the last year rebalancing the game, redoing item and enemy placement to make the game more challanging and fun. They feel that it is ok to withhold this rework of the game and not simply patch it into the existing game. They want to charge you again for a product you have already purchased. This is completly unacceptable.  Many people are complaining about the graphical update as well, this I honestly could not care less about. While it is true there is NO reason the game shouldnt have shipped with DirectX 11 support last year aside from making the rerelease that much more appealing further down the line, people who get upset over the graphical fidelity of a Souls game are missing the point of a souls game.  I played and still continue to play this game quite a bit. The game is very solid, but its very clear that the game has been missing something the previous souls games have had, real challange. So now from has finally decided to fix this issue and provide their players with the challange they expect from a souls game, and the message im getting is they feel the players who have supported their game and company from the release of this game dont deserve a real souls game. If we want to play what should have been shipped a year ago, we must purchase the game all over again. No thanks.  Alot of folks are claiming this is no different than a simple 'GOTY edition' for this game. NO, not even close. The game has been drastically changed with the new edition, going as far as to split the playerbase into 2 pools for co-op and PVP. Every single aspect of the new version can and has been patched in. All the gameplay changes are 100% game code and a simple update would suffice. Even the new DirectX 11 API can be patched in no problem, hell even EA patched DX11 into Crysis 2, and we're talking about ♥♥♥♥ing EA here people... There is NO reason any of the new or changed content couldnt be added through simple patches.   Think of an MMO and how quickly and drastically they change even without expansion packs. This is no different and Fromsoft/Namco do NOT deserve money for what has been common practice since the ability to patch was created.  So Fromsoftware and Namco Bandai willingly released a ♥♥♥♥ poor version of their game, waited till everyone who would have bought the game paid for it, then doubled back and said 'Wait wait, DS2 sucked at launch, if you want the REAL game you need to buy it again'. This is EA and Ubisoft level BS (again EA has patched DirectX 11 into their games free of charge).  I highly suggest you refrain from buying the new edition of the game, lest you send the message that crap like this is acceptable. I for one will now go out of my way to ensure Namco Bandai and FromSoftware never see another dime of my money.   But if you need a souls fix I would suggest going for Dark Souls 1 or Demon's souls. Since not only are they superior games (Hidetaka Miyazaki the mind behind souls actually made these [had almost nothing to do with 2]), but you can also buy them used for ps3 or xbox and still ensure neither the developer or publisher gets revenue from the sale.   You guys done F*&amp;^%D up.",
            "review_score": "-1"
        },
        {
            "review_text": "I died while typing out this review.   I'm not even playing Dark Souls.  Dead/10",
            "review_score": "1"
        },
        {
            "review_text": "At first I didn't die, and then I died.    10/10 ",
            "review_score": "1"
        }
    ]
}