{
    "app_id": 23700,
    "name": "Puzzle Kingdoms",
    "release_date": "2009-04-27",
    "developer": [
        "Infinite Interactive"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Steam Cloud"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Match 3"
    ],
    "achievements": 0,
    "positive_ratings": 139,
    "negative_ratings": 102,
    "price": 10.99,
    "description": "Puzzle Kingdoms challenges players to plan out strategic attacks in order to defeat their opponents. Order troops across the map, conquering cities through innovative puzzle gameplay. Players build and manage armies led by heroic commanders to save the world of Etheria from the brink of destruction.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/23700/header.jpg?t=1447351782",
    "minimum_requirements": "Supported OS: Microsoft® Windows® XP or Vista Processor: Pentium 4, 1.5GHz or better CPU Memory: 256 MB RAM Graphics: ANVidia 5 series or better, ATI 8 series or better Sound: DirectSound compatible sound card Hard Drive: 500 MB Hard Drive space DirectX Version: DirectX 9.0c (Nov 2007 edition)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very interesting game. Requires thinking and concentration. So much of rpg through simply brained design. Pure 9 of 10 for puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite Steam games. It was similar to Puzzle Quest 1 and 2, but I preferred the gameplay (sliding instead of the ordinary swapping) and the army-building strategy of Puzzle Kingdoms.",
            "review_score": "1"
        },
        {
            "review_text": "No online multiplayer false advertising only local on 1 pc",
            "review_score": "-1"
        },
        {
            "review_text": "no challenge. just a time waster. been waiting for it to get harder.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow--this game is good. I was expecting another typical ho-hum gem matching game, but somehow they actually made it fun. It feels like a turn-based strategy game, but uses gem matching elements as the means of attacking. It actually works very well.",
            "review_score": "1"
        },
        {
            "review_text": "Nice combination of puzzling and strategy by choosing the different types of elements. Shame its a bit less intresting after you completed the story",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "★★★★★★★★☆☆ 8/10 repeatable - because we'll visit places x-times, but it's still nice casual-puzzle choice",
            "review_score": "1"
        },
        {
            "review_text": "If you are into “puzzle RPG’s” then this could be the game for you. Think of it as Bejeweled with a story and characters. You roam around a world map, pick fights with enemies, and win puzzle battles by matching symbols in order to save your Kingdom. Additionally, the game is colorful and it does have a decent art style.  Unfortunately, although I enjoyed Puzzle Quest very much, I found Puzzle Kingdoms very dull and lackluster in the gameplay department. Also, it just didn’t have that certain element that pushed me to play more. I felt that there was something missing. Honestly, this game actually made me feel like playing Puzzle Quest instead.  I would have to give this game a “Puzzle Quest &gt; Puzzle Kingdoms” score. Money well spent if spent on “quests” instead.",
            "review_score": "-1"
        },
        {
            "review_text": "If you find this in a bundle, go ahead. It's a nice time consumer. Not enough variety for a single purchase.",
            "review_score": "1"
        },
        {
            "review_text": "It's not actually a bad game, it simply isn't worth the $15 asking price. Buy only on a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "It gets a very firm 'Not bad'. Couldn't get into it like Puzzle Quest: CotW. The fact you can only slide a row over one space makes it feel like a gimped Yoshi's Cookie. What do you mean you don't remember Yoshi's Cookie?  Anyway. The battle mechanics work alright with damage and building up resources to do stuff with the board, but the campaign maps are huge and feel like they draw out too long. Also, the dialogue only seems to use male pronouns for the player character despite them giving you the option to have the player character male or female. I mean, the plot is marginal and uninteresting anyway, but if they're going to shoving textboxes in my face after every fight I expect them to take this into account.",
            "review_score": "1"
        },
        {
            "review_text": "It is an intense mind puzzle game",
            "review_score": "1"
        },
        {
            "review_text": "A simple puzzle game, with interesting RPG elements. Not a major game, but can keep you well entertained if you have some time that needs to be killed.",
            "review_score": "1"
        },
        {
            "review_text": "In the same vein as Puzzle Quest, this game allows you to match gems to power up your army units which then attack the opponent. There are several flavors of mini-games available to add new items, spells, or army units to your roster.  The downside of the game is that there is not enough information in-game to really understand the kingdom mechanic (which is how you align heroes and army units for a given match) and the UI is a little rough. But overall it's a pretty decent game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, but a little buggy. And, I can no longer play it without restarting the campaign. Lame, not going to happen. Once you have started a kingdom there is no way out except to win or lose. So I am now stuck after reviving and losing half my gold. I have 100 gold, but my cheapest guy costs 125. I can't buy any guys, battle, or start over. My choices would have been different if I'd have known that going in.",
            "review_score": "-1"
        },
        {
            "review_text": "his game is enjoyable but you have to like matching game to enjoy it and i like these type of games",
            "review_score": "1"
        }
    ]
}