{
    "app_id": 2370,
    "name": "HeXen: Deathkings of the Dark Citadel",
    "release_date": "2007-08-03",
    "developer": [
        "Raven Software"
    ],
    "publisher": [
        "id Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 57,
    "negative_ratings": 20,
    "price": 2.99,
    "description": "Where HeXen Ends, the True Nightmare Begins. Deathkings of the Dark Citadel is the only official expansion of the original HeXen game. This add-on pack features 20 new single player levels from the original HeXen team as well as a host of new multiplayer options.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2370/header.jpg?t=1447351106",
    "minimum_requirements": "A 100% Windows XP/Vista-compatible computer system",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "HeXen: Deathkings of the Dark Citadel is an expansion pack for Hexen, released in 1996. It doesn't feature any new gameplay elements, instead it adds more hard levels for single player and adds more levels and improvements for Multiplayer and Deathmatch. But since everybody uses Zandronum for multiplayer in Doom engine games anyway, it's only just more levels.  Now, if you will try to play the game right as it was installed by Steam you will be met by disaster. It really got to be the worst out of all games that id software published here. Most importantly, the game is unpatched. It's original release. A flawed original release, where develoeprs somehow forgot to link music of Hexen to new levels. So, unless you download and patch the game up, you will have to enjoy some silence. Amazing. Check community guides on how to do that. Then, as usual, DosBox isn't configured good. It lags and so you have to go to game's directory, open the needed .conf file and edit 'ddraw' output to 'opengl' one. And then if you want to choose your control and music device, then you will have to go to game's folder again and drag 'setup' file over 'dosbox' to launch it.  Expansion pack pulls quite an excuse plot twist to justify action: The evil or the sphere teleported you away into land of the dead where you have to defeat Deathkings before being able to return. Who are they anwyay. Ah, right, they just reuse end bosses from Hexen.  So, game adds three new hubs to conquer. Which totals in around 30 levels. They don't use any new textures. Though there are some interesting inviroments anyway. But it's more of Hexen but harder.  The thing is, Hexen was already too dragged. It didn't had enough of variety in combat and weapons for each class. It had tedious part. And bringing even more levels that are also harder and bring no new gameplay elements, well, it's not a good idea. At all. Yes, it has a sin of using bosses of Hexen as tough enemy. You fight big mage demon at the first level of the second hub already.  It doesn't help that I had glitch two different glitches on the first hub. First, there weren't enough of fire masks, key items, in the first world. Yes, I checked with walkthrough on all spots. Somehow, there wasn't. Somehow. And then on another level magic bridge just didn't appear either. And wyverns, bosses of Hexen, got stuck in walls too. So, watch out on first hub.  And main problem and difference in difficulty is monster respawn. Original Hexen would spawn Ettins, common melee weak enemies, after each 10 minutes. Or at least it feels so. It was there just so player will not get lonely while being lost. Dark Citadel rushes you down and beats you up. It can spawn hordes of any kind of enemy more often. And shielding centaurs that are incredibly annoying or flying imps that shoot fireballs at you aren't good enemies to respawn. What it means is that you will have to rush levels down, having to solve 'puzzles', saving/loading and doing other things while being rushed down and under constant heavy pressure. Killing enemies in this game doesn't bring any benefit, there is no leveling or such. You only waste mana and time. A lot of them. So you will have to try not to pay attention to them as you have to rush rush rush your way. And if you get lost, like everybody does in Hexen, then it will not be pretty. It gets really bad on the main level of the last hub, Citadel itself. It's pretty much a hall with teleporters and switches. With water pools for no reason. And enemies not only respawn all time there, they also teleport around when reaching water pools for some reason, with without any special effect. You will be telefragged at least once.  Actually, perhaps it's easier to play as Mage here. His basic weapon, that don't require mana, is a ranged one.  So, Deathkings isn't good expansion pack It feels like it just milks on Hexen more. It's hard not in a good way, it's buggy, it brings nothing new outside of levels and it just makes Hexen outstay it's welcome. You miss nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "While I DO recommend this old school classic I actually DO NOT recommend Steam's Dosbox'd port of this. The controllers and keyboard are unconfigurable in this version unless you use Joy2Key and besides that the picture is blurry and washed out. ",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing Hexen on the 64 and was too young to understand the story and how to play so I just used cheat codes to enjoy the game. This is like the master levels for DOOM and puts you right into the action. A great challenge even on the normal difficulty! Great game for an amazing price!",
            "review_score": "1"
        }
    ]
}