{
    "app_id": 237430,
    "name": "Expeditions: Conquistador",
    "release_date": "2013-05-30",
    "developer": [
        "Logic Artists"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Turn-Based"
    ],
    "achievements": 60,
    "positive_ratings": 887,
    "negative_ratings": 201,
    "price": 17.99,
    "description": "Conquer the New world: In the 16th Century, Spanish explorers and soldiers reached the shores of America. The search for gold, fame, and adventure drove these travelers into a treacherous wilderness where they faced hunger, disease, and dangerous predators. In their wake, the Aztec Empires lay in ruins.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/237430/header.jpg?t=1542611384",
    "minimum_requirements": "Processor:Dual Core 2.6 GHz or AMD64X2 2.6 GHz Memory:2 GB RAM Graphics:nVidia GeForce 8600 GT or higher, ATI Radeon X1800 or higher, min. 256 MB VideoRAM, Shader Model 3.0 DirectX®:9.0c",
    "recommended_requirements": "Processor:Intel Core 2 Duo E8400 or higher, AMD Phenom X3 8750 or higher Memory:4 GB RAM Graphics:nVidia GeForce 280 GTX or higher, ATI Radeon HD4870 or higher, 512 MB VideoRAM, Shader Model 3.0 DirectX®:9.0c",
    "reviews": [
        {
            "review_text": "I was surprised by this indie offering. It's like a combination of X-COM combat, Oregan trail challenges and exploration, with the writing and personaltiy of earlier RPGs like Fallout. This makes for a unique mix.  One of the core features of this game is selecting your party not just for their abilities but for their personality. The various personalities will adjust encounters and inform your game play. You can feel the difference when two other wise identical hunters are seen from the lens of which is more annoyingly pious.  The game also includes an Iron Man mode to keep you honest from save scumming. Which isn't necessary any ways because the designers actually plan for failure. They know you might lose an important or trivial battle and it isn't always lights out or game over like in many other games. For example I actually failed to finish one of the major plot points for the 1st half of the game and things just kept on rolling. Success and deafeat are in equal measures here.  I have three negative points for the game. First while exploring is fun the camera is just too close and so constantly using the map and it's way points is a must for quick travel. My second complaint concerns a small aspect of the combat. Melee combat is much stronger than ranged combat and the guns you brought from Spain have weak damage and a chance to miss. The random encounters on the trail can be very harsh and given enough time you'll get a nasty surprise- also some times the consequences of a choice are not even remotely made clear and so there can be some crazy sticker shock (like instagibs).  Even still this is a good game. I actually think it's worth the $19.99 at full retail and it's very impressive they put this much depth in to a game that pulled in only $77,000 on kickstarter. I finished my first play around 25 - 28 hours doing most of the content in the game. This game has replayability in many of the events and even multiple endings that acknowledge the things that you did during the game and not just at the very end.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you are a Spanish Conquistador. You can choose if you want to trade and intermix with the natives, or if you want to brutally kill them, rob them and burn their villages! For that you get to choose you followers, which can be racist or open-minded, greedy or altruistic, pious or narcisistic, peacefull or agressive, etc. There are several classes of followers, like soldiers, hunters and doctors, and when you gain experience you get to promote them, giving them more abilities to help you in the game. The game is based in the exploration of the main map, with battles every time you encounter someone and don't get the chance (or don't want to) deal with them peacefully or run away. The battles are turn based, and the goals can be to kill every enemy or just to survive a certain number of turns. Most of the times you can set up barricades and traps, or use items like torches and lanterns to set the scenery on fire! The AI is not to clever, but as you are regularly outnumbered these battles turn up to be quite chalenging.  You get to manage your resources, like food and medicine, and if you run out of them, you're in big trouble as you can't feed or heal your people! In the course of the game you'll have many dialogues, with your followers or with other characters, and the decisions you take in those dialogues (wheter to fight or trade, wheter to punish anyone or leave him alone) have influence on the morale of your followers. If this gets too low they will rebel! All in all a very engaging game that puts you in place of a Conquistador, trying to win glory and fame!",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant. Unusual setting. Overworld reminiscent of Heroes of Might and Magic. Tactical turn-based combat a la XCOM. RPG dialog sequences bordering on interactive fiction story-telling. Party members with their own unique backstories, personalities, and RPG-style levelling.  I have found that if you suffer a few devastating defeats in battle in short succession, you will be unable to recover due to the loss of your party members, but the game won't put your out of your misery straight away and will draw out your inevitable demise. So, you may have to do a bit of save-scumming before/after every battle.  If you like video games, you owe it to yourself to give this a go.",
            "review_score": "1"
        },
        {
            "review_text": "Many thanks to the developers from Denmark. They really created a good game with a good dialogue and combat systems in a unique setting. (I do not remember RPG about the Spanish conquest of America).  Playing Expeditions: Conquistador really feel like a pioneer of new worlds. Excellent writing descriptions of events and locations, quests (sometimes feel like the game is not a the video game - this is dungeon and dragons game). Battle system very similar to the combat system of dungeon and dragons. &nbsp;&nbsp;&nbsp;Among the shortcomings can be identified too passive protagonist actually does become de facto 'talking head'. In the battle protagonist did not participate too. &nbsp;&nbsp;&nbsp;It is also unclear why developers decided to limit the battle by only 6 members, while the game has 5 classes in battle using only a maximum of 2-3. One could for instance with the game walkthrough, expand battle map and add the number of soldiers in the combat. &nbsp;&nbsp;&nbsp;While in the game use a historical setting, for the sake of balance developers equalized all parameters in classes, for example Aztec and Spanish fighters has no distinction. Dont be surprised when you see same damage from iron and oak swords, or the same protection from iron and leather armor. As the de facto all the basic classes same as Spain and the natives, victory in battle will bring correct command, upgrades and the choice of classes in combat. &nbsp;&nbsp;&nbsp;In the battle conquistadors do not use horses and pistols (probably forgotten them in Spain :)))   &nbsp;&nbsp;7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Spectacular game (although I'm still a bit bitter that I screwed myself out of a better ending by playing Ironman mode) and I certainly recommend it. It's definitely punishing, but very well written and overall a great experience. I wish it was longer, or that there were more games like it.  My biggest gripes:  - The Mexico map had so much unused space. I thought I would have done a lot more exploring than I ended up doing by the time the map was finished. - Balance of treasure found on the map vs what gets stolen from you almost every night sucks. Managing your valuables is a big challenge. - The time limit on the last battles. Whyyyyy. Totally killed the ending of the game for me.  But with that said, I do suggest the game, although I wouldn't do Ironman - the writing is so good, you don't really want to accidentally get locked out of certain paths.",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game. And since it has been on sale several times it was a resonable price. While it has many features that I like; character advancement, attributes that make a difference in gameplay, good combat, different weapons (or weapon advancement), construction of traps and baracades. It just falls a little short across the board. While the features are there, everything lacks a little depth.  Of course to add the depth that I would like would probably increase the cost of the game. Rated it positive because I do think that it is a good game for the price.",
            "review_score": "1"
        },
        {
            "review_text": "HMM! where i start...   It would be unfair to Start on a negative. Expeditions: Conquistador is far more than a reskinned King’s Bounty, exploring a historical moment with confidence and skill. The combat system is effective and while some aspects of management become a chore, the focus on stories and characters means that there is almost always at least one interesting plot on the boil. The maps will be the same if I play again, so I doubt I’ll revisit but if there are more Expeditions to come, I’ll certainly pack a bedroll and hop on board.  RPG/Strategy/Turnbase-  the game breaks down into four parts: exploration of the map, turn-based combat, party management and roleplay. It’s in the latter that the game finds much of its quality, offering meaningful choices during well-written dialogue, and decisions that have a bearing on the world, and characters’ relationships and concerns. The RPG aspects feed back into party management and while there is levelling, equipment and skills are doled out from a mass of shared resources, which diminishes the tales of personal progression. Equipment, particularly, is odd. Rather than finding items out in the jungle or buying them, upgrades are a numbered resource, which can then be applied to characters, moving their belongings up through the tiers that relate to their profession.  Bad...(just my opinion..)  - Wish game longer..(Where the DLC? ) -only 2 Map(this include prolouge map..) -Racist NUN!",
            "review_score": "1"
        },
        {
            "review_text": "I'm.. a bit biased. I backed this one on Kickstarter and wrote a couple of events for it.  That being said, Conquistador is a really good game. The writing is excellent and there's tons of it, there's a lot of freedom once you reach Mexico, and it really is a true roleplaying game in that sense. The combat is fairly simple, but it's fun and there's enough going on to keep it from getting dull or repetitive. If you like RPGs and are interested in something that's not filled with lazy fantasy cliches, Expeditions: Conquistador is worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "I was surprised at how addictingly fun this game is. The party system is awesome, and the exploration is great. But what really makes this is actually the RP'ing elements. Your choices really affect the world, and your party of conquistadors. The options of what you can pull are great too. Whether you want to be a marauding conqueror, a cunning manipulator, or a noble diplomat, or any combination of those, is up to you. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really stands out even months after paying it. Story, Stragegy, Sim, tripple A! :)",
            "review_score": "1"
        },
        {
            "review_text": "A very deep, good, and immersive tactical game. The game is more of a rpg than most rpg: you PLAY A ROLE you got to progress and lead your people, and find the treasures everyone wishes for. Or perharps you are after peace with the locals? or here to conquer them? will you marry a local? one of your own? or end up with an amazon? religious.. good.. evil.. it's all a matter of perspective.. as the winners write history!   Must play for tactic gaming fans! you have no level, you need to use your squad and tricks to win the day!  -Lost",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome so far! It's part Oregon Trail, part Indiana Jones, and a dash of Legends of Esienwald mixed together. It's such a refreshing mix of RPG, survival, adventure, exploration, and party management. There hasn't been a game like this in sometime, and couldn't recommend it more to anyone looking for something fresh to play!",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing. Think XCOM mixed with Fallout slathered across a nice tasty dose of Mount &amp; Blade. The moral choices are amazing, from dealing with peaceful 'savages' in the storyline to chosing which of your men to save from quicksand from random events. The travel and camping systems are sublime, distributing rations and assigning tasks to your men every night. The game has the best qualities of so many different genres combined, you're doing yourself a diservice if you do not pick it up.   8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "In game diaglogue...  Talking to a Male You: Robert! What in gods name are you doing?!  Robert: Sir? You: Let the slaves fetch the wine! Muahahahahahahahahahahahahahahahaha! Robert: Muhahahahahahahahahahahahaha!  Result: SLAVE UPRISING!  Talking to a Female Rosa: I would like to speak with you about my father.. he's sick.. You: Show me your t***!  Result: Your party morale has increased by 8.",
            "review_score": "1"
        },
        {
            "review_text": "Every choice you make can lead to a completely different story and the game has amazing turn-based battles 13/10",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game at all. 6 hours in and it is keeping me interested. Very similar to Heros of Might and Magic, but with a lot more micro managment. Great to see a era of history that has not been explored in gaming getting a look at. Expect about 5-10 hours before bordem sets in. I got it for $8 so that is about $1 an hour - cheaper than the beer I drunk while playing.",
            "review_score": "1"
        },
        {
            "review_text": "Great turn-based strategy/RPG game! The one thing that stood out to me is the dynamic of having to balance the different personalities and prejudices of your party. A great exercise in leadership decision-making that you don't normally see in this type of game. Of course, with enough resources, you can eventually get back into the good graces of even your most disagreeable party members, but those resources are at times woefully limited. Choose your party based on your style of gameplay and they will follow you anywhere!",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn-based rpgs with replay value and micro management, this is right up your alley! This game has me completely addicted. Multiple followers and stats to choose from during campaign creation, hex-grid, your choices have an influence on the story and rewards thorough exploration, and explore you will! Easy setting is very easy and I recommend it on the first playthrough to learn from mistakes. There are several dozen achievements to raise the stakes as well- The only downside is that the game is relatively short. A single playthrough takes between 20 and 30 hours. All in all, I sincerely recommend this gem. I can't wait to see what similar game these Scandinavian wizards release next. I'll be sure to buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Should you spend 15-20 dollars on this game… YES Let me start by saying most likely you will play the first 5-6 hours of this game a few times. The learning curve is steep. But once you get it down; those extra features make the game a great play. What do I mean by the learning curve…  1)MOVING- knowing that you can rotate the camera 365 degrees (right mouse click) or the fact you can use space bar to move horse, or select a point of interest on the map and it plots course for you. 2)LEARNING CHARACTER UPGRADE- When you upgrade units you can select skills in those upgrades (do you go for block… do you need a good patrol person or a guard) understanding how those work in game takes a little time…  3) THE EXTRAS—let person X work on a cart, or a axe, or cannon balls. How much armor do you want on each person… ECT, ECT Once you know that stuff.. this game is fun (though makes you want to do a face slap sometimes). THE REASON YOU SHOULD BUY THIS GAME— 1)The devs spent lots of time in the story (true historical fiction) some of the people/places are real and historical. 2)upgrades you can see… a shield when you have stronger armorand small things like that 3)combat maps… you are not always on a 16x16 map like other hex games.. sometimes in a large map, sometime a long skinny one… lots of varity 4)you can change you party based on if you want to be a ruthless killer, or maybe more civil (but who does that) ",
            "review_score": "1"
        },
        {
            "review_text": "Very fertile and off-the-beaten path, this Conquistador-focused setting. Don't think I'll ever see a game set partly in Hispaniola ever again.   In short, I recommend it. Fights happen a little bit less often than one would think, but not by much and the fighting that's there is oodles of fun if you're prepared.  The game is definitely half-and-half combat and setting though, perhaps leaning ever-so-slightly towards the setting side.   The battles are XCOM-like and the overworld map is Mount and Blade-like, however it can be harder than both those games. Battles are much less reliant on RNG (save for Hunters/Trappers whom use guns/bows) and you must camp in the overworld when your troops get tired.   I will say this now: do NOT just go through the main storyline quests on Hispaniola. Do the side quests. Otherwise you will lose **horribly** for a while and you will **not** be ready for the mainland when you reach it. Enemies almost always match or better you in quality AND quantity save for the odd encounter.   What you SHOULD do first of all though?  Buy the game.",
            "review_score": "1"
        },
        {
            "review_text": "I REALLY CAN'T SAY ENOUGH ABOUT EXPEDITIONS: CONQUISTADORS IT IS A SOLID GAME ABOUT CULTURAL SENSITIVITY AND BONDING WITH YOUR FELLOW WHITE MAN WHILE YOU DELIVER PLAGUE BLANKETS TO SNUFF OUT A DEVELOPING INDIGINOUS PEOPLE FROM THE PLANET. I MEAN THEYRE IN MEXICO AND NOT EVEN EATING TACOS AND TAKING SIESTA GOOD RIDDANCE IMO. THE WRITING IN THIS GAME IS EXCELLENT THOUGH, I'M SERIOUS, LOOK PAST THE CAPS I HONESTLY LOVED THIS GAME Y'ALL.",
            "review_score": "1"
        },
        {
            "review_text": "My friend recommended this game to me; I now recommend it to you.  This is a turn based strategy game with you leading a party of Conquistadors on a mission to explore Mexico. On your way you get delayed and presented with many choices on how to proceed.  Battles are enjoyable. There are multiple ways to come out on top. You can make use of your RPG skills to scout the terrain, or deploy scouts to get an idea of the enemy party. You also select your party for each battle. The makeup of the party, their equipment, rank, and skills, all affect your success. Several difficulty levels allow the game to range from pretty easy, to quite a challenge.  I didn’t have any trouble with the game. Some previous reviews mentioned crashing and the need for patches, so maybe waiting two years before playing is a good strategy! With all of the text in the game I expcted many typos, but only found one. (Someone wrote seize instead of cease, if anyone wants to fix it)  The story is great and remains interesting until the end. Several reviews mention historical inaccuracies, and freak out because there are too many women in the game… Just pretend the game is based on events which took place on Earth, but in an alternate dimension.   There is a lot going on in this game, and if you want to fully enjoy it, read the guides so you’ll better understand the interface, and mechanics before starting. You may also fail your first mission and call it a learning curve. Your second party will make it much further. I couldn't figure out how to equip or use the special equipment (traps, barricades, lenterns, torches...etc.) on my first mission. ",
            "review_score": "1"
        },
        {
            "review_text": "Miss Battersnatch taught Social studies she created this great game where the class pretended we were Conquistadors exploring the seas! Each week we'd have a dish from civilizations we'd 'visit' like some Holy Guacamole!! from a Mayan Empire.  Well if Miss Buttersworth could see me now. I GOT A WHOLE LOT MORE THAN SOME GUACAMOLE MISS BARTHELWITZ!   Expeditions is depicts (at times) a rather ruthless expansion into unsettled territory, the gameplay fits the bill akin to Pirates Gold! overland map and your tactical XCOM-esq combat. While the gameplay works just fine, the interesting part is resource management and your relations with the locals and your own party. If you initially hire on peace faring hunters, doctors, etc you may find them abandoning your expedition for going out of your way to engage the enemy.  So if trying to run an Expedition is your bag go ahead and try Oregon Trail: Spanish Adventure.  3 out of 5 Chiliwigs",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game from an Indie developer. Very engrossing story. Well written. Combat is turn-based and the AI can be a surprising challenging opponent if you crank up the difficulty. I highly recommend this game to anyone who enjoys strategy, exploration and a good story.",
            "review_score": "1"
        },
        {
            "review_text": "It's amazing what can be done with great writing, an untapped period in history, and hex-grid combat. Expeditions wastes very little time in diving right into the feeling of being a conquistador at the head of a company during the age of colonization, from the politics to the racial divides to the different choices and approaches that you, the player, can take, and how those choices affect the setting and your team. And these aren't faceless dolls or pawns like so many other strategy games, but people with their own policital stances and beliefs and skill sets derived from a pre-made backstory. They have their opinions, and there are regular events that highlight those opinions and how they connect with the rest of the company. This game takes roleplaying to its core and makes you feel like a leader of friends and allies rather than a commander of disposable people.  That said, it's not all perfect. The in-game economy of always needing to buy rations or hunt for food can get tedious and irritating when you're in a hurry to get somewhere, the camping system, while interesting, has a bit of a learning curve, and the ranged weapon hit percentages can be horribly misleading. I don't think I've ever missed so many times with an 80% or higher chance to hit. Also, the directions in the second half of the game can get a bit hard to follow. There are quests to be done, but I'm not sure what they are in the service of, while the first part of the game was very well explained and set up. But these are minor when the writing is excellent, the tactical maps and combat AI are both fun and challenging, and the sense of immersion thatt he game introduces is top-notch.  All in all, I'm having a real blast with Expeditions: Conquistador, and would recommend it to RPG and strategy fans alike, because there's a lot in here for both. And if you like both of those genres, then it's well worth its price. A different story and setting from the mainstream, gripping characters with very real beliefs and politics, and the feel of responsibility, or power, that comes with making decisions that affect the company and others in the game all combine to make for an excellent gaming experience.  Buy it. At full price or on sale. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "It's basically a well-written gamebook in a very interesting setting, with squad-based tactical combat, and a campaign map reminiscent of HOMM or Armoured Princess. I love it! If some more campaigns become available, then it's gonna be a must play for RPG lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, interesting and educational story.",
            "review_score": "1"
        },
        {
            "review_text": "i can throw an oil lantern on someone and set him and the jungle on fire  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Definite buy!  This feels like how a PC game should feel. Good RPG and squad level tactics. It is not real-time and is turn based, which is great for gamers like me who like strategy and thought vs. twitch.  The story is really interesting and really feels like a Choose Your Own Adventure book. Replayability is there with the many options. My only real criticism is sometimes navigating the world map can get a bit clunky (like for example trying to find a mountain pass). I can't wait for an expansion or the planned Expeditions: Viking.",
            "review_score": "1"
        },
        {
            "review_text": "BLUF: I recommend this game for the player who likes tactical turn-based combat, mixed in with some exploration and resource management.  -Interesting story where your choices have actual implications in the game world -Combat can be brutal, but there are ways to win most battles. You may have seriously wounded party members at the end, though. In some cases, bringing fewer than six members into combat encounter is key to victory. Scouts can move really fast.... -Pretty solid underlying game mechanics. While some players may not like the design decisions they are mostly consistent in their approach. Bad player decisions lead to bad outcomes and loss of troop morale, for instance. -Resource management can be a challenge at first. Random travel events can quickly cause loss of rations, valuables, and medicine if you don't assign party members to correct tasks.  My only minor issue is the interface. Camping screen is click-intensive and can become tedious, considering you will be there several hundred times during a game. Likewise, a few more hotkeys for combat would most welcome.  Overall, a game worth a look for the right kind of player.",
            "review_score": "1"
        },
        {
            "review_text": "Game is just too damn hard and frustrating, it needs to be just a little easier IMO",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing Fantastic Pretty short though",
            "review_score": "1"
        },
        {
            "review_text": "Crash on startupp and im being told i need to fix it myself. What a shame. really wanted to play this game 8/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a little gem. Forgot how I discovered it, but glad I did. Underated for sure.  Combination RPG/Turn Based Combat game that has some of the best elements of both genre's involved. Not very deep on the RPG side mind you. But you can be Cortez, and kill millions of Native Americans with smallpox, then steal their gold. Haven't you ever wanted to do that?  Don't lie. You know you want to. Tap into your dark side. Or... you know. Make friends with them and stuff (yawn).",
            "review_score": "1"
        },
        {
            "review_text": "All the excitement of genocide and slavery with none of the real world consequences!",
            "review_score": "1"
        },
        {
            "review_text": "Commiting Genocide upon native populations has never been so rewarding! 8/10, its okay.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Looking forward to Expeditions: Vikings",
            "review_score": "1"
        },
        {
            "review_text": "This game is stupid straight up stupid. It's turn based a ton of reading plus the battle is just ♥♥♥♥♥♥♥♥. Plus so scripted. Oh and stupid crap like a group of bandits enters your base stop them from escaping. Ok how when your gunmen/bowmen miss all the damn time.  I don't know how this game is ranked so high don't make the mistake I made and waste any money on it!",
            "review_score": "-1"
        },
        {
            "review_text": "Explorer heavy game with Xcom like combat and team importance in a Spanish 16th century era of South America. While the graphics wont win any awards its functional and the game is full of FTL like encounters with choices to make.  Everything has pros and cons and 'evil vs good' type choices seen in other games have been replaced with more realism than is some times comfortable. Half of your soldiers are racists? Well, maybe you will be forced to make a racist decision in order to stay in charge. Want to help out a small group of farmers, but your group is low on food? Well, maybe taking the food by force is a eat or starve choice instead of being good or bad... and so on. Its a very interesting game that is different from most in a good way. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, but after the first chapter game crashes on reloads and battles. Unplayable, and I am way over on specs. Nobody would buy a book or movie if you only have access to first 20%, but idiots at STEAM refuse to refund based on time played.",
            "review_score": "-1"
        },
        {
            "review_text": "The creators obviously went to the same school of probability as the people who designed the first Fallout games - 85% to hit? Yeah, ok.. Miss 5 of those in a row and then wonder about the ACTUAL chance to hit.. meanwhile the enemy are rocking quick shots like they GAIN accuracy instead of losing it. VERY VERY DEEPLY ANNOYING. Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "If you love oppressing brown people and you thought that the ♥♥♥♥ and pillage depicted in Europa Universalis IV was way too impersonal for your tastes, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "A very graphically-challenged turn-based game, that has you move people, without the ability to actually attack the enemy, or that feature was missing from the poorly designed tutorial, that does not show you how to turn your screen, leaving you to having to look in the settings repeatedly to find the correct keybindings to locate the rotate screen buttons so that you can see the person you need to talk to. Also, the movement of the player is very glitchy, sometimes its works, most times, it does not.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't really recommend this game yet. Battle screens can be incredibly frustrating, since it is not possible to zoom out far enough. For example, there is an encounter where the goal is to move your party to the exit point within 8 turns. The problem is that it takes a good 15 minutes of attempting to scroll back and forth to find just where that exit point is. Then each time you want to move one of your party, it takes another 15 minutes to try and locate where each character is and then you can only hope that you have them moving in the right direction. Repeat for each round. Would be very frustrating even without all the trees blocking your view! Better just to quit out (and the game will crash at this point) and restart in the hopes of avoiding that type of encounter.",
            "review_score": "-1"
        },
        {
            "review_text": "It was ok. Not at all worth my $20. But you might like it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a very good concept, but long enough to become bad because you will berunning out of options during the gameplay. Might as well go back to Heroes of Might and Magic.",
            "review_score": "-1"
        },
        {
            "review_text": "The Conquistadors have never really been touched by video games before. How many Zombie games are there? We have done WW2 to death then, LITERALLY, raised it up as a Zombie and ♥♥♥♥♥ it to death again, then said hey WW1 come sit on our laps for a while ya? We have the revolution covered, Pirates, Knights, Ghosts, Aelins, Space Empires, Greek City States, Rome it goes on and on. But the Conquistadors...if you look up the history it was not like so many people think, Cortes did not go with the full power of spain, it was a handful of men, and entire Nations of people abused, enslaved, sacraficed and eaten by the Aztec empire. They asked for his help and against all odds one of the craziest episodes in History played out. These men went to another planet and fought (and worked with) and empire of MILLIONS. Here is your chance to re write history of oversee the routes it took. Will you be Benevolent? Or Cruel? Or somewhere in the middle, help who you can while filling your coffers. YOU EVEN START A TOWN, oversee its productions and construction and defend it from enemies. 10/10 UNIQUE experience",
            "review_score": "1"
        },
        {
            "review_text": "Playing this on Ironman mode really makes you weigh your choices before making a decision. It seldom makes you think that one decision is in the best interest of all your companions and the others doom them. Plus, a hex grid for battles is always a plus. Overall, I've found it worth the money, though it's not the best tactical RPG I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "It plays like a colonial version of XCOM: Enemy Unknown, with the addition of an overworld to explore and questlines to pursue. Bugs and a lack of combat and travel animations make E:C feel unpolished at times (which is understandable for a Kickstarted game) but I was never distracted or taken completely out of the game. I would recommend the game, and would DEFINITELY buy a more in depth and polished sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game. Wish it were 10x longer.",
            "review_score": "1"
        },
        {
            "review_text": "ITs like Civ meets XCOM yet has its own style. Seriously worth the buy ",
            "review_score": "1"
        },
        {
            "review_text": "This is an old-school PC game, with lot of saving/reloading. It consists of Heroes-like overland map and Fallout-like combat and dialogues. There's lot of adrenaline battles, as when your last expedition member succumbs to the last surviving enemy, or there is one last enemy alive when time's out. Combat is never repetitive, as environment, day cycle, number/type of enemies and goals always change (kill everyone, survive for certain number of turns, get to the escape zone or kill everyone in limited number of turns). There are plenty of nasty random events on the overland map that add spice to the gameplay and can be fatal sometimes. I was outraged by this game at first (because it is so different from today's typical Steam offering), but believe me, it's a gem!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! It's the definition of an underrated hidden gem. Its a matter of opinion but for me this game easily one of my all time favorite in my 25+ years of gaming.   If you haven't tried it at least give it a chance. If its the type of game you enjoy you won't be disappointed. Mexico is where the game really shines.   Support the devs! Their next game Vikings looks even better and I would love to see them continue with this awesome series.  Well done Logic Artists!",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant, well writed adventure in the middle of the jungle. Gameplay is good as long as you like turn based game (like xcom, baldur's gate...). I strongly recommend you to buy it for its atmosphere. A big plus, each adventure is different since your actions do have a lot of consequences. Can't wait to see what's coming next from Logic Artists, cheers guys! ",
            "review_score": "1"
        },
        {
            "review_text": "Conquistador has been an unexpected delight. With combat similar to X-com, mixed with team RPG leveling and a great survival aspect, this is an overall great little strategy game. I got this on discount and would of probably been just as happy paying full price.  The main pros of this game come in the rich story, beautiful graphics and battles. The music is good and I can often find myself playing for long periods without noticing time at all.  The game isnt perfect, and its beyond a challenge to be fair. At night random events can seem relentless, harming parties or loosing equipment. But the game IS hard make no mstake. I went in without reading any manual first time and my people all died within a few days, second time same again. Playing on easier modes is less fun, though you can fine tune the difficulty in regards to battles and survival.   Any game that allows you to massacre innocent women and children gets a thumbs up from me, give it a go especially if its on a discount and you like X-Com",
            "review_score": "1"
        },
        {
            "review_text": "This game is entirely addictive and replayable!",
            "review_score": "1"
        },
        {
            "review_text": "If you like XCOM or King's Bounty this is the best of both of those games. A much richer tactical combat system than XCOM and a much richer 'map' mode than King's Bounty.",
            "review_score": "1"
        },
        {
            "review_text": "You might think this is a boring historical strategy game, but you'd be wrong. This is the best straight up RPG in years. Your decisions matter, the combat is tactical and fun, and you feel like you are really exploring a hostile land. Pick it up if you've ever wanted to create your own band of roving murderers and commit turn-based genocide.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, it gets a bit too hard after certain point and you will need to replay the same part a few times too but who said conquering new lands for the kingdom was easy?",
            "review_score": "1"
        },
        {
            "review_text": "A tough fund adventure. Just a few hours in but I'm definitely hooked. The story is compelling and the combat is turn based combat.  The game centers around selecting your men (or women) from various classes; Hunters, Soldiers, Medics, Scouts and Scholars.   You traverse the overworld map finding resources, doing various quests and managing your camp when you've run out of movement for the day.  The combat is solid turn-based action. You earn XP which can used to level up your followers and give them a wide selection of active or passive skills.  I'm definitely enjoying my time and highly recommend it for anyone even slightly interested in the title.",
            "review_score": "1"
        },
        {
            "review_text": "prepare for a task assign simulator and scouting huge empty areas. Expedition yes, conquistador, dunno you can't even appreciate the strength of your encounter.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game expecting to dislike it but since it had the Xcom like battle system... well 50 hrs of gameplay later and I still enjoy the game. Especially if you find it on sale or in the Humble Bundle, grab it up for fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good strategy game that kept me entertained for 30-40 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Easily worth the money, has its weakpoints ofc but honestly its still better than 80% AAA titles out there by far. A nice nod to good oldschool games, if this can be done on a nonexistent budget imagine what a real budget would give.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very interesting story and the fun of exploring an unknown world, looking for secrets with your crew. The combat is good as well. Not the best or the selling point, but strong enough that it doesn't get stale bad. The game is a tad on the shorter side, especially if you rush through, and the replayablity is limited due to 2 different stances. Kill the natives, or befriend them. For $20 I think it is well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ man this game really is good, makes you think about how you attack and play, always a reward and curse to everything you do, and gives a nice brief history of the spanish conquistadors.  I personally highly recommend this game i didnt even knew it existed till i saw it in the sale...",
            "review_score": "1"
        }
    ]
}