{
    "app_id": 237470,
    "name": "Battle Worlds: Kronos",
    "release_date": "2013-11-04",
    "developer": [
        "KING Art"
    ],
    "publisher": [
        "KING Art",
        "THQ Nordic"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Strategy",
        "Turn-Based"
    ],
    "achievements": 39,
    "positive_ratings": 159,
    "negative_ratings": 76,
    "price": 14.99,
    "description": "Battle Worlds: Kronos is a classic turn-based strategy game in the tradition of Battle Isle, Advance Wars and Panzer General. Have you ever wondered what games like that would look like today? Well, we did. As a result, we decided to develope Battle Worlds: Kronos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/237470/header.jpg?t=1513065824",
    "minimum_requirements": "OS: Windows Vista, 7 or 8 Processor: 2.0 Ghz Dual-Core Memory: 2 GB RAM Graphics: DirectX 9c compatible with 256 MB RAM, Pixelshader 2.0 DirectX: Version 9.0c Storage: 3 GB available space Sound Card: Integrated audio interface",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game indeed looks nice. But once the first impression fades away, you realize that it plays worse than Battle Isle 1 or Battalion: Nemesis or even Advanced Strategic Command (these games are either significantly less expensive or even free), The biggest downside of this game for me is that the UI is sluggish and not as assistive as it could be. As you play the game, you realize that it takes quite long, because you wait for something all the time (UI to respond, animation to finish, CPU to make a move). Note that I have a 2.9GHz Haswell i5, so the sluggishness is not about weak HW. The story is not great, in-game popup story dialogs are not something you look forward to. The AI is OK, sometimes stupid, ignoring you while you move around and take an advantageous position, but you are going to be grateful for that. I don't recommend buying the game for more than $10 unless there is a significant patch fixing the issues above. The authors had such great examples to learn from, but they probably didn't play the game much. Otherwise they would have concentrated more on gameplay than on visuals.  Patch 1.1 update: The developers have addressed some of the most painful issues, and the gameplay experience has improved considerably, but there is still room for improvements. What now stands out is the passivity of the AI The enemy has much more units at its disposal, but they basically just react to you when you start your offensive. Very sad when you compare it to Battle Isle 1. The game is IMO worth $15 after the patch and the Battle Isle series is well recommended prior to Battle worlds: Kronos",
            "review_score": "-1"
        },
        {
            "review_text": "If you want to enjoy this game, prepare yourself for long winded tactical combat. Also, prepare yourself for restarting campaign missions quite often. Due to the turn based nature of the game you can easily lose all your troops before you even know what to do or where to go in a mission. That is annoying, I have to say. Other than that, it's a neat game though.",
            "review_score": "1"
        },
        {
            "review_text": "A very content dense, and well thought out TBS. Classical in the sense that it borrows a ton of concepts from the games that came before it, while sprucing them up with a modern graphics set and extremely streamlined UI. If you're looking for a game to satisfy your strategy urges and enjoyed titles like Advance Wars, Battle for Wesnoth, etc. then BW : K will be right up your alley. The campaign alone will get you 40-50 hours of gameplay if you hustle. Definitely a purchase worth having for any TBS fan. Also, DAT SOUNDTRACK. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "If oyu like the oldschool turn-based strategy games like Panzer General or Battle Isle: Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Many people said to play the demo. I didn't. I thought: well this is a TBS version of an RTS. Precisely what I was looking for. Did 2 or 3 missions and just can't continue. The opponent AI has way too many units compared to my own. It felt like a grind to complete missions. My advice: heed what the others say: get the demo first.",
            "review_score": "-1"
        },
        {
            "review_text": "Fans of the Battle Isle series of games from legendary developer BlueByte, will enjoy this turn based strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "it's good. It doesn't reach its goal to reimagine battle isle, but i will definately come back to this game during my next vacation. good invested kickstarter money.",
            "review_score": "1"
        },
        {
            "review_text": "Battle Isle returns - in a good way. This is a must-buy when you like turn-based strategy games!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game so much, but it's so difficult.",
            "review_score": "1"
        },
        {
            "review_text": "Preface, yo: pretty graphics make me happy, and good gameplay with minimal or retro graphics make me happy. This game don't make me happy. I'm probably naturally pushed towards discontent being that I was a kickstarter, but as far as graphic fidelity I was hoping for, at least, something along the lines of Dune 2000 (which recollection serves me none at all when it comes to when it came out but I'll hazard a guess that it was around 2000). And I was hoping for gameplay depth at least around the level of Dune 2000. And as a pledgeman, a reach goal was depth around the level of MAX 1. Forget setting the bar as high as MAX 2.  As the project progressed, I learned that there would be no real base building component to the game and worried about my pledge (not that anybody promised it -- I just dreamed it). It still seemed like the developers had a passion for mechanics so I stayed interested. I might be jumping the gun, and I know for a fact that I have gotten pussified as the years have passed, but such a disappointment. Like combining the worst of a table top tactics game and a pc game. You get damaged, you just drive over a tile with a wrench icon. With maps hundreds of tiles across with instant healing and ♥♥♥♥♥♥♥♥ AI? Just wander, stumble, shoot, lose, memorize the pattern and try to iterate a better plan. Nothing pretty to distract you from the mindlessness. A total derth of emergent behavior. Not my version of fun and a pledge wasted. Postface: I could have tried to get involved, and had I been ignored I'd have a more substantive complaint. I didn't. Just a review of the finished product. May get more involved in Unsung Story?",
            "review_score": "-1"
        },
        {
            "review_text": "Just for the statistics: I'm a passionate player of turn based strategy games, I've played a lot of them and I was never fearing a tough challenge.   I really wanted to love this game, but like many others, all I found was frustration. The reasons were dicussed well enough. I will not repeat them.  The Dev's response related to this critism suggests, that they do not see any (design) failures on their side and that they are not willing to intoduce corresponding changes. Well, that's ok - its their game and there seems to exist a certain fan base which favours b]their approach . But hence, this will be my conclusion: Deinstall BW:K and discourage my friends from buying/playing it.  Best regards, paxSeb",
            "review_score": "-1"
        },
        {
            "review_text": "Its just so very dull. Avoid.",
            "review_score": "-1"
        }
    ]
}