{
    "app_id": 237760,
    "name": "Intake",
    "release_date": "2013-11-06",
    "developer": [
        "Cipher Prime Studios"
    ],
    "publisher": [
        "Cipher Prime Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Great Soundtrack"
    ],
    "achievements": 77,
    "positive_ratings": 349,
    "negative_ratings": 26,
    "price": 6.99,
    "description": "Intake is the new retro-futuristic drugstep arcade shooter from Cipher Prime. In this polychromatic love child of Dr. Mario and Ikaruga, you battle a never-ending barrage of pills, pushing your skill and reflexes to the limit to avoid a lethal dosage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/237760/header.jpg?t=1447357812",
    "minimum_requirements": "OS: Windows XP or Later Processor: 2.2 GHZ Intel Core 2 Duo Memory: 2 GB RAM Graphics: Nvidia 8600M or better Storage: 450 MB available space Additional Notes: We recommend some great headphones or a nice speaker set.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Perfect game to improve your reflexes and it's quite addictive as well.",
            "review_score": "1"
        },
        {
            "review_text": "Intake is bananas. I’m not even sure what genre to clump it into. I think the best way to understand what the game is would be to just watch the video on the steam store page. Gameplay wise, this is one of those titles you leave installed forever but only play in short bursts for 15 minutes here and there. I absolutely love it and I love the music and chaos, but if you’re not into what you see in the video, then don’t bother trying out the full game. What you see is all you get.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and 'addicting' game. To be honest, I don't understand why I don't see more people playing it. Great soundtrack, visuals, and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Game is brilliant! I were looking for fast paced, reflex game, and i get exactly what ive expected! Game is really challenging!  10 out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "Though the soundtrack is fun, the visuals are disorienting and gameplay is too fast for my tastes.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is AMAZING. The colors. The music. Everything abou ♥♥♥ ROCKS!!!! GET IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "What a trip.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME! Pewpewpew!",
            "review_score": "1"
        },
        {
            "review_text": "Arcadey gameplay with great graphics makes for a decent game with 4 unlockable tracks that run on a fifty second or less loop. Almost addicting but the music is underwhelming if you are a fan of any edm. Feels like a ten dollar app.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is extremely fun, challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive as hell. Catchy music. Great gameplay. Beatiful graphics. 100% Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "THE COLORS DUKE, THE COLORS!",
            "review_score": "1"
        },
        {
            "review_text": "wow WOW wow yeah wow if u like hotline miami or audiosurf you will",
            "review_score": "1"
        },
        {
            "review_text": "Amazing twitch game!",
            "review_score": "1"
        },
        {
            "review_text": "Addictive! Stylish! Aggressive!",
            "review_score": "1"
        },
        {
            "review_text": "They kept telling me to try drugs. Now I know why...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Beautifully visualized, addictive and 'challengeing'. At first it was difficult to figure out how the game and controls work, even though the controls are  very  easy, but after another play, the controls were getting familiarized. The only downside is that you  can  change the binding key for the shooting, but not for the alternate color. Would like it easy-er to have the main and second color binded to two seperate keys to press and shoot.  For the price, it's totally worth it! Graphics, Particles, Achievements, Badges, Cards and MOAR!",
            "review_score": "1"
        },
        {
            "review_text": "Warning: Dosage may be Lethal  Intake is a fun game. Click one mouse button to change color, click the other button to 'shoot'. Shatter glowing colored tablets to get points, and don't let any hit the bottom of the screen. At the end of each level, any pills still on screen turn into tiny bonus tabs you can shoot for more points. Your points at the end of the game are recycled into points that let you buy things like weird powerups, more music, more colors, and other modes.  It's trippy, it's fast paced, and requires twitchy clicking. It'll probably give me carpal tunnel by the end of the week.If you like pounding, dirty bass lines and bright neon-colored explosions with frantic shmup-like gameplay, this is a game for you.   Really the only downside is the default price(9.99 as of this writing). Worth considering waiting off for a sale but definitely worth playing and buying anyway. It's well-made, and plays well.",
            "review_score": "1"
        },
        {
            "review_text": "Trippy as hell. Best game concept ever thought of. Get this game NOW, you will get addicted in no-time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is rather addicting as you will be challengened more and more the further you progress. It is a simple game which is easy to learn and fun to play.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun way to kill some time its a intence game were u click falling pills before thay can hit the botem of the screen wile lissening to fast pace dubstep type music as u progress in the levels thay get harder and faster wile u play u colect tablets of Mg to spend on upgrades and unlockables its fun but dont overdose on it or ur mouse/hand may feel ill after words lol",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game. One of a kind.",
            "review_score": "1"
        },
        {
            "review_text": "definite an awesome arcade style shooter. I wish they made a mobile version for iphone and android! I play this on my down time if not playing hearthstone.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty dope game, no pun intended. Addictive music and skill-based game. What else do you want?",
            "review_score": "1"
        },
        {
            "review_text": "Great time waster, test your reflexes, feel like a badass, etc etc.  If the song in the gameplay trailer doesn't thrill you, there are others you unlock through the course of the game. There is a progression of upgrades, so you aren't dropped right in the from the start. You choose which you want to unlock first and when to upgrade them. As you get better at the game and more powerful upgrades you will go further and earn even more. You can drop in from a later checkpoint if you're looking for a shorter hop in/out kind of play, or start from the beginning every time and try to build a massive combo for big points.   TL;DR - Drugs are bad, game is good",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. It's so fun and can be very addicting. Gets quite challenging.Simple and beautiful. Colors are amazing music is very enjoyable. So glad I got this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "+ Very addictive for such simple game.",
            "review_score": "1"
        }
    ]
}