{
    "app_id": 237970,
    "name": "Memento Mori 2",
    "release_date": "2014-05-13",
    "developer": [
        "Centauri Production"
    ],
    "publisher": [
        "Bohemia Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 15,
    "positive_ratings": 56,
    "negative_ratings": 22,
    "price": 16.99,
    "description": "An award winning adventure crime thriller with a deeply plotted storyline which takes you to atmospheric settings all around the globe, including among other locations, South Africa, Finland and the USA.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/237970/header.jpg?t=1521642021",
    "minimum_requirements": "OS: Microsoft Windows® XP SP2 or newer Processor: Intel Core 2 Duo 2Ghz or dual core AMD XP or better Memory: 1 GB RAM Graphics: 256MB graphics card (Shader Model 2.0 compatible) DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I really liked the second game in the series, probably more than the first. The puzzles are more challanging, it dropped the dumbing-down cursor indicating if two items are compatible (so you have to actually try them), the story has a better pace and the game has a great way of screwing your expectations of what is going on. You can also get the two main different endings by a choice that comes up very late in the game (I could see how some may not consider this as an improvement but I dont think many people replayed the whole MM1 to get another ending, it doesnt have much of a replayability potential). On the other hand, some twists are really obvious and there are many unfortunate problems with dubbing. It seems that they recorded some parts of dialogues separately and it sometimes sounds as if one character was voiced by two different actors (maybe there is just a weird echo that deforms the voices). Also, some lines, especially Keira's, come up in wrong dialogues. It was kinda awkward when she yelled WHAT ARE YOU WAITING FOR, SHOOT in the middle of a normal talk.",
            "review_score": "1"
        },
        {
            "review_text": "I just completed this game and whiel I enjoyed it there were a lot of bugs to deal with. Things such as sound dissapperaring during dialogs and Lara having a different voice every now and again that really distracted you from the plot.  If it wasnt for the interesting story, interesting characters, nice artwork, music and having played the first game I think i would have struggled to complete the game but as it is if you can put those issues aside you will be rewarded with a very nice adventure game about love and death.",
            "review_score": "1"
        },
        {
            "review_text": "Inferior to the first game though still reasonably interesting. But I've never before experienced such bungled up dialogues in a game, so that makes me give thumbs down.",
            "review_score": "-1"
        }
    ]
}