{
    "app_id": 238090,
    "name": "Sniper Elite 3",
    "release_date": "2014-06-27",
    "developer": [
        "Rebellion"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Sniper",
        "Action",
        "Stealth"
    ],
    "achievements": 77,
    "positive_ratings": 12737,
    "negative_ratings": 3297,
    "price": 22.99,
    "description": "Sniper Elite 3 is a tactical third-person shooter that combines stealth, gameplay choice and genre-defining ballistics with huge, open levels and the exotic terrain of World War 2 North Africa.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/238090/header.jpg?t=1553091240",
    "minimum_requirements": "OS: Microsoft® Windows® Vista (Service Pack 2) or Windows® 7 (Service Pack 1) or Windows® 8 or Windows 8.1. Windows® XP is NOT supported. Processor: Dual-core CPU with SSE3 (Intel® Pentium® D 3GHz / AMD Athlon™ 64 X2 4200) or better Memory: 2 GB RAM Graphics: Microsoft® DirectX® 10.0 compatible graphics card with 256 MB of memory (NVIDIA® GeForce® 8800 series / ATI Radeon™ HD 3870) or better DirectX: Version 11 Network: Broadband Internet connection Storage: 18 GB available space Sound Card: Microsoft® DirectX® 10.0 compatible sound card or better Additional Notes: Windows® XP is NOT supported. Ensure graphics and audio drivers are up to date.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Excellent game I played the other 2, the game gets better and better with each new version. V3 being the most fun I had in a game in a long time. Played on realistic mode you have to pay attention to wind and bullet drop. Stealth is a must in certain areas, while accuracy is a must every shot. Taking out tanks by shooting the gas tank is far from realistic. All in all the game is far from realistic, but a very enjoyable play none the less. Multiplayer is very fun especially with a group of guys/gals you know. In multiplayer some maps have a CoD feel while others are strickly for sniping. If I was you I wouldn't pass this one up",
            "review_score": "1"
        },
        {
            "review_text": "I'd recommend this game to anyone who is looking for a fun, short sniper experience.   Pro's",
            "review_score": "1"
        },
        {
            "review_text": "      Overall   */10       AI   6       Atmosphere   8       Gameplay   9       Graphics   8       Characters   7       Optimization   8       Sound   9       Soundtrack   7       Story   7       Storyline   7       Ratings   76/100     ",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game, it will get repetitive so I suggest playing in short bursts and with realistic bullet drop. The xray kills are beautiful, the maps are way more open than in the previous one, the ending is VERY disappointing, but there's a lot of fun to be had",
            "review_score": "1"
        },
        {
            "review_text": "Let's get something straight first: don't buy this game, unless it is cheap, like 80% off. The price is WAY too high for a game that has maybe 12 hours of gameplay.  With 12 hours of gameplay i mean it is intense, fun and you really fit your role as a sniper. Taking down enemy snipers, preparing ambushes, you have dozen ways to get the job done. I played the game with no rush, basically sneaking all the time, making sure i was on a low profile the entire playthrough.  The complete game is made around you: the ways of completing your objective are already planned, that there would be no surprise to you, which means this game is REALLY easy. It can be a bad or a good thing.  I finished the game on the second most hardest difficulty, and i still don't know why it is called 'Sniper Elite'. It's all as easy as the lowest difficulty, if you are playing sneaky.  The stealth system works like a clock; you kill, hide, sneak, kill. And adding the 'melee takedown' to your arsenal of skills, means that you don't have to carry a suppresed sidearm with you, unlikely to Sniper Elite V2. This means you can FINALLY use different pistols.  Buying the Season Pass with this game is highly recomended. Giving you new snipers, and even camouflages, it also adds in new singleplayer maps.  I recommend this game if you want to check out the singleplayer. Play this game thoroughly, there are many places where you might not come if you don't explore.  There is nothing wrong with this game, really a basic fun game where even i was hooked to the stroyline.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun. It does a great job at making you feel both challenged and rewarded.  I enjoyed the campaign quite a bit, and got 16 hours out of it. I really liked how customizable the difficulty was, letting you pick parts of each difficulty setting that you like/dislike.  My one qualm with this game is that the X and Y axis sensitivity are not equal even when set to the same amount. Fortunately, this does not seem to affect sensitivity while scoped.",
            "review_score": "1"
        },
        {
            "review_text": "  I don't get it, why so many negative reviews recently during the FREE WEEKEND playtime. just played 2 hours so far (when I wrote this), I kinda like the game play, the graphic is just good, the best part of the graphic is when you hit the enemy's organs, that slow motion is really such a cool feature. Basically it's a you vs the world kind of game, I mean, you killed them 1 by 1, with your powerful sniper. Going to play as much as I can tomorrow, as the last day, and will update the review.  (UPDATE) After having so much fun of SE3 during the free weekend, then watching some gameplay of SE1 &amp; SE2, I decided to buy the SE Trilogy. Go get em!!!",
            "review_score": "1"
        },
        {
            "review_text": "One review....can change history.  Nah, just kidding. There are of course some pros and cons, and I'll start with the pros: - Real stealth this time. Previous game had ''stealth'' but could never draw away from the enemy attention. - Customization. Can have different loadouts (Alpha - Delta). You can also change your rifle with different scopes, stocks, actions etc. These have different advantages and disadvantages. - Better graphics. Graphics are not really ''next-gen'', but are definitely better than the previous game. - More open maps. More variety in maps so you can choose different approaches. - Improved killcam. More layers when in x-ray killcam such as muscle layers etc.  Cons: - AI. Yes, the Ai has been improved, but are still a bit stupid even when on hardest difficulty. - Variety of weapons. MUCH less weapons than previous game. - Ranking system. I personally think this system is a bit useless in SP, because you get xp for EVERTHING. - Experience gain. I also think this is wrong, because you get more XP for killing with your silenced pistol than for a stealth takedown with your hands.  Despite all these things, I still think is a very good game, even for the not so Sniper Elite Vets. So, I suggest you give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "My stats might say 1hour but I played offline outside Steam and the hours did not add up from my save, so yeah.  I played some decent hours in this game, online and singleplayer so lets start there.  The graphics are a little updated from Sniper Elite V2 and they look a little better, ish and I mean ish not much more. The audio is the same with explosions in the background, talking AI etc The controls are all the same with no real changes apart from a few new keys.  The game has some nice new features, like medikits which is nice and now you can heal yourself instead of auto healing. I am like half way through already and never played anymore of the singleplayer. It is not open world but the maps are big enough for you to enjoy and have a little.. little wonder around with a multiple route towards a mission which is good.  The multiplayer has some really nice parts of the game. If you enjoyed Sniper Elite V2, then you will enjoy this too. The maps are bigger in portion and offer some nice visuals on the side and up close with many many ways around over, through and under something. Really good fun.   Then you notice the game itself is the same as Sniper Elite V2 and becomes very boring. Once you been there and done that you play this and you realise the game is like a big addon. It's like what Call of Duty do with their games, they copy paste everything and just release new campaign for a £39.99 price tag, this is kinda the same but the story is a lot shorter and the graphics are improved.  The new bullet cam is improved, with added detail to when your bullet hits your mark, you get more detail ontop of crushing bone, exploding limbs etc Really good step up but still the same game.  If you enjoy the entire franchise then you will most likely enjoy this game too, really it has some good stuff added to the game but it is more or less the same and for the £39.99 price tag, it kinda steers you away.  Personally the game is worth the time to play and enjoy. Once you done the campaign you might get enjoyment from another repeat but I would not, luckily the game has multiplayer and you will benefit from this sniper each other and setting traps with good unlocks to help play the game.  Wait for the price to drop below £29.99 and maybe £26.99 and the game will be worth the time and money then.   Would I recommend it? Yes because it is a good game but not the price wanted.",
            "review_score": "1"
        },
        {
            "review_text": "Adventurous gameplay but the the story is kinda easy to predict, sometimes it feels like the villain's monologues come from movies like: ' We are the same, you and I. We are both soldiers, workers of war. We love our work. ' But if you don't mind every detail of the game, then I guess you can give it a shot especially if you like killing Nazis and seeing their inner human parts during your sniper shots.",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3 is a big improvment to it's earlier games by offering a wide map layout per mission, weapon loadouts, AI Improvements, and new objectives.  Positives: *Loadouts *AI Upgrades *Custom Difficulty Choice *Rifle is upgradable  Negatives: *Levels may be too complex *Multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "My PC sucks so i had the resolution all the way down but the game is still satisfying! Love This Game!",
            "review_score": "1"
        },
        {
            "review_text": "It's got the same shooting mechanics as Sniper Elite V2, but the level design, health, and stealth mechanics are changed such that instead of being a cover shooter, it's more of a tactical and strategic, somewhat open-ended combat stealth game. Overall, I think I like V2 slightly more because 3 distracts from the excellent shooting with merely good strategic considerations, but this one is still quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and enjoyable game can get a bit repetetive though",
            "review_score": "1"
        },
        {
            "review_text": "Long Distance Nut-Shot Simlulator 2014",
            "review_score": "1"
        },
        {
            "review_text": "Stealth, long range precision distance kills and deadly melee takedowns. A major improvement from the 1st and 2nd iterations of the series. This truly defines what a stealth sniping game is all about.    Graphics: 10/10  Outstanding by any means. The level of detail is something to behold, I have not seen this much level in detail in a game for so long. This one looks absolutely gorgeous even at low-medium settings. There are also a lot of graphics options to choose from to suit your needs and to maximise your experience.   Storyline: 7/10  You have to stop Germany from building a Super Tank that could potentially be used to change the tide of war. Other than that, that is the only ‘story’ you will get from this game as it isn’t really a story heavy game and it wasn’t made to be one. You’re buying this for the sniping experience, not much for the story.    Sound: 9/10  They nailed it. The sound of the rifle, the enemies around you and even your own footsteps can be heard in great detail. Nothing more can be said of how this game sounds. You hear what you’re supposed to hear, nothing else.    Gameplay: 9/10  This goes without saying but, you can snipe your enemies with skill and precision from a distance or get up close and personal and perform melee takedowns. Setting up traps and distractions can also be very fun if carefully planned and laid out. Oh, and I almost forgot...there are “sounds” in the game which can mask rifle shots which makes for quiet long distance shots; pretty impressive if you ask me. The overall game performed nice and smooth with no significant frame drops to report.    Price: 5/10  Priced at £39.99 for the base game, it is a little too much for the amount of gameplay hours you’re probably going to have. So, I suggest waiting until it goes on sale to pick it up.  ",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3 aka ShootNazisintheBalls 3 is actually a pretty good game, it has everything you want from a good sniper-game.   If you want wide open levels,many different types of weaponry and equipment,a good variety in mission goals and a 2 player coop, this is the perfect game for you.  Probably the series most famous feature are the killcams. The killcam in the first part was a cinematic killcam, which showed the point of impact very detailed. The Killcam in the second part took it one step further, now you could watch the bullet ripping it's way through the targets flesh, bones and organs. In the third part they added the muscle tissue,veins and all that stuff.   This make's Sniper Elite 3 one of the most graphic games out there.  Just buy it and see for yourself.  PS:    Hitler only has one ball   ",
            "review_score": "1"
        },
        {
            "review_text": "Recommended for people who like shooting stuff in the face.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "stealth, adding +500 hours to gameplay since 1994",
            "review_score": "1"
        },
        {
            "review_text": "Shot a guy. Hit him in the balls, then the bullet went through someone's head. His ball blood went to that guys head. Great stuff, 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "Review for single player campaign:  I got this game for free when purchasing a new graphics card. I left it a while as I had played the second game a little at a friend's house and wasn't in a rush for it. When the time came to play it I found the start of the game quite exciting and it rapidly gained my interest as I sunk the first few hours into the game.   The story line I found kind of generic but interesting enough. No real relatable characters or depth. This however was not the point of the game at least in my opinion. The kill camera for perfectly aimed shots was fun at first but by the time I had reached the half way point in the game I had turned them off completely. The game play however was enthralling throughout the campaign. I spent hours on a mission taking it as slowly as possible and trying to be 'the perfect sniper', crawling through the grass on my stomach trying to reach the next point of cover to scope out a target area. Making my way around the map working out the best position for attacks and covering my rifle fire with ambient noises. When there were none, sneaking into the area and executing people from behind. I had a lot of fun.   Overall if you are looking for a first/third person shooter with stealth aspects and at least some level of control in choosing how you went about your objectives this could be the game for you. If you are looking for a sandbox environment you will be disappointed, while not having a linear game play progression style most areas only give you a couple of options on where to stage an attack from with only a couple of combat styles for those few choices. 7/10  Review for co-op and multiplayer:  Will be added in the future.  ",
            "review_score": "1"
        },
        {
            "review_text": "Very Nice Game ! So Realistic !",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game, Enjoyed it alot. Play it on the hardest mode for some challanges ",
            "review_score": "1"
        },
        {
            "review_text": "Fun coop modes, you would enjoy unless you're a d.ouchebag named Freeman or Corpsy or Valk.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, until the campaign ends and asks you to buy hundreds of dollars worth of DLC. P:",
            "review_score": "1"
        },
        {
            "review_text": "10/10 very fun game to play",
            "review_score": "1"
        },
        {
            "review_text": "Game is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "If you like stealth and WW2, this is the game for you. It has amazing graphics but only bad thing is that it has a short singleplayer gameplay. It has 8 missions in total which are pritty long which gives you around 10 hours of gameplay, but you can also download DLC missions.",
            "review_score": "1"
        },
        {
            "review_text": "this is a sniper heavy game.... you want to not only headshot or kill 2 or whatever ppl with one stone... be advised you dont wanna alert ppl if ya can help it.... but the murphys law in this game is how long do i wanna stay in one spot before well either you can kill the alert off.... or you will get overrun.... this game cannot be played fast so some of the others that fit the profile of this kinda games, but it works for when you need to get from point a to point b till you are a bit close to the enemy.... and there are no suppressed weapons other then the welrod or .... if you get a dlc/ kill an enemy sniper for the alternate.... noobs might be trying the basic m1.... i would warn of its high recoil and low zoom being for a major disadvantage in any odds... it is best to replace it as soon as possible... however they really out did themselfs with the boltaction rifles.... if you are even curious of the other addons... for you noobs.. my recomendation svt40 camo... for you unhappy gamers that say you souldnt have to pay for this additional stuff i am with you all the way... there are a few maps where you can find some of the secondary weapons the dlc offer.... most of them.. are in coop... this game taught me about the pinacal most games can accomplish in turms of realism... however i would state this game this is barely a minor representaion with comical kinda ai that would be sutable forr a few laughs.... and the ai makes you WANT to kill them.. i have seen alot of guns from wwII fired at renactments.... however i have seen that mosin snipers can shoot thru metal and most the walls i have seen even thin brush board tends to stop bullets that and since bullet drop can be kinda wierd for a game typiclay played at the ranges of 50 to 300 yards... that i know iron sights could get a peron thru plz devs of this game... i am a sniper freak.. impress me",
            "review_score": "1"
        },
        {
            "review_text": "I love this game the A I are smarter and the stealth mechanics are more polished than V2 . This game has a cat and mouse element which doesn't make the game feel stagnant as well as having a non re chargeable health system that every freaking game has these days.",
            "review_score": "1"
        },
        {
            "review_text": "Long gameplay for each missions, cool ballistic cams and you can even play co-op with your friends as a spotter or sniper.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game a lot, like its predecessors Sniper Elite and Sniper Elite V2. The interface makes it a bit more easy - not as hard as previous versions on hardest level. Added a nice knifing stealth kill. What I really miss is the possibility to shoot grenades off the belt of German soldiers -- making them explode. Certainly I did expect more maps included; the extra DLC maps are few and relatively expensive. AND of course, as it is situated in Africa, I would have LOVED if they would have thrown in some lions, snakes, crockodiles and such attacking you unexpectedly as you were sneaking up to your enemies. Or some herds of wildebeasts to startle and stampede over your targets (or at least creating a diversion). I would like a bit better AI: when you find a dead comrade in your camp, you dont just look out for enemies for 30 secs but would comb out the area I'd think. But nice graphics and very playable interface and controls. Overall a very fun game to play if you like sniping, stealth and tactics.",
            "review_score": "1"
        },
        {
            "review_text": "  Havent had enough fun busting German balls before.",
            "review_score": "1"
        },
        {
            "review_text": "Received this game complimentary with my CPU. Although I have only advanced to the second level, I would say it is an enjoyable game. The x-ray sniper sequences really make the game stand out from similar shooters.",
            "review_score": "1"
        },
        {
            "review_text": "Your testicles hunt begin here",
            "review_score": "1"
        },
        {
            "review_text": "good fun but the bullet cams arent as good as V2 in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "With Sniper Elite 3 being quite the succesor to V2, it sadly lacks in a few areas. While playing solo-survival, I've experienced 'muddy' textures, so to speak, where NPC's either turn into a pink and black mess, or simply widen so much, that they fill their entire hitbox. Yet, looking away from this 'Minor(?)' glitch, Sniper Elite 3 is definatly a must-buy for stealth-game fans, the shooting is nice and responsive, cover system's amazing, etc. Enough reading, go get it!  ",
            "review_score": "1"
        },
        {
            "review_text": "Played for a few hours during a free weekend.  The game plays well from a controls point of view. The quick menu is smooth, you have shortcuts for switching weapons, covering and vaulting are responsive. The only part that seems off is sprinting where you can't easily change direction.  There's an element of customization where you can choose your loadout before every mission. Weapons and items unlock as you progress through the campaign, or by gathering collectibles and doing optional quests. You can even upgrade your rifle, though the stock rifle with the stock parts seems the most balanced.  The graphics are good, although I find the sunlight overly white. There's also some weird pixelation when light shines through the leaves of a tree.  Killing any enemy will probably result in a kill cam that traces the path of the bullet all the way to the enemy and through them. They're gory, fun, but repetitive. Fortunately you can skip them. Sometimes they look a bit blurry, especially the bone fragments and the blood.  The game feels very easy. With the enemy difficulty set to the highest level, you can't help but feel overpowered. The AI is simply dumb. You can pick enemies one by one as long as you relocate between shots. They'll instantly forget that you wiped half their base if they can't see you anymore. Even exploding oil barrels next to them won't hold their attention for long. At many times I had enemies look right at me and have them take a good 3-4 seconds before they even start thinking of shooting me. In that time you can easily switch weapons, miss a shot or two and take your time to line up a headshot.  In the end, I recommend the game because it's fun. You can choose to go stealthy and take enemies from behind without getting noticed, or you can shoot everything in sight with little to no consequences due to poor AI. It's a good way to spend a lazy weekend, but it's not a game to commit yourself too. Compared to Ghost Warrior (the first one), this game feels polished.",
            "review_score": "1"
        },
        {
            "review_text": "Very good Sniping game although pretty short campaign. Levels are bigger than V2 with more ways to approach each one.   Loved the more open feel to the levels.  Wouldn't say it's worth full price (£40) but definitely worth checking out when it's on sale like I did (£8)  Highly enjoyable and a worthy sequel to the brilliant Sniper Elite V2. Looking forward to the 4th entry.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! Its first 4 missions are quite bad, but it comes into its own in the last 4 missions! The best part about it for me is the private deathmatches you can have with your friends! 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Harder than its previous version. Graphically beautiful. Lot of fun!.",
            "review_score": "1"
        },
        {
            "review_text": "super good graphics combined with the new steath system make sniper elite 3 a very good purchase. the campaign is long, which is good, the multiplayer i have yet to explore. a wonderful game 5 of 5",
            "review_score": "1"
        },
        {
            "review_text": "Stealth goodness. Not for the impatient, as planning out attacks/positioning is critical to survival. Sweet, yet brutal multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "   My Experience Of Sniper Elite 3 [/b]     Graphics- 9/10     This game has the top Graphics i ever seen in a game, alot to say about the graphics they run Fast and smooth. the shadows follow perfectly how the soldier moves around and shadows is a good way to hide. And the graphic has change alot since Sniper Elite and Sniper Elite V2. I like the graphics and new X-ray cams, they look alot better and the bones breaks alot more realistic than ever.     Gameplay- 10/10     Gameplay what can i tell i got the best experience ever in this game. This game has definitely the best mulitiplayer i ever seen and the story mode uhh ohh. play CO-OP with friends in Mission even Survival that has up to 15 Rounds 5 Waves in each round all from Soldiers to Tanks or even more. And mulitiplayer thats still is one of the best. Even on battlefield i had alot of experience i was fighting along friends and even strangers and i got new friends, this game gets you alot of teammates in the battlefield     Sounds- 6.5/10   The sounds are amazing and the sound of the bullet flying right through the head is overpowered good. The totally make the Sniper Elite V2 sounds look girly and bad, but still not good enough to get ~10/10~.   I can't wait for more Sniper Elite in the future. (   But wait for the price goes a little bit down[/b] )    Comments are allowed on this one. Having a questing that burns inside why don't ya ask me ;D i'll answer as fast i can....    (Review May Change)    ",
            "review_score": "1"
        },
        {
            "review_text": "   My Experience Of Sniper Elite 3 [/b]     Graphics- 9/10     This game has the top Graphics i ever seen in a game, alot to say about the graphics they run Fast and smooth. the shadows follow perfectly how the soldier moves around and shadows is a good way to hide. And the graphic has change alot since Sniper Elite and Sniper Elite V2. I like the graphics and new X-ray cams, they look alot better and the bones breaks alot more realistic than ever.     Gameplay- 10/10     Gameplay what can i tell i got the best experience ever in this game. This game has definitely the best mulitiplayer i ever seen and the story mode uhh ohh. play CO-OP with friends in Mission even Survival that has up to 15 Rounds 5 Waves in each round all from Soldiers to Tanks or even more. And mulitiplayer thats still is one of the best. Even on battlefield i had alot of experience i was fighting along friends and even strangers and i got new friends, this game gets you alot of teammates in the battlefield     Sounds- 6.5/10   The sounds are amazing and the sound of the bullet flying right through the head is overpowered good. The totally make the Sniper Elite V2 sounds look girly and bad, but still not good enough to get ~10/10~.   I can't wait for more Sniper Elite in the future. (   But wait for the price goes a little bit down[/b] )    Comments are allowed on this one. Having a questing that burns inside why don't ya ask me ;D i'll answer as fast i can....    (Review May Change)    ",
            "review_score": "1"
        },
        {
            "review_text": "Is the game worth the price? Only on sales, TBH Are graphics good? Yes, but only with a modern card Is the story any good? No, you just shoot Germans and Italians Is the game fun? Yes  If you like stealth games and sniping games, this game is for you. If you just like third person shooters, you will find yourself having quite some fun in this. My last praise is that they focussed this game on the African campaign, which is generally overlooked by popular culture, as it's almost always the Pacific or the European campaigns in every other WWII game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, obviously since I am always playing a match. :) The maps are challenging especially in the Deathmatch lobbies. The enemies are everywhere and there aren't indicators when they are killed or when they shoot. If you are just starting to play the game find a few friends that have played for a while and do a co-op. When you co-op with an expert you will be able to rank up faster and find all your weapon parts. Until you find them all you are at a disadvantage in the multiplayer matches.",
            "review_score": "1"
        },
        {
            "review_text": "love this game on my 4th time through on hardest level now.",
            "review_score": "1"
        },
        {
            "review_text": "First impressions of Sniper Elite III is really good.  The graphics and sound are good , and the game offers intense excitement . While you plow through the Germans. However I find this not very difficult and it took me about an hour to get through 2½ mission.  The sturgeon residual plus is definitely the new ' bullet - time system ' is really impressive ! And probably the most residual news in the game .  Would not think the game is full price 45.99 worth and have even bought it it - 70 % ie 13.99 where I thought it is incredibly good .  The game , I find a little limited in the courts and would very much like to see a more free world where you greater freedom to decide which way you would take. In this game there is often only one way that you then are forced to follow .  Do you love one person shooter , this is definitely a game for you !  From 1-10 I'll give it 7",
            "review_score": "1"
        },
        {
            "review_text": "Shot a man in the balls and got promoted 10/10 would shoot again",
            "review_score": "1"
        },
        {
            "review_text": "Good sniper game! Pros: -XRay camera -bigger maps -nice MP -good campain  Cons: -too many payed DLCs ",
            "review_score": "1"
        },
        {
            "review_text": "After Playing Wolfenstein , and then playing Sniper Elite 3 with that great grafics and game levels, I cannot find a better game tp Play. And I'm 80 years young",
            "review_score": "1"
        },
        {
            "review_text": "After Playing Wolfenstein , and then playing Sniper Elite 3 with that great grafics and game levels, I cannot find a better game tp Play. And I'm 80 years young",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3 is a much improved version of the previous title. The fact that you can now level up and unlock certain guns makes the game alot more replayable than before. The story is fairly decent though it is short, luckily Co-Op exists and completing the Campaign with friends on higher difficulty is a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo,  So I just beat the campaign to Sniper Elite 3 (played on Sniper Elite difficulty) and it was pretty good! The sniper gameplay is much like Sniper Elite V2 with a fresh coat of paint... and wow is it a lovely coat of paint. The graphics are phenomenal and the game runs so damn good too! They really brought the Afrika Korps to life in this game. You'll see beautifully rendered Panzer III and IV tanks, including the British Matilda... there's also the Tiger I Tank that looks badass.  The sound effects are the next improvement... wow I love the sounds of the guns in this game. The MP 40 especially. The way it sounds when it fires or reloads is fantastic! I also love that creepy sound the game makes when enemy snipers are trying to get a bead on you or when enemies go into combat mode... kinda reminds me of 70's horror movie sound effects when the killer is sneaking up on you... freaks me right out heh.  I guess I can talk about the sniper gunplay next since it's the main part of the game heh... well? It's handled quite nicely and the x-ray mode is improved over the second game in the series... but it's odd, sometimes the bullet cam gets confused and flies at full speed instead of slowing down or fails to recognize a double kill (can happen if enemies are too close together) but the rest of it works great. The controls are just about perfect... I say just about as I wish it had a button to toggle what shoulder you're looking over. it's annoying when trying to come around some corners if you're not hugging said corner to try and force the camera to pan shoulders...  The campaign is actually quite the nice length as it took me 16.2 hours to beat so I feel it's actually a really nice length to it. The environments are varied and they don't feel the same which is nice since of course the gameplay options are a bit limited.. snipe, run away and return and snipe seems to work the best. It does feel like a bit of a gameplay flaw that enemies can't figure out where you are if you quickly run away and return to the same spot while they're in caution mode (yellow compass warning)... because if I ran away and came back in real life? They'd still figure out I'm in the same spot kind-of thing.  Which leads me into AI... they're decent in this game but they give up WAYYY too easily. I mean... I just sniped two of your comrades! They're dead near you!!! What do you mean you're already returning to normal patrol? Aren't you worried that you're probably next? Hahaha.... So sometimes when I feel like a challenge? I'd place anti-personel mines at the bottom of stairs or ladders leading to me and set up... and then they never charge me. Instead they just keep tossing grenades at me... so that sucked. I'd recommend to other players doing the singleplayer to just set up traps in front and below where you want to snipe in positions you figure where the enemies will try and toss grenades from. I've also had AI run off bridges to their deaths and also run into fire from a left over explosion and get themselves killed haha... so yeah, AI isn't the best in this game and if I did a future playthrough I'd definitely do the hardest difficulty.  So? 16.2 hours for the singleplayer campaign and I got it on a weekend sale. I'd definitely recommend it on those sales for the singleplayer. Tbh I don't really see myself doing multiplayer as I'm not the best at sniping haha so I'll keep my multiplayer gameplay to the likes of World of Tanks. So? If you enjoy",
            "review_score": "1"
        },
        {
            "review_text": "More entertaining than Sniper Elite v2 for me because of the african setting which is not really common in games that are set during WW2.",
            "review_score": "1"
        },
        {
            "review_text": "I defeated a tank with an SMG in a stealth game.  Logic.",
            "review_score": "1"
        },
        {
            "review_text": "Shot a guy in the knee and he died....  I guess he won't be an adventurer anymore.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play through, decent graphics, really good multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very nice game. But there is bugs so hope it gets a patch soon",
            "review_score": "1"
        },
        {
            "review_text": "Alot of improvment, ACTUAL stealth, varried means to complete objectives, well designed locations and a brilliant killcam make this a worthy installment in the Sniper Elite series. Best sniper games out there.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, nice multiplayer aswell",
            "review_score": "1"
        },
        {
            "review_text": "An actual stealth game where you actualy sneak your way around plus a realy good sniping game in one package that is set during a rather forgoten theater (N. africa) and the game is nice to look at   7/10",
            "review_score": "1"
        },
        {
            "review_text": "still a good game, have to play it",
            "review_score": "1"
        },
        {
            "review_text": "This game is the mothership of all sniper games. You are sold after the first 10 minutes of the game. I highly recommend!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun. Quite realistic and you can't not laugh after seeing a groin shot",
            "review_score": "1"
        },
        {
            "review_text": "Online mode rather boring as some modes.",
            "review_score": "1"
        },
        {
            "review_text": "Loving it!",
            "review_score": "1"
        },
        {
            "review_text": "thank you for this amazing game !!!",
            "review_score": "1"
        },
        {
            "review_text": "3rd person war shooter. World War II shooter with gory x-ray bullet penetration kill cam, that will get boring after couple hours playing. Game reminds me of good old Call of Duty 1 and 2. There's not much to tell otherwise, you play as US soldier who is sent on missions against Nazi forces and their allies in Africa, to kill, destroy, gather Intel, etc. Game has some variation of WWll weaponry available, many types of explosives. Visually game looks good, yet nothing special. It's fun 10 hour campaign that you can play with your friend in co-op mode.",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3 stays true to what you would expect: find a good spot, wait for perfect timing and shoot. Also remember to muffle your shots, relocate and stay low. The game is packed with lots of action, good cutscenes, bullet time, regular customization and the hardest difficulty it's really a challenge. Although the story may be a bit short, the missions keep you interested on what's going to happen and the maps look good. The game it's totally worth it if you up to play in co-op mode.",
            "review_score": "1"
        },
        {
            "review_text": "Steam community awards :&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Are you intrested in this game? Buy Sniper Elite 2, as it's a far better game. If you really like Sniper elite 2, then get this one.",
            "review_score": "1"
        },
        {
            "review_text": "by far the best game to live up to its name... is u play this game in a way an actual sniper moves around.... it will take around an hr two 2 for each mission.... ofcourse the first mission gives u the zest of the game... but it is the most addicted game i have played in a long time...the third installment of the sniper elite series: SNIPER ELITE SNIPER ELITE V2 SNIPER ELITE 3 AFRIKA the game ends with our sniper saying that there are more targets worthy of a bullet... customization of rifles... funny loading pictures.... engaging graphics... ability to take back unused inventory items... i wonder what will rebellion put in its next installment of the series....",
            "review_score": "1"
        },
        {
            "review_text": "This game has a moderately short story, but still remains as my favorite game of all time. It has this feel to it no other game has ever come close to. Has loads of potential if they choose to not abandon it and continue to add more playable maps.  Don't leave us Rebellion   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is how I train my AWP skillz for CS:GO",
            "review_score": "1"
        },
        {
            "review_text": "This game is just so awesome! 11/10 Stars!  No but seriously, this is a really detailed and awesome sniping game. It has bullet drop, multiplayer so that you can snipe people online! And also a nice but pretty short story in my opinion. If you have bullet drop it can really be difficult but very fun! I love this game! So buy it if you want a realistic sniping game with multiplayer and a short pretty good campaign!",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to Sniper Elite 3, or as it should be called Sniper Elite Early Access 3. This game is a step up from V2 in some ways, while in others it lacks greatly. For instance, this game contains many glitches that were not present in V2. One such glitch launches you across the map upon being revived by your partner. As it stands, the game is fun, but broken. Would I recommend the game? Yes, with caution.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the past sniper elite games, and you like seeing nazi's brains explode in slow motion. This game is for you. Cool physics and realistic sniping makes this game fun. Kill all the nazi's, but only on sale for 75% off.",
            "review_score": "1"
        },
        {
            "review_text": "A very good FPS game big improvement from SE2, lots of entertainment to be had from the singleplayer mode.  The Negatives is that the ever fledgling multiplayer community is stangled by limited naps/modes and over zealous admins on their respective servers.  Why oh why do they insist that profiles should be public? ,what difference does it make????, I am not on SE3 to make freinds i am there to PLAY by all means tackle the cheats but dont punish those who want to keep their profile private.  Players like myself are at the mercy of these power mad 'admins'  Overall I recommend the game for the singleplayer alone   8/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Far better than previous game in the series. Xrays of bullet penetrations are still here and more brutal than ever, the main reason why it is so great is that the levels are really big, creating different paths and approach towards your objectives. You can find your own way of fulfilling them. I didnt just flew through the game, but it was a real challenge, whcih provided 16 solid hours of gameplay through all levels. Using mines, traps and other useful accesories spice up the gameplay real nice too.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and Nice port for the most part  `````````11¶¶¶¶¶¶ ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ``````````````¶¶¶¶¶¶` ````````````1¶¶¶¶¶¶¶ ````````````1¶¶¶¶¶¶¶ ````````````1¶¶¶¶¶¶¶ ````````````1¶¶¶¶¶¶¶ ````````````1¶¶¶¶¶¶¶¶` ````````````1¶¶¶¶¶¶¶¶` ````1¶1¶¶¶```¶¶¶¶¶¶¶¶ ````1¶¶¶¶¶```¶¶¶¶¶¶¶¶ ````1¶¶¶¶¶```¶¶¶¶¶¶¶¶ ````1¶¶¶¶¶```¶¶¶¶¶¶¶¶¶ ````1¶¶¶¶¶```¶¶¶¶¶¶¶¶¶ ````¶¶¶¶¶¶```¶¶¶¶¶¶¶¶¶`````¶¶¶¶ ````¶¶¶¶¶¶11¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ ````¶¶`1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ````¶``1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ ````¶``1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ ``1¶¶1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``1¶¶1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ```¶¶1``¶¶¶¶¶¶¶¶¶¶¶¶¶ ```¶¶1`1¶¶¶1¶¶¶¶¶¶¶¶¶ ````¶¶¶¶`¶¶1¶¶¶¶¶¶¶¶ `````¶¶¶¶`1`¶¶¶¶¶¶¶¶¶¶¶¶¶¶ `````¶¶¶¶````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ `````¶¶¶¶1```¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ `````¶1¶¶¶```¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ ````1¶1¶¶¶```¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ ````¶¶1¶¶¶`````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶ `````111¶¶``````¶¶¶¶¶¶¶``1¶¶¶¶¶¶¶¶1 ````````````````¶¶¶¶¶¶```````¶¶¶¶1 ````````````````¶¶¶¶¶¶````````¶¶¶1 ````````````````1¶¶¶¶¶````````¶¶¶1 `````````````````1¶¶¶¶````````¶¶¶1` ``````````````````¶¶¶¶```````¶¶¶¶1` ``````````````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``````````````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``````````````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``````````````¶¶¶¶¶¶¶¶````1¶¶¶¶¶¶1`` ``````````````¶¶¶¶¶¶¶¶````````¶¶¶1` ``````````````¶¶¶¶¶¶¶¶`````````¶¶1` ``````````````¶¶¶¶¶¶¶¶````````1¶¶1` ``````````````¶¶¶¶¶¶¶¶````````¶¶¶1` ``````````````¶¶¶¶¶¶¶¶````````¶¶¶1` ``````````````¶¶¶¶¶¶¶¶```````¶¶¶¶1` ``````````````¶¶¶¶¶¶¶¶¶¶¶``¶¶¶¶¶¶1` ``````````````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``````````````1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``````````````````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶1 ``````````````````¶¶¶1¶¶¶¶¶¶¶¶¶¶¶1 ``````````````````¶1111¶¶¶¶¶¶¶¶¶¶1 ",
            "review_score": "1"
        },
        {
            "review_text": "I am Garrus Vakarian and this is now my favourite game on the Summer sale.   P.S.: If this ends with the both of us dying in a giant explosion killing a Reaper, just remember. I took the kill shot.",
            "review_score": "1"
        },
        {
            "review_text": "Very beautiful game, also a nice concept.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Actually played like the trailers showed",
            "review_score": "1"
        },
        {
            "review_text": "This Game has beautiful x-ray things",
            "review_score": "1"
        },
        {
            "review_text": "yes get to kill nazis and italiens",
            "review_score": "1"
        },
        {
            "review_text": "I think X-ray view of a perfect kill shot. Stealth system 8/10  Price 7/10 Weapon 7/10 Graphic 8/10 Co-op System 8/10  pretty good",
            "review_score": "1"
        },
        {
            "review_text": "i dislike cause its the same really",
            "review_score": "1"
        },
        {
            "review_text": "A Short History mode, but really cool, and you DO need to think as a sniper if you want to play this game... So much so, that when I play CS GO and I see a camper, I tell him to come play this game. xD",
            "review_score": "1"
        },
        {
            "review_text": "I've just finished playing through the single player campaign on marksman difficulty, and I really enjoyed the game. A nice balance of interesting maps, and different scenarios to consider. It's a huge improvement over V2 which was more linear and involved far more close quarter encounters.  I've started again on authentic difficulty and I'm enjoying the struggle. The enemy AI is really good I think, although it would be nice to be able to fine tune the assistance. For example: I'd like to be able to range find with the binoculars, but not tag enemies. I'd like to see my health bar, but not the tactical map. I'd like to have free reign with the loadout and swap all my health kits for trip mines if I so desired.  Also, the people complaining about not having a zillion different guns to choose from, I think are missing the point. I played through the game with the same rifle, pistol combination and didn't feel like anything was missing.  It's a great game. And while the x-ray kill cam is awesome initially, it does get tiresome quickly, and I ended up turning it off near the end. You can also press space during kill cam and it'll skip, which is a very nice feature.  I'm looking forward to the multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed V2 you'll still enjoy this. Single Player is pretty easy though even on the hardest difficulty. Also the AI can be pretty questionable when they're surrounded by dead bodies but still in a passive state.",
            "review_score": "1"
        },
        {
            "review_text": "this's really a best game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, third person with gory sniping (you get a MRI scan for everyone you snipe showing exploing skulls and spleens). Basically it's a sneak around game, be patient, be silent. The game gives the idea of Far Cry freedom, but is pretty much on rails to be honest. Flaky in 3D, although ok to play with. Have completed the first mission in three sittings (I don't play much these days), and persuaded me to drop 25 quid on the season pass, for all the DLC - Hitler / Churchill missions and some guns to improve your loadout. LIttle clumsy in play style, Lara Croft did it better, but nice little shooter that's isn't in your face, and rewards if not demands... patience and a little planning. Next sale, get it, it's good!",
            "review_score": "1"
        },
        {
            "review_text": "A great addition to the sniper elite series, I thought. The extra strategy needed is great. The bullet drop on some rifles is a bit off, but adds more of a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "After I played this for a full 3 days on weekend nonstop, lets just say. ITS SUPER DAMN FUN! How could anyone not enoy the kill cam after watching several of your nazi oppenets and well the skirmish is incredible I'm glad to see that their coming out with more games every day! And i'm looking forward to blowing the ♥♥♥♥ out zombies too this will be epic!",
            "review_score": "1"
        },
        {
            "review_text": "Played the game on the hardest difficulty with no ranks/levels and it was still pretty easy. Only a few moments that were a real challenge.  Disappointed that co-op multiplayer had fully disabled xray kill shots and only had quick kill cams.   Overall though still a fun game and one of the few games that are worth playing co-op!  Recommend for this reason alone.",
            "review_score": "1"
        },
        {
            "review_text": "I have been a gamer for over 30 years and rarely can I say that I have thoroughly enjoyed every game entry into the franchise. The Sniper Elite series fits the bill for sure!  Sniper Elite III is a great experience from start to finish with well thought out maps and challenges. The graphics, sounds, and storyline are all great. The maps are pretty big and non-linear based, which is great for a third person expirence.  The weapon upgrades are ok, without getting too tedious. The challenges are fun, especially in coop mode. The coop mode is an excellent idea for games like this.  Some downsides are: shooting over walls can be bit buggy, the AI are way too perceptive to your location after making any noise (It's still a major improvement over SE2, however.) Also, players are too rewarded for close range combat.  Multiplayer is fun and challenging. It's a bit slower paced and methodical than most shooters, but that's the way it should be.  This game is all around one of the best I've played in the genre. Rarely do try to gather as many achievements as possible in a game, but this I just couldn't put down.   Im looking forward to next installment.",
            "review_score": "1"
        },
        {
            "review_text": "Slow motion testicle busting at ~600 meters",
            "review_score": "1"
        },
        {
            "review_text": "Good game for people who like to snipe.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun X Ray simulator. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "this is just an awesome game which is super fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "great fun, just sneak around and shoot bad guys LOL",
            "review_score": "1"
        },
        {
            "review_text": "great game, personally i love it :)",
            "review_score": "1"
        },
        {
            "review_text": "Want to be a sniper?A fan of WWII history?Buy it. P.S. IGN:8.2",
            "review_score": "1"
        },
        {
            "review_text": "Mortal Kombat FPS with infinite X-ray gauge.  ",
            "review_score": "1"
        },
        {
            "review_text": "  It okay better than sniper elite 2 for story but co-op mode sniper elite is better.",
            "review_score": "1"
        },
        {
            "review_text": "The multiplayer is like if every one had awps in cs go but on a battle field map.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, even at full price! GOod community no, quickscopers.",
            "review_score": "1"
        },
        {
            "review_text": "Dead Germans float on water. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It has gotten to the point where I know headshots are more lethal, but it is so fun watching a 50 cal. bullet demolish a mans testicles",
            "review_score": "1"
        },
        {
            "review_text": "This game smokes Sniper Elite 2. I don't understand why so many people are complaining. I couldn't stop playing. The game play, graphics and sound blow away Sniper Elite 2",
            "review_score": "1"
        },
        {
            "review_text": "Worth the money. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I like this game a lot it looks good and is really fun",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3 is very different if you compare it to other shooting games that were realeased in the past few years. I can only say that a select few enjoy the game due to its gameplay which by some can be considered monotonous since after each shot that is notsomehow silenced you will have to relocate by walking away 50 meters and the guards will have forgotten that you even exist. The setting is very unique since this time you are not storming the beaches of Normandy but are instead crossing through African terrain and one of the most underrated military theatres in history. there is also a unique feature where whenever you fire a shot your bullet will go into slow motion as it penetrates your target permitting you to see the carnage first-hand. If you don´t understand what I mean by this think of it as the special X-ray special moves from the new Mortal Kombat games but with bullets.  Pros:  Unique setting Advanced bullet physics Slow-motion kills Vast array of weapons to choose from Kill Hitler DLC Can see your bullet destroy a man´s balls via the slow-motion kill feature  Cons: May be considered monotonous and boring by some people Only one silenced weapon in the game, making it hard to be stealthy.  Conclusion: I would only recommend it if you know what you are getting into and if you are positive that you will enjoy it. Otherwise you may have wasted your money.",
            "review_score": "1"
        },
        {
            "review_text": "kind a good game, worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game after seeing my brother play it. It's great if you love long range sniper battles. Also has short range combat if you play anything other than no cross. I can play it for hours on end. Worth $50.",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game after seeing my brother play it. It's great if you love long range sniper battles. Also has short range combat if you play anything other than no cross. I can play it for hours on end. Worth $50.",
            "review_score": "1"
        },
        {
            "review_text": "didnt bore me enough to drop it, for $10 it wasnt too bad its too easy though and the wind is out of control",
            "review_score": "1"
        },
        {
            "review_text": "Stealth yes Afrika yes Sniper set yes MLG Quickscoper yes WW2 yes   15/10 QUICKSCOPER GAME!!",
            "review_score": "1"
        },
        {
            "review_text": "Astonishing, awesome, beautiful, fun.... List is endless :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game for advanced stealth game players but for people new to stealth games, I wouldn't recommend it",
            "review_score": "1"
        },
        {
            "review_text": "shot leafys deformed chin so thats a winner in my book",
            "review_score": "1"
        },
        {
            "review_text": "The video below features 'first hand' gameplay experience of the game only:         YouTube™ Video:  ➜ A Quick Look @ Sniper Elite 3 | GeForce GTX 950 | 60 FPS | 1080p&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Bunch of Nazi dumbasses were climbing up a ladder to kill Captain, Captain stood next to the ladder and Jackie Chan all of them 1 by 1, no bullet wasted. Didn't even have to snipe any1 in a sniping game. 5/7 gr8 game, buy it m8",
            "review_score": "1"
        },
        {
            "review_text": "Bought this, shot the balls of a dude, closed it down, and got a refund. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Goodgame, srsly it's a good game that's all i can say",
            "review_score": "1"
        },
        {
            "review_text": "Intense, realistic Nazi killing.  Awesome Co-op",
            "review_score": "1"
        },
        {
            "review_text": "Came for the testicle shots.     Im pleased.",
            "review_score": "1"
        },
        {
            "review_text": "Ok first of all I have to mention that I spent nearly 30 hours in previous titles 10 hours in first sniper elite a very good, now quite an archaic game in terms of graphics, but still playable and 20 or more hours in sniper elite v2 and I can honestly tell you that sniper elite 3 isn't as good as the previous games, I will try to tell you why in these few senteces. Sniper Elite 3 has little to no innovations, sure there are stealth kills from behind and you can customize your loadout before the mission and the missions are wide open and they can be completed different ways but thats about it. Those are the only new things sniper elite 3 developers brought us. The game suffers from a lot of bugs like pin point accurate enemies with machine guns and extremely accurate enemy snipers, the annoyingly quick tanks and armour and lots of weird bugs in terms of enemy detection and so on. The graphics seem a bit better compared to previous sniper elite v2, but not by much. it all feels like it was done way too quick for my taste, campaign isn't as lenghty as in sniper elite v2, you only have 8 campaign missions and thats it, some of them are extremely linear, like the last two missions, which are quite difficult too and overall the game just feels rushed, the hunt for the grey wolf mission dlc isn't as good as I expected to be, but at least the three lovely maps about protecting churchill were worth it. Overall I would give this game a fair 7/10 and I would reccomend this game to fans of the genre",
            "review_score": "1"
        },
        {
            "review_text": "I can shoot testis in this game XD 'Testis Shot'",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game a better price would be 30$ but if it goes on sale buy it!",
            "review_score": "1"
        },
        {
            "review_text": "The game is good. If you like realism.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Germans have never been so much FUN!Slow-mo is awesome, seeing a German get his testicles blown of is, fun to watch?Destroying tanks from the inside-out.Online gets your heart pumping.   Great job Rebellion you did good.",
            "review_score": "1"
        },
        {
            "review_text": "I decided to play Sniper Elite 3 for the first time on Authentic.  Turns out that thanks to aimbot my aim sucks.  10/10 would run out of ammo on Siege of Tobruk again.",
            "review_score": "1"
        },
        {
            "review_text": "help i'm trapped in this cage and only have the steam app on my tablet",
            "review_score": "1"
        },
        {
            "review_text": "  I recommend this game but I will never play it again even though I did get the free weekend version. it is good if you like really hard stealth games. I couldn't even get past the second level. I probably just suck.",
            "review_score": "1"
        },
        {
            "review_text": "Roses Are Red Violets Are blue EA Just shut down the battlefield 1 beta servers I guess this will do",
            "review_score": "1"
        },
        {
            "review_text": "So far, this is a pretty good game. I can see why a lot of people are complaining about only having 9 misions, however there is a lot of gameplay time, I've only done the fist 2 or so misions and the maps and aproaches to each level are preety big, and there is a lot to do. I play this on siper elite and i can realy feel the challenge however for sniper game vets i don't think it be as hard for them but still a challenge. Rebellion have learned from the issues of V2 and I am glad that the studio is visably getting better and I would like to congradulate them on that, it takes some balls to take advise and use it.",
            "review_score": "1"
        },
        {
            "review_text": "They have come a long way to make the graphics so crisp while making the playing field more open. Yes you still have select objectives listed in order after you complete one do the next. But, you are able to chose the path you take to get the job done. It shows a combination of Sniper Elite and Sniper Elite 2. Great job to the developers. Keep up the good work. I can not wait till we see the additional missions for this version.",
            "review_score": "1"
        },
        {
            "review_text": "I am starting to hate this game can anyone tell me why it keeps closing and I have to start over",
            "review_score": "1"
        },
        {
            "review_text": "Good game, love the x-ray veiw",
            "review_score": "1"
        },
        {
            "review_text": "What! there is more to life then gaming? nonsense!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "great fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Completed single player campeign--very fun gameplay and reasonably believable realism. Turned off the x-ray bullet cam after about 10 minutes because it detracted so much from any sense of reality--fortunate the game designers provided this option. Can definately say it's among the best sniper games out there.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very fun to play. It is one of my favourit games so far. But it is one thing that annoys me, the thing is you can not jump. I hope the developer will fix that in the future. The game is otherwise great! Love it!   And one more thing, I hope it will come out more DLC-levels.   9,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Shooting testicles got even more graphic in this game....sweet!",
            "review_score": "1"
        },
        {
            "review_text": "iz gud gam if u lik killin people wif da hed exploding",
            "review_score": "1"
        },
        {
            "review_text": "So far this game has been visceraly satisfying to a disturbing degree!",
            "review_score": "1"
        },
        {
            "review_text": "After throughly enjoying the first two games, so far the third in the series is carrying the torch high and proud. The new setting is nice so far and the X-ray vision when bullets hit...Wow. Looking forward to playing more and hopefully getting some co-op going.",
            "review_score": "1"
        },
        {
            "review_text": "It's essentially the same game mechanics, but with a much more colorful setting and greatly improved level design, shooting and stealth mechanics. plus, more than 1 rifle! (even though they are all essentially the same) wait for the game to go on sale, then get it. P.S. this game lets you shoot nazis in the buols.",
            "review_score": "1"
        },
        {
            "review_text": "A great improvement in an already great series. Open world non-linear missions allow you to takle objectives as you see fit. The new 'relocate' mechanic is outstanding. How it had not been implemented in a sniper game prior is a mystery. Find a sniper nest, plan out your attack, and lay traps. Mask your shots with ambient noise or risk alerting enemies to your position. Graphics are outstanding with few glitches. Minor, but fixable, bugs exist however. Like when aiming downsight, sometimes shots mysteriously miss, or hit an invisible wall. Some stats dont count towards your totals and my end screen somtimes didnt match what had happened in the game. Only something I noticed in the solo survival mode. Multiple game modes, both solo and multiplayer exist. The 'no cross' multiplayer maps force a snipe and relocate esque game type. Solo maps, although very few, are lengthy. The campagin stretches across eight missions, each mission will take approximately 1-2 hrs. depending on your play style.",
            "review_score": "1"
        },
        {
            "review_text": "Yup, Its the fuhrer alright. Just removed his one remaining nut with a sloppy shot to the pelvis. Endorsed!",
            "review_score": "1"
        },
        {
            "review_text": "I have shot a guys testicles off then with the same bullet that hit that soldies testicles off, it destroyed his comrads lungs... This game is ♥♥♥♥ing amazing...",
            "review_score": "1"
        },
        {
            "review_text": "Great game! If you have played Sniper Elite V2 and you liked or even loved it, then you really should buy this game. You can really see improvements in the gameplay and graphics. Multiplayer is also really improved. In V2 i had lags and bugs in MP. In this one i don't have any! Game runs smooth and nice. No PC overheating even i though i have 27 Celsium degrees in my room. If you can, buy this game! You won't be dissapointed. But though there are ONLY 4 Sniper rifles, secondary weapons and pistols. You want more? Buy DLC. This is only dissapointment for me. You have to buy more content. But even with all this the game is great! I am using one sniper rifle and pistol through whole game. I didn't needed any more rifles because they can by modified with improved barrel or scope. Scope sights can be modified aswell. You can find modifications for your rifle by looting dead soldiers. Even your binoculars are upgradet with parts collected from dead soldiers. I am not saying you should definitely buy it even if you dont want to. If you like it, then buy it. If you don't like it, then don't buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I'd rate it an 8/10.   Its graphics are great, and you could play ultra on a relatively cheap gaming PC.   The xray animation is amazing, sometimes hilarious even. I love seeing an enemy's eyes bulge open when they get shot. But sometimes the xray happens too often, and may seem annoying to some people.  This game is also pretty noob friendly, having your sniper randomly say things, like, 'I should probably crouch so they don't hear me'.   The fact that this game allows you to choose between a stealthy approach and a 'go in guns blazing' approach makes it very fun, as well.  One problem I have is that the AI isn't too great. I missed an AI by an inch or two and they didn't flinch at all.",
            "review_score": "1"
        },
        {
            "review_text": "10 minutes in and I shot a Nazi in the balls... ♥♥♥♥ my pants, 10/10 would def recommend",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "many headshots",
            "review_score": "1"
        },
        {
            "review_text": "Well.. The game is great. Just dont bother with any of the DLCs. 70€ DLCs for a 45€ game..",
            "review_score": "1"
        },
        {
            "review_text": "This game had my mind blown!  I had just got a new pc and wanted to test some benchmarks and stuff like that, luckaly AMD gave me a change to pickup a free game so i chose this one, I loaded up set everything to max and hot damn it looked good.  The gameplay of this game is amazing, i would not recconment this to players who like to move at fast paces and rush through things. This game takes time and stealth.  The best part of this game has to be the kill cams, it is so satisfying when you see your bullet rupture an emimes skull.  This game is awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!!!!!!!!!!!!!! showing the internal parts as they hemmorage (sp) is truely great not recommended for kids though.",
            "review_score": "1"
        },
        {
            "review_text": "omg so much better than the previous, the testical shots are soooo funny, love this game 11/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Hello dear upcoming Sniper Elite III player,  I've played all of the Rebellion Sniper Elite games and I 'm very happy about the third part of this great game. I've made up a small list of pro's and contra of this game:  + The ambient and the country are very well created and detailed. + Lots of new things to find and to discover. + Detailed weapons and NEW extra parts for customisation + The well known bullet effect cam and the fantastic balistics + lots of different ways to finish a mission  - the pathing through valleys and the straight line story - lvl based unlock system (weapons, additional parts, aso.) - a lil translation problems in the settings (wtf does mouse delay reducing mean) - point gathering for every replayed mission (no matter how often u do a single mission) - problems in coop modus and delayed actions together ( not major probs but u recognise it)  Review after the first 3 mission  GREAT GAME ---&gt; BUY IT ---&gt;TELL A FRIEND ---&gt;PLAY COOP ---&gt;HAVE FUN  BTW The addon TARGET HITLER is nearly a must have for fans of the series",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3 improves most aspects of V2. Although it implements some arcade features that weren't present in previous versions, the game has gained in playability. Killcams, the special feature of the saga, is now better than ever and offers a level of detail never seen before.  The cons of this game are DLC. After 2 months of being released, there are $64 of DLC. In my opinion, the guys of Rebellion got greedy and just split up the game to make more benefit at the expense of us. Sadly, a common practice these days.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it with steam sale. Great game, but wouldn't pay full price for it.",
            "review_score": "1"
        },
        {
            "review_text": "Sniper elite 3 is what you get if you take all of the mechanics from the first two games, add in a few new ones, have more open ended levels, and set it in northern Africa.",
            "review_score": "1"
        },
        {
            "review_text": "same old same old. Ok but a little boring after a while.",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite3: Good game about snipers. I can even tell that is one of the bests. But it haves little problems with the selection of weapons and graphics. But without the problems the game is awesome Highly recommend ! 9\\10",
            "review_score": "1"
        },
        {
            "review_text": "REALNICE! If you like FALLOUT, sniper v2 then you gonna fall in luv wit this :) Realism can be put so high : no dmg ind, nothing indicated so need to listen and look all the time.. not walkin on BRANCH! it might SNAP!!! und 'ACHTzung lieben!' 'das was nichtzicht xD'",
            "review_score": "1"
        },
        {
            "review_text": "good,realistic game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good overall, but there are only so many times you want to see an slow-♥♥♥ x-ray replay of shooting someone in the balls. Yeah, I know you can shoot them elsewhere, but why would you? 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "this game has robably the coolest snipers known to man and has a real ww2 feel to it.",
            "review_score": "1"
        },
        {
            "review_text": "This game rules, awsome graphics and bullet cam is great, well worth the wait and exciting to play.",
            "review_score": "1"
        },
        {
            "review_text": "A nice looking underrated game. Deserves more praise than it got. Biggest flaw is that all the maps were the same",
            "review_score": "1"
        },
        {
            "review_text": "Played SE2 before this and had high hopes for this game! And it lived up to some of them. I don't know if I like or hate the medicpacks you need to get more health, it makes the game a lot harder (only tried the game on the hardest setting) and will probably get you stuck at levels for a time but if you have the patient to find a new way around your problem you'll realize you kind of like it.  If it wasn't for all DLC you'll have to buy I'ld give it 5/5 BUT they are expensive and you shouldn't need to pay more money for an already expensive game!  Wait for it to get on sale and it's totally worth it!",
            "review_score": "1"
        },
        {
            "review_text": "After playing SE2, this is a great update to it. I never get bored with SE3, good all around Single Player action, with plenty to do. If you looking for a great sniper game, with different levels of good AI difficulty, this is it. If you have never watched your back before, this game will teach you.",
            "review_score": "1"
        },
        {
            "review_text": "For those who prefer WW2 action,this game is a keeper.I own various games by various makers and from the time I purchased ES3,I've played ES3 the most.",
            "review_score": "1"
        },
        {
            "review_text": "great game but its vary hard",
            "review_score": "1"
        },
        {
            "review_text": "Great Graphics and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game! highly recomended",
            "review_score": "1"
        },
        {
            "review_text": "I've been really excited about this game, but as turns out, I liked the second part way better. It's not bad, just different. Though the silent takedowns and alternative weapon parts are a good addition. I'd say it's a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty graphic, and this is the Best Sniper game.",
            "review_score": "1"
        },
        {
            "review_text": "Just played the first two levels... Very Satisfying, especially staying Stealth and getting those Long Distance Sniper Shots",
            "review_score": "1"
        },
        {
            "review_text": "Great game....",
            "review_score": "1"
        },
        {
            "review_text": "Best game yet",
            "review_score": "1"
        },
        {
            "review_text": "This is a great sniper game if you like sniping i got this game like 2 days ago and played 14 hours already its really good it really tests your skills at sneaking around and killing silently i would recommend this game to anyone im going to buy number 2 after ive finished 3",
            "review_score": "1"
        },
        {
            "review_text": "X-Ray nut shot... 10/10 would shoot again  in all seriousness though this game is really fun and enjoyable ive only played 2 hours so far and havent even touched multiplayer, but am so far loving the campaign so i would rate this game a 8/10.  Quick Joke: Why did the console peasant cross the road?  A: to load the textures on the other side.",
            "review_score": "1"
        },
        {
            "review_text": "I got this for 10€ and it's well worth its price. It's a good stealth game with pretty and well optimized visuals.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on sale + season pass for 18 dollars and i dont regret anything but that my pc runs it at 15 FPS. it gud.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game sneaking around blasting nazi soldiers. Sniper Elite 3 is a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3, along with the past franchise is a unique style of game virtually uncomparable to any other FPS on the market. Within the games amazing visual enviroment, super realistic ballistic control and it's jaw dropping tactical gameplay, SE3 is by far one of the most Fantastic shooters i have ever played... EVER.  ENVIROMENT  Sure it's one thing for a game to have 'pretty trees' or 'moving clouds', but all of those bells and whisles are a fraction of what the game in it self has to offer the player. Not only do you get to see the ever changing weather in the enviroment, but it will also effect you down to the tiny aspect during the gameplay. SE3 was evolved how weather can effect how the player can react in its gameplay and its vast ideas of survivability.  THE BALLISTIC BLUES.  Alright, i'll be honest here... I was ♥♥♥♥ING FLOORED how much comes into play when shooting a rifle. Sure Sure, other games have simulated similar things such as Wind, Blood Pressure and breathing patterns, this is not what i am boasting on SE3 being the 'first'. In person, i have never shot a gun before as country laws prohibit them for personal use, although i know in most countries ownership of them is normal so bare with me on this part :P. Before i just thought, you point, squeeze the trigger, all said and done. Yet SE3 has taught me more than just being 'trigger happy' and to consider much more than just WHO i'm going to shoot. I was playing on the difficulty Sniper Elite so almost everything effected the Velocity of the traveling bullet, which was a huge eye opener seeing as how i could barely hit the 100 yard target. God forbid if people think this game is comparable to Counter Strike or any generic shooter such as that i strongly advice you to NOT try and Flick scope with an AWP :P. The gameplay is relentless and will make you think twice about launching bullets wildly toward your enemies.   BOOM, HEADSHOT.  Speaking of lobbing bullets towards your enemies, If there is one thing this game and other games like SOCOM have taught me, is that sometimes taking the shot is not in your best interest. YOU DO NOT POSSESS INHUMAN STRENGTHS AND ABILITIES. You can't just run into a gun toating armies with your eyes closed and hope to rid the world of evil, its just not how it works, PERIOD. BULLETS INDEED OUCH, so to speak. Now think about this, you have one Target you need to kill and search at the back of a camp filled with dilapidated buildings which is filled with 5 to 8 others, ( that you can see). Would getting into a heated gun fight with limited ammo seem like a decent idea? Probably not. Tactics come in, watching where they patrol, following them, stealth killing them; its not just about having a large rifle. Although i will admit that when you watch the bullet cam and you see a Rifling round whizzing through the air in slow motion as it shatters the skull and exits out the back of the head in a gruesome execution, is pretty ♥♥♥♥in' sweet. Doesn't justify the intensity of careful gameplay you need to make just to not get filled with hot searing led.  TWO IS A TEAM  the CO-OP play.. my god. I thought it was going to be horrible, buggy and down right stupid. But i will admit it was probably one of the most hardest/fun CO-OP experiences i've had in the longest time. You really need to connect on way more than a gaming level. Not a 'oh i'll go that way you go this way' kind of deal, you literally need to work as a team to help each other observe, seek out and eliminate if you want this to work out for the both of you. Also when one player goes down you have the chance to Revive them, they kinda get a 'last stand' sort of thing, alot like Borderlands or Call of Duty, except you don't stand back up if you kill someone in it. So your CO-OP player really shouldn't wander too far away from you. When it comes to CO-OP play i STRONGLY RECOMMEND its done over a Voice program, I.E -- Skype, Ventrilo, Teamspeak etc. Or to just play together locally, because the more communication you two have will make it worth your while in the long run.  CASTING THE FIRST STONE  Okay you caught me, i haven't played the game for too long i get it. But i am just shocked and impressed with the quality and depth to the game. It is definetly a game in which i could see myself trying to get all the acheivements too or beating it on all difficulties. Yet who knows, i'm just a girl from the 'Gun free' country of Ireland, but i love what i have seen so far :). And others who play or would like to play, just add me! Would always love a second gun in the mix! :)  ENVIROMENT 8/10 GAMEPLAY 9/10 Kaylas Metascore 87/100",
            "review_score": "1"
        },
        {
            "review_text": "I would rather it be called Stealth Elite 3, although i must say the sniping moments are very entertaining and i dont mine using the welrod for 60% of the game and then sniping the rest of the time. So overall good game and can't wait for Stealth Elite 4...",
            "review_score": "1"
        },
        {
            "review_text": "Hello! i have got a problem with this game: i can play multiplayer just for like 10 min and then game crashes...but coop works just fine...any suggstions what could fix this problem???",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game!Amazing actions,moves and that thing,when you shot someone and the bullet in animated. :)",
            "review_score": "1"
        },
        {
            "review_text": "Shot a tank in the back with a panzerschreck, only ♥♥♥♥♥♥ it off.  Tosses a grenade at it out of random curiosity, blows the thing sky-high.  10/10 Would explode tanks with grenades instead of rockets again.  In all seriousness, I like this game a lot. It isn't a whole lot significantly different than Sniper Elite: V2, but it still has its own unique awesomeness to it that makes it fun to play if you're a fan of the franchise, or just a sniping fan in general. That bullet cam gets old in general, but when you pull off that perfect shot; that one where you sit and stare in awe as the bullet flies through multiple skulls, and you yell 'Xbox, record that!' but you realize you're playing on PC. Worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but not too realistic.",
            "review_score": "1"
        },
        {
            "review_text": "Is nice.",
            "review_score": "1"
        },
        {
            "review_text": "we can shoot balls 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has come on a lot since V2 in terms of the varied gameplay. Definitely a game worth getting if you like stealth games but you have to be very patient with the game.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game u will be hooked to where u get no sleep... ",
            "review_score": "1"
        },
        {
            "review_text": "Another good entry, story ironically should be longer, level design is a bit ♥♥♥♥ey. Story isn't as good as the last one either. 11/10 would kill harmless soldiers eating lunch again",
            "review_score": "1"
        },
        {
            "review_text": "Those who enjoy some action and strategy mixed in the same game will probably love it. I spent many hours doing and redoing missions while trying to achieve the perfect run without being spotted.  Sniper Elite could follow Pay Day 2 steps and release more significant missions and DLCs. I mean, there are some DLCs and weapon packs but they do not worth the money you spend on.",
            "review_score": "1"
        },
        {
            "review_text": "There are those of us that enjoy slowly creeping through the brush, shooting hapless guards in their vital organs from great distances, sometimes with the critical damage being shown in glorious, ensanguined slow-motion. If you are one of us, by all means play this game. If you bunny-hop across a level out of sheer habit, ingrained since the days you could only play as Phoenix Connection on the T side, then you should give this game a pass.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game , must try it .",
            "review_score": "1"
        },
        {
            "review_text": "that was a cool story can you tell it again sure",
            "review_score": "1"
        },
        {
            "review_text": "HEALTH THAT DOESN'T REGENERATE! :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game with Sneaking action 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Headshot heaven for FPS addicts...:D, just love the game!!",
            "review_score": "1"
        },
        {
            "review_text": "It great sniping mode make me curious if my shots hit my target in Custome Mode when u disable the help when emptying lung or focus.  9.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. I really like the ability to customize specific parts about the difficulty, like sniping physics and AI difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "Snipe, kill, move...repeat. Awesome headshots and the difficult Nut-crunch. Extremely fun gaming.",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3 is a successfull successor to 2. if you like playing a sniper, you will love this game...the 4 levels of difficulty is good to have..makes the game tougher as you learn the ins and outs...great graphics..very good single player. highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Though I only have played just a little bit so far, this game is TRULY next-gen. In fact, this game will run on some of the cheapest budget graphics cards on medium settings and STILL run better than a ps4 or XBone. The gameplay is butter smooth and the graphics are just overwhelmingly beautiful. If you have the money to get this game, do it and do it now.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game, great Graphes and fun online.",
            "review_score": "1"
        },
        {
            "review_text": "every 10 minutes or so my game keeps on crashing",
            "review_score": "1"
        },
        {
            "review_text": "  wery nice game but one - why arent bodies sinking in water?",
            "review_score": "1"
        },
        {
            "review_text": "Testicle shots are now a thing. And you get more exp for doing them as opposed to just shooting someone through the heart.    10/10 best game.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful refurbishment of Sniper Elite V2 - if you liked V2m get this one. I own V2, theZombie Army Parts 1and 2 and i love to play all f them. Recommendd by MEERKAT!",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: I have not played the multiplayer and nor do I plan on it. I am yet to play co-op with a friend, since nobody I know owns this.  I finished the campaign and i'm ready to write my thoughts down!  I think Sniper Elite 3 is a general improvement over Sniper Elite V2. The overall mechanics have been amped up (minus the cover system personally), the graphical fidelity is very nice, especially among the enviorment itself, and does show an accurate interpetation of the North African conflict during WWII.   Weapon and load-out customization adds a bit of player dependent thinking to the mix, having the player choose which weapons to take, what upgrades to implement into their load-out, or even which load-out to choose! I do appreciate the latter considering that there is a decent range of options to choose from, you really would like to have some pre-sets available depending on what the mission will be like, which is a nice touch.   I can't say too much about the campaign. It's above average I would say, but the levels do make you think about your move. Though I can't exactly call the game a sandbox, it does have an open-world feel to it, since you can retrace your steps and come back if you did manage to miss something before. The enviorment does play a large role in making the best move in each mission, with levels containing sound-generating objects, explosives, sniper dens, weapons, ammo caches, and optional objectives that sometimes prove useful later in the mission, though not always. The enviorment can always minipulate your playstyle.  The story is Sniper Elite kind of cheesy. Ending isn't particularly spectacular, though I would say that the collectable Diary entries definitley focus on the more personal level amongst the soldiers participating in WWII, as well as adding some general information about survival in war-time North Africa. However, the game-play is definitley where it's at.  X-ray kill-cam is good as it always is, focusing on every shattered bone, every ripped organ that your bullet tears apart. The varying speeds from the kill-cam always shows a more gruesome image as your bullet speeds through and thrashes your enemy's flesh.  Challenge modes are also available after the campaign. It's a good way to pass the time, but it's nothing to write home about.  However, the game has it's short comings.  -Campaign is around 6-7 hours average. -Cover system is awkward to use; somewhat bare-bones. -Kill-cam glitches that occasionally happen from time to time, probably will get fixed over time. -Third-person camera is a bit impeding, with your character sometimes taking up a 1/3 of the screen in some situations. -Ranking system doesn't have much use after level 11 with unlocks stopping around there. Only real purpose is for multiplayer. -The shaking kill-cam can become nasueating after a while.  -A generally easy game, unfortunatley. Shooting Jerries in the head with your Welrod will usually take care of stealth, and ammo is generally plentiful unless you go loud for an extended period of time.  Despite that, it's still worth it if you're a fan of the Sniper Elite series or if you're looking for 'bloody' good time.  *Budum-tish*",
            "review_score": "1"
        },
        {
            "review_text": "I really, really enjoyed this game. I like that you can employ stealth tactics or take the enemy head on..and then employ the stealth tactics that you thought you wouldnt need. Its not hyper realistic, but the graphics are very good, and smooth at high resolutuion. The AI intelligence and numbers are well balanced and placed to make it difficult but not near impossible..although I did have to rethink and replay quite a few actions..often multiple times. You can run and gun but not far and not for long! I like the auto save but more than that, I like that you can also manually save where you are without losing progress.    TIP: 1. Save the run and gun until you get thru the first ten or 12 enemy and its much more fun. ",
            "review_score": "1"
        },
        {
            "review_text": "I must say, I'm thoroughly enjoying Sniper Elite 3. The devs stepped it up on this sequel. They took everything we loved from V2 and made it better, while adding new features /systems to give it a more stealthy feeling, which I love. AND It's running on Ultra with zero performance issues on my old gtx 670.",
            "review_score": "1"
        },
        {
            "review_text": "This game lets you obnoxiously (in the best way) blow off faces/organs/limbs whathaveyou from nazis. In this day and age, killing nazis feels really good. Plus there is kill Hitler DLC.",
            "review_score": "1"
        },
        {
            "review_text": "Must buy if your a fan of the sniper series. A bit short, I finished in 20 hours but it was enjoyable the whole time.",
            "review_score": "1"
        },
        {
            "review_text": "5 star for this game.... booom headshoot",
            "review_score": "1"
        },
        {
            "review_text": "Killed a man by blowing out his testicles with a high powered rifle....10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as V2 in my opinion but it's still a great game.",
            "review_score": "1"
        },
        {
            "review_text": "All the dead enimies have bright blue lips hich looks like lipstick. 10/10 (I realize it's a glitch.)",
            "review_score": "1"
        },
        {
            "review_text": "awesome game can't put it down",
            "review_score": "1"
        },
        {
            "review_text": "The ragdoll physics are the only flaw i saw in this game 9/10...  very recommended...   and shooting hitlers genataluia is very satysfying...",
            "review_score": "1"
        },
        {
            "review_text": "much better than sniper elite 2 because its got a lot more options and things to do  must have 100/100 GOTY all year every year",
            "review_score": "1"
        },
        {
            "review_text": "Im really enjoying how this game combines stealth and the ability to assault so well.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awsome game too bad it does not have more missions in this game but still 2 thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "The sand box nature to this game is great, I recommend it to everyone who loves to kill nazis, tactically plan out each one of your kills, stealthily kill enemies from behind or just want to assassinate Hitler over and over and over and over and over again. :)",
            "review_score": "1"
        },
        {
            "review_text": "I once managed to play this game for 5 minutes! the game consistently fails to launch.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, though in my opinion the gameplay was probably to hyped up. The game play is fluid, the kill cams are cool, but after awhile they start to get old. Although if you're looking for a challenge, this game can definitely give it to you.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. I have about 145 hours on Sniper Elite 2 and about 40 on Sniper Elite 3. This latest version has much more in smarts needed to be a sniper. Needing to relocate, taking time to plot out a superior shot and so on. After I play the game a bit I run my own variations, like playing it backwards. Not following the script and taking my time to NEVER miss (that one is tough). The artwork in the game with such incredable detail really allows realism. The 'targets' in this version act more like real people. When a target hides they can stay down a while and then move a few yards away from where you last saw them.   Trying to take shots only when there are other sounds adds realism. I do not like to run around and simply blast targets, it is much more pleasureable to outsmart them or sneek up on them for a quick silent knife kill.",
            "review_score": "1"
        },
        {
            "review_text": "I never played the original Sniper Elite and any comparison with it would be trite and based upon nostalgia anyway. But I loved Sniper Elite 2, as did a great many people. Sniper Elite 3 is not the great leap forward from 2 that it was from the original. The graphics are better but for many gamers the alterations in gameplay will be the key...  The much toted engine kill graphics are cool once or twice but lack the detail of angle and impact point of the body shots. I thought they'd be similarly detailed (as they were heralded by the developers) but they are are not. VERY cool but pretty much repetitious - shoot it twice in the engine 'highlighted area' and it goes boom...  The only real thing I didn't like about the game is that, in some areas (that are big, or you take a long time in) you have respawn. In some cases this is behind you in a canyon... if they catered for it with new truck arrival to locations it would make more sense and one could prepare for it.  In general though - anyone that like SE2 will like SE3 Perhaps many will like it less because the Africa campaign was very British (my granddad was there and up in to Italy - and still very much alive btw :) ) We all think of the Germany or France war films when we play games...  I'd buy it again at full price as I did - if it's cheaper... you'd be silly not to, tbh",
            "review_score": "1"
        },
        {
            "review_text": "so far it's a great game and I like it sure it could use more content (who don't like more content ?)  some people conplain about map being small and don't leaving the 'space' to do what you want, even about game mechanics (if you want to stealth you never use your sniper rifle, how to wellrod simulator) [if you want to stealth then use binocular, relocate, use sound, hide bodies, use flint and stone to trap the shot under cover of the trap . . . and if you want to assault : just shot your way through the map] not being able to shoot foe at more than 400meters and long shot being only 200ish shot  but there is more to the game  rifle customisation and custom parts to find, as upgrade for the binocular, player level . . . there are lots of things to do  lots of way to complete each mission    only major con in my opinion is the lack of weapon choice so pick the season pass with the game if you like having your weapon of choice",
            "review_score": "1"
        },
        {
            "review_text": "i really recommend this game beacuase it really shows that whoever made this game had only one thing in mind. to give everyone playing this game a great time. got this for free with my r9 280x. the game looks beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Hello! i have got a problem with this game: i can play multiplayer just for like 10 min and then game crashes...but coop works just fine...any suggstions what could fix this problem???",
            "review_score": "1"
        },
        {
            "review_text": "By far one of my new favorites. Easy to just play through, but fir those who want a challenge, it has plenty.",
            "review_score": "1"
        },
        {
            "review_text": "I've been enjoying this a game for a little bit but i have only played the campaign.  So I'll keep it short and sweet. I'd recommend it but wait for a sale.  It's interesting enough to play but, other than the collecting all of the items, I feel that this game campaign-wise is a  once-and-done.   +'s: Cool slowmotion sniper kill animation (Read: Gory for the younger and it can be turned off, i believe)  -'s: The bullet time kill gets old after awhile. It also leaves you vulnerable for a few seconds during and slighly after bullet flight. It might be my computer but it crashes every now and then. A.I. is a little funky after dying and loading back in during the TANK boss fight at the end of levels.  ",
            "review_score": "1"
        },
        {
            "review_text": "best game ever killcam better then ever be warned though play this game in short half hour bursts or it will get boring hope this review helped anyone :)",
            "review_score": "1"
        },
        {
            "review_text": "Lol, why do I suck at this game?",
            "review_score": "1"
        },
        {
            "review_text": "This being my first expierence with a Sniper Elite game, I found it to be very good, but not as spectacular as I had hoped. The rifle ballistics, custom rifles, items, the graphics, the AI, tweaking the difficulty, and overall gameplay are a lot of fun. I enjoy it a lot. But I feel like it's not as expanded as it should be. The maps, although they have multiple routes, are still relatively linear and small, and not as open world as the description trumpets. And the way I like to play, is basically take down a German compound piece by piece, but having new variables such as tanks, more troops, or half-tracks introduced via cutscene takes away from the experience. Instead of hearing or bumping into a tank from a distance or around a corner and having to adapt to the situation, the game presents it clearly, which allows you to make a plan to take it down, but that on-the-spot thinking element is diminished I think. It also has felt like that the sniping experience is lacking, in that I end up using my knife and suppressed pistol more often than a rifle. Which upsets me a bit; I want to use my rifle but sound covers are few and far between, so I have to rely on a dumpy pistol. But this might be something that occurs in all the Sniper Elite games, so to a veteran and might just be the usual thing, so if it's that case, then it's fine. Falling damage is also a pain in the neck; I understand that the human body can be fragile but it can also be very strong; I've let myself drop in what looked like a two foot drop, and ended up losing two health bars! It stinks because those lead to unconventional routes that enhance gameplay. And lastly, there are simply not enough single player missions. I understand nowadays multiplayer is a very popular thing and single players are becoming more of an aquired taste in shooter games. But seeing as this is a game following a lone OSS sniper, you would imagine that they would have a flushed out, longer, more expansive single player. I mean, this game is IDEAL material for a single player experience! But they shorten it up to make room for co-op and multiplayer; having multiplayer isn't a bad thing! Lots of games have it and SHOULD have it, but it shouldn't diminish or take away from the single player experience. There are lots of gamers who like to play by themselves. I'm not a fan of multiplayer and there should be a bigger, more robust single player. The levels are long, granted, but there's not enough of them! I want moar! Maybe Sniper Elite games have short single players in general but again I wouldn't know. Maybe I ought to hold my tongue and sink some more time into the game; I know I only have like ten hours but I'm almost done with the single player ever since I saw there were like 8 missions. Shooter games used to have long single players experiences, with upwards of fifteen, eighteen, or maybe even a little over twenty missions. Sniper Elite III is nowhere a bad game though, it flows well, it doesn't overwork my PC, and it is still most importantly FUN. It's fun to see an enemy bumble into a trip wire! It's fun to plant a mine, watch a tank lose its treads as it rolls over it, plant some TNT on its rear and watch it explode. It's fun to watch the enemies run around like chickens with their heads cut off when you fire a shot. The game flows well, runs well, and I have a lot of fun with it, but I just wish there was less kinks and more missions.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game a week after launch. the ai is amazing and the Bullet trajectory is un-matched. good amount of game play. multiplayer has enough game type for any hard core fan of the series.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  will shoot some balls again :)",
            "review_score": "1"
        },
        {
            "review_text": "Another good entry, story ironically should be longer, level design is a bit ♥♥♥♥ey. Story isn't as good as the last one either. 11/10 would kill harmless soldiers eating lunch again",
            "review_score": "1"
        },
        {
            "review_text": "Well it's an amazing game and I am playing it everyday since I bought it, also with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game feeling I would not want to stop playing . A game that takes the time to thoroughly enjoyable manner . Strongly recommend 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game had great Graphics, Great Storyline and Wonderful Pyshics. I recommend this game to anyone who likes snipers ofcourse or any type of shooter, It requires aim and practice if you want to be 'pro' :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome stealth / sniping game.",
            "review_score": "1"
        },
        {
            "review_text": "A challenge game to your eyes.  Huge and beautiful maps.",
            "review_score": "1"
        },
        {
            "review_text": "Wow.... yes im one to read reviews, watch videos, and everything before I buy a game, soon as I started I went straight into multiplayer, Everything was smooth, loaded quickly, Feels like socom sneaking around. pretty awesome. BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "I see a lot of negative reviews saying that sniping in this game take a back seat to silenced kills with the knife or welrod.  Well, that's just not true, it is actually a choice. You can do all levels using just the sniper rifle if you want. That's because of the new relocation feature. Kill someone, relocate, repeat. It is great and a big advancement in relation to sniper elite V2, where the levels were smaller giving you no space to relocate.  I think this game is a great advancement in relation to V2, and is the best sniper game available!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Make sure to get all of the DLC's. Well worth it",
            "review_score": "1"
        },
        {
            "review_text": "very fun game! highly recomended",
            "review_score": "1"
        },
        {
            "review_text": "good game  11/10 as long as you have the patients GET IT NOW MOST FUN ULL HAVE ON STEAM IN A WHILE BESIDES GABEN",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAMES STORY IS GREAT THE BULLET BALLISTIC IS AWESOME AND THE MULTIPLAYER IS FUN BUT DONT RUN AROUND OR YOU WILL DIE",
            "review_score": "1"
        },
        {
            "review_text": "Good game but needs better optimization for playing with friends, party etc.",
            "review_score": "1"
        },
        {
            "review_text": "Like its predecessors, Sniper Elite III is an individually paced stealthy adventure. And because you move at your own pace, it’s a pleasant break from the faster paced non-stop action shooters. Your goal is to sabotage a Nazi weapons program that could change the outcome of the war. Stalk your targets through scenic canyons, oases, and cities of the ancient desert. Use stealth to hunt your targets. Utilize your skills to achieve long distance kills, melee attacks, diversions, and booby traps. All in all I think it’s a great WWII gaming adventure. And the x-ray vision slow-mo sniper kills, which are unique to the Sniper Elite series as far as I 'm aware, are totally insane.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I am a Crossfire user and wanted to see what mantle could do on a game other than BF4. Amazing visuals, awesome gameplay all around, and plenty of replayability. Definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the single player campaign after completing the single player campaign in SE2, this version steps up and nails a home run. I can't count how many snapshots I got just from picking off soldiers or getting into a hair raising gun blazing gun fight with six grunts. The menu redesign from SE2 is much easier to navigate and I am looking forward to the Multiplayer Coop and versus campaigns.",
            "review_score": "1"
        },
        {
            "review_text": "Sniper Elite 3, along with the past franchise is a unique style of game virtually uncomparable to any other FPS on the market. Within the games amazing visual enviroment, super realistic ballistic control and it's jaw dropping tactical gameplay, SE3 is by far one of the most Fantastic shooters i have ever played... EVER.  ENVIROMENT  Sure it's one thing for a game to have 'pretty trees' or 'moving clouds', but all of those bells and whisles are a fraction of what the game in it self has to offer the player. Not only do you get to see the ever changing weather in the enviroment, but it will also effect you down to the tiny aspect during the gameplay. SE3 was evolved how weather can effect how the player can react in its gameplay and its vast ideas of survivability.  THE BALLISTIC BLUES.  Alright, i'll be honest here... I was ♥♥♥♥ING FLOORED how much comes into play when shooting a rifle. Sure Sure, other games have simulated similar things such as Wind, Blood Pressure and breathing patterns, this is not what i am boasting on SE3 being the 'first'. In person, i have never shot a gun before as country laws prohibit them for personal use, although i know in most countries ownership of them is normal so bare with me on this part :P. Before i just thought, you point, squeeze the trigger, all said and done. Yet SE3 has taught me more than just being 'trigger happy' and to consider much more than just WHO i'm going to shoot. I was playing on the difficulty Sniper Elite so almost everything effected the Velocity of the traveling bullet, which was a huge eye opener seeing as how i could barely hit the 100 yard target. God forbid if people think this game is comparable to Counter Strike or any generic shooter such as that i strongly advice you to NOT try and Flick scope with an AWP :P. The gameplay is relentless and will make you think twice about launching bullets wildly toward your enemies.   BOOM, HEADSHOT.  Speaking of lobbing bullets towards your enemies, If there is one thing this game and other games like SOCOM have taught me, is that sometimes taking the shot is not in your best interest. YOU DO NOT POSSESS INHUMAN STRENGTHS AND ABILITIES. You can't just run into a gun toating armies with your eyes closed and hope to rid the world of evil, its just not how it works, PERIOD. BULLETS INDEED OUCH, so to speak. Now think about this, you have one Target you need to kill and search at the back of a camp filled with dilapidated buildings which is filled with 5 to 8 others, ( that you can see). Would getting into a heated gun fight with limited ammo seem like a decent idea? Probably not. Tactics come in, watching where they patrol, following them, stealth killing them; its not just about having a large rifle. Although i will admit that when you watch the bullet cam and you see a Rifling round whizzing through the air in slow motion as it shatters the skull and exits out the back of the head in a gruesome execution, is pretty ♥♥♥♥in' sweet. Doesn't justify the intensity of careful gameplay you need to make just to not get filled with hot searing led.  TWO IS A TEAM  the CO-OP play.. my god. I thought it was going to be horrible, buggy and down right stupid. But i will admit it was probably one of the most hardest/fun CO-OP experiences i've had in the longest time. You really need to connect on way more than a gaming level. Not a 'oh i'll go that way you go this way' kind of deal, you literally need to work as a team to help each other observe, seek out and eliminate if you want this to work out for the both of you. Also when one player goes down you have the chance to Revive them, they kinda get a 'last stand' sort of thing, alot like Borderlands or Call of Duty, except you don't stand back up if you kill someone in it. So your CO-OP player really shouldn't wander too far away from you. When it comes to CO-OP play i STRONGLY RECOMMEND its done over a Voice program, I.E -- Skype, Ventrilo, Teamspeak etc. Or to just play together locally, because the more communication you two have will make it worth your while in the long run.  CASTING THE FIRST STONE  Okay you caught me, i haven't played the game for too long i get it. But i am just shocked and impressed with the quality and depth to the game. It is definetly a game in which i could see myself trying to get all the acheivements too or beating it on all difficulties. Yet who knows, i'm just a girl from the 'Gun free' country of Ireland, but i love what i have seen so far :). And others who play or would like to play, just add me! Would always love a second gun in the mix! :)  ENVIROMENT 8/10 GAMEPLAY 9/10 Kaylas Metascore 87/100",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun to Playy!!! Reccomended",
            "review_score": "1"
        },
        {
            "review_text": "Sniper elite 3 is a very nice looking game, with good graphics and good gameplay. The only thing i dont like about this game is the story line, it's to monotonous. every mission feels the same, that's why I started playing multiplayer.  I'm happy i bought it in the steam sale for 9 euros, It isn't worth 45,99 euro. BUT it's totaly worth 10 euro. :D  Have fun",
            "review_score": "1"
        },
        {
            "review_text": "downloaded win 10 now sniper elite 3 won't start",
            "review_score": "1"
        },
        {
            "review_text": "It's Assassin's Creed: World War 2. Playing as Karl Fairburne the Wungestein, as called by the Germans, or Desert Ghost, you can move around undetected. Silenced Welrod pistol to silently dispatch enemies, mask your rifle shots to kill while undetected. Going loud, you have an 70%+- insta kill rifle( depending on where you shot), SMGs for close quarter combat. You can also lay traps using trip mines to kill enemies who don't see it, throw grenades to kill groups of clustered enemies or land mines to destroy vehicles and dynamite to add the extra punch. ",
            "review_score": "1"
        },
        {
            "review_text": "absolutely fantastic. sniping at it's finest.",
            "review_score": "1"
        },
        {
            "review_text": "While the campaign isn't overly long, there are many different ways to approach each mission e.g. silent / stealthy or YOLO guns blazing. Cool graphics, and an overall really enjoyable game. Definitely one to buy",
            "review_score": "1"
        },
        {
            "review_text": "Great Detail  10/10 would shoot enemy's nuts off again",
            "review_score": "1"
        },
        {
            "review_text": "I just buy this game today.And of round tdm.I dont know why all enemy spawn beside me,and I killed all of them(cause they got a big red mark on thier head.20 mins later a real enemy killed me.OMFG,I shoot 20 mins my friends.Sorryyyyyyyyyyyyy my friends!!!!!!!!!!!!  great game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "gg for life this is a very good game +rep great fun.. not must ells i would want !",
            "review_score": "1"
        },
        {
            "review_text": "As a game with a co-op campaign I am automatically liking this game. The co-op part allows for simultanous take-downs and try-hard stealthy play. On the weak side, I think being discovered could have been more punishing than it is. Now you simply have to relocate a good 30-70m before you become fully stealthed again. I wish the AI would have sounded a more lasting alarm and called in reinforcements upon being discovered.  There is an interesting multiplayer map setting called 'No-cross', which endorses heavy sniper play as well.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best sniping game out there",
            "review_score": "1"
        },
        {
            "review_text": "1. Shoot a nazi without any sound to cover your shot 2. Hide like a ♥♥♥♥♥♥ from the angry nazis 3. Rinse and repeat ",
            "review_score": "1"
        },
        {
            "review_text": "Got bloody pieces of Nazis in my face after 360noscoping their brains from point blank in slow-motion. The german in me is satisfied. 12/10 GOTY would shoot again.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!! Really fun and it has great slow mos",
            "review_score": "1"
        },
        {
            "review_text": "This is a real stealth game I can say. You don't have a silenced sniper afterall. Which makes everything harder. AIs are hard and quick (Never played other than Authentic so I don't know the other diffuculties. ) I do recommend this game but this is not an action game at all. Just saying. You can't just run and shoot everyone you see. Atleast at Authentic Diffuculty.",
            "review_score": "1"
        },
        {
            "review_text": "Like its predecessors, Sniper Elite III is an individually paced stealthy adventure. And because you move at your own pace, it’s a pleasant break from the faster paced non-stop action shooters. Your goal is to sabotage a Nazi weapons program that could change the outcome of the war. Stalk your targets through scenic canyons, oases, and cities of the ancient desert. Use stealth to hunt your targets. Utilize your skills to achieve long distance kills, melee attacks, diversions, and booby traps. All in all I think it’s a great WWII gaming adventure. And the x-ray vision slow-mo sniper kills, which are unique to the Sniper Elite series as far as I 'm aware, are totally insane.",
            "review_score": "1"
        },
        {
            "review_text": "it's the one of the greatest games i had played ..",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, gameplay, and story contribute to create an impeccable scene of the struggle in the Africas during WWII.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, max payne mechanins in a stealth snping game... What more could you ask for m8? ",
            "review_score": "1"
        },
        {
            "review_text": "Has the gun used in JFK assasination   1963/10 would november 23 jfk again",
            "review_score": "1"
        },
        {
            "review_text": "What can i say - awesome game with pleanty of splatter FX :D... ps. if your using Frabs for FPS overlay, you may have issues starting the game, close it down and you should be ready to go :)",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game, though for different reasons than its predecessor. The emphasis here is on extended stealth sequences punctuated by brisk, risky sniping segments rather than the nonstop sniper action of V2. This is a much slower, methodical game with massive open levels (perfect for anyone frustrated by the linearity of V2) and a focus on using the terrain to your advantage. However, the player is given great freedom over how they complete each objective, be it smart and quiet or dumb and loud!  Pros: - Large open levels, with optional side objectives and hidden areas. Exploration is dangerous but often rewarding! - Sniping, whilst not entirely realistic, is incredibly satisfying (when a single bullet gets two headshots and blows up a panzer's fuel tank you'll understand...) - The bullet cam is back and gorier than ever. Muscle and nerve endings are modelled on enemies, giving a greater sense of how damaging a sniper's bullet can be. The camera is now also fully customisable.  - Smart AI, brutal at the higher difficulties (though I do wonder why they don't just sound the alarm as soon as they find a friend's body...) - Greatly improved loadout menu, where you can use weapon upgrades scavenged from the battlefield to fine tune and tweak your rifle. - Beautiful North African setting - sort of an Indiana Jones aesthetic (you know, fighting Nazis in ancient ruins).  Cons: - Story is a little threadbare, often predictable and lacks the intrigue and morally ambiguous edge of V2. However, some may prefer the lighter tone, and the gameplay is so fun that you won't care anyway...  - Enemise sometimes feel too accurate, especially with automatic weapons. - DLC missions are good, but they are hardly standouts that justify their individual price tags. Only buy if you are hungry for more content.  Ultimately a fantastic addition to the franchise that isn't afraid to change up its gameplay. A must for sniping enthusiasts and people who want something different from their WW2 shooters.  ",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay very smooth. Game seems to be well optimized and beta tested.  I liked the different levels of difficulty, makes for a completely new gameplay the higher in level you go. AI seems a bit 'slow' sometimes, but gets increasingly better in higher difficulty levels. Overall a very well thought out game with hours of gameplay .",
            "review_score": "1"
        },
        {
            "review_text": "Has been playing for a long time since 2005 This game would be the best prequel to V2 Sniper Elite High intense battle system But problem in connection through matchmaking via online mode less player during coop session Great job Rebellion Keep up the good work",
            "review_score": "1"
        },
        {
            "review_text": "Very good stealth game.  And all of you who say 'you have to use the Welrod more' are telling the truth.  But the Welrod is silent, which if you have'nt figured already, is what the game is about.  Overall very good game!",
            "review_score": "1"
        },
        {
            "review_text": "very good craphics at my 9 year old shitcomputerexe and this game is so good at physics if you have sniper elite  difficul. and i get only this game+season pass for 18 e so thats why i buy this game without offer or wtf is it this would cost 70 e or something like that.All dlc with 18 e ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Good story, nice graphics, lots of possibilities. If you like the WW2 era, then this is your game. Even if you don't know that much about it. Maybe a little bit expansive, but for me it was worth it.  I personally highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best stress relief game I play. Cannot wait for Sniper Elite 4 to be released.",
            "review_score": "1"
        },
        {
            "review_text": "To compare with V2, this game offers a much bigger map in missions with multiple paths to choose. Enemies have a clever AI in the higher difficulties. And the Authentic difficulty is really a little bit challenging.   In terms of weapons, this game offers more rifles and SMGs than its previous games, however, most of them are included in the DLCs that you need to pay to unlock (btw my favorite rifle is M1917 Enfield xDDD).  Coop is interesting. Overwatch and Survival have changed and they're now totally different from the previous ones in V2. They worth the try. And Multiplayer...well, since it has already been released for a long time, there're not many players in the multiplayer servers now, and most of them even play with no bullet drop (&gt;_&lt; why dont you just go and play Counter-Strike if you dont want a bullet drop). There're only a few servers usually full of players and with bullet drop on (Thoses are the ture fans -。-).  In total, this game might be a little bit expensive with $50, but very recommend when it's on sale. I like this type of games, hope they can make more SE games.",
            "review_score": "1"
        },
        {
            "review_text": "Rocked. Pure and simple.",
            "review_score": "1"
        },
        {
            "review_text": "* nice graphic * excellent sniping gaming experience * wwii battlefield background * testicle shot * hitler mission * various weapon and customization  a must have for sniper elite fan and who is interesting in sniper and wwii!",
            "review_score": "1"
        },
        {
            "review_text": "i absolutely love this game",
            "review_score": "1"
        },
        {
            "review_text": "i would highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot like MGS V. Stealth, marking, 3rd person and the ability to approach every mission just the way you want to. You can go in loud and proud with a machine gun, or use a silenced pistol and snipe only when planes are overhead or artillery is going off. There is a relocation system in the game that allows you to shoot 1 loud, unconcealed shot as long as you quickly move to another position. That mechanic really adds to the game by allowing you to snipe more frequently (as there are no silenced sniper rifles) Overall, the game is really fun. HOWEVER, if you are loking for a hyper realistic sniping game, this isn't it. This is more like MGS V gameplay + some sniping mechanics. Breakdown: Graphics- 9/10 Gameplay- 8/10 Sounds- 9/10 Overall Score- 9/10  Notes: Performance was good. With all settings max at 2560 by 1440 I'm able to hit the refresh rate of monitor (144) consistently. This is with a moderately overclocked GTX 1080 No bugs have been experienced as of yet.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is one of the best games I have",
            "review_score": "1"
        },
        {
            "review_text": "If you are so much into Sniper games then go for it, otherwise if you just want to give it a try I suggest you purchase it on sale because the graphics are great and it gives you the stealth and action mode that you are looking for but the story is so poor basically there is no story, you are a sniper that moves to diffrent locations killing Germans that is pretty much it!",
            "review_score": "1"
        },
        {
            "review_text": "  there's not much to say. The singleplayer is challenging and fun. The multiplayer kinda blows, it gets fun but there's not only not enough servers to get one in your country for a good ping. There's cheaters all over (obviously like any online game) and I get 'removed from the game' all the time in the middle of matches. The singleplayer gets a little repetitive and sometimes extremely rage worthy, at least on the harder difficulties, but it definetely will occupy you for a good 10-20 hours",
            "review_score": "1"
        },
        {
            "review_text": "If you like to be excited and fearful of death around each corner. Plan &amp; watch &amp; learn from previous mistakes. To achive a goal in a pace you control it is a game for You. First person Call of Duty junkies, love being the snipers and knife runners like explosives all the lessons are here to live through. i have played on Xbox 360 and PC. The PC is better and the details are even more crisp watching the bullet traveling through the heart of your enemy. If you are anything like me i am not the best of the Elite, but i draw my rifle and would be ready to draw blood to save the world.",
            "review_score": "1"
        },
        {
            "review_text": "Testicle X-ray shot!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Love the style of the game",
            "review_score": "1"
        },
        {
            "review_text": "Great campaign! The best game game from the Sniper Elite series!",
            "review_score": "1"
        },
        {
            "review_text": "awwesome game. wish i had some cash in my steam account. would very likely purchase it. payday is 5 days away and i am hopeing it is still on sale. cool beans guys, loved it.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun enough game, story is not intriguing whatsoever. Gameplay is fun, multiple paths to the same objective(in most maps) can keep things a bit fresh. Rewards both stealth and more of a 'loud' approach.  Very short storyline, I finished it easily during the 'Free Weekend' However little collectibles hidden throughout the maps can give some of those treasure hunuters something to do besides shoot people in the head. There's also multiple side objectives for each map that can prolong the length of a mission.  Graphics are great, however I would run into a random FPS drop for about a second or two. Almost like there was minor loading between different parts of the map, pretty minor detail, never happened during combat. The game also comes with it's own 'Benchmark' which tests how well your computer plays during random situations ranging from not much action/movement, to tons of particle effects from a big explosion.  AI could use some work, seems as soon as you relocate and go back to hidden they go back to their usual routine like that guy laying on the ground with a recently placed bullet lodged in his skull wasn't ever there to begin with. Vehicle AI is also very predictable and easy to disable it's movement because of it (place land mine in obvious vehicle path = profit).  Overall I do enjoy this style of game, I enjoy trying to snipe people without using the protagonists ability to 'slow time' so to speak. Also satisfying watching the kill cam as your bullet explodes an eye ball while plowing through an unsuspecting victims skull. Or getting those double/triple kills with a single bullet is always satisfying. I would recommend the game, however, not at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Literally bought this after seeing there were ball shots. Literal game became 'can you shoot their balls off.' 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I dont even own this game",
            "review_score": "1"
        },
        {
            "review_text": "Not bad game, SP missions are long, and MP is interesting :D",
            "review_score": "1"
        },
        {
            "review_text": "  Overall this is a fun shoot and scoot game. It's worth the $9.99 sale price.   That said I do have some major complaints, the loadout system is kindof pointless since you won't be using much besides your rifle, welrod, anti-tank land mines, grenades and bandages. Dynamite and the various anti-personnel mines/traps are flavor that I didn't use. The rifle customization wasn't that important either. If you're like me 90% of your shots are 1-hit-kill headshots no matter what. Recoil, reload and RoF don't matter because of the reposition mechanic below--you're only shooting once. Damage doesn't let you actually kill vehicles in fewer hits. I never figured out how AP rounds work--do you have to activate them? Are they always on??  Enemy AI is pretty dumb. The 'reposition' mechanic basically means you can just run away after each shot, and then run right back to where you were for another shot. Enemies will return to the 'all clear' patrolling state within a few seconds this way as if they magically know you repositioned, but don't know you ran right back.  The worst thing is that on some maps enemy spawning is pretty obvious and weird making it so that areas you'd cleared would suddenly be full of enemies again.   I beat the game on Marksman, and a couple of levels on Authentic. There wasn't much of a tutorial for learning to guestimate where your shots will land with authentic although there is a wind guage.",
            "review_score": "1"
        },
        {
            "review_text": "be a    ♥♥♥♥    and aim for the testicles",
            "review_score": "1"
        },
        {
            "review_text": "Is a good game.  However for me it is more fun to run around stabbing people.  Still a very good sniper game.",
            "review_score": "1"
        },
        {
            "review_text": "  7.5/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "If you like Sniper Elite V2, you like this too.  Would buy again",
            "review_score": "1"
        },
        {
            "review_text": "I think this is the best game in the series yet.",
            "review_score": "1"
        },
        {
            "review_text": "Unable to open Sniper Elite 3 (since a few weeks ago. pls delete current download and insert new down load. thanks jim",
            "review_score": "1"
        },
        {
            "review_text": "This game lets you obnoxiously (in the best way) blow off faces/organs/limbs whathaveyou from nazis. In this day and age, killing nazis feels really good. Plus there is kill Hitler DLC.",
            "review_score": "1"
        },
        {
            "review_text": "Is a nice game ever who like sniper :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game. If you like Sniper games u must buy this one.",
            "review_score": "1"
        },
        {
            "review_text": "beside some minor bugs, this game is great, defo recommand it for all snoipah lovers, tons of fun, very nice graphics, its worth the price undoubtedly, looking forward to see SE4!!",
            "review_score": "1"
        },
        {
            "review_text": "8/10  without a great story  i loved it",
            "review_score": "1"
        },
        {
            "review_text": "Cool!",
            "review_score": "1"
        },
        {
            "review_text": "This is one to grind it's super strategic the shot animation is incredible",
            "review_score": "1"
        },
        {
            "review_text": "Great game but seriously unoptimised with frame drops and PC temperature gets extremaly hot",
            "review_score": "1"
        },
        {
            "review_text": "Hits all the same notes as previous games which is a good thing. As satisfying as V2 but in a slightly different way. Planning, spotting, sniping and staying unseen. Good to see more crackpipe German WWII super weapons getting some love here.",
            "review_score": "1"
        },
        {
            "review_text": "This game fell far from what made Sniper Elite V2 fun, while at the same time fixing a lot on Sniper Elite V2's problems. How does that work? Well in my normal, befuddled, complicated review style I'll do my best to explain.  The whole Sniper Elite series revolves around popping a bullet from your rifle of choice into the head of filthy degenerate Nazis (sometimes Russians), hey that's fun right? Yea it is!   Except in Sniper Elite 3 you're more likely to be using the Welrod than you are sniping, also likewise using new silent close combat kills which actually do have some pretty wicked kill animations, and while nothings wrong with using CQC executions and the welrod to get into position for sniping, the problem is you're gonna be mostly using the Welrod and CQC to get through the level, there's rarely a place to get into position for sniping effectively making that sniper rifle of your choice on your back more of an optional weapon of choice in a game where the name happens to be SNIPER Elite.  Normally in Sniper Elite V2 and Sniper Elite you got from point A to point B, point B being the place where you pull off a sniper shot and take out the target, throughout the game you can find areas where the noise blocks out your shots and you can pick off any soldier with a bit of patience.  Now that returns in Sniper Elite 3, but my one big problem is that it feels...placed. Whereas in V2 something like mortars hitting the ground were a boon for pulling off a shot, the fact you use what feels like conveniently placed generators or noise making sources to mask your shot just feels off. It feels less like a perfect chance and more like a part of the game where you just sit, wait for the generator to make noise and pick off the enemy until everything is swiss cheese.  Now that's not the ENTIRE case, of course sound masking sources like planes flying overhead return, as do artillery shots of course, but these are strung out so that it feels like you either use the generator or you don't, and if you don't and pull a sick headshot off in total silence then instead of everyone in a 5 mile radius combing the entire place for you you just gotta relocate.  Relocting! Making the consequences of pulling off an unmasked shot null and void. Honestly its not that bad (in the context of Sniper Elite 3), in a game where you can't snipe anything and you gotta get around with the Welrod or the pay2win silenced semi auto; there has to be some kind of leeway that lets you wipe the dust off your rifle and tell someone they can ♥♥♥♥♥♥♥♥♥♥♥ in Hell.  So why does it feel so bad to me at least? Simple: Shoot someone, relocate, rinse and repeat.  And speaking of getting from Point A to Point B, lets talk about the maps! Now, these maps are more open world, meaning you can persue any objective in total silence or loud as ♥♥♥♥, nothing wrong with that, I like open maps! Except for the bit where at the end of each level in V2, Point B was the place you gunned down your target, in Sniper Elite 3 you can go through most of the level or the entire level without firing a shot from your rifle. Hell you can take down most of your targets through means that don't involve sniping, that makes the game feel less like Sniper Elite 3, and more of a Stealth Elite 3.  But I think the thing that bites me the most is that rifles that were originally part of the base game in V2 are being sold as DLC, I mean yea it's odd to find a Mosin Nagant in Africa, but getting a KAR 98 wouldn't be difficult, instead you get that from DLC as well. It feels like Sniper Elite 3 has fallen to one of the biggest pitfalls the gaming industry is doing nowadays cutting out parts of the game, reselling as DLC.  In the end Sniper Elite 3 feels weird, off, it's not what I expected, despite some of the highpoints, honestly I had fun for the first few hours, then the whole DLC bits happened and I noticed this game wasn't as good as I thought it to be, in fact I'd go as far to say that Sniper Elite V2 is the better game, the fact you can actually stealth for once is really nice but the fact that it takes away from sniping hurts on more deeper level, if you really want Sniper Elite 3 I'd recommend waiting for a sale or a price drop.",
            "review_score": "-1"
        },
        {
            "review_text": "Six DLCs for sale as of right now (July 17th, 2014.) Game is 3 weeks old; been in development for the better part of 2 years. See, all of this DLC content could have been included in the actual game without us having to pay $80 for the full experience.  I now see who the real Nazis are. And the Jews.",
            "review_score": "-1"
        },
        {
            "review_text": "45,99€ for 8 missions............  unless you pay an addisional 67,87€ for an astounding   4 more MISSIONS! and 9 Weapons Skin packs!  yeeeeey...........................  10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Urgh. I gave up on this game after like level 3 - the one where I couldn't see a direct route to my next waypoint, so I literally murdered an entire Crusades-era citadel full of dudes one nazi at a time by timing my shots to coincide with planes flying overhead so nobody would hear my rifle shots.  Then I went to collect the piece of intel I was sent in for, which tripped off a cutscene and three officers show up and proceed to wander aimlessly around this totally abandoned citadel, picking their noses and absentmindedly walking past abandoned guardhouses, checkpoints, destroyed AAA batteries and, oh yeah, piles and piles of dead soldiers. All with me crouch-walking about 25 meters behind them in my fetching Allied Forces uniform, because when the enemy is this stupid, even snipers can't be arsed trying to blend in.  This was all on the difficulty mode for 'masochists and sniping experts'.  Quite honestly, Hitman: Blood Money got the balance between difficulty and realism for a stealth game right about 10 years ago and it didn't need to make pretentious claims about 'realism' doing it.  Screw this game. It's fun to ask that grown adult who collects the supermarket trolleys from the carpark how much change I should have gotten from $10 for a $9.85 shopping bill just to see what he'll do, but even when I know these guys were responsible for the the holocaust it isn't enough to drown out the guilt I feel for picking on the intellectually handicapped to this extent.  I hope I haven't wasted my money with Styx too.",
            "review_score": "-1"
        },
        {
            "review_text": "Good graphics. Can't finish the story mode, bugs on 'Siwa Oasis - ladder bug', lots of people have this bug, lookup on internet; the bug is not solved and it seems it will never be.  I had to uninstall it and I had to look the rest of the story on video.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought a sniper game, received a stealth / One man army, one.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible AI, low challenge, and iffy game mechanics make for an overall bad game. Would not recommend to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "After very unpolished Nazi Zombie Army I shouldn't be expecting much. But somehow I was. I counted on a very improved Sniper V2 with new features and finally fixed multiplayer issues, but Rebellion doesn't learn from their own mistakes. So let's list down the pros and cons and see for yourself:  - no server browser or even matchmaking for coop/survival - if your buddy quits, you go back to lobby, no option to continue alone - if your partner loses connection for a second it's also over - problems with bullet collision. For some reason if you go prone you risk missing. Maybe sth invisible stands in your bullet's way, no idea. - stupid collectibles (war logs, playing cards) that can only be picked up if you play on a lower difficulty level as on the higher ones you tend to avoid enemies. I think I don't have to mention that you won't collect them all with enemies around. - unreliable checkpoint system. It sometimes saves often, sometimes almost never (e.g reaching the fortress in mission 4) - ridiculously overpriced DLC content that should actually be free to be honest  + you can customize your loadout + improved graphics  All in all, it's a definite no-no. This games also ultimately confirms multiplayer is beyond Rebellion's capabilities.",
            "review_score": "-1"
        },
        {
            "review_text": "Arcade. Don´t buy this game if you expect some realism. Examples: I shot PzKpfw III with Panzerschreck to its back armor, and i only destroyed its tracks. Another thing is that African campaign ended 13. 5. 1943 and here every fifth guy uses fraking Panzerschreck (it was introduced in 1943, but here it look like they bought them in humblebundle. And they all use updated version introduced in october 1943). Best part was when we (in coop campaign) saw position with flak 36 guarded by only 2 men, and you guessed it, they both had Panzerschrecks. And they won´t hesitate, and will use HEAT round against single man. Bullet drop is awful (but Panzerschreck flies completely straight), and you cant hit anything with submachinegun,if it is more than 10 m away. And you have problem to hit person 5 m away with longer burst. Even MG 42 on tripod has bigger reticle than Opel blitz (truck) 20 m away, no joke, i tested it. In mission where you have to destroy that PZ III it has normal coaxial 2x mg 34, but when they hit something, there are bigger explosions than from 20 cannon. And you can run thru entire levels only with mp 40 on a highest difficulty.",
            "review_score": "-1"
        },
        {
            "review_text": "Having finished the campaign, i can say that Sniper Eilte 3 is immensely better than V2. The level design is amazing, and there is a massive improvement on how you could play the game. The one thing that bugs me about this game is the DLC. Normally, Sniper Elite 3 has barely any weapons, challenge maps, or missions. Where do you get more? DLC.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesen't compare to Sniper Elite V2. Don't waste your money",
            "review_score": "-1"
        },
        {
            "review_text": "I never completed the singleplayer because i found it boring with a huge lack of story. Sniper Elite 3 is more interesting as a bullet hit simulator than the actual gameplay. The developers put so much time making Sniper Elite 3 look good without making it good at all.  I thought maybe it's a multiplayer based game and the singleplayer is just to attract people to buy the game. Oh boy I was wrong. A sniper purpose is to be unseen and kill unspsecting enemies of their presense. Putting 8 sniper vs 8 snipers isn't a great idea specially in a relatively small map for 16 snipers. Gameplay is campy and unrewarding.Also it feels like Sniper Elite developers tried to make it feel like a COD game they kind of succeeded and also failed. It's feels like one but it ain't because of the odd gameplay style of the game.  overall won't be worthing your money I would say if you want to be a sniper try battlefield bad company 2 it has a rewarding system with snipers. sniper elite rating 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Day one DLC? bad NO thats something id expect from EA Enemy hitboxes stop working past 150m SERIOUS ISSUE Multiplayer is unplayable, compareable to watchdogs on launchday Co-Op is also broken, second player that is connected to the host will fire 2-4 times for every single click of the mouse on their end. The AI is FAR from groundbreaking like the devs would like you to believe, unless ground breaking is spotting you and calling for help while being stabbed in the jugular and also seeing you at 100+ meters while you are prone and in a bush Only improvements from SE2 is prettier looking graphics probably the only posative thing i can come up with  Definatly regret buying it, will update with more issues/praise as i progress into the game",
            "review_score": "-1"
        },
        {
            "review_text": "I felt that this game failed to entertain as much as Sniper Elite 2 did. There was less opportunities to use traps in this game and the best tactic to get the job was to use the silent handgun which wasn't fun at all. Also the snipers in the game were more of a nuisance than anything else.  Overall I wouldn't buy this just for the singeplayer because the missions were boring but also because it is also very short.  EDIT: Played the coop with my friend and we are very disappointed how bad the maps were in comparison of the Sniper Elite 2 maps. They were much better as in Sniper Elite 3 you just have big maps where you shoot people and that is almost it. They really rushed to just publish this game and grab the money....",
            "review_score": "-1"
        },
        {
            "review_text": "Coop is broken and that's the reason I bought this. After spending over an hour in a single level, you die and checkpoints don't work. Start the whole level over. In other ways it feels very rushed. Several bugs bother you from the start. Authentic ballistics is a joke, 50 yards from muzzle and the bullet has dropped a couple of feet. Enemies are dummkopfs who forget about you if you bother to move a bit, and don't care about their dead friends after that point. The whole game leaves you to wonder why did they make such a bad sequel to a somewhat good V2.",
            "review_score": "-1"
        },
        {
            "review_text": "every guy you kill died the exact same way, the rifles are very slow to bolt and the waiting for an 'all clear' takes forever.",
            "review_score": "-1"
        },
        {
            "review_text": "The actual sniping in the game is pretty good. Its fun and somewhat accurate to real world ballistics. Everything else isn't. Movement is awkward as is most other facets of gameplay. The stealth mechanics are relentlessly shoved down the players throat and aren't really fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Once the novelty of the bullet time mechanics wares off the game gets very boring and repetitive ( especially if you've played the previous ones). Not worth the money.  Pros: It looks nice.",
            "review_score": "-1"
        },
        {
            "review_text": "So I bought SE3 hoping that it'd be the awesome sniper game I was expecting (you know, 'Sniper' Elite). Instead I soon realised that it was one of those super-linear-follow-the-map-and-stealth-kill-everyone games. I didn't even have to use the sniper (which are all just standard rifles with scopes...) and found that using my silenced pistol was easier (also seeing as 90% of conflict is less than 100 meters away...). Once I got sick of this, I forced myself to take the 'sniper' approach, and after the first 10 cinematic kills I realised it was going to be the same for every kill... Once I got sick of that I just started running around with an smg and started throwing bombs, and that was way easier than it should've been. Of course, once you've alerted an entire Nazi camp you only have to run 40m away before they lose memory of the past 10 mins and go back to their routine face-my-back-to-this-handy-placed-shadowy-side-access. After I started to lose hope I desperately searched for long range actual sniper acion, but all I found were microtransaction weapon packs. I know I didn't play nearly enough for a full review, but after watching more gameplay videos it was exactly what I had just experienced over and over... 10/10 would refund again.",
            "review_score": "-1"
        },
        {
            "review_text": "Review: 4/10  Although I had some fun playing this game in campaign mode, I don't really know if I could recommend it due to one BIG concern: the game is not ready.   - Bugs here and there. Fall through walls, opponents getting stuck (either where they walk or in other opponents), strange things and actions in the game can happen when loading a savegame... - Kind of a stupid AI. Your opponents will oftentimes behave strangely and unrealistic. For example, when someone sees a guy shot to death, he gets suspicious and looks around. Then, when he's not seeing you, he will just keep walking about thinking this is nothing to worry about. Can't say that's very realistic.  - The soundmasking of shots is not very consistent. A broken generator with its noise can act as soundmasking but other things which in real life could mask gun shots will not act as the same in the game. - The shooting/aiming had some problems too. - Some 'obstacles' which you in real life just could climb over, walk over, or crawl under, is in the game unclimbable/unwalkable/uncrawlable. Instead you need to walk around etc.   In short I would say that this is a game with a lot of potential and great fun, but the fact that it is NOT ready yet spoils it. Really hate it when I buy a game and discover that the developer didn't care of making the game ready before releasing it.  If you would like to play a better sniper game I would recommend Sniper Ghost Warrior 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really good i thought this game was going to be about sniping but it ain't it is more killing people with your pistol or knife or machine gun but when u shoot your sniper u have to relocate which is very annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "DLC peddling, very short game, limited ways to play, not what was promised, better graphics. yay!?",
            "review_score": "-1"
        },
        {
            "review_text": "the games ok.. its just single player sniping.. but i guess i shouldnt expect more from a game called sniper elite. Very similar to the second one. Very visually appealing though.",
            "review_score": "-1"
        },
        {
            "review_text": "The shooting is surprisingly unresponsive and weightless, the actual combat is a grind. Average out of 10",
            "review_score": "-1"
        },
        {
            "review_text": "Remember all the fun time you had in Sniper Elite 2? Finding your way around ruined cities to find that sweet sniping spot?  This game is nothing like that. Most of the time you're playing some sort of stealth commando game in small maps (and they're not even cities anymore, just sand and palm trees), trying to quietly get takedown kills or just shooting everyone with silenced pistol. Graphics and mechanics are straight from Sniper Elite 2, so nothing new in that area.  This game can only provide you dissapointments, if especially if you're looking for a sniping game. I'm just glad that I got this free, bundled with my GPU.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont waste yr money, dont buy. Refund it if you bought it. This game makes me sleepy",
            "review_score": "-1"
        },
        {
            "review_text": "it's games like this that make me wish the review system allowed for a more complex response than a simple 'yes' or a 'no'. there's a lot i actually enjoy about this game. that being said, it's far too unpolished and lacking in content to be worth it's full $49.99 asking price at the time of this review. if you're interested in this game, i highly recommend waiting for a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "*******FREE WEEKEND REVIEW*********** I actually started to like this game..... for the first hour. I can say a lot of things about this game that was probably already said such as lack of weapons, lack of story, collectibles have literally no point unless you want that 100%. This game overall has a lack of everything. the only thing that brought this game to spotlight (and the whole series actually) is the satisfying bullet cams. I dont even think that this game is even worth $10 let alone the full price of $50.",
            "review_score": "-1"
        },
        {
            "review_text": "Well the game feel more like a ported playstation game than a pc game.  THe game world is however now larger than the previous games in the series, but nothing I would call an open world. The game world it self fail to deliver and it just feel liniar and do not really give you the feeling you really have a choice...  Reason why is that the game is still very liniar, and though you do have some freedom then the map it self limit your movement. Meaning you can choose example 5 different path to travel from a-b to where you want to go.  Since this is a sniper game and they try to sell it as openworld I would say it fail to deliver. If you want to run arround like a kind of arcade game and shoot ect. then yes this might be the game for you, but the sniper part will be disapointing if you are looking for 'real' sniping over a long distance.  If you really want a sniper game, then try sniper elite 1. though it is also rather liniar then it is the best in the series.",
            "review_score": "-1"
        },
        {
            "review_text": "sorry to copy someone elses review but i cant put how im feeling better than this preveious review does   as posted by another reveiwer to reflect how i feel  ---------- 4 sniper rifles in a sniper game. Do you want more? Buy the DLCs. 4 pistols. Do you want more? Buy the DLCs. 4 secondary weapons. Do you want more? Buy the DLCs. 2 horde maps. Do you want more? Buy the DLCs. 9 missions. Do you want more? Buy the DLCs.  And so on, i guess you get it, right? Buy at your own risk. It lacks A LOT of content. In fact for 40 bucks it has a very low value.  Edit: Feel free to join our discussion on the comments section. There you can see different points of view from various people.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty crap if i was able to get a refund i would. the backround graphics are pretty crap and the ai is horible this game definetly doesnt feel like a next gen game sniper elite 2 was way better. this game feels arcady. i would not recomend this game to anyone its a peice of junk !",
            "review_score": "-1"
        },
        {
            "review_text": "How did they even think they could sell such an unfinished piece of crap? The coop is the only redeeming factor and that's because my friend and I are both drunk and making fun of such an awful game! I would put this game on the same level as Sniper:Ghost Warrior.",
            "review_score": "-1"
        },
        {
            "review_text": "I think this game is way to much a regular fps, rather than a sniper game like the Sniper elite v2",
            "review_score": "-1"
        },
        {
            "review_text": "Played it on XBOX now on PC for couple of hours... Not recomened because of the level Kasserine Pass because if you play it even a little bit different then 'great' developers thought you should you can't finish it (even when you eliminate everybody) because of some idotic bug. I'm realy sorry that I've paid for it, didn't play it for a while then I discovered this idiotic bug... played it 3 times and it cant end... I want my money back, but I've played more then I can to get a refund.  In short don't buy this game, unless you want to leave it half finished. I wont even go to AI because its really bad for the game I've paid this much.  Avoid this developer if you can... and you can its your money :)",
            "review_score": "-1"
        },
        {
            "review_text": "brought this game for $50, multiplayer sucked balls and single player was short. now it's $10? GG",
            "review_score": "-1"
        },
        {
            "review_text": "Utterly disapointing, in most situations a normal weapon would do a much better job since everything &gt; 100m distance is blocked with invisible walls :/. The only point it makes is showcasing why long range weapons don't work well on close distances...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is waste of money... After fiddeling with the mouse sensitivity, it's very hard to move your sniper around. Sniper Elite V2 was good. And if you sprint, you need move your mouse like hell to make him do turns. Try get on a ladder is not what it should be, Enemies are superstupid. They just looks at you for some time before they start to shoot sometimes.   Do not buy this ♥♥♥♥♥♥ game!  *Uninstalling*",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely horrible community. And by community, I mean every server host out there. Most of these morons either do not possess the knowledge or are just a bunch of butthurt cry babies. Almost every server requests that the players have their steam profiles on public. Its never stated in a rule. But the second you lead in k/d, you will be banned if its private. They literally just want to snoop at your friends and community. I'm sorry, but that harrassment is not allowed by Steam's standards, hence the option for privacy. The community is lead by sore losers and cry babies. Console COD players with unregulated authority.   The community killed this game. THE COMMUNITY. Besides these fools, the game is great.",
            "review_score": "-1"
        },
        {
            "review_text": "THE MOUSE ACCELERATION IN THIS GAME RUINED IT&gt;WTF ARE YOU DOING? this game was fine when it came out then these ♥♥♥♥♥♥♥s started putting pop up ads for there games in the startup of this game. it even opens a steam window. and guess what i already bought those games and it says purchased but still pops up. Since then the dummys decided to update and breack the mouse settings for both Sniper elite V3 and sniper elite 3. Both have pop up ads now and a consol worthy update that compledly broke the mouse in a sniping game. it has mouse accelration turned on automatically. you cant even navigate the main menus now what a waste. I used to love these games now coming back to play them and they are ruined. i am uninstalling them both now because i cant even navigate the menu to start multiplayer. on either game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game also have the dumb habbits that enemies are imortal, and can take 2 shots in the head from a distance shorter than 10m...",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "not worth 50$. Rebellion half ♥♥♥♥♥ it, it ends after only 8 missions and you have to buy weapons that you should have been able to get right off the bat. the only way i would suggest you ever buy this game is if its at least half off. no more.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is poor. Sniper Elite 2 was much better, but in all honesty that isn't saying much. The following reasons are why this game is terrible and should not be purchased, or redeemed for free as I have.  1. Broken movement mechanics: There is horrible mouse acceleration which cannot be adjusted and makes movement very difficutl. 2. Broken Shooting mechanics. I play on Sniper Elite mode as well as realist mode. Aiming over a targets head and compensating for bullet drop was not consistant. Slightly shooting over their head then compensating by a little made me shoot the target in the lower chest or pevlis on many occasions. Bullet mechanic are broken. 3. Beyond repetative. Increadable linear battlefield. Terrible AI. Increase in difficult turns up the speed of the AI aimbot.  The Positive: Xray vision on shooting people is a cool and enjoyable aspect. For about 30 minutes. And Since Sniper Elite 2 has the exact same Xray, set in the European Theater, with much less buddy mechanics. That is the game you should choose if you want to just destroy people with xray bullet cams.  I will try to suffer through a few hours of gameplay just to make this review more respectable.",
            "review_score": "-1"
        },
        {
            "review_text": "Well,I must say...I WAS enjoying this game as much as V2 until when trying to reload a save the game loaded at a point that just informed me that I am now visable and then the game went to menu.After a 4 hour level playthrough(I take my time)I was asked to restart level.Nah,let's not and say we did.Deleted immediately.Too bad also...I really like the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Unable to pass any mission duo to HOROBLE mouse controls, different sensitivity when you walk different when you sprint, when you aim, when you zoom in. Sens X is higher than sens Y OMG and above all that you have to bind keys for pick up, use, search corps, etc. on different button. IT'S ♥♥♥♥ING ONE ACTION but no not hear, it's ♥♥♥♥ing awful, AWFUL. Worst ♥♥♥♥ing game I played even FEAR 2 is better and FEAR 2 was ♥♥♥♥. Refunded.  Oh yeah and there is achievement; to completed you have to own all Sniper Elite games where only good one is the first and that one you have to rebuy it if you have non steam original version, ♥♥♥♥ you rebellion.",
            "review_score": "-1"
        },
        {
            "review_text": "just the same Sniper Elite 2 only diff is graphics only. not very interesting story line!",
            "review_score": "-1"
        },
        {
            "review_text": "I've played all the other Sniper Elite games, but this one is for me the most challenging, but not because of good design or a relentless AI. This game is built around shooting people in the face from a distance. It is what this game is good at. Seeing the brutal X-Ray killcams is quite satisfying, but all the three maps i've played so far have been small encampents with lots of hiding spots (for enemy soldiers) and no real high ground. The stealth is frustrating at best, forcing you to move from place to place with every two shots with your rifle, or force you to use the Welrod, which in game has about 10 meters range. On higher difficulties the enemy can spot you through tiny cracks in sandbags. The movement in the game is pretty clunky, and your camera seems to be stuck on your right shoulder, making peeking around the left side of a corner very difficult. The game is about sniping, and that part is well put together, but the moving around and the stealth elements are not very well made, and it makes it a chore to get through the missions, because i want to snipe, but unlike in Sniper Elite V2, i have yet to be instructed to climb something tall and shoot someone important in the face. The sneaking around and running away from alerted guards makes up for about 70% of my play-time. The rest is shooting people in the face in slow motion.     Pros:",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes after less than five minutes and reboots windows.",
            "review_score": "-1"
        },
        {
            "review_text": "I found the game amusing enough until the more into it I got the mouse lag subtracted what there was to like about it.I noticed it from the beginning of the first campaign but kept trying. It's an alright game and is paced for taking one's time to plan ahead before initiating an attack,but on the third campaign I entered the fortress and my instincts and mouse control became defensivly useless. Not the kind of mouse control I would like to have and so I wouldn't recommend it. The sniper graphics are emmensly cool I don't understand why they let the mouse lag ruin the game.When it's a life or death situation and you can't aim to save your life because the mouse lag is viral when you really need it,'What more can I say.'",
            "review_score": "-1"
        },
        {
            "review_text": "*Anti-Tank Mine blows up on tank* *Tank instantly is alerted to your position*",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of issues with it crashing for me. Besides that the story was really just not interesting or fun. Run here, kill / destroy something evac for 8 missions with some optional destory or kill somthing's along the way. I really was not as interested in this one as I was with the previous two.",
            "review_score": "-1"
        },
        {
            "review_text": "  WOW i sure am glad i waited for the free weekend to play. for a game that is this old that SE4 is comming out in 4 months it has a ♥♥♥♥ load of buggs and glitches. the AI is absoloutly not relistic at all. either too stupid or can see threw walls and ♥♥♥♥. honestly this game is not even worth $10 at the sale price. the company must be hurting pretty bad and need some extra dough to put out the sequal. and the sequal looks almost the exact same except for xray kills. woooo hoooo...... :(.  over all i dont recomend it to buy. its a fun free playthrough but already 4 hours in and im kinda board of it all allready... bummer really. this company should have gone in a diffrint route rather than making the same game 4 times in a row and just improving it to what it should have been day one. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Good for the first part of the session then got heavily repetative, tries to encourage being 'stealthy' yet this does not work at all, one person see's you and every single AI knows your exact position no matter where they are on the map, speaking of which the map designs although they look pretty, are laid out horribly, the difficulty in this game is trying to figure out where to go next from the obscure waypoints. Total let down of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "  Enemies have ridiculous vision, even on second lowest difficulty. Don't try campaign.",
            "review_score": "-1"
        },
        {
            "review_text": "the second Sniper Elite was ♥♥♥♥ and unrealistic, this is ♥♥♥♥ and unleastic, I don't feel like wasting my time on a review but this is basically the whole game. Use silenced pistol and knife more than your sniper rifle. Don't get me started on the submachine guns, its pathetic how unaccurate they make them in an attemp to get you to sniper, which is practically impossible unless something is blocking out your sound I'd give it a 5/10. Don't spend more than $20 on it.",
            "review_score": "-1"
        },
        {
            "review_text": "good for a few kills then boring",
            "review_score": "-1"
        },
        {
            "review_text": "Can't even start up the game anymore...",
            "review_score": "-1"
        },
        {
            "review_text": "Really just... incredibly dull and not fun. The levels are poorly designed and the enemies aren't challenging and the storyline just isn't all that great. Coop mode isn't a whole lot of fun either. The game is just not amusing enough to keep playing. It's just not any improvement over Sniper Elite 2.  Go play Sniper Elite 2. It's more fun, and can be gotten on sale for much cheaper. This one just isn't fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth it. There's online like 10 servers, and if you're not in the US, they'll all have above 300 ms of latency.  In other games that might not be that much, but in a game where precision and accuracy are key, it's a dealbreaker.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't really play it. There's always a problem occuring when im opening the game. SML",
            "review_score": "-1"
        },
        {
            "review_text": "Yes this game does look fun and it might be fun in your opinion but in mine it's extremely boring. The coop might be a different story though. Any way this game has the worst checkpoints the levels are too long. Combat is crappy, glitches left right and centre. If u wanna buy this game buy it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Not as fun as Sniper Elite v2 .",
            "review_score": "-1"
        },
        {
            "review_text": "I got VAC ban for Family sharing.  I played just 2hours like 2 years ago .  Whoa Thanks !",
            "review_score": "-1"
        },
        {
            "review_text": "  I find it etnertaining, but the lack of logic in the A.I is aweful, the story its but a excuse for thr campaign, and the more i play it, the more i want to play MGS the phantom pain, definetely its not a bad game, but it lacks of the magic that makes it desirable, just 5/10 so sorry, i really wanted to like it, bit i just couldn't, at least for me, a game must be critiziced by its campaign, so you might enjoy it or you might not, my final veredict its a total meh... the X-rays are awesome btw!",
            "review_score": "-1"
        },
        {
            "review_text": "They ♥♥♥♥ed up",
            "review_score": "-1"
        },
        {
            "review_text": "this game is so bad ........dont buy it pls............!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't work on Windows 10. Freezes and autocloses everytime you die.",
            "review_score": "-1"
        },
        {
            "review_text": "Played the game with a friend, it took 7 hours to beat the campaign including DLC, waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "designed for the console, ♥♥♥♥ even with a controller, please dont waste your time with this game",
            "review_score": "-1"
        },
        {
            "review_text": "im not playing this game agian unles the constant client crashing is fixed even when i was in pvp itd just stop working randomly like 5 min or less when ingame matches .",
            "review_score": "-1"
        },
        {
            "review_text": "  Pros +++ &gt;awesome derpin drag doll phsyix &gt;fabulouso snipin poz's &gt;less rifles dan snipper leet dos &gt;extroverted enemys always up 4 a chin wag &gt;walk across a map to bury sterotype britbong &gt;forarm is critacal shot area &gt;break generators   Cons--- &gt;there was enough room for Jack and Rose both ",
            "review_score": "-1"
        },
        {
            "review_text": "You can't date anime girls in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like camping and waiting then this game is for you. No but for real it's trash.",
            "review_score": "-1"
        },
        {
            "review_text": "Cant even play the game as for some unknown random reason it has just stopped working",
            "review_score": "-1"
        },
        {
            "review_text": "lms if u think rebellion are a bunch of gays lmao",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I was fan of Sniper Elite series pretty much since the first one came out. I always loved the physics and the stealth factor of the first game of the first game, and so I expected it in the second one too. And we all know already how bad Sniper Elite v2 was, with its ridiculous physics and stupid enemies. Rebellion said they realized they made a mistake and that the Sniper Elite 3 will be better. Yet, you still feel like throwing beans on the enemy when shooting on any other than point blank distance. The enemies seem even more dumb than in the v2. After you kill someone (loudly and visibly) all the other soldiers seem to do is get ,,suspicious' for like half a minute. Then, the alert phase wears off and they come back to normal, as if nothing really happened. Next problem is price and DLCs. For the price of 39,99€ you get about 7-8 hours of gameplay, which is just not worth it. And if you want more: DLCs. And DLCs cost more money. And the last thing, though there might be problem on my side: multiplayer. Ignoring the fact that if one of your friends doesn´t own the game, you will have a really hard time finding someone to play with, the multiplayer is extremely laggy and glitchy.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself isn't that bad but it isn't really any better than V2 and then I found out about the $65 of DLC after it's been out like two months... I can't recommend that kind of crap to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "Was new and intresting the first couple of days. Game got repeative and slow. If you are looking for a slow stratigic game, then this is for you. If you are looking for a fast pace action game, steer clear.",
            "review_score": "-1"
        },
        {
            "review_text": "The good: Good graphics and audio. Large maps. That's it.  I gave Sniper Elite v2 a passing grade because it was, despite the bugs, still fun game. This one however is even worse with bugs and glitches. Some are absolutely game breaking. For example if you save on Oasis level right before the part with the three officers you cannot load that save if something happens. You will instantly fail mission.  As in the second game in this the enemies are still able to see you through walls. There is no indication as to how far the enemy is so how the hell can I adjust my aim. This broke the stealth for me.  I got to give them credit for creating so much extra content, but all the glitches and Inconsistencies with the aiming and AI are game breaking for me. I've resorted to treat it as just another arcade shooter. I just run around and kill everyone like I would in any brain dead shooter. This isn't why I wanted this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad graphics, a little communication in the game, not enough ammunition.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes at the multiplayer menu. Known issue and no fixes. I purchased this so that my wife and I could play coop together like we had in Sniper Elite 2. Too bad Steam denied my refund request because I bought the game too long ago.",
            "review_score": "-1"
        },
        {
            "review_text": "Well , this was my first Sniper in this series so not any comparison I can do with the older ones. I liked the graphics very much , however just 8 levels to play.. that is totally not what I expected. And even in the last level I was still collecting more gun parts, I wonder to be used when,   Overall ,, even with good graphics , this game is only worth 15$.  ",
            "review_score": "-1"
        },
        {
            "review_text": "hell no so boring 2 me #1 is way better",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game. If you hate third person view... DO NOT BUY THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "The only real reason to enjoy this game is the co-op mode. Graphics are mediocre, gunplay is almost unchanged from the games before. The campaign is only 8 levels long, and most of your gear obtained by leveling up will still be locked after you beat the game. Who the f*** balanced this?  Apart from that, a lot of connectivity issues in multiplayer co-op with people just dropping from the game, forcing you to abandon the whole mission and start over. A reported issue for more than a year and no fix by Rebellion.   Story is laughably bad, even for a sniper game, and a lot of gear and missions are locked behind another dlc paywall.  I couldn't believe they tried to sell this game at 50 Euros on release.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid for the game, downloaded the game, and it will not even start! Tried about twenty times and nothing! Asked for a refund and they refused! Waste of money, do not buy!",
            "review_score": "-1"
        },
        {
            "review_text": "I have to say that after playing Sniper Elite and S.E. V2, I find the kill cam in S.E.III not nas good as in V2 and another thing even when it looks like you have a clear shot theres crap in the way even if you can't see it. I thought being a newer game that the game would have been better and the way he moves kinda sucks. I hope in the future if they make S.E.4 it will be done allot better.",
            "review_score": "-1"
        },
        {
            "review_text": "Repetitive and not challenging at all, boring story, slow gameplay and only half decent graphics, multiplayer vs was pretty good at release when there was a lot of people playing but now there is no reason to ever buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Currently, this game breaks my PC. If i play it for more than 30 sec, my pc crashes and freezes up, which is odd because I can run this game at ultra.",
            "review_score": "-1"
        },
        {
            "review_text": "That game use to play well now it's hell it refuse to play and support is eseless steam???",
            "review_score": "-1"
        },
        {
            "review_text": "Simply wont launch...",
            "review_score": "-1"
        },
        {
            "review_text": "i spend 5 hours to load and it ****ing crashs its a good game but wy?",
            "review_score": "-1"
        },
        {
            "review_text": "hell no so boring 2 me #1 is way better",
            "review_score": "-1"
        },
        {
            "review_text": "Generic 'stealth' shooter. Boring after 3 maps. Not worth full price, rather buy on discount. DLC not recommended, only the extra missions.",
            "review_score": "-1"
        },
        {
            "review_text": "Congrats, you've managed to make your game unplayable. You can't even switch shoulder perspective.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesnt' ♥♥♥♥ing start. Waste of money. And upon investigation online to see if there were any solutions i found many, many others have had the same problem. I've tried checking files half a dozen times, re-installing, everything i can think of and nothing.   Do not waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd like to recommend this game because I liked SE2 a lot but I can't. Well not really wholeheartedly at least. Here's why.: What would make me recommend it is that it looks good and the open levels are great. You always have a couple of different ways how to go about the job at hand. But that is about it. What I disliked: I) The story is dull and of no consequence for the gameplay. II) The AI is non-existent. If you shoot somebody while noise-covered dead bodies (or missing comrades) will not be noticed of until some other NPC virtually stumbles upon them. When you're detected shooting you basically run away a bit and everybody will soon get back to routine and you can continue wasting them away as before. And even if there alert and know where you are - a sufficient cover enables you to wait them out and take out one by one when the peak or advance. III) With all the tactical aid given, like tagging enemies and the red square indicating where your bullet will go and such even the Sniper Elite difficulty is too easy. WAY too easy. IV) Playing in Authentic mode IS on the other hand a challenge. And I was just beginning to like the game for it. I played through in Sniper Elite and wasn't really satisfied but thought I'd give it another go. And it started out well but for the single and all-shattering fact that you can't save your progress (no way!) while on that difficulty. This is ridicoulus. (Especially since you get those hints while loading where one of them says something like 'Save often!'.) What is the assumption of what my day looks like? Whenever I feel like playing SE3 I of course have a couple of hours of uninterrupted playtime at hand? I'll bet you no one makes it through the larger areas in this difficulty with the first try. And if, one would have to be extra, extra careful. So it takes time. And sometimes one gets interrupted. But you have no way of saving and thus have to leave your computer running for hours until you return to the game or start over after you just invested more than one hour to reach the point where you currently are. This is stupid and also very environmentally damaging, having computer run for nothing and consuming power all the while because you are not allowed to save your progress. Also it tends to frustrate me immensely when I have to do things over and over and over ... and over again only because I'm unable to save my progress when I made it. Everything they seemed to have understood anout that in the easier levels they threw out the window in Authentic.  In conclusion: The levels below Authentic are too easy and I can't recommend them for a challenge. The level Authentic denies you the right to save your progress and is therefor (though fun to play) too timeconsuming since you have to play through a whole huge area / a sin against the environment when one is forced to keep the computer running endlessly just to be able to continue at the last point one reached / too frustrating when within a huge area you enter a new smaller section that you want to begin to explore and get killed in the attempt being forced to replay the last maybe 45 minutes up to that point.  I just deinstalled the game and think it is a pity. But it felt like I was given the finger everytime I died. I thought I could actually here the developers laughing...",
            "review_score": "-1"
        },
        {
            "review_text": "I really like sniping and the game dont look that bad but I think its insulting to us pc gamers to give us some handcontroll setup, I would like to call it a cheap and lazy console porting and it sux. If I play on pc I want to strafe and when I press backwards the caracter should not turn around and walk towards me its just plain stupid. So if you like me hate lazy crap console porting get it on a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is horrible by any modern day game standard. Very limiting in the way you can approach each misison. I feel like there is only one or two locations to take your shot and and only one way to prevent the enemy from hearing. (by a generator or thunder). Very disapointed. Glad I only payed 10 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "game keeps crashing my computer after 2 minutes of playing it, did some research and im no the only one with people exp the same issues... tried everything from turning off supersampling and all the filters, even run it on LOW settings and lower resolutions but it still crashes and when my computer restarts the fans turn off again at full capacity.  I have no problems running Ultra settings on other games...  my specs are AMD FX-8320 8 core processor, 8G ram with a GTX 560 oc edition running at 4 GZ  ",
            "review_score": "-1"
        },
        {
            "review_text": "pure garbage it feels even worse than a free to play game, glitchy gameplay, soo unpolished.... dont waste your time, sniper elite 1 and 2 are way better trust me.",
            "review_score": "-1"
        },
        {
            "review_text": "Slightly more disapointing than Watch_Dogs",
            "review_score": "-1"
        },
        {
            "review_text": "Neh, x-rays are fun for 15 mins, then the game get's boring",
            "review_score": "-1"
        },
        {
            "review_text": "First level, kill first two spotters no problem. Trying to kill remaning spotter, except every time I use empty lung, the spotter is 'obstructed' even though there is nothing even close. I've tried aiming from many different spots, and it always claims its obstructed.  How is this bug even a thing? Game released in 2014... I FINALLY was able to kill the guy after about 100 or so shots, finally one GRAZES him, because any shot that actually was aimed AT him somehow is stopped.",
            "review_score": "-1"
        },
        {
            "review_text": "- I hate it when enemies spawn behind you in places you've not only checked out but also mined off enough to blow up the entire map.  The bullet camera gets tiresome REAL fast. Extremely few snipers and weapons in general. DLC that gives you things that should've been included in the main game, such as more snipers.  Story is the bare minimum.  + I would've given it a recommend regardless of all these things... if it also didn't cost a small fortune (45.99€ at the moment) for such an unpolished game. The gameplay, albeit somewhat inconsistent and extremely repetitive, is alright. You can turn off the bullet camera.",
            "review_score": "-1"
        },
        {
            "review_text": "Bit of a letdown to be honest , SE2 was better. The AI in this game is abysmal. 20 dead bodies lying around, explosions going off everywhere... lets just return to our patrol pattern after 30 seconds, no word about your dead comrades everywhere. They do find dead bodies but this doesn't seem to mean anything.  Only one map did I have an alarm go off and reinforcements sent.  Also, The ending was not good enough, the main bad guy was not written or voiced acted well. Only got to face 1 Tiger tank in the whole game! Not much of a challenge.  Glad I only paid around $10 for this, I would be disappointed if I paid full price.",
            "review_score": "-1"
        },
        {
            "review_text": "  Idk...  Its really harder than it looks and omg the ''Relocate'' is so SO annoying!!! Thats the only thing I hate in this game!!",
            "review_score": "-1"
        },
        {
            "review_text": "Pros cool bullet cam cons very short story many bugs and glitches empty mp servers most mp games are unbalanced with one team winnign by a blowout",
            "review_score": "-1"
        }
    ]
}