{
    "app_id": 238050,
    "name": "The Apogee Throwback Pack",
    "release_date": "2013-07-01",
    "developer": [
        "Interceptor Entertainment"
    ],
    "publisher": [
        "Apogee Software"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 16,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 198,
    "negative_ratings": 20,
    "price": 6.99,
    "description": "The Apogee Throwback Pack is a collection of four classic Apogee Software titles all in one kick ass package. Blast your way across the galaxy as British Special Agent Blake Stone in &quot;Aliens of Gold&quot; and &quot;Planet Strike&quot;, then take on an ancient evil menace as the H.U.N.T in &quot;Rise of the Triad&quot;.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/238050/header.jpg?t=1464639351",
    "minimum_requirements": "OS:Windows XP or Vista Processor:1.8 GHz Memory:512 MB RAM Graphics:Direct X Compatible GPU DirectX®:9.0 Hard Drive:100 MB HD space Additional:If you can't run these games, then you might want to upgrade your toaster.",
    "recommended_requirements": "OS:Windows 7 Processor:1.8 GHz Memory:512 MB RAM Graphics:Direct X Compatible GPU DirectX®:9.0 Hard Drive:100 MB HD space",
    "reviews": [
        {
            "review_text": "I'm not saying Blake Stone is the inspiration for Deus Ex, but you do murder a lot of people for candy bars. Just sayin'. JUST SAYIN'.",
            "review_score": "1"
        },
        {
            "review_text": "While I do recommend this pack for the games that it comes with for the price it's at, I can't recommend you buying it if you're looking to get all of the Apogee games in one place, in which case I direct you to  3drealms.com  which sells the 3D Realms Anthology, containing more or less all of their games with a few omissions, though at a higher price. It doesn't include Extreme ROTT though.",
            "review_score": "1"
        },
        {
            "review_text": "4 Apogee classics all in one pack.  The two Blake Stone games, Rise of the Triad, and EXTREME Rise of the Triad.  Four of the most underrated fps' in existence. Blake Stone might seem archaic, but it's fun after I gave it a try. It's pretty similar to Wolfenstein 3-D  ROTT is the big grandaddy in this pack. Tom Hall's creative genius shines in 5 playable characters, gibs (in the Wolf 3-D engine), fun level design, and a load of other ♥♥♥♥ I can't list here.  Buy this pack right now and experiece Apogee's lesser known fps'.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome pack of games if you like a worthwhile nostalgia trip. This pack include Rise of the Triad, Extreme Rise of the Triad, Blake Stone aliens of gold and Blake Stone Planet Strike! They play very much like DOOM or Wolfenstein 3D its worth looking into :)",
            "review_score": "1"
        },
        {
            "review_text": "Simply awesome.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played Blake Stone or Rise of the Triad, what the hell are you doing with your life, you casual?",
            "review_score": "1"
        },
        {
            "review_text": "Personally I think this a great classic for any of the new people who want a look into the good old 90's  Rise of the triad your post poned and then cancelled Wolf 3d sequel redown and made into something different Extreme Rise of the triad some good and bad level design it's really a side option. Blake stone a different take at the wolf 3d style of games. Planet strike more of a sequel balanced stuff and highly recommended. ",
            "review_score": "1"
        },
        {
            "review_text": "     The Apogee Throwback Pack",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend to try this out just to see how far games have come.",
            "review_score": "1"
        },
        {
            "review_text": "Great game selection. classic games that i remember enjoying for hours when was many years younger... total shame that there is no StreamOS/Linux Release!",
            "review_score": "1"
        },
        {
            "review_text": "Thumbs up for classics, thumbs down for key binding. It was dece (5/10)",
            "review_score": "1"
        },
        {
            "review_text": "the apogee throwaway pack",
            "review_score": "-1"
        },
        {
            "review_text": "Oh the 90's where have you gone? These games are like Doom but in the same way they're different. Classics strait-up classics.",
            "review_score": "1"
        },
        {
            "review_text": "Classic and well worth it if you enjoy games like Doom and Wolfenstein 3D. :D 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Four Apogee classics in one fantastic bundle. Rise of the Triad alone is worth the 9.99, but add in Extreme Rise of the Triad and both Blake Stone games and it gets even better. All fans of classic FPS's should give this pack a look.",
            "review_score": "1"
        },
        {
            "review_text": "Rise of the triad is an achivable game. An old sooter with some sillyness. Extreme Rise of the triad is the same plot but totally different levels. It's too hardcore, I had to cheat since episode 4 started, it was almost unpossible, too much save-load to beat the game without them, unrewarding. I enjoyed the last levels watching how they were designed and beating just the puzzles.  I haven't still played the other two games.",
            "review_score": "1"
        }
    ]
}