{
    "app_id": 238240,
    "name": "Edge of Space",
    "release_date": "2015-09-17",
    "developer": [
        "Handyman Studios"
    ],
    "publisher": [
        "Reverb Triple XP"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Sandbox",
        "Indie",
        "Adventure"
    ],
    "achievements": 24,
    "positive_ratings": 996,
    "negative_ratings": 1647,
    "price": 10.99,
    "description": "Suit up as an operative of the Ark Corporation, sent to the farthest reaches of the universe in search of habitable planets to terraform. However, after the long space journey you awaken from cryosleep to find that your ship has gone way off course and is disabled near a strange new world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/238240/header.jpg?t=1447357846",
    "minimum_requirements": "OS:Windows 7 Processor:2.9 ghz or higher Memory:2 GB RAM Graphics:512 MB Video memory DirectX®:9.0 Hard Drive:900 MB HD space Other Requirements:Broadband Internet connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Looks like I got this game on July 9, 2013. Today the game came out of Early Access as v.1.0, and unfortunately, the game is still rather hard to digest.   When I first played, the game had a few graphical issues, and it looked like it could have needed something like an editor to an author. Fine, I could always go back to it - though at this point I was beginning to regret buying this. At this point (and a couple subsequent playthroughs), I felt the game was not intuitive, unfriendly to beginners, and rather difficult for a game where you literally build your character to advance. Gathering materials? The laser pick was extremely weak and could not be as easily manipulated as Starbound's (as much as I don't like comparing, especially to Starbound). I took a long time gathering enough supplies (after dying a few times, some from mobs in the starting area and some from falling off the edge of the map) to make anything. Also, while the game no longer has the difficulty (sort of...) and the 10 free respawn limit, those things severely discouraged me from doing anything. So I waited.  Today, I opened the game with no expectations of things and found myself facing similar issues from the first time I played. The UI needs a lot of work - this doesn't look at all like a modern game with a futuristic setting - the dialog boxes look like just hastily placed rectangles and fonts (I spotted some serif fonts...) look like they were not even picked with intent. Some of the tips need editing in syntax and grammar, and overall, the game feels very much like a beta still. I wasn't pleased by the 'tutorial' either, since the first thing I saw was a codex full of unnecessary text.  Nothing in the game has struck me as intuitive so far, even regarding the gathering of materials. I got the DLC items and the pick is marginally stronger than the starting one, and while it's got a wider beam (3 tiles wide), the width becomes useless because the pick target cannot be directly chosen - so if you just dig downward, for example, in the same direction, you just end up with a 1 tile wide chasm, walls either damaged or already 'healed' to normal. Everything seems so grindy already - I know that games won't have you start off with good gear ready to kill bosses, but in the first quest of the tutorial, each one of those enemies (although they do no damage) took many hits to die. I don't see any fun in spending minutes killing common mobs (because face it, you're gonna attract aggro for all those missed attacks and some of those enemies move too fast with the starting rifle) and then spending minutes gathering.  I'm going to pass. Sorry, I tried, but more than 2 years did not give sufficient progress for me to enjoy this - too grindy and too unpolished.",
            "review_score": "-1"
        },
        {
            "review_text": "So here we are....finally at 1.0 and we still feel like we are in a beta.  The game is laggy, choppy, the sprites clip and glitch around, the physics are wonkey for gravity (shoot enemy they fly straight upwards?), it's such a mess at the start. Their idea of a tutorial involves talking to a flying shark and gathering stuff.....it's very dull.   I'm sad that waiting for nearly a year on this resulted in this mediocrity. Stick with terraria, this feels like a generic knock off terraria in space.",
            "review_score": "-1"
        },
        {
            "review_text": "I have stayed away from this game for a while due to its low ratings, but decided to buy it during the christmas sale. I wanted to play it for myself to see how it was. Here are my thoughts from just an hour and a half of playtime.   Pros: + Has something like a main quest line + Has mini events that appear on the planet, with objectives + Has a crafting system with trees that look like they have a reasonable amount of items + Has an npc with a bunch of dialogue, uncommon for this genre + Has a strange (but interesting) artstyle that reminds me of AVwW, but a little different + Some of the equipment looks well drawn, and very nice as future outfits  Cons: - Crafting system requires large amounts of materials to make mundane or low tier objects - Enemies and destructibles drop lots of loot and it feels like my inventory is weighed down with junk just a few minutes into the game - The tiered system for items/crafting isn't intuitive or sensible (other than weapons/tools named 'Mk. 1', 'Mk.2', etc.) - The tiers locking you out of building or crafting some items feel arbitrary despite being in an already arbitrary game setting - Mining the necessary materials for the beginning quests or items is very slow, boring, and repetitive; it's so unengaging that it feels like busy work - Mining laterally is A PAIN at times because the laser eminates from your upper chest and you can't mine a straight line below or above that level due to that constraint - you have to mine extra blocks to get line of sight for your laser (which technically makes sense, but this isn't real life and an arbitration could be made here, even just letting us CROUCH would fix half of the problem) - Moving the character is clunky, you stop on a dime and using the jetpack arrests upward movement to begin a slow acceleration upward (but using the jetpack to slow your fall does very little to slow you unless you were already falling at a slow speed) - The npc with dialogue is annoying, makes annoying sounds each time you respond to it, and doesn't help you with the early game much other than telling you what the tutorial pane (accessed with the U key) does. - Several parts of the game are very arbitrary, like being magically unable to mine in an event area until you complete the event (but then able to mine with no problem afterward)   Conclusion: The game almost has the barebones of a sandbox crafting adventure game, with what looks like a reasonable amount of content added in. But content doesn't make a game, it only adds to it. The base gameplay, the platforming, the item collection and crafting, just feels bad. It does not feel finished. It feels like a prototype with extra content.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game around the time it first came up on the steam store as an EA game hoping for a terreria in space. Not much has improved since then. The game is still full of game breaking bugs and the game feels empty, barren, and unfinished. Also it turns out the the devs slapped a 1.0 on this turd called it a day and disappeared. Don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "The most dissapointing part of this game is that theres proof that it's went to $41T, ingame if you click the steam rewards button, it would originally take you to a place to redeem codes for exclusive items (see hollow gear and greenlight helmet) now if you click that button you are taken to a 'website for sell' domain, So, i originally left an unhelpful and stupid good review on this game, i've since deleted that review and this game from my pc. This game is far from finished and seems to be abandoned, though it is a good sandbox, and good for people who want to build, but I suggest starbound for better building. it's sad and such a shame that this game had so much potential and has since been seemingly abandoned even though the devs say it's not...I hope they're truthful as I'd like to see this game become more than it is. but i've had requests to update this review to be more helpful, thus pros and cons will follow:  Pros +Questing system +Story and Background +Dungeons, Events, Etc. +Npc's must be found around the world +Unique fragmented world, and the further you drop the tougher it gets +Unique and fun research/upgrade system +Challenging, and fun pass time +Sandbox +(to my recolection) you loose nothing upon death (maybe a few research points if that, correct if wrong)  Cons -Seemingly Abandoned (the devs say it's not, I hope they're right, explained in comment) -No more exclusive/event rewards (unknown if will return, see greenlight helmet and hollow armor) -Repetitive -Quests can progress faster than you (power, level, distance wise, etc.) -Sometimes a bit too challenging -...as of right now, I can't think of any more  so untill this game is back to updating and no longer seems abandoned, this review will remain negative, (I would chose neutral or abstain if possible because this game can be fun sometimes)",
            "review_score": "-1"
        },
        {
            "review_text": "Game had a lot of potential but it was rushed to 1.0 then apparently abandoned. Lots of unfinished features and bugs. If the developers ever come back I'll reconsider this review but until then, play Terraria or Starbound where you can get some developer support.",
            "review_score": "-1"
        },
        {
            "review_text": "Last update in April 2016, dead-end project.",
            "review_score": "-1"
        },
        {
            "review_text": "yeah... where'd you guys go?",
            "review_score": "-1"
        },
        {
            "review_text": "Eh. That is the one word to describe this game.  It is an ok Open-world, sandboxy game, the areas are different, the enemies are kinda cool, the boss(es? I have only seen one) is/are ok. So when you start, everything seems like it will be good...BUT this game falls short. After playing for about an hour you will be bored as hell, you have to grind a huge amount for anything, missions are stupid as they don't work very well and all armour, upgrades, etc feel the same. No weapon seems unique or fun for that matter.  This is coming from someone who has not played with friends, maybe it is a really fun multiplayer game? I don't know but If you want to/ think it looks fun then give it a try but I wouldn't recommend it too much.   I really want to like this game and recommend it, but I just can't. It has too many issues.  5/10 Fun for a short while then gets boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game has been abandoned and left incomplete by its developers.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has come a long way since when it started in Early Access. It is now the first 1.0 'Official Release'as of last week. I'm a thumbs up but if you read my full review you'll see below what can be impoved on as well.  I've stuck with this game and I still enjoy it. It is a crafting, exploring game in 2D... but it's in space! And if you like space games that are open world and exploritory, I think you'll find this one not to like. The are lots of materials to search for, interesting knowledge tree to work towards for crafting new gadgets and gizmos, and plenty of creepy monsters and weird vegetation to learn about. So if you like figuring out the unknown, you'll like this. It's kinda like Terraria, Metroid, and Star Trek blended together, with a dash of Avatar but something kinda unique too.  The Edge of Space development team says they will keep improving this game post release and I hope they do.  3 things which need some immediate attention by the development team include:  - The game engine processes data and movement too slowly compared to other games in this genre. The result is that movement is slow and battle can be clunky for game play. I don't think this is my processors' or video card's fault as I play similiar games with even better graphics and gameplay, without so much latency. Maybe the coding could be tighter / more real time. Seems like a lot of processor overhead going on.  - The opening movie is pretty untelling still. It's better now that it's 1.0 but this is supposed to be the intro to the adventure. The user doesn't get a good sense of what the background story is and where they fit in. And what's with the other 3 organizations with different symbols? Are they competitors or allies? Are they the Ark Corp council? Are they the ones who blew up our ship or was it an alien war? It's hard to tell and it shouldn't be.  - The addition of Fineous the Shark has helped teach new players (and older ones) what the controls and game mechanics are. It could be a little more obvious though. Probably the best way is to make sure the Codex has more content and the user knows right away that this is their one stop shop for learning about their new world, and how and what an agent of Ark Corp is supposed to do and try to acheive. Some more work on the goals of the game are needed. The Codex should be like our 'Hitchhikers Guild to the Galaxy'; everything you need to know when you thunk on a new planet in a Cryopod without any friends or contact with where you blasted off from, after a long cryo-frozen nap. I like the sense of humour though so far; keep that going.  That's my thoughts on this game so far. I recommend, as long as you don't expect perfection just yet but I think it's worth supporting and playing. It's fun and interesting to explore.  This Review was written Sept. 20, 2015. ",
            "review_score": "1"
        },
        {
            "review_text": "My question is how is this game still being sold when it is DEAD? At the least Steam should tag is someway so people are not dumping money into it. This and StarForge is why I am done buying early access, you think you are helping them make a better game but it is a scam to get the game to full release with minimal features then run. Starbound I bought when it came to full release and I can say that is a viable alternative to this.",
            "review_score": "-1"
        },
        {
            "review_text": "  Play Starbound instead. I got to play it in it's beta stages before it got on steam and it really wasn't that good.",
            "review_score": "-1"
        },
        {
            "review_text": "feels unfinished",
            "review_score": "-1"
        },
        {
            "review_text": "Those who are willing to put in the time to explore the world of Edge of space will find a colossal amount of content just waiting to be discovered and enjoyed. The sheer variety of weapons, deployables, pets, mounts, materials, dungeons, bosses etc is impressive, and although there are some obvious similarities to Terraria for instance, it is in fact a very different game. I would definitely recommend trying to find someone else who you can play with though, as it does enhance the experience a lot.  There is a sort of tutorial in the form of a friendly laser shark who asks you to do a few short quests to get you used to the basic mechanics of the game, but the rest is mostly left up to you to figure out, (there are instructions on how to do everything if you dig in the menu) and so a degree of effort is required in order to get into the real meat of the content. Once you do however, you'll realise just how much there is to do and discover.  Edge of space is very colourful and is graphically the equivalent of eating too many packets of Skittles in one sitting, the pallette is well chosen and easy on the eye, the art style is great, and everything stands out. Some players have complained about the lighting system but personally I haven't had any problems with it.   The music is great, very relaxing and suits the mood well. The best thing however is the splendidly warped sense of humour that the developers obviously have and that comes across not only in the design of the world but in many of the descriptions and explanations that are there to be read if you take the time (and I recommend that you do)  Gameplay is a lot of fun and some of the weapons in particular are extremely satisfying to use. I know I have only just started to scratch the surface but already I am enjoying flying around on a net full of jellyfish with a small glowing fox creature following me around and helping to light my journey into the planet's extensive cave systems.  In summary, if you like randomly generated 2D exploration games with crazy amounts of content and are willing to put in the time and effort required to get through the initial learning stages, then you will get very good value from Edge of space, even more if you can find someone else to team up with.",
            "review_score": "1"
        },
        {
            "review_text": "Prety fun so far. I was hesitant due to some of the mixed reviews but after watching a few let's play videos and reading some comments, I decided to pull the trigger. It's odd...It has flying sharks with lasers. But it's enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I have tried to give the game a chance and unfortunatly it has fallen short of playable. It hassome cool stuff but I find it really hard to get into mostly for the fact that it feels unpolished. The items, monsters, UI, all of it just doesnt have the fine pointlike Terraria or even Starbound.",
            "review_score": "-1"
        },
        {
            "review_text": "Devs more or less gave up when it was going relatively good for some non-existant reason. Ended up with the game being called finished, and to this day stains my steam library with it's presence. Gonna get it permanentely removed from my account.   once again; the power of early access magic.  Don't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game a long time ago and didn't care for it then, it's a been a year and nothing has changed.",
            "review_score": "-1"
        },
        {
            "review_text": "Let's start by saying I've been playing this game since it first came out on Steam. I also voted (before that) to have it 'greenlit'... Greenlighting a game in Steam means that out of several recommendations that Steam gives you for upcoming games they'd be willing to add to their service, you chose the ones you like best. Not all games actually make it!  It didn't take much to impress me, this game had it all. That's not to say it needs to improve highly, but the devs once promised there is a lot of updating planned for it. I really love this game so far, it has major potential.  Having played Terraria for some time, I knew this game would be a great addition to my Steam library. It has a long way to go, even after it was released to the public, there is a lot of content that needs to be added, and lots of bugs that need squishing. Nevertheless, I am looking forward to see that happen.  Still the best 'Terraria In Space' anyone could find!",
            "review_score": "1"
        },
        {
            "review_text": "Ive been playing this game for the last couple of days and i have to say that it is a phenomanally gameplay rich game filled with fun and engaging contenet. Alot of people on here are claiming it is a Starbound ripoff but at least this game is finished and runs smoothly on my pc (with the minor hiccup here and there) but all in alli have had no game breaking bugs or crashes in my play time. As i mention there is alot of content to play with, one example is the ability to travel to dungeons changing the gameplay from a Terraria style build and crafting game into somthing a kin to Super Metroid or Castlevania Symphony of the Night. The gun play is satisfying and a multitude of guns gives a lot of choice to the player as to what they want to use. Do you use the laser shotgun to blast your foes to pieces with a point blank blast to the frontal lobe? or do you take the Volter and electricute two enemies at the same time disintegrating there bodies! when it comes down to it i would definetly recomend this game!!",
            "review_score": "1"
        },
        {
            "review_text": "Just play Terraria. Chances are you haven't seen all of it's content and recently added content. If you own this it's only cause you got bored of Terraria but the grass is deff not greener on this side of the fence. Infact the grass here is all dead and full of dog ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a very amazing game but needs a little more terraria is probably better and well some hard feelings for this game if it had more detail and more explorable items and tools i would play this game more often",
            "review_score": "1"
        },
        {
            "review_text": "This one is pretty hard for me to judge objectively, as it was given by a now-gone Significant Other.  As such, I've desperately tried to like the game and pushed myself to give it more chances.  Now, with that in mind - The game has potential. There's some really great ideas in there as well as a unique art style (Though given the size of the sprites, I can't imagine there's much modding going on with people skilled enough to pull it off).  The problem is, as always, execution. Edge of Space feels very empty, despite its vast size, and there's not much to really do other than 'Dig deeper, grind for better gear'. The controls feels pretty floaty, and the gathering mechanics tend to get very weird when you want to mine a block right in front of you. Their attempts at humor are dry and fall flat on its face, as I've come to expect of indie games lately. Also, on top of frequent bugs and crashes, the game also needs some SERIOUS rebalancing around the crafting system and output. Often times you will have to grind your butt off to get a better gun, only to find that the one after that is almost trivial to acquire. Enemy frequency and damage scale up disproportionally to your ability to defend yourself.  So what DO I like about the game? The crafting system is quite brilliant - Much like the (newly released at the moment of writing) Fallout 4, you mostly rely on braking down items into basic components, in this case minerals. For instance, you can build a nice looking base with just some basic metal and dirt, no joke. Building is also a charm, as you can place blocks all over the screen without a fake limit. It's also quite refreshing to get a hi-tech tool from the get-go. I s2fg, if I have to deal with another spacey game that gives me a pickaxe, I'm rioting. When the game works, it can feel very satisfying.   In conclusion, I cannot recommend this game, since it still feels heavy WIP, even if it improved GREATLY since launch (It was simply awful then). The content is limited, and it's pretty clear that the game is very much unfinished at this point.  I've found a way to enjoy it, but without the intial reason, I would have abandoned the game for good.",
            "review_score": "-1"
        },
        {
            "review_text": "I simply adored the idea behind this game, but the devs seem to have abandoned it, so this game is now nothing but a broken promise that should be avoided.",
            "review_score": "-1"
        },
        {
            "review_text": "It can get boring at times, but SO MANY WEAPONS",
            "review_score": "1"
        },
        {
            "review_text": "Still has that tacky Terraria-clone feeling. Still same bugs from the last time I played it (getting stuck in terrain etc). the graphics are just odd and an eyesore. Rather play Terraria.",
            "review_score": "-1"
        },
        {
            "review_text": "Got it when it was first released Early Access, it was pretty unplayable then and not fun at all.   Now its pretty darn cool in its current state, and I think it has the groundwork to be great. Curious to find out whats next.",
            "review_score": "1"
        },
        {
            "review_text": "Review Updated as of 4/3/2016  How far my hopes have fallen.  This games started out with such great potential. Nice graphics, good crafting and world building mechanics. Even the inclusion of EXP and special in-world events! There were even going to be NPCs. Notice how I say 'were' in that last sentance.  The Developers seem to have left this game behind. In December, they assured us that the next update would come out after they got back from Christmas break, but days turned to weeks, and eventually into months. No update, no word from the Developers, no hope for this game.  The end product is a lot of good ideas that never got to see their full potential. The framework of a great game is there, but now it's never going to be completed.  I had high hopes for this game, and I have no idea with the Devs vanished so suddenly. But despite my dashed hopes, I cannot recoment this game to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "NEVER BUY EARLY ACCESS! Early access = cash grab",
            "review_score": "-1"
        },
        {
            "review_text": "What a waste of 7 dollars. Don't buy this game. Too complicated, just the TINIEST enemies are too overpowered, and REALLY confusing crafting.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great little indie game where you have to survive by shooting the nasties and building areas to protect yourself. As well as aquiring better technology as you progress.  Great fun.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game because it said it inculded content from Terraria. It is nothing like Terraria.",
            "review_score": "-1"
        },
        {
            "review_text": "For a game that is supposed to be 1.0, I find it is only of the quality of a Beta or Alpha release.  Pros: Lots of content and recipies Innovative crafting system Excellent soundtrack  Cons: Laggy and buggy, requiring a restart to make it playable again No decent mapping system, sometimes I have no idea where I am going Poor lighting effects (see above comment)  One revuewer said it quite well, this game feels like a generic space Terraria ripoff. (Yes, I know Terraria let them use a similar version of Skeletron.)  I'll probably visit this game in a afew months to see if much has improved, but for now, I cannot give it a passing grade.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "NEW REVIEW:   Better now, still tends to be grindy and non-intuitive. If you really enjoy this type of game and/or you play it with friends you are probably going to have a good time. Still can't completely recommend it but I am more on the fence now rather than a full thumbs down. Try it on sale if in doubt and you likely won't be too upset if it isn't your cup of tea.  Note: very involved and hard working developers. I am sure this game will continue to improve as time goes by.  __________________________________________________________________________________  OLD REVIEW:  OK game but quite repetitive, crafting doesn't make too much sense, i.e. use dirt and make armor, crafting button instead of 'craft' label has a 'science' label,... can you say non-intiutive?. Early access so game not finished, world and characters deleted relatively frequently for updates. Forced limits of exploration depth based on equipment type, i.e. can't skip equipment and just build higher levels tiers you need to plod through each level of equipment. Never seen the cool shark and polar bear enemies advertised on the store page, just crabs on speed, flying jellies, cyborg flying brains with beaks, velociraptors, and a few others, some weird ecology going on there.  Recommendation: pick up on sale but don't expect much and/or buy later when it's complete",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed the game. It has a nice mix of Terraria-style exploring and base building and fast-paced Metroid-style shooting. It has vehicles, a decent progression system, quests and NPCs.  Sure, it has some downsides (most annoyingly UI lag) and parts of the game feel unfinished (vehicles IMO could be much more useful than they currently are). But overall I found the game reasonably enjoyable and don't quite get all the negativity (I think it's more of a case of unmet expectations than the game being objectively bad).",
            "review_score": "1"
        },
        {
            "review_text": "bored after 20 mins, starbound on acid feel to the game, poor intructions and just not great.",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't know it had an edge",
            "review_score": "1"
        },
        {
            "review_text": "For the price that it is. Its a good game. The devs have long abandonned it so if you encounter any gamebreaking bugs. Tough ♥♥♥♥ you are stuck with it. I reccomend the game due to the fact you can group with other people. Its fun for a while and when you get bored you can play Starbound/Terraria/Craft the World.... the list goes on. But No hate to the devs they did their job. The community b***hed them out of having fun while making the game.",
            "review_score": "1"
        },
        {
            "review_text": "Its come pretty far from when it first came out but that really is not saying very much seeing as how when it first came out it was 100% dysfunctional. And now it is only 95% dysfucntional. better... not good... but better.",
            "review_score": "-1"
        },
        {
            "review_text": "For somereason my game will not load and it says there is an error (can say exact one because its like 2016-1-something else-something else.) but it says to tell the developer, but I dont know how, any suggestions?",
            "review_score": "-1"
        },
        {
            "review_text": "Not the best so far, but I see how it can improve!!! (Recommends) Eventually!!",
            "review_score": "1"
        },
        {
            "review_text": "I Love this game but can somebody tell me how to activate the upgrades you find in the terraformer?",
            "review_score": "1"
        },
        {
            "review_text": "Not a very good game in my oppionin for reasons being.  1.The mining is wierd. 2.You don't get much detail on what to do. 3.It feels very odd in movement.  I don't reccomend buying it unless on sale. *50% or over*",
            "review_score": "-1"
        },
        {
            "review_text": "Too bad I lost my money. Lazier than /I/ am. That's tough to do.",
            "review_score": "-1"
        },
        {
            "review_text": "one of the best 2D side/up/down sliders i have played....ever. i will say get this game as soon as you can cause it is worth ever bit of money you put into it.",
            "review_score": "1"
        },
        {
            "review_text": "Overall: I think that in it's current state the game shows a ton of potential and has some very great features. I really like the Terraria/Starbound 2D worldcraft type gameplay and the controls/combat of this particular title does the style justice. If you're a fan of these, this game is a must-play as it is a bit more forgiving than Starbound or Terraria in some ways but also very challenging in it's own right.  Positives: There is a great amount of appealing content in the game so far. The combat is a lot of fun. I like how easy it is to find and upgrade resources as well as unlocking content by simply fighting monsters and mining. Each (fighting/mining) give you exp points equally. There are also mini-dungeons you come across regularly to clear out. These in addition to deployable tower defense and other styles of mini-game dungeons adds a fun spin to the roguelike worldcraft indie style.  Negative: The biggest issues I have with the game are stability issues and bugs. After initially binging on the game for several hours, I lost everything I had built due to a client crash. I still had my character and all the inventory, but the planet/area's safe file was corrupted so I had to start from a fresh new save. This made me lose all my storage and the structures/bases I had built. Also it seems that about half the time the game has trouble deploying your character as playable into the world. Sometimes the screen is dark and everything responds, but you cannot move or take control of your avatar. It is easily fixed by a restart or two (if it happens sequentially).   Neutral: This game isn't a solid world like in Terraria or Starbound. There are large open spaces inbetween land masses that you must use your jet pack to travel between while heading deeper in the map without taking damage on impact as the gravity is similar to that of earth. This I feel like has both negative and positive effects for creating elevator shafts and fast-travel between different levels. For instance, one thing I liked about terraria was creating an easily navigated mine-shaft to drop very deep very quickly, although in this you can just build a teleporter wherever you want and teleport straight to it. So it really allows you to focus on more combat if you want to.  End thoughts. Worth overall. I will update my review as it is developed.",
            "review_score": "1"
        },
        {
            "review_text": "Wish I could get a refund",
            "review_score": "-1"
        },
        {
            "review_text": "The positives: Uh...... it has a terraria reference? The neutral stuff: Kinda grindy and mining is slow.  The stuff that are pretty big flaws but could have been okay: A 'research' system. In other words, not just one, but TWO methods of forcing you to work your butt off to get a incredible reward!..... Just kidding, you 'll also get stuck behind so many progression walls there are enough for several mazes of utter misery with the slow mining and finding out SURPRISE! you now need a new workstation. Alright, i'll go dig out ANOTHER massive crater to get some XP so I can research that. (An hour later) Alright let's see what I need for this thing. Looks like some uranium and a ton of aluminum (That's not actually a recipe but an example of the sorts of recipes there are) Time to go get some aluminum!.... Got that, what about uranium? Oh... I can't mine it. So what do I need to make a laser to (hopefully) mine it? Looks like more giant crater making for me. Hooray. Three cheers for whoever decided holding down on your mouse and moving it for hours was a neccecary game mechanic. What killed the game: There's no satisfaction to ANYTHING. Completing quests? Grindy and unrewarding. Exploring? Fun until you realize all the terrain is the same. Progression? There's progression? Where? Where'd you find precious progression? WHERE?!?! Combat? Yes there is! It's combatting the woefully weak jellyfish who die after about 20 seconds of holding the mouse button down! There isn't even different fighting styles. Sure you can pick between 'pew pew' guns, 'pew... BOOM' guns or 'PEW............... PEW' guns but compare that to terraria where you can get a massive variety of weapons, from classic swords to lances to boomerangs to flails to variants that deal more damage, look cool, fire off an array of projectiles from various actions (hitting enemies, when swinging, whenever there's an active hitbox...) or inflicting debuffs. And that's just THE MOST BORING CATEGORY. Not to say they aren't cool, it's just they're the trump 6 out of sixes and tens. There's also guns, bows, bow/gun hybrids, spellbooks wands+rods and staffs, throwing lances, throwing knives, shuriken, yo-yos, a portal gun, a voodoo doll, and that's just the stuff I thought of in a few minutes. Sorry about the massive rant. Overall, it's a 2.5/10 on the scale of games that aren't stupendous but aren't one of 'those' games. You know them. Zelda CGI, Flight Control, Slaughtering Grounds. The type that get videos dedicated to laughing at the sheer amount of crap that they are. Anyway, hopefully this helped the devs and the people who are thinking about buying it. Here's some games that hold up to the 1$ per hour of fun rule. Terraria: a 157 hour epic, and i've only gotten to late prehardmode and skill is the limiting factor in that. Cave Story+: The original indie game with new graphics and a handful of extra content including difficulty settings, new characters and a new level cut from the original game because it was apparently too dark (clones of a friendly character who attack you) which makes no sense considering it involves drowning as well as being forced to kill a character who was fed the red flowers (you'll understand if you play it) along with a character who tried to protect his friends and killed them accidentally. Seriously. It also has multiple endings. Undertale: AWESOME game involving SPOILER SPOILER who SPOILERs SPOILER. It's kinda loses half its appeal if you already know the story. Not to say the story is great and the gameplay is bad; all of undertale is fantastic. It's just that the story and gameplay are SO interconnected that spoiling one makes the other not quite have the impact it's supposed to. Also, bring a friend and a tissue or two. Seriously. Undertale is the only game ever to make me laugh so hard or cry anything exept tears of frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "Just more garbage being released as a complete product. The devs either gave up because they don't know what they're doing or decided they've got your money and don't need to do anything else. Steer clear of this one.",
            "review_score": "-1"
        },
        {
            "review_text": "I installed/uninstalled the game many times, trying to enjoy it, hoping that every new patch would polish and improve it.  Alas, I find EoS to be quite unenjoyable due to clunky animations and mediocre graphics. The animations really ruin the experience... if you have played Terraria or Starbound, well, it's nowhere near as fluid. Would not recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "EoS is a very fun Sci-Fi title, much akin to Terraria/Starbound. If you liked those, then you will enjoy this as well.",
            "review_score": "1"
        },
        {
            "review_text": "this games quest system sucks ",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a bad game just missing some content but it is still worth it if on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. It is like the Terraria of Space. Highly recommend it if you like Terraria. And it's only just begun with release.",
            "review_score": "1"
        },
        {
            "review_text": "Unfinished, unpolished, uninstalled. DO NOT BUY THIS! ♥♥♥♥ the devs for screwing us and ♥♥♥♥ VALVE FOR LETTING ♥♥♥♥ LIKE THIS HAPPEN.",
            "review_score": "-1"
        },
        {
            "review_text": "terrible very confuzeing just play starbound/terraria/minecraft ect. ect.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a solid game its like scify terraria. there is still VERRY MUCH to be done. other than that im still waiting on the special edition items. OTHER THAT THAT you haft to pay attention to how to do things.",
            "review_score": "1"
        },
        {
            "review_text": "This 'Game' Is goooooooood               Paid Review  ",
            "review_score": "1"
        },
        {
            "review_text": "It's like discount Starbound. Except it's the same price as Starbound.",
            "review_score": "-1"
        },
        {
            "review_text": "I met a shark that had Laser Herpes but that was about it.",
            "review_score": "-1"
        },
        {
            "review_text": "INSANELY GLITCHEY need to be clever to play ",
            "review_score": "1"
        },
        {
            "review_text": "For some people this game they MIGHT like, but for me i dont really get it... If you are in to 2D games like this, go get terraria or starbound..",
            "review_score": "-1"
        },
        {
            "review_text": "sad i just play few year ago and now it not working epic fail as hell badly game vary bad game :( i used same computer was wrking now it not runing good bery6 bad",
            "review_score": "-1"
        },
        {
            "review_text": "Edge of Space Is Terria in space i love this gun its epic so go ahead and get this game ☺",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Stop expecting it to be like starbound. In my opinion, it is way better than starbound. It is not starbound and never will be. So if you want some starbound replica go away. Want reasons?  Lazer sharks Skeletron Prime Awesome style You can't just get an endgame item by getting the materials.",
            "review_score": "1"
        },
        {
            "review_text": "I've played Terraria for years now and have been searching for games alike to Terraria. Edge of Space is a great game to play if your a fan of Terraria or basically like sandbox games. Its a decent game, but other than the content in Edge of Space, I'd love to see the game Improve.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fine game and I have no idea why the reviews are so bad. It has the viewpoint of Terraria, but also has simple quests and character attribute bonuses. Anyway, its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "this game is super fun and i love it  noting like terraira or starbound very  diffrent i would say this game is  best space game i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "i'm scared to put negative because the developer responded to me once and that is scary",
            "review_score": "1"
        },
        {
            "review_text": "i dont remember getting this",
            "review_score": "-1"
        },
        {
            "review_text": "DONT ♥♥♥♥ING BUY IT ITS ABSOLUTE ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Buy this game",
            "review_score": "1"
        },
        {
            "review_text": "I Kinda Liked It; It Should Have More Servers; I still like Terraria over EoS, Because of how simple it is, Along with the fact that it has servers that are still running; This game has potential, although every where I look, I cant find a running server!",
            "review_score": "1"
        },
        {
            "review_text": "Game was never finished, what a cop out",
            "review_score": "-1"
        },
        {
            "review_text": "I have updated my review as a developer kindly told be that the game has updated and improved which is the best thing I can say about this game is not the game itself but its the developers who have tried so hard but does it make it a good game?  If you enjoy this game good I'm glad but my disappointment turned into anger after playing it again.  You can tell its a good game when it lags when you open it up and when you create a level you could make a cup of coffee in the same time (pc master race) and when the screenshots taunt you with an interesting game. But you know its a fantastic game when the first mission of the game with the shark to protect it from the 'evil' jellies or you could just leave the abomination alone to its demise and still complete the mission and return to it without any consequences. I hope this is in early acess so it can improve but its still a bland game which makes doing chores fun, but dont worry you can unlock this cool item if you grind throughout and then you can battle that cool boss advertised if you didnt quit already. As if something needed to be added at the start of the game buildings are here and have generic repetitive tasks that sometimes dont make sense such as bombs appearing in a jelly base for you to randomly press buttons in order to dissarm it or do what I did and blow it up. There are no biomes in a alien world which after aimlessly wandering around discovering that the hud looks bland if the game is about to be released. Edge of space is a failed attempt into reaching 2d sandbox fame and if its true that this game is out of early access then there is little hope of improvements to this game. But hey dont take my word as this is my opinion and hopefully it will be proven wrong and you will love this game.",
            "review_score": "-1"
        },
        {
            "review_text": "DONT BUY GAME IS ABANDONED AND STILL ALPHA STAGE    Finally Early access done right.  Regular updates, it already got two different huge biomes ! Devs are posting regularly in the steam forums. This game remembers me of an insane mix of metroid and terraria. Your an astronaut and embark on a mission to reclaim and terraform a split up planet. The deeper you get the more radiation you will discover so dont forget your protection ! Of course you can setup your outpost and craft all shiny furniture. You can research different armor sets and weapon types like phase and projectile weapons. It got even nice upgrade mechanics like improved health , deploying mini turrets or even a grappling hook !  Now you say what ? Only 2 biomes and terraforming isnt implemented yet ? With terraform i mean turn the land into a more livable space with less radiation and hostile creatures. Base building you can do from the start! Dont fool yourself the biomes in EOS work much differently than compared to terraria. Terrarias biomes are rather small and can be traversed quickly. But on the other hand EOS's biomes really feel vast and huge. So those areas really invite you to explore and discover new lifeforms and alien buildings :)  Basically the end end goal upon release is to turn the planet back into a livable space with oxygen etc. But terraforming is a future feature.  I think in the past 2 months this early access title did do huge steps in the right direction. I was just on a server now and got disconnected. So i was confused, but actually they pushed an update right now ! So those devs are really crazy with the updates. For example the christmas update included 2 new dungeons , 1 new boss, 1 special event and several new items to craft.    TL;DR Basically its a blend of 2d metroidvania and terraria. Ranged combat is a huge deal with many rifles and laser guns. Each crafted weapon can get different stats and clip sizes etc.  It maybe starts slow and you need to get used to the crafting and research mechanics, but im sure after 4-5 hours you feel right at home :)  But take notice Win Xp is NOT supported ! Mac and linux arent supported yet, but get a future implementation!   Just check out the forums to get a better picture whats going on. When starting the game first time i strongly recommend doing the tutorial first.    Edit2: Not recommended anymore, because its abandoneware. The website shut down and community manager got fired!",
            "review_score": "-1"
        },
        {
            "review_text": "New review from the one I had before   This game is ♥♥♥♥ and the dev's abandon this game I really thought this game would be good but then l played an hour and bugs after bugs after bugs I could not even get an important item that I needed to start with I could play   This is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "The devs have given up on this game, and so should you.",
            "review_score": "-1"
        },
        {
            "review_text": "Long since abandoned, company website no longer available, company facebook pages both dead and abandoned.  Another EA grab cash and run company - if you ever see them pop up again (2nd time this company has resurfaced now), never touch a product by them.  I feel bad for my friend as this was gifted - I still feel robbed.",
            "review_score": "-1"
        },
        {
            "review_text": "Have you enjoyed games like Starbound or Terraria in the past? Then there will be a lot for you to like here as well. If not this game won't change your mind about this genre of games. The developers seem to have a real passion and want to make this a great game, only time will tell if they succeed. The game has finally come out of early access with a slew of new features and bug fixes. So if you were on the fence before now might be the time to pick this one up.  Updated 12/22/2016  Looks like this game has been abandoned by it's development team, which is a really shame this game had a lot of potential. As the game is now I can't recommend it, there are just to many bugs and half baked game mechanics. I would look into picking up Starbound or Terraria if you haven't already.",
            "review_score": "-1"
        }
    ]
}