{
    "app_id": 238870,
    "name": "Citadels",
    "release_date": "2013-07-25",
    "developer": [
        "Games Distillery s.r.o."
    ],
    "publisher": [
        "HandyGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Medieval"
    ],
    "achievements": 26,
    "positive_ratings": 62,
    "negative_ratings": 354,
    "price": 10.99,
    "description": "The Legend Of King Arthur Reborn!A vast army has gathered in front of the castle gates and is preparing to attack King Arthur! How has it come to this? Witness important events in the history of the legendary king and accompany him and his army on the path to an uncertain future.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/238870/header.jpg?t=1534407380",
    "minimum_requirements": "OS: Windows XP (SP2) / Vista / 7 / 8 Processor: 2.5 GHz dual core Memory: 2 GB RAM Graphics: 1GB Graphics Memory with Shader 3.0 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 8 GB available space Sound Card: DirectX 9 Compatible Additional Notes: Supported Graphics Cards: NVIDIA GeForce 7900 / 8 / 9 / GT / GTS / GTX series; ATI Radeon X1900 / HD 2000 / HD 3000 / HD 4000 / HD 5000 series",
    "recommended_requirements": "OS: Windows XP (SP2) / Vista / 7 / 8 Processor: 3.5 GHz dual core or better Memory: 4 GB RAM Graphics: 1GB Graphics Memory with Shader 3.0 or better (NVIDIA GeForce GTX 650 or better, AMD Radeon HD 7700 or better) DirectX: Version 9.0c Storage: 8 GB available space Additional Notes: Supported Graphics Cards: NVIDIA GeForce 7900 / 8 / 9 / GT / GTS / GTX series; ATI Radeon X1900 / HD 2000 / HD 3000 / HD 4000 / HD 5000 series",
    "reviews": [
        {
            "review_text": "8/10 worth $10 while still on sale. the original price seems way too much to ask.  This is the type of game that gets better as you get the hang of it. The UI needs a little work (lack of quick keys), need option to change keyboard key binds. Don't expect this to look like starcraft II but the gameplay is smooth and unique.",
            "review_score": "1"
        },
        {
            "review_text": "Have just completed first mission, no glitches, crashes or problems of any kind. Excellant game",
            "review_score": "1"
        },
        {
            "review_text": "Have you been looking for a new real time strategy game lately to scratch that strategy itch you've been having? Well look elsewhere, because Citadels is a dreadful and incomplete mess. The game was created by an unknown and inexperienced development studio called Games Distillery. Currently a different studio called Big Moon was hired to add further playability and stability to the game. In the future, at best you can only hope for a polished yet dreadful entertainment product (without the entertainment value).   Citadels attempts to accomplish what so many other strategy games have already done before, and it accomplishes those things poorly. Citadels most closely resembles a stripped down Age of Empires title. Everything from base building, combat, and resource gathering are implemented poorly. There is no strategy involved at all because combat boils down to spamming units. You can literally spam the most basic miliary unit available and win every time. The utter lack of military units available leaves no room for strategy, tactics, or planning at all.   The game has a boring campaign that currently can't even be finished entirely, and a few lacklusted skirmish modes with terrible AI. There is only one map available per skirmish mode and no matter the difficulty you choose you cannot lose due to the incompetent AI. Citadels is only a singleplayer game so these are your only options. There is no map or scenario editor or multiplayer of any kind. The poor quality of this title combined with the utterlack of content at a $40 price point is downright theivery. Avoid at all costs.  I only put 3 hours into this game but that was rather generous of me. The boring gameplay, poor design, and lack of content leave little reason for me to play any further.",
            "review_score": "-1"
        },
        {
            "review_text": "So this game had the potential to be great, but everything they tried to do was simply implemented horribly. I tried to see the positives in this game to no avail. My rant/review shall now commence.  You'd imagine that the wall and citadel construction would have been done right since it's the bloody title of the game.. well guess again, it's horrendous and inexplicably complicated and bugy. (also for some reason, the further away you place your wall, the less fps you have, I don't understand how that could be an actual correlation in this day and age)  Another thing is the menus and extremely unfriendly interface. There are many icons which supposedly show different resources.. the only thing is they're basically all the same. Adding to the horrible interface is the crappy layout of buildings and options. There's just a bunch of fancy pop-out menus with NOTHING in them. You will literally see a huge menu with only one option and no tooltips or anything. Oh and remember all those lovely hotkeys that every relatively new rts has? That's right you guessed it, this game has none.  As I'm sure you've noticed, this is quite an angry review and has turned into a rant rather than an objective review. BUT, after having played a few skirmishes against the so called 'a.i.' I felt compelled to try and save you from the dreadful experience that lies ahead.  I somehow managed to get it for 6 euros and I still feel cheated. This game is so pre-alpha that no one should ever be able to buy it until they at least remove all the bugs and arrange the ai and interface.  Save yourself and your wallet, do not waste money on this.  DO NOT BUY THIS GAME.  I'm out.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandon-ware at it's worst. Do not waste your money on this unfinished, unpatched mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't even bother with this game. I came expecting an improvement of AoE2 ( considering AoE3 is worthless) and was severely dissapointed. Despite having read the negative reviews on it when it was released I thought I would give it a try as a new version had been released with loads of fixes. Well the game is stable now, but the gameplay is still ♥♥♥♥. Not fluid at all, impossible to enjoy playing.  Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like the screenshots are from a whole other game...Nah I didn't like it. At all.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a huge fan of RTS games, this one sucks. Dont buy.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY 0/10  To make the review short, you might as well buy Stronghold or Age of Empire.   For a strategy game it's just way too simple in my opinion. Building and Unit choice is very limited and you can experience everything in 3 missions. It brings nothing new to the genre and it's not improving on anything.",
            "review_score": "-1"
        },
        {
            "review_text": "This game seems a beta version to be tested, because has too simple bugs. The walls, main doors and towers not fit when try to rebuild over his places; you cant stop the troops training; the cursor and his info disappear near the buildings, many times crush to desktop...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is frustrating. It keeps locking up in the middle of playing. I will be an hour into the mission and it will randomly freeze and I will loose my progress.",
            "review_score": "-1"
        },
        {
            "review_text": "All around just a bad game. Not worth the time or money",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, I think it's a beautiful game with much potential in it but at the current point(09.08.15) it just unplayable. I needed five attempts to fully finish one round because the game always crashed. And there is no autosave actually so always manually saving. The possibility shown in the trailer where the fortress-walls are build in and onto the concrete stone is just not existing, what actually is very annoying because your building units stuck from time to time behind the fortress wall they are building and u have no other choice as to keep them there or deconstruct the whole wall. What also leads to the next problem the unit limit that is caped at 99 units. I understand that units are objects and they take space in your RAM so they can't just put 9k unit-limit but 99 looks so small and unimportant in a actual battle that I got just bored after the first round. And that are just a few of the bugs I experienced in just 3h of play. So as for me I will stop playing the game right now and maybe I will retry it in about a year again what I would suggest also for you guys. If a dev reads this keep doin but be faster. And as said... Much potential but so far not worth its money and I just payed 5 Euro...",
            "review_score": "-1"
        },
        {
            "review_text": "Game has to many problems with it. Mouse control with this game is not responding as in other games. Game dosen't seem to be ready for gamers to use. I feel I have been taken for my money. Settings aren't set up to set game to the gamer's computer for best play. Needs to be able to slow game play down for older pc's. Also needs to be mouse control not key board, Very unfriendly to user. Not a game I would tell any one to play or purchase. This game needs a rework to it so that it is user friendly to gamers. As of right now I have purchased a game that I cann't play and I wouldn't want this to happen to another player out there. Vedio of this game looks realy good but game play isn't. I hope they fix this game soon",
            "review_score": "-1"
        },
        {
            "review_text": "This game was a waste of money. So many bugs..",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game, and I feel it has potential. But in its current state, the game is unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "as much as I want this game to be awesome, it is held back by numerous crashes and other bugs. Thankfully I got this during a steam sale so I didn't wasted $40 like most people here.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sure watching grass grow is more fun than this",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the $10. Look I like me some RTS and usually have a fair amount of leancy on games. This one though just made me mad. The controls are bad. So bad. Its a perspective problem. So when you scroll out to see the whole map the devs didn't compensate for this and you have to move you curser behind what you want to select. Thats ok till you start trying to click the small people on a large map, forget it.  I honestly just got past the first level and wanted to never play it again. I'm not usually so annoied by poorly made games, I think its the price tag that bothers me. There are many games that aren't as polished and they take that and compensate the price. This one jumps out at $40 and then makes you feel like your getting a steal at 75% off. No. This game should be a $19.99 game, or $5 on sale.  Sure its not a great review of the game but read some more of the other reviews. I did and though dropping the $10 on a buggy game wouldn't be so bad. I was wrong",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible, terrible game. Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfinished and buggy",
            "review_score": "-1"
        },
        {
            "review_text": "Awful Awful Awful stay well clear.....................................",
            "review_score": "-1"
        },
        {
            "review_text": "Installed and gave my computer hepatitis.  Absolute garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't.",
            "review_score": "-1"
        },
        {
            "review_text": "The steam page for this game makes it look WAY better then it really is. It's not really that good looking, the mechanics are like monkeys ♥♥♥♥ing a football, there's no intro or tutorial level and the Ui is about as comprehendable as three ♥♥♥♥♥ and a squirrel.   Unless they update how the mechanics work, and how the game works actually understandable, this game is not worth.  2 towers out of 10.",
            "review_score": "-1"
        }
    ]
}