{
    "app_id": 238930,
    "name": "7 Grand Steps: What Ancients Begat",
    "release_date": "2013-06-07",
    "developer": [
        "Mousechief"
    ],
    "publisher": [
        "Mousechief"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Board Game"
    ],
    "achievements": 0,
    "positive_ratings": 356,
    "negative_ratings": 299,
    "price": 14.99,
    "description": "What Ancients Begat is a complete (~15 hour) game of family generations surviving the rise of western civilization. Survival is the ultimate goal. The sub-goals, you choose, build their story.Experience an abstract telling of the lives of our earliest recorded ancestors.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/238930/header.jpg?t=1447357877",
    "minimum_requirements": "OS:XP Processor:1GHz Memory:1 GB RAM Graphics:1024x768 Hard Drive:200 MB HD space",
    "recommended_requirements": "OS:XP Processor:1GHz Memory:1 GB RAM Graphics:1024x768 Hard Drive:200 MB HD space",
    "reviews": [
        {
            "review_text": "7 Grand Steps is an ambitious game. It provides a single-player boardgame experience against computer-controlled AI characters set amongst the classic ages of history. Unfortunately, the experience is enormously crippled by the random elements of the game. Progress often feels the benefit of luck, and the frequent impediments to your progress are frustrating and feel beyond player control. While the various storylines you'll encounter are somewhat engaging, they are often hopelessly vague. Character choices that work for one individual utterly fail for another. While training children is an important part of the game, the parents can reproduce beyond their means, such that nurturing each child becomes impossible. Should you choose to dote on one child, rivalries will develop which hinder progress down the line.   While progress is exciting, especially from Age to Age, due to the strange and random nature of the game, you could be forced to play one Age for a great length of time. As you are forced to make the same choices again and again, the tedium weighs the experience down, such that slogging through the wheel becomes a chore. While you may find the game has an instant surface appeal, it doesn't ultimately hold up. The lives of the characters in the game feel beyond any meaningful influence, and each turn eventually feels mechanical.   The initial wonder of the experience was greatly muted after a few hours of play, to the point that I couldn't explain why I continued to play. The structure of 7 Grand Steps is intriguing, but sadly, it is a flawed creation. 'Winning' the game is an empty achievement: the end result of many hours of token creation in a blind universe.",
            "review_score": "-1"
        },
        {
            "review_text": "STRONG POINTS: elegant and steeped in metaphor. The game tells a story while you play. The actions from one generation build upon (and perhaps hamper those) of the next. Lots of interesting strategic decisions: when to marry (and gain an additional pawn), which pawn to move first to maximize your chances at points. The game expands impressively the further you advance, and when I first landed in the ruling class my jaw dropped.  WEAK POINTS: Those who dislike randomness will become frustrated with the inscrutable child-bearing mechanics. Sometimes you try and fail every time, sometimes your pawns won't stop having kids no matter how many you already have. :)  TO SUM UP: An epic strategy game that doesn't end up overwhelming. You stay focused on the here-and-now, even though the ramifications of the player's actions stretch beyond the immediate.",
            "review_score": "1"
        },
        {
            "review_text": "Very original game. Like Life and Sims put together. If you like games with a story to tell or management then you will find this game highly addictive.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very addictive game for what seems like simple game play. You need to educate the offspring and make sure they all get the same treatment or you suffer the consequences which when you're just barely staying afloat can be make or break. But, if the siblings get along it can be wonderful. I found myself often saying I'll just finish this generation before I quit ... and 6 generations later I was still saying 'just this generation'.  ",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly unique and well balanced board game that tells a story that follows your lineage through the generations. It's incredibly elegant and well tuned, and I found myself easily losing track of time. I really wish there were more games like this one, as it's a welcome departure from the plethora of fast paced arcade games on the market.   Recommended for people who love storytelling and boardgames.",
            "review_score": "1"
        },
        {
            "review_text": "Feeling much like a board game it's highly addictive. Play various characters through family generations through the copper / bronze / iron etc ages. It reminds me of Shark Attack in that there is a rotating board and crocs, instead of a sharks, will eat your characters if you don't move ahead fast enough. You will explore various professions, need to raise children and upgrade their stats as you play as one of your children in the next generation. Various challenges can mean the end of your family line if your stats are not high enough or you make the incorrect decisions. Adds a bit of a random element of danger in that the board game is happening to you, not you strong arming your way through. Definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game but the narrative perhaps due to being a bit pretentious is sometimes unreadable.  That's honestly the only bad thing I can think of about this game. It's wonderful in so many ways. If I don't watch myself I could play it all day.",
            "review_score": "1"
        },
        {
            "review_text": "I like it. It's a nice, simple experience. It's also got simple, yet surprisingly deep mechanics and choices. 'Do I feed my children knowledge, or do I let them play because I can't do that AND stay alive.' Or 'Do I make tons of tokens with my spouse, and risk the chance of having more kids?' It really does kind of get repetitive (in fact...really repetitive) after a while, however, until you get to royalty level. Then you actually have some nice choices to make with managing the country. One complaint is that you can't manage the country unless your primary character (the child you raised from the previous generation) moves, so you can't get the +1 research...But I guess it kinda makes since due to how that +1 research is explained, and it's not that big of a deal. What I REALLY don't like, however, is that all your story choices are made when you decide the character's personality, which is fine....I guess, because there are definite 'best' responses to each event, and should you be able to choose it...well, you see where that goes. So, it's reasonable, doesn't mean I like it. But, by far, the worst part of it is the heroic challenge, when on the surface, they are a fun, pick your adventure sorta deal, 3/4 of the responses you are allowed result in either instant death with no recourse, or losing most of your currency, and with background information to guide your decision by you're blind guessing with a high likely hood of horrible consequences. So, the decision making basically becomes a wikipedia search, and considering how much this game hates alt-tab, it's really inconvenient. So, it's good fun for a few hours, maybe slightly longer, but it definitely through bull cr*p at you for no real reason, and kills you or your children without any chance for choice or strategy...Take all this into account when trying to decide if you want to spend the money on it.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game and its randomness is a wonder to behold. Prepare to lose hours of time on this one",
            "review_score": "1"
        },
        {
            "review_text": "Strangely addicting solo board game. Neeeeed morrre tokenssss.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good board game style game. The board is a wheel and you can get coins to move around or back on the wheel. Move too far back though and you'll get devoured, move too far ahead and you will struggle to get coins. It can get a little repetitive but is nice to sit down and play for a little bit at a time. I'm disappointed that the second part has seemed to have been abandoned though. :(",
            "review_score": "1"
        },
        {
            "review_text": "If Crusader Kings 2 and King of Dragon Pass had a board game baby. Station climbing, family raising, and waging war. Appears obtuse and uninteresting in screenshots but intuitive and addictive when played. There's a demo on the official website.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, quiet, slow single player strategy board game, about family blood lines over the eons.   May not be fun for most kids. Most adult gamers will probably like this one.",
            "review_score": "1"
        },
        {
            "review_text": "Engaging game that makes you think across generations. Make right decisions to make your dynasty royal. Then rule during given era and try maintaining your power.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game at first but after a bit it becomes repeditive. Just didn't have it in me to keep playing. Got to the iron age though. Also I don't think going for a hero is worth it unless your just starting. Doesn't carry over through the ages whereas if you become a noble or royalty that normally will carry over if you don't screw up much. And invention is cool but it just gives you 10 of what ever token you discovered. My suggestion is either go straight for social climbling or do a hero one first. Overall its a decent game and I would say give it a shot. Get it on sale if you can though.",
            "review_score": "1"
        },
        {
            "review_text": "Nice 1 player 'Board Game'",
            "review_score": "1"
        },
        {
            "review_text": "7 Grand Steps is an emergent narrative game about family generations surviving through the ages. Its story is driven by a core, board-game mechanic. The experience is like Civilization crossed with Oregon Trail.﻿ Beatiful graphic, immersive music and innovative gameplay! This is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Think 1940's arcade... if there were any. If you would simply like to check out a simulation of a complex story telling machine, its worth the purchase price. A machine which tells a families story throughout the span of civilization. I applaud the creators for thinking outside the box. A charming little title.",
            "review_score": "1"
        },
        {
            "review_text": "I try to like the game, but you really spend to much time doing noninteresting choices on the board : the deplacement mecanism is really simple and you quickly undertand how to play it efficiently.  The choose-your-adventure is not very interresting either. I was not very appeal to the stories. The idea of generations is nice but fall a little short. It is quite hard to understand what control you have and if events are consequences of your choices or not. And, it's not related enough to what happen on the board. Nothing really make you relate to your family.   It's a little nicer once you can do government choices but this only happend very late on the game.  The game is relly to slow. I found the graphisms quite nice but really boring- it's always the same.   The failur reasons and macanisms are nice though. (but the you have to comme back to boring stages...)  Maybe if it was shorter...",
            "review_score": "-1"
        },
        {
            "review_text": "A simple concept and an addictive game. It can be played over again with different strategies used. Can jump straight into playing with little need for tutorials. Interesting story-telling in the background; I find the game more enjoyable when every story card is read.",
            "review_score": "1"
        },
        {
            "review_text": "Completely random, and frustrating how little impact your 'decisions.'  It is not clever, I did not feel as if it told me a story and I found it easy to stop 'playing'.",
            "review_score": "-1"
        },
        {
            "review_text": "Really disappointing. I was really excited when I read about this game but after just 10 hours of play, it's become unbearably tedious. The writing is quite poor and repetetive at times. The ability to name your characters would help a little, perhaps. But after three generations of various Alexioses and Hypatias, it's all begun to blur together.",
            "review_score": "-1"
        },
        {
            "review_text": "Ehhh the mechanics of it make it seem like it would be pretty boring. Because its super repetative and stuff. But it's actually pretty challenging and a lot of fun. But it's probably not everyone's cup of tea. If you're not mad into like strategy esque board games then you probably wouldn't like this game. If you are then you probably would??? I only paid $5 for this game and like 7 other games in a bundle on humble bundle though I'm not sure it's worth $20?????????????????",
            "review_score": "1"
        },
        {
            "review_text": "Price is a bit steep for a video board game.Probably more fun as a table-top game with friends. kinda mundane as solo game.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting idea, very poor execution. Struggled to maintain my interest for more than a few minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately, this game is a time waste. The idea is different, but does not bring any excitement after a few rounds in the 'slot machine'. If played on mobile device, it might be worthwhile spending time on it while sitting on the metro on the way to work. It does the trick to have time passing by,",
            "review_score": "-1"
        },
        {
            "review_text": "Really interesting concept, and a unique execution... but the price is far, far beyond what is reasonable for this. If Steps 2-7 were to be included, this would be worth the asking price, but I wouldn't pay more then ten dollars for this game. As a result of the price alone, I'm afraid I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "The idea of this game is neat. It really is. A board game style game of family progression sounded fun.  But that's where the good things end. About 3 or 4 hours into a game the gameplay is clunky and insanely repetitive. I was determined to finish a game before I wrote a review, but I don't see the point. Always having to drag the coins into slots is clunky and takes too long. There is no character variability, as the initiation stories quickly repeat themselves and have little substance. I was playing this while watching TV and I still managed to get bored out of my mind...  It's a shame because there was an interesting idea here that was utterly wasted.",
            "review_score": "-1"
        },
        {
            "review_text": "It's enjoyable but the games just last too long and wears out it's welcome before it's over.",
            "review_score": "-1"
        },
        {
            "review_text": "A very interesting concept for a slotmachine / board game / stratgy game. Too bad it is ruined by EVERYTHING being dependent on RNG.   Regarless of how well you try to play it RNG will always get you in the end. If you like playing games that are 100% based on RNG and luck, this is the game for you! All it has done is made me hate humanity. The rich get richer and the poor get poor. 10+ hour game and die to poverty on the lowest rank? Yeah, why not. What a ♥♥♥♥ing waste of my life. Make one tiny mistake in the game, or don't it doesnt matter. You are bound to die alone and without an heir.   The AI is unfair and it's the biggest waste of time on steam I have found so far.",
            "review_score": "-1"
        },
        {
            "review_text": "A good casual styled 'board game' with interesting mechanics. It can be equally frustrating as it is exciting when you make a decision. Definitely good for when I don't know what else to play.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly worth £2.00, no more. I got bored of it within 2 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "Since I like boardgames, I thought I was going to like this game, but in the end I was dissapointed. It just lacked immersion, and the mechanics can become reptitive that it ends up becoming a grinding slog.  In this game, you try to advance through the board , which in this game is a wheel, using tokens, which you produce by moving backwards, If the wheel ends up dragging you to the wrong end, your character gets eaten by crocodiles.  No, you dont lose the game when that happens, instead you continue with a child-heir of yours, or if you don't have any, a past sibling.  The problem here is that, it is too much luck based, you don't know what tokens you are going to get, and there is a real good chance that you are going to run out of tokens, which means bye-bye and say hello to the crocodiles. This happens especially if you don't get married early, and the matter of you getting married is again dependent on chance and luck.  And if you don't have children, as I have stated above, you continue with a past sibling of yours, which means you will go back a generation. In my case, I was already in the iron age, but went back to the bronze age.   This made me stop playing, As it really felt that the game was never going to end.  Also, the writing which is supposed to bring depth, story, and immersion is weak and uninspired, and most of the time lacking in context - I'm a doctor? no? then a potter? not really, so what am I really? - Such basic questions, the game often fails to answer.  If you like games like checkers or maybe go. You might like this game, but for those seeking for an immersive saga through the ages, like me, we are better off looking someplace else.",
            "review_score": "-1"
        },
        {
            "review_text": "7 Grand Steps is fun, but not very rewarding. The game needed some better tutorials, and frankly some of the explanations on how to play are not helpful. I recommend it on sale heavily heavily discounted, but never at $5 which I got it at. A strange but fascinating concept, but not well executed. It feels like the board game it was inspired from, not a computer game.",
            "review_score": "-1"
        },
        {
            "review_text": "ONLY TERRIBLE THINGS HAPPEN TO YOU IN THIS GAME. JUST STUB YOUR TOE REALLY HARD ITS EXACTLY LIKE THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "It was too much of a puzzle game for me.",
            "review_score": "-1"
        },
        {
            "review_text": "It's basically just a puzzle game. It's difficult, but more frustrating and random than fair and challenging.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are interested in an interesting and innovative experience that lasts no more than approximately 8 hours of play for the average player, I recommend this. However, at the current price point, other than the novelty of the game there's not really much in the way of meat on the bones. The core game mechanics are entirely random and there is no way for the player to understand the consequences of their choices as they play. Essentially, this is the same as playing a slot machine, with a randomly emerging narrative that the player has very little to do with.   If it were 4-5 bucks, it might be a great buy for a new and innovative experience. That being said, it is *not* worth buying at this price point if you expect a lot of game time or an in-depth, user guided emergent narrative because it isn't there. I give it a gold star for effort, and I will probably tinker with it from time to time, but it is not so much a video game and closer to video gambling.",
            "review_score": "1"
        },
        {
            "review_text": "Really confusing game. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Funny, little game. Although it is very simple and plain, I kind of sticked with it one night, just so see what the children do to eachother when you do not treat them equally :D",
            "review_score": "1"
        },
        {
            "review_text": "very very simple game. plays out more like a story. To me, this game feels like it was made for a tablet/phone but was uploaded to steam. I am enjoying the very casual nature of the game and the board game aspects but i would not recomend paying anymore then 5 bucks on this game, wait for a steam sale",
            "review_score": "1"
        },
        {
            "review_text": "A suprisingly compelling game. a dynasty simulator boiled down to its most simple state. takes a little while to get the hang of. beware the inability to go back to previous saves, you will live with your mistakes for generations. picked this up as part of a bundle to pass an hour or so. surfaced 4 hours later having played only a small part of the game.   At 75mb you can grab this in a few minutes and its simple enough that it could be played on a calculator. fantastic time waster.",
            "review_score": "1"
        },
        {
            "review_text": "If you love strategy board games, you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed.",
            "review_score": "1"
        },
        {
            "review_text": "Truly innovative mechanics and a unique theme. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game, although interesting, feels terribly misleading.  What makes the title interesting: You follow a family line as it progresses through different ages of history. What makes the game fun is the constant counterbalance you have to make between whether or not to collect beads (Items on the game board that lead to three different types of advancement), or to focus on collecting tokens to invest in the next generation. A certain degree of stratagem exists in the game, stemming from the nuanced ways in which certain game mechanics interact. For instance, Do I have my couple work together, which runs the risk of them spawning a child, when I already have 3? If I do I might get some more tokens, but I also could end up having another kid to shove tokens into if I ever want to advance the eldest (the one that carries on the family line by default).  One of the best stratagies I found when you have two people that do not love each other and already have at least one child, is to position your two characters behind the others. If done correctly, you can net some free beads from standing in place, while simultaneously getting beads when other characters fall back to make tokens.  The game does not really hit its stride until you advance to the ruling caste, where a multitude of mini-games appear each age and allow for some really fascinating gameplay.  All this being said, the game has some major flaws that would make me suggest not getting it unless in a bundle where it can be acquired on the cheap. Some of those flaws are listed below: 1)The game's rite of passage system is bare bones as ♥♥♥♥. Instead of actually getting to make a decision, you press buttons until the game seemingly flips a coin and you either succede or fail, and are then given a selection of character traits. The traits you get are either good or bad, which offers some variety, but are static (e.g. 'Success' always gives 'Benevolent' Failure always gives an option of 'Meiser'.) This wouldn't be so severe an issue, if there were not only 4 choices. 2)It is unclear how the personality elements of the character actually impact the game. Often times even good personality traits will not save you from adversities. 3)The story elements offer virtually no choice most of the time, and often times the results of any of your choices are extremely random. This may be conducive to simulating reality, but is not terribly good for the purposes of understanding or playing through a game. 4)The title costs $20, this is absurd to me for one paramount reason. The title you are displayed with at the beginning is '7 Grand Steps: What Ancients Begat'. This drew me to conclude that the title was going to span 7 grand ages, each step divided into smaller ages. I thought it'd be interesting to see how history progressed through the game as time went on, and how the various castes interacted. But at the end of the Iron Age, you are sent to an End Screen, with the full title '7 Grand Steps: What Ancients Begat - Step 1', and a lead in to another game they title as Step 2.  This naming convention seems almost predatory to me, and I do not think $20 is anywhere near a fair pricepoint for the content offered. $5 would be reasonable, but anything more is pushing the envelope from my vantage point.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, really!",
            "review_score": "1"
        }
    ]
}