{
    "app_id": 239120,
    "name": "FINAL FANTASY III",
    "release_date": "2014-05-27",
    "developer": [
        "Square Enix"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 12,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "JRPG",
        "RPG",
        "Turn-Based"
    ],
    "achievements": 18,
    "positive_ratings": 1029,
    "negative_ratings": 250,
    "price": 10.99,
    "description": "FINAL FANTASY® III, one of the best-loved games from the epic RPG series, is now available on Steam.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/239120/header.jpg?t=1549381841",
    "minimum_requirements": "OS: Windows Vista, 7, 8 Processor: Pentium 4,  2.4 GHz Memory: 2 GB RAM Storage: 800 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have always enjoyed the first two Final Fantasy games, but their stories were sparse, relying more on conversations with random town folk to help fill in the blanks than to tell a proper tale. While Final Fantasy III still shows its age and might not have the sophistication found in later RPGs, it is still a worthy look back at a game that helped to continue to redefine the genre.   This version of the game on PC is based on the graphically updated version that made its way onto the Nintendo DS back in 2006. The visuals got an 3D overhaul, with a widened aspect ratio and some new features as well. If you are familiar with the DS or iPhone/iPad versions of the game this PC release will feel very familiar, but it still plays out nicely on a bigger screen.  Themes that persist and remain familiar in future Final Fantasy games such as the Warriors of Light and job class systems help populate this story. The job system is bare bones compared to what we are used to now in the series (and other games that use similar systems), and the game uses it more as a second experience system. On the one hand the characters have conventional experience systems that level up their physical attributes, and then there's the job levels which represent their skills. Managing both is easy, and the system does encourage players to jump their characters through multiple jobs, though there is some grinding involved as there is a warmup process where a character needs to fight a certain number of battles with a role before they're comfortable with it and can use its skills properly. You don't want to be fighting tough enemies in such a state, so you'll generally grind through easy battles each and every time you change classes.  This is a classic Final Fantasy title, which of course has both good and bad connotations. It means lots of menus and level grinding and of course chocobos and Cid and things. It is a welcome rush of nostalgia to come back to a game like this, which has aged well despite being nearly two and a half decades old. I'd be lying if I said that the graphical overhaul didn't make the game far more palatable (or the fact that the original game was never released in English), but the core mechanics should also appeal to old school JRPG fans. The game gets off to something of a slow start, with a lot of story and limited exploration during the first dozen hours or so, but once it opens up it is every bit the exploration-filled adventure Final Fantasy is known for, filled with little secrets to find and fun and diverse characters.  Having just played Bravely Default a few months ago and seeing familiar themes such as the four different adventurers brought together by circumstance and the presence of crystals as a focal point to the story, I could not help but be amused with how timeless the narrative themes are. That being said, Bravely Default showed just how much further game storytelling has gone in making something rich out of the basic thematic construct. That is not to say that Final Fantasy III has a poor story, but compared to the more modern Japanese role-playing game, it is fascinating to see how far the medium has come.  If you have already played the DS or iOS version of this game, there may not be enough of a reason to purchase it on Steam now. However, if you missed that opportunity before and want to experience an important part of Final Fantasy's early evolution, this is an excellent way to do so. The character depth and story detail might feel somewhat lacking compared to newer JRPG titles, but there is an expansive world here that begs for exploration as you grow your characters for future challenges. The overall package is an easy one to recommend.    Recommended ",
            "review_score": "1"
        },
        {
            "review_text": "  Pure, unspoiled Final Fantasy at its best.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a Final Fantasy buff for nearly 2 decades and 3 was one of those elusive games I never got to play due to the original never making its way to the West. Thankfully this has been changed and the game got a nice faithful remake. All I can say is WOW - I do not know how this game avoided a Western release the first time around, it was fantastic.   All the making of a traditional FF world (4 Crystals, Warriors of Light, etc. etc.) - and with enough flair and uniqueness to quite distinguish it from basically every other FF game even into modern iterations (I really liked the idea of '2 worlds' one being a floating continent).  The Job system is awesome and offers a huge variety of choices but does promote some serious grinding if you're into switching around. If you don't like to grind then chances are you will finish the game with the default classes (Warrior et al.)  Probably the biggest downside to the game is that it features the archaic 'only 3 spells per level' mechanism that existed in FF1 and 2 - this is further aggitated by the fact that the game is no longer limited to simply White and Black Magic - you also have to find room to put your Summons in one of those 3 precious slots per level. However I can understand that the game is technically just a faithful remake, and the system is what it was when 3 released in Japan.  Storywise this really feels like an early FF - and by that I mean the story is trivial at best (same as I and II). You could text mash the whole game and you'd likely find you like it just the same as long as you like FF/JRPGs. That being said - it's not an issue of the story being 'bad' so much as the story just didn't latch for me.  Graphically it isn't too bad - it stands somewhere around where 7 does graphically. 7 makes use of parallax backgrounds and imaging layers to give the impression of better 'graphics' for their environments - but when you look at the character models you can see the difference - especially in meshing. FF7 has better environments, but FF3's character models' meshes and overall 3D details are better - textures are bit poop, but still better than FF7s in most cases.   All in all it was a positive experience and one day I'll probably play again just for the fun of it.",
            "review_score": "1"
        },
        {
            "review_text": "NES-generation kids will cheer playing through this revamped 1:1 remake of Final Fantasy III. The popular JRPG franchise's third title features up to two dozen hours of turn-based combat, open-world exploration and old-school dungeon crawling. The production value is adequate for a handheld title (FF III is, essentially, a DS title), but it might come across as underwhelming for the 13.99 EU pricetag.  Buy it if you: were born in the 80s enjoy anime culture can afford a somewhat expensive nostalgia catalyst   DO NOT buy it if you: expect production value for your buck can't stand obtuse, oldschool mechanics, the tedium of grinding or chibi aesthetics get bored playing something that is not in real-time ",
            "review_score": "1"
        },
        {
            "review_text": "FF III is a genuine adventure, simple but endearing and definitely magical. It's got a surprisingly varied job system, cute models and all the old-school, grindy JRPG-ness under a remastered graphical overhaul. Though it likely won't blow your mind, it's legit. Save often.",
            "review_score": "1"
        },
        {
            "review_text": "Before starting, I must state (because it seems many do not know this still) this is **NOT** the FFIII that was on the SNES (that was FFVI in Japan). FFIII was never released in NA until a few years back, when it was brough to the Nintendo DS &amp; later Android (I assume iOS as well).  This brings back the job system established in the first FF, with a large variety of jobs to choose from. These include the standard jobs you expect, like white/black/red mage, dark knight, dragoon; and others not commonly found in the FF series, such as viking, onion knight, and scholar. This also brings back a large world to explore, where you are not hand held and running down a hallway for 80 hours, which recent iterations of FF have unfortunatly de-evolved into.  The graphics are bright, as to be expected of something ported from the DS. No, it has not been updated for the PC, but hey, it's not 8-bit graphics and high pitched MIDI sound killing your eardrums. Character design reminds me of a simple version of those seen in Bravely Default on the 3DS.  I have never been able to get into mobile gaming (the drain on battery murders my phone), and am glad this came over to Steam. If you still need to add this one to your FF collection, and have not played it yet, pick it up as you will not be disapointed.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, brings back childhood memories... but I wish it told you how to save in the beginning.. maybe I missed it, but starting over from the beginning sucks ♥♥♥ after you die XD",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Final Fantasy like myself, I recommend getting this game. Sure the graphics are not very impressive compared to today's titles, but if you like the old school rpg style, this is perfect for you.   There is a job system in this game, I think it is the first time in any Final Fantasy game this kind of thing appeared where you can switch jobs on the fly, and each one is strengthened the more you play it.  Originally this game never saw the light of day here in the USA, it wasn't until recently when Square-Enix decided to remake it and release it for us that many of us could play it. The storyline is simple to follow, but there are times you may need help figuring out where to go next, especially if you are looking for many of the game's 'hidden' dungeons (hidden means not part of the main story in this case, if you look around though you can find these dungeons fairly easily)  This game won't win any awards, but it is enjoyable to play overall, I recommend it for any fan of JRPG or Final Fantasy in general",
            "review_score": "1"
        },
        {
            "review_text": "A great old school Final Fantasy game. Unfortunately the save files corrupted somehow and I'm stuck in the final area with no ship or access into the tower again. I've already done most of the tower but I went back out and saved my progress and something corrupted.. It really sucks to spend almost 60 hours on a game to have something like this happen.  I do recommend the game because it's a good game but be aware that your game might corrupt.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a bit biased since Final Fantasy is my favorite series, but this one is special. It was the first of the series to introduce the jobs attribute, letting you play with different classes throughout the game and planning them to fit your strategy. The story isn't as enthralling as the more popular FF titles but still good.  Replay value is fair, I tend to replay every FF title every five years or so, so you can play it again and still love it. However the limited saving in this one tends to cause frustration.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but don't like to play it on PC platform. I think the PSP or PS platform is much more agreeable to play it on. But I think this is a personal oppinion ofcourse. The graphics aren't what we're used to nowadays, but I'm still in love with the final fantasy series (and yes, also the first ones).",
            "review_score": "1"
        },
        {
            "review_text": "Great game with beautiful storyline, a true classic!",
            "review_score": "1"
        },
        {
            "review_text": "FFIII is as evil as it is captivating. While the story suffers from a few hiccups now and then, it never feels dull or grey. This remake takes you back to a time when games were challenging, testing the skill of the player, not just giving them consquence-less respawns. Example; Modern Game: 'Last boss of the dungeon! *Dies* *Respawns at entrance to boss*' FFIII: 'Last boss of the dungeon! *Dies* ...wait...WAIT....WHAT!? I Haven't saved in hours!' This level of difficulty is shunned by most, but beloved by the rest. Games have not 'Advanced'. Have you noticed 95% of NEW games (2010+) are 89% cutscenes or QTE's? That's not gaming. That's proving that the gaming industry as a whole is dumbing their games down because of the apparent lack of motivation. FFIII is an example of how a game is meant to be, challenging yet rewarding. A game with a safe-fail system is in no regards challenging. It disappoints me to see the gaming companies flourish with so little effort put into their games (yes, you too Square). So please, if you want a REAL challenge, put your modern rpg away and pick this gem up.",
            "review_score": "1"
        },
        {
            "review_text": "love love LOVE this game guys!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, anyone who likes rpg's needs this game in their library. Plenty of hours worth of gameplay, it stays true to its original form, music is nice, story is cute, graphics are pleasant and easy on the eye. Really well done re make.   If you are a final fantasy fan boy buy this game at regular price, i believe it is plenty worth it.     If however you just like to play RPG's from time to time, add this to your wish list and come back to it when it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite Final Fantasy ported on pc so far ! Love the job system ! Graphic are good ! Best turn based RPG !",
            "review_score": "1"
        },
        {
            "review_text": "There's just something about old-school RPG's that really appeals to me, and Final Fantasy III perfectly captures whatever that may be. The game has wonderful visuals all around, and a nice difficulty. It's not easy, but it's not unbearable either. As soon as you get stuck, you just take a break, then go back and grind a few levels and you should be fine.  Final Fantasy III saw the introduction of the job system, and there's a lot to choose from so you don't really get tired of your party. I think my only complaint is not having an airship for a pretty big length of the game, but the world is small enough that you don't really need it like you would in say Final Fantasy IV. This was a Famicom game after all.",
            "review_score": "1"
        },
        {
            "review_text": "great game. reminds me of back when games were about gameplay and not graphics",
            "review_score": "1"
        },
        {
            "review_text": "I loved it on my DS and Love it now definately a good buy!",
            "review_score": "1"
        },
        {
            "review_text": "Brings back my childhood",
            "review_score": "1"
        },
        {
            "review_text": "Bring on final fantasy 10 next and I'll be very happy!",
            "review_score": "1"
        },
        {
            "review_text": "Exclent and fun with new changes from the orignal.",
            "review_score": "1"
        },
        {
            "review_text": "i lovve it and im super happy its on steam",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would play again, and again, and again",
            "review_score": "1"
        },
        {
            "review_text": "theres alot of hentai of refia 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Two thumbs from this guy &lt;&lt; ^^",
            "review_score": "1"
        },
        {
            "review_text": "My first Final Fantasy and RPG.  Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "you a ♥♥♥♥♥ if you dont get this game.",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite games 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Bad port of a relatively good 2006 remake of a game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, probably could be beaten within 30-40hrs. A fair amount of grinding to level up job class and individual levels, not sure if my time in game should be taken as I had left it on a few days by accident. Worth the seasonal sale price for this classic…Yes.  +interesting art style +music was continently great, but notably fantastic in Eureka +4 Dragoons using jump or a dual shielded Viking using Provoke = easy mode unlock  -traveling was good as always, but odd at the end of the game where you have the final 2 flying ships and where you had to go….sometimes annoying. -Thief job class is at max Lv99….so master thief……how can they fail at stealing?  Overall rating for this game 6.5/10, I would say pick it up on sale to add to your FF collection. ",
            "review_score": "1"
        },
        {
            "review_text": "It is truly a pleasure for the long-time fan of Final Fantasy titles on the Playstation to be able to play through classic games such as this in a reworked state. As much as it is a pleasant feeling of nostalgia to play them once again on a SNES, seeing some of the older games remade in such a way is really great--having them come to Steam is even better.  Don't be fooled by the slightly child-like visuals (they were, after all made for the DS and then subsequently mobile OSs). Final Fantasy III is an old-school RPG. The vast majority of the game remains what it was on the SNES to the core. It is unforgiving; there is very rarely a save-point before a boss. For those who remember these frustrating but extremely rewarding games with fondness, you will not be disappointed with Final Fantasy III. Some things about the old school, however, are not so great. Attacking a fire-elemental monster with fire and having it simply hurt them 'less' rather than outright healing them, appears to be a feature that Square-Enix probably should have tweaked before re-releasing this game, but I can forgive them--after all, as I said it *does* hurt them less...  The story is basic, as one would expect of an RPG of its age. Square Enix added a little bit of character development into the reworked version that at least helps to better differentiate the characters from one another. Nonetheless, if you wish to play for storyline rather than the excellent RPG combat mechanics that made Final Fantasy the definitive title in turn-based RPGs, then you may wish to look to the newer titles in the series now available on Steam, such as VII, VIII, and soon to be XIII.   I would certainly recommend this game to any Final Fantasy fan. Beyond that, however, I'm not sure I could recommend it. There are far better RPGs out there on the market and often at a similar price. The later titles in the Final Fantasy series, the Elder Scrolls, and Bioware's many titles are typically superior to this one if you plan on throwing 30+ hours into a game. As a fan of Final Fantasy, though, I enjoyed it. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "I recently started playing the Final Fantasy series. I started with XIII, XIII-2 and Lightning Returns. I liked them so much i decided to buy the old 'remade version' ones from steam. I intend to play them in order, so far i'm over 20 hours into this final fantasy and it's been a blast. No wonder these games have such reviews, you can lose yourself in this games and you completly lose track of times.",
            "review_score": "1"
        },
        {
            "review_text": "As always square comes through. It's final fantasy so not much else to say. Not quite the same as the original ffiii on snes but a nice change of pace compared to the ridiculous complexity of the newer games. It's a must buy for any old school gamers like myself. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Want to know if I like this? Hell yea, it has everything you want from a Final Fantasy game!",
            "review_score": "1"
        },
        {
            "review_text": "I can only recommend FF III for fans of the genre and FF series and still you won't maybe fully enjoy it as myself. If you are nostalgic hardcore grinder with a lot of patience - this is definitely for you! :)",
            "review_score": "1"
        },
        {
            "review_text": "I never played DS or mobile versions, so I can not compare, but I spent some time in port of original version for PSX. PC version of the Final Fantasy III is certainly fun, and updated visuals and interface brings a lot to the game. As with all the old FF games, there is not much story to speak of, the game is all about dungeon crawling and although you have some dialog here or there, most of them are simple and do not distract from action. I would actually sometimes appreciate more dialog in game, because it is easy to get lost in game sometimes due to lack of pointers about where to go next. You also have only four characters for whole game and all of them are active whole game if present (and alive), so you do not need to worry about managing and leveling up too many of them at the same time, which is common in some later games in the series.   Combat is turn based, but you are not restricted by time during turns, which makes it more strategic than more recent games. From modern FF games it is most similar to FF 10, although with less options when comes to spells, items or other actions. Final Fantasy III also uses job system. It means you can change character classes between fights, and there is more than 20 of them. Downside of it is that there is separate level system for character and jobs and no experience points and levels earned in one job transfers to another. Therefore you need to train every job separately and some dungeons require you to use specific jobs, which unfortunately makes some of them essential and other practically useless. And yes, the game does have random battles so depending on your preferences you will probably either love this style or hate it.  Bugs in PC port of the game is something which is spelled pretty often in other reviews here. As for my own experience, I knew about the biggest of them from the start and did not encounter any other mentioned here, my playthrough was pretty smooth. So I would recommend to save often to several files be sure (you have 3 maximum), never to return to your first town and use the restoration fountains after you break the rock which seals you in the first area, and you should be fine. Of course, the graphic is old for today's standard and locked in 15 fps in battles, true. But you are not exactly playing game from 2016 here and the the game looks nice as the chosen design fits its style.  In the whole, Final Fantasy III is certainly worth playing for all FF fans. LIke me, you may easily find that you will enjoy it more than some more recent installments in the series. Only given the price and age of the game, it may be better to wait for some steam sale.     + Great example of old time jrpg    + Updated visuals and interface    + Turn-based combat system    + Level design, monsters and bosses      - Unbalanced job system    - Does not tell you where to go next sometimes    - PC version have at least one bug which can break game, although it can be avoided    - Battles locked to 15 fps (depends on player if it matters)  ",
            "review_score": "1"
        },
        {
            "review_text": "This is anither great FF addition to steam. The Job system is what makes this game so great. You can make so many character customizations for battle and you will get plenty of gametime. While the job systerm isnt as great as FF5s in my oppinion the game is definately worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "The music is good and it's similar to the DS and IOS versions but now there's achievements",
            "review_score": "1"
        },
        {
            "review_text": "I recently was having a yearning for old school JRPGs, and when I found this on steam I was overjoyed. I've played for two nights after work and I'm really enjoying this game. The story is of course a bit simple and delivered as if to children (the original target audience) but that isn't to say it isn't elegant.   Couple of technical quibbles though; As some have already said though make sure before starting play the first time, go into settings in the launcher to find out (and probably change) your key bindings.  The job system makes for a wonderfully diverse range of characters you can play, although I kinda wished some of the advancements you make in one class would bleed into another, so by the end of the game you have four unique individuals shaped by the selections they've made throughout the game but that's probably just the roleplayer in me.   Also it would be nice If the jobs were available a *little* earlier on.   The map is next to useless, which is disappointing as well, seeing as the game will say 'go to the dwarven continent' to continue the story, but the map doesn't have any names on it, and I've found no way to move a cursor there. (I might be doing something wrong though)  Despite my above petty complaints, the gameplay is simple, elegant like all early final fantasys and relaxing. Just save before each dungeon, eh?",
            "review_score": "1"
        },
        {
            "review_text": "Just completed FFIII for the first time. If you're new to Final Fantasy then I recommend checking out FF7 or 8 instead; both of which are available on steam. If you're familiar with the Final Fantasy series then this is a pretty run-of-the-mill game - minimal story, lack of direction at points, maximum grinding, minimum save points.  It only takes about 30 hours to complete but it feels longer than that unfortunately due to the necessary grinding before certain bosses. There is an added superboss after you complete the game which I'm working on beating now, but I don't expect it to be any strategic challenge - merely a leveling one.  For a remake I'd have expected better quality graphics, far better control support (controls for the PS3 controller are sometimes buggy at the moment), better resolution support and definitely a modernisation of the menus and battle results. It's also rather pricey for what it is, but if you're a hardcore Final Fantasy fan like me then you're going to buy it anyway.  5/10.",
            "review_score": "1"
        },
        {
            "review_text": "A classic Video game. the updated graphics look great, this is deffinitely a game to play in a smaller window while running netflix or a podcast in the background. Classic Final Fantasy gameplay spruced up for 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Played this on DS a few years ago, could not obtain the Onion knight class since i did not know anyone else with a 3DS or the game. But they changed that for the PC version makes it a lot more fun. One of the better but more blan Final Fantasy games. Give this a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Love grindy games",
            "review_score": "1"
        },
        {
            "review_text": "very good remake of Final Fantasy 3 ... for all the hard core and some who like final fantasy games ... i recommend it",
            "review_score": "1"
        },
        {
            "review_text": "It is truly a pleasure for the long-time fan of Final Fantasy titles on the Playstation to be able to play through classic games such as this in a reworked state. As much as it is a pleasant feeling of nostalgia to play them once again on a SNES, seeing some of the older games remade in such a way is really great--having them come to Steam is even better.  Don't be fooled by the slightly child-like visuals (they were, after all made for the DS and then subsequently mobile OSs). Final Fantasy III is an old-school RPG. The vast majority of the game remains what it was on the SNES to the core. It is unforgiving; there is very rarely a save-point before a boss. For those who remember these frustrating but extremely rewarding games with fondness, you will not be disappointed with Final Fantasy III. Some things about the old school, however, are not so great. Attacking a fire-elemental monster with fire and having it simply hurt them 'less' rather than outright healing them, appears to be a feature that Square-Enix probably should have tweaked before re-releasing this game, but I can forgive them--after all, as I said it *does* hurt them less...  The story is basic, as one would expect of an RPG of its age. Square Enix added a little bit of character development into the reworked version that at least helps to better differentiate the characters from one another. Nonetheless, if you wish to play for storyline rather than the excellent RPG combat mechanics that made Final Fantasy the definitive title in turn-based RPGs, then you may wish to look to the newer titles in the series now available on Steam, such as VII, VIII, and soon to be XIII.   I would certainly recommend this game to any Final Fantasy fan. Beyond that, however, I'm not sure I could recommend it. There are far better RPGs out there on the market and often at a similar price. The later titles in the Final Fantasy series, the Elder Scrolls, and Bioware's many titles are typically superior to this one if you plan on throwing 30+ hours into a game. As a fan of Final Fantasy, though, I enjoyed it. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, Loved FF7 as a kid and now I get to appreciate this as an adult",
            "review_score": "1"
        },
        {
            "review_text": "First off - I'm a huge fan of the Final Fantasy series, so I might be a little biased because of that.  So what makes this game good? In my opinion it's the job system and a fantastic world is the main strengths of this game. The job system allows the party characters to switch between classes (like warrior, monk, black mage, etc.) giving them access to a variety of skills and equipment unique to each class and each job can be leveled up alongside the characters' 'normal' level.  The world is vast and has a good variety of towns, caves and temples. Without spoiling too much it's also wonderful that the world is a lot bigger than you might initially think.  As for the gameplay it's a fairly traditional JRPG - especially if you've been playing the older FF games before. It's a turn-based battle system that allows the faster characters or enemies to strike first when commands are selected. You do have all the time you want to select commands, though, meaning there is time to be strategic.  While not overly difficult, you'll have to grind once in a while if you want to be strong enough to progress. I'm not going to put that down as a positive or negative thing as that is very much up to the individual. It's especially important in late game, though, and crucial if you're planning to take on some of the games optional bosses.  If you're looking to go for a Perfect Game (obtain all achievements) you should be prepared to grind relentlessly as some of the achievements here are incredibly time-consuming.  If I'm not mistaken this is a port of the iOS version (which is more or less identical to the DS version), which means updated graphics. It's not beautiful, but it has a certain charm to it - and it's definitely an upgrade from the original graphics.  The soundtrack also deserves a mention - it's good. As in really good. It contains revamped versions of Nobuo Uematsu's original compositions for the NES version of the game - I haven't heard the originals myself, so I can't compare, but the new versions are definitely solid.  My main gripe with this game is the characters, though. There's so memorable NPCs but the party characters are pretty boring and with only a little background story to each. Even though more is revealed later in the game it's still not particularly satisfying. The story isn't anything out of the ordinary either, although it isn't downright bad. If you've played older Final Fantasy-games before it's pretty much a classic 'save the world using crystals'-story.  But besides a boring cast of party characters and a somewhat bland story, the game is still worthwhile if you're into more old-school JRPGs and don't mind the updated graphics. The gameplay, job system and the world are magnificent and should entertain most RPG-fans enough to make this a worthwhile purchase. Don't expect it to be as story-rich and complex as later entries in the Final Fantasy series, though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the buggiest releases I have ever played. I keep running into situations where events re-play themselves, like seeing Cid depart the party over and over again every time I enter his town, or the dragon not appearing on Dragon's Peak even when you talk to the required NPC. Also my Enterprise ship just disappeared after I docked it and stepped out.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a die-hard Final Fantasy Fan who goes out of their way to play every game from 3-10 on Steam (1 &amp;2 not yet released for PC) then Final Fantasy III is a must. First and foremost, this is a tough game to dedicate your time to beat. Currently I have held 52 hrs on record to play this game from start to finish. While the linear gameplay isn't necessarily that long, however it does take preparation to level up for the final challenge which is why it took me extra time plus completing much of the Steam achievement list.  As for the game itself, this version of Final Fantasy III is a remake of the original Nintendo DS handheld first released in the US in 2006. The original game came out in 1990 for the Nintendo Entertainment System (NES) in Japan only. The 3d remake retains much of the  difficulty and control schemes of the original version typical of any RPG genre type game. The story is pretty clichéd and bland compared to the later Final Fantasy titles, but it still doesn't fail to entertain as it is filled with many surprises, plot twists, and some humorous moments. Furthermore as a trivia fact, III was the first game that introduced many of the series highlights, including the job class system, summons including Ramuh, Ifrit, Shiva, and Odin to name a few, the hit point system that popped up when striking an enemy, riding chocobos throughout the world map, the first appearance of the moogles and the boss battle theme made its debut in this game as well. The gameplay elements involve character job classes ranging from a knight to magic user, summoner, thief or job class with special abilities. Many more job classes are picked up along the way as the game progresses. Completing the game depends on the player constantly adjusting and upgrading on these job classes (it takes time &amp; effort on this). Experience points that are used to level up on your characters and job classes are gained by defeating monsters randomly encountered on the World Map field or dungeon level, (encounters can get repetitive and annoying this way) as they are not seen.  This version does not include special features like a music track, or art gallery by Final Fantasy series artist Yoshitaka Amano, but does include a bestiary (viewable list of monsters defeated) which counts towards completing a Steam achievement. However, the bestiary is not viewed from the game's main menu, but rather much later in the game after achieving a certain vehicle.  Overall, this has been one of the best classical Final Fantasy titles to play, but players be prepared for its classical difficulty and extended time to completing it.",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy III, Let me start off by saying I have always seen this series, admired the concepts and design, but have never actually played them. I am a huge fan of JRPGs and for the price I would recommend picking this up.    There are a few downsides however that might promote investing in a different JRPG. The overall story is very linier, generic. YOU WILL GRIND. Grinding is a pretty huge part in this game. You can go from losing a party member to overwhelming victories in just a few levels, forces you to grind easy monsters when you get the chance.  There is an open(ish) world, and tons of hidden areas and items. This promotes exploration during the grinding, but wander too far and meet your doom, keeps it interesting. The Job (class) system is relatively extensive as well allowing for around 20 different jobs including some “hidden” jobs and unlockables throughout the game.    All in all if you are interested in the Final Fantasy series this is enjoyable, playable, beatable, not the best JRPG of all time but a nice one.",
            "review_score": "1"
        },
        {
            "review_text": "Dripping with nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "First off, I have clicked the DO NOT RECOMMEND button at the bottom of this review. And that's only half true. See, I've been trying to beat the living hell out of this game ever since I bought it almost a week ago and I keep getting stopped by bugs. Below I'm going to list the four bugs I've encountered, and they're pretty catastrophic, but if you save often you'll be fine. Except that you can't save in dungeons. Luckily, none of these bugs took place in Dungeons.  The first bug I encountered: On leaving Castle Sasune I decided to go back to the starting village and see if I missed anything. When I talked to the Elder in town, the storyline restarted and I had to go back through gathering my party, whose levels had all reset to 3, 3, and 4, respectively, by going through all the cutscenes over again.  The Second bug I encountered: While on The Enterprise (Boat) I got into a battle, a lot of them, to try and level against the new monsters because YAAY DIVERSITY, only to come out of my 20th or so battle and realize I was standing in the ocean. There was no ship sprite, I was Luneth being followed by Desch.. standing on the ocean. The background music had stopped and I was unable to go back on land, and when I went past the first continent, the Big Rock that bars your passage before defeating Djinn was there again. Wee~ saved to an empty file and reloaded, bug not fixed.  The Third bug, and the funniest (in a cruel sort of way): After speaking with a friend about a treasure room just inside the crystal cave, I decided to head back there on The Enterprise (Save Often) and check it out, if only for the Achievement progress. I skipped the first village because I'd already dealt with that bug and I wasn't risking it. Go in to the cave, grab the loot and spot a hole in the floor. So I hop in, figuring the worst that could happen is that I'll have to walk through the crystal room again. NOPE. Game reverts Luneth and party to level 3, 3, 3, and 4 respectively and plays the opening cutscene again. And restarts the storyline, strips you of items and jobs unlocked. FUNNNN.   The last bug I found was upon restarting the game after the third bug: I loaded up my save and there I was in the middle fo the Ocean on The Enterprise. I decide to quickly get the hell off this boat before it glitches on me again. Got into a fight with 2 Hermits. Killed them quickly, was back on my boat, and two achievements popped up. Apparently I saved a lot of Gil, because I got both of the Gil-related achievements for nothing.   All in all, a great game but I have to play it in small chunks because of the ridiculous amount of bugs I've run into. Its frustrating, and I won't recommend the purchase of this game to any but the most stalwart of Final Fantasy fans.",
            "review_score": "-1"
        },
        {
            "review_text": "I do not reccommend this game at all, this was advertised as having full game pad support and my view and many others have proved very different, the gamepad stops the game actully working (unless you take the control out, control won't work after in my experience), secondly, you cannot change the gamepad controls either.  Seriously, why the hell release a game which clearly doesn't work properly? Avoid this game until fixes have been made to the launcher. A terrible disappointment really.",
            "review_score": "-1"
        },
        {
            "review_text": "Im sorry i wasnt aware that a 5 year old ran square enix cause this is utturly terririble every time you turn around bug guess what turn again suddenly your boat is gone i think ill go to town story ends amazing square enix you dissipoint",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable. I'll get into a battle while on the ship and when the battle ends the ship will be missing. Game data reverts randomly after the game auto quicksaves.  I've own this on the Nintendo DS, but I would not recommend this port. It's broken.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't recommend a game that 9/10 you get a bug where you can't change your jobs after a certain point early in the game. This bug has been known on steam for over a year and hasn't been fixed so no I wouldn't suggest anyone buy this game until the issue is resolved.",
            "review_score": "-1"
        },
        {
            "review_text": "Still cant open it...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is meh. I rage quit at the end, because of the lack of save points and having to fight a billion bosses. So yeah. I was quite angry. It was also a horrible port with a lot of bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I could use my controller to play this game and can't. I only purchased it so I could play something new that involved leaning back and using my controller. I don't have the X-box controller for PC, just a regular one, but it works with FF7 and FF8 and I wish I could get my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely do not purchase this game until all bugs have been fixed. It contains many game breaking bugs which have been documented. Sadly I did not find this out until I was 4-5 hours into the game and was met with a bug that prevented any further progression. Sad too because I really enjoyed the game up to that point.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this product. There's several problems, one of them being the game is not starting. At all.",
            "review_score": "-1"
        },
        {
            "review_text": "Its SLOWWWWW",
            "review_score": "-1"
        },
        {
            "review_text": "Full of game freezing glitches, outright broken. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This is by far the worst Final Fantasy Remake I have ever played. The graphics are terrible, the gameplay and storyline are completely lacking any heart or substance, and the 3D element is horrible! The game itself is extremely bad, as you continually die and do not have the opportunity to revive yourself before a boss. You do not have the option to buy Pheonix downs, and whenever you do find them you end up using them immediately. You also never have the option for healing party members by using tents or ethers, and any Elixer you find along the way are also used up almost immediately.   I will never figure out why Square-Enix didn't simply remake this game in the same style as the first two Final Fantasy games for the NES (which were awesome) because this one is horrible beyond words. I would never recommend this game to anyone ... and sincerely hope this will not be the new style for Final Fantasy games.",
            "review_score": "-1"
        },
        {
            "review_text": "A core mechanic of this game is the ability to discover now jobs (e.g., White Mage, Warrior, Monk) and assign them to your party members via the Job menu.  There is a known issue with this game that permanently disables the Job menu for a save game. If you encounter this issue, your only option is to load a different, earlier save game (provided you even have one).  I did not.  I am unable to progress further in this game without restarting from the beginning. Maybe by the time I'm willing to do that Square Enix will have finally fixed this bug and I won't have to.",
            "review_score": "-1"
        }
    ]
}