{
    "app_id": 239700,
    "name": "Hate Plus",
    "release_date": "2013-08-19",
    "developer": [
        "Love Conquers All Games"
    ],
    "publisher": [
        "Love Conquers All Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Visual Novel",
        "Indie",
        "Anime"
    ],
    "achievements": 11,
    "positive_ratings": 452,
    "negative_ratings": 72,
    "price": 7.19,
    "description": "Let's spend the next three real-time days together uncovering the mystery of what went horribly wrong on a derelict generation ship, with the help of a spunky/more-than-slightly-traumatized AI sidekick! A sequel to Analogue: A Hate Story that tells a whole new hate story of its own.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/239700/header.jpg?t=1447357933",
    "minimum_requirements": "OS: Windows XP Processor: 1.66 GHz Memory: 2 GB RAM Graphics: DirectX compatible card DirectX: Version 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "God damn it, *Mute.  A word of warning: If you're easily depressed or heartbroken, DO NOT play this game on *Mute's route. To everyone else, enjoy, but be warned it'll be a pretty disturbing journey. I rarely recommend games, but this one is definitely worth it.  ...damn it, *Mute...",
            "review_score": "1"
        },
        {
            "review_text": "So, like, I was just about to write this review when, at that very moment, my doorbell rang. It was my sister. So I interrupted my review, got up, and greeted her with a calm 'hello'. She was just back from the shops, and had bought me a sandwich, so I stopped to eat and have a chat. Her boyfriend was getting on fine, she was enjoying her job, the usual.  After lunch, I wasn't particularly in the mood for writing, so I decided to do something else for a while. I ended up spending most of it on YouTube, where I learned great deals about Blinking and Slamming. It was quite the entertainment, and I felt a lot better afterwards. So I got back to writing this review.  ...  If you thought that was a whole load of completely unnecessary prose, then this game is not for you.  Seriously, I knew going in that it wasn't as well-liked as the first one, but I absolutely wasn't expecting it to be so long and drawn out. It's not that there's unnecessary logs - although some are - it's that they're all way, way longer than they actually should be. Condensed by 50% and not lose anything.  The other big issue was that the story simply wasn't very interesting. The A-plot, the politics stuff, is fairly well written, although somewhat let down by that it's very predictable. As for the B-plots, they just don't go anywhere. While the B-plots were important in the first game for setting the tone and getting an idea of what life was like, here they're just mediocre relationship stories.  There's a lot of smaller but important issues too. The time mechanic that does absolutely nothing, that you can read entries out of order basically spoils earlier entries (and sequence breaks dialogue a little bit), there's a lot less AI chat this time, Mute route's badly written plot twist that's just there for the sake of a plot twist, and the goddam awful one-line-at-a-time scrolling.  Overall though, it's simply not a good enough story that I can recommend to anyone. I loved the first game, but this ain't it.",
            "review_score": "-1"
        },
        {
            "review_text": "Hate Plus is a top-notch example of interactive fiction, following directly on from the events of Analogue: A Hate Story. Although not required, I would definitely recommend playing Analogue before getting this - it will put the characters and the situation they are in into a greater context.  The main interaction in the game involves unlocking and reading through a small number of log files at a time in order to solve one of the mysteries of the generation ship 'mugunghwa,' along one of two A.I. companions. It is the interaction with your companion that really makes the game special; Christine Love has a gift for writing interesting and complex characters that don't rely on tired stereotypes. The differences between the companions' viewpoints make multiple playthroughs well worth the time, despite the lack of mystery second time through.  One of the key mechanics of Hate Plus is the way it only allows a certain amount to be played each day. You can circumvent the system if you really want, but for those who like to get immersed in their fiction this real-world restriction makes the player feel like a more genuine part of the story. Played over the course of 3-9 days (as you're supposed to!) with a couple of hours per night, the pacing in Hate Plus is bang on.  On the whole I believe Analogue: A Hate Story is the better work, with more interaction and a more interesting mystery at its core, but Hate Plus is a more than worthy sequel. If you enjoy visual novels or are looking for a place to start in a genre you perhaps haven't tried before - there's no reason to miss this game.",
            "review_score": "1"
        },
        {
            "review_text": " Close your door, shut off the lights, and don't sleep or shower for days because it's time to learn about why Neo-Confucianism  sucks! ",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me how to make a microwave cake. So it had a long term impact in that!  It was also... quite sad. And I loved some of the music.  I managed to enjoy it even though I don't think I did the routes in quite the right order. *Mute - *Hyun-ae- Both is the reccomended.  I also liked that I could chose to not be a man or a woman.",
            "review_score": "1"
        },
        {
            "review_text": "NOT FOR ACHIEVEMENT HUNTERS.  Let me state this first and foremost: If you play the Steam Achievements metagame, where your goal is to 100% as many games in your library as possible, YOU WILL NEVER 100% THIS GAME. There is one achievement on here that was added, but purposely not coded in, because plot/reasons. While I can appreciate the statement by the author, I feel this is an abuse of the Steam Achievements system. So let this warning stand; if you want to get a Perfect game, you never ever will. If you feel any sense of compulsion to complete things, then AVOID this game, because it will be a permanent itch you can never scratch.  That said, now I will get into the game review itself.  Hate Plus is the sequel to Analogue: A Hate Story. In the previous game, you are investigating the downfall of a pre-FTL ship with the help of the ship's AI. Over the course of the game, you -- the player -- can read about some tidbits about the ship's severely patriarchial culture (based on Korea's Joseon dynasty, 1392 to 1897 AD) and the culture shock one of the protagonists in the logs suffers when they awaken from a cryogenic sleep and are essentially thrown back in time (in a cultural sense). The story that unfolded in the first game and the cultural influences and motivations the player can read about are pretty interesting!  Sadly, much of that seems to be lacking in Hate Plus.  In a sense, Hate Plus is a more of a 'prequel' than a sequel, but the term can only be used loosely. The log files you are investigating in Hate Plus take place before the events of Analogue. And while it does fill in the gaps as to the 'what happened' the previous game left open, it seems to lack the same kind of 'why did this happen' punch that Analogue delivered. The relevant political entries feel dry and perfunctory, and the relevant personal logs somehow lack personality. As though it all culminates to say, 'I do the things, because reasons!' As a result, the experience feels more hollow.  Perhaps it's the method of delivery. As in the previous game, you are given an artificial restriction on how much you can read. However, unlike the first game, you have no restriction on which files you can read first, with the exception of one or more encrypted files that must be brute-forced (meaning the event always occurs at a specific point in the game, regardless of which of the other logs you've read). This essentially means that all of the other logs cannot contain anything too important, lest the player read those ones first. The result feels like so much incohesive, dry filler material than actual plot or story, even when selectively extracted by storyline and sorted/read by date.  Overall, I found myself unable to connect or empathize with any of the actors in this story as well as I was able to in Analogue.  I picked this up in a Humble Bundle, so at the very least I can feel some gratification that most of the money I spent went towards a charity. But if you don't have that option, have played Analogue, and are looking to solve the mystery of the Mugunghwa's cultural shift proposed in that game, well, you are better off pocketing your money. This is one mystery better left unsolved.  Especially for the achievement hunters.",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely emotional, great characters, great story. Definitely worth the time and money. A great visual novel and one of my favourites, matched only by the original; Analogue: A Hate Story.",
            "review_score": "1"
        },
        {
            "review_text": "This is the sequel to Analogue: A Hate Story which was a politically charged tale wrapped in the framework of a science fiction visual novel complete with cute Anime companions.  You don't need to have played Analogue to play Hate Plus but I would strongly recommend doing so as it gives you context for what happened to the world the AI came from and in particular really goes into depth about the character Hyun-ae.  Where the first game was Hyun-ae's story, this game is Mute's story. It's just as politically charged, probably even more so, and deals with the biggest mystery from Analogue, which was how a modern society reverted to conservative Neo-Confucianism ideals. If you're not familiar with Asian culture at all the nearest Western equivalent I can think of would probably be The Handmaid's Tale. This game deals with the events that lead up to that big change.  If it sounds serious, it is. And it isn't. It's all told through the personal journals and political council meeting minutes. In particular there several different people whose stories you follow over a series of years and get to see how the subtle and not so subtle changes to their society affect them.  There are also some really fun, light hearted moments with the AI companions including one where you are asked to bake a cake. In real life with a real recipe and then further are encouraged to take a picture of your cake with your companion and send it to the developer to get an achievement. It's all real and I have the achievement to prove it. It was a refreshingly fun meta moment to the game and there are a few others as well like a when the AI cheekily break the fourth wall at rare moments.  There are three main paths which in turn lead to multiple different endings depending on the choices you made. While the texts you read through are the same, the tone and the events that happen with your AI companion(s) are completely different so it really is worth playing through each of the 3 paths at least once.   The game takes place what's supposed to be a small spaceship that you, the space investigator, are on with your AI companion on a 3 day trip back to Earth where you both try to piece together the mystery of the Mugunghwa (the ship that Analogue took place on).   Each path is divided into 3 days where on each day you can only extract a certain number of logs before the ships battery is drained and needs to be recharged requiring you to wait 12 hours. So yes the game does ask you to play the game in installments over the course of 3 days. However there is a way out where once you power down and save you can hover your mouse over that save file, hit the 'S' key and then continue. Note if you do this you cannot get one of the achievements though.  Another alternative is to play day 1 of one path, then day 1 of the other, then day 1 of the 3rd, then 12 hours+ later do day 2 path 1, day 2 path 2 etc. This is what I ended up doing. I think it works well and gives a nice immediate contrast between the differing paths.  One of the changes in Hate Plus is you now get hyper links when people's names are mentioned that gives an image (in realistic art style) of the person with a commentary description from the AI. This made a big difference for me personally as I not only was able to keep track of the names better but also felt like I connected with them more.  Another change is that the AI are reading the logs in Hate Plus for the first time along with you and you get their reactions and commentary that really run the gamut. Even when going back through the documents you already read for the other paths you'll want to scroll through all of it to get the AI reactions because they do differ for each path.  If you do all the paths the game should take somewhere between 9-12 hours, which may vary depending upon how slow/fast of a reader you are, how much time you spend to stop and bake a cake, etc.  Overall I would highly recommend Hate Plus to anyone who enjoyed Analogue, has in interest in visual novels or is just looking for a strongly story oriented game.",
            "review_score": "1"
        },
        {
            "review_text": "If you didn't like Analogue: A Hate Story then you aren't going to like Hate Plus. If you did like Analogue you will almost certainly like Hate Plus. And if you haven't played Analogue, you really shouldn't play Hate Plus until you do. The differences between the two with respect to game design are fairly minor but I personally found the story in Hate Plus to be much more riveting, which is no small feat. Whereas a few story arcs in Analogue fell a bit flat for me, Hate Plus had no such weakness. I would also say the plot is more intricate, warranting an entire second read just to pick up on details you couldn't have possibly seen before. Fair warning: this is a tragedy. In fact it is multiple intertwined tragedies. While there are certainly cute and heartwarming moments, this game hurts, but only because it makes you care.",
            "review_score": "1"
        },
        {
            "review_text": "Four words. 'Level Four Revive Materia'  That aside, this game is the second game, and should be played after Analogue: A hate story.   It's a simple point and click visual novel, with a bit of a twist, the game expects you to wait a significant amount of real life hours before you can complete the game. If you're impatient, you're going to hate this game. (You can change your computer's date and time though, which will work, if you're that desperate.)  10/10 - The animator for this game, and character designs are beautifully done. I can't complain, Mute, Hyun-ai (both my waifu's in the past game waaaat.) are wonderfully designed. The actual in game character art is really beautiful too, and I still really like the color switch depending on what AI you're using.  My only gripe with this game is up above, and afaik, there is -no- way to get the achievement. The story is really well done too, and I enjoyed playing through the game. Baking cake is however, not good for my thighs so thanks for that, Ms. Love. Lol... And yes, they do blackmail you for real cake. haha.  I'd recommend the game, it's well worth the price, and honestly, there's a LOT of content, so if you're patient - give this game, and Analogue: A Hate Story a shot",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed Analogue, so much that I had to rush right into Hate Plus. I couldn't be more disappointed.  It seems like the style and development of the game went into a different path. Hyun-Ae seemed so less like herself (or the way I left her) and Mute's path, while sad, I felt was a bit too sudden and overdramatic.  The story was much more political and less to my liking. I wouldn't say the writing was bad, it just didn't interest me the same way Analogue did.  Attempting to force people to wait 12 hours after 10 minutes gameplay, an achievement that isn't even programmed in the game to troll your gamers (and prevent 100%), and forcing people to bake a cake for a code to continue left a sour taste in my mouth. While half of these are easily bypassable and obtainable by other means, I felt that it was like a slap to the face to the community of those contribute to Love's income by buying her games. I think this will be the last one I buy of hers.",
            "review_score": "-1"
        },
        {
            "review_text": "I have not hated myself for not buying a game sooner than I did when I played this.",
            "review_score": "1"
        },
        {
            "review_text": " A Paladin’s Steam Review: Hate Plus. A Story of Refinement and Betrayal.",
            "review_score": "1"
        },
        {
            "review_text": "If you really, REALLY want to know what happend before Analogue and after, buy it. If not, move on with your life.",
            "review_score": "1"
        },
        {
            "review_text": "i wuld giv short-haired Hyun-ae my usb 3.0 inches.huhuhu",
            "review_score": "1"
        },
        {
            "review_text": "This game actually made me laugh, be surprised and geniunly happy about one of the most mundane and maybe most irritating things possible: Waiting.  No I am not telling you what I am talking about, buy this game and give it a look yourself because its brilliant, just like its predecessor Analouge.",
            "review_score": "1"
        },
        {
            "review_text": "See all the degeneracy that happened BEFORE the crackdown on degeneracy and realize... really, they did nothing to reduce the number of gays and lesbians sharing their feelings.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the first one better. Not so strong story here, but better interface.",
            "review_score": "1"
        },
        {
            "review_text": "  Let's get the hell out of here.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont know about you, but...........i STILL got these two ♥♥♥♥♥es on me.",
            "review_score": "1"
        },
        {
            "review_text": "My recommendation comes with a lot of caveats: - First, if you enjoyed Analogue, you'll probably like this one. However, this will not change your mind if you didn't care for the first game. - Second, like some other reviewers, I didn't find the overall story quite as engrossing, but I felt more drive to go back and replay to pick up new character reactions/interactions. - Third, be prepared to be upset about *Mute. A lot. - Fourth, and the main thing that keeps me from recommending this game whole-heartedly: WOW the narrative's treatment of *Mute's romantic preferences is really ♥♥♥♥♥♥ at times. It basically feels like she's being bullied into liking women in certain situations, and while I appreciate how there's a lot of good commentary about how one's preferences are often shaped by the society in which one lives, I still feel like it could've been handled better. If you're a queer person who's ever felt pressured to feel romantic attraction to someone you're not attracted to, you're probably going to spend a lot of time wincing during *Mute's playthrough(s) if you play as a woman. Especially in the harem route. - And finally, once again, I recommend picking up the soundtrack. The song 'Not Ero' is really cute and catchy, and I've been listening to the other tracks while writing lately.",
            "review_score": "1"
        },
        {
            "review_text": "Continues the storyline from Analogue: A Hate Story.",
            "review_score": "1"
        },
        {
            "review_text": "Hate Plus review SPOILERS for Analogue A Hate Story this takes place after that game and without it you WILL without a doubt be lost. Hate Plus gives us an insight to what happend to make the people on the ship think the way they did and why 'Zero Year' happened.  The save files from Analogue carry over they affect which AI you spend the game with, if you never played the first game you can make a new save file but again you will be fully lost, this game is a sequel but it doesn't feel like it, in this there is little interaction with the AI past small few sentince bits, it takes out showing the notes and messages to the AIs, you only talk to them when they talk to you, it takes out the magic of the original and made me feel more distant to them.  The story is good and it tells you what happend to the ship the politics of its leaders and why its people have such anti woman views, again like the first it deals with feministic ideas and the like and again not always a bad thing, it's definitely more visible in this one, what you learn in the new logs reinforces the fact that the people on the ship weren't aganst woman baised on their own ideals but on their education system,they were taught that from birth that men are better and woman need to stay out of the way, they knew no other way.  There was in my opinion unneeded love storys that although move into the other storys slightly they were just that, unneeded the story would have been fine without any love storys, then theres the awkward to read sex parts of the love storys but they are as unneeded as the love storys, you want the love storys fine but too have multiple sex pages is unneeded and just awkward to read.   The game takes place over three real days, you get a set amount of power you can use to get Logs and after you use the power you must wait twelve real world hours (or skip like a cheater) to get more power, I have mixed feeling about this as for one it offers immersion to the game but then after you read all the logs you can with the power you have to wait and if you just can't wait for the next part of the story it sucks.  all in all the game suffers from it failing in compairison to the original but it still has the two AI that you know and love (or hate) and they stay true to who they were in the original and it closes the mystery of why the ship is the way it was.   PROS Starts and Finishes the story that was never told in the original. You get to hang with an AI some more! you get to learn why the ship's people were the way they were. Immersion with the time function.  CONS Not being to talk to the AI about the Log you are reading at that time unless she talks to you first. Unneeded love storys. Really uneeded sex parts of the love storys.  The time function and having to wait for the next part of the story.  This game is mostly for the story and understanding the who, what, when, why and how everything happened, if you liked the original then you'll more then likely enjoy this game for the story.  I rate it 6/10",
            "review_score": "1"
        },
        {
            "review_text": "When I first picked up Hate Plus I had no idea what I was getting into. While you spend a lot of time reading, the stories are very well written. Your robotic AI has a lot to say and her emotions are clearly portrayed on the anime artwork present. You get choices at various points in the story which affect the mood of your AI buddy.   You can unlock new bits of text at regular periods before you have to take a break and read again. This keeps you coming back for more and overall it does a great job at establishing the universe. Personally I've enjoyed this and this is well worth picking up if you like reading blogs and trying to understand the emotions of others.",
            "review_score": "1"
        },
        {
            "review_text": "Spent 9 days to complete the game just because I want to unlock the achievement. LOL.  I said I bought the cake. And, nope, I didn't. I'm glad *Hyun-ae didn't find out about my lies or I'd be terrified by how come she knew about it all.  My favorite moment is during the beginning of the harem route, where *Hyun-ae explained about cannot installing dictionary and her texbox get bigger because of the text and *Mute just shouted: 'GEEZE, WATCH YOUR TEXTBOX SIZE, OKAY? THAT'S MY FACE YOU'RE COVERING.'  In the third gameplay (fortunately I've finished the harem route in Analogue before started Hate Plus), I kinda get bored with the log files because I already know that the log files will be the same as the first and second play and not like in Analogue that I need to present a log file to get more log files, the log files in Hate Plus are available without further interaction needed. I miss the gameplay that need player to present a certain log files to get their comment or to reveal more log files.  The user interface ... I think it's so cramped when compared to Analogue. And when scrolling on the log, sometimes I felt my mouse wheel stuck (my guess: it's because the mechanic to change the AI's expression and show up their comment when player reach relevant text on the log files). I think something like, 'Oh, okay. So my starship, the White Princess, is sooooooo smaaaalllll compared to the 100 decks Mugunghwa. That explains the user interface.'  If you have played Analogue, I do recommend you to play Hate Plus. Find out what happen before year 0.  *begin playing It's Not Ero! from the Hate Plus OST",
            "review_score": "1"
        },
        {
            "review_text": "A far better game compared to the first. New profile list and hyperlinks make it easier to understand the story and characters. If you want to learn more about yourself and humanity, play Hate Plus.",
            "review_score": "1"
        },
        {
            "review_text": "A good game that continues from it's predecessor. Loved that the saves were carried, on the fact that we had logs. Wait I kind of disliked was the wait time, the whole matter of mute not being able to change, and currently questioning how to get that four materia one. Either way this game promises a nice addition if you have played analogue. In this game you are put to a different interactive sense which applies to a notable level both nice and annoying. Scrolling through logs and logs seeing feedback can be quick interesting but I warn you skip too fast on scrolling you might miss a great reaction from either one of the AIs. I was satisfied as I played through the routes, read up in interest, and the fact that you learn a bit more. However what I do wish there will be maybe another installment like this. If not continued works from the creators who amde this as it was worth taking the time to play and take part in. However I know a lot are stressing over the achievement hording. What I just hope is that we get the chance to have more clothes for the character. Either way my rating of the game would be a 7.5-9. In general it reached my expectations and past some in dialogue but left out. On average it would be an 8.8-8.9. In it's own right, it attracted me to play it more than once and save like crazy. I know you can roll back for route but that's limited. Either way, great game, good story, and hope for more.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game highly enough, The game is a continuation of 'Analogue: a hate story' so you should play that first, but:  If you have ever played a visual novel (sometimes called 'eroge') for the sake of the story, then, Yes, play this series.  If you like the idea of a game mixing with your real life and require you to take a photo for the sake of an achievement, yes, play this series.  If you like the idea of digging though a ship's log in order to find the truth and having two AI's interact and feed you more information, then play it  If you like Tsundere characters... PLAY IT, PLAY IT NOW.",
            "review_score": "1"
        },
        {
            "review_text": "Hate Plus is a direct continuation of Analogue: A Hate Story, both in story and feeling of the game. I was a bit worried that the wait between days would be a little... gimmicky, for lack of better word, but it honestly works, as trying to power through this much powerful but depressing storytelling would most likely be extraordinarily difficult to do. While it's not as if it takes a great deal to impress me, I found the writing and characters to be well done, along with their interactions with either you or each other. There's a great deal of both comedy and tragedy put into this game; I found it to be a good experience to play through. If you enjoyed Analogue, you'll want to pick this game up. If you've never played Analogue, I'd really recommend to start with that, as it will really help you enjoy this one. Overall, it's a good game and excellent continuation of the last.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, where to start.... I binged this game over three days, only taking this long because the game forces you to take downtime for 12 hours as part of an interesting 'real-time' element. While it isn't as thoroughly absorbingly and content-rich as its predeccesor, Hate Plus is still an engrossing story that'll keep your eyes glued to the screen. I even found that I had firmly established a waifu by the end of the story! Christine Love is one hell of a writer, and she unfolds her tales not unlike a film director or an accomplished playwright, successfully mixing drama, levity, and believable characters and dialogue together to make the perfect brew.",
            "review_score": "1"
        },
        {
            "review_text": "And so it continues!  Hate Plus continues the oh so wonderful story that was left behind at Analogue A Hate Story and it is fantastic continuation. The music is breathtaking very much like Analogue and it's story will have you hit with a list of emotions about the things you read.  You dwell into the further past of the security AI* Mute to find out how the 'proud security AI' let such a horrible thing happen to the generation ship Mugunghwa. What happened? Only three days to find out~  Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "An emotional rollercoaster you share with a very relatable NPC. Interesting concept, forcing the player to wait a real time day to continue but it gets annoying when finishing other story paths. The biggest issue is the scrolling. The system is unresponsive at times which feels like getting caught on a doorknob. Lots of storyline variety with capacity to load Analog: A Hate Story's saved games.",
            "review_score": "1"
        },
        {
            "review_text": "After Analogue: A Hate Story, this game for me was an instant buy. Analogue was such an unexpected, heart wrenching and yet enjoyable visual novel. I expected the same of Hate Plus and wasn't disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "It's very easy to accidentally play Hate Plus in a way that will rob you of your enjoyment. If you have not played Analogue yet, stop reading this review right now and go play that game instead. Without the background of that story, Hate Plus has very little to offer you. If you have played through Analogue already, and earned the super-secret harem ending, I implore you to NOT choose the Harem route for your first play through of Hate Plus! Instead, play through *Mute and *Hyun-Ae's stories first. In many ways the Harem route is the most interesting (because you can see the interplay of the two heroines), but tackling that route first is like eating your dessert before your dinner...you'll lose your apetite to go back and miss out on the real meat of the story as a result.  Recommended route order: *Mute, *Hyun-ae, harem.  With that public service message out of the way, on to my real review. Hate Plus is a surprising follow-up to Analogue: A Hate Story. There's a lot to dislike about this follow-up. For as little gameplay as the original had, Hate Plus has even less. You won't find any command line puzzles to work through, and unlocking and reading logs doesn't feel nearly as interactive or satisfying. Instead of having a dialogue with your AI companion, you merely select the article you want to read from a list, and dig through the records at your leisure. As a result, the experience is less curated and directed, and doesn't have the same air of mystery that the original game seemed to embody.   Despite that, there's still a lot to recommend this game. Hate Plus answers all the questions that the first Visual Novel raised, and adds in the very interesting character of 'Old *Mute' who plays a prominent role in the history of the Mugunghwa. And while the flow of the game isn't as tightly curated as a traditional Christine Love game, the story is incredibly fascinating when approached appropriately. (Pro-tip, Try your best to read the logs chronologically.) Moreover, the interactions with the AI really shine, and are really what make the game worthwhile. *Hyun-Ae will make you question the nature of fictional characters and artificial love, while *Mute will open her own can of worms.  Ultimately, if you liked Analogue and find yourself thirsting for more info about the Mugunghwa's slide into Neo-Confucianism, Hate Plus will certainly scratch that itch.",
            "review_score": "1"
        },
        {
            "review_text": "Christine Love's ability to elicit weird, weird emotions continues in  Analogue 's sequel,  Hate Plus . I'll just say this: pay attention to how you feel about *Mute's character development, both before and after you complete the 'Deep Space Therapist' achievement.   Anyway, if you played  Analogue: A Hate Story , then you'll play this as well, because it's even better.   Where  Analogue  focused on the micro-,  H+  focuses on the macro-. For the former, the focus was on understanding the contours of a deep-space neo-Confucian dystopia — the day-to-day existence. For this game, the emphasis is on HOW all that came about, on the many factors that led to that society — factors conspiratorial, political,   radiological  , cultural, educational, artistic, macroeconomic, public policy, and yet still oh-so-thoroughly personal.   10(to as many significant figures as you please) out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Hate Plus is basically must-play for anyone who enjoyed the original game. It's a bit easier to navigate but essentially works in the same way, reading official and personal logs to discover what happened to this generational ship and it's culture a long time ago. There's some really good content, with my only complaint being that you figure everything out about 75% of the way through, and the last quarter of the game is just tying up some loose ends. You get to interact with the same AI characters from the first game, but this one is really the story of *Mute and you should definiely play it with her at least once.  My bigger complaint is with the malicious achievements in this game, such as having to email the developer a picture of a real life cake and wait for them to possibly send you a code. Luckily the forum users have found a way around this one. Another achievement requires you to play the game over the course of 9 days. The game you paid for and should be able to play as much as you want. And they even decided to make one achievement impossible to get. So if you're an achievement hunter, this one is really going to bother you.",
            "review_score": "1"
        },
        {
            "review_text": "No logs, no cgs unlike analogue. The story is nice, but having worse game interface is oom.  ",
            "review_score": "-1"
        },
        {
            "review_text": "'Do you have [cake ingredients]?' &gt;Uh probably not any pure cacao better just say no 'That wasn't enough time to look, go and actually literally check. Just in case.' &gt;Actually have all the ingredients &gt;But wait she has to be talking about my character, right? &gt;My character's alone on a tiny ship, definitely wouldn't have cake ingredients &gt;Yeah just think about it as my character, that'll be fine, that's reasonable 'Did you, the player, actually make a cake?' &gt;I GUESS I'M MAKING A CAKE NOW  Culinary sidequests aside, Hate Plus is an outstanding game that fulfills what was hinted at in Analogue - so much so that it makes Analogue, a very good game in its own right, feel almost like a mere prologue. You get the chance to delve deeply into the political machinations that led to the year-0 reset and peculiar dynastic state of the Mugunghwa, and even if political machinations and conspiracies and election fraud and rebellion aren't your cup of tea, there's some great character development on each route, and the dialogue in all areas is top-notch.  One slight issue worth noting is that, much as with Analogue, it's very possible, if you choose the proper entries, to figure out the core of what happened within the first two days and be left skimming some fairly extraneous entries on the third. A few entries seem rather out of place for the intended purpose of explaining what happened, but hey, considering there's an impossible achievement that MIGHT have something to do with a secret message (okay, it's PROBABLY actually impossible), the benefit of the doubt is probably justifiable.  Regardless, it's a great game. Play Analogue, play this, and don't forget to stock up on baking supplies.",
            "review_score": "1"
        },
        {
            "review_text": "A really good and diferent 'Visual' Novel, while it is not for everyone. It focuses on computer/human interaction. It centers on transhumanism, traditional marriage and society problems on the extreme. While it is not a long read, its themes are a little heavy, so a mature and open mind and tissues are recomended.",
            "review_score": "1"
        }
    ]
}