{
    "app_id": 239720,
    "name": "PAC-MAN™ and the Ghostly Adventures",
    "release_date": "2014-03-06",
    "developer": [
        "NAMCO BANDAI Games"
    ],
    "publisher": [
        "BANDAI NAMCO Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Platformer",
        "3D Platformer"
    ],
    "achievements": 25,
    "positive_ratings": 126,
    "negative_ratings": 33,
    "price": 29.99,
    "description": "Pac is back in an all-new experience for a whole new generation of fans. Featuring an original storyline inspired by the show as well as all the charming characters from the highly anticipated PAC-MAN and the Ghostly Adventures animated series created and produced by Avi Arad, acclaimed director and founder of Marvel Studios.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/239720/header.jpg?t=1478043105",
    "minimum_requirements": "OS: Windows XP, Vista, Seven, 8 Processor: 2Ghz Dual Core or AMD equivalent Memory: 2 GB RAM Graphics: 512MB video cards Pixel Shader 3.0 DirectX: Version 9.0 Storage: 4 GB available space Sound Card: DirectX sound device",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have some things to say about Pac-Man and the Ghostly Adventures. The sort of things you’d expect to be discussed about a 3D platformer, be that on the topic of level designs or how every 3D platformer is essentially Super Mario 64 redubbed. I promise we’ll get to those things, but first there is something more important I need to touch on, and that is: what the bloody hell is going on with Pac-Man’s lore?  I know what you’re thinking. “Pac-Man has lore?” At some point what was once a sparsely animated, power-orb munching arcade game would appear to have been wholly transformed into all manner of mass merchandise, chief among them now an animated kids show bearing the same name as this new entry in Pac-Man’s gaming catalog. What exactly goes on in this show remains a mystery to me, as the game itself offers not so much as a cursory explanation for some of the most bizarre developments. At some point Pac-Man appears to have made peace with his age-old ghost antagonists and is now…attending high school with them? Whatever truce was made though only seems to apply to the four most recognizable ghosts of the series, as Pac-Man is more than ready to devour each and every other ghost he encounters on his journey to do “something”.  The plot is of Ghostly Adventures remains entirely unclear to me, but it would seem to involve ravaging ancient temples for anything not nailed down, to then be immediately consumed by Pac-Man. For however altruistic Pac-Man would profess himself to be (proclaiming himself at times to be a super-hero), his entire purpose for being seems to solely revolve around gorging himself. On fruits, on ghosts, on historic artifacts, Pac-Man doesn’t care! The only thing more present than ghosts in this adventure are burger dispensing vending machines, though if need be Pac-Man seems just as happy to rummage through a trashcan for a bite to eat. His insatiable appetite is perhaps on the surface innocuous, but there is something deeply disturbing about a world that seems to exist solely to appease the hunger of its most famous resident.  So too is Pac-Man’s relationship with the ghosts that for some reason are both accepted and outlawed, simultaneous friend and foe, or more accurately, food. At one point it is revealed that collecting the eyes of ghosts will allow Pac-Man to generate more lives, calling into question just what exactly pac-people are. Were ghosts once pac-people too, or did the pacs evolve by devouring and multiplying through the consumption of ghost eyes? Is the real reason for the eternal war between Pac-Man and ghosts actually the result of pac-people enacting genocide upon the already dead for the sake of some disturbing means of reproduction? How many thinkpieces will it take before we arrive at the conclusion that Pac-Man was the monster all along?  There is a layer of Ghostly Adventures that I would love to believe is inexplicably aiming for subversive surrealism. So much of this kids show spin-off feels odd and unnerving compared to the Pac-Man games before it, that to have it finally reveal itself as some deeper commentary on an industry that refuses to let old icons die would be incredible. But the truth, as is so often the case, is far more mundane and expected. Ghostly Adventures ultimately isn’t the abstract arthouse Pac-Man game I never knew I wanted (and probably do not actually want to play, but only to exist), but merely the inevitable result of a series that has long since fallen out of relevance. Aside from perhaps Sonic there are few greater gaming has-beens than Pac-Man, a character who never really got to be one, but was almost immediately repurposed into a brand icon. At this point it seems fair to say Pac-Man is more popular within the realm of phone cases than videogames, and Ghostly Adventures isn’t going to change that. It’s a feeble attempt at regaining interest in an outdated mascot, breed from an even more misguided ploy to appeal to an audience that is likely too young to have ever even had an affinity for Pac-Man as anything more than a recognizable face of gaming.  Ghostly Adventures exists in the realm of so many TV and movie spin-off 3D platformers, which are at once entirely inoffensive and unremarkable. Remove Pac-Man and the ghosts and this could just as easily be any N64-era inspired platformer, replete with the requisite abundance of meaningless collectibles, and a camera that is often nauseating even when it’s working as intended. Levels are standard fair straight shots, relying mostly on an abundance of ghosts to slow you down than anything approaching clever platforming. Ghostly Adventures would almost be obnoxiously easy and trivial if it were not for how easy it is to die from slipping off a ledge or clipping on the edge of a platformer you ought to have been able to make. I never died so often as to have anything less than an unreasonable amount of extra lives, but each death brought with it enough repetition to still be an absolute chore to deal with.  Every platforming standard is accounted for in Ghostly Adventure, but it somehow manages to make genre conventions even more dull than they already were. There are ice levels and fire levels, spooky levels and colorful levels full of interconnecting tubes (the exit animations for which are probably the most variety to be found in the whole game), but it’s all so astoundingly boring. And maybe it’s my fault for hoping this game would be even slightly more than it appeared to be. It’s possible I am simply, as a friend put it, “kicking a kids game in the shins,” but even then I have to wonder what kid is going to play this over the likes of Mario or Minecraft. Perhaps judged solely against other games likely to confuse grandparents and disappoint their grandchildren on Christmas, Ghostly Adventures is far from the worst you could do, but calling it acceptable mediocrity hardly seems much of a compliment.  Ghostly Adventures is so utterly typical that it is too mundane to be legitimately upsetting. It falls perfectly in what seems to have become an established trajectory for videogame mascots (pioneered primarily by Sonic), where upon reaching peek obscurity developers then resort of inserting their iconic hero into games they were never designed for and which in turn do little to regain the status these characters once held. Ghostly Adventures isn’t bad, per say, it is just exceptionally uninteresting. It is not unreasonable to say you might enjoy parts of it, but even in its normality Ghostly Adventures finds a way to grate on you. Maybe it’s the way Pac-Man ends every level with an enormous burp which sees a swarm of ghost eyes escape from the bottom of whatever is inside his spherical body. Or it’s the realization that you’re playing a Pac-Man game that is in no way Pac-Man, but is rather the cold, inevitable result of a game designed for the sake of marketing potential. Or maybe it’s just that Pac-Man was always more cultural icon than game character, and that’s probably for the best.   You can read more of my writing on  Kritiqal  [kritiqal.com] . ",
            "review_score": "-1"
        },
        {
            "review_text": "Pacman is one of my fav games i love it and it seems that anyone else who has played it hates it i dont know why its fun with cool power ups and decent graphics and i an understand why people are upset about how they made it more 'hip' but realy thats a turn for the better by introducing pac-man to a new era of gamers and helping the old washed away hero become popular again sure they changed his roots but thats why they needed to do in order to keep the pac surviving and dont get me wrong here this IS NOT A GREAT GAME ITS NOT 10/10 GOTY but its stil good and a nice to see a 'New Pac' so while this game has its negatives it also has its ups and downs.  I give this game a 8/10 Namco did not take a ♥♥♥♥ on pac-man they did what they had to do to survive in this day and age of gaming and i respect them for that and yes it is true THE PAC IS BACK",
            "review_score": "1"
        },
        {
            "review_text": "The show this game is based off is complete crap, but this game is a bunch of easy fun. If you can get it for $5 and like Pac Man, I'd say buy it mate.",
            "review_score": "1"
        },
        {
            "review_text": "Very easy and simple most likely for children, but for whatever reason I liked it. It controls well and is a decent platformer. The only thing I didn't like was Pac-man and some of the enemies constantly make stupid puns.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the only issue I found is that it has an unremovable cap on 30fps.",
            "review_score": "1"
        },
        {
            "review_text": "A neat little platformer that is visually appealing and mostly satisfying to play.",
            "review_score": "1"
        },
        {
            "review_text": "You cannot change the graphics settings in this game, and that warrants an instant 0/10  Oh and this game is ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks it is horible and the camara is the worst I have seen. The game is worth 50 cents. I can make a better game and I have. Making a better game is not hard you just need to know basic programming things. I hate it but can't get a refund which sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "After 100% and playing through the whole game twice I think I can finally review it.    Short review:  It’s a decent and simple 3D platformer that you should probably pick up on sale, but maybe not on the PC mainly because if you do like the game and want to play the sequel then you’ll have to get it on a console since it probably won’t be released on PC. Although this only if you can ignore the ‘new’ Pac-Man.    Longer review:  Ah what can be said about Pac-Man. A legend to the video game industry? Or maybe one of the most recognizable video game character next to Mario? Well how about a new hip memester? Eh doesn’t sound that great and honestly that is probably the weakest part about this game. It’s just this ‘new’ Pac-Man himself it might just be with my age and not understanding why he burps at the end of each level, but maybe the kids these day will enjoy who he is. If you can ignore the ‘new’ Pac-Man, like I did then you’re in for a treat with this game. 3D platformers are a dying breed in the modern video game industry (2016). So when one comes out I’m always into checking it out and giving a chance mainly because unlike the 90s where 3D platformers were just in for the $$$ sorta like fps these days, 3D platformers create these days seem to be much more polished than ever before. Getting the story out of the way mainly because it’s very simple and I’d expect it from 3D platformer and especially a Pac-Man game. It’s the ‘get the important item before the villain gets it and takes over the world!’ It’s there and each cutscene can be skipped so if you have no care about that then you can easily ignore it. Control wise I should of probably tested how the keyboard and mouse handles, but I didn’t and played through this game with a Xbox 360 controller, controls are great overall. Gameplay is just like any other 3D platformer where you start at point A and try to get to point B. There's a enemies in the way and some type of ability mechanics in there. Ah yes Pac-Man can get abilities examples like fire, ice, metal, meme etc. They’re all fine and control well for the most part although very generic. The worlds also have the same problem as the abilities. They’re all just generic and 1 of them is even repeated. You guy the city, temple, volcano, iceland in the volcano, city again, and sorta volcano again it’s more in the area of hell though. They’re just there and some are longer than others mainly the later worlds where there’s only some a few levels in the world probably the game being rushed, but who knows. The game does bring some challenge which is nice I mean it can’t just be some cake walk. Graphics are acceptable and the music isn’t the most memorable soundtrack out there also if you’re a nazi about ‘muh 60fps’ then you’ll gas this game because it’s locked at 30fps. Now finally to the important question is the game actually fun? Yes it is, there isn’t some type of collect a ton aspect to this game, unless you’re going for all the achievements (which I do plan on making a guide for). All the levels aren’t that long and the boss fights aren’t overly frustrating. Like I said before buy this game on sale for &lt;$10. It’s fun and won’t take you that long to finish. Have fun with the ‘new’ Pac-Man!",
            "review_score": "1"
        }
    ]
}