{
    "app_id": 239840,
    "name": "Dead State: Reanimated",
    "release_date": "2014-12-04",
    "developer": [
        "DoubleBear Productions"
    ],
    "publisher": [
        "DoubleBear Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Zombies",
        "Survival",
        "RPG"
    ],
    "achievements": 12,
    "positive_ratings": 1405,
    "negative_ratings": 526,
    "price": 14.99,
    "description": "Dead State is a narrative-driven survival RPG set at the dawn of the undead apocalypse. Drawing inspiration from classic RPGs like Fallout, X-Com, and Suikoden, Dead State combines strategic, turn-based combat with base building mechanics, character creation, and social management.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/239840/header.jpg?t=1447357941",
    "minimum_requirements": "OS: Windows XP/Vista/Windows 7/Windows 8 Processor: 1.7 GHz Processor or better Memory: 2 GB RAM Graphics: Nvidia Geforce 8500 GT / ATI Radeon HD 7290 (512 Mb) or better DirectX: Version 9.0c Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Spent 168 hours with the game, both beta and full release. Wanted to finish it before I reviewed it.  I really enjoyed this game. It was exactly what I was looking for in a Zombie Survival scenario.  I love basebuilding and while the system was simple, seeing my home base develop was grand.  I love the characters you can recruit. And the fact that some &lt;most&gt; of them don't like each other. Managing your people is a big part of the game. I like that. I also like that not all of them are necessarily likeable people. But I played it trying to save as many as possible.  Game still had some bugs. None of them were game breaking for me. The 5 post release patches have made things better. I expect further patches will make things even smoother.  After I fininished I was left wanting more. Which to me is the deciding factor.   So this game is well worth your 30 bucks.  ",
            "review_score": "1"
        },
        {
            "review_text": "Come a long way since alpha. I enjoy this kind of game, not so tactical as to make it a chore, instead focusing on the story and the flow. It fills its own nieche in post apocalyptic survival games, and it does it well with a mix between combat, human interaction and planning. Highly recommended to anyone who likes a bit of thinking and wants a beer and pretzels game. (Still has a few bugs, but nothing game breaking.)",
            "review_score": "1"
        },
        {
            "review_text": "So far I've logged 100+ hrs on Dead State and feel that I've played and seen enough of the game to form a decent opinion of it.   I'll be honest, I'm a little biased when it comes to cheesy zombie stuff and I love most turn based RPG games so Dead State was right up my alley and even with its flaws, I loved it. I do not regret purchasing this game and feel that it is worth its current price for the amount of time you will spend on it.  WHAT I ENJOYED ABOUT DEAD STATE:  Every location on the map is unique, the amount of detail and lootable containers is very well done, each location tells its own seperate little story. Some locations are tiny enough you only need to visit them once, others are so large you need two or three trips to loot it all out.   Good old fashioned text! Even though the game is fully text based, it does not take away from the game as I found the story, personal stories and crisis events to be very well written and believable. The game has an interesting and large cast of characters and each of them has their own quirks, and personal issues good and bad, not everyone gets along with everyone, there is internal conflict based on the decions you make.   Micro managing your group of survivors from the job board. Brilliant! You can assign jobs to your survivors based on their skill set. As you find survivors out in the world map you can recruit them, each having their own set of skills. Some are more suited for tasks than others and parts of the crafting system can open up once certain requirements are met. The high school setting really is an all too ideal setting, it basically has everything you would need to survive in a zombie apocalypse.   COMBAT!:  This was hit and miss for me, but overall it wasnt that much of a negative experience as I've played worse in turn based-RPGs *cough* Blackguards *cough*. Dont expect X-Com type combat, there is no cover or crouching, no overwatch or support fire, no destructable environments or elevated terrain.  My biggest issue with the combat is that the A.I. can be a little annoying (extremely slow) if there is a large queue in the turn order.  However I feel the combat system really suits the game setting. One of the cool things I liked about the combat is the decible meter and how certain weapons generate a lot more noise than others. This adds an element of strategy specific to the generic zombie theme where they are drawn to sound. Start making enough noise in a fire fight with some human bandits and the next thing you know, both sides have to deal with a mini horde of zombies.   PROS: Turn based zombie-RPG. Character progression. Choices you make in game at certain points greatly effect you going forward. The game is all text based, but writing/story is very well done. Most of the level designs are very detailed. Nice varied assortment of weapons, most of which can be upgraded. Crafting items and upgrading your base. Based on your choices, the game has a bit of replayability value.    CONS: The game tends to crash often and when least expected. Save often. 90% of everyone male/female has the same nose in their portrait picture. The A.I. can be slow if there is a large queue in the turn order. Game launched with a laundry list of bugs and known issues.",
            "review_score": "1"
        },
        {
            "review_text": "At this point the title is pretty solid. The game appears more or less bug free at this point, in 111 hours I encountered only two bugs ( a unlootable medicine chest due to bad door placement, and a one time event where a baseball bat allowed ranged attack). Neither of these are breaking things, and very rare. Dead state has a lot of content for not a lot of price, especially if you get it during a sale or as part of a bundle. It's what I imagine state of decay would be like as a proper turned based RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Dead State is a very unigue, one-of-its-kind, single-player RPG set in a zombie-apocalypse environment. It has many interesting NPCs with different stories, strengths and weaknesses, that will keep players entertained throughout the game. Its turn-based combat system is old school, but challenging and even nail-biting at times. The foraging and base managing systems set a new standard for zombie-themed games, with hundreds of different items that can be consumed or used in many ways. Overall, this is a MUST-PLAY game for all who are interested in zombie-themed games.",
            "review_score": "1"
        },
        {
            "review_text": "So far, ive enjoyed this game alot, sure there are some bugs, but they are getting dealt with one by one, great game!",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty fun, but it still have some bug. At 'release', however, it was a lot worst, but now it's fine to play, even if some problem still occur from time to time.",
            "review_score": "1"
        },
        {
            "review_text": "Really Addictive, I'm not one for turn based games, but if your into roleplay, you can really enthrall yourself in this one. It's got one hell of a storyline and really makes you think about your decisions and pay for them good or bad. I've gotten my money out of it ten fold already, I would rec this to anyone who roleplays and I gotta tell you, expect to get every penny out of this one. The company out did theirself.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best zombie survival game out there. Nice turn based combat and resource management. RPG elements feel a bit thin, but otherwise very enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "super challenging game",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game so far, only played it for a few days but it has roped me in. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, well worth the money. Highly recommend for strategy/Fallout 2 lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Kickstarted this game and only recently got around to playing it. I've put quite a few hours into it (a lot offline) and although I've come across some graphical bugs, I've not encountered anything game breaking. I think the graphics are good, combat is interesting and being turn based is great for when you have to stop mid battle due to real life. Story is ok, no nail biting edge of your seat stuff, but does the job. Base building and RPG elements add a nice touch and do more to keep you invested. There is also a forum which I've browsed a few times and has been great for hints and tips.  Conclusion: I would (and have) recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game with a few reservations.  First, it's not for everyone. The game can be very repetitive. Managing a group of survivors and locating resources to build and feed everyone sounds fun, but what it amounts to is little more than going from one area to another, clubbing everything to death, and putting all their food/fuel/ammo in your inventory. Then doing it over and over again.  Second, the combat is not very good. I found it poorly paced. There is a very basic early game, middle game, and late game, but the jumps between them seem don't transition well. It's all based on armor, really. Having better armor suddenly makes you immune to so much damage. Combat pretty much boils down to doing the same thing over and over again, with very few interesting mechanics.  Third, the game is not paced well. This goes hand-in-hand with repetitive. There are very interesting storylines and elements, but there are large bouts of nothing followed by sudden bursts of activities, particularly close to the end where there bouts of nothing become longer and longer. The game could use a BIT more activity/story.  With all that said, this game is interesting, fun, and contributes to the genre in a much needed way. The devs are actually patching/making improvements, so I consider that a strong plus as well. Some bugs remain, but they're definitely working on it, and I didn't run into any major issues (although a few annoying bugs were present). I enjoyed leading my group through some tough situations and exploring post-apocalyptic Texas, meeting new people, and exploring a variety of environments. There is some difficulty in building morale/food stores in the beginning, but this is actually fun and contributes to the difficulty of the game (something that is lacking at a certain point).  One final word. The game has some political (ridiculous conservative/Texan stereotypes) elements to it. If you're sensitive, you probably won't enjoy this game. It was bit heavy handed at times, to be honest. Still, I enjoyed this game overall and would recommend IF you have a high tolerance for reading text, doing repetitive tasks, and some amount of 'roleplaying'. You should also, of course, really enjoy the genre as well!",
            "review_score": "1"
        },
        {
            "review_text": "9/10  This game is great. Despite what other reviewers may have said, this game is relatively bug free. The story is really good and compelling. The combat is fun and exciting. I'm 32 hours into my game and have not experienced any game breaking bugs, or even any major bugs. 32 hours and I'm not even that far into the game, quite a lot of 'bang for your buck'.  Would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! There are a few bugs but most of these were corrected on the reanimated update and even so the flaws are easily overlooked by the fun I had playing the game. It has a unique gameplay for an rpg since your character levels up based on what you achieve for the group of survivors. The story is very interesting and gives a feeling of living the story of 'The Walking Dead'. From my experience the developers were always keen answering the players feedback and I would like to congratulate them for the great gamming experience they gave me. If you have the patience to overlook some of the flaws of the game your are rewarded with an amazing time playing this game. I paid full price for this game and it is worth every penny. I really hope for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game but since the reanimated update the zombies seem to move to fast and have more than one turn plus the to hit chance appears to have gone done.  I now also think that if they make a sequal then they need to use a much better engine  If you want to see gameplay of this i recomened Metal Canyon on youtube.   since they left the game it has demorilised many of people who considered buying the game of (as in my case) have bought it but hoped for them to keep inmproving it. i loved the game but now it just feels like its been left to die, despite as i say many people enjoy or enjoyed the game and we have made it know that we enjoy the game and would hope that they would make it better. fix bugs, improve combat, more complex moral system and other things but yet they have left it to die.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of interesting fun, nicely mixing tactical exploration and combat with strategic base management. Unfortunately the release wasn't quite up to the quality standards I expect, so unfinished, but given the amount of work they've put into further bugfixing I wouldn't hesitate to recommend to a friend. Looks like low replay value. ",
            "review_score": "1"
        },
        {
            "review_text": "Dead State is... Let us say, a strangely designed game. When you start to play it, for the first few hours, it is very interesting and engaging, if you, like me, can disregard very outdated graphics, somewhat clumsy interface and occasional bugs.  At first, survival feels really hard. Every day, yout scavenging party goes out to find food and fuel, and usually can just about bring enough of both back to prevent Shelter from dying outright, but not enough to feel safe. It's a real struggle and it feels interesting. Even more interesting are dialogues with your fellow survivours.  Unfortunately, it seems that time or other constraints prevented DoubleBear team from really completing this product. When you finally find horses that allow for faster travel (and, therefore, for two expeditions per day!), you beging to gather more food than strictly necessary for survival. At this point, the second part of the game should begin, but it doesn't. Most of the important events are tied only to day number, not your actions. And since survival is no longer a day-to-day concern, you start to feel bored from clearing same-looking supermarkets, houses and camps.  The problem is compounded by many bugs in many scripts. People do not notice completed quests (thankfully, this mostly goes only for minor tasks). People disregard events that already happened. People give you information about locations you have already visited. The worst moment, however, came when one game faction reportedly wiped another, but when I came to their old site, they were there, along with a duplicate of character that came to Shelter with the news of disaster!  The ending, when it comes, seems rarther aburpt. There are a number of endings, some of them more anti-climactic than others, but I must say I'm not very satisfied with them.  A few words about combat. It's not particulary good, but it's not particulary bad, either. The dead stop being a serious threat quite soon, but armed people remain a problem nearly to the very end, especially in large numbers. AI is bad, but it doesn't matter too much. (And at least it's better than in JA: Flashback). I'd say the combat is on the par with Wasteland 2, which is not saying much, but it's not awful.  Despite everything, I had fun with this game. I liked exploration and texts, even when they were bugged. I wouldn not recommend it for everybody, though. You have to be tolerant of crashes (fortunately, quicksave is VERY quick!) and bad graphics. Still, I feel like a lot of love was put into it, and it shows, even if the end product is somewhat mishappen.  I'd say you should wait for patches, but so far there was only one, and with the number of crashes, I'd expect the developers would try to hurry with fixing at least a few of them, so I do not have high hopes. Still, even with all the bugs, I managed to finish the game, so at least it's better in that respect than pre-patch Arcanum was :)",
            "review_score": "1"
        },
        {
            "review_text": "I slacker backed Dead State. I then promptly forgot about it. So I only started playing around the time Patch 4 came out. So I started from then.  Warning - This is a game that will be somewhat ruined by reading Wiki's first. Allies have stories, and sometimes they can be unpleasant. If you cheat and read about it in advance, you will lose a lot of the enjoyment in the game.  Gameplay - Interaction. There is a lot of interaction between you and the 'Allies' it adds a lot of flavour, and lets you like and dislike the allies. The Events are pretty regular, and generally pretty interesting. It can be a little repetitive, and hard to know when something new is available to talk about. Non-Allies. I don't know if I am doing something wrong, but every survivor group I meet seems to attack me. Sometimes I miss the warning messages in the bottom left of the screen, which means I keep goign when someone has warned me off. It would be nice if there were more groups willing to trade with your group, but not join.  Gameplay - Combat. Combat is quite a simple turn based affair. There is some complexity with it, in that you do have a reasonable selections of weapons, there are several tactics that can be used in different circumstances etc. Important to not however the Zombies are not the true danger in this game. It is the living survivors who will try and kill you. Zombies quickly become easy kills once you work out how to avoid notice and whittle them down. They can still be dangerous in numbers of course, and if your allies get bitten they can be infected, but overall they are not a great concern. Some of the complexity comes into drawing enemies into each othrer. Throwing a fire cracker to attract any Z nearby right into the middle of a group of violent looters. Fun. And the gun toting loonies aren't easy either. Well at least not the first time you meet them. Once you have some better gear it becomes less of a challenge.  Bugs. - I haven't come across any game breakers. I did get the pleasnt oaks hostile email howerver.  Overall I am loving this game. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I ever played. Its a mixture of State of Decay and Fallout 2. It has a few minor bugs, but still is a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I am a huge fan of the combat style, and it does an even better job of post apocolypse I feel than Wasteland 2. If you enjoyed X-com combat this is definitely a game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Even when it has some bugs (enemies shooting through walls, enemies passing through walls for example) after near 70 hours of gameplay and having ended the game i just can recommed the game to everyone into RPGs and Zombies. This is not a zombie bashing game, its a survival experience, where you manage and develop your own community of survivors, with all the social and survival problems. Social aspect of the game is not very developed, and in the end it becomes very easy (once you have a good set of weapons and armor zombies are a joke). Game ended at day 85 but i didnt have anything else to do since day 79. Anyway, as i said, its a good game that can keep you entertained for several hours. Its not the definitve zombie game, but fans of RPGs, turn combat based games (not as good as X-com) will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game when it was first released in Early Access. I had originally found this game's development page about a year before it was released in Early Access. This game did have a rocky start, and I didnt think it would have a good development behind it......boy was I wrong. This game is not the most epic game ever made, but it is something you should get into if you like Zombie survial/turn-based games. Its not open world, You have a map with set locations, and those locations expand to a small set area (best example I can think of is Wasteland 2). I will say this though, this is a good zombie turn-based game with a great story behind it, and I am glad to have backed it up with my very early access purchase of it.",
            "review_score": "1"
        },
        {
            "review_text": "I am a big fan of games with intricate management and strategy and thus, this game rates highly with me. If you love to manage people, a base and resources, this is a highly recommended game.",
            "review_score": "1"
        },
        {
            "review_text": "State of Decay meets the original, isometric Fallout. I'm really glad to have kickstarted this thing. Everything was going well 10 days into Iron Man mode, got cocky, died, game over.",
            "review_score": "1"
        },
        {
            "review_text": "Is it perfect and polished? No. Can you have fun in it? Absoulutely. Do I recomend it? Hole-heartedly. Can you put more than 90 hours into it? Yes, you can. This is one of the best zombie games I have ever played, if you can look past the bugs, glitches and general... unpolished state (pun not intended), then this might just be the game for you. But I also recommend that you put it on your wishlist and wait till its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's some sort of a mix of The Sims and State of Decay... That is actually pretty fun.  ",
            "review_score": "1"
        },
        {
            "review_text": "The game, at the moment when I played it, was quite buggy. The game does come across as somewhat alpha in certain areas but I could overlook those parts and enjoy the rest of the game just fine.  You can read positive things from other reviewers, I'm going to focus on the negative aspects of the game while still reccomending it for any cRPG fan or zombie fan.  Sometimes the character you're moving stands completely still and glides across the floor.  Sometimes when you run across a large distance of the map one of your companions get stuck along the way and 'appears' to be running along right behind you until you see them glitch back and start re-running from wherever they got stuck.  There are certain rooms and lootables that are not accessible because of path issues. Nothing that major really. You lose out on barely half a dozen items each time but it's still a bit annoying. What I mean is that you open a door to a hotel room and you can't enter it. Kind of like a misplaced invisible wall.  Zombies and mercs and stuff just stand still pretty much constantly and there are times when you simply walk into a gunfight where the opposition will have the first move with no way to circumvent it.  SPOILER  The 'end game' happens after day 80, however there is only enough interaction between NPC's in the shelter for 60 days (at least that's all there was for me). So there will be this long boring gap of pretty much nothing happening after 60 days. /SPOILER  The melee and ranged are completely unbalanced. Melee is fantastic for handling zombies but useless against late-game humans whereas ranged make zombie fights extremely tedious (and it's a waste of high-tier weapon ammo) but are pretty much a necessity for late game fights. It got to the point that there are human enemies in the game that can 'only' significantly get hurt by critical hits of high tier ranged weapons. So invest in Ranged 'and' melee.  The car guzzles 'way' too much gas even with all the upgrades. Don't bother with it.  I'll leave it at that for now.",
            "review_score": "1"
        },
        {
            "review_text": "The GUI is a bit choppy, got a few CTD's, game would certainly benefit from more hotkeys, but it still is fairly enjoyable piece of game. And after getting used to the interface, good game kicks in. If you want to play zombie rpg/sim/turn-based strategy, definitely grab it.",
            "review_score": "1"
        },
        {
            "review_text": "really good game once you get in to it",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very fun. Gives a good rpg feel to the walking dead type zombie genre. Graphics are ok but that's not what you play a top down type game for. Can be very challenging when fighting former military enemies. Lots of variety in armor and weapons though a few are far more useful then others. Its a 4.5 out of 5 for me.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good! I wouldn't give $30, but would value it at $15-$20 easily (grab during a sale).  I've loved turn-based squad strat games since JA2. I'd still rank that as the top; give 2nd place to Silent Storm (up until they bring in the unicorn suits of rainbow bright), and give this one 3rd place. Just finished my first full playthrough:  PRO's: Solidly done turn-based squad strat game. It's got a base with lots of upgrades, tons of loot, decent selection of weapons, limited resources (ammo, grenades, fuel, etc), good character progression, zombie killing fun, base management, character interactions are fun, etc. Basically it's got a LOT of stuff done RIGHT.  CON's: Not as many different weapons or upgrades as I'd like (thinking JA2 again); approx 3-6 per ammo type (7 ammo types; maybe 20-25 weapons total). The side stories are limited in content and usually amount to: bring character A to place B from their past; get special dialog, end of quest. Not bad, but could have been made into much more. There are a few bugs; I had about 8 crashes total over my playthrough, but with ample auto-saves you never lose more than the last 10-20 minutes. Last and biggest complaint is the simplistic AI. Dont expect you're enemies to Mcguyver up an ultralight and surprise you with an L-shaped. It's just not there, still: what do you expect from zombies?  Still a postive experience; really recommend this one if you're a fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Very addictive and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Great game, lots of relevant moral decisions. Interesting characters, cool weapons and loot. Cons: Still pretty buggy. None of the bugs I found are game breaking, but they can be annoying.  Overall, I say the game is worth the money. At this time I've got 36 hours in, only a couple restarts, and I still have plenty of game to go.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game so much I decided to post my first review!  Dead Dtate is one of the best post apocalyptic games i've ever played. Lots (and I mean lots) of divererse locations, tons of loot, upgradable weapons and armor, interesting characters and fun turn based combat. Game starts a little slow but events keep occuring to propel the story and make you emphasize with your charcters. And if you care to do so, listening to the radio and reading the data discs found in missions provide a wonderful immersion into Dead State's world. A 9 out 10 for me (with one point deducted for a somewhat clunk interfae)....",
            "review_score": "1"
        },
        {
            "review_text": "I reccommend this game to anyone that liked the X:Com series games, and likes tactical turn based combat with dire consequences. Quicksave button makes it much more forgiving. But all in all a very good game, and very addicitive. Time flys by while playing so be warned if you have other ♥♥♥♥ to do, get on it. Like Xcom with a much more detailed and interactive home base, and toss in the zombie survival aspect.",
            "review_score": "1"
        },
        {
            "review_text": "I waited to buy this game for awhile. I didn't want to get it in its alpha state, because there are about 100 zombie survival games out there right now in alpha. I see lots of negative reviews for this game and while it does have some bugs, I only experienced a few. Storyline is pretty good for a zombie game. Survivor management, resources, and even crafting are pretty good. Talking to your survivors could use a little polish, but I think its definitely worth 20-30 bucks. If you like zombie games and you like turn based games like fallout 1 and 2 this is a good game. I was a little leary of the turned based combat but its really not to bad.",
            "review_score": "1"
        },
        {
            "review_text": "I personally loved the game, its a different style than a lot of survival games since it actually includes base building. Like the other reviews have mentioned, its missing a few UI things, but honestly, a lot of that I view as cheating slightly, of course you wont know where loot is magically, or who is stronger than another under 20 lbs of armour. Mind you, its not worth the full price of $30, I'd say it falls in the range of about half that, $15 or so.",
            "review_score": "1"
        },
        {
            "review_text": "aa realy awsome game a most buy ! if u like turn based tactics",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool, if simplistic.  coordinate a group of survivors, explore a world map looking for supplies etc. pretty neat. the turn-based combat is super basic - no alt attacks, poses, or anything that might spice up the battles, but still works pretty well.  the 'base' part of it gets a bit tedious. having to run around a fairly large environment to interact with objects that are effectively the 'base menu' gets tiresome quickly, but overall I'm enjoying it so far.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down one of the best games I've played in years",
            "review_score": "1"
        },
        {
            "review_text": "If you like the Sims and you like survival horror then your a numpty. Dead state is a rare thing, its as if someone has actually made a game that has the soul of an 80,s game and the graphics of a 1920,s game but the heart of something that wants to eat you. QUALITY dayz can rot in the depths of my harddrive, this is pure class.",
            "review_score": "1"
        },
        {
            "review_text": "i've only been playing this game for a few weeks, if that, but the dev's have made tremendous leaps in that time period. All in all, i'm very happy to see this game get the positive reviews it deserves, which made me reach out too :)  Anyways, highly recommended, though i do wish there was more content...like more ways to customize weapons, more open ended? Thats just me being personal, game is completely solid the way it is :)  Worth the $ :D",
            "review_score": "1"
        },
        {
            "review_text": "I am not normally the type to write reviews, but I feel that Dead State is worth a break from the ordinary.  I have been playing since early access (First Seven Days release) and gone back for multiple playthroughs with each patch release right up until full release.  End result, over 300 hours played on this game and I dont feel I have wasted any of them.  YES, there are bugs, some of them are immersion breaking, some are annoying, but nothing OVERLY game breaking. The Devs are incredibly quick to respond to any new bugs found and are continually consulting the player base to find and eliminate bugs as they happen. To me, this is incredibly satisfying as I know my opinion as a consumer is valued.  As to the game itself? If you are looking for a pulse-pounding thrill ride as you slaughter increasingly tough and varied monsters in graphic ways with an assortment of zany and idiosincratic weapons.... Look somewhere else.  Dead State is a htoughtful game that encourages you to plan ahead, from catering to the needs and wants of your fellow survivors to deciding when, where and how you and your team will fight. Sometimes it is better to sneak through an area, get what you can and get out quietly.  I found I was investing into the fellow survivors, thinking outside the game to better understand thier motives and how best to make them work. A sure sign of good writing (Although you may not believe it simply from appearances)  Finally, if like me, you have played more than your fair share of RPG's (especially from the 90's and 00's) the isometric viewpoint, the turn based combat and even the JRPGesque base and NPC collection will tickle all the nostalgia bones and keep you coming back for more.  tl:dr?  A great game that may still seem a little rough around the edges, but a must have for any RPG and/or Zombie Survival fan",
            "review_score": "1"
        },
        {
            "review_text": "Never have i ever been more involved and addicted to a game or storyline then Dead State. The game will entice anyone who enjoys zombie based games, turn based game, survival or just fantastic dialoge and story. Do NOT miss out on Dead State you will love it from start to finish. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Entered a house with a bunch of gang members. Then zombies came in. My team ran to a bedroom and closed the door. There were...soo many terrible screams. When it got quiet, we opened the door and finished off the zombies. There was some great loot. It'll go far for everyone back at the shelter. 10/10 AMAZING Turn-based RPG",
            "review_score": "1"
        },
        {
            "review_text": "This is a a great game. The combat is great. The resource management is cool. I want to know how randomized things are. If the Map is different everytime. I could play this game for years and years.  It is nice how you can out strategize the zombies. You have to make decisions that don't affect you for days. The job board is a great concept.  It is one of the greatest innovations in games. Thank you for making it turnbased. I had bought it in early beta when I saw turn based zombie but wasn't much to do. I have over 50 hours into this game and I still have so much to do. I think it could be very interesting depending on what kind of character you build. This will dramatically change the game. I only want to finish this game to start a new one and see how it changes things.  I would give this game of my highest recommendations. I am enjoying it like the first time I played Xcom or Jagged Alliance.  Don't delay! Play it now. I might end up buying a couple of friends copies just so I can see their enjoyment with the game.  (I am not much a reviewer more of a game player but I had to say something about this game!)",
            "review_score": "1"
        },
        {
            "review_text": "Unbelievably addicting. I lose all track of time and it really is a cross between Xcom and the walking dead. Great concept, a few bugs to work out, but that's why it's a beta. Keep up the great work and ideas!  After 60 hours I'm still in love with this game....the developerss keep making the fixes where they need to and are dedicated to the players..just can't beat this zombie game. Way better than State of Decay that I used to play on the 360.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Fun if you like games where you manage people and your surrounding while still having the whole idea of fighting and surviving. 8/8 would recommend. Leading looters into a firing line was great, you would enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Slow paced, but fun game. Watch out for gunshots.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. I've played it for quite a few hours now. The mechanics are great and the difficulty is just right. The storyline is so-so, but the scavenging and combat mechanics are great. You can really sink your teeth into the game spending hours on all sorts of activities, the limited resources and personnel make you think about how to approach different situations, and you are punished if you fail to keep morale up and your base well protected.  If you like Turn Based games, blowing zombies away and managing resources, you will really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Attention! I previously wrote a review NOT reccomending this game but I changed my mind. Yes the game had issues that forced me to stop playing after say 8 hours. Yes it is still buggy and sometimes feel unfinished, but this is a game that rewards patience. It has a steep difficulty curve and has some dodgy gameplay mechanics at times, but it gets better. I have now spent around 15 hours and I come back for more. What I like: * Varied locations with a lot of attention to details. * Subplot told through collectibles that has suprising depth. Yes you can miss it and that is the lack of handholding rarely seen today. * A truly believable story of what it means to be a leader of what could be the last of humanity. * A cynical undertone of contemporary politics.",
            "review_score": "1"
        },
        {
            "review_text": "njoy evry minut of play",
            "review_score": "1"
        },
        {
            "review_text": "Good concept for a game but combat repetative and rpg alements poor. Could have been so much more 4/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is out of keeping with my general purchases, but as it was on sale I felt it was worth a go.  In many ways this game feels like it could be mission-based content for one of the 'Rebuild' games, which I certainly mean as a compliment.  Theaspects that let this game down mainly revolve around combat. In combat the game feels like a clunkier version of X-COM. The pace is slower than X-COM's, too slow in fact due the difficulty level of game and this leads to the game being less desirable to play for long periods and, conversely, impossible to play for just short periods.  However outside of combat; the plot line is compelling, more so than 'Sheltered' or 'This War of Mine' which are, conceptually, very similar games to this, albeit in the 2D format. The characters are very varied, particularly when you consider the large number of them and the dynamics between them are intruiging and quite realistic,htis adds greatlyto the hames playability.  Overall I wouldn't spend full price on it and due to pacing I may never finish a game to completion, but in generalI think it will provide an enjoyable distraction fromt he real world.",
            "review_score": "1"
        },
        {
            "review_text": "Day 9. Didn't sleep a wink, Elaine was on the stairwell sobbing again setting everyone on edge. Doug's been needling me to take her on a scavenge and leave her gutshot out by the old church. He figures it will draw them out as we slip in the back, given it was an emergency shelter before it was overrun. A lot of provisions in there Doug says, and with Elaine gone, one less mouth to feed means one more meal for me. But I doubt Davis would buy it, that wily cripple likes to remind us of how he took us in. And now the bleeding heart's handing over the last of our antibiotics to some Mexican kid with the bite. I swear to the God that abandoned us, I'd walk down the halls putting a bullet in each of them as they slept if it weren't for the fact that the fence has a hole you could fit a bus through and the noise would bring them in from three counties. Now isn't the time for division. No one survives out here on their own; looters, the dead, or Coyotes, one of them will find you. Make enough noise like the Sheriff did, and maybe it'll be all three. So I hunker down, listen to Elaine bleat and I earn my keep... bushwhacking and scavenging, two or three times more than most. And for what? Another week of waiting to die chewing half rations of Mr Munchie bars and mouldy fruit.  I guess it ain't all bad. The new guy that showed up just gave me some chilli sauce and some rechargeable batteries. With all that's wrong in this messed up world, I have to admit, my mood's better already.",
            "review_score": "1"
        },
        {
            "review_text": "I'll try to write this review as objectively as I can, but this is my dream game. I have been waiting for a turnbased zombie rpg with base building most of my life. Overall the game fulfills this dream. All it needs to be perfect is a sandbox mode for after you've played through the story several times and seen all the endings. The devs have stated they may add that some day.  The writing and characters are the best I have seen in a long time. This is due to the writing talent and experience the devs bring. The head dev is Brian Mitsoda, the head writer for Vampire: Bloodlines. His wife, Annie VanderMeer Mitsoda of Neverwinter Nights 2: Storm of Zehir, also contributed her writing talent.  Some may find the combat simplistic, but this game is an rpg, not a strategy game and the combat is no simpler than a classic rpg like Baldur's Gate. There is enough variety in weapons, armor, and special gear to keep combat interesting and allow for a variety of tactics. Especially with the inclusion of the noise mechanic that attracts zombies.  Other reviews may mention bugs, and when it was first released it had a few major ones. However they have been resolved and the remaining ones can sometimes be annoying but there is nothing game stopping. The devs work hard to fix them and have released several patches since release.  Considering they raised just over 300,000 on kickstarter, I think it is amazing what they pulled off. I can only imagine what they could have done with the millions other rpgs had raised on kickstarter.  So in summary, if you like classic turn based rpgs with some base building added in, you should like Dead State.",
            "review_score": "1"
        },
        {
            "review_text": "I have been waiting for this game since I first heard of its concept! It is everything that I wanted in a game, a 4x game that has Zombies, survivors and a base of operations. With researching, scavanging, creating and assigning jobs it gets even better the longer you play it! I really liked it when it was only a 7-day early release version, I love this game now. Even with some of the problems, it is totally worth playing. The creators are continously updating and tweaking it to make it even better. If there is a found problem that you (or anyone) reports, they work on fixing it asap. The problems are few, and I have only expierenced a couple while it was in early release, but when they patched it, the problems dissappeared. This game is very worth the price to pay. Buy it, play it, enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "The world ended and I got to loot a Twinkie Snack Cake factory. Best Christmas ever. 10/10 Would apocalypse again.   Some crashing, but generally speaking just hitting quick save before changing zones made it a minor irritation. Had the same trouble in Fallout back in the day. It's almost nostalgic crashing, in a way. Other than that, no major bugs for me to date. For a more serious review, I give it a solid 7-8/10. Graphics are reasonable, challenge level is reasonable so far, and the premise and execution are interesting. No major UI irritations. Story and character interactions are decent. All in all it's a phenomenal concept that I can't believe hadn't been done in this form before. If you like X-Com type turn based combat, it's a great entry in that genre. If that's not really your bag, it's probably more of the 7/10 I gave it above. Still well worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "A very good turn based game. The interface could use some fleshing out, but the conversations are well written and the characters are interesting. You will hate scavengers. You will love brush hooks and fire axes. You will love your school house rock.",
            "review_score": "1"
        },
        {
            "review_text": "Update 12/7/2014  Now with the fix ill give it a postive review.   Game may not be perfect but its fun and its easy to lose yourself into this world. Good buy for $30.       First things first.  I love this game  ill say it again I love this game, its amazing ive played 36 hours and i dont think ive done 50% of it and already have different plans for another playthrough. So why dont I recomend it ? It has bugs and lots of them. Now i can handle a few minor bugs, and have encountered several of those, in adition to that there are a couple things that arnt well thought out like a major game event that if you hit too soon your basically need to restart a save from before ( before going to the hospital make sure you can handle a squad of military upon leaving ) but I even found away around that.   36 hours in my game is broken I can no longer create a party and to top it off my horse functionality is broken. this all happened after vic got into a fight with regina?   I want to play this game right now but i cant do anything i dont have fast travel and i dont have a party, ive looted everything close by and i cant handle anything further by myself.  the game is clearly in beta, it is fun when it works it really is alot of fun, but its broken.  Please fix this game i want to give it a positive review.",
            "review_score": "1"
        },
        {
            "review_text": "It is very good old-school RPG and first good RPG about Z-Apocalypse. It is indie game and may be lacking some things. But this game have soul.  It it slightly too long and it is too bad they don't implement 'cure' ending (cause of bugs). Still i hope they add this in new update.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best zombie game I've ever played. Also happens to be one of the better RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "I just have to say, I live in San Antonio and have been to most of the real cities/towns they talk about in the game, so it's cool to know that in this world, my city would have burned to the ground after a failed quarantine! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Has its problems, but still easily worth the price tag for fans of post-apoc zombie survival community management games.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who read my previous review of this will notice that I have changed my opinion. This is simply because the last post full release patch has fixed many issues and the developers continue to improve this product (the next big patch is due mid-late January). In my opinion it should have stayed Early Access until this latest patch.  This is a deep game that rewards patience in the early stages. You start out with just a handful of allies and very few options but as you venture further from your base, discover more locations, and find more survivors (who come with their own individual traits and problems) then things begin to get interesting. You can develop your base far more quickly and new options for addittional facilities start to appear as new survivors bring their unique skills to the table. Plot events progress in a similar manner with most being specifically linked to certain characters and your enjoyment of Dead State will snowball as you gain momentum.  Dead State is not an easy game to quantify in terms of genre; being a combination of man-management and resource allocation, Sims-like character appeasement, building development, open world exploration, and story-driven role play elements. But the CORE of the game is none of these things but rather an XCOM-like, turn based, tactical combat. And this last, despite being highly enjoyable when taken in context with everything else, still has a few rough edges. Regardless of its flaws (which are becoming increasingly less significant as the developers continue to listen to the community and improve the game) Dead State has finally flowered into something unique and satisfying IF you can push through its slow start. With the promise of further improvement in both game mechanics and extra content it has been turned from something best waited on to something you shouldn't really be without.  Previous score 67%, current score 82%, expected to finish in the high 90's.",
            "review_score": "1"
        },
        {
            "review_text": "great game.",
            "review_score": "1"
        },
        {
            "review_text": "please fix the crashing",
            "review_score": "1"
        },
        {
            "review_text": "I just wanted to update this saying it's also really excellent if you've ever lived in texas. I lived in austin for about 9 years and it's cool to see the towns around texas represented.   Also, is there another way to x-fer items from npcs into storage, or does it always have to go through you... cause this is the biggest drawback in seamless gameplay for me...   if you really like the turn based combat in xcom (the new ones) you'll like this. I think the combat is excellent and I never get bored of it. They also do a great job making you feel like you don't have enough stuff ... at least early in the game. The characters are fun, and I think I got different ones in 2 play throughs, There are still some bugs and some issues with inventory imo, but nothing that's going to ♥♥♥♥ you off too bad. If you like turn based comat rpgs this game is way better than most, and really up there with xcom and the new shadowrun. So far I like both those other games a little better, but I am only a little bit into Dead State. It's rocking much harder than I thought it would.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome! Especially for 20$",
            "review_score": "1"
        },
        {
            "review_text": "It might take a bit to click, but beneath the old fashioned layout and looks is a deeply enjoyable and sincere game.",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE -- 6/8/2015:  I am writing this as an update to take into account the “Reanimated” version of Dead State.  This is finally the version that buyers paid for, and the one that should have been released commercially. All the bugs I mentioned or encountered have been fixed. Additionally, the combat has been fixed. Previously, it was just a matter of running up behind a zombie, pressing space to pause, and then one-shotting the zombie. Rinse and repeat. There was no real risk, and it felt fairly tedious.  Now, combat starts as soon as you get close to a zombie, so that previous strategy is no longer possible. I’m finding that change to make combat much more harrowing, much more of a risk vs. reward proposition.  The scavenging can get a bit tedious, so make sure to take breaks once in awhile. Personally, for me, it was the cutscenes every morning (and the somewhat rare group leader meetings) that has kept me going. I do enjoy those.  The Reanimated version has also added Ironman mode, Hardcore mode, and another mode where your own player character can get infected. I did make sure to turn that last option on when I started my Reanimated playthrough.  When I wrote my initial review, I wasn’t expecting a 100% perfect game, but I was expecting a playable one. Dead State is now playable through its Reanimated version. Dead State is a very specific type of game, and so while I wouldn’t recommend it universally, if the concept sounds appealing to you and you’re a patient individual, I would recommend a purchase of this Reanimated version.  ------------------------------------------------------------------------------------ Original Review:  I've been trying to rationalize how anyone could give Dead State a positive review, and the only thing I can think of is they're shills for the developer. Either that or they regret wasting their money on Dead State and want others to suffer as well.  I bought Dead State due to all the glowing reviews, including Lex's lengthy one. I haven't felt this burned by a game purchase in a long, long time. Dead State, as of its full release, is a buggy, cheap mess. The characters are shallow, repeating the same conversation options day after day. The combat -- such a central part of a game like this -- is crude and simplistic. There is no cover or no crouching. Sometimes if you hover your mouse over the ground, it will show the movement cost. Sometimes not. There is no option to aim with pistols, and pistols have a maximum range of literally 15 feet. Past 15 feet, you have a 0% chance to hit.  And here's the thing: I love tactical games like XCOM. I love base-building aspects. I love RPGs. I love zombies. And yet Dead State fails on all accounts.  This War of Mine, a survival game just recently released, blows Dead State out of the water, and TWoM costs $20, less than Dead State. The sheer fact that Dead State is asking for $30 is disgraceful. There are free flash games that are better and more fulfilling, games like Rebuild or Last Stand.  Graphics don't make or break a game for me -- I play rogue-like games like Dungeon Crawl Stone Soup because I care more about gameplay than how a game looks. However, Dead State is buggy and shallow AND looks atrociously bad. I mean just absolutely horrible.  Pros + The basic theme had promise  Cons - Shallow characters - Massive amount of bugs - Simplistic gameplay - Horrible 1990s UI - Weak narrative - Grating music - Poor camera angles - Ugly graphics  And then they slap you in the face with the $30 price.  I could go on and on about more specifics, like how putting unique weapons like pepper spray or nailguns in the base inventory removes and destroys all ammo from them. Or how morale hits rock bottom despite carting back a department store's worth of goods every day. Or how one NPC gets angry and discusses deserting because he's not in my party enough.... and I've used him 100% of the time. Or how you have to wait for a heavily armed camp labeled 'hostile looters' to open fire on you before you fire back, otherwise your party members accuse you of killing innocent people.  There's more. So much more. I cannot in good conscience recommend Dead State.   Don't waste your money on this lemon.  EDIT UPDATE: I'm trying it out after the latest patch. I'll give credit where credit is due: Most of the bugs, if not all of them, that I mentioned have been fixed by the developer. I don't think I've ever seen game bugs be fixed that fast before in my entire life. So at least the developers are on the ball as far as that goes.  I've found yet more bugs since trying it out again, and it's still a crazy mess not even close to worth the asking price. I won't say that the developers are inattentive, however.",
            "review_score": "1"
        },
        {
            "review_text": "Survival/rpg with the gameplay to spark your interest and keep you entertained. Sure the game is not perfect, but I for one will keep a close eye on the developers ~DoubleBear~ you guys Rock!",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy the exploring, scavanging, battles and management aspects.  What could be better: More variety. It's always the same things. The same things are in the same places and the same things happen on the same days, the same people etc. Would be nice to have other options.  Sometimes actions have consequences that make little to no sense. ",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying ive followed and played this game for awhile and saw lots of potential and promise from the developers. However i started playing the final release and i am disgusted at what is being passed off as a complete game.   There are numerous crashes that should have been fixed ages ago. This game promised to delve so deep into a zombie apocalypse that it would include much more than just bashing zombies.. it also promised tactical combat and in depth group management.. all we get is a game with limited at best combat and group management. I waited untill the full release to see if these things would be fixed, and they havent. The game is basic, and playing it you will see that nearly all that was promised is missing. Average graphics, limited dialogue, Biggest let down of the year.   To try and make the communication challenging all they have done is program npcs to be fairly moronic. Nothing feels natural and you will not be drawn into the politics of your group.  Comparing this game to fallout which has real tactical combat is an insult to people that actually took time to make their game legendary. Everything in dead state feels awkward and clumsy right down to firing weapons. There are no tactics in combat except for taking in turns. If i could get my money back i honestly would. Disgusted.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this after reading the many positive reviews and all I can say is that the reviewers either have very low standards or they work for DoubleBear!  The game is full of bugs and crashes that should have been fixed during early access, it's nowhere near a finished game. Combat is simplistic and clumsy, no tactics and an awful interface, and the comparisons with x-com and fallout are really misleading, this isn't in the same league by a country mile.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sounded like a dream game: zombie apocalypse, base building and management, recruiting survivors, turn-based combat, survival narrative. I thought it would be a mix of Suikoden II, X-Com and Fallout in a Zombie setting.  But instead what you get is a shallow RPG experience, a base that doesn't really matter and which you don't really defend like you did in UFO: Enemy Unknown, one of the worst turn-based combat designs I've ever seen, and a whole crapload of tedium. The interface is also terrible.  In your base, instead of being able to access crucial menus to manage your base, you have to run around it for no reason just to access different menus. This is just tedious and adds nothing to the game. If I wanted to explore the base, I'd do it by myself. To view your character list you need to run around as well, because you can't view a survivor's data all in one place. You need to run to the supply room to check their inventory, to the cafeteria to check their stats, and you can only see their perks and morale level in the Goals menu. Why is everything so fragmented? What is the point?   Combat is a huge disappointment, and is hobbled by tiny rooms that are so hard to click around, a lack of proper hotkeys for player selection and reloading, stairs are particularly nasty as your people can only go through them one at a time and they are a teleport node instead of actually climbing them, so passing them completely isolates one guy to die to any enemies at the top. Worse, you cannot save while in the middle of combat. And the combat is so simplistic that it's even more barebones and basic than X-Com 1 back in the 90's. There's no saving action points to react to enemies, no cover mechanics, nothing.  The actual game idea is compelling, and playing through it can be fun, but the game really does its best to make it hard for you to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "I was really excited when this game came out of Early Access- I like me some turn-based combat, and I'm a big fan of zombie survival as a setting.   Sadly it didn't really all come together, although it's not a complete flop- I think 4/10 is a fair score.   The game is spoiled by a combination of weird design choices and horrible bugs.  Design: The armour system makes no sense. No sense at all. If you wear the heaviest armour, you are literally invulnerable to all damage. You can wade into crowds of zombies, or even humans armed with assault rifles, with 0% possibility of death. Goodbye suspense. Also, boy o boy is the combat pretty boring if you're waiting for a dozen zombies to drag themselves over to you, and god forbid you start off with the wrong team-member in a crowded area- get ready to skip turns until it's the turn of the guy in front.  Bugs: I let a few patches go in and decided to give the game another chance. I spent about an hour clearing out a block of houses and looting. The last zombie on the map got stuck in a closed doorway to the room I was in, leaving my team stuck in a bedroom for eternity. This kind of thing is not uncommon. Also, if you aren't able to design a multi-floored building without having players stuck in combat with enemies on different floors that they can't see, stick to bungalows. (I cleared the entirety of the hospital one zombie at a time without ever being able to leave combat)  So yeah. Nice try, but pretty much ♥♥♥♥ed it up in the execution.",
            "review_score": "-1"
        },
        {
            "review_text": "I played it before release and have played about 15 hours after release. This game combines a lot of great elements that I love to see in games. I really wanted to recommend it, but no. At release this is more like a game that's ready to enter beta testing. The development team is still working hard on it, but it's nowhere near release ready. There are many known issues that have not been patched, some of which will cause crashes to desktop, like double-clicking at the wrong time.  There are unfinished features and overall a lack of polish. The trading/inventory management is extremely awkward. Tutorial messages will popup at inappropriate times if you breeze through the tutorial too quickly. Pathfinding is still very bad in spots. The main character frequently paces back and forth when doing commmon tasks like going to sleep to cycle a new day.   The tactical combat is very basic. There's no crouching behind an object for cover. Allies block movement. Characters and enemies occasionally stack in the same square which stops you from attacking/interacting with them properly. It's not terrible, but it's nowhere near the level of X-Com or Shadowrun.  I would recommend this game if the price tag was $15 instead of $30.",
            "review_score": "-1"
        },
        {
            "review_text": "The devs say this is a finished game with the most bugs fixed... but there are tons of bugs and problems left.  An example of one of the major bugs is that ai controlled mobs can walk through and even attack through walls and environment,  So unless you can get this game for less then a few bucks like I did... don't bother with this one.",
            "review_score": "-1"
        },
        {
            "review_text": "For what it is, $29.99 is too much especially without ability to sneak and some Line of Sight issues. Should really be $15-$20. Not bad but not great.",
            "review_score": "-1"
        },
        {
            "review_text": "So apparently, zombies are faster, have more powerful attacks, and have a better chance of hitting you than you do of hitting them. No matter who you select for your first party, its like watching the three stooges try to fight the undead. Miss, miss, miss, get eaten.  Zombies can also sense you if you are directly behind them. No sneaking allowed.  Also, they have 9 action points, which is as much or more than your starting party members. Which means they can shuffle much further than you can move, while apparently getting free or almost free attacks, which is infinitely better than the 3-8 AP required to attack them.  All of this topped off with the fact that your weapons hit them for 7-25 damage, up to about 50 with the sledgehammer. This is out of a 50ish HP pool they have. Top that with the fact that they can hit you with anywhere from 7-62(?!?!?!?!) HP, after shuffling as far as you could move, out of your 90-110 HP pool.  In a nutshell: -can't tank them -can't kite them -can't evade them -can't sneak past them -must rely on luck to beat them -if you don't outnumber them 2 or 3 to 1, it has a high probability of a loss.  When the devs manage to botch what I heard was a good game before 'Reanimated', they're pretty bad at their jobs. Instead of increasing zombie count or something to make it harder to just sneak up on all of the zombies, they made them super-zombie killjoys. 3 party members vs 3 zombies, one of the party members being a COP (you know, trained to use force against violent, unpredictable subjects) and a member speced to be a melee monster. All 3 die. Why? Because bad game.  Un-**** your game, devs.",
            "review_score": "-1"
        },
        {
            "review_text": "Not enjoying it , not nearly good as i.e. Wasteland2 D.C.  Others already wrote this game pro's and con's, with many of problems already pointed to developers in discussion fourm. Not much is changed, problems mostly remain.  Game has serious issues on different aspects, for me most annoying are: 1. Leaving some action points for self-defense or ambush like in wasteland2 is not possible. 2. Inventory management is so complicated and time consuming it kills my mood for play 3. Cannot go over dying enemy on doorstep (choke-point), cannot kill it because it is under other dead bodies, cannot exit battle mode until it's dead...  Because of gameplay mechanic problems, game feels: dead, static, too slow progress so i would not play it any more, and I would not recommend it to a friend.  There are better executed games in this genre to waste time on.",
            "review_score": "-1"
        },
        {
            "review_text": "As many have mentioned, the game is great to start but quickly becomes unplayable. And not in the 'annoying glitches once in a while way'. I'll have to reload a quicksave 30-40 times before a glitch isn't triggered. I liked the game enough to try and get past the crashes, but this game crashes beyond any reasonable amount. I find it hard to believe this is a finished release. It's really hard not to consider this stealing.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried the demo and it seemed interesting. So I bought it for $8 bucks on sale. That's what I feel this game is worth. The combat is rather simple once you figure it out. Z's will attack the closet person for the most part and if you have a fire ax/sledge it's game over for them. Guns are pointless because they alert everything in the area (which is realistic). You can 'add' stuff to your shelter by saving up enough parts and working on it for a number of ingame days. This adds a slight bonus and takes away from the monotony slightly. So basically every day you go out and do the same thing, search for food, fuel, and luxery items to make your people happy. With combat rather simple it's a rinse and repeat grind waitng for the next addition to fisnih so you can start buidling the next 'addition' that will add another slight (and I mean Slight) bonus to your base. And then wait as your people make weapons/grenades for you.   I wish steam had an meh okay button instead of recoomend or not. It's not a bad game but it's not an amazing game either. It kept me interested for 18+ hours but seeing as there is no real story line beyond just collecting loot I don't think I'll put much more into it.",
            "review_score": "-1"
        },
        {
            "review_text": "buggy as heck. bad time to go on a vacation. isn't that right devs?",
            "review_score": "-1"
        },
        {
            "review_text": "HUGE Potential, HUGE let down!  Being a XCOM veteran I was full of excitement at the thoughts of this game and everytrhing it was supposed to offer, however on starting the game it was a massive dissapointment.   The fight engine has left too much to luck and odds 'how hard is it to hit a zombie from the front with a sledge hammer?' well according to the programmers its 5 times more likely to land a hit from behind than in front. This being so it takes four team members two rounds with two to three hits each to take out one enemy. I could understand odds being used on XCOM but why with melee weapons and why such appaling odds. And to make things even worse a gun reload takes a full turn. Add to this multiple enemies and you're in for anal decimation.   All in all a great idea destroyed by mismanagement of game dynamics.  If you're looking for a great zombie apocalypse RPG than buy State Of Decay. A lot better and more fun it has better graphics, game engine, playability, costs less and more lifespan.   ",
            "review_score": "-1"
        },
        {
            "review_text": "I'm really sorry to not being able to recommend this game. In a nutshell: great story, lousy game mechanics. A pity.  I played it twice: first time, total disaster. Second time, hyper-success (not challenging). The story is fine, realistic... it's clear there's a novel writer behind the game. The negative part is... the game itself. Seems incomplete, lots of unfinished features. So the story and atmosphere are very realistic, but many game mechanics are unrealistic.  I am very disappointed, for the storyline is great as the atmosphere, yet too many bugs make it unenjoyable.  I was forced to quit the game for good when I saw that the car contents are not automatically transferred to the shelter stockpile and, even worse, when at your shelter, you can only transfer items from the car to your personal inventory and then, via another cumbersome interface, transfer them to the stockpile.  The breaking bug is that my character had little strenght and thus could carry few items at once, so transferring from car to me, and from me to stockpile was unbearably painful. ",
            "review_score": "-1"
        },
        {
            "review_text": "I have put in over 100 hours playing this game and I still wouldn't recommend it. don't get me wrong it's not a bad game but the amount of bugs is just really not enjoyable, just check the list of known bugs on the forum here, it is ridiculous. If you are tempted by this I would definately check out the Demo. but I wouldn't buy this until after the next update has landed.",
            "review_score": "-1"
        },
        {
            "review_text": "not for windows 8",
            "review_score": "-1"
        },
        {
            "review_text": "I am not giving this game a Thumbs Down because it is a bad game. I do so because it is not finished, and because I hope that it will be a better game six months from now.  I got my money's worth out of this game. 68 hours for a $30 game is worthwhile to me. I am simply frustrated because I believe I would have enjoyed the game much more if I had played it after more bugs had been worked out, references to commented-out content had been removed or restored, and the pacing and event timers were changed.  This game felt much more like an Early Access title than a final build when I played it. If, a few months from now, you see new reviews indicating that this game feels like a complete product, then I encourage you to check it out. In its current state, this is not the best game that Dead State can be.",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine the best combination of Walking Dead and Xcom! Now imagine someone else playing that game in an adjacent room while you repaint the accent wall of the foyer from 'dusty off-white' to a nice shade of eggshell.   You're going to feel really bad if you buy this game after reading that description and then realize it was completely accurate.    Edit: Update for the 'Reanimated' patch: It's still an incredibly tedious game, except now sometimes you'll die. But don't get me wrong; it's not an awful game. It's too uninteresting to feel that strongly about it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game woulda been cool 15yrs ago, seems to far behind the tech curve to be considered good now (everything from the gameplay to the ui feel like a 15-20yr old game)  Great idea- Bad execution",
            "review_score": "-1"
        },
        {
            "review_text": "This game has real potential. I really enjoy many parts of it but the bugs and crashes are extremely frusturating. The devs need to address these issues quickly and compensate players for spending $33 on what is an unfinshed game when they marketed it as finished. I see great potential but that is up to the devs if they put in some time and effort to fix a broken game. I would recommend this game with a strong caution, good game, good concept, good potential, but needs work fast to fix the bugs and needs to be expanded through free updates for a while before the devs even think about charging for DLC, as quite frankly I feel rather ripped off at the moment.",
            "review_score": "-1"
        },
        {
            "review_text": "I actually quite like this game. But cant recommend as it now - too much bugs and CTD for release version. Wait some time for patches and modders.",
            "review_score": "-1"
        },
        {
            "review_text": "I will not recommend this game at all to anyone, supporting this back in the kickstarter phase was a huge mistake. 1.5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "I asked the developers to guarantee there wouldnt be a sale in the next few months and i would buy the game at full price now. I couldnt play till xmas and i didnt want a sale before i could play it but i wanted to support the devs. The dev posted there would be no sale as they look after there customers and they dont like companies doing that . Sixteen days later the game is on sale. That is low and morally wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh..  Despite the hype Dead State is lifeless game, devoid of personality, which is a great shame given the potential  While many features appear interesting at first glance, the charm fades quickly  Each aspect of the game, including combat, base management and interacting with surviors feels shallow and unfinished  It still feels like a EA after release  It has the spirit of Fallout 1, but lacks most of the combat options that made the former a classic",
            "review_score": "-1"
        },
        {
            "review_text": "im not fussed on this title, i have tried to replay the game 4 times and everytime my characters die, i can play the game but after playing for 2 hours and being killed its a bit of a punch in the gut, game clearly needs updates, balance and tweaking but im yet to see and noticable updates be released.",
            "review_score": "-1"
        },
        {
            "review_text": "This went gold by mistake. Unplayable after latest patch. Wait until holiday sale to save $15.",
            "review_score": "-1"
        },
        {
            "review_text": "I was about to say its ok to play this but as i read back thru the forums...i dont think i can. yeah many bugs have been fixed....and its harder to play now (i died on first mission) but after seeing how annie and brian treated someone who posted a negative review which was about this game...and then had steam perm-ban the account(he cant even play his games now i feel terrible for that guy/girl) seriously stay away..less you may end up like him/her , im risking my own account just to forewarn you!",
            "review_score": "-1"
        },
        {
            "review_text": "5$ would still be too much for this game. Saying something is inspired by XCom or Fallout does not make it a worthy sucessor. I wonder if this was a scam to scare up money for a (hopefully better) follow up game, if so, well played DS, well played.",
            "review_score": "-1"
        },
        {
            "review_text": "The game preview makes you think this is a great game, but unfortunatly its trash for now, needs alot of work but for now Refund!!! ROFL",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashed. Lost save.  That's about the end of that, I think.",
            "review_score": "-1"
        },
        {
            "review_text": "if u want waste your money for nothing you just need to buy this game",
            "review_score": "-1"
        },
        {
            "review_text": "I probably just suck but I just keep racking up the damage because the zombies always get the first hits Another stupid thing to criticize but the font is way to small",
            "review_score": "-1"
        }
    ]
}