{
    "app_id": 240440,
    "name": "Quadrilateral Cowboy",
    "release_date": "2016-07-25",
    "developer": [
        "Blendo Games"
    ],
    "publisher": [
        "Blendo Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Commentary available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Cyberpunk"
    ],
    "achievements": 10,
    "positive_ratings": 468,
    "negative_ratings": 50,
    "price": 14.99,
    "description": "When you have a top-of-the-line hacking deck armed with a 56.6k modem and a staggering 256k RAM, it means just one thing: you answer only to the highest bidder.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/240440/header.jpg?t=1494279911",
    "minimum_requirements": "最低配置: 操作系统: Windows 7/8.1/10 处理器: 2.0 GHz 内存: 3 GB RAM 图形: NVIDIA GeForce 9800 GT or ATI Radeon HD 5750, 1 GB video RAM 存储空间: 需要 1200 MB 可用空间",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Another short and sweet extravaganza of smoke and mirrors by the notorious Brendon Chung. Notorious because this is another game that you shouldn't buy for the quantity/price ratio. (The Interactive Art Book is overpriced for the extra $9, but as a horribly rabid fanboy I consider it a tip for the funding of future projects in the Citizen Abel universe.)   At release the game is $20 for 6-10 hours of content which most people should find outrageous, but I find that the experience never outstays its welcome.  The hacking feature is a total lie, as it boils down to a fancy lever pulling mechanic. But the implementation of the decking interface is just so finely tuned to fit with the environments that I found the glorified command line typing to be extremely immersive.  Art _quality in this game is amateurish but the art _direction is insanely brilliant. It's a joy to see how the sum of clunky blocks and hand-drawn doodles are combined into a scene that engages the imagination.  A bunch of interesting gameplay ideas are introduced with clever focus, but I was disappointed that those same ideas were never combined together into a cohesive climax.  Extras like the timed leaderboards and sticky notes left by friends are clever, but with the bugs plaguing global sync, it is hard to take such features seriously.   If you want to feel like a hacker in some 90s techno-exploitation flick, Quadrilateral Cowboy absolutely nails the execution. It won't teach you any programming and it will likely be disappointing in some burning way, but the experience will certainly leave an impression.",
            "review_score": "1"
        },
        {
            "review_text": "  Pre-Release review:  This is a brilliant game. It requires skills and strategies that have never been asked of me by a game. It plays like a puzzle game while feeling like mission impossible and told in Brendon's compelling style. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "While it's a bit short, it's easily one of the most unique and interesting puzzle games and hacking games I've ever played. The style is bold and strange, but appealing at the same time, and the puzzles are all very well-designed, with most of them really making you feel like you're infiltrating some sort of high-security base just with your laptop and a few other little gadgets. With the added mod support, I'd say this game is easily worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Great game; if you like puzzles.  However the game does feel as though it is more of a testbed for all of the mechanics introduced and it doesn't use them itself as much as it should.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with well designed puzzles leaning towards the easier end, but the main mechanic frustrates easily. The need to pass every command as a line of code can really slow things down if your typing speed isn't great. Still greatly recommended though.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so i have played this game and I love it but one thing I feel like it needs is more building things like the first mission where you had to get a processor or whatever and i thought that was very cool. Thats just my opinion :) ",
            "review_score": "1"
        },
        {
            "review_text": "Cowboy1.YeeHaw(3)  Quadrilateral Cowboy scratches a very specific itch I didn't know I had. It's a fantastic stealth/puzzle game that makes me feel like a movie level hacker. Just the sounds of typing this out brings me back my favorite moments in the game. That's what I call immersion.  Highly recommended for those looking for a more against the grain experience with strong, sold game mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Holy moly! 1 hour in and this is amazing! It's incredibly adept at moving you through space and time and cutting out all the cruft of plot development and spatial navigation. And then you feel like a BOSS when you succeed at a mission. I went from 2+ minutes on the second mission to under 28 seconds. I am a hacking master.",
            "review_score": "1"
        },
        {
            "review_text": "great game! too short",
            "review_score": "1"
        },
        {
            "review_text": "Pretty ♥♥♥♥in good tho. Just sometimes I can't select my devices and have to restart the game.  Bug or mistake?",
            "review_score": "1"
        },
        {
            "review_text": "I have been waiting for this release for many years, I watched the live streams and payed close attention to the development progress. Let me tell you this game was worth every moment of the wait! Buy it now! Can't wait to play more!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game for geeks and anyone who wanted to be a theif while growing up. My only complaint is that it left me wanting to play more. (There is the possibility for mods adding in more story but there is nothing out yet.)  The game has a jazzpunk feel and has a lot of optional elements, looking around is always a good idea as there are story elements everywhere.  9/10  'I want more levels to play on...'",
            "review_score": "1"
        },
        {
            "review_text": "Here is a list of ways I can describe this game, in relation to other games:   Like Blendo Games' other offerings, but with more structure   Like  Portal , but with more planning and more complex puzzles   Like  Digital: A Love Story , but hacking the real world instead of the Gibson  If the idea of keying up a batch script to disable an array of lasers in perfect sequence, or using a remote turret to hit a button through a grate in the ceiling, or catapulting yourself from building to building on blasts of air appeals to you, buy this game. If the idea of carefully planning your escape, then executing it flawessly with a single command appeals to you, buy this game.  If you read all this, and you still have no idea what's going on, buy it anyway, and see what you think. If you don't like it, you can always return it.",
            "review_score": "1"
        },
        {
            "review_text": "I've been following this game for a long time and it is everything I hoped it would be! Another awesome Blendo video game.",
            "review_score": "1"
        },
        {
            "review_text": "app240440.recommend (yes)",
            "review_score": "1"
        },
        {
            "review_text": "This game really makes me feel like a hacker. Although the hacking might not be as deep as that might make you expect, but still it is all satisfying to do.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good. (Really thats all I can say.) Though a little short for the price. I'm pretty sure that there are going to be more future updates, and there is a workshop. If they impliment a map making system into the game I can really see the workshop taking off.",
            "review_score": "1"
        },
        {
            "review_text": "Worth the price tag IMO.   The game has a some great mechanics. The hacking, the timing and the constant stream of new tech makes the game feel fresh from start to finish. The only downside to the gameplay is that you never feel like you get to apply everythuing at your disposal and everything you have learnt in some sort of 'peak' level.   The story was ingaging for me in a sort of indulgde at your own leassuire kind of way. Howver good it was it though, like the mechanics it never gets meaningfullly fleshed out kind of like the second half of the game was ripped out.   All in all I enjoyed it, I dont regret paying full price for it but I wish that more time was spent fleshing out the game to come to a meaningfull end.",
            "review_score": "1"
        },
        {
            "review_text": "Love QC a lot. However, if your scared by the idea of writing 'code' maybe you need to re-evaluate some stuff...",
            "review_score": "1"
        },
        {
            "review_text": "the absolute coolest",
            "review_score": "1"
        },
        {
            "review_text": "Just finished it. Short and sweet. Had a great time playing through.",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever seen the movie Hackers, that's the vibe of this game. You are a hacker in a cyberpunk setting who uses various techniques and tools to perform heists in various settings. The puzzles feel just right and the introduction of new tools over time are done at just the right time. After each heist plan it reveals a little bit more of the story and the world in general without a single word of dialogue. The overall execution is very well done.",
            "review_score": "1"
        },
        {
            "review_text": "Neat game with some neat puzzles and interesting mechanics. Made even better if you have even a little interest in or knowledge of programming. Won't say much else without giving things away. Another great game from Blendo.  Will update once I've finished it.",
            "review_score": "1"
        },
        {
            "review_text": "I usually never write reviews (I know, it's a cliche) but I had to write one for this game, is very fun, especially if you love cladenstine/hacking type things, if you played Hacknet (which if you like hacking games it is a must, super fun and mostly realistic) it is like that, but you move around and aren't just using a terminal remotely, you go fromplace to place using your terminal on the fly and after each location (each location has 3 jobs in it) you get new gear to help you along) the story so far is fairly good (I am not far so I cannot say much about the story) the game is very 'figure it out, do it however you want, there are no guidelines' style, which works phenomenally. I could go on all day about this game, if you love hacking/secret spy type breaking in and not being detected/not setting off alarms while using state-of-the-art equiptment, this game couldn't be better.   Keep in mind that this game is not like TIS-100, you are not re-programming the game or coming up with complex solutions, you are using ingenuity and simplicity to solve the puzzles (like a real hacker does (I personally am a Penetration tester/white hat hacker)) I love this game for that, I have been waiting on a long, fun, accurate hacking game since I played and re-played Hacknet; this game, is that game.   TLDR: If you enjoy simplicity over complexity (Portal because it didn't have 20 portals), inginuity over complexity, and hacking/cladenstine type operations, than this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful if not a bit short (finished in just under 6 hrs). Great blending of the command-line / hacking genre wrapped in a first person puzzle game, and the whole thing is dripping with artistic style very reminiscent of that in Jazzpunk.   Can't wait to see what the community cooks up in the workshop. Will definately be checking back for updates and player designed heists!",
            "review_score": "1"
        },
        {
            "review_text": "It's better than a kick to the head.",
            "review_score": "1"
        },
        {
            "review_text": "They've never made games like these anymore.",
            "review_score": "1"
        },
        {
            "review_text": "This one is a doozy. How do you talk about a game you had a ton of fun playing, but felt completely underwhelmed by it? I guess the best way to start is with the stuff that it does well, and it indeed does it incredibly well.  So whats the game about? You are part of a 3 man(woman) crew who takes jobs and contracts of the illegal sort. You are a thief so to speak. A highly efficient thief. Not the kind that hides in the shadows and kills stealthly or parkours around the rooftops, but the kind that hacks security defenses, opens tightly locked doors, and deactivates lasers. Yes, you are a hacker.  But where the games excels in this department over other similar premises, like Watchdogs, is in the way that it makes you feel like a hacker. Your biggest asset in this game is the laptop you carry with you and the way the gameplay around it works. You see, you have to manually place the laptop on surfaces and type in the command lines yourself, for example, opening a door will require you to type in door2.open(x), x being the number of seconds it will be open. This might sound tedious and annoying, but I assure it goes a long way to make you feel like a pro doing heists in the fastest time possible. Typing a long line of commands, and seeing the world unfold the way you want it to and reaching your goal perfectly is a great feeling.  You then will get new gadgets with each subsequent new heist, stuff like a remote bot you have to connect to a small crtv and type in the inputs you want it to do, or a turret that you have to pitch and move on your laptop. These are all fun gadgets that give promises and foretellings of how complicated the heists will turn out in the future, with the simple idea of having to manage them all at once being a sign of things to come.  And this is where my biggest problem lies with this game. It never comes. Those hard puzzles where you have to take everything you learned so far to task and being able to manage every single gadget so you can get the objective and flee undetected do not exist in this game.  Every heist gives you a new idea and mechanic, only for it to be abandoned in the next heist. There is even one point where the game gives you a heist where you need to control all 3 characters simultaniously to achieve the objective, which is great, only to abandon that idea the next heist, by giving every single ability to one character.  The only heist where I can say your skills and understanding of the game are truly tested is the phenomenal last level, where you will constantly realize your mistakes and have to restart the level once again to do it just right, and it feels amazing. And then the game ends. My comprehension of how game development works isnt the best, and I understand that this is a one man project. But I expected more from this title, knowing how long it took to be made.  There is a Mod section in the menu of the game, and while it makes perfect sense for it to exist, since this seems the kind of puzzle game that put in the hands of talented players could create amazing and incredibly complex levels, looking back at it now that I have finished the game, it just screams 'Lazy' to me. You need to earn those talented players first, before you ask them to make levels for you.  Its odd, because I absolutely love Portal, a game whose puzzles are very easy and the whole game feels like a tutorial, same as this one. Maybe its because Portal carries itself with its pacing and sense of world, and the amazing character of Glados.  Which isnt to say that Quadrilateral Cowboy fails in this department. It has such style and aestethic, the kind I absolutely love, and it conveys so much about its characters with just a few short scenes and moments. But unfortunately, it wasnt enough for me. The price it asks is too much, buy this on sale. It feels like the game is struggling between being a narrative experience and a substancial videogame, and while the former is very good, the latter is definitely missing.  If you value style over substance, then you might enjoy this very short and sweet experience, because the time I spent with it was very enjoyable. But if like me, you expect a slow increase in difficulty and the game demanding more of a player's skills as it goes along, you will not find it here. Its almost as if the dev of the game is simply giving you the tools to create a better game, and giving you a tutorial for things to come. If those things do come, I will gladly come back and enter this world once again. But if not, what we have for now feels unfinished.  Im having Superhot flashbacks all over again. That was a game that also had a great premise, ended very fast, and had an absurd price tag. But at least Superhot had an Endless Mode where you could spend hours in if it was your kind of stuff. Sadly you wont find that kind of extra content here, unless you get into beating the levels again as fast as possible. Thing is, the levels are so easy, there really isnt much space to improve on your score...",
            "review_score": "-1"
        },
        {
            "review_text": "this game is way to easy, to short and overpriced. But i like the syntax idea but really hacking no.",
            "review_score": "-1"
        },
        {
            "review_text": "Just long enough that you can't refund it.",
            "review_score": "-1"
        }
    ]
}