{
    "app_id": 240600,
    "name": "MotoGP™13",
    "release_date": "2013-06-20",
    "developer": [
        "Milestone S.r.l."
    ],
    "publisher": [
        "Plug In Digital",
        "Milestone S.r.l."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Simulation"
    ],
    "achievements": 46,
    "positive_ratings": 409,
    "negative_ratings": 166,
    "price": 6.99,
    "description": "2013 Riders, teams and tracks; both simulation and accessible bike handling with scalable aids; photorealistic graphics with TV style interface; ingame voice over by official MotoGP™ commentators; first person elements such as the helmet view and 3D pits to put you in the rider’s shoes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/240600/header.jpg?t=1489746891",
    "minimum_requirements": "OS: Windows®XP™ SP2, Windows®Vista™, Windows®7, Windows®8 Processor: Intel™ 2.4Ghz or similar Memory: 1 GB RAM Hard Disk Space: 7 GB HD space Video Card: NVIDIA® Geforce 7600, AMD® Radeon™ HD 3870 or higher (it must be  able to manage Pixel Shader 3.0) with at least 512MB of display memory. Additional: Broadband Internet connection",
    "recommended_requirements": "OS: Windows®XP™ SP2, Windows®Vista™, Windows®7, Windows®8 Processor: Intel™ Core 2 Duo / AMD™ Athlon 64 X2 or higher. Memory: 4 GB RAM Hard Disk Space: 7 GB HD space Video Card: NVIDIA® GeForce™ 9000 series or higher, AMD® Radeon™ HD4000 series or higher (it must be able to manage Pixel Shader 3.0) with at least 1GB of  display memory. Additional: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "Although at first this game appears to have rather out dated graphics I have to say it has been brilliant fun! Really you do need to know a bit about motoGP and how motorbikes work to be able to control the bike, it requires being very smooth and careful with your movements. I do wish there was some sort of practice or bike test mode so you could take your career bike out to get used to it. Other than that, great game!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of third person racing games then get yourself something arcadish.   But if you are a fan of the first person or even as in shift 2 a helmet view then this motogp 2013 offers a truely fun twist on the sport.   The in helmet view is the only way to play this title. I have found myself leaning in my chair all the time as if my body would have a effect on the bike. Truly imersive and well done.  The grafics had made a slight improvment in motogp 2014 but not enough to make it worth twice the pprice.   If you want a different take on a race and get a awsome sence of speed when you hit a apex just right, then grab this tilte. I",
            "review_score": "1"
        },
        {
            "review_text": "Overall a good game for the price.. Can only find one bad point, which is when the rider leans from one position to the other, it's really slow and very annoying especially when you have to take tight corners",
            "review_score": "1"
        },
        {
            "review_text": "Decent bike-racing game for PC. There aren't many to choose from but this does the job.  It's not brilliant (graphics aren't that good, sounds are rather bland) but it does have bike handling considerable well handled.  Remove the assistances to get proper 'feel' for the bike, otherwise you can't really drive the way you should: handling is awkward and off-balance when assists are enabled.  If you are into motorbikes you might like this as well. It's not epic but suitable for people into racing and motorsports. ",
            "review_score": "1"
        },
        {
            "review_text": "Perfect :)",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game!",
            "review_score": "1"
        },
        {
            "review_text": "Would love to play online to this beautiful game, feel free to add !",
            "review_score": "1"
        },
        {
            "review_text": "sick as ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Its a good motorcyle game but its a steep learning curve learning to handle the bikes, hence the low time Ive spent on it. But if I made the effort I know doubt I'd get better.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing.. i recommend to any motorbike fan",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Graphics looks superb but the AI are not that competitive at the highest difficulty. I will recommend this for anyone new to the motogp game.",
            "review_score": "1"
        },
        {
            "review_text": "Could have been a lot better. Graphics are quite good, but all the riders look the same. Physics are quite good, but again, could be better. The game feels sloppily and quickly made. For example, there is a 'team management' type thing after every race, where you can check emails and social feeds from other riders and team managers, but they all say the same thing every time. Utterly pointless. My other gripe is if you have a crash or slide out, others riders behind you just ride straight through you like you are a ghost, wtf? This is a very rushed game, and corners were cut everywhere. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I usually give games at least 3 hours before I write a review about them. I could barely stand this game for 30 minutes. The graphics are out of date even for 2013, the sound of the motorcycles are terrible and the physics are F-ING HORRIBLE. I have driven motorcycles too. This is not even close to a motorcycle Sim. This game isn’t even realistic to how a motorcycle reacts. I got this game for 5 bucks and 5 bucks is nothing. This game isn’t even worth 5 bucks they should pay me to play this game again. Avoid this game. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "seems i can not change controller deadzone and sensivity.....in a racing game.......oh dear developers. *facepalm*",
            "review_score": "-1"
        },
        {
            "review_text": "Ugly graphics (a DX9 engine in 2013!) and jerky controls make this game eyetorturing unplayable, just give this one a pass.  Strangely, I have Superbike 2000 on cdrom from the same devs which looks and plays better considering it's a thirteen years older game.",
            "review_score": "-1"
        }
    ]
}