{
    "app_id": 240970,
    "name": "Half Minute Hero: The Second Coming",
    "release_date": "2014-04-04",
    "developer": [
        "Opus"
    ],
    "publisher": [
        "Marvelous"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "JRPG"
    ],
    "achievements": 32,
    "positive_ratings": 425,
    "negative_ratings": 33,
    "price": 6.99,
    "description": "The world's speediest homage/roast to JRPGs! Can you save the world in 30 seconds? Get a quest, find those in need, fight through dungeons, earn cash, get cool loot and level up until YOU&gt;EVIL. Don't have enough time? Pay the Goddess to reset the clock and try again! Over 100 mini-JRPGs for you to test your might with!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/240970/header.jpg?t=1457071523",
    "minimum_requirements": "OS: XP SP2 32bit Processor: Intel Core 2 Duo 3.0GHz or equivalent Memory: 2 GB RAM Graphics: Intel HD Graphics 2000 or equivalent Storage: 800 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have 30 seconds to write a revie-",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of my favorite RPGs that I have played recently. I saw this ages ago and did not get it. I did play the first one but the first game had plenty of problems in it (Such as quests being nearly identical to each other and not much variety in them). That was a stupid decision. This game fixes all the problems in the first game and makes it a almost perfect game. Here's how.  Story: There are 4 (5? I'm on Ragnarok at the minute and I don't really know if there is more.) eras to play in this game. They all have different stories. The eras are Overture, Judgement, Revolution and Ragnarock. Judgement is a kind of part 2 to Overture so it does not have a different protagonist unlike the others. I will only explain the Overture story because 1. I don't want to spoil much. 2. I don't want to waste time on a review. So overture follows the story of Yusha. A royal commando sent on a mission to destroy the Evil Lords alongside a group that contains Yashu and Guy. The Evil Lords get their hands on the Spell of Destruction. This spell makes the world end in 30 seconds. Thus the 30 second gimmick. Wow. I thought Overture had a bit more to the story that I could say without spoiling anything. Anyway over to the gameplay.  Gameplay: This really is the highlight of the game. So basically you are hunting Evil Lords and ♥♥♥♥. They use their Spell of Destruction to make the world end in 30 seconds. This means you only have 30 seconds to teach the Evil Lord a lesson. Each quest (level) starts off with the Godess telling you things that may help you defeat the Evil Lord. Each Evil Lord has their own quirk. For example. The Light boss blinds the player with light every few seconds and can be defeated using some kind of dark energy. Anyway the actual gameplay. After the godess tells you ♥♥♥♥, you need to scurry around the map and take out monsters to level up and talk to villagers. You're basically trying to level up as fast as you can and take down the evil lord before 30 seconds is up. However you can pray to the Time Godess to reset your time however it costs money to do so. There is more to the gameplay but I gotta type this quick so whoop.  Music: Oh my god. Oh my actual god. This music. This is SO good. I have been listening to this all week. It really is a pleasure to listen to. It's basically chiptune mixed with normal stuff. It is such a good blend. There is not much I can say about the music apart from its amazing.  Graphics: It's pixel art. Nuff said. OH WAIT! I almost forgot about the animation parts. Okay so there are small parts of this game that are animated. These are pretty cool i guess. I mean they dont really show it off that much and the animation does not have a lot going on in it so yeah.  Overall Half Minute Hero: The Second Coming is a great game and I highly reccommend the game. It is fun, addicting and...fun. So what are you waiting for? Buy it now! Heck, You get the first Half Minute hero with it.  8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Does what every single second part of game should do: take first game and shine it to perfection.  PC version has made significant improvement to first part, they actually got resolution as well as benchmark, which means that pixel art actually scales properly this time without blurring and menus seem to work naturally. There even seems to be VR-support but I can't even imagine how that works :D  Game itself now actually feels like story based RPG where after missions you can roam around and collect money, XP and secrets, where first game at least I simply started skipping text and that end credits joke got old really fast.  Missions are pretty much the same like in first game with little variances, which definitly isn't bad thing as that was best part of first game.   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  Tekee juuri sen mitä joka ikinen pelin toinen osa pitäisikin tehdä: ottaa ensimmäinen peli ja hioa se täydellisyyteen.  PC versio on aivan selvä parannus ensimmäiseen osaan, mukaan on lisätty niin resoluutiovalinnat kuin benchmarkki, meinaten että pikselitaide skaalautuu nyt hyvin ilman blurrausta ja valikot toimivat tällä kertaa ihan järjen mukaan. Jopa VR-tuki näyttää olevan mukana, mutten pysty edes kuvittelemaan miten se toimii :D   Itse peli tuntuu nyt ihan oikealta tarinalliselta roolipeliltä missä tehtävien välissä voit kulkea maailmassa ja keräillä rahaa, XP:tä ja salaisuuksia, missä ensimmäisessä pelissä alkoi skippailla tarinaa ja lopputekstivitsi alkoi käydä vanhaksi.  Tehtävät ovat aika hyvin samanlaisia pienillä tuoreilla muutoksilla, joka ei todellakaan ole huono asia koska se oli ensimmäisen pelin paras osa.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game, Definitely an upgrade from the first one. Being able to fight and explore outside of the 30 second time limit is a very welcome addition. There is much more customization and the fact that you have a party this time around is great. definitely going to spend a lot more time with this all weekend.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the first Half Minute Hero and I was excited to see a follow up , but was dissappointed when I gave it a go.  The graphic style has lost its 8 bit pixel charm and whilst I understand they need to make it better and different from the original offering, it just doesn't work and it looks any another game made using RPG maker.  The fast paced action is also gone and is turned into a repetitive grind as there are no longer random encounters and instead the quests and monsters appear on the world map, making it lack the variety found in Half Minute Hero 1.  The story gets a more serious spin as well, but for a game of a parody nature it just doesn't work. All of the characters are flat, 1 dimensional and uninspired (which would not have been a problem in the original).  The parody, jokes and 4th wall humour are much less and almost absent, making this game feel really empty compared to the first one.  I tried to like this game but just couldn't. Instead, I highly reccomend playing Half Minute Hero 1 if you have not played it already. For any returning players, you may be disappointed. ",
            "review_score": "-1"
        },
        {
            "review_text": "Half Minute Hero 2 takes the gameplay of the first game and adds new twists, While the first set of quests may make it seem like a serious game, there is still plenty of humor to be found. Overall, a decent sequel to the original, though some may find the focus on story to be a detractor from what made the original game so good.",
            "review_score": "1"
        },
        {
            "review_text": "The Time Goddess is still a gold digger. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A great sequal to HMH.  I'll give this game big plus for the menu screen and the art, it looks wonderful. The castle gimmick is okay, I don't think it is the greatest idea, and it makes some battles with a ton of large enemies rather annoying.  Though I HMH 1 in terms of originality and diverse gameplay. I think they did add some nice new features. The class system and dungeons are very nice  Certainly worth the price!!",
            "review_score": "1"
        },
        {
            "review_text": "they didn't bother doing the terrible not-pixel graphics like the 360/pc versions of the first game had so the one person who actually liked those might be disappointed but otherwise just buy it you already know what it is (and if you don't then why are you even here go play the first game ya dingus)",
            "review_score": "1"
        },
        {
            "review_text": "Save the game in half a minute. Again and again.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun and simple, like the first game. it's better with more players (says that as if he wants to play with others online....lol he's desperate for a multiplayer match. XD). oh and you really want to take advantage of the Global Level System, helped me out a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, the speed and all that, but absolutely hate how much story there is. Cutscene after cutscene, it starts to get rather painful ;(",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! If you played the first one, you'll love it, but keep in mind that part 2 is much more RPG then the first game. You don't do every mission via some sort of mission-selection, but you will just play on and on switching some continents which are big maps in which you walk around. You will also walk around without 30 second missions to level up your 'Global Level' which will be the starting level you start your 30 second quests with. Also there is much more and deeper story than before, so if you like story -&gt; Go for it. If you just want action, skip the story via ENTER and dash forward.  So, stop reading and buy it already !  p.s. AWESOME Soundtrack!!!",
            "review_score": "1"
        },
        {
            "review_text": "Let the Time Goddess scam you and your descendants 2.",
            "review_score": "1"
        },
        {
            "review_text": "30 secs of fun. (this game is really fun and long)",
            "review_score": "1"
        },
        {
            "review_text": "Like the variety of various other modes from the first game like Hero30, DarkLord30, Princess30, and Knight30?  WELL I HOPE YOU ENJOYED HERO30 A HECK OF A LOT CUZ GUESS WHAT THIS ENTIRE GAME IS",
            "review_score": "-1"
        },
        {
            "review_text": "I loved every second.  For a parody game, it has a fantastic story. It perfectly balances the humour and seriousness at the right times so it never feels out of place. Even though the characters are such low res sprites, they are brimming with personality. I literally could not put this game down. It kept me hooked the whole way.  The game is held up by a wonderful soundtrack. Every tune fits the scenario it is played for and is varied enough that everyone will find at least a couple songs that they absolutely love.  Overall it was a blast to play. If you are unsure about it, a gameplay trailer would be able to descride it better than words can.  Side note: The DLC missions are 100% worth it as well.  This is definitely one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "Get the first game instead (Half Minute Hero: Super Mega Neo Climax Ultimate Boy). The second one is dull and grindy (exactly the thing that the first game was mocking), there's endless and ultimately meaningless dialogues which slow this game down to a crawl, while it should be relatively fast-paced. The game lacks the humor the first one had, and I could go on and on.  The concept is good, and the game itself isn't that bad. But I just cannot recommend this game over the first one.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah no. They took everything about the first game's retro RPG style and turned it completely weeaboo... In a game that's supposed to be fast paced and right down to action, there's TOO much dialog for a game called Half Minute Hero... some of the dialog in the first area alone can take up to 5 minutes to sit through and read. This is just unacceptable on every level. I literally pressed start to skip past the dialog and skipping past some of the dialog would take upwards of 10 full seconds... I'm here to play a faced paced game, not read a novel.  This game is more grindy than the first, there's a lot more back and forth running between areas, the enemies are much tougher than they were in the first game as well which is exactly why the game is more of a grind out. I hate the characters, they're all weeaboos, the menu is too weeaboo as well with convoluted ♥♥♥♥♥♥♥t vomited bile and the art style is really bunk.  In this installment instead of controlling a single character you have an entire posse watching your back, except you can't equip them with gear so I mean, what's the point of having a party if you can't manage them? Aren't these weeaboo games supposed to be all about sifting through menus and upgrading characters for 20 minutes before moving 10 feet and having to reconfigure again?   They even tried to implement the feel of those style of games by letting you walk around on the over world map and gain another set of levels separate from the levels you gain inside of a stage... sounds ridiculous? It is. This game hardly makes sense, not that I don't understand it, it's just incredibly convoluted for no apparent reason other than to be a schizophrenic disaster like most weeb games are... like just keep it simple... why all this noise and distraction every time I want to move forward?  If you're a weeb, this is probably right up your autistic alleyway. For normal RPG lovers and gamers who enjoyed the first game, because it reminded them of old school pixel games like Final Fantasy or Dragon Quest, (Which again is weeb, just not to the Nth degree that it's become now with dudes that other dudes would like to bang because they look like chicks) then steer very clear of it... I got sick of the pacing after 40 minutes and uninstalled it. 4 / 10.  First one did it better.",
            "review_score": "-1"
        },
        {
            "review_text": "Good humour, Liked the strategy aspects and executing them.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game. The 30 second rules are flawlessly put into the game and the characters have some depth, Also, the game offers a couple of other modes incase the story doesnt interest you.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game. One of my favorites. It improves on the formula of the first game, and features an epic story with great writing. It comes with a free copy of the first game, which you should definitely play first if you haven't already.",
            "review_score": "1"
        },
        {
            "review_text": "I've saved the world 3240 timmes according to my steam time. I'd save it another 3240 times without any hesitation. Brilliant game.",
            "review_score": "1"
        },
        {
            "review_text": "great game if you 1. love fast paced games 2. like trial and error 3. have a group of friends to challenge and beat in multiplayer allthough campaign seems to go bye fast",
            "review_score": "1"
        },
        {
            "review_text": "I entered a four-story castle. It transformed into a giant death machine. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like fun and fast pacing RPG's then look no farther. Really run, like the overview world that they have going. Glad to see it finally translated :)",
            "review_score": "1"
        },
        {
            "review_text": "You have 30 seconds to read this reveiw 3... 2... 1... GO!!!  This series has a small fan base in the west. So by it and give the support. its a game that takes the core of 'final fantasy' and throws in the addictivenes from 'super hexagon' The level design is superpe and adds to the sense of 'Come you can make it!!!' kind of feel. Its praticaly flawless, and deserves a larger amount of credit than it gets. Also i recomend buying the first game on steam (Half Hinute Hero: Super Mega Neo Climax Ultimate Boy). It adds to the story and some parts will make more sense but its not required. You also get some bonus weapons if you have the first game. THROW MONEY AT YOUR SCREEN!",
            "review_score": "1"
        },
        {
            "review_text": " Better than the original",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game now for 30 h. So more than 1 week. What can I say? Its one of the best Games that I ever played. That Story is amazing. Its holding you right there and you just want to keep playing it. Today i get all ACM. I got 100 %. And i still playing this brillant game. Why u ask? Because is still Awesome. If there is an third Game of Half Minute Hero, i will have it! BTW. Play the first Half Minute Hero first, to understand the story. 100 % worth it. So Far~  Sorek121/Natsu",
            "review_score": "1"
        },
        {
            "review_text": "So... Is anyone still playing this game?",
            "review_score": "1"
        },
        {
            "review_text": "I can’t type lengthy review and finish it in half minute.   Just buy it.",
            "review_score": "1"
        }
    ]
}