{
    "app_id": 241720,
    "name": "Guncraft",
    "release_date": "2013-08-09",
    "developer": [
        "Exato Games Studio"
    ],
    "publisher": [
        "Reverb Triple XP"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "FPS"
    ],
    "achievements": 81,
    "positive_ratings": 607,
    "negative_ratings": 636,
    "price": 10.99,
    "description": "Block and Load! Combining the addictive nature of block building sandbox games with the speed and competition of modern first-person shooters, Guncraft takes voxel-based gaming to a whole new level. Players can create maps and arenas based on anything imaginable and, once complete, can utterly destroy them with bullets, bombs, grenades,...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/241720/header.jpg?t=1525801744",
    "minimum_requirements": "OS: Windows Vista Memory: 1 GB RAM DirectX: Version 10 Storage: 375 MB available space",
    "recommended_requirements": "OS: Windows 7 or greater Memory: 2 GB RAM DirectX: Version 11 Network: Broadband Internet connection Storage: 375 MB available space",
    "reviews": [
        {
            "review_text": "It's a cool game to play...when you find a server with more than 1 player :/",
            "review_score": "1"
        },
        {
            "review_text": "This is one of our faimly's favorite games. I even give it out as gifts. What makes it most fun is being able to craft your own guns, and terrain. Crafting guns is my sons favorite part of the game. For lan parties it is a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, with plenty of replayability, especially with the new Steam Workshop recently added in. There is an immense variety of maps, innovative gamemodes, interesting vehicles, and nice character models. It does lack ambient sound effects, so you might feel alone in the game even though there are 7 players competing against each other to turn them into snowmen. Other than that, it's worth the money and is better than spending endless hours modding Minecraft itself.",
            "review_score": "1"
        },
        {
            "review_text": "Somehow, i enjoyed playing this game.. everything seems good, except numbers of players. U can probably play, but sometimes even with 4 players. Game is great, just players :D",
            "review_score": "1"
        },
        {
            "review_text": "Great Game and it really cool that you are able to create your own gun looks and play on maps that you made!",
            "review_score": "1"
        },
        {
            "review_text": "Its a game you can have constant fun with, alone or co op. The game modes are so different from other FPSs, and they work so well. All in all, great game. Blocks. Murder. Fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, creative, and competive game! Totally worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "FREAKING AWSOME YOU NEED NEED NEED TO TRY IT! ",
            "review_score": "1"
        },
        {
            "review_text": "almost like battlefield but blocky and you can make your own stuff there are very few things that this game doesnt have compared to bf4 but its usually the things i like about it, you can make your own servers free but i dont recomend it because lots of people want there own server unless there all the other servers are almost full or everyone is busy making stuff. its like gmod, minecraft and battlefild all in 1 10/10 one of my favorite online games  if you want to play on a server join my group and tell me.",
            "review_score": "1"
        },
        {
            "review_text": "This is an upcoming game that lets me have alought of fun playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I Originally hated this game but- Now ive gotten into it a bit more, Still not amazing, Still not horrible, Just meh. Thats my opinion now.",
            "review_score": "1"
        },
        {
            "review_text": "A good &amp; fun game to play with friends!!",
            "review_score": "1"
        },
        {
            "review_text": "it the best game ever   its like a call of duty with minecraft  whoever made this game should have 1,000,000,000 dollars  everybody should play it....its fun",
            "review_score": "1"
        },
        {
            "review_text": "its a really cool game similar to minecraft almost but with guns &amp; you can build weapons and maps",
            "review_score": "1"
        },
        {
            "review_text": "Meh, cool played it for 5 hours, 7/10 got boring after a bit. meh get it if you want.",
            "review_score": "1"
        },
        {
            "review_text": "Most negative reviews are because of the dead community, if you have a few friends definitely pick up a few copies and go at it",
            "review_score": "1"
        },
        {
            "review_text": "'Ace of Spades is better'- The Dumbass  10/10 ign",
            "review_score": "1"
        },
        {
            "review_text": "Its really fun game and all but sadly for some reason nobody plays it anymore. It just died. BUT if you have lot of friends who could play this with you then you could consider buying this but if not i think its not worth it because lack of players. If someone can get players to this game and other players would join i think it would rise again!",
            "review_score": "1"
        },
        {
            "review_text": "If you play minecraft, and enjoy games that involve odd or cool guns, then this game is for you. It allows you to create any gun that pops up in your head. Weather it is a space lazer gun, or a wild west revolver, you can make it. Honestly, this has been one of the most creative games I have ever played, and probably will stay that way for a long time. It is very exciting when you finish your guns, and most the work will pay off in the end. If you get guns approved, you can use them in game. Not only that, but it allows other users to use your creations, if its a skin, gun, melee weapon, or vehicle and gets approved, anyone can use it. This game deserves a 10/10 in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Its Pritty nice game actually I really like it",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Lot of modes. You just need shoot everybody who is in your sight. Done.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT THIS GAME NEEDS MORE PLAYERS",
            "review_score": "1"
        },
        {
            "review_text": "Fun playing with friends, not so much without",
            "review_score": "1"
        },
        {
            "review_text": "8/10  Pretty fun game! U can go Co-op with friends,add skins,weapons and more!,more modes then others fps. the bad thing is it doesnt have XP and i hate thet but i vote it   RECOMMENDED!",
            "review_score": "1"
        },
        {
            "review_text": "i love this game its like mindcraft but a little bit more fun",
            "review_score": "1"
        },
        {
            "review_text": "The games is pretty cool with a variety of: guns, perks, killstreaks and vehicles to choose from. You can create your own maps, and all enviroment is destructable.   On the downside, It has a very low playerbase, don't let that stop you from buying it though because new players is the only way to save it XD",
            "review_score": "1"
        },
        {
            "review_text": "Great little multiplayer FPS, Minecraft meets COD, need more players and dedicated servers however",
            "review_score": "1"
        },
        {
            "review_text": "Solid concept, could be better.",
            "review_score": "1"
        },
        {
            "review_text": "6/10 The Field of View is to low. Hard But Kinda Fun At Times Not Recommended For People Who Don't Play Much FPS.",
            "review_score": "1"
        },
        {
            "review_text": "I must've played over 80 hours of this during beta, if your wondering why i played barely any of it. Now, To my review! First with the pros, then the cons!  Pros: Many guns to choose from Many gamemodes to play! Great to play and laugh with friends on! Creative gun builder and map builder! Many different play styles for each player Your loadout is unique, you'll probably be the only one with your unique loadout Steam workshop! Cool vechiles Tf2 items included in workshop! :D  I missed a few, but im in a rush writing this review, sorry!   Cons: Not many players, We need a sale to attract attention to make new players! Sometimes headshots may glitch out, just a tiny bit   I think that's it! Thanks for your time! I believe GunCraft is a great game, Just needs more players!   ",
            "review_score": "1"
        },
        {
            "review_text": "i Love Blocky FPS Game.. and Zombie mode or Onslaught Mode are included :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game but some guns are to op and it could get froustrating",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game, basically it has the gameplay of counter strike but the graphics and basic building mechanics of minecraft. Overall it is a good game with an active community but it just didn't feel right for me",
            "review_score": "1"
        },
        {
            "review_text": "Seems to be very nice but no one plays it...",
            "review_score": "1"
        },
        {
            "review_text": "Seems to be very nice but no one plays it...",
            "review_score": "1"
        },
        {
            "review_text": "I love the game since ive ever gotten it. (Love it)",
            "review_score": "1"
        },
        {
            "review_text": "so creative",
            "review_score": "1"
        },
        {
            "review_text": "i really want to play this game so bad but i have directx 11 not 10 so plz, if the devs r reading this, plz make this game compatible with directx 11 too. if u do this, i will be super happy. Thx",
            "review_score": "1"
        },
        {
            "review_text": "Its fun playing it with friends,but the servers are mostly empty.Some people have way to op weapons out of the workshop,which I think that there only should be retextures of the original weapons because op weapons just steal the fun.i dont understand thecomplaining from the people who say:So bad connection from america,its lagging.I can connect easily to the servers even if Im in America.But still i really recommend it to buy it with friends and play it together.(sorry for the bad english)",
            "review_score": "1"
        },
        {
            "review_text": "EDIT -- The UI has been improved, but it still needs work. Gameplay is fun.  -------------------------------------------  Probably the ugliest game I've ever seen. The UI looks like something you would see back in the 90s.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game to play with a group of friends or just by yourself. Servers can not have many players on (mostly one big server with lots of peope on and a few with 3-4 players on). But still if you find a server with a good amount of people on you can have a really fun time.",
            "review_score": "1"
        },
        {
            "review_text": "Minecraft! with guns.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but it freezes far too often",
            "review_score": "1"
        },
        {
            "review_text": "Great things about this game: 1. you can litterally make your own gun!!!! 2. Some of the gamemodes are definetly not your generic shooter gamemodes (thats for sure) 3. Steam workshop!!!!! 4. An Awesome-♥♥♥ Hookshot and some more things  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Fecking Brilliant",
            "review_score": "1"
        },
        {
            "review_text": "It would be good if it wasn't so dead you could actually find a server to play on.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm going to be completely honest, I have no idea what to even say about this game. Majority of servers are not hosted in the US therefore American players are going to find themselves suffering from high ping. Glitches are very common, and after a while you notice that its not uncommon to find players with overpowered weapons which were obviously skimmed over by whoever was moderating the workshop at the time. The game is still able to be saved, even though the chances are slim, major bug fixes and rebalances may just save this game. But until then, I'm going to have to give this game a not recommended.  Note to the devs:: If you are going to be a little bit lacking in gamemodes at least make it easy for players to create their own, a steam supported tool or such would make this game more appealing to creative minds and may be able to contribute towards the process of saving this dying game.",
            "review_score": "-1"
        },
        {
            "review_text": "Was good fun way back but I'm pretty sure the multiplayer (There isn't much of a singleplayer) has been dead for years",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥. No-one plays it anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Do I really need to explain this?  Ok, so when I saw the trailer, and the IGN review, I was like 'Oh my gosh, this looks fun!' When I got it, my first day playing it went well suprisingly, and I looked forward to playing the next day. Then I looked at the servers, and they were unpopulated. So I played some AOS, my only other game. For the next few day the servers were still unpopulated. This went on for several months, so I bascically stopped playing. When you actually start playing, it's a whole other story.  The graphics SUCK and that is an understatement. You cant even tell what the heck what's going on half the time, but that isn't usually a bad thing, since there is no playablility.  If you're going to ignore the graphics and the many bugs, then this game still sucks. That whole 'approval' trash that guncraft does to approve something is rubbish. I've seen and felt first hand the power and the over-poweredness (is that a word?) of the fact that a one hit kill minigun with 100 rounds with 10 bullets per second is approved? What the heck?!  Speaking of making guns, that system is the only decent theing in the game. However, that still kinda sucks, because in the trailer it never says that you have to make an ironsight. This is what commonly happens; you make an awesome and detailed gun, only to realize you know nothing about computers, and you have to make an upload an iron sight, with some unknown program. That right there is the definition of a rage.  Ok, now to the killstreaks. they're kinda cool, but not really. the best in my opinion is the hover bike, which is the only thing people will ever use. How the heck would you even get the kills for the big things like the mega suit. It is so laggy you might commit suicide and not even know it!  The equipment. By that I mean, the grenades. They SUCK, and that is being kind and considerate. They do NO damage at all! Gunk grenade is like the blooper from mario kart but much less annoying. The regular grenade I threw the last century and still won't explode. The others, I'm not even going to talk about, they make want to puke.  One last thing. Isn't there a law in the constitution or something, that you can't advertise that another game sucks? The first guncraft trailers were just that, back stabbing AOS (which is VERY fun by the way) saying how it is better. But really, it is just the opposite. Sure there are helis, tanks, grapples, and parashutes (correct my spelling is i'm wrong) but those suck. Even the helicopter, which I was excited for, you can't even fly correctly. It doesn't give you a turtorial, ao you end up going staight up until you explode for some reason.   Verdict;  DONT get this game for your life, you're mom's life, or even your girlfriend's and/or boyfriend's, because it'll just make it worse. If you're going to buy a game that includes building and placing, get AOS. That is fun, and isn't buggy, runs smooth, and the graphics are exceptional. This thing is a discrase to the gaming world, and shouldn't be on steam. Dont get this, please, it will make you're hard earned 13 bucks go to some lazy developer that couldn't make a game correctly.  Disclaimer; My graphics card isn't the best, but is I can play AOS smoothly, then there is no reason for this game to lag so freaking hard.  To the Devs; Honestly, your game sucks, there is no other way to put it. Pro tip, adding texture packs won't change the game, it make you look lazy. I mean seriously, a game with this bad graphics can't take so long to update with a benificial update. If you update this, i may have a different opinion, but as it is, that wont happen in the next millenia",
            "review_score": "-1"
        },
        {
            "review_text": "Bad graphics,Its very hard to make something,Play Blockstorm if you want the same but much better!",
            "review_score": "-1"
        },
        {
            "review_text": "This game was great when it first came out, but now it's completely dead. There are little to no servers to play on. 'Sure' you might say. 'I don't care about the multiplayer, I just want to make guns and build!' Well thats gonna be really hard considering that everthing you build needs to be upvoted by a dead community in order to even use it. I would completely recommend this game if you had a few friends to play with, it's really fun! BUT I can't recommend a dead game.  TL;DR GAME IS DEAD, MOVE ALONG.",
            "review_score": "-1"
        },
        {
            "review_text": "This game advertises the gun creation, but the gun creation is absolutely tedious. Maybe if you didn't have to do it first-person minecraft style, trying desperatly to eyeball the scaled-down sidle of the massive gun in front of you, it might be a little better. Nobody plays this game either. Its a ghost town. One or two servers have as many as 10 people, but that is absolutely it. Overall, this game could have been good, but a combination of poor advertising and a small player base just puts it below the mark.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this with my 2 brothers and initially had fun with OP speeder bikes, tanks and helicopters. We played several racing maps and consistently lost track of waypoints. The environment is made of huge blocks and scenery looks the same wherever you are on the track, the sense of speed and competition just wasn't there.  - Servers underpopulated (7 servers with total population of two players)  - Gets old really fast",
            "review_score": "-1"
        },
        {
            "review_text": "Awful game. I hoped this was going to be Ace of Spades done properly, but I'm surprised to say it's even worse.  Movement and controls are clunky, so don't expect to be running and jumping and shooting skilfully. This (and the target audience) is probably why most matches are just sniper wars.  Plenty of things don't have sounds, which is actually a big deal because it makes things feel unresponsive. Even taking/capturing/returning the flag doesn't have sounds, only a small message. This makes it very difficult to tell what's happening.  Even with those things fixed, the gameplay just isn't balanced. As expected, the sniper dominates. CTF is poorly done - nobody really wants to take the flag because of snipers, and because you have to walk the flag back on foot, unable to use any weapons. The flag returns quickly enough that you often can't get back to it in time after dying, and sadly most of the team don't try to help.  There is a building system too, but it's redundant. Nobody has time to build things because the controls are too cumbersome and will get them killed. Anything other than stairs and bridges are useless anyway.  In short, this is a game that had potential but plays like an alpha, which is unforgiveable given the amount of time it's been on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry to say but this game was a total waste of money for me. Luckily I didn't have a chance to waste my time on it too simply because I wasn't able to get into any server and this is the only game I'm having connection issues or something like that. Hopefully it may fix and improve itself so I can enjoy the game or atleast play it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun. WHEN THERE ARE PEOPLE PLAYING.",
            "review_score": "-1"
        },
        {
            "review_text": "No single-player = fail",
            "review_score": "-1"
        },
        {
            "review_text": "This game entertained me for a solid five minutes before I ran out of things to do. Ace of Spades is a much better example of what kind of game Guncraft tries to be, so buy that instead. I don't think it would be worth buying even if it only cost a single dollar.  ",
            "review_score": "-1"
        },
        {
            "review_text": "The exact things that many people cite as this game's best qualities are in fact what I dislike about it. It was pieced together with about as much finesse as some of the shoddier Minecraft mods, but without all the advanced base functionality that Minecraft brings to the table. This is literally a voxel-based shooter, nothing more, nothing less. If you were hoping to spend hours immersed in servers, alternating between building and shooting, then you will be sorely disappointed.  That being said, the maps are impressive, if not somewhat awkward occasionally. They certainly seem to be where 99% of the development work was concentrated. They are the one redeeming quality about this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Completely dead",
            "review_score": "-1"
        },
        {
            "review_text": "★✩✩✩✩",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks , I do not understand how to make weapons. and the character skins is bad, and the weapons not too much.",
            "review_score": "-1"
        },
        {
            "review_text": "A game that started out with a unique idea and tons of potential has unceremoniously died and faded away from existence.   Initially, creating your own blocky 3D weapon and assigning its attributes is a fun exercise in experimentation. You can create the standard assault rifles, sniper rifles, rocket launchers, etc., but you can also create something fun like a machine gun with explosive rounds. Once your weapon is looked over and accepted by the community (which can take from a day to whenever, depending on the whim of the community), you can join one of the servers and blow someone to blocky hell with it. Sounds fun, right?  Trust me, it's not as fun as you think it is.  While modifying and tweaking with weapons parameters can be intriguing for an hour or two, it just doesn't go much deeper than that. You can't change projectiles or projectile colors, projectile behavior, weapon sounds, or anything else to give your weapon its own personality. Thankfully, the game does balance the weapons attributes so you can't create a fully automatic sniper rifle with zero recoil and earth-shattering rounds.  While you can create your own arenas for you and your friends to play in, as of right now, no one is playing this game. You might find a few diehards in game, but rarely will you be able to bring the mayhem online.  So should you get it? If a sale ever brings the price down to around $2.00 I'd say go for it. There are a ton of better games out there that are worth the $15.00 price that this game is asking.  +Pros+  Voxel-based graphics  Easy to create custom weapons  Tried and true game modes  You can share your creations  -Cons-  Non-existent user base  Voxel-based graphics  Not-so-easy to create in-game crosshairs  Fairly bland gameplay",
            "review_score": "-1"
        },
        {
            "review_text": "this game should have been a classic as soon as it came out.the reason it is not?...the maps. the maps are basically unplayable.it's really too bad because every other aspect of the game is awesome! they have melded battlefield and minecraft,and did a great job! if the maps were playable and inspiring we all would have been playing this game for a long time now!",
            "review_score": "-1"
        },
        {
            "review_text": "Ahhhh, Guncraft. This game is good and bad on so many levels, but it's the playability that makes it more of a no instead of a yes. The game has a hilariously sad lack of player activity, and even if there are tons of people playing this game, they don't have dedicated servers to rely on or even proper connection to host their own servers. (well, unless you have hamachi, but that's a different story.) Other than that, there are little problems that make this game bad, except maybe certain weapons (community made, specifically) are either too powerfull or suck more than a vaccuum. Unless you have great patience, you're not going to gain anything from this spin off of Ace of Spades disappointment.",
            "review_score": "-1"
        },
        {
            "review_text": "Friend bought this game for me. Least to say, played 5 minutes, saw a speedhacker, laughed about how bad everything was/looked, and how everyone took the game seriously. Servers are dead, kids think they can go mlg at this game. 3/10 looks like minecraft. Im gay.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it pretty early. Even a 4-pack. I regret it. Skip this game and try Ace of Spades instead: much better.",
            "review_score": "-1"
        },
        {
            "review_text": "I cant believe I bought and wasted my money on a dead game, the multiplayer is dead, cool consept, but I want my money back, oh well, just dont waste money on this, and mostly, I am positive and fair with comments, but this game, just, wow, talk about dead community man...",
            "review_score": "-1"
        },
        {
            "review_text": "It WAS good, then it just died out and since this is a multiplayer only game, many servers are empty so i'd give it a miss",
            "review_score": "-1"
        },
        {
            "review_text": "Not even kidding. I wasted 15 euro on this game. Gaben why didnt you add Steam Refund more early?  I even wasted 5 minutes of my f*cking life on this game",
            "review_score": "-1"
        },
        {
            "review_text": "This is the worst game in the world.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont like this game because its boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game is kinda stupid. It is like a ghetto minecraft with guns. Some of the concepts are neat but I couldn't get into it. Joined a server and was just constantly sniped.",
            "review_score": "-1"
        },
        {
            "review_text": "It was not really what i thought it was going to be. The trailer looked better then the game :/  Tho it's a bit fun but i would not suggest picking it up unless there is a sale! Can't complain too much tho since i got it for 1$ of humblebundle :)",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: - Make your own guns/skins/maps - Download and use custom guns/skins/maps made by other players - Nice steam emoticons. Cons: - No way of making good ironsights without a picture editing program capeable of giving your image a transparent background. - ^because of this its hard to make guns that you'll actually be able to use (as player voting system will prvent it from getting through) - Barely anyone plays it anymore.  Great game, but due to its multiplayer focus, it is basically unplayeable now as no-one plays it anymore. Spend your money elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Last time I died on this game.... I got explosive diaherria   This game is not recommended due to multiplayer is so dead. Your mom doesnt know it is.  The game on singleplayer is so bad it needs a remodel from Elvis Presley  And  The HUD etc. looks so bad I used my own PC Hard drive containing Guncraft (Only guncraft) to wipe my ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Last time I died on this game.... I got explosive diaherria   This game is not recommended due to multiplayer is so dead. Your mom doesnt know it is.  The game on singleplayer is so bad it needs a remodel from Elvis Presley  And  The HUD etc. looks so bad I used my own PC Hard drive containing Guncraft (Only guncraft) to wipe my ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "It might have been fun when it came out but the community is dead now only like 5 people a day are on 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "PLEASE READ THE ENTIRE REVIEW   Guncraft is absolutely one of the WORST games I have purchased in a long time. This game has so much wrong with it I found it difficult not to give this game a straight 0. I will share my exact experience with you all, and hopefully deter you from buying this flaming pile of crap disguised as a game.  From the second you start the game you well be met with some nauseating menu system.  Shortly after you are bound to attempt to navigate the terrible menus towards the video setting.   Finally, you made it to the video settings…..I think? There are NO video settings, no resolution, no vsync, no quality settings, NOTHING.   You were just let down by the video settings but you have high hopes for the game after looking at all the touched up screenshots that you will soon find out are all lies.   You connect to your first game, you will notice almost immediately that you have no idea what anything does for any of the prebuilt “classes” as there is no description for any of their perks and bonuses. You would have to mess around in the character builder for 10 minutes to find out just what their prebuilt classes do.  Ok you don’t care exactly what everything does, you just want to play! You hop in your first game and immediately notice that the graphics are NO WHERE near what was shown in the screenshots, but you don’t care much about graphics so its all ok.   You see your first enemy run….I mean LAG by. That’s right, as if all this was not enough they have lag issues, trust me it’s not your computer, it’s not your internet…Its their poorly built game. I will spare you my entire pc specs and just tell you I have an i7 and 2 GTX 680’s…this game SHOULD NOT have frame issues.  You have been playing for about 10 minutes now, you undoubtedly noticed that this game has SEVERE balance issues. Not only are the guns unbalanced but the killstreaks are as well. Ohh wait, did I forget to mention the game has killstreaks? Ya…it does.  So you are sick to your stomach now, realizing you wasted $15 on the game, you are just about to quit out when the game crashes on you. YUP CRASHES! This game has that problem too!(5 out of 6 of my friends crashed in the first 15 minutes)  Well you had a bad experience with the game, so you go to the forums to discuss you issues with it. 30 minutes later your thread is locked/deleted and you have been banned from their forum. YUP! The devs are censoring any negative comments about their game….can you guess why? Because most people are going to say this game SUCKS.  Ohh and to top it all off….this game has been created before. Ever hear of Ace of Spades? Go look it up..are you still in the mood for a cube style shooter? Well Ace of Spades does it quite literally a HUNDRED TIMES BETTER than this piece of crap.  Recap!  THE BAD -Nauseating Menus -No Graphic Settings -No Resolution Settings(stuck with black bars on top and bottom of screen) -Crashes -INSANE BALANCE ISSUES -Graphics SUCK and still manage to produce fps lag -Network Lag -Devs censor all bad reviews -Complete and utter KNOCK OFF of games that do this better  THE GOOD -The build mode is…cool…until a structure that took you 10 mins to build is destroyed in 10 seconds by an explosion.  DO. NOT. BUY. THIS. GAME.  SCORE: 9 out of 100",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this a long time ago. Now I can't refund it.",
            "review_score": "-1"
        },
        {
            "review_text": "It is batter than Ace of Spades , but this game is dead now.",
            "review_score": "-1"
        },
        {
            "review_text": "after around some time playing this game all i can say is this: it isnt worth it.  Its a bit of a bore. Servers are laggy, people treat it like COD and over-all really isnt worth the money. $15 for something that ive only played for some legit time at most is 20 minutes, which is how long the matches tend to last through teams camping one hallway to a full on siege mode map.  The building is highly unpolished and tends to feel a bit cheatsy since the other team doesnt know that you are mining underneath them and the maps are hella tiny so not having a weapon out is allmost certain death and the guns people make are at times really OP and jst overall look bad in its pixely form.  in a nutshell: wait for it to be on sale, dont buy it full price like i did",
            "review_score": "-1"
        },
        {
            "review_text": "The game is dead, no players.",
            "review_score": "-1"
        },
        {
            "review_text": "dead community, don't waste your time.  [EDIT] as of august 22nd 2016, this game is still dead.",
            "review_score": "-1"
        },
        {
            "review_text": "This game had DLC?",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been awesome. Wasn't. Shame.",
            "review_score": "-1"
        },
        {
            "review_text": "About two or three years ago, this game was great. The group of friends I played with at the time loved it, we would play a small game with just the four of us and other players would quickly join. However, we eventually stopped and began playing a similar game: Murder Miners. While Guncraft was more of a minecraft meets Call of Duty scenario, Murder Miners does the same approach but with Halo. Overall, Murder Miners is superior in gameplay. There is also the unfortunate truth that is Murder Miners is a lot cheaper. Comparing the two, Guncraft died long before Murder Miners did. Now they're both dead. So, if you have a group of friends and want one of these games, consider Murder Miners for the price tag. If it's strictly about the games and not the price tag, they're both equally good in their own ways. Visually and gameplay, I think Guncraft loses to Murder Miners. I am going to thumbs this down, the price tag is just really bad for such a dead game.",
            "review_score": "-1"
        }
    ]
}