{
    "app_id": 242570,
    "name": "Space Hulk",
    "release_date": "2013-08-15",
    "developer": [
        "Full Control Studios"
    ],
    "publisher": [
        "Full Control"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Warhammer 40K",
        "Strategy",
        "Turn-Based"
    ],
    "achievements": 28,
    "positive_ratings": 1292,
    "negative_ratings": 556,
    "price": 18.99,
    "description": "&quot;WE ARE THE VANGUARD OF HONOUR. THE CUTTING EDGE OF THE BLOOD ANGELS. WE BRING DEATH.&quot;The legendary Space Hulk returns to Windows PC, Mac and Linux in this epic turn based strategy game. Set in the Warhammer 40,000 universe, an intriguing story of legendary battles and heroic actions unfolds.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/242570/header.jpg?t=1501264478",
    "minimum_requirements": "OS: Windows XP Processor: 2 GHz Dual Core Memory: 2 GB RAM Graphics: NVIDIA GeForce 8600 GT / ATI Radeon HD 2600 XT or greater DirectX: Version 9.0 Storage: 4 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": "OS: Windows 7 Processor: 2 GHz Dual Core Memory: 4 GB RAM Graphics: NVIDIA GeForce 9000 series / ATI Radeon HD 3000 series or greater DirectX: Version 9.0 Network: Broadband Internet connection Storage: 4 GB available space Sound Card: DirectX Compatible",
    "reviews": [
        {
            "review_text": "Plays just like the board game. A big thumbs up. Unless you hate the board game, then don't get it.",
            "review_score": "1"
        },
        {
            "review_text": " 01. GENRE:  A Strategy, Sci-fi, Boardgame adaptation.   02. SETTING:  A faithful recreation of the Games Workshop boardgame of the same name set in the Warhammer 40k universe. Two mortal enemies fight to the death on maps that represent floating space hulks; Humanity's defenders - the Space Marines against the vicious alien horde - the Genestealer.   03. STORY/BACKGROUND:  In the far future Humanity has reached and conquered the stars. An immortal god-like emperor rules over the vast expanse of human empire that fills the galaxy. Alas there is no peace only war. Numerous alien species fight against each other for dominance and survival. Among these are the Genestealers, alien swarms that use the bodies of other species to procreate their numbers. These parasites move from planet to planet on the captured spacesships of other races. They spread their numbers by traversing the cosmos over 100s &amp; 1000s of years until they are pulled in by the gravity-wells of unfortuate planets on the same flightpath. These spaceships house tens of thousands of aliens. Once detected a chapter of space marines are sent to combat the threat. Space Marines are the genetically enhanced super-soldiers of the emperor, who don the toughest 'Terminator' armor and most destructive weapons known to man, in order to stand a chance against such overwhelming numbers. They are the thin line that protects humanity.   04. GAME MODES:  The base game contains two singleplayer campaigns totalling 12 missions, each of which can be replayed in multiplayer. Additional dlcs provide 5 mini-campaigns of 21 more missions.   05. GAMEPLAY:  Consists of tactical, squad, turn-based combat. One or more squads of five space marines are deployed on missions to complete one or more objectives. Action takes place using IGO-UGO alternating turns. Players issue orders up to the actions points available for each unit. Actions include: movement, shoot, melee attack, psyhic powers, placing marines in overwatch or defensive stance and interacting with doors or mission objects. Missions are not linked so losing marines does not affect starting positions in the next mission. (The spin-off sequel does that.)   06. MECHANICS:  All combat successes are determined by die rolls. Squad leaders provide additional action points through a pool of Command Points which can be used to give any marines to augment their actions in a given turn. Though generated at the start of every turn, if a squad leader is still alive they can attempt to re-roll how many command points available at the start of a turn. Understanding Command Points is essential to beating the game as they are needed during the enemy's turn as marine weapons can jam as they are used. If they do Genestealers can overwhelm the affected soldier and kill him easily. Marines must be given the overwatch or defensive stance commands during the players turn in order to re-act during the A.Is turn.   07. A.I:  Overall the A.I performs adequately. Though there does not need to be anything too clever to control the enemy aliens as they spawn from fixed locations. All the A.I has to do is close in for the kill and overwhelm the player. However the challenge presented is manifest by the limitation on Space Marine movement and actions. More often than not a marine not in overwatch, defensive stance or with a jammed weapon will die.   08. GRAPHICS:  Isometric Fixed/Rotateable 3D, with short action-oriented cutscenes. Space Marine units are well modelled and distinct. The maps and genestealers do look the same however.   09. CONTROLS:  Keyboard and/or mouse. Good and functional. All actions can be performed by point &amp; click.   10. SOUNDTRACK &amp; AUDIO:  Suitable. Together the add to the overall ambience of the setting. Weapons fire and death cries (from both sides) add to the immersion.   11. VOICE ACTING:  The voice-overs provided for the space marines add to the immersion. You can imagine mission briefings being given by a suitably stiff, no nonense genetically enhanced super-soldier from the future. Voice excerpts of marines confirming your orders or during the heat of combat give that feeling that they are human and part of a team.   12. DIFFICULTY:  Game played on normal difficulty. Overall the missions are fairly straightforward but making a mistake is unforgiving. Harder mode does not allow saving, unless you quit the game &amp; continue later during a turn. Enemies spawns may have been larger or more frequent but I did not notice that much of a difference. An easy option is available but I did not play this.   13. PLAYTIME:  The base game has around 20+ hours worth of gaming if you play through the main campaigns and the other dlc mini-campaigns. This can be extended by replaying missions on other difficulties or in multiplayer. Getting all the in game achievements took me 55hrs but it could take double that and more.   14. PROBLEMS:  No problems stability or otherwise were encountered during my playthrough.   15. ACHIEVEMENTS:  Most achievements are given for completing missions from the main campaigns. Some are given by completing combat feats using space marines armed with certain weapons. All but one achievement can be gained through one playthrough of the main campaigns. A few others may require playing through the campaign missions repeated or better still playing through the dlc missions. If you fail to gain any achievements you can replay missions that you have beaten at any time.   16. DLC:  The DLC on release were expensive but on a sale should be a fairly resonable price. The optional genestealer skins are not required, the Space Wolves chapter replaces the standard space marine units with different soldiers and models providing a totally different experience than in the base game. This is optional but a must have if you wish to replay the game as much as possible. The dlc campaigns however are a must if you want to play more of the same, if harder missions.   17. APPEAL:  Will appeal to fans of the franchise or original boardgame. It will also appeal to strategy gamers or grognards who are looking for something a little different in tactical turn-based sub-genre.   18. ENJOYMENT:  Very enjoyable if you liked the Space Hulk boardgame given its such a faithful adaptation. Also enjoyable if you dont mind a challenge and dont mind losing against a pretty competant A.I, or if you like short tactical games where the options are limited and missions fairly repetitive.   19. LONGEVITY/REPLAYABILITY:  Limited though with dlc less so. Each mission has been designed to be replayable but fixed objectives and maps mean that only the genestealer spawns and attack routes may change. Otherwise only in multiplayer where a human controls the genestealers can there be any replayability that isnt linked to the difficulty level. Space Wolves dlc allows replay of all campaigns with a differently styled and equipped group of soldiers.   20. VALUE FOR MONEY:  Fair. The base game is a fair price but given the DLCs are quite expensive I personally would opt for the complete collection or get all items on sale.    VERDICT:  Overall for a Full Control game its rather good. Space Hulk is a simple game. It is modelled afterall on a boardgame. Yet the graphics and sound captures the setting perfectly and the spirit of the boardgame very well, at least from what I can remember of my few games playing it. Missions and tactical options may be limited in scope but there is a very enjoyable if somewhat repetitive challenge to be gained from playing through all the missions and then changing to the a different set of soldiers. A solid purchase for any strategy gamer or fan of Warhammer 40K.*  *The spin-off sequel: Space Hulk Acension does the above but with linked missions and RPG elements.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  This is a computer game reproduction of the tabletop boardgame, If you understand that, this game is amazing. All the mechanics, rules and randomness are because its origins as a tabletop game.  The graphics are really lackluster, the models are cool with a nice semblance to the minis but they got not much detail or texture or material work on them. The effects are nice with really over the top gory blood.  The sound design is really good with crunchy blasts, a nice metallic echo to everything you do and a nasty shriek to the filty Genestealers. The music gives you a nice background never interfering.  Give this one a chance if only to help The Emperor, Brother Librarian Calistarius needs to fulfill his destiny at the Second War for Armageddon...",
            "review_score": "1"
        },
        {
            "review_text": "Straight forward turn based strategy. Like a board game come to life really. Not for you if you like anything more fast paced, but it gets pretty tactical and there are certainly some nail biting moments when you're waiting to see if your plans work or the Genestealers inch closer.",
            "review_score": "1"
        },
        {
            "review_text": "faithful recreation of the tabletop game I spent too many hours wiling away at.",
            "review_score": "1"
        },
        {
            "review_text": "For fans of the board game.",
            "review_score": "1"
        },
        {
            "review_text": "Turn grid based game. Very true to the table top version. Not a bad port to pc for the francise.",
            "review_score": "1"
        },
        {
            "review_text": "Great adaptation of the board game. Involves a lot of random rolls, but quite a bit more forgiving than table top version, since you can 'undo' your last move even after the roll.  In this version of the classic board game, player controls a squad of Space Marine Terminators of Blood Angels chapter, as they delve into the cavernous corridors of massive space hulk, infested with genestealer aliens. Each Terminator has 4 action points to spend on your turn, and literally every slightest move costs action points, including changing facing. Luckily, on every turn you get a common pool of a 1-6 command points that can be spend by your squad to do additional actions. Poor roll of command points can be rerolled once per round, as long as at least one squad sargenat is alive. Leaning to take maximum advantage of action economy is key to being good at this game.  Just like any other game based on dice rolls, the random factor can feel punishing to beginners, but the game is quite easy overall, I think I managed to do most missions in a single attempt.  Notable differences from table top is that you can't play as Genestealers in a single player campaign. Some weapons and powers work with slight differences (most notably flamer) and unfortunately video game did not include the new missions from third edition.  Overall, it is a light and enjoayble board game adaptation, especially if you are a fan of table top space hulk and having trouble bringing this massive game to the table regularly.",
            "review_score": "1"
        },
        {
            "review_text": "I have always been a huge fan of Warhammer and all the games attatched to it. I have many fond memories of playing Space Hulk with my dad. This game was a huge nostalgia trip for me. It is a very faithful recreation of the game down to the most intricate detail. It's a lot of fun to own your friends over the internet.  All this being said, it is very poorly optimized and the system requirements on the Steam store page are a flat out lie. This wouldn't even be an issue if you had the option to turn on and off individual graphics settings but the only options you get are automatic (low, high, ultra and so on). Needless to say, I would NOT have made this purchase if I knew I'd be playing most of the missions at 10 fps or so. If you have a newer video card none of this will effect you but Steam needs to get them to change the 'Recommended' specs to something like GTX 200+ series instead of the advertised Geforce 9000 series.  In short, it's a great game wothy of your time but perhaps not the asking price. If you love tactical, turn-based strategy and the artistic stylings of the Warhammer universe definately get this one on sale. Otherwise, it's not worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "The Emperor of Mankind commands you to get this game and play the hell out of it or else you're a heretic. Are you really going to disappoint Him?",
            "review_score": "1"
        },
        {
            "review_text": "Back to the original :)) - saves all the set-up time, and chasing those dice around the floor.",
            "review_score": "1"
        },
        {
            "review_text": "Overall it's decent, but someone who liked to play just single player games might find it a bit weak compared to alternatives.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why this game got so many bad reviews. Just picked it up on the Steam summer sale and it's been a great tactical thinking game! It's a tough game that you forces you to think, but still much easier than the original Space Hulk video game from decades past!",
            "review_score": "1"
        },
        {
            "review_text": "Though I was quite skeptical going into Space Hulk, I was pleasantly surprised by how much I enjoyed it. The care that went into crafting this game is evident in every rivet on the walls and every pile of bones littering the floor. I absolutely recommend this refreshingly faithful adaptation of the original.",
            "review_score": "1"
        },
        {
            "review_text": "Hi I've played the Board Game for 20 years now and this game is kinda cool in its own way....just wish I new their was a back button....as I might have finish the first campain with no casualtys!! I give it a thumbs up! and the price was right ($2.59 on sale) can't beat that!! the down side is there is a little lag some times and that is where mistackes can happed.",
            "review_score": "1"
        },
        {
            "review_text": "OMG!!! this game took me back to childhood, painting the models, setting the board game up and kicking some steeler butt!! cant wait for death wing",
            "review_score": "1"
        },
        {
            "review_text": "Digital adaptation of the Classic Board Game, keeping true to original gameplay mechanics while building on suspense and atmosphere through a 3-Dimensional environment. Pure and Refined strategy and planning is required.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! THANK THE EMPEROR OF MANKIND",
            "review_score": "1"
        },
        {
            "review_text": "A great translation of the board game.",
            "review_score": "1"
        },
        {
            "review_text": "My recommendation is only Valid to fans of Warhammer 40k &amp; Squad Tactical Turned based games.   First off I have to say that like many others I was hoping for a Warhammer 40k: Space Hulk done like the excellent Xcom reboot from 2012. I had seen, but never played the original Space Hulk, and have never got into the table top original.  After seeing it initially I thought oh, if it is like Incubation then I will still love it. It still did not have the variation that Incubation gave but I played through a few hours before having a copy purchased for me. As such I can honestly say I knew what I was getting.   The Good: To the best of my understanding it is a reasonably faithful recreation of the table top version and has the feel of a Warhammer game initially.  The Bad: It is a recreation of the table top game with tolerable graphics, bland sound, and no atmosphere in either. the game play easily gets repetitive and most stages can be completed by holding corridors with ordinary bolter armed dreadnoughts on overwatch. It is the height of Rinse and Repeat. You have no sense of involvement in the squads or their members, meaning i feel no personal loss when a team member goes down other than annoyance, The price is too high for the game and I feel it should have been in the $15 range.  The Personal: Having had it purchased knowing the faults you may wonder why. Well..... 1. Warhammer, duh! A fan does it and just fills in the blanks in his mind. I imagine the sounds that   are missing, I picture the graphics being better and my imagination puts me there. 2. Squad Tactical Turn based game. I love them and so will forgive some. 3. Despite there being very little variation it still is interesting in the begining each each turn in   planning out deployments and deciding how to achieve the objective. after the first 5 minutes   though it is all auto pilot. 4. I grew up playing games on an Atari 2600, then Nintendo Famicom, Sega 16bit, and early PC   games like Wolfenstein and Blake Stone. Graphics and sound are not the only things that attract   me I want solid game play mechanics and while simplistic this game feels solid in that aspect to   me.  I give this a personal score of 6/10 and only because I am ignoring the (personally feel) high price. If i had to calculate the pricing into my view of the score i would make it 4.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "I must admit to having never played the Space Hulk board game, but I watched several friends play (and recommend) it so I immediately recognised the title when it appeared in my Steam feed. What I wasn't expecting was a relatively poor metacritic score and a flurry of negative reviews, which effectively dissuaded me from purchasing it at the time.  However, seeing the game go on sale at %80 discount I figured ♥♥♥♥ it, and picked it up anyway for £1.90.  Man, never have I felt the need to defend a game so vehemently. I can pretty much sum up the negative reviews in one comment: fools who never bothered to read one sentence beneath the game's title and came up with 'Hurrr! 40K! I can be haxxorz uber space marine! Derp derp derp...' As far as I am concerned, the game delivered *exactly* what it promised in a very short description. It is a slow paced, tactical, mission-based survival in line with the board game. Your squad move slowly because Terminators walk slowly. You die frequently because being outnumbered and in the dark only suits the Genestealers. Have people forgotten the movie Alien already?  The missions, while short, give a nice sense of having to overcome terrible odds by out-thinking your enemy. Each forray into the depths of the ship feel like gamble after gamble on the part of the Blood Angels. I feel the game does an excellent job of quashing the tired notion that Space Marines are invincible, by putting them in exactly the environment that cancels their prowess. I like the fact that they move slowly and have to spend AP just to turn around, because it highlights the weakness of their cumbersome armour in corridors they can barely squeeze through, and creates a feeling of vulnerability because let's face it: the Genestealers have the jump on you.  The game does not, however, ruin the Space Marine's reputation for sheer force of will. Your troops gladly stand unfaltering in the face of the enemy hordes, declaring faith for the emperor as they take down legions of aliens even as they meet their doom. A big criticism of the game from some reviewers is the gun-jamming mechanic, which seems petty, because it can only occur when the Marine's are set to overwatch mode. In a nut-shell, this stance allows you to literally gun down wave after wave of Genestealers as you stubbornly hold your ground. This is immensely satisfying, but as I mentioned it can cause your bolter to jam. For me, this only adds to the feeling of desperation that you cannot hold out forever and brings a touch of thrill and uncertainty because of the random chance.  The game isn't without it's faults. As I mentioned the missions can be quite short depending on the objective, and also quite quick (especially on hard mode with the timer) because you can often sacrifice your Terminators against the oncoming enemy to ensure completion of the goal. Again though, this adds to the desperation and realisation that this is almost a lost cause. The animations could use a little more variety too, especially in melee, because battle after battle can start to make all of your deaths feel the same. However, my largest criticism is the game is a touch on the easy side. This is mostly because the game tells you precisely where the enemy is likely to attack from. Because of this, you can set your marines to guard choke points whilst your other guys go off and find the goal. I would have prefered for there to be no indication of where the threat might appear, forcing the player to constantly watch their back to avoid being picked off one by one from the creatures in the dark...  All in all this is a top game undeserving of the flack it recieved. I am aware that some of this was due to bugs in the early access version but I can assure you that as of now, the version I'm playing is polished and has yet to throw up a single glitch. Highly recommended, and if you're unsure about what the gameplay might be like, you only need to go to the store page and read the game description.  The Emperor is your shield!",
            "review_score": "1"
        },
        {
            "review_text": "i had some friends who owned the original boardgame and played warhammer itself , so i have an idea of what this game should be. and i think they've really nailed it , the gameplay , the looks and especially the atmosphere are spot on!   an awesome game that not only looks great but plays very well too. i highly recommend it to anyone who enjoys games!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing adaptation of the original board/pen&amp;paper game.  The genesplicers, while cool, are the only adversaries in the game. They do not distinguish between any but that is pretty much the only complaint I have! There are skin packs but those don't really help that they all look the same overall.  The variation in the Marines is amazing and totally overshadows the fact that you are mowing down the same xenotype everytime.  Overall highly recommend if you are in-to the Warhammer 40k universe, lots of fun and supports hot seat play for those not wanting to invest a few hundered to get started with the real thing.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and interesting game with 0 replay value.  The visuals, dialogue, and animations are very nice and true to the space marine style making the game a joy to play but with confined areas, unit collision, and only one type of enemy the game soon shows itself to be a puzzle game more than a turn based tactical shooter.  There's a slight element of tactics with what you choose to do but with a low learning curve the best options for what skills to use are immediately evident. The game itself comes down to figuring out how to push certain units through sometimes endless waves of enemies. This is achieved by positioning units to make certain parts of the map safe so other units can move through and continue the push.   ",
            "review_score": "1"
        },
        {
            "review_text": "Metascore 58???.... whoever rated this low doesn't understand the Warhammer 40k Universe or this game.... this is an excellent recreation of the board game",
            "review_score": "1"
        },
        {
            "review_text": "It's all about butthert, soldier. You can't count on your bolter - it's always jammed. Don't even think about melee fights - ♥♥♥♥♥marines dies from the first scratch. 'Heavy weapon guy' can blow up the hole squad. Even 'load' button available only from main menu. But, after all, i enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "Space Hulk was an interesting purchase for me. I enjoy the 40k universe quite a lot, and if you do as well, you will probably enjoy this game. Its clunky, has a few glitches, lacks customization of Terminator loadouts, costs a lot, isn't too long, and lacks a detailed story. But, I still liked it quite a lot. The game is not worth $30.00. buy it on sale if you are going to. The game has decent length and replayability, but unless you buy a copy for your friend, you won't have anybody to play with. the multiplayer UI is confusing and ineffecient, not to mention almost completely dead. The DLC for this game is more expensive than i'd like it to be. Buy Warhammer 40k storm of vengeance with this game while they are both on sale to get the best of your money. SoV comes with a free DLC package for Space Hulk and Space Hulk unlocks the terminator in SoV.  Buy this on sale. if you can, find a personal friend to play with. Do that, and its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I hate Brother Goriel",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a nice game...if you like the board game, this is definitely the game for u....:)",
            "review_score": "1"
        },
        {
            "review_text": "Fun strategy game. gets difficult in later missions.",
            "review_score": "1"
        },
        {
            "review_text": "This game is everything I hoped it would be. Picked it up on Humble Bundle, and is so far the best deal I have gotten on a game.  I have been a 40K fan for many, many years. Have played the games (video &amp; table top) in all it's variations, and I had high hopes for this one. So far, not let down one bit.  The game plays like I wanted it to (table top rules), is fleshed out just right, and requires you to really stop, think, and plan. It is pretty unforgiving to mistakes, and that is just fine with me.  Great game...10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was leary as hell for three seconds and then my love of all things 40K won and I bought this game. I was leary as the metascore was a very suspect 54/100. Is it buggy as hell? It is just unplayable crap? 'What's could be so very wrong with it?', I wondered aloud on my keyboard.  The short answer is not a blessed thing. This is a flawless port of the 3rd edition of the boardgame (which cost over 100 bucks). The interface is cleaned up from what I saw from earlier release editions.  This is a boardgame. The major complaint people have is the total lack of anything resembling RPG elements. Um, no ♥♥♥♥ sherlock, Space Hulk is a board game and NOT an RPG. Playing Space Hulk and rating it down for not being an RPG is like playing Terraria and rating it down for not being RTS or ArmA for having no farming and resource collection. Ridiclous and silly.  As a board game port this is lovely. Well executed interface, easy step by step tutorial missions, and hey, it's Space Hulk! Ignore the critics who don't know a thing about board games and buy this!!!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game for how accurate it is to the board game. So if you want play a pretty solid turn base game based off board game Space Hulk I'd say it's worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "oldskool spacehulk, how it should be :)",
            "review_score": "1"
        },
        {
            "review_text": "Great port of the board game.",
            "review_score": "1"
        },
        {
            "review_text": "Brutally hard and yet there is something about it that keeps you coming back for more. When you complete the later missions you feel as if you truly earned the emperors respect because along the way you have to push forward against unimaginable odds, guard your key areas, and you WILL need to sacrifice many of your units just to get that one guy through that counts. I even sent a heavy flamer who ran out of ammo in the opposite direction as a decoy to lure the enemy away, he didn't get very far, but it was far enough that I could get the rest of the guys in a good position and win. That mission left me with 2 survivours out of 10 and 130+ of the enemy dead (If you've played this, you KNOW that's unheard of).  Sure, it's not perfect, there are no cutscenes, and the narration gives you very little to run on in terms of story. It's also overly dependant on luck which means you can have the best strategy and still lose (which I hear they vixed in ascension?) but most of the time you can 'undo' your last move that missed and try again to even the odds a little (I only figured this out on the last campaign, wish I had known earlier).   I got the ultimate pack with all the content while on special so I'm not sure what is original or DLC but the full package has at least 20 hours of game here if you're man enough to stick with it. Some of the later missions (harbinger of torment for example) have an absolutely insane difficulty and a single mission can take you over 4 hours to get right. Thankfuly you can save any time you like but trust me, it doesnt help as much as you think it would, especially if there is a turn limit on the mission.   Note: Ascension is not the same missions with a new engine, it's a totally different game with no links to this one. I'm currently waiting for it to come on special but you can be sure I'll pick it up when it does. If it's even half as good as this, I'll be happy, and it's supposed to be better and with a lot more missions!",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10  This game did what it set out to do, and it did it beautifully.   If you remember the first foray into the Warhammer universe...  Space Hulk, the Board Game,  Then you will love this game. Every rule, lovingly crafted into a beautifully modelled and animated game.  This isn't a video game like you're used to, this is more of a board game meets computer-next-gen.  I loved it. For video gamers, it's a pure solid TBS. A comprehensive manual within the game itself, explaining every rule and concept in the game. And finally, some added stuff, a few extra options, and upgradeable marines! It adds a slight RPG element. Difficulties to select your level of unforgivingness.  Remember two things. Burst fire is useless (really, it is), and there is no undo button.  Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Space Hulk was one heck of an experience to have. Looking in the grand scheme of things, you are paying anywhere from $15-25 to buy a virtual game based on a board game that costs well over $90 to sometimes up to $200 in amazing conditions. People interested in buying this product should realize you are buying a scenario based board game set in the WH40k universe. If you like WH40K and enjoy strategy games, this is something you should invest in. If you are thinking this is going to be something like WH40k Space Marine or Dawn of War, you should probably turn away from this game. It gives a clear visual interpretation of the board game Space Hulk, with decent sounds and visual effects. You'll be entranced trying to figure out how to place all of your space marines so that they can cover each other and complete your objective. And with so many missions, DLC, AND Online Multiplayer, this game has a lot of replayability; especially if you have a friend who is just as terminator crazy as you are.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brutal, unforgiving, and at some points I'm almost certain the AI is cheating. And I love it.",
            "review_score": "1"
        },
        {
            "review_text": "The “Best Use Of A Farm Animal” Award",
            "review_score": "1"
        },
        {
            "review_text": "Space Hulk will remain a classic, just like the board game. It's a shame we won't be getting more of these.",
            "review_score": "1"
        },
        {
            "review_text": "Tastes warhammery.",
            "review_score": "1"
        },
        {
            "review_text": "Coulda been more. Everything that it tries to achieve just falls a little short. If you can get it cheaper than the regular $30 price tag, jump on it. Otherwise, just wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I have had this game for a while and its been a lot of fun well reason one you get to kill the aliens and you controll to of the coolest blood angles ever!",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't know what it wants to be. Tactical RTS, shoot-em-up or puzzle. Corridor builds make it pretty straight forward, and usually allowing only one way to play the level, which doesn't leave anything to replayability in the campaign. Just click, like you were meant to click, or you will die. The random things though, can always kill you, meaning that no matter the skill - you can still loose due to the weapons jamming or just missing stuff, or winding up dead with your melee character that just rolls a bad number. Movement tends to get used to as well. Only thing this game gives, is some nice Warhammer setting. Though it has buggs, like sometimes sound of autocannon not playing or shooting wrong direction (visually). Overall, I'd give it about 6/10. If you are a fan of the universe - 7/10, and 8/10 if you are a fanatic. Because the title rides on the story and setting. I reviewed the SP part only, so if you are looking for competetive multiplayer, it might be better. Seeing as human player is always the best opponent, and this game might be mainly tailored for that after all?",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a huge 40K fan, although I do enjoy the universe they've created. I've tried Space Marine, which had some really good qualities, but ultimately was a fairly large failure of a game. I've tried Dawn of War II, and enjoyed it, but it doesn't feel that much like a Warhammer game - it's more of a strategy game with warhammer skinning. Not that that's a bad thing - it's a very good strategy game (at least, in my opinion), but it doesn't really capture the flavor of 40K.  Space Hulk, on the other hand, manages to take a lot of what makes 40K special - the bleakness, the fight against overwhelming odds - and capture that essence pretty damn well. This comes in part due to the fact that it's pretty much a straight reimaging of the board game of the same name, but that doesn't make it any less fun. In fact, one of the reasons I'm enjoying it so much is that the Board Game takes while to set up, and requires 2 people to play. It can be great fun, but despite owning the board game for a few years now, I don't think I've played it more than twice. Maybe three times. This game, however, has already gotten me more play time, and I've been able to see more missions than I ever have on the board game. And the board game cost $100 - AND you're lucky to find it these days - it was a limited run printing.  This game pits you as the commander of a squad of space marines against a hoarde of aliens - sound familiar? In fact, the original game was inspired by the movie Alien &amp; Aliens. Anyway, you command your squad to objectives - enter a room, kill everything, retrieve some artifact - and then see how well you pit your skills against the oncoming alien horde. And horde is correct - unless there's a specific 'kill X genestealers (the aliens) to win' objective, there are unlimited enemies. That's right, they just keep coming. And, to make it worse, the odds are never in your favor. The best you can hope for is to keep them at range and kill them before they get to you, because if they do? It's over. Oh, sure, you have a chance - but not much of one. So you have to plan, and plan well, and even when you plan the best f***ing plan the imperium has ever seen? Yeah, you still need a bit of luck on your side.  This does make it frustrating - but far from impossible. And even those times you lose, you'll learn, and you'll know that it was the luck of the dice, and next time, maybe things will go better. It gives you the freedom to try out different strategies, and take some risks - after all, if you need luck on your side anyway, why not try that risky gamble, in hopes that it'll pay off?  The levels aren't very long - no more than 30 minutes that I've seen, per attempt. Quicker, obivously, if things go really bad really fast. And prepare to lose some guys as well - it'll happen. But that doesn't mean the game is over - your remaining troops can still win the day. And losses aren't permanent - so if a guy dies in one level, he'll be back in the next. Which also gives you some freedom to take risks and not worry - your marines are there to complete the mission, and if that means dying for the cause? Well, that's they're job, and they'll do it.  So yeah, I highly recommend this game. When it first came out, apparently it had a lot of issues, but as of this writing (v1.5) it seems fairly well polished, with the only major complaint is that the animations can be kind of slow. But that's intentional - these are guys in 2 ton armor suits - they're not going to be quick. Again, adds to the flavor.  So yeah, if you get a chance, and like strategy games - I highly recommend you check this one out. But feel free to wait for a sale - I got a copy for $2 in the Summer 2014 sale, and it's likely you'll be able to get a copy for about that cheap again in the next few months, if not during the Winter 2014 sale.",
            "review_score": "1"
        },
        {
            "review_text": "Space Hulk features sluggish gameplay, IOS/Android like outlook and teeth-shattering difficulty (or I just suck). Anyway, this is one of those games which don't need fancy graphics or sound. It just needs teeth-shattering difficulty, big space marines, blasters, flamethrowers, genestealers and everything else it already includes. It's pure Warhammer 40k experience for what I know that universum. I haven't played original board game. I'm pretty noob on Warhammer generally. Studied a bit and played other titles of Warhammer series. I enjoy this game, atleast as long as I have my keyboard in front of me and screen is functioning normally. Good thing I have decent nerves :) For sale price this is very good for your money. Xcom like gameplay with challenge.",
            "review_score": "1"
        },
        {
            "review_text": "For the Emperor!",
            "review_score": "1"
        },
        {
            "review_text": "Although certainly not worth full retail price, Space Hulk is an extremely enjoyable game of tactics that aims to directly replicate the board game. With combat that resembles a more claustrophobic XCOM, you will find yourself leading a squadron (or two) of Space Marine Terminators, some of the heaviest infantry units in the Galaxy, through narrow tyranid infested corridors. Every movement may compromize the safety of your squad and will be done so tactfully.   I got this game for under $2 and it was a great investment, I wish I would have purchased the DLC while it was also on sale. This game is far from a full $30 package and Games Workshop is absurd to charge such a price for it (averaging around $50 with all DLC at retail value), but if you're a Warhammer 40k or XCOM fan and find this game on sale for under $5, it's certainly worth a spin.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome representation of the boardgame. If you want to play the boardgame without the rediculous price tag this is the way.",
            "review_score": "1"
        },
        {
            "review_text": "Great.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended to all of the fans of the original tabletob game.  Empfohlen für alle Fans vom Brettspiel.  ",
            "review_score": "1"
        },
        {
            "review_text": "Decent game...plays alot like the board game from what I hear. Challenging enough that you have fun but no stupid hard where you won't ever play it again",
            "review_score": "1"
        },
        {
            "review_text": "For those who enjoyed (and are able to remember) the board game when it came out, this will renew that delight. Same game and rules, but you have moving graphics instead of figurines. I think the interiors are simple but well done, and the cut scenes aren't too shabby or annoying. Drawbacks for those who've played the boardgame - it's the same scenarios as well (initially). So, if you worked out how to beat the scenarios on the boardgame, you might yourself wishing for more - although I believe the later scenarios in this game were not in the boardgame. Recommended just for the nostalgia, if nothing else.",
            "review_score": "1"
        },
        {
            "review_text": "As an old fan of the original boardgame, I give this game a big thumbs up for its very faithful and accurate translation of the game, particularly since the old boardgame is darn near impossible to find these days for a decent price. The single player game is ok, but where this really shines is the multiplayer option with friends. Now we just need the expansion packs like Deathwing and Genestealer to add even more fun!",
            "review_score": "1"
        },
        {
            "review_text": "It's a carbon copy of the Games Workshop board game. They advertised it as such, and made no attempt to mislead. In that respect, this is a pretty good game. The campaign and maps, and squads are exactly the same as the board game that GW re-released a few years ago. having it in a digital formatt allows me to play it with friends where I normally couldn't. Like the ones that have moved. It's D6 based, enemies spawn in the same fashion as they do in the board game... This is an exact digital copy. Yes, I've said that previously. I'm stressing that point because almost all the negative reviews seem to have missed that entirely.  This is targeted at fans of the Games Worshop line up. Not necessarily fans of the video games made under their license.   If you liked the board game, you'll like this. If you like turn based strategy, you may also like this. If your a fan of the Warhammer 40k table top game, you may find this amusing as well.  You prolly wont enjoy this if... You like fast paced, twitch reflex games. Are only getting it because it has the GW logo. Getting it because your only experience with Warhammer 40k is the video games(that isn't a bash). This is not a 40k video game like Dawn of War, or Space Marine. This is closer to Blood Bowl, which is also a digital remake of a GW board game.  7.5/10 as a turnbased, squad strategy. 10/10 if you're a fan of the board game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good implementation of the board game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game (very hard), but it is very limited with not variation at all! The price is too high for what it has to offer! If you can get it on sale of 65% or more its worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge fan of tabletop games, although never got into Warhammer 40k in particular (I was more into Legions of Steel, which has much in common with the Space Hulk board game as it turns out). I first played the PC version of Space Hulk back in the mid-90s, and it immediately addicted me with its puzzle-like levels and brutal, unforgiving gameplay. I originally grabbed this title purely due to my desire for an update. It was a bit buggy at release; however, it's been cleaned up dramatically and is now quite solid IMO.  It does take a while to get used to the way you have to deploy and move your squad. Some complaints you'll see about randomness is likely the result of someone not getting this completely under their belt. I can also see people's point about wanting some kind of development over time for your squad members, but I'll admit I prefer the more puzzle-like format of the missions keeping you focused on your objective, and sometimes Terminators will fall in pursuit of it. If there was xp-based leveing up of your squad, many people will just save-scum to ensure progression rather than focus on the puzzle at hand.  If you're a fan of turn-based squad combat or table-top wargames, and crave some challenge, I would imagine Space Hulk would fit the bill for you nicely.",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40K turn based top down genestealer killing madness!!",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of Space Hulk board game and the old pc version this is still a must!!",
            "review_score": "1"
        },
        {
            "review_text": "Im a newcomer to the warhammer universe but I love board games and I love giant hulking super soilders if you do too I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Love it Love it Love it",
            "review_score": "1"
        },
        {
            "review_text": "If you were looking for an exact replica of the boardgame, this is for you. For a PC game it could have been much better. There's no music to speak of. No war gear. No experience progress. The animations are ok, but a bit shoddy. Not worth 30$. Maybe 15$.",
            "review_score": "1"
        },
        {
            "review_text": "addicting",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly fun &amp; challenging, &amp; just about any system can run it without sacrificing graphics quality",
            "review_score": "1"
        },
        {
            "review_text": "A boardgame port for the boardgame gods",
            "review_score": "1"
        },
        {
            "review_text": "Most of the bad reviews I've seen about this game is that its bad import from the Board game, but I've never played the board game and I LOVE this game!!!  Man, this game is awesome! It's a beautiful mix of Warhammer 40k Universe and X-Com: Enemy Unknown! There are so many bad reviews about its a bad import from the Board game but the game itself is amazing and very unforgiving.   The Storyline is pretty cool! You control a bunch of Blood Angel Terminators who are trying to salvage one of their Loooong lost ships Called 'The Sin of Damnation' while fighting a bunch Genestealers who would love nothing more then to maul you to death. There's more buuuut that would be spoilers!   My only problem is with it is the price... It's pretty steap but I promise it's worth it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Blood Angels/Space Wolf Terminators.",
            "review_score": "1"
        },
        {
            "review_text": "I think the best way to sum up Space Hulk is this: It's a faithful recreation of the board game and nothing more. I've read reviews about people complaining that there isn't any progression or customizing available. Well there wasn't in the board game so don't expect there to be in this. If you want the board game, then this is for you. If you think you're going to get a game that reflects the current trend in the gaming industry standards, then you're gonna have a bad time.",
            "review_score": "1"
        },
        {
            "review_text": "bought it rock through campaign was ok faithfull to the table top but wanted more i will be looking into the deathwing fps version as for dlc for this meh i aint bothering unless its a level editor and a way to customize your squad like in DOW",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with awesome combat simulations and even more awesome in-action cut-scenes, not to mention the fact that it is AWESOME!!!",
            "review_score": "1"
        },
        {
            "review_text": "Blood Angels/Space Wolf Terminators.",
            "review_score": "1"
        },
        {
            "review_text": "As precise as the tabletop game can be simulated :)",
            "review_score": "1"
        },
        {
            "review_text": "Gotta take the game as it is..... digital version of the board game. I own both the 1st and 3rd editions of the board game and I am looking forward to seeing Deathwing and then the Genestealer additions.  nice job devs.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to get incredibly frustrated over british spess mahrines (thats how they pronounce it) getting their asses kicked by little aliens? If so, you'll love this game.  It's gueniunly fun, but every now and then you will just get screwed over by the random number generator. And seeing how unforgiving this game is that can easily cause you to lose despite your flawless strategy.",
            "review_score": "1"
        },
        {
            "review_text": "You cannot have the boardgame and not have this",
            "review_score": "1"
        },
        {
            "review_text": "There are far more helpful and insightful reviews. I enjoy this game and thats all that should matter. If you like the board game or tabletop games in general try picking this one up.",
            "review_score": "1"
        },
        {
            "review_text": "Great adaptation of the board game. One of few games allowing for asynchronous multi-player which is a great feature. Was overpriced at release, but a great buy on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the lower scores given by others, this is a great turn-based combat baord game. FullControl keeps updating and perfecting the game, adding more features and fixing the small annoyances which made the game aggravating at launch. In its current iteration, Space Hulk plays true to the original board game: fun, imaginative, strategic multiplayer action. ProTip: remember to speed up the movement in options.",
            "review_score": "1"
        },
        {
            "review_text": "I'll qualify this review by noting I'm not especially a Warhammer 40k fan but I have played the old pc and board versions of this game. It seems very faithfull to the board game version of Space Hulk. It's a slow paced game but I play it when the kids are going to sleep and I have some time on the laptop the turn based nature is great for a gamer like me who has little time to get extended periods to focus on a game. I'd rate the graphics as acceptable but not exceptional and the game as a good tactical challenge. A bit more variety of locales and enemies would be fantastic and really add to the game. I've purchased the additional DLC mission content as well and think that it is a worthwhile addition to the base game.",
            "review_score": "1"
        },
        {
            "review_text": "addicting",
            "review_score": "1"
        },
        {
            "review_text": "Space Hulk is a very good turn based representation of the Games Workshop board game. The graphics are good and Full Control added animation speed up options for those too impatient to wait for their terminators to move. They have been pretty good pushing out patches for fixes and recently rolled out cross platform operation with the iPad. I personally have not had any major glitch issues with the game. The current multiplayer role is only PvP with coop supposedly on the way. The missions follow that same liner theme as the original board game with short intros. Campaigns last about 6 missions. If your idea of fun is mindlessly mashing buttons and hopping around to beat levels as fast as possible, you may want to make a different choice.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Its great to get a game in without all the set up of the boardgame and with online it makes it mass easy to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "really cool game someone should get it so i can actually play multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Not sure why this game gets so many negative reviews. Got it as a gift on 12/21/13 for Mac and have been loving it. Plays just the like the board game - but with zero setup and a much lower cost. If you enjoyed the old DOS version, or any of the Warhammer board games - buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty hard at first, and not one you will play for long marathons. However, it's a lot of fun to hop in, play a mission or two, and then go do something else, and the multiplayer is just as tense and enjoyable as the board game.",
            "review_score": "1"
        },
        {
            "review_text": "So, Space Hulk. The board game has been around forever, with a recent incarnation a couple of years ago. Haveing never played it before, I did pick up the board game, and excitedly assembled all the fantastic miniatures - and then it say on the shelf gathering dust after 1 game. Why? Because it took longer to setup the board than it did for my brother to beat me.  The computer game is pretty much exactly like board game - with one big difference: the miniatures move, they shoot and they talk. And of course, you don't need to set the board up. If you liked the board game, I recommend grabbing yourself a copy, even if it is for the sheer amusement of watching terminators shoot bolters and assault cannons. I quite enjoy the game for that reason alone.  If you've never played the board game before, prepare yourself for a board-game like experience because if you are after a fast action shoot-em up, this isn't the game for you.  However, things aren't all awesome in the Hulk of Space. There are things that could be improved that would make the game far more interesting: - Custom map building. You can create your own missions with the board game, why not the computer game? Have a community map share. - Play as 'stealers. It'd be great if after you complete the campaign, you can go back and play as the Genestealers! - Moar skins! Bring on the Space Wolves and Dark Angels. Can I be so bold to suggest Night Lords (I want to see a Reaper autocannon!)?  This aside, I find it quite fun to pass the time.  - D",
            "review_score": "1"
        },
        {
            "review_text": "As precise as the tabletop game can be simulated :)",
            "review_score": "1"
        },
        {
            "review_text": "Solid. Just like the board game. Graphics are nice and pretty - gameplay is solid ans smooth. Metacritic score seems to be... wrong. Loads of fun, though I still really like the board game!",
            "review_score": "1"
        },
        {
            "review_text": "Ahhhh, Nostalgia... Love it! Also a damn good game in it's own right!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty decent representation of the original from Games Workshop and if you play(ed) that then you will enjoy what is on offer here. It limitations come from sticking to the source game religiously. Anyone who was expecting something a little more Xcom will be disappointed (it was never was going to that given the devs funding limits, source game and so forth.)   For me at the moment its a little over priced and if you are unsure I would perhaps wait for a sale but if you are into the source game it will probably be worth a gamble. (Once the level editor is released then that will help on the value side of things).   Overall I have enjoyed the little bit I have played so far and while it does have some rough edges its still an ok if not spectacular game.",
            "review_score": "1"
        },
        {
            "review_text": "For a Warhammer 40K fan, this is something one should already own; for a non-40K fan, think twice before spending your money here.",
            "review_score": "1"
        },
        {
            "review_text": "WONDERFULL its a game that must be on your list to buy",
            "review_score": "1"
        },
        {
            "review_text": "A fun story of Revenge and Hatred, with tons of gory Genestealer death on the side.  10/10 would experience the gory deaths of hundreds of Genestealers again.",
            "review_score": "1"
        },
        {
            "review_text": "As a keen Warhammer fan, and stragety gamer- this should certainly appeal to me. However sadly it is little more than the board game (and certainly not as fun if you dont play it with friends). However, the voice acting is excelent (as with all Warhammer games) and the graphics, although not amazing do the job. Additionally it is entertaining and the campaign is extensive. In conclusion, its what is says on the (hypothetical) box. Its space hulk transfered to steam. Nothing special, but it can be laugh with friends- and certainly worth it if its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's a carbon copy of the Games Workshop board game. They advertised it as such, and made no attempt to mislead. In that respect, this is a pretty good game. The campaign and maps, and squads are exactly the same as the board game that GW re-released a few years ago. having it in a digital formatt allows me to play it with friends where I normally couldn't. Like the ones that have moved. It's D6 based, enemies spawn in the same fashion as they do in the board game... This is an exact digital copy. Yes, I've said that previously. I'm stressing that point because almost all the negative reviews seem to have missed that entirely.  This is targeted at fans of the Games Worshop line up. Not necessarily fans of the video games made under their license.   If you liked the board game, you'll like this. If you like turn based strategy, you may also like this. If your a fan of the Warhammer 40k table top game, you may find this amusing as well.  You prolly wont enjoy this if... You like fast paced, twitch reflex games. Are only getting it because it has the GW logo. Getting it because your only experience with Warhammer 40k is the video games(that isn't a bash). This is not a 40k video game like Dawn of War, or Space Marine. This is closer to Blood Bowl, which is also a digital remake of a GW board game.  7.5/10 as a turnbased, squad strategy. 10/10 if you're a fan of the board game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the boardgame and is as unforgiving as random dice rolls can be. Expect your Terminators to miss Genestealers that are one or two tiles away because of their endless ducking, but then watch as they kill four in a row down the other end of a corridor on Overwatch. Fun game though.  10/10 would use a review cliche again.",
            "review_score": "1"
        },
        {
            "review_text": "Strategy in all 40K Glory, THer way its supose yo",
            "review_score": "1"
        },
        {
            "review_text": "A true PC version of the TTG, complete with dice rolls.  +Lots of maps, even more if you get the DLC. Your troops are somewhat disposable (they will be back for the next mission) making those heroic charges / sacrifices more tolerable.  -No character progression. I would like more difficulty levels (some levels are easy when set to 'hard' difficulty). The AI isn't terribly clever. You can't change your squad composition or terminator loadout.  I think it's fun. It runs well, no bugs or crashes. It is slow TBS goodness like the TTG.",
            "review_score": "1"
        },
        {
            "review_text": "Short review: If you're really into Space Hulk/ Warhammer 40k, or have a friend you really want to play this with, you might as well get it no matter what. If not, imagine a tower defense, where your towers can move, but miss all the time and might blow up due to sheer bad luck and gameplay is generally slow. Still sounds fun to you? Well, if you're enough of a masochist, enjoy, otherwise, better keep away.  The experience of the game: If you play any Warhammer as a tabletop game, with a friend, or fellow players in one room, every move, every single dice roll can build up sweet tension, your strategy vs. your opponents, your luck vs. theirs and every time one of you makes an awesome move or seems to beat the odds, it can be hillarious. The game might translate the mechanics perfectly, but no matter what, it can not translate this feeling and at least for me, this is doing a lot and seems to turn the whole game into an ok puzzle at best and a boring random number generator at worst.  Sometimes there might be a positive feel to it, if you pull of a good move, strengthening your position, or barely getting out of a tight situation. But, most of the time there is no feeling of achievement, when just another one of the hundreds of generic enemies you encounter dies, nor if you complete a level, really. On the other hand it can be rather frustrating, if the randomness turns against you big time, like a single enemy running down a hallway, all overwatch shots missing, the bolter jamming 4 times in a row and then your unit is dead and the whole mission might fall appart. Bad luck, rinse and repeat?! Meh.  In addition to that, both visuals and sounds are just bad. Again, if it's tabletop, your imagination might fill in cool effects and so far, no graphics engine can beat good imagination. But, if a program shows you, how your unit is shooting the wall, while an enemy in the hallway next to it falls in a weird splash of red, that might be funny the first time, but in the end is just, well, really bad. It's pretty much the same with moving animations, first time it might look funny when your terminator is awkwardly wiggling backwars around a corner, but at some point it's just awkward. Also, it's good that you can crank up the animation speed, otherwise i might've died of boredom just watching unit movement.  So i prefer... playing anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a W40K fan, having four armies. Space Marines, Tau, two Imperial Guard factions (Armageddon Steel Legion and the Death Korps of Krieg) and even more of the faction books. I came into this game wanting to love it. Unfortunately it turned out to be a frustrating mess in which it felt like I won more through luck than strategy, which meant even when I won it didn't feel like an accomplishment, and whenever I lost it was usually due to the game's randomness not playing in my favor.  When I go to play a strategy game, I expect a reasonable challenge in which I win through craft, out-thinking my opponent, and as one might expect, through strategy and skill. This game is too simple to the point that once you've got the basics you know what you should do for every scenario, and even when you do just that, there's a good chance you'll lose anyway just because the computer decided that you'll miss 8 shots in a row, and decided arbitrarily to throw 8 'nids at you en masse.  Now I'm not the end-all, beat-all game critic here, but I came into this game wanting to love it, and left sorely disappointed. This is a very sad day for the Imperium indeed.",
            "review_score": "-1"
        },
        {
            "review_text": "Slow, plodding, methodical, and boring game. I assume it is faithful to the board game, but the game clearly shows its age. X-Com (any of them) is far superior to this.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy piece of sheet. v1.5 and ther are still crashes, items that sometimes give no bonuses (like shield) even though they should, Absolutely awful interface with unexplainable and annoying lags and delays. RNG that simply loves generating double (1+2)s or (2+2). Unattainable achievements. It is barely playable. Programmers who wrote this sham should commit harakiri.",
            "review_score": "-1"
        },
        {
            "review_text": "Do yourself a favour and buy XCOM Enemy Unknown. Far far better than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Serously flawed game. Space Marines use weapons that fail often causing you to fail often. No reasonable military would go into battle with a weapon that jams almost 50% of the time. Other 'power' weapons can also fail 50% of the time. You might as well flip a coin to see if you might enjoy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "An exact transcription of the board game. The visual atmosphere is excelent and the graphics aren't spectacular but does the job. Saddly, the mechanics wich works very well in the tabletop game isn't great as it sounds in this virtual version. The randomness of dice roll should increase the tension but the result is only frustration. The actions and options available in the tabletop when transcribed in this games feels like are low diversity of what to do besides shooting and overwatch.",
            "review_score": "-1"
        },
        {
            "review_text": "It's essentially the board game, having the same flaws and plusses of the first. Adaptation could have used some work. Slow pacing. Probably suffers from GW being a poor company more than anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Bleh... I'm a 40k fan but this game is clunky, has a poor tutorial and has zero music.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not so good, sadly. I really love the W40k Universe and this game is quite ok on the art-design side. However there is not much of a game to it. You mainly position your troops and wait and watch them kill stuff. Furthermore the outcome of a combat action is very much dependent on luck. The last thing I want to say is that this game seems to be carelessly programmed in a way that if you issue a move command the game does not calculate the needed number of action points correctly. So you are usually better of walking step by step. It will save you a few AP.  If you are no fan of Warhammer Games, this is no fun at all for you. If you are, well, I guess you'll have one hour of fun, but I recommend playing Space Hulk the Board Game with a friend.",
            "review_score": "-1"
        },
        {
            "review_text": "The puzzle aspect of this game is mildly interesting. The bland animations don't add much flavor. The controls are simple, but I often find myself accidentally moving the wrong guy and, you'll find, that you wish there was an 'undo' button. What this game could use is a little more story element. The Terminators all have names, I don't see why they don't display a little more personality. This is a game where you might play a mission or two but will be too burned out to click 'accept mission' a third time.",
            "review_score": "-1"
        },
        {
            "review_text": "Repetitive, dry, lackluster gameplay coupled with a completely forgettable story (which is hard to do in w40k).  The bullets seem to carry little weight.  One of the largest mechanics in the game is a dice roll, which is what your life or death ultimately depends on, causing all real potential for strategy to fly out the window.  I could get about the same enjoyment and excitement out of playing tenzi (a game where you roll ten dice until you get them all to match), in the end, that's pretty much what this game is. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "There is so much that this game has going for it. Great production values, character design, sound design, voice acting, graphics. And I love the 40K universe, and have very fond memories of playing the Space Hulk board game when I was younger.  But try as I might, I simply could not get much enjoyment out of this game. I don't know if the computer is just much better at playing the Genestealers than we humans were when I played the tabletop version, but this game is punishingly difficult. I tried lowering the difficulty to easy - but I was still unable to defeat the Cleanse mission - or even really come that close - after numerous tries.  So while I was hoping for a modern take on a nostalgic favorite, it just ended up being a frustrating lesson in humility. I hope others have a better time, and don't get stuck on the difficulty like I did, but as it is I can't recommend the game based on my own experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Great idea, but the game becomes repetitive very quickly.",
            "review_score": "-1"
        },
        {
            "review_text": "kinda dumb. It ends up being a puzzle game with dice rolls",
            "review_score": "-1"
        },
        {
            "review_text": "Felt like it was impossible. Overpriced as well.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this would be cool based on a lineage of strong strategy background. Sadly, pretty boring and nothing new going on here... you'll dig it if you like the IRL version of this game maybe........ But theyre bringing this into the electronic games market here... and as far as contemporary squad based strategy games. Don't waste your money on this... get X-Com.",
            "review_score": "-1"
        },
        {
            "review_text": "I simply cannot recommend this game, and actively discourage anyone that is not a diehard fan of Warhammer 40k from buying it. It's just not worth the thirty dollar price tag.  Clunky animations, stale environments, and hours of fighting the exact same enemy are all that await you.  I must repeat, given the steep price tag for an indie game, make sure you do your research before purchasing this one",
            "review_score": "-1"
        },
        {
            "review_text": "Do not pay full price for this game. For two reasons;  1) It regularly goes on sale for $2 on humblebundle  3) A new version came out and you can not upgrade to it. It is almost the same game but better visuals, for the same regular price.",
            "review_score": "-1"
        },
        {
            "review_text": "Gets Boring and Repetetive way too soon, and lacks the Warhammer 40K atmosphere :(",
            "review_score": "-1"
        },
        {
            "review_text": "Without being able to custermize your marines or upgrade them this game feel like a very empty and simple game.",
            "review_score": "-1"
        },
        {
            "review_text": "Dammm... This game is Ugly and Boring. Pure Waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "As others have implied in their reviews, this is really a 'hmmm maybe if it's on sale' title. Even then it's unpleasant to find that there's very little gameplay to be had before you're asked to shell out for more content. Not cool. The game itself I like - it's faithful to the board game and I'm forgiving of some of the little animation glitches and rawness here and there because of this - but they should have put a whole lot more into it before shoving in the paid-for content. Definitely wouldn't pay full price for this - if you don't already own it then Xcom Enemy Unknown would be a much better investment.",
            "review_score": "-1"
        },
        {
            "review_text": "-I never played the Space-Hulk TT nor 40k in General (bite me :P )  Is this game entertaining for such a user? absolutely not.  1 Hit deaths due to their rending claws and dependency of overwatch to get anywhere... well, i just can't get any kick outta it.   Hit it during a sale, so a ~ 2 € won't be too harsh to waste. Even better, check Ascension. I will, at the next sale.",
            "review_score": "-1"
        },
        {
            "review_text": "i love turn based strategy games and have very fond memories of space crusade on the amiga but this one is so very dull to play, ,its a turned based game without the tactics  single tile corridors make your options very limited  and your main gun seems to jam 30-40% of the time which is so unrealistic  what military would use such a poor weapon?",
            "review_score": "-1"
        },
        {
            "review_text": "Very Simple game, basic animations and not very engaging.",
            "review_score": "-1"
        },
        {
            "review_text": "Most of your time will be spent watching animations slowly turn around.",
            "review_score": "-1"
        },
        {
            "review_text": "On the one hand, it's Space Hulk!  However, it also has a sluggish interface, dull sound design, very crude animations, poor camera controls and visually cluttered environments that make it easy to miss a door or hatch.",
            "review_score": "-1"
        },
        {
            "review_text": "I was a bit disapointed by this entry, seeing it's one of the Warhammer 40k series I though it would just as enjoyable as ''Space marines'', ''Dawn of war 1-2'' and some of the older entries...  I was really hyped when I heard about this game thinking it would be as fun, full of gore and well.. all the dreams to a fellow space marine fan. I played through the first part of the campain with the genestealers... not all that fun really...  Maybe I just need to spend more time with this baby... but for now I don't really recommend this game, but if you want to give it a go then by all means ''JUST DO IT!'' '' DONT LET DREAMS BE DREAMS!!!!!''",
            "review_score": "-1"
        },
        {
            "review_text": "If you've ever felt like rolling 0's and instadying in the tabletop original is a bliss, you will surely like missing point blank shots in this game analogue having second to none power over its RNG rolls or instadying from a counter attack during your own turn. Feels soooooooooooooooooooooooooooooooooooooooo god.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like XCOM, except bad. Very very bad. I would use the s-word here, but Valve won't let me. Don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried game because it was on sale, now requesting a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Its like the board game, only not as good.",
            "review_score": "-1"
        },
        {
            "review_text": "Why do developer insist on making game so hard to play that they are not worth playing for the casual gamer.  Thanks to too many developers like this, I am now no longer interested in wasting money on buying games and will try the demo or pirate them first to see if they are actually playable first!  Absolutely no point in playing games that let the enemy have several attacks to your one!  No point in telling the player to do something, whit out telling them how to do it (break a door, yeah, sure, HOW)!",
            "review_score": "-1"
        },
        {
            "review_text": "The board game had problems, and so does this game.  Being a 40K fan of the actual full fledged minis game, I'd say if you're a 40k fanatic you'll probally enjoy it. If you enjoy being eaten by Tyrinads you'll have a good time.  For me though there are turn based games far superior too this one out there. I also got this game gifted to me I doubt I would have ever purchased it. As my experince with the real board game was a dismal experience which required house rule changes.  I will admit I love eating my friends in the vs mode.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels like a cheap free iphone game.",
            "review_score": "-1"
        },
        {
            "review_text": "Well the game needed a little something more than what they gave it. Space Hulk is a great premise but the games execution leaves something to be desired.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe it's just me, but we've come a long way in a very short amount of time when it comes to video game technology. It seems that a game as simple as Space Hulk could very, VERY easily do with some fine turning and general polish. The gameplay itself gets repetitive pretty fast, and I don't really have the sense of impending doom that I had playing the physical version this is based upon. I hoped it would be Space Hulk like I loved and rememberd. The agony and pain are there, but for all the wrong reasons.",
            "review_score": "-1"
        },
        {
            "review_text": "What an incredible disappointment. I was expecting something comparable to Warhamer 40k: Chaos Gate and what I got instead was a dumbed down, awkward, luck based, mess of a short game. The 'campaign' kicks you back to the menu between chapters, movement is clunky, cancelling actions is not intuitive, the second mission is entirely luck based, and the amount of content is pathetic given the extremely limited gameplay mechanics/AI that have been implemented. I don't understand how anyone could recommend this steaming pile.",
            "review_score": "-1"
        }
    ]
}