{
    "app_id": 242680,
    "name": "Nuclear Throne",
    "release_date": "2015-12-05",
    "developer": [
        "Vlambeer"
    ],
    "publisher": [
        "Vlambeer"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Rogue-like",
        "Indie",
        "Action"
    ],
    "achievements": 44,
    "positive_ratings": 9694,
    "negative_ratings": 405,
    "price": 9.29,
    "description": "Nuclear Throne is a post-apocalyptic roguelike-like top-down shooter. Not 'the final hope of humanity' post-apocalyptic, but 'humanity is extinct and mutants and monsters now roam the world' post-apocalyptic. Fight your way through the wastelands with powerful weaponry, collecting radiation to mutate some new limbs and abilities.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/242680/header.jpg?t=1449523044",
    "minimum_requirements": "OS: Windows XP Processor: 1.2Ghz+ Memory: 1024 MB RAM Graphics: 256MB Storage: 200 MB available space Additional Notes: This game is locked to 30 frames per second.",
    "recommended_requirements": "OS: Windows XP Processor: 2Ghz Memory: 2048 MB RAM Graphics: 1GB Storage: 500 MB available space Additional Notes: This game is locked to 30 frames per second.",
    "reviews": [
        {
            "review_text": "I bought this game when it was in its early access period(For 13 dollars multiplied by 4. Yes, my currency sucks) and I recently exprienced most of the content, meaning I can finally review it.   Nuclear Throne is a hard(and I mean HARD. at about 9 hours you'll be just getting used to the third area) roguelite top down shooter with a huge variety of weapons(above 140 I believe), a roster of 12(and a few secret) characters, 7 main areas(split into levels) with secret equivelants of most of them, and full of content.  Every session is quite short, and there is no end unless you choose to end the run.   Every enemy drops EXP upon death(rads), and when you level up you can choose 1 mutation(modifiers) out of a selection of 4 every time for 9 levels, and get a special choice on level 10. Mutations vary from trivial things such as faster move speed to kills reducing reload time.   The devs are extremley helpful and active on the forums(at least during the early acces period and until they finish updating the released product) and the community is the last one to be called a toxic community.    The game's lore was told partly through little references in-game, lore bits and pieces from twitch streams of the dev and more, and is worth a read on the wiki(Also run by a great guy). Nobody knows all of it(except for the developers), but what we do know is pretty damn good.   After defeating the first final boss, if you do a thing the community will eventually notify you about(or wiki), you will loop. Looping is going through the entire game all over again and will never end until you die/get either of the 2 endings. It includes new exclusive content and so much more. The loops are late game, and since they can last forever, the game has to become even more brutal with each loop, and on loop 1 already, without spoiling, you will notice a difficulty spike.     Pros   -Full of areas to explore, enemies to shoot and die to, weapons, synergies and more. -Will keep you playing for a good amount of time, but still is fit for short sessions if you're just passing time -Amazing and helpful community -Fantastic soundtrack(Personal favorites are Frozen City's B-Track(Ode on the official soundtrack) , and The Nuclear Throne) -Great pixel art that is just beautiful to look at.     Cons   -It takes a while for RNGesus to make some good weapons become common in the pool after the first time they drop -Sometimes the game would do flat out unfair actions, such a certain telefragging enemy -Inconsistent difficulty curve. Its smooth until the third boss, spikes, stays that way, lowers down a bit in the 7th area's boss and on loops spikes up again and goes through the same curve -Sometimes you just get screwed(even on spawn). RNGesus may not have mercy. -Some secrets that without a wiki/datamining no one would have found.  TLDR: NT is a great game to sink hours into, as well as to play in short sessions, is hard, but rewarding and fun, as well as full of content to exprience. ",
            "review_score": "1"
        },
        {
            "review_text": " FRIENDLY REMINDER  &nbsp; something you must be aware of before buying   Nuclear Throne can be quite a stressful game that can lead you to have several rage moments so, if you can't really deal with this, I must say that this game is  NOT  for you and you should stay away from it. It's a very punishing game and small mistakes can lead you to death.   ABOUT  &nbsp; what is this game all about?   Nuclear Throne is an action shoot em' up roguelike game made by Vlambeer, where your objective is to reach the Nuclear Throne, your main enemy in the game.   STORY  &nbsp; does this game even have a story?   Some people might not know this, but this game actually has a background story. But, since this is not the main 'star of the show', it's okay for the game to have a lack of detailed storyline.    Humanity messed up with things and the world is nearly destroyed, although things still managed to live in such conditions. Along with creatures being mutated (and a human as well, this being Steroids), portals started to appear and those started teleporting mutants around the wasteland.  A mutant called 'Proto Mutant' discovered a place called The Palace, a place that is set to keep the world's balance, to keep it stable and we all know that's not the current case. Whenever a mutant stands up and gains strength enough to be able to do something against this mess that the world is, it gets sucked into a portal and disappear.  Other mutants heard about this myth and about the Nuclear Throne as well, which if destroyed, the world will get stabilized again, thus the game begins... .   There are some more details, but it could be considered a spoiler at some point. If you're interested in knowing more about it, you could simply check the game's Wikia and find out yourself.    GAMEPLAY  &nbsp; what do I do in this game?   Nuclear Throne is a game with a big focus on gameplay and it would be a shame if it weren't good, right? This game has playstyle similar to the well-known Binding of Isaac, but way faster. The controls are easy to understand and are really responsive. At first, it will be a little bit boring because of the lack of things happening, but as you progress through levels, things get better and way faster! Fun and challenging.  In a nutshell: You shoot things. Things die. Get weapon upgrades and new mutations to power yourself up. Progress to the next area. Repeat until you reach the Nuclear Throne.  The sad thing about this game is that it lacks an online Multiplayer, only a local Multiplayer option, which is not that bad, but since this game requires a lot of precision and quick responses, using a gamepad to play with someone else is a pain in the ♥♥♥, unless you manage to use two keyboards and two mices.   SOUNDTRACK &amp; SOUNDS  &nbsp; how's the music and sound effects?   Vlambeer did an awesome job with the soundtrack the same way they did with  GUN GODZ  and their other games, the musics and songs fit really well. Boss battles, areas and everything else. And the mutants' voices and sound effects, like weapons and such are really well made as well.   GRAPHICS  &nbsp; wow, next gen. graphics plz!1!   You can probably tell that this game has pixelated graphics and, if you're a fan of super detailed and realistic graphics, this is not for you. The sprites in the game are well-made, the scenarios are great and suit each enemey very well. Also, their promotional art is awesome!   DIFFICULTY  &nbsp; how difficult is this anyway?   Okay, so, if there's a negative review out there, it probably is because of the difficulty and learning curve on this game. This is a really punishing game and little mistakes will make you get to the start of the game within a second, you must be cautious and think fast. As mentioned above, if you're a person that gets mad really fast or dislike games that are really difficult, you should probably avoid this.   REPLAY VALUE  &nbsp; how many hours can I put in this?   It's a 'short' game and you are going to die  A LOT , I assure you, if this game didn't have a great replay value, it would be absolute sh*t. If you enjoyed your first runs, you're probably going to enjoy the rest of it, since you're always progressing through the game, learning new things, trying out other mutants and mutations, yada, yada.   PERSONAL OPINION  &nbsp; what do you thinka 'bout the game after all?   More like a TL;DR, I guess. It's an awesome game with fast gameplay, charming graphics, responsive controls and incredible replay value, I highly recommend it if you're a big fan of the genre, and, since it finally released, there's no need for you to be hesitant about the early access part. Vlambeer will probably keep updating the game, so, there's much more content to come and much more to enjoy. Also, if you know and enjoyed the abovementioned Binding of Isaac and want to 'spice things up' and have a more 'breathtaking' experience, give this game a shot.  There are also some other aspects of this game that might be a turnoff to some people, such as: no widescreen option and 30 fps cap. Just wanted to point it out, since some dislike this.",
            "review_score": "1"
        },
        {
            "review_text": "It's one of those games. You can play it during coffee breaks, during work, during your life, before your death.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. It's brutal as all heck, but the feeling of success is second to none.   This game flawlessly blends bullet hell games and rougelikes, and the musical score is supurb.    10/10 would recomend. Pro tip: Crystal can handle it.",
            "review_score": "1"
        },
        {
            "review_text": "this is probably one of the best games to sit down, turn on music, and play for hours",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth every penny. Punishing and cruel, yet you come back for more. There are varying degrees of difficulty for those who want a huge challenge, as well as those who want to devote every waking minute to this game. There is NO easy difficulty. Consume at your own risk.",
            "review_score": "1"
        },
        {
            "review_text": "Gun smoke in the air, Friend weeping in pain, Blood pools everywhere, It's pouring Acid Rain  Our homes destroyed Wishing this to end Hey, someone's coming here! I hope it's a friend...  It's not fair! It's not right! There's no reason to fight! But still, that is our daily life  Guns loaded, blind hatred,  no eyes that are kind, No sleep at night  Kings and queens  Of wasteland we were Already forgotten the reasons to fight  From the day we were born It was bloodshed forever We've seen enough comrades Go dead in the night  Distant call for help Only thing I can hear FLAASHYN What did they just say?  Only beam of light In our lives are occasional mutated fish I'm not even sure if it's okay to eat Still it feels like we were granted a wish  It's not fair! It's not right! There's no reason to fight! But still, that is our daily life  Guns loaded, blind hatred,  no eyes that are kind, No sleep at night  Kings and queens  Of wasteland we were Already forgotten the reasons to fight  From the day we were born It was bloodshed forever We've seen enough comrades Go dead in the night  And kings and queens of wasteland we still are! After so many fights, the crown calling blood Today is the day we all call ourselves free And we throw all our weapons into the sludge",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is a fun and frantic top-down shooter rogue-lite in which you must defeat the Nuclear Throne with any of its interesting characters and multitude of weapons however it's rife with game ending problems at the moment.   Pros",
            "review_score": "-1"
        },
        {
            "review_text": "You will spend hours fighting the following: Bandits Scorpians Crow things Purple assassins with pipes Cars A tall bandit Some frogs Rats Crocs Ball guy The ninja turtles Cerberus with guns Robospiders Robodogs Roboyetis Jango Fett Some crystals that shoot lasers Gremlins Crystal people Necromancers Slimer The cops  Just to fight a giant chair and do it again",
            "review_score": "1"
        },
        {
            "review_text": "I thought I didn't like roguelikes. I thought I despised twin-stick shooters. I thought I hated bullet hells.  ...but a combination of those is just excellent.",
            "review_score": "1"
        },
        {
            "review_text": "I suck hardcore at this game but I'm going to review it anyway (again). Basically it's a rouge-ish bullet hell game about a group of mutants who are on a journey to claim the nuclear throne, one of the most soul beating, ♥♥♥♥ kicking, rage inducing bosses ever (And it's not even really the final boss). You have a selection of 12 characters to play with, each with their strengths and weaknesses. It also includes a leveling up system with each level allowing you to choose from four powers, know as mutations. There are a multitude of stages with increasingly difficult enemies (But very few border the line of unfair). After a few levels a boss will spawn randomly from a wall or in the middle of the screen. These bosses range from: 'Pfft that was a boss?' to 'Ah ♥♥♥♥ I'm screwed, oh ♥♥♥♥ here he comes.' I'd say it is very skill based and unforgiving, so if you are into that kind of thing in a game this will be right up your alley. I still have yet to master it but I still find the fun in it even if I suck. Also the devs seem interested in just making games and constantly updated the game till its full release, and there will most likely be content later. There are a couple of drawbacks however. Due to the games random nature, you can get a reaaaaaaally bad spawn where the boss spawns two feet from you or where you have minimum protection against a huge wave of fish (no joke).    TL;DR Pros: A good selection of characters Good devs Fun yet not boringly easy Lots of secrets Nice art and sound tracks A looping system LOCAL Co-op  Cons:  A couple of unfair bosses/enemies RNG spawns can make you want to tear your arms off and slam your face on your keyboard Losing a great run can give you a heart attack Unsure post-EA future (Maybe) Flame Traps  Rating: 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best roguelikes. Hands down.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, clever, and immersive. Characters are all interesting and different, and while the controls are simple, it takes a while to get really GOOD at the game.",
            "review_score": "1"
        },
        {
            "review_text": "fun if you want to kill yourself",
            "review_score": "1"
        },
        {
            "review_text": "It's a game about clicking on dudes. When you click on all of the dudes, you get to go to a place with more dudes to click on. Sometimes the game gives you stuff that lets you click on dudes even better. PLOT TWIST: There are dudes that will want to click on you. When you get clicked on by a dude, the game is over. One of these dudes is named Lil' ♥♥♥♥ing Hunter. He's the fastest clicker dude in town.  Game's easy 11/10 Would not recommend to filthy casuals  Lil' Hunter is best Pokemon Big Dog is a chump You can melee kill Big Bandit in one hit The Throne definitely exists You will never see Throne Butt again unless you're Fish You always see Throne Butt as Fish Yung Venuz is the fastest clicker in the video game Crystal is a pansy Just let Melting sleep Plant is hungry Rebel is Big Bandit's sister Chicken likes kung fu movies Steroids can lift anything Horror is ashamed of himself Eyes can't eat because he doesn't have a mouth Rogue is at large",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell with a nice amount of variety, but can take a while to get the hang of it all. Keyboard and mouse are certainly the best way to play, but I like using a controller for whatever reason.",
            "review_score": "1"
        },
        {
            "review_text": "I give this game my highest of recommendations, it's hard to regret a $12 purchase that nets you so many cool mutants to die with.  Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "So i'm editing this review because i've changed my mind about a few things.  First off i do love this game but there's serious problems with this game. First few things:  * The preformance : The game has gotten a few really weird bugs that can be annoying for your experience, but most of the time the game runs good. In later levels and loops the freezeframes and the game will slow down because all of the stuff on screen. * Balancing : As for now the balance for characters and weapons are pretty good but what does have to be toned down is melee and or enemies who spam alot of bullets in the later games it will become a huge problem and it gets very hard to get trough it without melee.",
            "review_score": "1"
        },
        {
            "review_text": "cool game but disclaimer: its not real",
            "review_score": "1"
        },
        {
            "review_text": "Hands down. GOTY.",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10! Very fun game, I really love it. The only thing that is annoying is the rage factor, and this is not constant. DEFINITLY worth the money. 9.9/10 (because 10/10 seems suspicious)",
            "review_score": "1"
        },
        {
            "review_text": "The first zone looks more like the Fallout series than Fallout 4 does. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Part Rogue-like, Part RPG, part bullet-hell -- this game has a lot of charm and is quite addictive. Deceptively complex when you get down to the business of different levels and enemies and all the perks and weapon combinations you might use to prevail. I tried my darndest, but I could never win -- I'd gotten far, and I consider it a point of honor to win Rogue-likes that I love... but maybe someday I'll come back and try to beat it. In the meantime I had fun playing with multiple characters that actually play differently, and some great fun winning levels in crushing victory or by the skin of my teeth. Nuclear Throne, you have earned a place in my heart... a game that beat me, but I loved you anyway. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "If you bought the game because wanted to see the Nuclear Throne on your first run, well, I have some bad news for you...",
            "review_score": "1"
        },
        {
            "review_text": "shoot the men, the men shoot you  spc simulator/10 would buy agen",
            "review_score": "1"
        },
        {
            "review_text": "This game is really really fun but it is also pretty hard xD so if you like a good rogue like game and are good at them then this is your type of game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, definitely worth the 11,99€",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played 10/10, I only wish that you could make mods for the current version of it.",
            "review_score": "1"
        },
        {
            "review_text": "Simple pick-up-and-die gameplay. Repeat ad nauseam, and then some! Still, I'm only scratching the surface that hides more complex mechanics and plot after 120+ hours.  Nuclear Throne is a hell of a drug.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  -Everything  Cons: -Little Hunter  0/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "Bullet hell + Rogue-like = Nuclear Throne. A game that imho has been held off by the dev's decision of making it Early Acces, but that nonetheless has pushed through the hardship and become 'that-one-other-roguelike' that knew how to push forward the genre mixing it with bullet hell and 'semi' twin-stick shooters characteristics. Innovating with PC (player character) selection with it's own secondary abilities each, and interesting mechanics as for example the somewhat of a 'survival-shooter' one, where u have to struggle (sometimes) to get ammo, this game has known how to find his comfy niche into the rogue-like genre.  TL;DR :  Buy it  Try it now !!",
            "review_score": "1"
        },
        {
            "review_text": "Oh yeah review time!  Nuclear Throne is a Beautiful game about mutants trying to reach the nuclear throne and beyond. I play nuclear throne ALOT recently and i absolutetly adore this game BUT beware this game is Hardcore and unforgiving with permadeath being your best enemy give it a shot (literally) its fantastic  PS: Beware of 'Little Hunter'",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this one. Fast and ruthless 2D shooting action, through various post apocalyptic themed levels. Choose your mutant, carefully pick your two most favored weapons from a huge assortment of available ones, and it's kill or be killed. There is also some strategy involved, in the form of picking mutations for your character, as there won't be many chances to do that. Also, great soundtrack, very close to the game's atmosphere.  Thumbs up, all the way! (..oh, and watch for exploding cars!)",
            "review_score": "1"
        },
        {
            "review_text": "Usurp the Radioactive Royalty and claim the contaminated crown",
            "review_score": "1"
        },
        {
            "review_text": "36 HOURS!?  I don't know if that feels like too many, when you think about how fast and short some of your runs can be, or if it's too few, when I've been playing this game fairly constantly during its development.  I keep coming back to this game because it's very, very good.  Vlambeer are an entuhsiastic and dedicated developer who have injected personality and juicy 'game feel' into everything they've done. Now this is properly 'out' I'm looking forward to the next one!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing soundtrack, infinite replayability, challenging, charming and cheap. There's very little reason to not buy this if you're a fan of top-down shooters, it's the best of its class",
            "review_score": "1"
        },
        {
            "review_text": "420/10 BEST GEM, WOULD DIE A 911TH TIME",
            "review_score": "1"
        },
        {
            "review_text": "I've played it for a a couple minutes and its ok.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 can play as floating illuminati blasting airhorns while listening to rap music In all seriousness, Buy this game.  fish can roll  i blew myself up on a catus in world 1-1  i hate this game so much  but i love it at the same time",
            "review_score": "1"
        },
        {
            "review_text": "it's like the binding of isaac but with rats",
            "review_score": "1"
        },
        {
            "review_text": "The cycle of the Nuclear Throne:  &gt;Start a round &gt;♥♥♥♥ start, barely any rads &gt;Loose most of your health &gt;1-2, finally enough rads to get a mutation &gt;♥♥♥♥ choices for your character &gt;Big bandit wrecks you &gt;Stay determined &gt;ONE MORE ROUND &gt;Awesome start, lots of rads &gt;All the right mutations &gt;Kick Big Bandit's ♥♥♥ &gt;Make it all the way to 5-3 &gt;So happy &gt;♥♥♥♥ING LIL' HUNTER &gt;dies &gt;rage quit &gt;You contemplate punching your computer monitor &gt;Throw your headset instead &gt;Ductape headset together &gt;Load up Nuclear Throne &gt;Begin at line one",
            "review_score": "1"
        },
        {
            "review_text": "two words..  Lil Hunter",
            "review_score": "1"
        },
        {
            "review_text": "yes Yes YES!!! I love this game so much!!! This game is a rouge like bullet hell top prospective game... This game is also really hard (not darksouls hard) But when you start to play the game it gets much easier.",
            "review_score": "1"
        },
        {
            "review_text": "Fish can roll",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, there are a lot of characters and each level is randomly generated so it's always something new, there is a lot of different Mutations and all of them are unique and help you out with different stuff, different builds you can try, there is also a lot of different weapons that you can try out.   overall, a very good game with a lot of replay value, you can even play with your friends in a Multiplayer mod!",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear throne one of must fav games I have bought it's fast paced and just over all enjoyable but also is a good challenge",
            "review_score": "1"
        },
        {
            "review_text": "Be prepared to read the words 'You did not reach the nuclear throne' a lot. Be prepared to accidently kill yourself when your disk gun shot richocets off a wall and back at you. Be prepared for an adrenaline rush every time you face Lil' Hunter.  In this game, you will die a lot. It's bullet hell and you have 8 measly hit points. Seems like it's not a problem right? Well, most shots in the game will take down half that and more. There's no invincibility frames after getting hit, some enemies shoot powerful enough weapons that they will kill you in one shot.  And yet you keep playing.  There's a beautiful feel to the game. The gunfire sounds are audibly pleasing, Every hit on an enemy is satisfying. As you progress further, the game only gets more fun. After looping, you begin to feel unstoppable, but eventually you get claimed and the struggle continues. You always die in this game, but you die a little less frequently as you progress.  Do yourself a favor and pick this gem up. You won't regret it.  One small note, the developers have stopped working on the game, so if you see any bugs, it's unlikely you'll get a fix for it for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "With the large amount of fast-paced, not to mention rouge-like games out on the interwebs, this game stands out as a gem. It is updated almost every week (went to a convention for most of the week, came back with PAX pox or something similiar and still managed to release and update). The dev team is devoted to making the game fun. This is superbly shown by the version of the game made for Ster_, plus the massive amount of content. And although I have not reached most of what the game has to offer because I am terrible at the game I know it is there and can not wait to get there. TL;DR This game stands as a light in the murky sea of Rouge-Likes.",
            "review_score": "1"
        },
        {
            "review_text": "this game is insanely good. 100% recommended for those who like fast-paced, difficult roguelike games, not really recommended for those who get frustrated too easily because if you're one of those types, this game will absolutely  break  you  also i think the best part about this game is the fact that it runs smoothly even on my garbage PC that can't properly run 93% of the contents of my steam library. the only slowdown moments i ever experience are when you're in a portal, which adds about 1 to 3 seconds to the already nearly nonexistent loading times (aka nothing)  the second best part about this game is that you get to play as a one eyed space dorito with a money + gun fetish",
            "review_score": "1"
        },
        {
            "review_text": "beutiful graphics 10/10 i swer   brings new meaning to bullet hell  challenges that make me want to 100% the whole thing  new to the game? you will die... alot...",
            "review_score": "1"
        },
        {
            "review_text": "The goal is to reach the end right? If that's what you've finally done, and you're proud of yourself, then you have failed. Reaching the 'end' is not the goal. You literally just go as far as you can until you die! And if you're lucky, you might even discover a lil' bit of a secret...   I highly recommend this game. It's one of, if not  the , best rougelikes I've ever played! It's an achievement for Vlambeer, it really is.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a fan of Rogue-like games (Binding of Isaac, Rogue Legacy) and so far I'm hooked on this game. It's a lot of fun Reminds me a little of Hotline Miami",
            "review_score": "1"
        },
        {
            "review_text": "Action-packed, rapid-fire, refined and extremely competent top-down shooter. Punishingly difficult, but lacking in the usual ♥♥♥♥♥♥♥t that causes controllers to be thrown across the room. Quick to pick up and try to run through, but addicting enough that you're pretty sure to get your money's worth as you try to get further and further.  Previews and trailers are rather accurate to the gameplay itself, check those out if you're still not sure.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game! Cheap price, no plot, (&lt; Thats actually positive in my opinion) and is a very well layed out game. Will never get bored of playing this game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, when you look at all of the art and badges and cards it looks really weird, but the game itself is not only challenging and unique, but if you decide to ever delve into the pit which is the backstory and come up with your own theories, this becomes the best game in existence. I am trash at this game, it's rare I get past frozen city, and of writing this I have 45 hours in Nuclear Throne and I have only GOTTEN TO the final boss once, where I died, brutally. Nuclear Throne is a top-down randomly generated bullet-heaven, whenever you kill an enemy, your soul iscrushed if you don't snatch up their radiotion before it fades into oblivion, this makes the game very anti camping and even though you can get rocket launchers and crossbows, you never feel overpowered, miniguns will drain your ammo, and super bazookas are just as likely to kill your enemy as you. I love this game, I love vlambeer. and I wish I could draw so I could show my support even more. press B for Y.V luv",
            "review_score": "1"
        },
        {
            "review_text": "I gave this game a negative review but now I recommend it because I've gotten all of the acvhievements ♥♥♥ u lmao gettouta 'ere.                                          Oh, uhm, expecting a serious review? Well, I wanted to leave this as a sh!tpost review, but it's just not in my nature. I'll still leave the first part so people can dislike without realising I wrote an actual review lol   SOOOooo... this game? What is this game? Well this game is an 'unfair' shoot 'em up with incredibly harsh rules. And I mean it, I don't over-exagerate here. No really, the game's hard. You got it? Do you still have casual blood? Nooo? Then let's continue.    The premise is simple: reach The Nuclear Throne. How wonderfully unsimple that sounds. And to reach the throne, you have to guide your little addorable mutant over from the campfire through a boundless onslaught carnage that awaits you ahead. Lovely.    And these mutants, oh, they are done very well and simple: everyone has a passive, an active ability, and a cool b-skin, which we'll mention in a tad bit. Since there are a total of 12 characters+2 secret ones, you can imagine there's a lot of diversity involved, each offering its own challenge, too. For an example: -You've got Crystal. She's unlocked from the start, has 2 extra passive hp(from 8 to 10) and the active ability to shield at will, which deflects projectiles and she's overall immune to damage while shielding. I say overall loosely. -And then you've got Melting. He's got straight up 2 hp and gains more rads(xp), and coming with his crippling health and depression is his active ability to blow up corpses. How is that useful? The explosions remove projectiles and damage enemies. Coming with his special mutation, all you're gonna hear late game is going to be pretty much BLAARGHBLERHG BALAAAARHG BLREHG etc. as you exit the level with no witnesses. So yeah, very well designed characters.    The gameplay itself is fast paced, the bullets are fast, some enemies are fast, but the most important thing that you have to remember is:  Everything. Is.  OVERPOWERED!   It's ranging from enemies, to damage, to your own damn weapons(looking at you, SPC). The best way to avoid the unavoidable death is to be good at dodging and never go head-on into danger. That includes your pick-ups, which btw enemies drop rads=xp and have a chance to drop ammo or health packs on their corpses. As much as I've played, few have been the runs that ended because of lack of ammunition, but it could happen if you just cannot aim for the life of you.    Speaking of xp, your mutants will level if you picked up enough rads, which grants mutations, and pretty a lot of them can change the course of your game, ranging from more health, homing bolts, and even a very special mutation that differs form one to another. As how much it is different I can say it is game changing for the most part, and I'll let you find out for yourself what does what ;) Another thing is that once you hit level ultra(10, that being), you gain the choice between two character-specific mutations, and all I can say is that they're awesome, since if I have to take each one apart, it'll cover the entire review.    Moving onto the levels, now THIS is where the RNG stands in. The layouts of all levels change drastically, from open space all the way to tiny ity-bitty corridors. I won't even mention the spawns, those awaken the PTSD in me. Each particular level has its own enemies, which again, they're so many, it'll take a long time, but I can say that for the most part of weapons in the game, there is an enemy that does the exact same thing. Close enough, anyway. Once you have defeated the  final boss , you are given the option to  loop  the game, which means you are put all the way to zone 1, all mutations, current weapons, and all enemies are stronger and cluster-♥♥♥♥ed at once. As you can imagine, the best way to put this is 'good luck'.    The crowns. At some point in the game you will encounter a statue, it collects rads, spawns a portal and you get yourself a cool crown. Awesome, yes? Right? For the most part, the crowns are a tad bit underwhelming, and for the most part they're not even helpful. With the exception of Crown of Blood, of course. Esentially, they have to give you an upside and a downside, which it's called a trait, btw. Some of the downsides however are excruciating: no health drops, no ammo drops, SPAWN AT ONE HEALTH EACH LEVEL. As much as the devs tried their best to make the crowns useful, I still think all of them are a myth, as the only true crown is Crown of Blood.    Oh yes, almost forgot the B-skins mentioned earlier. The crowns and these skins are the supposed challenges of the game. In order for each crown to be unlocked on a character you have to loop with it, and now for each B-skin it has got its own requeiremens. The unlock process ranges from easy to tedious in a blitz. It can have you go to a secret level on the second stage all the way to beating the third boss on a loop. In the end, we can all agree the skins are looking slick and much more handsome than your starting character. So I'd say are worth it.   tl;dr To be frank with you I have mixed feelings about this game. Not about love and hate, mind you, but more like, for how much it has been in early access, it could have been greater than this. But for what it is, it's a good masochistic game to kill some time on. Most of the runs from start to finish are usually 15 minutes, the unmentioned soundtrack in the review is quite beautiful to listen to, and overall this is the best adrenaline rush I've played in my life. I'm sure in the upcoming years, one student will beat this master, but for how it is now, it's the best one of its kind out there. The grade I'm willing to give to this game is an 8/10. Definetly recommend. This has been your random reviewer, signing off. Peace!  ",
            "review_score": "1"
        },
        {
            "review_text": "yes very good 10/10 love",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game, amazing pixle art, its epic controller support has a very smooth' weight' to every weapon,shot,movement, ALT attacks. all around 10/10, and i have only ever given 2 games that much respect",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear throne.. Oh where to begin with this. Lets start practical Its a top down twitch shooter, where you play a bunch of mutated creatures that has the same goal, to Find the Nuclear Throne (TM). On the way you will encounter alot of enemies, Mutate into interresting powers, and like A Puckish rogue, Escape the police whenever possible now on to personal opinions I believe Nuclear throne Stands as a perfect example for a game that started rugged and alfa, in need of support to build itself to where it stands today. the game is fast paced, Fun, whacky and all sorts of rage inducing. And I love every second I of the 84,3 hours I have played it. If you enjoy silly indie games that is Fast paced, Fun. And has alot of good replayability, This game is Just for you!",
            "review_score": "1"
        },
        {
            "review_text": "best game 2015 (cuz thats when i bought it)",
            "review_score": "1"
        },
        {
            "review_text": "Get this game, it's like the coolest pair of pants.",
            "review_score": "1"
        },
        {
            "review_text": "lol people who give this a thumbs down because they are bad at it.",
            "review_score": "1"
        },
        {
            "review_text": "this game...... god this ♥♥♥♥ing game........ i cant rightly rate it good or bad really. What i can say however is that whoever created this game wanted to place a gamer in a situation where you either get the ♥♥♥♥ outta that turtle shell and light up literaly everything on screen that isnt you, or get crushed like an ant under a boot. By far one of the fastest paced rougelikes i have ever had the pleasure to play. Regardless, I cannot lie, despite all the moments that are utter ♥♥♥♥♥♥♥t, I still love it.",
            "review_score": "1"
        },
        {
            "review_text": "When you see a game from Vlambeer, you KNOW it´s a game from Vlambeer. It has always been top tier in every aspect; excellence in audio, gameplay and character design. They nailed Luftrausers, they nailed Ridiculous Fishing and they nailed Nuclear Throne. It´s the perfect mix of never-ending action with a delightful ambience, SFX and content.  It has local coop, daily/weekly runs and dozens of characters, hundreds of guns and a handful of secret areas. A never ending arcade that achieves every aspect of its genre in perfection, being in constant addition of new content and with some amazing devs that deverve way more attention :)  GO BUY IT RIGHT NOW out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I love rogue-like games, and this by far has to be my favourite.  10/10 would commit mass genocide again *♥♥♥♥♥♥♥♥♥*",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing. If you are looking for a pick-up game that has total mayhem. this is the one for you. I wouldn't suggest this for people who don't want to face failure after failure, because thats basically what you will get from this game. But if you like to play a game that rewards you for your risks, then get this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just fun. It's really hard though, so here are some tips: - Play as Crystal to learn the mechanics, the shield helps - Play with a mouse and keyboard - Take Gamma Guts - Don't be a dirty casual",
            "review_score": "1"
        },
        {
            "review_text": "Sit and spend your hours for this gem.",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne the game where you know that your going to die, but the question is always the same.  When? How? Why?  Well I'll tell you before it even begins: Your not good enough How will you get better? Is it possible?  You damn right it is just keep pressing REPLAY and get ready for one of the best top down games ever fathomed. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A frustrating and abusive shoot em' up that I always end up coming back to.                                                                                 Just like my gf       ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best love hate relationships you'll ever have with a video game. Having done everything this game has to offer, this game will go down as one of the most difficult, but most rewarding games ever. Every feat makes you feel accomplished. Reaching the throne, killing the throne, killing throne 2, the list goes on. As you get better those rewarding moments will become cakewalks. Where the real joy comes into play is knowing each enemies patterns, knowing which skills go best for your characters. Amazing weapons where you will find your favorites quickly based on your play style. When it comes to fast pace, addicting gameplay you can't do much better than nuclear throne. The throne is calling for you. Accept the charges. Enjoy and git gud!",
            "review_score": "1"
        },
        {
            "review_text": "it's pretty good. it would be nice if they actually updated it, but you know, whatever.",
            "review_score": "1"
        },
        {
            "review_text": "12/10 top game id the world",
            "review_score": "1"
        },
        {
            "review_text": "'Over 100 guns', best weapon is a shovel. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a hell of a lot more fun than I thought it would be. It should be in everyone's library!",
            "review_score": "1"
        },
        {
            "review_text": "If you get shot you die. The End.",
            "review_score": "1"
        },
        {
            "review_text": "it finally went live. get it :D",
            "review_score": "1"
        },
        {
            "review_text": "*Get's the upgrade where corpeses hit and fly harder* *Kills Big Dog in 3 hits with sledge hammer* *Accidently kills bandit behind* *Bandits corpse blows up a car* *I die* -the end-",
            "review_score": "1"
        },
        {
            "review_text": "in terms of difficulty, i'd say that this is somewhere between Spelunky and castrating yourself without anesthetic",
            "review_score": "1"
        },
        {
            "review_text": "A 'roguelike' shooter that's tough, but not too tough. Comes with plenty of secrets and amazing music too. Though, be prepared to try hundreds if not thousands of times before you    reach the Throne and loop. Loops are tougher than the normal game, so come prepared for that too.     I reccomend this overall, for it's replayability and tough-yet-fair gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "-Start up game  -Gets Pumped -Chooses a character -Dies,Shrugs it off -5 Hours L8R -Has the most intense run ever -Dies -Smashes keyboard with sledgehammer  10/10 Would Break My Keyboard Again. But seriously its a great game addicting but really rage inducing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. I suck at it but can't stop playing. Incredibly fast and furious action, tons of variety due to different guns and mutation choices. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The first time I ever reached the Nuclear Throne:  -Friends are in my room watching me play -Went as crystal -Beat all the enemies -Used no shortcuts -Finally beat 7-2 -Saw the red carpet to go to the Nuclear Throne -Took out headphone jack so my friends could hear the game -Game crashed -Restarted game and went again  10/10 would take headphone jack out again",
            "review_score": "1"
        },
        {
            "review_text": "So, Nuclear Throne. This game will make you question how good you are, how fast your reflexes need to be, how quickly you can kill an enemy before they end up ending you. 100 hours of Binding of Isaac? Doesn't matter in the slightest.  Cons: ~Will make you hate yourself ~Will take time to master ~Will make you rage ~Will make you die  Pros: ~Erase all cons ~Make you love yourself ~Feels hefty, weighty, satisfying ;) ~You will get better ~FREEPLAY (Looping)  Some final advice I can give: Don't beat yourself up about dying hundreds of times to finally get to the Nuclear Throne, and then die to it. Ultra mutations are satisfying as hell to reach, and if you get past the Nuclear Throne you can loop, which some players might find upsetting as you no longer have a goal, and you will eventually die. However I can't stress enough how fun trying your build out on waves of enemies really is. I find that if I can get to that point, any way I die will just be funny, and I'll restart the game and go for it again. It may not feel like you're getting better, or know how to get better, but you definitely will after enough hours.  All In All: Definitely recommend it, if you want to get better or want to see someone skilled play, check out SLEEPCYCLES (Big Tam) or Chubbyemu (I haven't seen much of his stuff though) on youtube.",
            "review_score": "1"
        },
        {
            "review_text": "I don't need no friends, I don't need no phone, Just a bag of severed head and my Nuclear Throne.  Like dying? Like dodging lots of enemies and projectiles? Like rediculous weapons? Play this game!",
            "review_score": "1"
        },
        {
            "review_text": "  Press B to blow. Seriously. Try it.  (I say I got it free because it was a gift from a friend.)",
            "review_score": "1"
        },
        {
            "review_text": "Crazy addictive, incredibly fun, ridiculously challenging, and has a phenominal soundtrack. I whole heartedly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't need no bread, I don't need no home Just everybody dead and my Nuclear Throne",
            "review_score": "1"
        },
        {
            "review_text": "I beat it F*ck you   10/10  Edit: IDPD Captain one-shots me  *Cries in a corner*",
            "review_score": "1"
        },
        {
            "review_text": "Awsome! ",
            "review_score": "1"
        },
        {
            "review_text": "Ok, actual review time. I don't know why I am so hooked on this game already. I tend to dislike games that are overly brutal and/or challenging (which Nuclear Throne sits on its own throne at the top of my list) but it's like you NEED to do get to Nuclear Throne, no matter how many scorpions, assassins, maggots, crows or robot snipers I have to push through. Oh, and don't do co-op. It's local only. bs  A game that can make me stop playing Smite is worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "It's good",
            "review_score": "1"
        },
        {
            "review_text": "This game will give you carpel tunnel and tired eyes if you are trying to make it far into the game.   Pretty much this game is designed to have enemies that will catch you off garud and kill you when you are focused on another thing. From ninjas disguising as dead bodys to vans teleporting from thin air and running you over.  This game will make you rage. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "'All me be believe in is the Nuclear Throne'",
            "review_score": "1"
        },
        {
            "review_text": "Love the pace of the game, I recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ing suck at this game.",
            "review_score": "1"
        },
        {
            "review_text": "its like hotline miami but with guns",
            "review_score": "1"
        },
        {
            "review_text": "An Incredibly fun procedurally generated dual stick shooter. Scores of different weapons and quite a few different mutated characters with their own strengths and weaknesses to discover! Great soundtrack and an amazingly engrossing and an absolute blast to play. Getting to the throne is an amazingly tough feat as well.",
            "review_score": "1"
        },
        {
            "review_text": "never played a fps before but it seems pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun i dig the pixels, but the difficulty is a little to much sometimes for me but id say get it when its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "never played a fps before but it seems pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "Yes i've had this game since the begining, annd although i don't play it but maybe three or four times a week i still throughly enjoy it everytime i play.",
            "review_score": "1"
        },
        {
            "review_text": "a very rad game",
            "review_score": "1"
        },
        {
            "review_text": "monsters guns explosions death= NUCLEAR THRONE",
            "review_score": "1"
        },
        {
            "review_text": "Played As Illuminati Man Who Has Airhorns, Got ScrewDriver, Killed EveryThing, And got Killed By A Fire Cockroast.      10/10",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to kill yourself? You have! Well then buy Nuclear Throne today!  11/10 would read YOU DID NOT REACH THE NUCLEAR THRONE again  kill me........",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Wait... They removed chicken's slo-mo?  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I will never reach the nuclear throne! :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is set in a wasteland like Fallout, but everything wants to kill you. This game is about getting stronger and surviving as long as you can. The characters range from Fish to Rogue and if the characters are so easy to remember, you know you got a good game. There are different mutations to help you on your way. The bosses are also somewhat difficult, speaking of which, this is the first game that I've actually found very difficult and I like it. This game has weapons to help defend yourself. The map is randomized like Binding of Isaac. The goal is to defeat all the bosses and reach the throne. The best part about this game is the Soundtrack. This is the best music I've ever heard, It fits so well with the game and changes the mood(It also fits other games). This is the best game I've ever played in years, and it only gets better. I highly recommend to this game to those that want a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "a fun way to kill time",
            "review_score": "1"
        },
        {
            "review_text": "Last time I played NT was like last month, was working fine and everything. Now when I try to play, I lag when I shoot and game freezes up my whole PC when trying to close it. Ive deducted its a Game Maker issue, as I tried Super Crate Box and it was having the same issue. Devs, if your listening, id appreicate some help. Ive been going nuts trying to fix this and simply cannot find a way to get it to work properly. Thanks, and I hope to hear from you soon!  -Justin  EDIT- Everything is working fine now. I figured out it was a problem with my GPU and had nothing to do with the game. Im sorry devs, keep up the good work!",
            "review_score": "1"
        },
        {
            "review_text": "enter the gungeon is a fa-  what?  what do you mean?  this is a different game?  OOOOOOOOHHHH i see.  binding of isaac rebirth is a...",
            "review_score": "1"
        },
        {
            "review_text": "No one wont like this game is they have the time to practice and learn.",
            "review_score": "1"
        },
        {
            "review_text": "-&gt; beat the doge boss with 1 health remaining  -&gt; he exploded and killed me  -&gt; achievement unlocked -&gt; 10/10 best rogue-like after the binding of isaac and way better than enter the gungeon",
            "review_score": "1"
        },
        {
            "review_text": "It's like a bad Enter The Gungeon, but this came first. Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda fun when youre good but doesn't have fullscreen without blackbars",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE IT SO MUCH! Definitely worth it!",
            "review_score": "1"
        },
        {
            "review_text": "so a giant talking fish, a robot, a woman made out of crystal, a giant octopus with at least 10 eyeballs, a giant naked muscle man, a half skinned skeleton, a plant with razor sharp teeth, a samurai chicken, a reformed theif, the illuminati, a rogue cop, and a giant pile of nuclear waste walks into a bar, and..",
            "review_score": "1"
        },
        {
            "review_text": "One of the best shooters I've played. Would buy again. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "this game rewards a skilled and dedicated player with insanity and ♥♥♥♥ tons of fun. unless you are a god, this game is difficult as hell, and requires a lot of hours. i have 91 as of the writting of this review, and im still not that great.   ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun. I love the game, play it all the time. Variety of challenges, variety of characters, variety of weapons, variety of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a massive drain on sanity and yet I can't stop. Thus far, I can't count how many times I've died from LITERALLY nothing, a car that was almost entirely hidden by a wall, grenade hitting a part of the environment and bouncing off, coming out of the Crown Rooms to a swarm of enemies and next to no HP or Ammo, or just spawning inside a car because World 3 is the bane of my existance, after three hours I can already say this is a on-again, off-again love-hate relationship...   Looking for a game that'll leave you gripping your hair and questioning 'WHAT' then knock yourself out.",
            "review_score": "1"
        },
        {
            "review_text": "At first glance, it doesnt look like much. Once you start playing, you imediatelly understand why people love it. From the moment I pressed play, it was like I took a happy pill while on a rollercoaster.  Recommendation: put a song with a nice energy to it (like Hit That by The Offspring) - makes it even more fun   And never try the game a few minutes before you gotta go to work.. you'll end up being late ._.",
            "review_score": "1"
        },
        {
            "review_text": "A really great game to take some time off of your hands. =)  Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine playing Enter the Gungeon, and then you switch to this and play rouge, god it's a ♥♥♥♥ing nightmare",
            "review_score": "1"
        },
        {
            "review_text": "A game like a drug.  Wow, this seems fun ♥♥♥♥, this is not good for me ♥♥♥♥, I'm already addicted ♥♥♥♥, I will die from this, but I cannot stop!  10/10 - would rip off my own head with a Disc Gun (UT-Style) again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is too hard :)",
            "review_score": "1"
        },
        {
            "review_text": "Its like Isaac but with guns and a fish that can roll.",
            "review_score": "1"
        },
        {
            "review_text": "This game has brought lots of good times for not just me but my friends too. I would suggest this game if your a person who is into backstorys and LOTS of guns! The only thing i should mention is that this game can be really diffucult if you dont train and play it A LOT. But overall this game is my favorite steam game (granted that i only have 19) and has brought the most good times.   -KingOfDemScrubs",
            "review_score": "1"
        },
        {
            "review_text": "10/10   Rationale- Dual weilding nuke launchers.",
            "review_score": "1"
        },
        {
            "review_text": "bad asssssss!",
            "review_score": "1"
        },
        {
            "review_text": "Most lickley my most favorite rouge like game I will ever play in my life and most likley consume my life till th day I die                           Its a really good game go buy it now ;)",
            "review_score": "1"
        },
        {
            "review_text": "YOU CAN HIT THROUH WALLS!!!!!! YES!!!!!! NO DIRECT BOSS FIGHTS!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Every time I think I might make some progress, this game smashes my head in and reminds me that life is cruel.  Great game.",
            "review_score": "1"
        },
        {
            "review_text": "i used to like this game until i broke it with mods",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is like my ♥♥♥♥♥ because it is long and hard. What do you mean Nuclear Throne isn't long... Well ♥♥♥♥♥. This is a neverending stream of fun, just like my ♥♥♥. Butt ♥♥♥♥ jokes aside, Nuclear Throne knows how to treat a player, very rudely. I love to draw rule 34 with Eyes because it is the only playable character that you can have an orgy with where everyone is getting pleasure from sticking their ♥♥♥♥♥♥♥ into eye sockets. Somehow, it was the first artwork to be banned from ♥♥♥♥♥. Butt fuq it, literally. This game earns a score of the game has characters 8/8 that's gr8 m8.  Masturb8 in front of me please, my mouth is wide open.  -The Government",
            "review_score": "1"
        },
        {
            "review_text": "I'm in rehab from Nuclear Throne addiction",
            "review_score": "1"
        },
        {
            "review_text": "fun but very hard",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome. Features: - 2 players local co-op. - Plenty of maps and secret levels. - A lot of weapons. - Challenging playable characters (about 11) and crowns (challenges, like Halo Reach's skulls) - Well made level up buffs. - Amazing soundtrack. - The developers stream on Twitch (I think at least once a week) when they are update the game (they also update it off stream of course).  - The game success at what it tries to be. 10/10 for hitting the goal, awesome, fun, stressful-adrenaline bullet hell.  Also... Play Gun Godz, It's from the same developers (Vlambeer). it's a first person pixelated doom-like with Y.V. (the triangle guy from this game), and it's free if I remember right.  TL:DR: Awesome game, skill based bullet hell, buy it if you were wondering.",
            "review_score": "1"
        },
        {
            "review_text": "FANTASTIC game. I has me raging all the time, i have cursed this game to oblivion out of sheer hate. That is how good of a roguelike this game is.  Recommended. Wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "My   favorite   game.  I own    Fallout (3, New Vegas, 4)    DARK SOULS (l, and ll)    All Valve Games.    Etc (feel free to check)   My point, I   F*CKING   love this game.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;stroll into my local GameStop &gt;looking to pick up a copy of Nuclear Throne &gt;grab the game and take it to the charming maiden at the register &gt;'Pardon me, milady...but could you ring me up? A shame I don't have your number or I'd ring you up instead...' &gt;she giggles and takes the game, blushing as her fingers brush mine due to my fingerless gloves &gt;her eyes widen as she reads the game's title &gt;'Wow, I've never seen anyone buy this before! You must have special taste!' &gt;I smile and ready a witty response when suddenly a voice rings out from behind &gt;'Hahaha look at what this ♥♥♥♥♥♥ is buying! That's not Call of Duty Advanced Memefare! What a piece of ♥♥♥♥!' &gt;I quickly turn around, my cloak billowing behind me, to discern the source of the rude outburst &gt;generic dudebro caricature with a sports team cap and 'the guy that beat you up that one time behind the school in early October' shirt is standing there guffawing &gt;'Excuse me sir...you may disparage my person if you wish, but it is untoward to swear in front of a lady.' &gt;'♥♥♥♥ you ♥♥♥♥♥♥!' &gt;I smile quietly and tip my fedora low across my eyes, concealing them &gt;'As you wish...' &gt;I quickly swing my cane into his kneecap before he can react &gt;he bellows and charges forward &gt;I expertly sidestep him and the cashier screams as he crashes into the counter &gt;I draw my sword-cane and mutter a quiet oath as I drive it deep into his back &gt;'...requiescat in pace...' &gt;As I clean my blade the girl walks out from behind the counter, twirling her hair with her fingers &gt;'So...maybe you'd like to come over to my place to play that game sometime...? &gt;'No thanks, milady, it's single player only. Besides...' &gt;I sheath my sword &gt;'You're not my type.' &gt;skate away on my Heelys.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "after 100 hours i'm still having thrill peaks will this game easy to start, hard to master, perfect for gamers that like to dig into a game",
            "review_score": "1"
        },
        {
            "review_text": "extremely rad",
            "review_score": "1"
        },
        {
            "review_text": "First off, I got this game in a humble bundle, I would definitely not pay $12 for it, but it's also not the type of game I'd usually go for or enjoy as much as I have. With that out of the way...  Nuclear Throne is pretty awesome, the controls and gameplay are tight and once you get up to speed it's a helluva lot of fun. The graphics and sound really draw you in too. I think if you're passionate about roguelikes the pricepoint is about right, it offers a lot of gameplay and never gets old. I personally couldn't sit and play it for hours, but since I got the game I've fired it up every few days for a few games, I don't know if there's any other game in my library I've played that consistently for so long. ",
            "review_score": "1"
        },
        {
            "review_text": "its like 'the binding of isaac' but better",
            "review_score": "1"
        },
        {
            "review_text": "I ended up accidently ended up deleting my save after 22 hours of gameplay, now that I'm slightly better I got back prettymuch everything in about a hour and in like, 5 runs.",
            "review_score": "1"
        },
        {
            "review_text": "Like Luftrausers, Nuclear Throne is a basically competent and slick-looking shooter that turns out to be a lightweight when you look past the retro-chic veneer. Of my six hours with the game four were spent stuck on the same boss. Of course, this wouldn't be a problem if reaching the said boss was fun. It isn't.  Neither the overly simple level generation system or the enemy design add any variety to the inevitable retries, and unlike in certain other similar games, the bosses and enemy types stay the same every time you play. Since you have to completely clear out each level before continuing, there's no way to play dangerously to get more equipment or other advantages, which eliminates the risk-reward strategizing that's at the heart of pretty much every successful roguelike ever made. Thanks to this the majority of the game becomes a joyless slog towards whatever point you're currently stuck at.",
            "review_score": "-1"
        },
        {
            "review_text": "OF COURSE I RECOMMEND THIS ♥♥♥♥ING GAME. IT'S LIKE BINDING OF ISAAC ON COCAINE AND ECSTASY!  There's one thing though that I'd like to tell you: If you do rage or get frustrated fast, do not buy. Unless you love Roguelikes. That combination doesn't make sense but there's strange people on this planet.  The RNG in this game doesn't give a single flying ♥♥♥♥. It doesn't assist you, it doesn't have mercy. Sometimes it even feels like it just decided to end you. Oh you've just ended that level where you barely survived with 1HP because you had a ♥♥♥♥ing revolver and the game decided to not spawn any useful weapons in the levels before at all? Well ♥♥♥♥ you then, have fun with this spawn right inside of an entire army of enemies without any cover whatsoever!  I gotta say, the RNG is just extremely frustrating sometimes. But oh boy, if you have a good run with great weapons and mutations!  Yeah, I do suck at the game (haven't even looped once) but I'll sure as hell not stop playing it.  P.S.: ♥♥♥♥ING LIL HUNTER FFS",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would die to the edge of a particle again.",
            "review_score": "1"
        },
        {
            "review_text": "Hard but fun. ;)",
            "review_score": "1"
        },
        {
            "review_text": "The game's idea of a 'challenge' is to spawn you in the middle of 50 enemies. There is absolutely no control over what the game decides to throw your way, sometimes you get ridiculously easy levels, sometimes literally impossible ones. The game is fine for the first round, but after you 'loop' the game it drops the ball completely.  Having spent over 100 hours in this game, all I can say is last 50 hours of that I was ♥♥♥♥♥♥ off trying to endure the bs the game throws at you. If you do get the game, don't bother with the looping, it's a waste of your time. There's also an entire game mechanic (crowns) dedicated to making the game even harder than it is, which I'm sure the 0.001% of the playerbase who find the game too easy will appreciate greatly.  A similar game that does everything better is Enter the Gungeon. Both are very hard games, but in Gungeon the difficulty is fair and you can learn to overcome whatever it throws at you. In Nuclear Throne random stuff happens and you die.",
            "review_score": "-1"
        },
        {
            "review_text": "i weird graphic will block almost all of the gameplay so it was rendered unplayable fix your glitches this is the second time attempting to buy this game",
            "review_score": "-1"
        },
        {
            "review_text": "Great gameplay, but the display mode apparently blocked at 30 FPS is very uncomfortable, giving me headackes pretty quickly on my 27 inches display. The effect is less impacting on my 17 inches laptop.  I hope to see a remake of the game on a platform allowing fluid movements.",
            "review_score": "-1"
        },
        {
            "review_text": "The wasteland calls you to.",
            "review_score": "1"
        },
        {
            "review_text": "I guess I don't get it.  Rogue-lite twin stick shooter.  Not really enough here for me at $11.99.  I would reccomend this game at under $5.",
            "review_score": "-1"
        },
        {
            "review_text": "Too much random ♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros,  Everything but lil hunter  Cons,  Lil hunter ",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game because of the rave reviews including the 90% from metacritic and it looked okay at first glance. But this is an 11 dollar demo, not a game. You point your mouse and you shoot. They did a really good job with it, it feel response if a bit like a flash game. But after playing for a little bit, I realized this is it, this is the entire game. I went online to watch people play and it doesn't look like anything ever happens beyond the first 10 seconds. I'm in disbelief about how this game can have a good rating on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has fun gameplay, great audio-visual feedback and an awesome soundtrack, but I can't play it because the resolution makes me nauseus  Pros:  + great soundtrack + awesome and fast gameplay + great theme  Cons: - No widescreen support, feels very claustrophobic on small monitors - The screenshake is very confusing, thankfully it can be turned to 0% - there's sometimes way too much going on onscreen",
            "review_score": "-1"
        },
        {
            "review_text": "Because of low FPS or syncing or whatever, the game is pretty shakey and makes me nauseous after a couple minutes of play. If you don't get motion sick ever, you may be fine with it though.",
            "review_score": "-1"
        },
        {
            "review_text": "i prefer overwatch to this obvious clone. overwatch is the best FPS and this, well this is just disgusting.",
            "review_score": "-1"
        },
        {
            "review_text": "It's bugged to ♥♥♥♥. Give it a month or two.",
            "review_score": "-1"
        },
        {
            "review_text": "30 fps is an asthetic choice according to the developers lmfao",
            "review_score": "-1"
        },
        {
            "review_text": "The videogame equivelent of heroin. Need I say more",
            "review_score": "1"
        },
        {
            "review_text": "This game is fast paced, exciting, and varied in a great way. I am able to play run after run of this awesome game",
            "review_score": "1"
        },
        {
            "review_text": "I had a lightning hammer, 'longer arms' and 'impact wrist' mutations and was hitting enemies from one side of the map to the other until a yeti like robot threw a car on me which exploded and killed me.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "'Fear is the mind killer.'  har har har. yeah this is a good one.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game because it states it has full controller support, which I was unable to find. I'm currently only able to play with a controller via Steam Link, so this was a deal breaker.",
            "review_score": "1"
        },
        {
            "review_text": "So, this game. What about this game?  How about the fact that it's EXTREMLY difficult.  So when you start playing, you'll realize that the bandit does 3 damage, thats 1/3 of your health, already gone. The first enemy you see, does enough damage to KILL you in 3 hits. Don't even get me started with the scorpions. They fll the screen with a TON of green projectiles that are nearly unavoidable.  Nothing wrong with the sewers, so what about the scrapyard? Tons of birds that shoot 3 bursts of bullets, and guess what? Each bullet does 3 damage; enough to kill you. Also, you have sniper robots that sit at the back of the map and shoot 3 high-velocity bullets, and guess what? Each bullet does 3 damage; enough to kill you.  See where I'm going with this?  Next is the crystal caves, an area filled with fast crystal spiders that can easily kill you because they're so hard to hit, and they can gang up on you.  And then, the frozen city. Guess what? A robot yeti that dashes across the screen, which can easily take you out if you could'nt notice him over the sound of the robot dogs shooting 3 bullets when it rolls, and guess what? Each bullet does 3 damage; enough to kill you. And to make it worse, each stage in this city is filled with tanks that fire a barrage of bullets.  Then, the labs, a place full of mutants that can easily overwhelm you, as well as a necromancer that can revive up to 6 more mutants. Worse than that, there are sort of kamikazi mutants that run up to you and explode, easily taking you down as you're getting mauled by the swarm of mutants.  And then, the palace. Ooohhh god. This must be Satan's castle, because it is FILLED with enemies that fill the screen worse than a golden scorpion can.  I can't explain anything about the Throne, because guess what? I never reached it.  I wonder why? ",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game would play forever if I had eternal life. But I dont so I wont.",
            "review_score": "1"
        },
        {
            "review_text": "I like it. Fun shooter, very addictive.",
            "review_score": "1"
        },
        {
            "review_text": "it's incredible rougelike experience",
            "review_score": "1"
        },
        {
            "review_text": "best way to lower my grades",
            "review_score": "1"
        },
        {
            "review_text": "Great Rougue like",
            "review_score": "1"
        },
        {
            "review_text": "I only have one thing to say. GET THIS GAME. NOW.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ Vlambeer, the golden weapons, the bandit leader (WAHAHOOHA HAHA), the screw driver, the scorpions, the jungle, the maggots, the rats, lil' hunter, the revolver, getting the screwdriver after 3-1, the special car in 3-1, YV's mansion, the snipers, the assassins, the floating crystals, the crystal ants, the dark, the nuclear throne, and ♥♥♥♥ NUCLEAR THRONE         Great game though. One of my favorites of all time. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The greatest rogue-like action game I have ever played. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Secretly, this game is just a vehicle for Vlambeer's signature screenshake.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best top-down roguelike pixellated shooty-booty-rooty-tooty games that exist right now. The music is good, the gameplay is good, but it can crash at times.  This game cannot be beneficial to your health, my heartrate increased by a lot when I reached the throne.",
            "review_score": "1"
        },
        {
            "review_text": "the binding of borderlands. on steoroids",
            "review_score": "1"
        },
        {
            "review_text": "HOLY ♥♥♥♥ THIS GAME MAKES MY ♥♥♥♥ ROCK HARD!!! But other than that the game is fun and has a simple objective reach the radioactive chair (Nuclear throne words come frim jeffotron) easy to pick up and Play but hard to master and huge difficulty curves around the corner hot damn is this game awsome",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly good. Quality and replayability is right up there with The Binding of Isaac.",
            "review_score": "1"
        },
        {
            "review_text": "Step 1 : Reach 3-? (ez pz you only need a screwdriver) Step 2 : Die or whatever floats your boat Step 3 : Play as Y.V for the rest of your life while spamming B airhorn/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell  I just got this game, played it for almost 3 hours straight and I'm still not even close to defeating the throne. High risk high reward game play and it is extremely addicting whether or not you are a casual gamer or a hardcore one. I'd defintely say its worth buying if you're into these type of casual/bullethell shooter games.",
            "review_score": "1"
        },
        {
            "review_text": "i ♥♥♥♥ing hate this game",
            "review_score": "1"
        },
        {
            "review_text": "Verrry verrry gud but in game u has to git gud 2 b gud ",
            "review_score": "1"
        },
        {
            "review_text": "So after playing this game for about an hour and a half, I really struggle to find anything negative to say. The game is a birds eye run and gun bullet hell type of shooter with roguelike elements including permadeath, leveling, and randomly generated areas. Now the graphics here are simple, and the music may become a bit repetitive after dying a bunch, but wholistically the audiovisual presentation is fantastic. Everything has punch and pizzaz. While the character designs I've seen so far arent really anything unusual, besides maybe the crystal golem character, they all have a lot of charm. The gameplay is fast, energetic, and challenging. There is no wasted time between the action either. The longest downtime youll see is when you mull over switching a weapon or which perk to take when you level up. When you kill the final enemy in an area, you get sucked directly into the next level, no meandering about. Bosses show up a little unexpectedly and depending on the number of supporting enemies around can be quite the death knell. Weapons are spaced fairly evenly and ammo and health arent exceedingly common. These and experience can be picked up with a fair amount of magnetism, but what is really clever about all these (besides the weapons) is that they disappear in only a few seconds, which encourages you to move into areas where you risk taking damage. Vlambeer doesnt want you to be too cool and calculated. The game can be a bit ambiguous with the perk descriptions, and you have no real way of knowing how a weapon compares to what you already have without trying it out. For the energy weapons particularily, I had no idea what to expect. You can only carry two, so you have to choose carefully. Whether these things are positive or negative is up to your perspective, this sort of try it and see what you get attitude is common to roguelikes. Ultimately I found the game to be extremely fun and well worth its farily low price point.",
            "review_score": "1"
        },
        {
            "review_text": "Didnt know bullet hell had a twin brother  Seriously,this game is good and difficult. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Very fun Extremely addictive Challenging Balanced Pretty long runs Many weapons Cool character abilities  Cons: Portals keep spawning on cars and killing me...  Favorite character: Steroids",
            "review_score": "1"
        },
        {
            "review_text": "Maybe ♥♥♥♥ing kill Lil Hunter. GG tho",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun rogue-like indie game, would recommend to andyone who wants to have a fun time in a really challenging game, its a great deal for only $12 bucks. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "can we get gun godz moved to steam? ",
            "review_score": "1"
        },
        {
            "review_text": "Do you want a a good game that will make you ragequit for about 5 minutes and come back to it? Get this.",
            "review_score": "1"
        },
        {
            "review_text": "Put it this way, when you have one of the best combos in the game and you're killed by something you have no control over, do you instantly restart or do you simply sit there and rage? When you're playing Nuclear Throne, you instantly restart. That's how good it is.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the definition of 'bullet hell.' Damn good time.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing the game for about a year now, watching it change and the community grow sure has been fun, now it's finally released. This is one of the best indie games I've ever played, up there with Super Meat Boy and the Binding of Isaac, it's packed with fun and is sure to keep you entertained for hours, and the game is super cheap too",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again if you looking for a game thats fast paced and cool look no further because this game gots it all. The only thing that might possably get you down is dieing, but that wouldn't happen, right?",
            "review_score": "1"
        },
        {
            "review_text": "You got the money ? BUY IT RIGHT ♥♥♥♥ING NOW I SAID RIGHT NOW",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the most fun game I have ever played. This game and The Binding of Isaac are the epitome of a truely random game. The map layout is always different, the weapons are mostly different, the enemy count and type are different to a degree. Nuclear Throne can be described as hectic and very challenging. When you see the tag bullet hell expect to have to work on your dodging, however over time the game becomes more managable! Pros -awesome art style -the game is out of testing and is a 'full game' -the replayability is 10/10 -the sounds and music are amazing -not a single run will feel the same for you Cons -there are still some bugs and annoyances in the game that need to be fixed but it seems like the developers have fallen off the face of the earth. -will consume all of your time Rating: 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Topdown shooter roguelike that provides near-endless amounts of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "You will die. A lot. Tons of secrets, tons of fun.  Only issue I have is it will crash after first launch sometimes, requires a restart of the PC to fix it. Also, I HATE YOU LIL BANDIT!!! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fish Can Roll",
            "review_score": "1"
        },
        {
            "review_text": "Unforgiving twin stick shooter rogue like. A lot of players complain that the game is unfair but all deaths can be planned against and avoided, it just takes time to build your playstyle ans strategy until it's all muscle memory.  There's so much randomness and so many unlocks that theres things you haven't seen even after 100 hours in. I still laugh at deaths I've had because they are so unexpected but so obvious in hindsight.  Best rogue-like I've played, ever.",
            "review_score": "1"
        },
        {
            "review_text": "I did not make it to the nuclear throne :(",
            "review_score": "1"
        },
        {
            "review_text": "Watch out for vans.",
            "review_score": "1"
        },
        {
            "review_text": "Have a hard time getting into rouglikes but this one felt enjoyable no matter how far I got.",
            "review_score": "1"
        },
        {
            "review_text": "I would honestly give this game a 10/10, It has been a long ♥♥♥ time since I have played a game this original and addictive, if you have 12 dollars, why the hell wouldnt you buy it?",
            "review_score": "1"
        },
        {
            "review_text": "You did not reach the nuclear throne",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced and frantic, Vlambeer's Wasteland outing is worth the time if you enjoy rouguelike, top down, bullet hell shooters that generate salt faster than the instant evaporation of the oceanic mass of the planet earth. SO much salt.",
            "review_score": "1"
        },
        {
            "review_text": "You will die and play it again",
            "review_score": "1"
        },
        {
            "review_text": "Fun randomly generated rogue-like with different mutations, characters and weapons to keep things interesting on your quest to reach the irradiated armchair. Not enough people play it sadly. : (",
            "review_score": "1"
        },
        {
            "review_text": "I have spent 73 hours on this game at the time of review. I REGRET NOTHING. This is definately one of the best rougelike games out there, if not the best. The fast-paced mayhem and constant stream of bullets everywhere just adds to the fun. Plus, its got a man fish. who used to be a police officer. and can roll. a lot. 'Nuff Said.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic, addictive, challenging these all describe this amazing game. The controls are easy to pickup and the characters are fun and varied each with their own trade-off making their playstyles varied. the random level generation is good and the enemies are unique looking and hard to fight, you will die a lot in this game but it only makes you want to do better.",
            "review_score": "1"
        },
        {
            "review_text": "All you need to know about nuclear throne:  Fish can roll",
            "review_score": "1"
        },
        {
            "review_text": "I hate myself for buying this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever, made me hang myself 3/10 it's ok.  Seriously best game.",
            "review_score": "1"
        },
        {
            "review_text": "Just one...more....try... ded....one more. ded. Ok, I swear to myself, this is my last. Ded. AWOIDJAOWMFAOSEWMF ONE MORE TIME I SWEAR TO GOD. ded. This is my life now. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Fun. Addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Guns. Radiation. NUCLEAR FUSION! WHAT ELSE DO YOU NEED?  Probably a triangle that can make airhorn noises.  I know I needed that, after the guns started to get in the dryer on their own.",
            "review_score": "1"
        },
        {
            "review_text": "So much fun on this game , step in too deep",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and challenging. Lots of content and replayability. Buy it with a friend so you have someone to compete against in the daily challenges and then keep a running total of wins.",
            "review_score": "1"
        },
        {
            "review_text": "I never cared much for the rogue genre but I must say the crunchiness of NT makes it a great game for me. I love the variety of gameplay and the overall 'on the edge' feeling it induces.",
            "review_score": "1"
        },
        {
            "review_text": "Took me 38 hours to finally manage to defeat the Nuclear Throne, only to be faced with a bigger, badder Nuclear Throne. 10/10 would be blasted to bits again.",
            "review_score": "1"
        },
        {
            "review_text": "So many deaths...",
            "review_score": "1"
        },
        {
            "review_text": "Our father,who ate a man and ate a pizzer",
            "review_score": "1"
        },
        {
            "review_text": "Really nice hybrid of Shooting and Rogue-like game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best roguelikes out there. Fast, satisfying action at all times, amazing sound design and soundtrack, and some of the most fun co-op I've ever played. If you like Enter the Gungeon or the Binding of Isaac, but wished things moved a bit quicker, look no further.",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that would make this game better is 60 fps.",
            "review_score": "1"
        },
        {
            "review_text": "You don't own this game... WHAT IS WRONG WITH YOU?! Get it now!  It is a ton of fun and has fairly short play sessions. Perfect for the times that you want to have real fun playing a game without dealing with multiplayer games.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, addictive, tough as nails, community driven, made with love. A rapid-fire, rogue-like triumph of an indie game by Vlambeer. And it's not even close to finished.... 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a fast paced game with cool weapons, uniq characters and secrets levels to find. also got a nice learning curve to it.",
            "review_score": "1"
        },
        {
            "review_text": "Love the test of skill this provides with survival and progression of the game , and love the replay value this offers",
            "review_score": "1"
        },
        {
            "review_text": "The ultimate arcade-y top down shooter. It's so quick and controls so well, every weapon feels right and has it's place, even the Disc Gun! If you're a fan of any of Vlambeer's other games, or stuff like Enter the Gungeon or Binding of Isaac, I absolutely recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Totally love this game",
            "review_score": "1"
        },
        {
            "review_text": "Well, this definitely is the game where I died the most. It's tough and has a steep learning curve. However, it was very rewarding to see how I improved while playing, getting better and better. Also there are tons of awesome weapons in this game! But don't underestimate the amount of frustration you probably will encounter. So if you start throwing or smashing things (or worse) if you get angry, this game isn't for you (or your stuff, for that matter).  At some point I lost interest because the progress I made seemed to get negative, heavily impacting the rewarding-frustrating-ratio. But overall I had my share of fun with this unique game! Also I didn't pay that much because I got it in a Humble Bundle.",
            "review_score": "1"
        },
        {
            "review_text": "If you dont mind 30 fps games with freeze frames, you will love this looping, endless, infinitely replayable piece of retro shoot them up in a post nuclear apocalyptic setting. Vlambeer has just entered my list of phenomenal developers. Play this at your own risk, second only to crack cocaine!!   PS: Ravens with uzis exist and they suck!",
            "review_score": "1"
        },
        {
            "review_text": "Just Amazing!  What a lovely chaos, bullet hell at its best!  #verifyvenuz",
            "review_score": "1"
        },
        {
            "review_text": "So hard to tell how fun when you die buy a bullet before you get health.",
            "review_score": "1"
        },
        {
            "review_text": "Fish can roll.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun Roguelike I played yet. Satisfying gunplay with enough but not too much variation in upgrades to get consistent good runs going.",
            "review_score": "1"
        },
        {
            "review_text": "Verry good and i have no frame rate drops at all",
            "review_score": "1"
        },
        {
            "review_text": "This time i'll definitely kill the throne",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is one of those games where if you start playing it, it becomes hard to put down. I played the crap out of this online and off and I find it to have interesting new things to offer each time. It's fast pace and RNG keep it fresh, along with ridiculous mods that the community puts out. If you are a fan of punishment and post apocalyptic crazyness then this game is for you. If you aren't a fan of that then I am sure the soundtrack will pull you in as it has myself and many other players.",
            "review_score": "1"
        },
        {
            "review_text": "Top down rougelike shooter that is easy to pick up. Very rewarding in terms of skill progression. Extremely difficult endgame that takes a lot to master.",
            "review_score": "1"
        },
        {
            "review_text": "The feeling of sheer thrill while playing this game is second to none. Only caveat is that it's locked to 30fps.",
            "review_score": "1"
        },
        {
            "review_text": "A fairly fast paced shooter with lots of variety when it comes to guns and some variety when it comes to characters. My only complaint is that I suck at it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun, thogh sometimes rage inducing, for multiple reasons. There are times i find myself someing back to it after not having played in a week or more, and I still find it to be one of the most enjoyable timewasters i own. I personally cant play more than a few games per session because im kinda bad, but whatever.",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was pretty good. Pretty good. ... ... Save yourself... Don't press B Don't press B Don't press B",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my favorite games of all time. I picked it up about two and a half years ago, and i've loved it ever since. Vlambeer have outdone themselves this time.  The art is beautiful, the gameplay is SO satisfying, and the music is some of the best i've heard in a long time. The only thing keeping me from putting in 10 times as many hours, is the sharp difficulty.  10/10, would get shot by a robot sniper through a giant, missle shooting dog again.",
            "review_score": "1"
        },
        {
            "review_text": "So I've been playing this since Early Access and let me tell you, this is absolutely the best time to pick it up. Great Roguelite twin-stick shooter worth every penny and replay value is extremely high! A must have for indie game enthusiasts or anyone who likes a great game.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Quite unforgiving and visceral. If you think Hotline Miami and Broforce were too easy, this might be for you.",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is one of the most high-octane, action packed, thrilling, and exciting top down experiences you'll ever enjoy. You bob and weave like a shoot 'em up, you lock and load like a bashful, jacket-wearing killer, and you die, over and over and over and over again.   Game's developed by some great guys who have absorbed every bit of feedback the community has provided, went to town on the information, and turned it into something soulful, fresh, and truly spectacular.",
            "review_score": "1"
        },
        {
            "review_text": "I've been with this game for a long time, it's amazing to see how far it's come. It's really an amazing game and so addicting. I very highly recommend this game, especially to anyone with a love of Roguelikes.  Pros:  Great art style and look to the game   Varied runs, even level-to-level   LOTS of guns and enemies   Fun, albeit tough bosses   Great devs, they love fun as much as we do   Cons:  I haven't been playing I much as I should have during development...   ... That's all I can think of...   Simply put, BUY THIS GAME.",
            "review_score": "1"
        },
        {
            "review_text": "The two years of early acsess have been well worth it. Though I've only joined this game for it's last few major updates, every single patch has had new content, bug fixes and balances. This game is phenominally well done and I wish for everyone to have the same experience that I've had with Nuclear Throne. It's recent updates supporting steam-to-game interactions have been the icing, on the already beautifully well made, cake. Only thing that could be worked on is a better co-op system. But I understand the challenges that come with it.",
            "review_score": "1"
        },
        {
            "review_text": "Death has no meaning......EXCEPT UNDYING RAAAGE!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is true pain and can kick my ♥♥♥ on a daily basis.  I ♥♥♥♥ing love it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game that will have you addicted after just 1 hour, great rpg mechanics mixed with great level design and character creation. Interesting enemies and so much bullet hell.",
            "review_score": "1"
        },
        {
            "review_text": "IT is a fast pased rogue like game it has tons of unlocks and it is very repetitive but that is good wich means you can play it over and over and not get bored",
            "review_score": "1"
        },
        {
            "review_text": "It's that game you play that drives you insane when you get really far and get goomba stomped by some random flying object or your own inability to react like a jedi. Yet at the same time, it's so bloody hard to stop playing. The randomization, the massive cast of characters with their own unique abilities, the bullet hell provided by an incredible arsenal of weapons, and the obvious rogue-like elements make this a must-have game for fans of 'sit down, ball out, cry hard and come back later' games.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, Difficult and Addictive. These are the three reasons why Nuclear Throne quickly became my favorite game. If you like challenging games and are not easily discouraged by repeat failures, the Nuclear Throne awaits you.",
            "review_score": "1"
        },
        {
            "review_text": "it's fine",
            "review_score": "1"
        },
        {
            "review_text": "Early Access done right. Worth every cent and minute I invested on this game.",
            "review_score": "1"
        },
        {
            "review_text": "Although I have only invested around an hour and a half of actual play time I can very easily say.This game is among one of the best roguelikes I have played. Especially considering the fact that it is a bullet hell twin stick shooter.  My only problem with it at all, is that with the most recent windows 10 update, I can no longer play it... It seems to freeze and crash every time I launch it from my steam library. :(  Hopefully there will be some kind of fix for this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Risk of Rain, Rouge legacy, or especially hotline miami, this is an absolute joy to behold. A rouge like that is absolutely brutal and a ton of fun, from death to infuriating death.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game to pick up, even if you're not a fan of rogue-likes. I mean, I'm the filthiest of casuals and I'm still having a blast with this masterpiece.     But seriously, buy it. It's worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Might go down as one of the best indie games of 2015, I'd even say better than Undertale. Nuclear Throne is ♥♥♥♥in rad, amigos and amigas.  Get it if you can.",
            "review_score": "1"
        },
        {
            "review_text": "Not for TREND.  Not for CORPORATE ATTITUDE.  Not for STONER.  Only true DOOM-MURDER HEADS.",
            "review_score": "1"
        },
        {
            "review_text": "The name is nuclear throne but no big explosions happen, 9/11 would recomend to my radioactive dog ",
            "review_score": "1"
        },
        {
            "review_text": "a very good game. I recommend it it's like arcade style except you use a mouse",
            "review_score": "1"
        },
        {
            "review_text": "Needs online multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Just wow. A simple yet challenging game that is one of the most addictively fun games I've played in a long time. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is quite possibly one of the best videos games I have ever played, if not the best. Here I will attempt to explain everything that makes this game so close to perfect.  -GAMEPLAY The controls are tight, and incredibly satisfying. Every weapon feels extremely fun to use, even if it is something ♥♥♥♥♥♥ like the Flare Gun. Each of the 12 main characters have their own Pros and Cons, yet none of the are bad or OP, some are just easier or harder to use. All of the enemies are challenging, but with practice you can learn how to properly defeat them. The games is incredibly fast-paced, and later on can get a little bit hectic. Even after 200+ hours, I still have things to learn.  GRAPHICS AND SOUND The game does use the standard for indie games it seems, being pixel art, but the art is really well made. Every sprite has so much detail put into it! From bandits to monsters made of radiation, each sprite is unique and looks amazing. The soundtrack is also absolutley perfect, with each track fitting every area and boss. The soundtrack is definetly the best one I've ever heard in a video game.  In conclusion, you should absolutlely buy this game. It is extremley challenging, but also extremley fun, with endless replayability and many secrets. BUY THIS STUFF DUDE!",
            "review_score": "1"
        },
        {
            "review_text": "I get an Error message on my macbook If I go into co-op and it won't let me close nuclear throne and the audio still runs and I lose access to use my mouse in game to close the message, have to restart laptop.",
            "review_score": "1"
        },
        {
            "review_text": "A crazy, procedurally generated shooter with a steep learning curve and retro graphics.  I bought this game on a whim and I'm not at all disappointed. There's just something about it that keep me coming back for more after every run that ends in my chosen character splattered all the map.  Every run is familiar yet very different. The areas always follow the same pattern but the levels and enemy distribution are always different. As are the way your character will progress and the gun choices presented to you.  I've been playing computer games for a very very long time and this is the first game since the Commodore Amiga that will give me some kind of injury for playing too long.  Get it, it's great !",
            "review_score": "1"
        },
        {
            "review_text": "First of all this is an amazing game. Second this is a very hard game. You see those 36+ hours, yeah I haven't beaten the throne yet. Not even close.  This game is a top-down shooter/bullethell  Pros: -12 great unlockable charachters with unique special skills -A huge variety of weapons that drop from dead enemies and weapon chests, ranging from classic weapons(shotgun, assault rifle,etc.) to gorgeous concept weapons(laser rifle, double flame shotgun, toxic bow, etc.) -Great soundtracks belonging to different areas -Unique bosses -And tons more amazing content not mentionned in this review  Cons: -Not for people who hate dying a lot in games  Overall I give it a 10/10  *Update*  I've defeated the throne, after 50 hours into the game, and it feels amazing! The satistfaction you get once you defeat that infernal machine after trying so many times is unbeleivable. The best part is that that's not even the end, since you can loop the game if you do it right.",
            "review_score": "1"
        },
        {
            "review_text": "I can't remember loving a game that makes me this ♥♥♥♥ing angry before.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game designed to ♥♥♥♥ you over constantly, very high skill ceiling wth deep gameplay, near infinite replayability, at the time of writing it was at update 97 and it was still very buggy but dont let that stop you from enjoying it, One thing I do feel its missing is online co-op and implementaton of yung cuz. Overall 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is an awesome game. It's fun, has a lot of content to unlock and is very challenging. Almost everything about this game is solid, from the fast paced combat to the many enemies and guns. So there’s no reason for me to waste your time going into depth about everything awesome about this game. Throw your money at Vlambeer and play this game! So I’ll go over the bad parts of the game, it’s lack of character and mutation variety.  The game has twelve different character to play with, each with their own abilities and perks. But your playstyle doesn’t usually change from character to character. You'll find yourself taking the same mutations and the same guns, so your playthrough's might not differ to much from one another. Two characters are an exception to this, Melting and Rouge. Playing as them changes which perks you take and how the game operates, making playing with these two characters a unique experience from the rest of the game. While the other characters are unique and well designed, you’ll fight enemies in more or less the same way, take the same guns and take the same mutations. The mutations (or perks) in this game are cool, but have a clear order in how you take them. Some mutations are always better than others.  This lack of variety is the game’s main downfall in my eyes, but it’ll still keep you playing for a long time and is one of my favorite rouge-likes out there. Despite all I’ve said, I give this a 9/10. :D ",
            "review_score": "1"
        },
        {
            "review_text": "Needs online seriously it would be epic also I love this game i just cant get enough its adicting",
            "review_score": "1"
        },
        {
            "review_text": "I'm giving this game a 9.9/10 just beacuse lil hunter exist, but enough of that.  This game is so good it's existense is unreal! You will die many times before you git gud and when you do you'll feel great when dodging bullets and slaughtering a room full of monsters at the same time.  All of the characters feel unique and useful in their own way, the mutation combination is brilliant making every run feel strategic and it never feels like you're getting unlucky if you make it far is beacuse of your pure skill!  Why the hell are you reading this? Buy this right now idiot!",
            "review_score": "1"
        },
        {
            "review_text": "Well, I'd have to start with the fact that this game is worth hours of fun, I would probably rate it 7/8 because it is a fun, fast-paced 3rd person shooter and has a great theme. However the multiplayer is painful and just unacceptably hard to do, for instance, I play on a mac and I still haven't found a good way for me to online, or even local, gamepad, or double mouse co-op. However, just because the multiplayer is bad doesn't make it a bad game. The controls are easy and appropriate for the game style. The characters are well set up, and it is fun to create lore for what could've happened before the apocolypse. All in all, it's a great game!",
            "review_score": "1"
        },
        {
            "review_text": "I tend to enjoy punishing games. Nuclear Throne is brutal (or maybe I just suck). I don't think I've ever enjoyed losing as much as I do when I'm dying in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game, because steam recommended it to me and cause of the good reviews, and i am happy that i bought this game.  This game is very good. There are many unlockable different chars to play with. My personnel favourites: the crystal and the telekinetic guy. The Crystal can block enemy fire with his crystal form. The telekinetic guy can, when upgraded, even push away the slow travelling plasma shots in the late game. Playing with the Steroids char with his double firepower is too very good.  In the final fight, don't destroy the final boss before having destroyed the 4 generators, to have the right game end.",
            "review_score": "1"
        },
        {
            "review_text": "A really challenging but fun game with awesome retro graphics and a variety of guns and characters",
            "review_score": "1"
        },
        {
            "review_text": "I feel like this games difficulty would be ok if it weren't for the randomness of a multitude of things that should never be based on RNG,which can ultimately decide if you live or die just based on luck.  The amount of times I've died to absurd occurances that had nothing to do with my skill just because I randomly didn't get what I needed is ungodly.  Vlambeer (The dev) Has for some reason decided to put black bars on the top and bottom and 'sideart' on the sides of the screen restricting the actual game to only around 80% What it should be.Leaving you open to being shot by extremely high velocity shots from offscreen with no warning killing you almost always  The portal is also a big issue because it can turn a great run bad instantly by sucking you in and even sometimes killing you by blowing up explosives around it therefore not allowing you to get ammo and other important things.Almost always in my experience dooming you to a quick death by spawning you in front of all the enemies with no cover anywhere allowing them to gun you down easily like a firing squad.  I still haven't even gotten to the end let alone beat it.  of course I do have to admit I play with a 60 Hz monitor which is definitely not recommended But still not the cause of any of what I have described here.  Ultimately this has been one of the most frustrating and disheartening experiences I've ever had the displeasure of experiencing and I do not recommend buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "Crystal is best rock.",
            "review_score": "1"
        },
        {
            "review_text": "if you want a nice cake this is it, only they put hot sauce in the cake mix,then throw in nukes,miniguns,and a shovle, i would recommnend this game to anyone if they are up to the task,  the guns. they are all good,some are fun and some are well bad, the foes. have a great ai, even the stupid *spoilers* birds or crows are good, at least world 1 is easy the boss's. the boss's are the best,my fav boss is *spoilers* a dog, but mostly get easy the more you play the upgrade's. they have a good balance to them, but some can be down right broken. *the reason why i played this --&gt; sleepcycles shout out to him* hope u liked my review. *if you think its funny or that you like it it would mean the world to me if u liked it,im not makeing you, this is my first review ",
            "review_score": "1"
        },
        {
            "review_text": "I watched ster 2 play this game for a couple days beforehand and decided I should be playing it.  I didn't regret that decision.",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is truly an amazing game. With lots of secrets to discover and things to unlock, the game keeps you coming back for more constantly. Pros and Cons below.   PROS:  -Fun gameplay -Good music -Interesting characters -The throne definitely exists -Replay value  CONS:   -Very hard -Lots of very difficult achievments -  Lil hunter    I would give this game an 8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "My god I love this game... In my opinion, its the perfect rouge-like game. Chaos, guns, mutations, levels... It has everything I like in a game. Secrets, unlocks, and trading cards came out on the full relelase of this game. I saw it at pax, and ever since it has sucked me into the addictive gameplay. I would give this game 10/10, the only con about it is that the game is very hard. Hard, but you keep coming back to it. BUY THIS GAME.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ GAME BUT I AM ♥♥♥♥ SO ITS PERFECT",
            "review_score": "1"
        },
        {
            "review_text": "If you like top down shooters and shooting a bunch of random things. Buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Crystal can shield",
            "review_score": "1"
        },
        {
            "review_text": "Better than binding of isaac, not as good as 1 weed.",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game. &gt;:(  11/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "STEP 1: Download Nuclear Throne Together  STEP 2: Activate Hardmode  STEP 3: /cwep guitar /bwep guitar  STEP 4: Play Steroids  STEP 5: ???  STEP 6: PROFIT!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good, I wish they took out the stupid looping mechanic with the genrators. Other than that, solid game",
            "review_score": "1"
        },
        {
            "review_text": "A game that teaches you how to shop at IKEA.    10/10 Would slaughter a bunch of people to yell at a chair again.",
            "review_score": "1"
        },
        {
            "review_text": "Help me,i can't stop playing",
            "review_score": "1"
        },
        {
            "review_text": "I have over 80 hours on this game; I still haven't taken the throne.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard.",
            "review_score": "1"
        },
        {
            "review_text": "I just wanted to leave a review as soon as I finished my first round of this game. I got to the third area or something, but the exhiliaration was extreme, and the experience was perfectly complemented by the soundtrack and graphic style. I can't wait to get into the rest of what this game has to offer!",
            "review_score": "1"
        },
        {
            "review_text": "Hard as nails, extremely responsive, ultra satisifying, super intense short-burst skill-based top-down rogue-like shooter. What's not to love? A+",
            "review_score": "1"
        },
        {
            "review_text": "It's really good. I can describe it as a top-down, twin stick (if you use a controller) shooter that is pretty challenging. People in the reviews exaggerate the difficulty a bit. But it is a very tough challenge. However it is an extremely fun and addicting one. One worth your money and time. Try to think of it as the difficulty and replayability of Spelunky matched with gameplay a bit similar to The Binding of Isaac. Highly recommended.  (Edit on 5/28/16) i just figured out that the game gets even better than the masterpiece it is once you unlock the character Steroids  9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game will throw you into a pit where once you kill all the enemys (which don't play around) a portal opens and you decend to the next stage.  whilst playing i found myself being torn to shreads by some of the most simplistic enemys, all because i was not prepared for there to be 15 of them.  tearing through the game as quickly as possible is on of the most funnest but most stupidest ways to play this. with such a limited amount of health and with enemys that do EXTREME amounts of damage it becomes a slaughter house if you don't prepare.  This game is thrilling and will keep you wanting more. but will make you rage like a russian 12 year old        CYKAAAAAAAAAAAAA",
            "review_score": "1"
        },
        {
            "review_text": "  The best ever rogue-like game i have ever played. The game loads quickly, and there is no manual reload button, which makes is player friendly, however the enemies are pretty hard to defeat sometimes, so that's there.   The game is pretty much bug free. I would love if this game had online co-op.  Also, the soundtrack melds so well with the scenery of the game.  Good job devs and artists!",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game so far, although I'm terrible at it. I really wish it was 16:9.",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is a bullet hell roguelike like no other: it is miles away from the competition. It takes just ten to fifteen minutes to complete the fifteen levels of a normal playthrough, allowing you to give it a run anytime you want. Beating the game is both challenging, rewarding, while not frustrating at all. That, plus the extra content will keep you busy for a few dozens of hours.  This masterpiece of the action roguelike genre will become one of your favorite games ever. It is devoid of filler: every second of gameplay is meaningful. Every detail helps to build the dystopian setting. Every single component reinforces the whole. Nuclear Throne is an endless challenge that never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game",
            "review_score": "1"
        },
        {
            "review_text": "This is a very challenging game and also the charactors are good and yeah i recomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Humanity may not have yet discovered time travel, but we do have this game, which is the next closest thing.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I've seen in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Great chracters, action and fun.",
            "review_score": "1"
        },
        {
            "review_text": "I have played a multitude of rogue likes, bullet hells, and overall difficult games so much that i know exactly what a good rogue like and/or bullet hell is supposed to be like and in all honesty Nuclear Throne has THE POTENTIAL to be among the greats. Now don't get me wrong there is a lot to love about this game the enemies, the lore which although isn't too obvious is still pretty easy to pick up on whether it just be from clues in the game or what HAS been confirmed, the mutlitudes of guns, power ups A.K.A. Mutations, and of course characters with their own unique styles of gameplay. With all of this being said though i feel i have to address the main issue of this game before i simplify it with a pros and cons list now like many of the players of this game i've been around since it first popped up on steam in early access and have been with it all the way. As the why that is important is because i've seen this game have it's problems, it's bugs, it's glitches, and it's crashes as well as seen drastic changes in some characters the main one being chicken due to her complete change in special power so in short i've seen how bumpy the road to where the game is now was and am happy to see the result.  But unfortunately even with this game out of early access i feel as though it should be made clear that the game developers in truth stopped caring about this game's fine polishing. Don't get me wrong for me i haven't encountered any bugs or major issues with the game on a very technical level but i have encountered several issues with certain gameplay aspects as well as functions within the game. The main issues shall be listed below so that you can read them each individually.  -The first final boss of the game 'The Throne' is by far more difficult than it's second stage upon looping as well as the absolute FINAL boss of the game to end any loop run the I.D.P.D. Captain. This issue comes from the fact that even with a hell fire of bullets being shot at you as well as many other forms of attack the throne 2 and the I.D.P.D. captain have a basic pattern which although becomes more challenging as the fight goes on is still a pattern that can be followed whilst the throne isn't like this at all. Instead of having just a set pattern it eventually get's to a point where there are so many bullets being shot at you that unless you have the jack hammer, Euphoria, Eyes' throne butt, or are playing crystal the chances of your success without having an incredibly powerful weapon in your arsenal are basically non existant.  -Enemy spawn points are possibly the NUMBER ONE priority of any RNG based game such as this especially when unlike other RNG based games this one drops you smack dab into the neck area instead of you walking through a door or what not. With this being said i'm not saying by any means they should put you in a protective cage then you leave when you feel like it but i have had a multitude of very good runs ended because i was placed in unwinnable scenarios. A prime and recent example of this is when i was play with melting who if you are not aware is the weakest character now i had strong spirit which prevents deathe once per level, rhino skin, boiling veins, euphoria, and hammerhead so i thought i would be fine. However upon being sent to the first part of the palace on a no loop run i had at least ten or so I.D.P.D. units spawn right on top of me now this wouldn't have been that bad had it been just grunts but the first three leading the charge were the shielding units so even if i did shoot my bullets would have come back to me and killed me anyways.  Now you might be thinking 'Oh well if you had a melee weapon you could have just deflected the bullets!' and that is true if i DID have a melee weapon i would've possibly been able to do something but because this is an RNG game where the weapon drops are random the only melee weapon i encountered in that run up until that point was the screwdriver and it's energy counterpart and even if i had take it let's be honest it would have done nothing so overall it was a good run ended by ridiculous means.  -Enemy Difficulty/Damage output now in regards to this issue it just feels like to me they're trying to establish mini bosses but incorporating them as regular enemies and that in truth is by far a terrible decision. First let me address the Assassin type enemy which is a purple bandit that wields a melee weapon and will pretend to be dead until you get close to it or something else occurs. Basically my main issue with this enemy in particular is just that it has too much going for it in it's favor yes it is in fact a weak enemy and is very easy to kill IF mind you you can hit it or even see it coming. You see the fact of the matter is they incorporated a somewhat stealth enemy which before looping is fairly easy to spot and yes i know when you loop it is meant to be harder but between dodging bullets, keeping track of nearly every enemy on the screen, and just overal avoiding death the fact that the assassin has such a high damage output, is fairly hard to hit with most weapon types, and can just easily sneak up on you in a hell storm of death is just not good design.  After the Assassin though the only other enemy in the game that isn't balanced is the Radiation dogs. Now forgive me if that isn't their proper name but they are a four legged creature you can solely encounter in the place before looping and much like the assassin they have too much going for them. I have had runs where i had scarier face, laser brains, and even if my weapon in question was not an energy weapon such as the hyper slugger or even the super slugger combo'd with scarier face seems to do almost nothing to them. In fact most of the time i find myself losing nearly have my ammunitions due to how tough this enemy is even with a mutation specifically meant to make things easier to kill.  Not only that but the when you combo their durability with how much distance they can cover in a single leap if you are put into a bad spawn or are forced into a corner by more than one you might as well just let go of the mouse and keys (or controller) and wait for death to occur.  -Damage inconsistencies are possibly the saddest thing i can't believe they've let slide for many a time i will have so much as five or six health and one bullet will take me down to either one or kill me out right. Now don't think i'm addressing ALL bullets such as the large orbs fired by the crown guardians and the throne i'm talking about the noraml type of bullet you most commonly see. Not only that but i've also at many points found that even whilst behind cover i suddenly die from an enemy who i clearly saw shot the cover but it somehow still connect with me which shouldn't even be there.  Now for the simplified Pros/Cons  Pros -----  -Original  -Good character variation  -Immense weapon variety  -Very challenging yet rewarding gameplay  -Unique connections to the characters and the world around them  -Multitude of ways the game can be altered A.K.A. the crown system  -Can basically be endless  -Lots of areas  -Bosses and Weapons that can only be accessed via looping  -Alternate versions of characters to unlock  -Alternate Starting weapons A.K.A. Golden Weapons  -Lots of fun and unique secrets  Cons ------  -Inconsistencies with enemy damage output  -Unwinnable spawns and/or enemy generation  -The first 'final' boss of the game is more challenging than those that come after it  -Certain enemies are too powerful  -Projectiles and other forms of damage can at rare moments afflict you when they shouldn't  Overall this IS a good game a fun one and a very cherished one to me as a lover of this genre of games however it feels as though the developers aren't really trying and they much like many others are substuting actual diffculty with just surplus.",
            "review_score": "1"
        },
        {
            "review_text": "I have more hours logged on this game than on all the others in my library combined, and I know I paid less for it than most. Don't miss this one! Compared to most other games, the mechanics are simple, but this game gives you a lot of leeway when it comes to playstyles. In my opinion, this is the formula for a great game. Look at minecraft, released seven years ago, it still has a HUGE playerbase! Creativity is encouraged in a world with simple rules and bright colors. Now, this game is a lot harder than Minecraft; you'll die a lot. That said, I've never been noticably frustrated by dying in this game. The game can go on forever if you know how, so dying is almost always the way I conclude my runs. The game is also very attractive through it's punchy audio and bright, fast graphics. Nuclear Throne is almost as fun to watch as it is to play.",
            "review_score": "1"
        },
        {
            "review_text": "I keep wanting to play this game even though its really hard. Really fun, especially with a friend, but just incredibly hard also.",
            "review_score": "1"
        },
        {
            "review_text": "Why is there no medium-sized boss?",
            "review_score": "1"
        },
        {
            "review_text": "This game is tons of fun; everytime i sit down to play for an hour, i wind up playing for three. ^_^  The action is quick, the guns are balanced well, and the characters are interesting and varied. You can run through the whole game in 20 minutes, but you almost never will. It is brutally difficult, and you are constantly on the verge of death, but the game is fast paced enough that death is never a setback. It plays, sort of, like a simple and quick diablo clone with guns and explosions, but without the tedious equipment management.  The game promotes itself as being 'roguelike' but, frankly, i dont think the comparison is accurate. It has procedurally generated levels, yes, but it takes alot more than that to fulfill the criteria, if you ask me. Still, whatever you want to call it, it scratches that itch, and a few others.  Very much worth the cost, i would pay twice as much as this, and i absolutely recommend it. DONT PASS IT UP!! :D",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear Throne is a fantastic game. A rogue-like, bullet hell, critical thinking game is brilliant. Especially the lore, the gameplay, the characters, they all fit together. Although I think where this game really shines is a mod known as Nuclear Throne Together. This is the same thing as Nuclear Throne, but with online multiplayer. This game is a ton of fun, and with NTT, it only gets better.",
            "review_score": "1"
        },
        {
            "review_text": "I got hooked on this game the moment i started it .. this is freakin awesome and i just wanted to keep retrying every time i died. Its just one of those games that you just cant help not to go back and try again..   Graphics are pixelated but i dont even care this has to be the best pixel game i have ever played along side   Dungeon of the endless  ",
            "review_score": "1"
        },
        {
            "review_text": "Oh My God. This game the inbodyment of The Sun God Applo.",
            "review_score": "1"
        },
        {
            "review_text": "if this game wasn't so difficult it would be the perfect symbol of American patriotism with all its guns, nukes and police brutality",
            "review_score": "1"
        },
        {
            "review_text": "  Excellent videogame. Just play it",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun rougelike for a cheap price. Starts hard but you get used to it. I also like all the character designs and their abilities.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, its weapon systems are so well balanced and everything is done so well. you can tell a lot of love was put into this. 5-1 is impossible tho",
            "review_score": "1"
        },
        {
            "review_text": "In the words of Mad max, You Live, you die, You live again!  What a game, what a lovely Game!",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't sure if I'd like this but there is no way I'll turn down a good rogue-like that reward skills.  I love playing different characters, different guns, different skill builds.  I just love struggling to survive and keep restarting to try to go further.  Addicting shooter rogue-like!",
            "review_score": "1"
        },
        {
            "review_text": "Legit. Sometimes everything must die.",
            "review_score": "1"
        },
        {
            "review_text": "Never use the disc gun",
            "review_score": "1"
        },
        {
            "review_text": "This game significant looked over in my opinion. The Binding of Isaac gets a whole lot more attention and praise than this game. This game is SIGNIFICANTLY better than Binding of Isaac and just about any difficult or bullethell game there is on steam for that matter. this game is absolutely fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "This games as made me want to tear out my own gut. But at least I chose the double stomach mutation.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Easy-to-grasp controls and mechanics -Throne-Buttloads of weapons -Every character is unique in their own way -Tons of post-loop content -Music is simple but fitting; doesn't overstate what is actually happening -Addition of Dailies and Weeklies allows for at least semi-regular fresh play  Neutrals/Subjective: -Difficulty curve can seem kinda ridiculous to newer players -Most weapons become less useful late-game, so the amount of 'useful' weapons is almost certainly less than the full list -Not every character is 'as good' as the others -Balance in general may seem kinda wonky to some -Art style may not appeal to everyone -Much of the 'post-loop' content is mostly just unlocking golden weapons, crowns, B-skins, and getting to as high of a loop as possible -While randomly generated, levels have similar elements and patterns that can make things feel samey.  Cons: -Seems that the console versions (and some people's PC versions from what I've heard) are fairly buggy, and patches aren't all too frequent. If you find bugs, you may have to deal with until it becomes a big enough problem that Vlambeer fixes it next patch -No 'native' modding support for current version (This is because of the version of GameMaker it runs in, which at this stage is not decompilable). You'll have to revert back to beta 19 to mod. -Controller controls, while definitely playable, are definitely not as good as keyboard/mouse (this falls a little on the subjective side, though)",
            "review_score": "1"
        },
        {
            "review_text": "  This game harder than my d1ck :(",
            "review_score": "1"
        },
        {
            "review_text": "Soundtrack [10] Gameplay [9]  History (yeah this game has history) [9.5]  Rage (especially when you die on 1-3 in daily) [100]  Final Grade [9,65]  'The Struggle Continues...'",
            "review_score": "1"
        },
        {
            "review_text": "one of the best Indie games on the market",
            "review_score": "1"
        },
        {
            "review_text": "Rogue-like dungeon crawler that has a good bit of difficulty on it's side. I suggest playing it if you have a low sodium meter and need to refuel it.",
            "review_score": "1"
        },
        {
            "review_text": " Nuclear Throne  is the perfect  twin stick shooter / rogue-like  with tons of unlockable weapons, upgrades and cleverly designed characters. Awesome music, great atmosphere and well crafted pixel graphics combine to make an addictive game that constantly reveals more depth as you progress.",
            "review_score": "1"
        },
        {
            "review_text": "Ever heard of the phrase 'give me a reason?' This game is your reason  10/10 would die again and again and again and again and again and again",
            "review_score": "1"
        },
        {
            "review_text": "This game doesnt have some super-good graphics and all that, but it totally compensates all that by the fun element of it! SOOOO MUCH FUN!",
            "review_score": "1"
        },
        {
            "review_text": "Dope Game eventhough i takes awhile to actually get good and is rage inducing",
            "review_score": "1"
        },
        {
            "review_text": "Your b hole will tingle and resonate pure joy",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and I reccomend it for people who play top down shooter games. The game is really fun and the characters are really cool. This is a great game considering its price and I strongly recommend purchasing it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Indie Masterpiece! This 2D Shooter is very simple to learn but hard to dominate. The inside story is mysterious and blurry. Each character has his own powers multiplying the fun and the gameplay hours. If you’re a Hotline Miami fan, then Nuclear Throne is a “MUST HAVE IT” game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game from Humble Bundle Monthly and oh boy it is a treat. I think the king of roguelikes is still the Binding of Isaac Rebirth, but this game is definitely a prince. Fast paced combat with weapons that handle completely different, amazing sound design, good pixel graphics, it is awesome. It is really hard though, a lot of projectiles to dodge sometimes and health can be scarce. All in all great challenging game, glad I got it.",
            "review_score": "1"
        },
        {
            "review_text": "Best keyboard, mouse break simulator ever.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect game when you feel you're up for a challenge. You can complete a run in less than 15-20 minutes. Nuclear Throne has a lot of unpredictability due to level maps being procedurally-generated, varying enemy numbers, random power-ups and a huge amount of weapons. Gameplay can sometimes require very abrupt changes in pace. For example, you are forced to be patient, if the currently-generated level has a chokepoint somewhere and a lot of enemies after it. If you rush, you're as good as dead. On the other hand, there are a few enemy types that can spawn other enemies and if you don't kill them as soon as possible, you will either be overwhelmed or you'll run out of ammo.  The music gives a western vibe and helps immersion, but you shouldn't get too sure of yourself - after acing several levels, you can very quickly find yourself barely alive on the next. There are places where you can hardly see where you're going and you never know what's behind the next corner. The perfect illustration of how harsh the environment can be and that everything is out to get you is that even the ammo chests bite sometimes. It must be a coincidence that it usually happens when you barely have any HP left.",
            "review_score": "1"
        },
        {
            "review_text": "So much to unlock, every game is unique, FUN AS HELL, intensly difficult, IT'S A GREAT WAY TO PASS TIME, neverending fun, unique and fun characters, cool lore, hundreds of hours of gameplay... These are all reasons that you should buy this game. I really really really recommend it, if you love rogue-likes and haven't tried this game out yet.  There's hundreds of reasons I'd recommend this game, and I can only think of one thing that I don't like too much about it: and that's that the story isn't really told to you in the game, and there are some completely random and overly specific ways to unlock certain characters, both of which require you looking up online. However, there is a great online NT wiki that explains everything for you, which as long as you have an internet connection, fixes this one con.  Basically, it's a damn good game. Get it",
            "review_score": "1"
        },
        {
            "review_text": "I think this might be the only game I paid full price for. Totally worth it. Perfect execution of the action shooter model, fun art/vibe, and enough randomization and perk/leveling to keep it pretty fresh. Great adrenaline rush, 'get in the zone' kind of game.",
            "review_score": "1"
        },
        {
            "review_text": "This game quickly became one of my favorites of all time. Vlambeer is a great company that makes great games and Nuclear Throne is no exception. This game includes 13-14 playable characters, 100+ guns, 10+ areas, and much more content that will keep you playing this game for hours",
            "review_score": "1"
        },
        {
            "review_text": "One of the most enraging games I have ever played. But it was absolutely worth it..",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games out there.Fast, Fun, well made.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games to play with friends on the couch. Best Humble Bundle purchase I've made in years",
            "review_score": "1"
        },
        {
            "review_text": "Get this game if you want to know what people mean by 'good game feel', when you start the first round and get to shoot some baddies you can tell by the way the gunz behave that this game is special. Even if you dont like these kind of games atleast try it you cant go wrong for this price! The whole package is well rounded with much to do and balls to the wall action that gets you blood pumping and your heart beating! i cant recommend it enough!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game both in Single player and Co-op (Mod). You really should try to get the Co-op mod this is a lot of fun with friends!",
            "review_score": "1"
        },
        {
            "review_text": "I've played more than 300 hours of this game online, and even more offline.  I've gotten the indie box for this game and despite paying 40 bucks and having the game allready I was not dissapointed.  But honestly its really good, everything is fast. So much so that one time due to a problem making my current pc despite having the game at about 50% higher speed I still was able to loop.  You can pop in for a single run, and hardly be waiting for the game to load. At worst it could take you 2 minutes at best 30+.  I would suggest this game for anyone that enjoys the Binding of Isaac or Enter the Gungeon that also wants to have a faster game to play.  Have fun, and remeber. Lill' Hunter is a pain in the butt.",
            "review_score": "1"
        },
        {
            "review_text": "Yo, this game is baller.  Finely crafted roguelike action. It'll start you off slow like any roguelike, but the build up is good and once you've got the basics down the game is a hoot to replay.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game? Well the farthest I've ever gotten is loop 2 so I'm not that good but this game is a blast to play, especially with the co-op mod. Just buy the game already!",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. Even though I'm really bad at bullet hell games like this, its still amazingly fun. If I die, I just get more determined to get further!",
            "review_score": "1"
        },
        {
            "review_text": "Difficult but very good game with a high replay and 'come back' value, recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A super fast-paced rogue-like indie game that will blow your ♥♥♥♥in mind.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME RULES SO HARD  -very challenging -variety of weapons/guns -different mutations to choose from each time you play -cool enemy types -PERMADEATH + PROCEDURAL LEVELS (take it or leave it) -cool soundtrack -2 player local co-op  --you can literally run around as a chicken with your head cut off 11/10  EDIT: Post- Early Access game rules even harder, no complaints.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME RULES SO HARD  -very challenging -variety of weapons/guns -different mutations to choose from each time you play -cool enemy types -PERMADEATH + PROCEDURAL LEVELS (take it or leave it) -cool soundtrack -2 player local co-op  --you can literally run around as a chicken with your head cut off 11/10  EDIT: Post- Early Access game rules even harder, no complaints.",
            "review_score": "1"
        },
        {
            "review_text": "You must add a online feature to this. It's not fair how PC players can only play online with the mod. You'll make a lot of money for adding online features.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games ever &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Its an amazing game , Fun if you're good at it , it makes you rage at the start but over time you will get happier , the only thing that its missing is more charecters DEVS PLS :^)",
            "review_score": "1"
        },
        {
            "review_text": "I love this game with a passion &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "addictive non-stop action with a good ost.",
            "review_score": "1"
        },
        {
            "review_text": "I love Rogue like games. They are some of the most intense, engaging, and high-tension action games there are. Unfortunately good ones can be hard to come by. I was at first turned away by the strange setup and cartoonish characters, however I quickly grew past it as I began to play. I have played many rogue-likes such as Risk of Rain, Enter the Gungeon, and Realm of the Mad God. This game is by far the best rogue like I have ever played, with its amazing replayability, multitude of weapons that make you feel like a badass and cool character abilites. Each character gives a new ability that augments the base playstyle quite nicely. They do not drastically affect the gameplay but change it just enough to be interesting and fresh. Additionally, if you are looking for a big change in the game, or greatly increased difficulty, never fear, for there are many different modes for that. In conclusion if you are a fan of Rogue-likes, this game is a MUST HAVE. On the other hand if you have never tried Rogue-Like's then this is the perfect game to get started with.",
            "review_score": "1"
        },
        {
            "review_text": "it's the nutshack",
            "review_score": "1"
        },
        {
            "review_text": "Got to the level before the nuclear throne and died. Best game I've ever played 10/10 never beat it.",
            "review_score": "1"
        },
        {
            "review_text": "You mean to say you don't have this game already? Wtf, dude, get playing!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece. Utilising an intelligent levelling system and perk layout, Nuclear Throne never feels like a waste of time.  The gunplay is superb and you never feel overpowered or at adisadvantage, while still allowing for both frightening battles of survival and massacres of triumph. The variety of weapons also allows for different encounters, forcing player to adapt to the firearms available.  Each character's passive and active skill fit differently into the game, immediately refreshing stages and putting a new spin on a run. While no character is outright stronger than another, their abilities allow them each to dominate a certain situation.  The implementations of Mutations, which allow players to choose from a set of four perks after they level up, allows players to continue having a chance against stronger and stronger foes. Proper choice of Mutations is important, since you only get a certain amount.  Overall, I feel as though I have only begun to scratch the surface of the game, and feel that there are many more hours of enjoyment waiting. This game is a gem, and I would buy it again in a heartbeat. It even has co-op!",
            "review_score": "1"
        },
        {
            "review_text": "When I get great mutations so i can destroy more undertales",
            "review_score": "1"
        },
        {
            "review_text": "Pros: * You can play as the Illuminati * You use glowsticks to level up * Good cross-platform support * Ultra mutations are interesting and unique, but still useful (I'm looking at you, MOBAs) Cons: * Multiplayer is incomplete, and needs a mod to be used on a network 9/10 Would not reach the Nuclear Throne again",
            "review_score": "1"
        },
        {
            "review_text": "You did not reach the Nuclear Throne.",
            "review_score": "1"
        }
    ]
}