{
    "app_id": 242700,
    "name": "Injustice: Gods Among Us Ultimate Edition",
    "release_date": "2013-11-29",
    "developer": [
        "NetherRealm Studios",
        "High Voltage Software"
    ],
    "publisher": [
        "Warner Bros. Interactive Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Fighting",
        "Superhero",
        "Action"
    ],
    "achievements": 50,
    "positive_ratings": 8793,
    "negative_ratings": 1473,
    "price": 14.99,
    "description": "Injustice: Gods Among Us Ultimate Edition enhances the bold new franchise to the fighting game genre from NetherRealm Studios. Featuring six new playable characters, over 30 new skins, and 60 new S.T.A.R. Labs missions, this edition packs a punch.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/242700/header.jpg?t=1545176902",
    "minimum_requirements": "OS: 32-bit Windows 7 / Windows 8 / Vista Processor: Intel® Core™ 2 Duo 2.4 GHz or AMD Athlon X2 2.8 GHz Memory: 2 GB RAM Graphics: NVIDIA® GeForce™ 8800 GTS or AMD® Radeon™ HD 3850 DirectX: Version 10 Network: Broadband Internet connection Storage: 21 GB available space Additional Notes: Windows XP and DirectX® 9.0b and below not supported",
    "recommended_requirements": "OS: 64-bit Windows 7 / Windows 8 / Vista Processor: Intel Core i5-750, 2.67 GHz or AMD Phenom II X4 965, 3.4 GHz or better Memory: 4 GB RAM Graphics: NVIDIA® GeForce™ GTX 560 or AMD® Radeon™ HD 6950 DirectX: Version 11 Network: Broadband Internet connection Storage: 22 GB available space Additional Notes: Windows XP and DirectX® 9.0b and below not supported",
    "reviews": [
        {
            "review_text": "The game is geat, this port isn't.  Stop hiring High Voltage for these travesties, they're behind so many bad ports and HD editions that it's not even funny. From Zone of the Enders HD to the horrors of MK9 and MKX, they've botched every port they touch. Low framerate, bad performance on machines that should handle them perfectly, and arbitrary glitches.  Get out.",
            "review_score": "-1"
        },
        {
            "review_text": "Online play don't even work on Steam. High Voltage did a horrible job for the port. That critical problem have been there since day 1 of the release and absolutely nothing have been done yet even if there are legions of players on the discussion forums that complain about not having access to the main feature of the game.   This game do not deserve a single of your penny.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like singleplayer fighting games, go get it! It sure is one of the best fighters I played in years. Same applies if you just want to do local matches. If you want to play online on the other hand, avoid it like the plague, go get the console version instead. The online barely works, if it works it is great but the chance you'll get a decent match is like winning the lottery. Around 90% of the matches end up in a terrible lagfest (also, if your opponent has a crappy PC the game goes slowmo) or you can't even connect or the game abruptly ends telling you, 'the game session is no longer available'. Get the 360 version instead, I played it and it works flawlessly online there.",
            "review_score": "-1"
        },
        {
            "review_text": "A very well done fighting game! Has all the things you expect in a 2D fighter with its own twist to things. Great characters, story, graphics, and runs well. Many people have had internet connection problems with the game, but these can be kinked out by the developer.",
            "review_score": "1"
        },
        {
            "review_text": "Joker shot me with a rocket launcher and set me on fire. Ten minutes later, Bane broke my back. And Lex Luthor shot me with an orbital laser strike.  10/10 best way to die",
            "review_score": "1"
        },
        {
            "review_text": "  Netherrealms Studios did Justice to us by releasing this Injustice  :D",
            "review_score": "1"
        },
        {
            "review_text": "If you are in for multiplayer, do not buy this game. It does not work. Great game storywise",
            "review_score": "-1"
        },
        {
            "review_text": "great fighting game. the story was very good and well put together. I really enjoyed it. make sure to learn about how to tweak the game to work well on pc (i.e. the solo practice trick to fix the framerate).",
            "review_score": "1"
        },
        {
            "review_text": "****WARNING HUGE LAG AND SERVER ISSUES****  If like me, you are about to buy this game in order to go online with a friend and pummel each other with our favourite DC superheros; be warned. I have never encountered so much lag and poor online support for a game in my life, servers are clearly not managed well causing a very frustrating online experience and thats even if you get to be in a game....  BUT, The actual gameplay of this game is pretty damn good, just what you would expect from the creators of MK leading to some satisfying violent fighter game. The story also was pretty good and if any DC comic appreciators like me play it then they will be walking away satisfyed with the story.  All in all, I would reccommend buying this game on a console in order to get the full package as this PC port has obviosuly not worked out. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "On Consoles this game is a guranteed 10/10, but not on PC, this game is in constant extreme lag, multiplayer is almost impossible to connect too, and if you some how manage to get into a match it automatically disconnects for no reason, mobile unlocks going both ways won't connect even when your appearently logged into both, when ever I try exit the game it freezes and no matter what you do you won't be able to leave until you restart the computer, which doesn't save your progess if it doesn't auto save which happens quite a lot, even though I love this game I can't recommend it for PC because it's just not worth it even when its on sale for $4.99 and especially when it's $19.99 if you have a console I recommend you just get it on that",
            "review_score": "-1"
        },
        {
            "review_text": "I good game, its just this PC port is horrible. Constant framerate issues making the game unplayable, game breaking bugs and unresponisve controls. Overall don't get the game on PC get it on a console because this port is on the bad end of gaming",
            "review_score": "-1"
        },
        {
            "review_text": "It's good. It's really good. Injustice is without doubt one of the best fighting games I have ever played, next to Mortal Kombat and Soul Calibour. What Injustice does well... is mostly everything. It has very good graphics, tight controls, many playable characters from whom every single is different, several arenas, most of which have two stages each, and I could not even tell if it was a console port. Most heroes have several different outfits, which is good in most cases, but looking at Teen Titans costumes for Raven and Cyborg I didn't find them similiar in any degree to their cartoon counterparts. And I kind of missed a Starfire character. On the other hand there is a version of Batman that wears a Russian ushanka, and there is Superman skin with a hammer'n'sickle emblem on his chest, and that is just plain awesome. Every character also has their own exclusive super move, or whatever it is called, which is a counterpart of the X-ray moves from Mortal Kombat. So in addition to pummeling the crap out of his foes, Batman can run someone over with the Batmobile, and Joker can blast someone with a bazooka, which I have no idea where he keeps.There are several game modes for singleplayer, which will keep you playing for a long time. There is story mode, classic battle and lots of its variations, and S.T.A.R. labs, which consists of lots and lots of minigames and small quests. Overall, this game has some minor flaws, like the completly redundant clash mechanic, or rare issues with attacks ghost range, but it is still solid and fun fighting game. But there is one thing that keeps it from ranking higher, at least in PC version, and it is the multiplayer mode. It sucks. It sucks so bad...I didn't even have a chance to play it. Seriously. You can wait for an hour and not find a single (!) match. And it is not even the game's fault. It is just that nobody plays it, which makes me sad. So, for the love of all gods, buy this game and play it, because for now, from my experience, about 20 people own it.   Injustice: Gods Among Us gets my eight points out of ten.",
            "review_score": "1"
        },
        {
            "review_text": "Netcode and hardware requirements are pretty terrible. There are consistent updates to attempt to fix these issues, but from what I've experienced so far, they have quite a bit to go, so far it is largely unplayable, and online the netcode sacrifices input accuracy for a smoothness in gameplay, which if you play fighting games to any capacity, you'll find failing combos when should have totally linked them. Stay away for now, go buy Skullgirls instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I love heroes. I love fighting game. That's why I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great fighting game like mortal kombat, with plenty of charaters to choose from, love the cut scenes and special moves, if you love superheroes i would recommend this game...",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth getting. The combat was designed well, the story is great, has almost inifinite replayability, and gives me lots of feel goods. I think that about sums it up.  I mean, I don't play fighting games, and I don't know much about DC, but this was amazing.  (Do note though that the multiplayer is EXTREMELY broken)",
            "review_score": "1"
        },
        {
            "review_text": "Did not intend to play a fighting game for the story, I just wanted to beat up superman again, and agian. I got both. Honestly could not be happier. This is a steam sale must buy. This is a hard-hitting fighter that plays to the hardcore crowd. Its creative use of background objects coupled with satisfying fighting mechanics make it both fun and distinct from it the crowd. Did I mention you can beat up Superman?",
            "review_score": "1"
        },
        {
            "review_text": "This game hasnt any support and it has a lot of bugs. Developers are just hidding and they dont do anything to improve it.",
            "review_score": "-1"
        },
        {
            "review_text": "Based in the DC universe, this is the perfect Beat'em-up for comic fans. The gamepay is a bit different from e.g. Martal Komabt or Tekken, but you will get used to it in no time. The only real problem is the pretty short story, but because it is more of a multiplayer game that doesn't really matter. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game because of the hours of fun i have had playing it but however some of the things like the online matchmaking has let this game down because on the consoles it has a great online features (But it could just be my high ping rate). Also there are minor problems like the speaking for some of the DLC character will carry on after there mouth has stopped moving. However the story is very good and has a good plot after you get past the understanding of what happened. I would recommend it even with some of its faults. GREAT GAME!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "if you like DC comics you must play",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer is dead,  still fun solo.",
            "review_score": "1"
        },
        {
            "review_text": "Stupid a$$ folks that made this game suck and the support for it is even worse! Fix the netcode and then maybe I'll play it again. Ha, like that will ever happen!",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game for any fans of DC and competitive fighting games. I personally would have prefer a beat 'em up or something like that but I must say that It is a fine game. There are enough characters despise there could be more. The characters are pretty neat to play even If I find it kind of slow, unlike Street Fighter or even King of Fighters which are faster. The stages are pretty good, they have their transitions (moves). I prefer DC over Marvel but as a fan of both universe, a Marvel game like this one (with a faster gameplay) would be really great (so prety much capcom vs marvel for PC and just the universe of Marvel but with a lot more characters), there are lot of characters that would be nice to use such as the Spider-man, Venom, Juggernaut, Green Goblin, Carnage, Dr. Octopus, Rhino, Deadpool, Iron Man, the incredible Hulk, The Wolverine, etc etc... Anyway, to get back to the subject, this is a good game that I would suggest to any fans of DC and competitive fighting games such as Street Fighter, Mortal Kombat, King of Fighters, etc.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Got this on sale for five bucks, hell of a deal. I'm not a huge fan of the Mortal Kombat-style fighting game--in fact it's probably my least favorite of all the fighting games--but as a fan of comics and fighting games in general, I couldn't resist with the price tag.   PROS:  - Great selection of fighters.  - Fighters generally seem balanced and fairly easy to learn within a couple fights.  - Solid gameplay--hits land where they should.  - Cool story mode (bro).  - Great voice acting, and there are specific voiceovers for clashes between two characters (even themselves), always a nice touch.  - Special moves/ultimates are a blast to perform, albeit easy.  CONS:  - Maybe it's just me, but I don't like this 'wager' system. When you or your opponent initiate a clash, you each 'wager' a certain amount of your energy bar then rush at each other and whoever 'wins' the wager does damage to the other, knocks them across the stage, and regains a portion of their health, I think it's up to 30%. So for example, let's say you just burned your ultimate on your opponent, which requires 100% of your bar and drains it to 0%. Your opponent still has 100%. Now they can initiate a clash and basically get all that health back for free just by punching you across the screen, and you have no way to stop it because, since your energy is 0%, you can't wager. Not a fan of it, but if this is what they call 'balance,' okay, whatever.  - Controller is too sensitive. I find myself jumping when I don't want to be more than half the time, and some combos that require directional input are way harder to pull off than they seem, partly due to the controller sensitivity and partly due to how rapidly you have to press the buttons in order to combo.  - Speaking of which, that. Maybe this is specific to this type of fighting game (and partly why I don't like it), but combos don't feel like they're being performed in 'real time,' rather that you're sort of quickly ordering a combo and then it occurs. But if you press the buttons at the same time the attacks actually happen, it doesn't combo. Doesn't sit right with me.  And this isn't a pro or a con necessarily, but the story mode is a bit easy, at least to me. Soon as you learn a combo and a projectile for a character it's pretty trivial. Maybe I haven't gotten far enough for it to really get difficult.   Overall, worth checking out, definitely worth a buy on sale, or if you're a fan of the Mortal Kombat-esque fighting style.",
            "review_score": "1"
        },
        {
            "review_text": "Overall score: 9/10 Pros: Entertaining story, excellent cast of fighters, superb voice acting, well animated, easy to control, and well balanced.  Cons: Since every hero only has one, super moves become repetitive after awhile. More variety of moves would grant this game a perfect 10.",
            "review_score": "1"
        },
        {
            "review_text": "great fun for playing with friends online in a skype call only downside is that there arent a lot of people online 8.5/10 NOTE: way easier with a controller then keyboard Thanks for reading",
            "review_score": "1"
        },
        {
            "review_text": "I really like fighting games, I like fighting games so much that I built an arcade cabinet to play fighting games with real arcade joysticks and buttons. That being said, I think this is a good fighting game. It isn't the most balanced or have the deepest fighting system, but it is a lot of fun. Being able to throwdown as Batman or even Aquaman makes it awesome. I was really excited when this came to the PC and aside from some keyboard configuration issues (fixed with VJoy) and performance issues I haven't been disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Great fighting game, made by the same guys who made Mortal Kombat Komplete. It's a fighting game, but with superheroes. Has a solid story mode, and multiplayer is pretty sweet. The moves are a bit deceptive because it feels a little Street Fightery (hold back to block), but a bit Mortal Kombaty (both triggers to use your super), yet the attacks feel a little unique to this game.   There isn't really any 'rounds', but you do have a double-life bar which breaks into two 'sections' and the loser still has to take down the winner's remaining life from his first 'section'. This works pretty well, except the timer for multiplayer games is on 99 seconds to kill off both 'sections' from your opponent - which is usually only enough for a single round, and doesn't reset in this game. This is the game's low point, so you have to win fairly quickly.  In multiplayer, you can press start just before the round begins and during supers (or anytime, at your own risk - the game continues) to get a 'quick reference' on your special moves, which is a very, very welcome addition for choosing characters you've never played before. Getting a quick glance at 'down-forward-X' 'back-forward A' is a huge help, even if you don't know what that move does.  There's a good tutorial that'll get you rolling pretty quickly, and the newer players that pick up this game seem to have a knack for killing the experienced players in the first game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know of a better fight game then Injustice. The greatness of Mortal Kombat incorportated in the DC Universe. The ability to play as such a wide variety of your favorite villains and heroes makes this game so great. As far as the story goes I would definately say that it is quite entertaining. With impressive cutscenes inbetween fights to help mix things up a bit, the story mode is something that could be played a couple times and still be able to enjoy it. Keep in mind of course that this is still a fight game, and like all fight games, you will lose interest after a while. But I can honestly say though I'm not as devoted to the game as I used to be. I still play it probably once a week just because it really is that fun. The multiplayer in it is also a great feature in which you can enjoy playing on the same computer with a friend (a controller or extra keyboard is recommended) or online. This game will always be a challenge and something in which you can definately get your money's woth out of.",
            "review_score": "1"
        },
        {
            "review_text": "It's the best MK game so far. New characters to learn move sets and hit detection for, and the story mode doesn't feel like a tacked-on 'play this character that noone in PvP likes' gimmick. Good story, if not a little stale as DC loves to trot out multiple universes anytime they want to do something edgy with a character or two. The dlc characters are fun (you WILL kneel before Zod) and getting this game on a crazy sale these days is pretty easy. And pretty much a no-brainer. If you like to fight, get the game. And a controller.",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice take on an arcade classic figthing games. I like the gameplay break down and the pace of the game, the over all quality of the textures and graphics are nice. Playing combos trying to feel like Joystick Jesus. I would never buy this game full price. I picked it up when it was on Steam Summer Sale a year back. People still play but the community is all hardcore players. You would be better off trying to play something else if you didn't have a nack for arcade figters.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad overall.. Slowdown can be a bit annoying in the single player, but I've enjoyed this game if you want a good solid beat em up.",
            "review_score": "1"
        },
        {
            "review_text": "If you like DC play it!  If you like MK style play it! If you like being Batman play it! If you can't play MKX because of your poor pc play it!  BUY THIS GAME! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Simply Excellent.  The best is use the console edition to release new resources in the mobile edition and the same back.  I really like a lot this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game was actually a good bit of fun, but I'm a bit disappointed that I beat the story mode in 4 hours... while cooking dinner.",
            "review_score": "1"
        },
        {
            "review_text": "Nice fighting game, for those who love DC comics :&gt;",
            "review_score": "1"
        },
        {
            "review_text": "I was so excited to play this game but it starts to put a bad taste in your mouth with the horrific key selection for the keyboard, like 'push 4 to select, 6 to cancel, S to edit field' then once I got the hang of them, they change on the next page, then change back on the following. The mouse doesn't work on the menu either.   After I got over that, I finally went to the gameplay. I loved the gameplay on android and was hoping for similar, but it just felt like a clunky Mortal Kombat. It has less moves then MK and less gameplay selection.  I just can't recommend this because I played this once and will never play it again.",
            "review_score": "-1"
        },
        {
            "review_text": "When inter online it crashes",
            "review_score": "-1"
        },
        {
            "review_text": "Just beat the story. If you like fighting games you should pick it up while it's on sale. Probably the best story I've ever seen in a fighting game (not saying much, I know) Couldn't find a game earlier, but over 2000 ppl in game. Maybe I'll try some more.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!  Cons: - since game is ballanced, it is strange that Batman or Green Arrow take a punch from Superman, Wonder Woman or Doomsday and just shake it off - I don't find that many players online anymore Pros: - everything else:  . ballanced  , superheroes  . storymode  . training room  . missions  . single play against computer or play local against a friend or play online agaisnt random oponent ",
            "review_score": "1"
        },
        {
            "review_text": "Is game fun?  Yes.  Is game dead?  ...also yes....   Man I wish I picked this up earlier. Now I can find LITERALLY no one except me playing this now. I sat in the game finder for around 30 minutes, and nothing. Oh well, at least the bots are competent. Sort of.  Get your friends this game also, so you can actually have fun.",
            "review_score": "1"
        },
        {
            "review_text": "So glad I got this game whilst it was on deal on the Steam summer sale! Been wanting to play this game for a while and I'm glad I waited. Very nice visuals and graphics, engaging storylines which weaves in the characters nicely, Nice sounds and voicework, overall epic fast-paced action! Haven't completed the game yet but from what I've played, it's a very well invested purchase. Would definitely recommend! :)",
            "review_score": "1"
        },
        {
            "review_text": "best Fighting game on steam right now, graphic 8/10 story 7/10 batman vs superman 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Superman unloaded a fish tank in Batmans face would play again.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, needs graphics update though.",
            "review_score": "1"
        },
        {
            "review_text": "I don't play fighting games very much. I liked Mortal Kombat and Street Fighter from back in the day, but I was that jerk who always picked Blanca and then spammed his forward roll. I found this one pretty accessible, and a lot of fun. The characters have some great special moves (Batman can summon his Batmobile to run over his opponent, for example) and the arenas are full of interactable objects. The single-player eases you into it and tells a little story as you move along. It's good fun, it's forgiving of newbies, and it gets a thumbs-up from me.",
            "review_score": "1"
        },
        {
            "review_text": "Take the satisfying gameplay from MortalKombat and throw in super Heroes/Villans and Injustice is what you get, it improves on every aspect of mortal kombats fighting system and each character feels unique.    One of the best fighting games to come out in recent games but just as MK9 it is quite unbalanced but offers some very entertaining game modes.   9/10.   Tip: Played best with Controller/Fightstick",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY. The game is broken on pc. Slowmotion fighters are not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would play again graphics could use a lil work tho",
            "review_score": "1"
        },
        {
            "review_text": "Worst fps ever not even COD. This game includes no knives except its copy, the kitchen knife weilded by salmon chundy. Deathstroke is o.p. he's the only character who can quickscope and noob tube. The worst character is aqua man, he is utter ♥♥♥♥ and any one who picks him should be murdered in front of his family. Rhino/10 pretty good",
            "review_score": "1"
        },
        {
            "review_text": "this game if F@#king awesome, at first i tought that is just another mortal combat based game, but it is so much more awesome =D",
            "review_score": "1"
        },
        {
            "review_text": "This was a pretty satisfying comic based fighting game. The graphics were slick, the levels well detailed and even interactive, and the fighter roster was brimming with most of my favorites. Add in a pretty competent fighting system and tons of unlockables for the characters and you got one of the better DC based games, forget the fact that it's a fighting game. The story came together incredibly well and felt like a complete 10-20 issue story arc. The best part was that it was structured in a way that you swapped out fighters to progress and this swapping played into the cohesiveness of the story, which is something seldom done well in a fighter. My only quibble is the terrific buildup of tension and amazing moments punctuated by a rather anti-climatic or boring conclusion. In this case the journey is far greater than the destination.",
            "review_score": "1"
        },
        {
            "review_text": "It's mortal kombat, but not. More like a mortal combat that if flashy and imbalanced. Some characters are downright unplayable against a worthy opponent and some characters are played religiously by spam-happy opponents. Not perfect, but for some casual play this game is superb.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended to play with controller, playing on PC hurts hand.",
            "review_score": "1"
        },
        {
            "review_text": "If you like fighting games and comic book superheroes, this is a great choice. I admit, I've never been a fan of Mortal Kombat and this game's lineage sort of turned me off of it. Boy, do I wish I got into it sooner. It's very different from what I expected (there is almost no gore and the story makes sense) and I plan on picking it up for Wii U really soon. I've played through the story mode once but would like to again as well as get some buddies together and smash each other. This is the sort of game that doesn't require someone to memorize a ton of combos and special moves. They exist but the game is a bit easier to handle right off the bat. The real shining point is the story mode which is engaging if you like DC and is very unique for a fighting game. I love how cinematics blend seamlessly into fights. Even mini games are occassionally stuck in but unlike bashing sedans on a pier, these games make sense in the story. Try it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game so far. Also seems to be a glitch that if you buy a single costume from the archives, you get the achievement for buying all the costumes so that gets an 11/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "DC heros in a destructive awesome combat fuq yeth  if you're gonna get this you should get a PC controller. its way better like that",
            "review_score": "1"
        },
        {
            "review_text": "Yes I know i'm reviewing yet Another Beat em up  Made by the same guys that brought you Mortal Kombat Komplete Edition, Injustice is set in the DC Universe, where strange things are a foot, not really gonna say much about the story as I think it's one of the better elements and you should see it for yourself instead of having someone read it too you  or Youtube it  ok, so why buy this game?  firstly it's one of the most complete Beat em up's available and builds on the combo styling of MK9, each character has there own move set and super move basd on the hero in question  such as Green Arrows super button , fire's his bow and is used for equipping special arrows such as flaming, freezing and electric  while batmans summons robo bats to use as a shield or projectiles, or wonder womans swaps between lasso or sword and shield  So each character's moves and specials fit with what you'de expect from them.  here's a big negative though, the game requires a powerful pc to run well, and the graphics can't really be toned down to compansate  but for those that can run this, it's a very good game, while i feel it could have had more modes, the offering is nice  so pro's and con's time  pro's   @ Large Roster, sometimes you won't have heard of certain characters though 'Cough' Killer Frost 'Cough' @ Training mode is extensive @ Connecting to the internet is easier than MK9 @ has new challenges weekly  con's  @ Powerful Pc Required @ Story Mode Learning Curve @ X Box icons in a PC game is lazy @ Some of the female characters look blokey, Zatanna, Wonder Woman, and other  Graphics 10 / 10 on a powerful pc this looks gorgeous Gameplay 8 / 10 could have benefited from more modes Sound 7 / 10 good, but subdued Overall 8 / 10 A good beat em up to get you started",
            "review_score": "1"
        },
        {
            "review_text": "Injustice Gods Among Us is a fighting game developed by the same studio that made Mortal Kombat 9 and I have to say, for $20 this game is so worth it especially if it's on sale. So where should I start... perhaps the amount of content you get in this game? If you are a type of person who likes to collect all of the DLC then look no further, this game has it all with over 30 DLC skins(iOS skins not included), 6 DLC characters and all the DLC S.T.A.R labs missions including the Red Son ones. Now the next thing I will go over is the amount of hours you will be spending on this game. So the story mode only took me about 5-7 hours but if you want to go past the story mode and complete everything you will be looking at about 100-200 hours worth of gameplay depending of what type of gamer you are. So in conslusion this game is perfect for veteran gamers and rookie gamers alike, along with a ton of replay value makes this game a 10/10 in my eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, simply amazing. The combat is fluent and enjoyable, and I really enjoy the storyline. Also, I got the Ultimate Edition for $11, like a lot of people, so I get a billion and a half character customizations and some extra missions. Totally worth it, and it plays like a dream when you use a USB controller.",
            "review_score": "1"
        },
        {
            "review_text": "This game broke the mold for fighting games with it's debut: Injustice - Gods Among Us is an adrenaline-fueled fighting game that is everything you'd expect from veteran game designers NetherRealm Studios.  They powerfully brought the DC Universe to life with a huge roster of Super Heroes and Super Villains to choose from, as well as a wide selection of stages to battle on - including specific parts of said stages.   Thought the fighting genre was getting stale?  Couldn't agree more - that's why NetherRealm brought new innovation to the table.  Now you can interact with your environments!  Fully destructable and fully interactive stages to battle on. Swing from a chandelier to drop down on your opponent, grab a motorcycle to run them over with, throw them through walls to cause environmental damage and to send them soaring to another part of the stage. This game has it all.  Each character is usually assigned to a specific style of gameplay - some are gadget users and some use sheer strength. Each has their own unique abilities as well as their own special move that does huge damage to your opponent.  This game is the epitome of superhero fighting games.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good fighting game for PC! if your looking for a competitive easy to pick up and play fighter for the PC, then this is the game for you. There's no real need to know anything about the characters just so long as you know there names and my knowledge of DC is pretty thin, but that didn't stop me from enjoying this game as I was mostly interested because of Batman as he's the only DC character I know well.  But this game truly makes you like all the characters each character has a different unique fighting style and powers, which make each fight different I found myself liking other characters apart from Bats although he's my favourite character to play normally, I grew to like Green Arrow, The Flash, and surprisingly Aquaman. But the most interesting character in this game is Superman we get to see him at his worst and at his best, this game shows how evil Superman can be and it's quite scary because of the things he does he clearly shows that he's not afraid to kill anyone.  The way the game does this is that there are alternate universers so the evil Supes is the result of what happened when The Joker destroyed Metropolis and tricked Superman into thining he himself did it, and so drives him down a dark path meanwhile the Batman from their universe brings over the original Good heroes from the other dimension and they team up to try and bring evil Supes down. It's a pretty good story and the cutscenes are enjoyable to watch with great visuals and even better voice acting it's hands down the best Super Hero fighter i've played.  I highly reccommend you get this game if you enjoy fighing games like Mortal Kombat which this game can be compared to but I prefer this over it, so whenever you get a chance grab it I guarantee you will have fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game Is One of the best fighting games around. Many people complain about the port and the graphics but mine runs perfectly 10/10 and the reason that the online sometimes SOMETIMES dosent work is because nobody plays but the singleplayer is stelllar.",
            "review_score": "1"
        },
        {
            "review_text": "Short story mode, but well worth the playthrough. Great to see all those DC characters in one place. Very cool game. Would recommend, just make sure it's under $20 unless you are a fan of fighter games and get replay value from the title.",
            "review_score": "1"
        },
        {
            "review_text": "Bug in the game. Makes the game run slow. There is no fix for this bug yet! Its a great game, but its not worth paying for something that doesnt work properly.",
            "review_score": "-1"
        },
        {
            "review_text": "Great DC Approach on a fighting game. No need to unlock characters. Story Battle. Story mode. UI ranked 7/10.  Theyre had been lagging issues but I'm not having any. Game is running 50-61 FPS on my laptop.",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaking AWESOME!!!!!! I like it better than Mortal Kombat",
            "review_score": "1"
        },
        {
            "review_text": "Good game, 100x better when you have a couple of controllers and few friends over! Would definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "When it comes to fighting games I have played them all. Injustice is pretty, fun and smooth to play. It is not as refined as Street Fighter but fighting with DC Titans makes up for that. The controller support for this game is not the best. It has been improved by a few patches but still just doesn't feel tight and right.   It is a decent fighter and well worth a sale price.",
            "review_score": "1"
        },
        {
            "review_text": " PROS:  + awesome story + many different battle modes + lots of unlockables + leveling system + cool soundtrack   CONS:  - poor balance between characters - occasional frame dip - Online Multiplayer has a small amount of people   Comment:  First thing that came to my mind was Casual Mortal Kombat. But I played further the game showed me that it is not just a clone of MK with DC characters. Actually, the game has similar patterns but branches out to something different. The story feels good and sits well with the Injustice story line of DC Comics. With the various battle modes available it gives for many hours of gaming. The combos and gameplay of most characters feel unique and interesting. However, this comes at a price to balance because some characters are simply better than others when it comes to fighting. Some other negatives are an occassonal frame dip caused by game coding. Online Multiplayer is not what it used to be when it comes to the amount of players so make sure to have some friends to play this with. But all that aside I went and rated this from Good to Very Good because it's DC ... because I am a big fan of comics. There is nothing like punching Superman with Batman ... or destroying Doomsday with Harley Quinn. This game is FUN and has a cool soundtrack, recommended!",
            "review_score": "1"
        },
        {
            "review_text": "A Super Hero fighting games in the vein and from the creators of Mortal Combat 9. The game is less violent in the sense of blood, bones and other internal organs, but those super heros are ain't no girl-scouts. Although the online MP is practically dead - it's almost impossible to find a match especially as a beginner (there are a few sharks lurking on the servers) ,so don't expect to do those acheivements, the local MP is fun (with all those special powers and super-moves), and there are also 1. The story mode (gets you to know most heroes and villians) 2.The various ladders 3. The Star Labs missions - all of these pack hundreds of hours of fun ( I played mostly on offline mode), especially if you're after those pesky achievments.  Since you can get this game pretty cheap these days, if you like fighting games for the SP and local MP I find it highly recommendable. Nothing astonishing, but still fun and good value for money. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game as a distractuion from Dota 2 and wow 3 Hours in and loving Single Player.  All your favourite super heros in a nice campaign whats not to like !  GHavent tried Multiplayer yet but i got high hopes",
            "review_score": "1"
        },
        {
            "review_text": "Injustice is a great 2d fighter game. I've played it locally and online with friends.   Gameplay- Injustice has great gameplay. You can pull off combos and use special moves. You can also interact with the map to hurt the other players. You can block, jump, hit, and more. Rating: 9/10  Graphics- It is 2d, but the game looks amazing. There is detail in the background and characters. Rating: 8/10  Online- The game has online but good luck finding a match. Currently, the online is empty and you should try to find people to play with. Rating: 4/10(no one plays online)  Price-  The game costs $20 as of 1/27/2016. It comes with all the dlc(yes including scorpion). I bought it when it was on sale for $5 and haven't regretted it since. The game goes on sale often so I would definitely pick it up when it's on sale. Rating: 7/10  Controls- You can use a keyboard or a controller. You can use the keyboard to play it as well as a controller. It is very easy to map the buttons. Rating: 9/10  Story Mode- The story mode was kind of short but I think the story itself is good. You play as many characters in the story and if you play the mobile too, you can get Prison Superman on the mobile edition by completing the story mode on PC or any other console. Rating: 8/10  Overall Rating: 8/10   ",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, nice graphics and sound effects. Nothing bad to say about it. Is a must have if you enjoy this gender! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like Mortal Kombat or DC Comics - you need this :) Or if you just like fightnigs on PC And before you start main campaign, i commend read comics 'Injustice: Gods Among Us'. Very interesting and might story.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Mortal Kombat vs. DC Universe, you'll love this title. Good storyline, good cut scenes, awesome graphics. . . Totally pleased with this purchase!!!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun fighting game!!",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer mode never works.",
            "review_score": "-1"
        },
        {
            "review_text": "Injustice is a game created by NetherRealm Studios (FYI the creators of the highly proclaimed Mortal Kombat) So you would think this is a good fighting right ? And you're right, at it's core this is a magnificent game(A good roster,perfectly balanced)   Now let's talk about the singleplayer: In the singleplayer the members of the justice league get teleported to an alternate dimension where superman went rogue and runs a dictatorship, you progress through the story by doing 1v1's with all the characters and doing some minigames along the way. Aside from the story you get the classic modes that yoou can expect in a fighting game(training, arcade battles,local 1v1's)  And now the multiplayer: DON'T BUY THIS GAME This is a fighting game, so you are going to want to show of your skills with your favorite character, right ? HOWEVER NetherRealm doesn't give A ♥♥♥♥ about this PC-port (yes i have the 360 version) the game just doesn't work. You can find people but you can't actually connect to their games. Now i managed to host a lobby with my friends but after a couple matches the game just glitches and everyone leaves the lobby.(And this didn't happen once)  CONCLUSION: Don't buy this game. If the multiplayer worked then this would be a whole different game. But seeing how the modes what you are going to be playing most don't work this game isn't worth the money. Comparing this to the 360 version this is just an all-out SCAM !",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best fighter I have played in a long time, the Mortal Kombat team outdid themselves, because this is a game with deep complexity in it's combat system. The DC characters have been fully fleshed out each one feels unique and challenging to master. I have hardly even scratched the surface after completing the solid story mode and trying some of the arcade style battles and I know there is so much more to do. I havent been this psyched for a fighting game since Soul Calibur 2. This version includes all the dlc for the game.",
            "review_score": "1"
        },
        {
            "review_text": "I Don't Do Alot Of Reviewing... With That Being Said This Game Rocks! Great Story Mode Single Player Graphics Are Very Good As Well. Riviting Story Mode Will Keep You Playing Even If You Think You've Had Enough. One Of My Favorites!",
            "review_score": "1"
        },
        {
            "review_text": "Favorite Character : Batman This game is good very very good but not the best RPG.  AVERAGE ",
            "review_score": "1"
        },
        {
            "review_text": "all in all a decent game.. the combat is just like every other dam fighting game where you mash buttons in an attempt to make combos and chains. however the enviroment is used a lot more than just smacking people or throwing. you can evade and move based on whats available in the arena your in you fight straight or kite and damage from a distance. the story is a bit cheesy with one liner battles but the game is smooth... hard a hell on a keyboard but fine if you have a controller handy",
            "review_score": "1"
        },
        {
            "review_text": "This game hates keyboard/mouse users. The combat at least against AI is quite slow and clunky. Things don't flow together flluently at all. They tried to make a keyboard mimic a 6 button arcade panel which is painfully unnatural.   Even the most basic combo's often involve keys far out of the way all having to be pushed simultaneously or quickly in order while moving and reacting to your enemy.  It's fairly pretty, but it's also a simple 2d fighting game with minor map interactions and senseless background destruction that doesn't really have much to do with what's happening during the fight. I really don't see how it got such high ratings on Steam, but I imagine with a controller it might be more tolerable.  I never thought i'd recall Dragonball Xenogears fondly, but DBX had fluent and varied open map combat that worked with either control method and a reasonable storyline. This pile does none of that. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's late to review the game as of now as it was released on November 13, 2013 - quite some time ago.  Anyway, the game is 'awesome' in one word ! I am big fan of Tekken and Mortal Combat franchises and I love these games very much. But this game has taken the hand to hand combat genre to a different level. Since, the game is entirely based on the DC universe - it will appeal to people who love DC comics (any comics lovers, for that matter) as well as people like me who plays and enjoys hand to hand combat games.  So, let me just carry on with the review in detailed segments.  1) Story:  This game has a variety of single player options. One of them is the 'Story mode'. As it is described in the game, Superman from another parallel dimension looses control of his emotion - as the Joker tricked him to kill Louis and their unborn child along with the destruction of the entire Metropolis. After that he 'crosses the line' and kills joker. This alters his personality and thus forms a 'Earth 1 Govt.' and ushers his reign. Some of his fellow league members joins him as a ruler and most of the rest of the heroes who stood against him dies. The remaining heroes, who are not with this 'evil' superman forms the resistance, led by none other than Batman. The story starts as this resistance leader asks for for help from the heroes of our world by snatching them from our dimension. What happens next ??... play the game !  2) Graphics :  This the next thing that you would feel - is awesome! The effects are stunning and the scripts are seamlessly integrated to the context of the screen. The model details are very very accurate. Since I am using a stone age 9500 GT my system could only manage a bearable FPS only at 640x480 (ridiculous, I know) I can't elaborate the graphics too much here ; but if I crank up the settings (and sacrifice the FPS) just to get the feel of the graphics - they really looked great on my 22' HD monitor.  3) Gameplay:  The game play is a bit difficult in the keyboard as it ported straight out of the console platform to PC. But anyway - its not Call of Duty either and most of the hand to hand combat games are created keeping consoles in mind. But after you get used to the controls a bit you will find that its a hell of an enjoyment in playing the game. The ghosting effects are pretty less once you get the feel of your system's I/O lags- still its easy to carry on combos or streaks of attacks.  The environment is engaging and interactive to a large extent (considering the genre)- things that you can pick up and throw at your opponents. the maps(levels) may have multiple sections where you can hit the wall along with your opponent and smash it to transit to next area. And this entire functions can generate combo hits.  Overall the game is a 'go' from my side , hope that it will do justice to you as well.  - Justice -",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Passes the time very enjoyable game Recommend this game to everyone. Worth the $ 20 I bought it And even more",
            "review_score": "1"
        },
        {
            "review_text": "Great game before not anymore.    10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game feels like Mortal Kombat. It looks like Mortal Kombat. But is it Mortal Kombat?  I can only tell you to look at the title if you say yes.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "10 times better then batman V superman, greaT for both mortal kombat and DC fans",
            "review_score": "1"
        },
        {
            "review_text": "Single player is flawless. Multiplayer is non-existent. Developers refused to patch. Game not updated as the console versions. No Go.",
            "review_score": "-1"
        },
        {
            "review_text": "Much better than Mortal Kombat",
            "review_score": "1"
        },
        {
            "review_text": "ITs very fun at first time and little confusing about the controlling and the story is a bit short (for me) Afterall i still wait for injustice2 to come.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most casual 2D fighter of this generation. Pretty fun if you don't actually try to play it too seriously. NRS thought it would be a good idea to count half of quarter-circle-motions as a full quarter-circle, so if you try to do a crouching 1 and input d, db, 1 (as you would in every other fighting game ever) the game will execute d, db, b, 1 (which, most likely, causes a special move to come out). Also the input-window for buttons being so large can really mess you up on quick inputs, especially so if you use negative edge- it's a nightmare.  Online is very poor- if you get less than 60 FPS, you won't be able to find any lobbies or be able to connect to anyone until you fix it (for most people who post about the game not working online, this seems to be the issue). In itself, that's great and necessary, but the game doesn't actually tell you this  anywhere . It's a sort of natural selection for online-play. Once you have overcome that hurdle (which, to be fair, won't be a hurdle to anyone with a decent PC), you might still randomly crash at character-selection, stage-selection or after fully loading into the game. Once you have gotten past that, you may finally be in a game only to find that your controls have reset to either the default setting, or your opponent's set-up. This can be fixed by going into the settings and out again  every time  you launch the game. The actual netcode seems alright if you have a good connection to your opponent, but once there is the slightest amount of lag, it becomes unplayable. I guess GGPO was too cheap and efficient for them. As a small tip for audio-issues, if your sound is muffled, try using stereo-sound in your OS, they somehow managed to even screw up speaker-selection. If you want to make a private lobby with friends, you need to invite them through Steam directly, pressing 'invite friends' in-game will make the game crash to desktop, just fyi.  Injustice has invisible hitboxes (Mahvel and MK style), auto-correct for directional inputs that works whenever it feels like it (as in: it will not only auto-correct specials, but if you jump-in cross-up, it will mirror your inputs mid-combo!) and no logical approach to frame-data whatsoever. Never have I played a game that was so inconsistent with which moves are safe and which aren't- I'm fairly sure they randomized all of that (at least that's the only explanation/excuse for slow overhead swings with 0 recovery and punishable jabs). The execution-ceiling is very low, which can be great in a game with good footsies and basics, which Injustice doesn't have. The story-mode doesn't allow you to choose a character, but it follows a fixed story-line which forces random characters upon you all the time.  On to the good things: Training mode is very customizeable (moreso than most games of this gen), you can look up all frame-data for characters on their ingame-movelist, the singleplayer is fleshed out a lot more than in most fighters (lots of Tekken-esque mini-games and modes), you can enable/disable negative edge in the settings and the visuals are pretty okay.  Buy it for a tenner or less if you like casual fighting-games. I can also recommend this game if you regularily get mad at stupid crap in other fighters- playing this trash will give you some perspective.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the most casual 2D fighter of this generation. Pretty fun if you don't actually try to play it too seriously. NRS thought it would be a good idea to count half of quarter-circle-motions as a full quarter-circle, so if you try to do a crouching 1 and input d, db, 1 (as you would in every other fighting game ever) the game will execute d, db, b, 1 (which, most likely, causes a special move to come out). Also the input-window for buttons being so large can really mess you up on quick inputs, especially so if you use negative edge- it's a nightmare.  Online is very poor- if you get less than 60 FPS, you won't be able to find any lobbies or be able to connect to anyone until you fix it (for most people who post about the game not working online, this seems to be the issue). In itself, that's great and necessary, but the game doesn't actually tell you this  anywhere . It's a sort of natural selection for online-play. Once you have overcome that hurdle (which, to be fair, won't be a hurdle to anyone with a decent PC), you might still randomly crash at character-selection, stage-selection or after fully loading into the game. Once you have gotten past that, you may finally be in a game only to find that your controls have reset to either the default setting, or your opponent's set-up. This can be fixed by going into the settings and out again  every time  you launch the game. The actual netcode seems alright if you have a good connection to your opponent, but once there is the slightest amount of lag, it becomes unplayable. I guess GGPO was too cheap and efficient for them. As a small tip for audio-issues, if your sound is muffled, try using stereo-sound in your OS, they somehow managed to even screw up speaker-selection. If you want to make a private lobby with friends, you need to invite them through Steam directly, pressing 'invite friends' in-game will make the game crash to desktop, just fyi.  Injustice has invisible hitboxes (Mahvel and MK style), auto-correct for directional inputs that works whenever it feels like it (as in: it will not only auto-correct specials, but if you jump-in cross-up, it will mirror your inputs mid-combo!) and no logical approach to frame-data whatsoever. Never have I played a game that was so inconsistent with which moves are safe and which aren't- I'm fairly sure they randomized all of that (at least that's the only explanation/excuse for slow overhead swings with 0 recovery and punishable jabs). The execution-ceiling is very low, which can be great in a game with good footsies and basics, which Injustice doesn't have. The story-mode doesn't allow you to choose a character, but it follows a fixed story-line which forces random characters upon you all the time.  On to the good things: Training mode is very customizeable (moreso than most games of this gen), you can look up all frame-data for characters on their ingame-movelist, the singleplayer is fleshed out a lot more than in most fighters (lots of Tekken-esque mini-games and modes), you can enable/disable negative edge in the settings and the visuals are pretty okay.  Buy it for a tenner or less if you like casual fighting-games. I can also recommend this game if you regularily get mad at stupid crap in other fighters- playing this trash will give you some perspective.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like street fighter type fighting games anda a big comic book fan you will probably love this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you, like me, have Windows 8, DO NOT buy this. It's horribly optimized and doesn't always even run. Sometimes, you have to restart Steam in order for it to work, which is ridiculous.  I managed to play about an hour of this until I got sick of how the game ran, it's crashes, it's compatibility issues, and horrible optimization.  In that hour, I must admit that the game was fun. It has plenty of characters that are all very interesting and familiar if you're a big fan of DC Comics. The environmnets are interesting, interactive, and dynamic to certain extents, which makes combat even more fun. I managed to play through Batman's chapter in the Story mode, which was entertaining and good. The story seemed interesting enough to play through, yet nothing amazing or far too great.  The fighting is cool and good since all characters have their own finishes, moves, and combat styles. It's well balanced between the characters and it feels like as if this could have been a competetive fighter even.  In the end, I recommend this to those of you who have Windows 7. To those of you who have Windows 8, or lower, DO NOT BUY. Actually, even if you do have Windows 7, I highly recommend you think about purchasing this. I'm glad I got this on a sale...",
            "review_score": "-1"
        },
        {
            "review_text": "I WILL FIND HIM!!!!!!!!!  YOUR'E A MONSTER ZOD, AND I WILL STOP YOU.  IF YOU LOVE THESE PEOPLE SO MUCH, THEN YOU SHALL MORN FOR THEM.  (SNAPS NECK)  AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Injustice Gods Among us is a very fun fighter, but the PC port is just ♥♥♥♥  The multiplayer is broken and you can't connect to any games whatsoever and netherrealms seems to have no intentions of fixing this,  Pass the PC port buy it for PS3 or Xbox 360 used or on sale, not worth the asking price  ",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I could play it Multiplayer it turns out that every room is 0 players.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a good game with a PC keyboard. I thought it was going to be like DC Universe Online, it is just a fighting game like Mortal Combat. If you like that kind of stuff make sure you have a game pad. This game uses the whole keyboard which I wouldn't mind but when there are 6 key combo's that include A+LTAB or A+LShift. WTF??? Seriously!! Yah, The video on this game was awesome, I should have done a little more homework before purchasing.",
            "review_score": "-1"
        },
        {
            "review_text": "Good short story that is worth the $5 sale price tag. Good fighter to have to play casually with friends. I wasn't too interested in online multiplayer. 7/10 @ the sale price",
            "review_score": "1"
        },
        {
            "review_text": "The fighting mechanics are pretty darn decent in this ultimate hero mash up. Speaking of mashed this game is light and fluffy just like potatoes and runs like gravy even at maxed settings. Injustice: GAUUE is a four-course meal of meat tearing, bone snapping, finger licking goodness, served hot and ready. If you thought this game wasn't filling enough, it even comes with a dessert menu. Badda boom, badda bing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Great controlling fighting game that has a lot of fun elements to it",
            "review_score": "1"
        },
        {
            "review_text": "This game is a really really bad port from the xbox console version. Promo menus that aint removable unless you use a controller. Tutorial sections which arent progressable due to problems with buttons. All over not a game that i ever will buy or will recomend to anyone",
            "review_score": "-1"
        },
        {
            "review_text": "get it on sale and play easy mode for the story alone. worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry, there are way too many bugs, I have to delete this cause of the slow mo bug and the graphics I turn them as low as possible and they are still bad",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fun game! Is'ts a fun fighting game",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games ever ",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't recommend playing this game with your keyboard. But all in all, seems like a decent game if you don't have anything else to do.   So keep up your childish superhero feeling and buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "All chars, skins...Plus all the Star Labs+ more........and I only have to pay $24.99??? Yea, Sure.....I'll take it..",
            "review_score": "1"
        },
        {
            "review_text": "So strange to have such short combo's....",
            "review_score": "1"
        },
        {
            "review_text": "EPIC fight Heroes and Villains",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the DC Universe and a casual fighting game fan then pick this up while it is on sale. Wouldn't say it was worth the full price product as it still has a few issues which are well documented elsewhere. The game looks great and it has plenty of depth for most gamers! I dare you not to grin when you pull of your first super move...",
            "review_score": "1"
        },
        {
            "review_text": "Fighting with heroes from DC Comics is insane!!!",
            "review_score": "1"
        },
        {
            "review_text": "A fun fighter with local co-op and an online system for those who want it. A story and convoluted story, but this is comics, man. Play as your favorite DC comic heros and also Scropian from MK for some reason. Is it fun? Yes. B?5.",
            "review_score": "1"
        },
        {
            "review_text": "So Much fun. Injustice has replay value, nice-but not intrusive- story, PvP (onlie and local), and did I mention it's fun? However... it lags slower than an aged galapados turtle on morphine in a bathtub of maple syrup. Especially on PvP. If you can be patient, though, it's sure to be worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Fighter games are always fun and this is one of the better ones. Story is excellent, but leaves you hoping for alternative story lines. Addicted to the tablet version as well.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! The story is excellent! It was enough to keep me playing nonstop till I beat it. The PC port is solid and the fighting is smooth. For those wondering, I have and used a Microsoft xbox 360 USB game controller (I don't think I can play any fighting game using a keyboard and mouse) and had no problems. Also I learned a few things here and there about the DC universe as well that I never knew until playing this game. Even if you're not really into fighting games, the story is compelling enough to keep you entertained.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome superhero/ super villian fighting game in the style of Motal Kombat. Lots of replay value, and content to keep you playing for dozens of hours if not more. Many types of single player games, and multiplayer as well. The archives will keep you playing for hours on end to unlock everything.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the better DC fighting games. Combos are somehow difficult to execute, however. Single player is a bit short; but the STAR missions, and multiplayer is where it truly shines.",
            "review_score": "1"
        },
        {
            "review_text": "This is awful on Keyboard",
            "review_score": "1"
        },
        {
            "review_text": "The best fighting game on PC that i've played. Actually has a story mode which is actually pretty cool and decently long for a fighting game probly around 4-5 hours. Smooth gameplay and seems to be pretty balanced. It feels great to fight as your favorite heroes or villains and has some of the not so known ones in there too.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for wuite a bit, and have really liked it. The story is very unique and interesting, and the character are all very different and awesome. Other than story mods, you have tons of arcade mode style battles to do, each with their own set of rules. Of course, theres also single battle fro those who just want to play a fight or two. Gameplay is pretty solid; the stages stop being interesting after a while, but transiotions into new stages are pretty cool. Local multiplayer works just like it would on most other fighting games; online multiplayer is kinda dead, but Im not really a multiplayer person, so it didnt bother me. There are plenty of characters, character skins, and game modes to keep you busy for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game , love the story and how the envirmount works on each of the stage . the fighting style is not that face paced neither it's slow and it's unforgiving for ppl who likes to spamm a single skill",
            "review_score": "1"
        },
        {
            "review_text": "Sorta Buggy, hopefully they work everything out on PC",
            "review_score": "1"
        },
        {
            "review_text": "OUtstanding Game! If you like Mortal Kombat and you like DC, this game has it all. It is quite fun and easy to pick up for a fighting game.",
            "review_score": "1"
        },
        {
            "review_text": "you can never find the special button",
            "review_score": "-1"
        },
        {
            "review_text": "great game i love batman hes so frickin cool also wonder woman. Overall is fun",
            "review_score": "1"
        },
        {
            "review_text": "I waited for this to go on sale, so at least I didn't waste too much money on it. Massive download (17.8 GB; over 4 hours). Choppy graphics, at least for me. Think you'd need a dedicated gaming rig to play this. If you have one, then hopefully it's a much better play. But if you don't, and are relying on onboard/generic graphics card then you might not want to bother with this game. Going to have to start trusting negative reviews more.",
            "review_score": "-1"
        },
        {
            "review_text": "The Justice League are transported into an alternate reality where an evil Superman rules the planet. Fast paced action by the people who made Mortal Kombat. It is challenging and frustrating enough to the point that you don't want to give up until you beat this mother! Great variety of DC Heroes and villains to play as including Batman, Wonder Woman, Green Arrow and the Joker. As a comic nerd, I endulge on just how great this is. And just the fact that Mortal Kombat's Scorpion is a playable character is enough to get anyone hooked. To paraphrase him: 'Gat over here, and play this game!'  There's no emoticon for what I'm feeling.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Lots of value if you get it on sale - from getting to play 30 different characters to hundreds of STAR Labs missions. Best if you can play versus with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "I like This game",
            "review_score": "1"
        },
        {
            "review_text": "Injustice: Gods among us, what a great game, looks great, plays great and creates a great adaptation to the DC world in a fighting game up to level of Mortal kombat, and it should be since its created by netherrealm studio, the company responsable for Mortal Kombat 9. However this review wont be about the gameplay or history, but about the port. Since long every pc player encounters a port so porly made that it's imposible to play the game, sadly injustice gods among us is not the exeption High Voltage Software did his absolute worst job, creating a port so bad that the multiplayer (The key feature for any fighting game) IS BARELY PLAYABLE. and im just being nice, in 15 hours of gameplay i finished the story mode in 3 - 4 hours and play training or arcade for 6 - 7 hours. The other 3 Hours you ask? well i'd be kind to say that 1 hour was me playing online with my friends or random players, i think its about 30 minutes and the rest ♥♥♥♥ING SERCHING FOR A GAME, TRYING TO MAKE THE MULTIPLAYER WORK OR ENTERING A GAME TO ONLY GET A ♥♥♥♥ING MESSAGE SAYING 'Session no longer available' over and over again. if you ask me injustice is an incredible fighting game but in this horrible state and no care about the game with no patches over a year or more with the same problem since day one, this make a list of games that is qualified as 'BUY IF YOU WANT A GOOD GAME THAT CANNOT BE PLAYED'. so dont buy this is not worth a penny in this state and thanks to High Voltage it never will. THANKS AGAIN ♥♥♥♥ING COMPANIES, you've done it again keep the HORRIBLE WORK at creating port that ♥♥♥♥ING SUCK.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has INCREDIBLY tight controls. You have to have the button tapping almost instant when you perform it, that's not great for people who aren't that great at rapid button layout. The game looks alright, now if it can be, I dunno, USEFUL and PRACTICAL with it's controls, then it might've gotten a good review.",
            "review_score": "-1"
        },
        {
            "review_text": "What an absolutly horrible game, its not fun at all to play the cutscenes are not enjoyable to watch and to top it all off your character will take only one step either backwards or forwards depending on which direction you press, and it uses a horrible insta jump animation when jump is pressed, the character feels as if they attached to bungie cord that will let them move a little in one direction but not far enough.  Combat is not smooth combos are horrible most of the time you have no idea what your doing when your suddenly dropped in as another character because the combo controls change for each, and i dont know about you but i cannot be bothered to sit in the training room learning all different combos for every character there is no way this game deserves that much attention.  Graphically its not really that pretty its all just bright colourful flashes and attacks that are sped up to a pace that rivals killer instinct only without the 150 hit combos from one side of the screen to the other. I have no idea what is going on and most of the time who the ♥♥♥♥ im actually looking at there is no explanation only that lex luthor gave the joker a bomb and metropolis is destroyed.  Thankfully i didn't pay much for this but if you are considering it youtube it first.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game but looks like a joke after epic Mortal Kombat. Still try it if you like DC universe. And don't forget to check out the mobile version. Though I did have a complete wipe of all progress in mobile game and support does not refund ♥♥♥♥ neither do they restore backup saved games still I enjoyed it for a long time!",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game all that i asked for",
            "review_score": "1"
        },
        {
            "review_text": "I had to set it to the lowest resolution in order to play it but sadly i can't actually remember combos and i am not able to time them correctly. But if you have a good computer and good at fighting games then go for it.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is short as ♥♥♥♥, finished it in 3 hours get it on a sale cuase it's still awesome :P",
            "review_score": "1"
        },
        {
            "review_text": "Got te-bagged by a bot. 11/10 would get te-bagged again   But in all seriousness, here is a Pros/Cons list.  Pros:  Pretty Fun Mediocre Story You can beat up The Joker, As The Joker. DC Characters  Cons:  You allmost HAVE to play with a controller. The PC controlls are just a s s. Gets boring after a few hours.  Its pretty much just Mortal Kombat just with less violence and DC characters. (I wish there was an option to have gore like Mortal Kombat :( )",
            "review_score": "1"
        },
        {
            "review_text": "terrible graphics",
            "review_score": "-1"
        },
        {
            "review_text": "I liked this game on the wii u. It was fun, looked great and ran well with no problems. However I am disappointed with this pc port. As soon as the game started the game was running at less than 30 frames per second which is very bad, especially that my PC has the best hardware that you can buy so it is not my pc. also the game sounds like crap. Voice acting is clear but music and sound effects have suffered and are low quality. This game is not optimised for the pc and I would streer clear. Thank god that I only payed £5 for it during the sale. If I paid anymore then I would send of sent angry letter to both steam and the developer demanding a refund",
            "review_score": "-1"
        },
        {
            "review_text": "Broken game. Online is buggy and laggy. Not playable at all. Zero support. Last patch was in novermber 2013 and solves nothing. Read forum of this game for detailed information. There is no sutisfied gamers. NONE. Save u money and dont support such ♥♥♥♥♥♥ ports. There is much better playable games here.  If u want to play alone in single then its ok. But u will get bored playing vs cpu after compaign",
            "review_score": "-1"
        },
        {
            "review_text": "10/10. Best fighting game I've every played as of today (10.19.2014)",
            "review_score": "1"
        },
        {
            "review_text": "The only thing i can give this game credit for is how awesome the involve the story/gameplay transfers. They story itself is great of course, but the way the switch you in and out from fighting to cinematic is really cool. Other than that this is your average spam your keyboard style game, and gets annoying later on when a.i sticks you in a corner until you are dead.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun, it looks good, it is DC and it is now pretty cheap. A small, valuable pleasure.",
            "review_score": "1"
        },
        {
            "review_text": "buy this game for a SUPER (hero) good time",
            "review_score": "1"
        },
        {
            "review_text": "Got to hit batwoman in the face She turend into a paraplegic  10/10",
            "review_score": "1"
        },
        {
            "review_text": "fantastic story, fantastic fighter game!",
            "review_score": "1"
        },
        {
            "review_text": "If you're not a Mortal Kombat fan, don't bother. This game is pretty much mortal kombat with a pretty skin. IF you do like MK, then this is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not a big fan of fighting games. I was of the original Mortal Kombat games but lost interest in the series, and fighting games overall not far after Ultimate MK3. I've enjoyed the occasional fighting games since like a random Soul Calibur game or maybe a few rounds of Tekken with friends, but never enough to go out and buy it. When the Mortal Kombat remake came out I bought it for the console and fell in love. After hearing Injustice was made by the same people I had to buy it being a huge fan of the DC universe. The main story is exciting and a lot of fun to play. It is short... but it is a fighting game so you can't fault it for that. It has a challenge mode that you can play through also much like the MK remake but unlike the MK one I didn't have the drive to finish the challenge ladder. I would say unless you dislike the DC universe and fighting games then you should buy this game even if for the bare minimum of having a good game for when you are entertaining some company.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with a great story. Unfortunitly the community has moved on to MKX and the now upcoming Injustice 2 will certainly be the final nail in the coffin for this game. I recommend watching the story on youtube if you're really interested but the game's already been replaced by other NRS games so I don't think it's a great buy anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "when i lounch the game it always crashes so i need help i cant refund its in my libary 3 or 2 months already i love the dc characters and series",
            "review_score": "-1"
        },
        {
            "review_text": "'Covalent Bonds' is a wuss.",
            "review_score": "-1"
        },
        {
            "review_text": "This was absolutely the worst port of a game ever. Dont buy this. please.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game. I got it back when it was originally on consoles and had a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Horid controller support. Impossible to execute some special moves with 360 controller",
            "review_score": "-1"
        },
        {
            "review_text": "I played as Joker! Would slap Batman again! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "It's not really that good...",
            "review_score": "-1"
        },
        {
            "review_text": "Superman is nerfed, Aquaman is OP. This is a good time to remember Subway footlongs are all just $5 for the month of April.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, terrible port. It has big FPS problems that devs can't solve even a year after release: game often goes into slo-mo or gets to 5 FPS for no reason. And matching recommended system requirements won't help you: my PC can handle stable 60 FPS in BF4 on Ultra, yet it has trouble running this game. Add a buggy multiplayer to this mix and you'll get a PC version of Injustice: Gods Among Us.",
            "review_score": "-1"
        },
        {
            "review_text": "Add the cards form mobile and it might be good",
            "review_score": "-1"
        },
        {
            "review_text": "All of those good reviews are fake review from the developers.  1. Slow motion bugs still occurs. 2. If You're not live in Europe or America, don't buy it. You can't go online. 3. No news or whatsoever from the devs. 4. Same features as pirated version YOU CAN'T PLAY ONLINE!!  My internet is not the problem, i could play other games just fine.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah, it's pretty good. I didn't buy it though.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game)",
            "review_score": "1"
        },
        {
            "review_text": "The controls are unresponsive and not at all intuitive. Buy this on console.",
            "review_score": "-1"
        },
        {
            "review_text": "wtf i cant pause this stupid game and i cant close it wtf",
            "review_score": "-1"
        },
        {
            "review_text": "Its bad like the movie attack of the clones",
            "review_score": "-1"
        },
        {
            "review_text": "total crap. not playable in my opinion. on nvidia gtx 970 20 fps, no matter settings.",
            "review_score": "-1"
        },
        {
            "review_text": "The only game I regret wasting my money on. It has balancing issues; the 'clash' mechanic is bullcrap; there are no rounds, instead of them there's this stupid armor/healt meter; ladders have crazy difficulty spikes, and that's and issue, considering that online is almost dead. The only redeeming quality of this game is it's plot.",
            "review_score": "-1"
        },
        {
            "review_text": "DONT BUY IT NO ONE PLAYS THE MULTIPLAYER NOW",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is alright. The story line is awful, the cut scenes are ugly as sin, and the online multiplayer is broken with a nonexistent community. Buy it if you don't have a problem with just doing the challenges for funsies.",
            "review_score": "-1"
        },
        {
            "review_text": "Its so ♥♥♥♥ing cringy",
            "review_score": "-1"
        },
        {
            "review_text": "idiots who play this game like to see gay men in spandex handle each other... do yourself a favour and don't be gay, don't buy injustice",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game if you have a controller or can get past the wonky keyboard controls",
            "review_score": "1"
        },
        {
            "review_text": "If your having frame skip like then try this. It may not work for all Go to nvidia control panel &gt; 3D settings &gt; Manage 3D settings &gt; Program Settings &gt; under select a program to to customize chose Injustice: Gods Among Us (injustice.exe) and then click Add &gt; scroll down and find Vertical sync and turn it Off.  After doing this my game ran smooth at 60fps Hope this helps",
            "review_score": "1"
        },
        {
            "review_text": "5 hours game but nice to play. Storyline quite good. game almost same like mortal kombat",
            "review_score": "1"
        },
        {
            "review_text": "playing as batman,   teleported to another dimension   kicked joker, punched superman to a pulp and   fought with other batman from alternate dimension   11/10 play again oh, and by the way, the suit wasn't cheap",
            "review_score": "1"
        },
        {
            "review_text": "LEAVE. SHAZAM. ALONE!!!!!!!    9/10",
            "review_score": "1"
        },
        {
            "review_text": "The PC Version is a very bad made port from the console version. It looks like you're playing with a console emulator (or worst)",
            "review_score": "-1"
        },
        {
            "review_text": "Injustice: Gods Among Us Ultimate Edition",
            "review_score": "1"
        },
        {
            "review_text": "In one word: FUN.  The only downside are the controls. They take a bit of work to get used to, but then it was designed for consoles. After some personalization however, all was well.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. A fighting game with an honest to god, makes sense, (comic book) logical story with scene transitions and actual plot development. The cut scenes are done well enough that they could be packaged on their own. (And surprised that hasn't been done.)  Fighting is a bit clunky, but fits with the slugfest style of most of the characters. The skins all come pre-unlocked (Woot!), but if you like collecting challenges there's a ton of flair to be earned.  And it actually makes Aquaman seem like a badass.",
            "review_score": "1"
        },
        {
            "review_text": "Hard To Combo.....But Its Still Fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "'There's Aquaman and under the sea fighting arena Too much water 78./10' -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Personal review of 5.5/10 Do I recommend this game? For online NO, for LAN yes. because I bought it for the online I pick no.  The online for Injustice at last for the PC port is awful, if you've played MK9 on PC thats just an idea of what its like. Instead of fighting other players you fight lag more so you can't really say you have more skill than another person, if I can destroy a lvl 89 in this game because of lag, 'something is very wrong' but other than that the game is perfect when you do get a decent matchup an example would be a person within your area or vs. it feels really good and smooth to play, personally I didn't really buy the game for the story or single player I got it for online purposes and we can see how that turned out, I just hope.. scratch that.. pray that MK X isn't like MK9 or this game. with that said I give a personal review of 5.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "GREAT GAME but more people need to play online i cant find a match...........................at all",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun game with friends, but I still think Ultra Street Fighter IV is where it's at.",
            "review_score": "1"
        },
        {
            "review_text": "Well, i bought this game really late but never the less awesome game this one ",
            "review_score": "1"
        },
        {
            "review_text": "The story in this game is great! The combat is meh. That being said it is still fun to play in vs. mode or story mode. The online mode can be tricky but it too is fun. If you are looking for a real good fighter then this may not be the game that you are looking for, however, if you are really into the DC Comics universe and like a good story with some ok fighting then you may love this game.  I don't play a lot of fighting games but I do like this one just for the characters, settings, and story. It's easy to pick up and play but hard to master (I suck at fighting games).",
            "review_score": "1"
        },
        {
            "review_text": "i got it for free then next time i tryed tio go on it it says i have to buy it. that is the only bad thing about it though",
            "review_score": "1"
        },
        {
            "review_text": "When I played this on the Free Weekend, I was amazed in how smooth it was. It needs Darkseid though...",
            "review_score": "1"
        },
        {
            "review_text": "MK9 is better, but if you can grab this cheap its worth it on a level of 'So stupid its good'",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game runs smoothly",
            "review_score": "1"
        },
        {
            "review_text": "I only wish Marvel would make a game this epic... :'(",
            "review_score": "1"
        },
        {
            "review_text": "this is a super cool game i recommend this to game coooooooooooooooooooooooooooooooooooooooooool",
            "review_score": "1"
        },
        {
            "review_text": "I lacked team mode like has tablet version. But in overall score is still pretty well playable.",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun game. pretty addictive. nice story mode.",
            "review_score": "1"
        },
        {
            "review_text": "This has got to be one of the best fighting games I have played in a long time. The graphics are awesome and unlike some fighters, it doesn't take long to learn the controls. They did a really good job of balancing out all of the fighters and this should keep you playing for a long time. The super moves are really done well. It's pure eye candy at some points. If you have a buddy who enjoys fighting games, you'll get even more from this wonderful game. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Never get tired to play this game!  If you are a comic book super-heroes fan boy, this is a must!",
            "review_score": "1"
        },
        {
            "review_text": "the game is great but the manual is just a copy of the box cover and as such is worthless , lucky  IGN.com  comes thru with a real manual",
            "review_score": "1"
        },
        {
            "review_text": "Awsome Game! Detail is amazing. The first game of its type ive played in a decade and really impressed",
            "review_score": "1"
        },
        {
            "review_text": "it good ",
            "review_score": "1"
        },
        {
            "review_text": "What were they thinking? Horrible menu options, mine glitched out and said press 4 or 5 for options, which did not work. Is this game still in beta? Nope.....",
            "review_score": "-1"
        },
        {
            "review_text": "Quite the surprise, this game envelopes a good story-telling with a wicked jogability. I recommend for people who enjoys a good wack'em with a cool story.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this up in 2013 and paid full price and don't regret it one bit.  This is lotsa fun and I'm a big comic book hero fan so this game is perfect for me. Very nice visuals and a great story mode too. Fighting style is quite different from SFIV but that's no bad thing. Definitely one for a game-pad as opposed to keyboard and mouse. Highly recommended!  If you see it on sale, jump all over it, you won't regret it :-)",
            "review_score": "1"
        },
        {
            "review_text": "Put simply this is fairly similar to Mortal Kombat but the online is noticeably better. It is decently balanced and the networking is now pretty good. If you like fighting games similar to Mortal Kombat or the DC universe characters then this is a recommended title hands-down. By the way the King of the Hill mode is probably my favorite.",
            "review_score": "1"
        },
        {
            "review_text": "I do not have a gaming computer, but it runs games with better graphics than injustice. When I try to run injustice, the game plays in slow motion, even when set to minimal slowest settings. I could find no solution to this problem online and apparently allot of people have this problem, even people with high end gaming PCs. Before buying this game make sure that your system is compatable with the game. I found that  www.systemrequirementslab.com  was helpful. This game cannot be played in slow motion because it is extremely difficult to execute commands.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY! This game has been very poorly ported and you will have random slowdowns even if your PC exceeds reccomended specs and you turn settings down.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic good times fighting game - pick this up and challenge me online!",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you love Mortal Kombat AND DC Universe. The Singleplayer story was great! Looking forward for a sequel. :) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Visually impressive [✓] Well written story [✓] Wide variety of characters and environments [✓] Explosions [✓]  Okay, so its a free to play weekend on Injustice and I've just played through the full storymode in one sitting - it's not often I can find a game that holds my attention for so long at a time; my clock time is over 6hrs from just the one session, though admittedly that includes the pause menu for maybe an hour or so for meals and breaks etc.  The vast majority of the storymode is watching cutscene cinematics so don't expect none-stop button bashing if that's what you're after but if like me, you enjoy the 'interactive movie' style Injustice offers up, I'd very much recommend this to you.  My only advice if you get the PC version would be this: buy a game pad first. (though given genre of the game, most of you reading this will have concluded that yourselves already.)  Conclusion: It's a superhero game that doesn't suck a**. Thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "my favorite fighting game.",
            "review_score": "1"
        },
        {
            "review_text": "purdy gud  my one complaint is that the game sometimes goes lower than 10 FPS after a cutseen for a good 10 seconds untill it buffers out BTW my computer has a GTX 750 ti and and i7 4770k 16GB of ram running this game one max settings I got 60 FPS for the most part, i think the game is capped at 60FPS in general (all cutseens are 30FPS no matter what) Get a controller....keyboard has a akward layout on this game   8/10 Walrus approved story is okay but intresting as a whole voice acting not to bad but character modles would like to see better not the best game, its avrage at best it earns it's 8/10 well",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥, this is one hell of a fighter. Lets get the breakdown started.  Story:  This game is a fighter and has an awesome story. I know, that is rare in a fighter, but this game sort of took the flashpoint paredox story and changed big time. They keep the parellel demention and fighting between heroes, but they make it superman based and not flash. So here is the backstory though. Superman, in a paralel demention, is tricked by Joker into killing Lois and their unborn baby. So he kills joker. Then destroys metropolis city, and takes over the world. Then batman brings over our dementions batman and other justice league members to stop him. Story 9/10  Gameplay:  This game features a typical fighter game gameplay. You have a pretty cool combo system, a cool set of characters, etc. Then one of the things that I like most is the interative enviroment. Most fighters don't have that. So i really enjoyed this. Now I don't be like me and use your keyboard. It is not easy. I recommend using an Arcade Stick, but if you don't have one use an XBOX controller. Gameplay gets a 10/10  Graphics:  The graphics in this game are pretty good. Nothing amazing, but not bad. Graphics get a 7/10  Cons:  Some crashes and glitches Short Story  And Lex Luthor is ridiculously powerful.   All in All injustice is a great fighter. my final verdict is 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Unless you have an xbox/ps4 controller, the gaming experience becomes crap since the pc controls are so awkward.",
            "review_score": "-1"
        },
        {
            "review_text": "its awesome ",
            "review_score": "1"
        },
        {
            "review_text": "Loved the Game wish it was free ha",
            "review_score": "1"
        },
        {
            "review_text": "can't stop playing this game",
            "review_score": "1"
        },
        {
            "review_text": "I love fighting games. I like DC. Is a DC fighting game good? Yes. Yes it is. Just make sure you have a good controller to work with (and no, the 360 controller is not good for 2d fighting games) and you'll have a great time with this game. It's got solid single player, solid multiplayer, and some pretty great tools to help you build your skills for your next match. Honestly, this game should be the template for which every subsequent fighting game should look in terms of teaching its players. I'm looking at you, Marvel vs. Capcom 3.",
            "review_score": "1"
        },
        {
            "review_text": "Holy **** ... I bought this because the fights at Evo looked good and i thought it might be fun to have a go. I had no idea how good the single player campaign would be! Great story and flow, and the cuts to the fights themselves are great. It gives you an opportunity to fight as a bunch of characters, some of which i might not have given a go if I just had to choose from the list. Great concept. Highly recommended for fans of fighting games, the comics, or anyone just looking for a good animated movie with some beat-em-up action thrown in.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my, I did not know there is something better than Mortal Kombat",
            "review_score": "1"
        },
        {
            "review_text": "This is a terrible game and I hate this game so much!",
            "review_score": "-1"
        },
        {
            "review_text": "Great fighting game with a pretty confusing story.",
            "review_score": "1"
        },
        {
            "review_text": "Phenomenal for what it is, but glitchy as all get out. Oh, and the Steam Edition is just in perpetual slow motion unless you spend five minutes bug fixing. A ♥♥♥♥ port of a great fighting game.",
            "review_score": "1"
        },
        {
            "review_text": "Aquaman can breathe in space.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game. I recommend to anyone who likes a 2D fighting game. If you like Mortal Kombat 9 or X, then this is the game for you. There are plenty of characters to choose from. The mechanics are almost the exact same thing as MK9 and X. Only downside I could think is that each character only has 1 super move so watching the same super gets old after a while. Also, cutscenes are locked at 30 fps. Why would you lock something at such a low framerate? Personally, I like seeing 60 fps because it looks a lot more realistic and fluid. I could understand that some people lock their cutscenes at 30 fps because most films are filmed at 29, but this isn't a film people. This is a video game.  So overall, I would give this game a 8 out of 10. The gameplay is great. The story is pretty good. There is even some humor in it.",
            "review_score": "1"
        },
        {
            "review_text": "Great fighting game compared to Mortal Kombat",
            "review_score": "1"
        },
        {
            "review_text": "Even though I've only played a couple of hours so far I can tell I will have many more hours on it yet.",
            "review_score": "1"
        },
        {
            "review_text": "It is really slow on my pc. Don't get me wrong Injustice Gods Among Us is an awesome game. But it is really slow and to hard to control and takes alot of space. But I don't hate it.",
            "review_score": "-1"
        },
        {
            "review_text": "The story was the best part of the game. It was very engrossing and compelling. The fight was good, but not great. In my opinion, there should be a block button, not just moving backwards. Overall, if you're a fan of the comics, you like the story.",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly one of the worst ports I've ever played. FPS is all over the place, music is equalized very poorly, graphics are extremely sub-par for a two year old PC game. Input issues all over the place make some moves/combos seem completely random. Minor issues like redundant subtitles are more annoying when the rest of the game is such a mess. High Voltage unfortunately fulfills their stigma of being one of the worst developers/porters out there; play the console version instead.",
            "review_score": "-1"
        },
        {
            "review_text": "A fighting game where you don't just fight the characters, but you fight the unbelievely ♥♥♥♥♥♥ controls, no matter what myriad of devices you use. If your response to this review is 'get some stupid ♥♥♥♥ing specialty controller that costs 100 dollars and you won't use in any other game', you're a moron.",
            "review_score": "-1"
        },
        {
            "review_text": "clunky and dull",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game since my wife insisted for me to purchase a game that we can play together. Played a little bit of the Single Player mode, and the Versus mode. The game is very smooth and enjoyable. But I find it very hard to get a match online. Even if I managed to find a match, it will get disconnected during character choosing. Am I the only one experiencing this or do you guys have the same problem also?",
            "review_score": "1"
        },
        {
            "review_text": "INJUSTICE is a solid Tournament fighter. So how do I describe the gameplay of it? Ah! Imagine a place called the Tournament fighter supermarket where you can buy mechanics from other famous games. The designers of INJUSTICE are their most valuable customers. No seriously, this game has literally no unique mechanics that let it stand out. It feels like Frankenstein-tournament fighter. A monster clustered together. It's not unique but it’s fun and it has one of the best single player campaigns in a fighter I've ever seen. They story however takes it way to serious and it can be really silly sometimes but heh, why not. INJUSTICE is a great game but I rather recommend you buying STREET FIGHTER, BLAZE BLUE or MORTAL KOMBAT 9.",
            "review_score": "1"
        },
        {
            "review_text": "ONE OF THE BEST DC GAMES EVER NEXT TO THE BATMAN: ARKHAM SERIES!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty good, but if you have a old computer that can run this game its really glitchy but still a great game to play 9.9/10",
            "review_score": "1"
        },
        {
            "review_text": "A really cool and awesome game!Gotta love the exclusive missions and skins!",
            "review_score": "1"
        },
        {
            "review_text": "Seems like it'll be fun to play if I can just get the controls to work. Unfortunately, this is VERY poorly ported. There's no mouse control AT ALL, and you have to do everything in the menus with your keyboard or controller. You can't even use the Enter or Esc keys to go navigate the menu. I haven't even gotten to a point where I have a usable control scheme to play the game yet.  I finally got into the actual game, and it's just not playable without a controller, so I got a refund. I don't mean that it's a better experience with a controller; it's just plain unplayable.  I might buy the Steam Controller when it comes out, and if I do, maybe I'll give this another try. Perhaps it'll be cheaper by then too.",
            "review_score": "-1"
        },
        {
            "review_text": "Simple controls allow for fast but repetitive game play. An issue I have with the Ultimate Edition of the game is that everything comes already unlocked. There is nothing to work for. No secret characters, costumes, or levels. Everything is right there for you.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game with pretty decent graphics. Shame about raven's jaw",
            "review_score": "1"
        },
        {
            "review_text": "really good game, fun story line and a lot of things to do, but the community seems dead, i bought the game thinking i would play online with others, but theres only but a few playing the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a waste unless they fix the Multiplayer Ports.... comeon warner bros get with the program it has been 2 years now you think you would have fixes it..... Tools",
            "review_score": "-1"
        },
        {
            "review_text": "when you come home after office, you want something like that to heel you up in a quick time. Buy it &amp; have fun playing multiplayer with your friends &amp; family",
            "review_score": "1"
        },
        {
            "review_text": "My absolute favorite fighting game of all time. The controls are solid, none of the characters feel especially overpowered when played well, the animations are awesome, the story is fantastic, everything about this game is great. If you're looking for online multiplayer, you're going to be out of luck. I've had this game for months and I've never once seen another person online. However, if you can get this cheap and you love fighting games, I can't recommend this enough. If you like DC characters you'll adore this game.",
            "review_score": "1"
        },
        {
            "review_text": "Sh!ttiest controls I've ever found in a game. I made the mistake of not paying atention to the comments regarding that, and the mistake to buy this game. I deeply regret it. If you don't like to play with a joystick, like me, this game would be a pain in the ♥♥♥. Is so incredibly frustrating that for me at least, ruins everything else. 'So what? Just change them' Well, YOU CAN'T. You can just switch some, and not everytime that will work. Forget about making your own config, and about using keys that are anything but numbers and letters.  The rest looks good, the efects most of all. The characters are a bit too stiff or sometimes lifeless IMO (not talking just about Solomon Grundy).  I would have returned it if was possible.",
            "review_score": "-1"
        },
        {
            "review_text": "SF crossed with DOA of sorts, easy to pickup, hard to master, good fighting fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this unless you want to play it on a controller. It doesn't have any kind of optimization for PC, so you're playing a port with the dumbest general controls that you have to hunt and peck to figure out so that you can customize everything. G is the confirm button. Why? Why not. They don't care. This is just easy money.",
            "review_score": "-1"
        },
        {
            "review_text": "Best fighting game ever created.  Awesome History !    Lots and lots of fun!  For fans of DC comics, or just fighting game fans!  Please Play this game ! you won't regret",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the sales price. It's a pretty good fighter but it lacks in moveset variety and character selection in my opinion. But the game shines in its story mode and presentation. Voice acting is killer, music was nice, and graphics were grand for the time. A solid look at DC property.  But other than that, it plays kinda slow and clunky for fighters in its class. Port was less than stellar and there are probably some inherent issues with controller input. Online play is (surprise) broken and really there isn't much variation to keep me coming back. Still, a solid single player experience.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not experienced with fighting games. Not too good at them either, as this game forcefully taught me over and over again.  The good: -Interesting story, featuring a multitude characters, each with unique and relevant moves -Decent range of maps, most with dynamic backgrounds and changing areas -No one is too under- or over-powered, so Catwoman can beat Doomsday without any problems  The bad: -A lot of the special moves need overly specific conditions, so you're lucky if you even see that double jump reversal block thing the tutorial wouldn't let you move on from practicing until you did it 3 times in a row -The special cinematic move each character gets gets boring after a few times, only so many times I can watch Superman punch the Joker into outer space and back with the same enthrallment as the first time, especially when he just gets up right after and throws some fake teeth at me -It gets difficult enough that time has to be spent practicing with the current character and learning their moves, only to have the next 10 fights as other people, and by the time you get back to the character, you've forgotten everything  But who am I kidding, I should have just button mashed my way through it, and just bought a new keyboard after.",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, I absolutely LOVE this game! The story is amazing, and the little easter eggs that are throughout the campaign and stages are rather pleasing to the DC comics fan such as myself.   However, the online multiplayer is completely broken... None of the servers work, and nobody is ever online becuase of that. I bought this game to play with other people online - to show off my Injustice skills (which, although are lacking, are pretty good) , but I am unable to do so because the online is broken.  On the contrary, the graphics are amazing, the gameplay is really fun, and the characters are from all corners of the DC universe. I would recommend this game to people who buy fighting games for the story; an audience that is severly lacking...",
            "review_score": "-1"
        },
        {
            "review_text": "Good game but I there are some maps/characters that whenever I play the screen doesn't move and stay's frozen. My settings are the lowest they can be still nothing :/",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Satisfying when you hit someone else and great visuals and controls. BUT MORE PEOPLE NEED TO COME ONLINE",
            "review_score": "1"
        },
        {
            "review_text": "Really fun to play friends! Never harder to defeat other players!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good fighting game you cannot take that serious.   Pros: - Good graphic, mechanism and optimisation - Characters we all know – most playable and easy to be enjoyed  - Story mode that brings some fun and a smile on your face - Good multiplayer – not without usual issues - MK character as a bonus   Cons: - After a while it gets a bit repetitive - It needs more additional contents like in MK - Characters not balanced at all. Some of them really OP like this waterman and some just weak.  Conclusion: You can easy buy this game and enjoy it if you like fighting games and liked (or still like) superheroes from childhood.  My ratting 7+/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, a lot of fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "I am so angry with you, bought this game 3 days ago, I was so happy because I will can play wth another peoplein the online mode.   So since the first day I find a problem with the PING, the game cannot conect with loobies.  I have been search how to fix this problem but I see this bug is sice 3 moth ago. How can I PLAY!?  I know steam and the people or entrerprise who sell me it not are responsibles for that. Or thats what I thing.   Pero no se si seguir con el uego sea buena idea si este problma no ha sido solucionado, simplemente vi una noticia sobre este bug pero no veo nada para arreglarlo, quiero saber si van a ser posibles de arreglarlo o de darme un reembolso para que lo compre por otro medio.  Por que eso que visto en las paginas sobre que el juego debe correr a 60 fps se me hace una groseria a los que su computadora no es 'buena' como muchos mencionan.  Compre el juego por que ya habia visto los graficos con los que corre. Y son buenos, se que tambien depende de la computadora con la que uno lo juega. Pero esta version del juego que para todos salio obsoleta quieren que este con los graficos mas asquuuerosos, mi computadra no es tan mala, y no se por que este bug la afecta. Necesito jugar, por que como ya lo dije, por eso compre este juego.  Tuve que decir esto ultimo en mi idooma para poder redactar lo que siento, espero tengan buenos traductores.  Volvere a recomendar el juego cuando los problemas que tengo cesen. Les voy a agradecer mucho que reparen el juego. Para que mucha gente siga amando este juego que la verdad es uy bueno.  Atte.  Angel Torres   ",
            "review_score": "-1"
        },
        {
            "review_text": "Great graphics, great gameplay for some reason the hours played on this game is being shown incorrect. I have played it for lot more time!",
            "review_score": "1"
        },
        {
            "review_text": "I have always loved this game because it takes out the over-the-top violence that is usually in Mortal Kombat games and it adds an element that I am very fond of: Superheroes. This game is fun to play and some of the cutscenes are just plain awesome. I don't think I will ever tire of hitting people with the Batmobile.   As far as people complaining about online play, it works fine now. I am sure that it was just an issue of intial day Steam release.",
            "review_score": "1"
        },
        {
            "review_text": "A clear-cut and not-at-all-surprising 8 / 10  Pros:  - Amazing cast of characters! Only a few are missing from this roster, but you won't really care. All characters are unlocked from the start! Some really great skins are added here, although some characters have far fewer additional skins than others. A few, like Regime Sinestro, are kinda ridiculous, but that's ok. Effort was put into making the characters different depending on their skins as well. This was an extremely deserved an well-executed touch. Most of these effects are shown in Clashes when characters speak. Also, they speak to each other! That rocks! - Solid, fast-paced fighting mechanics makes this game as much of a thrill to watch as to play. Combos need to be practiced to be made perfect, no question. More on Practice mode later. The fast gameplay can be daunting for new players, but the game is fantastic at ranging difficulty and training in Practice mode, so don't be SCURRED :) You will be fine with enough time and energy. - Use of envirornment will give advantage, but these option can be toggled if you don't want that. Use of enviornmentals is versatile and varies between the different character types, thus making stage selection very important! There is quite a large variety for what is used and how they are used. In terms of enviornments alone, Injustice surpasses practically any other fighter out there, including games from Netherrealm Studios. - Graphics, sounds, and voices all spot on (Raven's voice is a little off, though). Easily some of the best background graphics in any fighter. I really, really want to emphasize the graphics and sounds; these are one of the best highlights of the game, no question. Each sound effect feels real and the movements and expressions of the models are eerily lifelike.  - Characters are well balanced, pandering to all types of players and their preferences, although there are not enough gadeget characters like Batman, Nightwing, and Green Arrow. Would be nice to have more of these (Arsenal, Red Robin, Red Hood, Ravager, etc.)  - Practice mode is extensive (with players able to record playbacks of combos) and statistics for every single move, such as frame counts and damage, are all noted and easy to find. Also, these moves can be pinned onto the game screen for players new to the character they are using (noobs and pros alike!). Definitely one of the highlights - Story is interesting and hard to stop playing. I have played it at least 10 times and I still love it. - Some 300 mini extra side missions (S.T.A.R Labs) to play through (some are very difficult!!!). - Online mode works well with a decent frame rate, despite very, VERY small population. I never froze up. Multiple game modes in multiplayer (King of the Hill, Survivor, Private/Ranked Rooms, 1v1), but TAG TEAM IS MISSING! THIS IS A HUUUUUUUUUGE LET DOWN!!!! - Battles mode is full of ladders that range from doable to impossible. Character endings are unlocked here.  Cons:  - As aforementioned, NO TAG TEAM!!! WHYYY!!!!!!!!!!!!!!!?????????!!!!!!!!!!!!!!!!!?????? They even teased it!!! :(((( - Controls on the keyboard will take either a ton of getting used to or (like me) a lot of editing. - Characters are plentiful, but Stages are sorely lacking. Most players just pick a select few they like and stick with them the whole way. A couple are even clones of each other! Where is Titans' Tower? Where is Star City? Some iconic locations are really missed among fans like myself. - Character intros, outros, and Super moves NEVER CHANGE! This gets annoying, even though the Supers are still cool. - One thing wrong with fighting mechanics: once your opponent starts juggling, not much you can do if you can't Clash to break the combo. This is a glaring issue only if they have mastered combos that take, like, 91% of your health, so be wary of your opponents. - Multiplayer: TOO MANY SPAMMERS OF DEATHSTROKE AND JOKER!!!!!!!!!!!!!!! Uncool, guys. - Lacking motivation and reward for S.T.A.R. Labs missions, especially with this Ultimate Edition where pretty much everything is unlocked. - Game is taxing on your CPU. You need a really high-end processor for this game, unfortunately. Not like Batman: Arkham Knight, but still a pretty good one is needed. - Despite awesome Practice Mode, Tutorial mode is really lacking and barebones. It doesn't thoroughly teach you all of the ins and outs of the gameplay, so you just have to find them for yourself. - Story mode takes only about 4 to 5 hours the first time around, and that's being generous. Most can finish it in a little over 3. Also, mini games are crammed into the story (mostly QTEs, although Green Arrow's was good) that really just detract from the story's gameplay experience even though they give a health advantage or disadvantage to the player depending on how they do.  Despite all these shortcomings, the game is just so fun it will more than make up for these complaints that seem more like nitpicks rather than game-changing flaws. This is a title you can keep coming back to, whether alone or with a friend, and will have many an hour pounding Joker's laughing butt or Luthor's bald head through buildings and into the ground. The level of detail this game has gives a practically flawless aesthetic feel while playing, and with the sounds, graphics, and fast-paced action of the core gameplay, you won't care about any S.T.A.R. Labs stuff or the Tutorial. For fans, there are enough character related details, skins, and lines that will keep you satisfied.  In all honesty, I have to recommend this game not because it's a great DC game, or a great fighting game in the NRS lineup, but because it's just a great game overall. I think I was a bit too specific in the cons section, because you really won't notice some of them for quite a while. Well, when you play the game for a 100+ hours, that's what happens. :)  Peace everyone, and enjoy! Thanks for reading! :))) :)))  -LC",
            "review_score": "1"
        },
        {
            "review_text": "Having to input specific 'combos' instead of just stringing together normals feels wrong, and the input buffer is too punishing.",
            "review_score": "-1"
        },
        {
            "review_text": "one of the best games that can be based about super heros and it has the best heros that you can want to play as",
            "review_score": "1"
        },
        {
            "review_text": "Mortal Kombay meets DC Comics . An altenate world where Superman is no longer a boyscout. Any fans of Mortal Kombat or DC Comics stye games should consider getting this next time it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game to play with your best friends!",
            "review_score": "1"
        },
        {
            "review_text": "it is an awesome game to play amust have!But i still cant pause the game help pls :(",
            "review_score": "1"
        },
        {
            "review_text": "Smoothest fighting game I've ever played, amazing roster, mind blowing ultimate moves. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun -- this game can be picked up and played in short 10-minute bursts, or in hours-long marathons. Gorgeous graphics, terrific voice acting, and a compelling storyline to play through. This is the Mortal-Kombat-style game that elevates the genre -- and the closest thing to a Justice League movie this side of the cartoons. Can be coupled with a companion free-to-play app on the tablets and phones, and interlocking acheivements that unlock content in both as you play. A gamepad is a must however, as the mouse is useless and keyboard layout very odd and inconsistent. Best enjoyed on a really fast system, lots of RAM and CPU and GPU horsepower, and if possible, on a Big Screen display (but not necessarily). You see this one sale, buy it and enjoy... great replay value, and lots of mindless fun.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent take on the traditional Mortal Kombat style of play. This game is amazing on all fronts, whether it be VS combat, missions, or story mode. Definitely a wise purchase, does not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot express my love for this game, looks great and you get to play all your favourite DC characters. Do look into getting an X-box controller to play it though, keyboard isnt the best experience.",
            "review_score": "1"
        },
        {
            "review_text": "Well, i was hesitant to get this game since its quite expensive. Saw it on a special and got it, still wasnt so sure until i played it.  Its quite a solid fighting game, probably not as solid as ssf, but still it has his merits.  Graphically, the cinematics are great.  While the style of the fighting is not as 'realistic' as in other fighting games, once you play a while, you will familiarize with the style, its quite neat. Also this is the first fighting game that i see that has interaction with the enviroment. I saw this on the presentation of the game, thought it was nice, but once i played, it really adds a lot of variables to the game. Those things can get you back to the fight if you are losing.  The campaign i though it would be different, i was thinking more of picking a hero to play the campaign and then have a point of view of each, but it isnt. You are told a global history and you take control of different characters as you advance with that history.. The campaign is around 60 fights, probably some 5-6 hours, but this is a fighting game, you can do 1v1 with a friend or online, so you can get a lot of hours of gameplay here.  The story of the campaign is great, although not all of the playable characters appear on the campaign, i think they could have somehow add them, but still, great.  Also you have some extra features that you dont have in other games. You have a leveling system (which i dont know why or how to use it, but im sure is useful). You can see the bio of the heroes/villians, unlock some avatars, icons (prob for multiplayer which i havent tested since i dont have the best internet connection).  The voice acting is great, though im not a real fan of dc, i barely know some of the characters, i dont know if they are the original voices of their respective shows, the acting was great, very beliebable and there was not a single annoying voice (like the ones in cartoons).   The soundtrack was also very well done.   All in all i think this is a must for any fighting lover game, it is dark, it is different. 7.5 for me.  Its a bit pricy, i dont know if its worth the 40-50 bucks, specially if you are only playing the campaign and occassionally, but probably about 20-25 sounds allright for the work these good programmers and graphic artist did.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best fighting game I have ever played! I always wanted to play something epic, and there it is - Injustice: Gods Among Us a fantastic game with DC superheroes. I was not a big fan of DC universe but after playing this they gained a new fan. The story is interesting, there is a lot of challenges. The game is well balanced, and the fighting mechanics are well developed. Injustice is quite similar to Mortal Kombat, which I love, but instead of Fatalities you have Super Moves of every hero and villain. Of course every character has unique superpowers and/or gadgets to kick opponent's ♥♥♥. There is also a possibility of using background objects during the fight. Moreover you can kick out your opponent to another battle area and there continue inflicting pain. This is why this game is so Epic!   10/10  P.S. 1 I didn't know that Aquaman is a total badass :D P.S. 2 It is really fun to kick Superman's ♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "Not recommended if you are a keyboard &amp; mouse player.",
            "review_score": "1"
        },
        {
            "review_text": "Fighting games for the PC finally!! Thank you Steam and thank you Warnerbrothers, and who ever else is responsible for publishing this for PC!!! Woohoo!!",
            "review_score": "1"
        },
        {
            "review_text": "Developers are not fixing bugs. Many people have slow motion. Multiplayer is unplayable. U can not find opponents. Multiplayer is slow motion even if u somehow fix single player.",
            "review_score": "-1"
        },
        {
            "review_text": "A fantastic fighting game with inspired characters.  The story is AWESOME, please don't let the average critic make you think otherwise as it kept me glued to the screen fight after fight.  The combat is fluid, fair and very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Felt good playing this :) lots of 'cool' features in it. Not mentione DC.. who didnt grew up with them...  Very recommended, even next to Street Fighter or a Mortal Kombat.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game, lot's of familiar heroes/villains. It's really easy to get into it even if you're not really into fighting games. The flow of the combat is good and once you find a favourite character to play with, plenty of customization items will be unlocked. Apart from scorpion none of the characters feel overpowered.  The only thing i was not happy with is the online gameplay; matchmaking is kind of slow and sometimes the matches turn into slow-mo fighting (don't know wether it's because of connection speed or someones computer specs). This can seriously ruin your score when doing online ranked matches. Matchmaking is also not the greatest, as such you can end up playing 3 ranked matches in a row against the same opponent (which is really bad if your opponent is really good).",
            "review_score": "1"
        },
        {
            "review_text": "Wow I thought this was going to be just a regular fighting game. Turns out there is an incredible story line that keeps you playing to find out what is going to happen next!!! Two thumbs up!!",
            "review_score": "1"
        },
        {
            "review_text": "I like fighting games and I miss them so much on PC. Next to very good MK IX, Injustice is even better game.  1. It has fantastic fithing style combined with destrucible environment.  2. Graphic and music is very good (I think on PC it is better than MK with much better optimization and without low quality in game movies). 3. Story line in campaign mode is FANTASTIC - really, I don't wanna spoil you, but this game is worth to be tried in sinlge due to superb story. 4. It has large amount of additonal content: it allows you as Bane to destroy Batmobile (like in original Street Fighter 2...) or as Superman shoot eyes-laser to cars being throw at him. 5. Characters super specials moves are GREAT: they ar very brutal and most of them looks amazing (better than MK X-rays!).  I really, really recommend you playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Injustice is probably one of the most addictive DC Universe Fighting Game there is. Similer to Super Smash Bros. Injustice features a variety of DC Universe Characters like Superman, Batman, Wonder Woman, Lex Luther, The Joker and my favorite character, Deathstroke. However you need a beefy computer to play this game. My current computer is extremely slow, making the entire battle run in what appears to be 'a very annoying, laggy, jumpy slo-mo battle' this upset me greatly. As I am writing this I may have found a way to at least reduce the lag, as I have seen apperent change in lag with the change of my laptop's graphic resolution/settings on Batman Arkham City. However if you do have a beefy computer and like the DC Universe, even if it is only one character, this game his highly recommended. Gameplay mechanics aren't that great with a keyboard but once you get used to them gameplay quality increases. Character design I have to admit is not so great for Wonder Woman. She doesn't really look all that much like a woman. Her face seems to look 'more manlike' I also didn't like the lack of skins for the dlc characters like Batgirl and the character Nightwing. Being a big Batman fan and knowing a lot about the diffrent costumes it was very upsetting to see these characters not have many skins. The story for this game is absolutely amazing. It sort of reminds me of an episode of Batman: The Brave and the Bold where the Injustice League is evil and the villians (with some changes of appearence and character) are good in that dimension. However this is much more dark then that Batman cartoon since it was based on the 'Silver Age' Batman where everything was campy. It also reminds me of the alternate dimension or timeline in DC Universe Online in some aspects. Since my computer wasn't really qualified to play this game I decided to watch walkthroughs on the game on Youtube and took a look at the online multiplayer. It seems simple. Just beat the other person. It looked pretty fun but as I am writing this my internet keeps disconnecting and reconnecting every few minutes. The selection of characters could have a more variety of characters. I would like to see some of the characters you see in the background of the stages become playable characters like Parasite, Gorrila Grodd, Metallo, Scarecrow and maybe even the Atom and Black Canary. This game came out a while ago however and I see the chance for another DLC to come out is slim. Combat in the game isn't really all that smooth. It's very similer to SSB in this style. I like it when combat in games sort of 'flow and have a rythem' making combat a lot more visually appealling. The stages in the game are pretty streight forward. I would have like there to be more stages and a lot more enviromental changes as combat changes/affects the stage. Glitches are not common. However I have seen glitches in the special moves where you should become invincible or actually hit someone. However sometimes it doesn't happen when it should. Overall I give this game a 6/10 and reccomend it to anyone who is into fightning games or anyone who like the DC Universe.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun to play. The gameplay is nice, the interaction with the surroundings is pretty cool. The story mode is also quite good but a bit short, I think.  You will have fun playing the game even if you don't know all the DC heroes. I only knew Batman and Superman (and a bit of Catwoman/The Flash) when playing this game and had lots fun.  If you are an experienced player or have a whole day time, then you will play through the story mode in a single day.  ",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to be Batman, punch Batman, shoot Batman or any other DC superhero?  No? What's wrong with you.  Yes?  Buy the damn game.",
            "review_score": "1"
        },
        {
            "review_text": "Completed the campaign in 5 hours, but for five quid it was worth it. Lovely to look at, and not too difficult, just a good time kicking back with a cat on my lap. Would not have been happy paying full price for it though.",
            "review_score": "1"
        },
        {
            "review_text": "There is only one thing i don't like about this game,the fact i didn't get it sooner! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "So, this game has all the characters and skins already unlocked as it is the ULTIMATE EDITION. However, i will have you know that the pc port is kinda bad, for starters, you cant navigate the menu with a mouse but have to use the keyboard, which tells you already what problems are at stake. The default control scheme also made little sense to me so definetly go over and switch that up first.  The graphics are great for a fighting game and the controls are fine. You can make do with a keyboard but honestly i'd recommend a gaming controller, which this game should probably support for MAXIMUM ENJOYMENT of this game. All in all, if your PC can run this and you're into fighting games and or superheroes and comics this is definetly something you should consider. The campaign is kinda short with a pretty intriguing story so thats not bad, i spent around 4hrs to complete the story. Besides that, there are tons of features still available such as ladder matches and some special missions called STAR MISSIONS with great variety. IE you can control catwoman's cat in a burglary/stealth mission which is pretty good. So you should definetly check this out, if you can i would totally guarantee a controller over a keyboard as that would help maximize your experience.   This game also has VERY good diversity among characters who have indentifiable skills, moves, and abilities. Locations and stages are very iconic and the interaction with your environment helps to immerse you more. For those who like combo fighitng games like myself will not be dissapointed, the learning curve is a bit steep if you've never played fighting games before but its not overly complex or anything but just right, every character has unique move lists, and training modes are also readily available for those who wish to polish their skills. With that, i give this game a 8.6/10 with the content being incredibly vast for a fighting game, definetly check this game out",
            "review_score": "1"
        },
        {
            "review_text": "With performance issues in mind this game is not suitable for online competitive play. The story mode however is genuinely a lot of fun and I avidly button mashed my way through the whole game.",
            "review_score": "1"
        },
        {
            "review_text": "Dis gaem is awsum now someboody halp me get the unlockkses for mobile",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! If you like games like Mortal Combat then this is the game for you! It is action packed, has a great story line, has multiplayer, levels, and it even can connect to your phone (app of Injustice) for even more fun. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Visually spectacular, great storyline, everything you would expect from NetherRelm studios... except, why does it feel like the characters are fighting in a vat of treacle? The character movement is sloooooooooow and some characters like the Green Arrow almost seem to float when jumping. Leave your quick reflexes at home kids. You can almost make yourself a coffee inbetween moves.",
            "review_score": "-1"
        },
        {
            "review_text": "Just Mortal Kombat with DC heroes and villains. Though the combos are much easier to perform, the games is still challenging (exactly because of that - you just keep flying). Story is based on the cartoon - quite amusing. I recommend this game, mostly for DC fans. :)",
            "review_score": "1"
        },
        {
            "review_text": "The game is ♥♥♥♥. Despite learning how to play this game properly, the AI is just increadably programmed to mash combo after combo. It isn't fun at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I restarted the game. I closed all other applications. I disconnected from the internet. I restarted my MSI GE60. I started the game with Nvidia game booster. I lowered the settings to practically NES graphics so the text was unreadable. This is a terrible port.   If you like games in slow motion, maybe you'll enjoy this, but when it takes 5 minutes to get through 90 second fight (probably closer to half that since I've never ran out of time), it's ridiculous. The game is swimmy for 90% of it, then suddenly a fight will be lightning fast. I can't tell if I'm just used to the slow-mo or if the fights are actually sped up, but the Xbox version was nowhere near this awful. It seems like some fights start out fine too, then get boosts in speed or slow downs, usually dependent on if something is happening in the background. Some stages with a lot of commotion and RB stage attacks are just impossible and doing the super move makes it even worse. The fighting is superficial combos and button mashing, but the game could be fun, if it weren't the awful port. I'm running Titanfall on low settings, so I should be able to handle this on at least moderate, but it's not optimized.   The story had potential but it's too black-and-white. It's gritty and edgy themed, but it has the morality meant for children. Here are the heroes, here are the villains. They're working together! But these are still the bad guys and these are still the good guys. There's no gray area and the characters don't bring it to life. Green Arrow tries to be funny, but no one has personality that stands out except The Joker and Harley Quinn, which they're hit and miss. Everyone else is this lifeless shell of their character. The writers seem to think since you know who these characters are, they don't need personalities, but Green Arrow, Green Lantern, Wonder Woman, Aquaman pretty much are interchangeable. Cyborg brings a bit of life to it, but it's his VA and not his actual character traits that stand out.   Maybe if your PC can run it, it'd be a better buy. I'm just glad I got it on sale so I only wasted a little bit of money.",
            "review_score": "-1"
        },
        {
            "review_text": "best fighting game ever, I have played them all (War Gods N64)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun. Def get if on sale for a ridiculus low price (what i did) or get on the console (would play much better)",
            "review_score": "1"
        },
        {
            "review_text": "unplayable coz of this slow motion bug...the game is good but the pc port is horrible  and just in case some1 thinks so my PC specs are wayyyy higher than the minimum requirements",
            "review_score": "-1"
        },
        {
            "review_text": "Great action oriented fighting game. While not as technically deep as a Street Fighter of King of Fighters title, due to the simplified controls, it is still a great game with some interesting tactics at play. This game shows that the Mortal Kombat developers can really step out side of the old template and come up with something else good every once in awhile.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun, until you get to the really strong villians, then you can't do anything unless you stay away and use ranged attacks. If you want to get enraged, buy this game, but if not, stay away from it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is yet another brilliant masterpeice by Netherealm! One problem along with Mortal Kombat Komplete Edition, it's like a ghostown with online fighting! I'm currently in process of find users whom desire online play",
            "review_score": "1"
        },
        {
            "review_text": "This one BY FAR redeemed Ed Boon's make with the DC Comics. i wont lie DC vs MK was OK but it wasnt good. this made me want to get in more in DC comics. the combat style was bad ♥♥♥, the interactions with enviroment, the super moves and combo system works very simliar to MK 9 and above else it got not just heroism but also the dark side of the heros we know and love. i would recommend this on here when you do have a controller and have the urge to play as your hero.",
            "review_score": "1"
        },
        {
            "review_text": "They actually did a great job to a single player experience!!! The story mode is excellent, and I had so much fun playing it! If you are a DC Comics fan, you need to play this game! Now, seeing it as a fighting game, to play with your friends local or online, it's good as well, the controllers and possible combos and specials make it a good fighting game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a terrible, terrible port and they don't do anything about it.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are wierd without a controller and the story is really confusing, but it has good graphics, simple yet rewarding combos, intersesting maps and a bunch of other stuff to like about it.",
            "review_score": "1"
        },
        {
            "review_text": "It tries something different and it's not ashamed of it. The fighting system will require some learning, there are quite a few things to have in mind during a fight. The game has excellent tutorial section, you'll probably want to replay it a few times to get the hang of things. The roster is big and every character feels unique, so you have plenty to choose from.   My only (minor) complaint is the graphics, its really poor. Textures are sharp, but materials and shaders are basic, the environments have poor lightning and are barely detailed. You can see that in transitions between screens an arenas, and in the story mode in particular, where some sceneries look like in some old MMOs. It's kind of weird for a 20 GB download... Still, that should not prevent you from enjoying this great title.",
            "review_score": "1"
        },
        {
            "review_text": "Might be the best fighting game out there.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the somewhat lacking character roster and near lack of online multiplayer opponents, an all-in-all good buy if it's on any amount of sale. Hell, the campaign mode alone would of been worth $20 in my opinion. Obviously this isn't a highly competitive fighting game, so balance between the characters is a little... screwy. Some of them are nearly useless without their ultimate power, and some can just spam the Light attack and kill any opponent (Doomsday falls in the latter category. He's a bit of a monster to go against) Offers in-game 'challenges' to help learn each character via a single player mission type where it's basically just 'You're on X map using Y character, perform this combo set to move on to next lesson.'   7.5/10, would buy on sale again!",
            "review_score": "1"
        },
        {
            "review_text": "A solid fighting game with a great story. The cut scenes end up stealing the show, but the fighting mechanics are a nice mix of deep but easy to use. Moves aren't overly complicated and there are lots of different ways to win a fight. The environments are very interactive (scene transitions, stuff to smash), and the super moves are brutal and beautiful (and easy to trigger). I imagine it will seem somewhat simplistic for hardcore fighting fans, but everything was solid and accessible. After the main story (6ish hours) there's a ton to do if you love the fighting, but I found myself happy to move on.",
            "review_score": "1"
        },
        {
            "review_text": "Can't speak for the multiplayer as Neatherrealm has yet to put out a game with good net code but I reasonably enjoyed story mode and the achievement hunting I did. Grab it for cheap.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game becasue of it's superheroes and fluid fighting(i'm also a big DC fan), but this was made by the same people who made mkx...so i was expecting a lot more blood/gore.",
            "review_score": "1"
        },
        {
            "review_text": "good game. would recommend to cerberus ",
            "review_score": "1"
        },
        {
            "review_text": "even though it seems ive only played this game for one hour, ive played on console for around 200 to 300 hours, this game got me into fighting games and also changed how i look at games in a wierd way lol. i definitly recommend this game for the simple fact of being a comic fan and also a nostalgic type feel even, even though the game isnt played online that much anymore its still a great way to get into MKX and USF4, ;3",
            "review_score": "1"
        },
        {
            "review_text": "Look For the Lower Case 'L' And You Will Be Kissed Tomorrow: LLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLlLLLLLLLLLLLLLLLLLLLLL LLLLL *Now Look For The Q And Your Wish Will Come True: ... ... ... ... ... OOOOOOOOOOOOOOOOOOOQOOOOOOOOOOOOOOOOOOOOOOOOO O.. .OOOOOOOO *This Is Really Hard, Now Find The 'N': MMMMMMMMMMMMMMMMMMMMMMMMMNMM *Now Find The Mistake: ABCDEFGHIJKLNMOPQRSTUVWQYZ *Something You Really Want, After the countdown!!!!! 10 9 8 7 6 5 4 3 2 1 Now Close Your Eyes And Make A Wish! ;*;*;*;*;*;* Now Paste This On 9 pages And Your Wish Will Come True! Hurry, You Have 20 minutes! Or What You Wished For Will Be The Opposit",
            "review_score": "1"
        },
        {
            "review_text": "Well, the campaign for this game if extremely interesting and a very entaining one to live in.  But the default keyboard controls make the game extremely difficult to play, the tutorial is too short (and does a horrible job explaining everything), and the game still suffers from problems the old Mortal Kombats had: You get to a point where the enemy AI is so difficult that they can combo you until your death.",
            "review_score": "-1"
        },
        {
            "review_text": "Really great game on the consoles, but even on a good PC dont expect more than a slideshow.",
            "review_score": "-1"
        },
        {
            "review_text": "60/100 It's probably not fair for me to review this. I never found the charm in Mortal Combat games, where a pre-executed script runs everytime I type in a memorized set of commands.  Having said that, this has a great story.",
            "review_score": "1"
        },
        {
            "review_text": "I am not a big fighing game fan, but wanted to give this one a try becuase of the DC characters.  I picked this up during a sale for about $7.50, which was the right price point for me.  All in all I enjoyed the game and felt I got my money's worth.  The story is entertaining, albeit a little short. I come back to the game now and then when I have got some time to kill or just want to kick some a**.  I don't see how you'd play this game using a keyboard and mouse. You've got to have a controller.",
            "review_score": "1"
        },
        {
            "review_text": "I am not usually a fan of fighting games, especially since I am using a PC keyboard, which is less than ideal (there was no way I could do some of the juggling combos) That said, this game was great.   It had a single player story that was engaging and well written, not the best story ever, but certainly the best story I've ever seen in a fighting game and an enjoyable story in general. It was very epic, and most fights come across as having real power behind the fighters. The scenery gets destroyed not just from you grabbing cars and throwing them at people, but from the backgrounds getting demolished as you perform powerful moves.  My only complaint, which is very minor, is how the special moves while they do roughly the same damage (balanced), can very in visual power pretty significantly. One character puts an explosive pie between your feet. Another literally punches you through planet earth...twice. It means performing a special move as the first character feels a bit...underwhelming.",
            "review_score": "1"
        },
        {
            "review_text": "Freakin Best Game you Can Be SCORPION!",
            "review_score": "1"
        },
        {
            "review_text": "It was somewhat fun and interesting, but it's a crappy port from console. During cinematic key press sequences, it'll show you the buttons you have binded, but really only responds if you press the default buttons. During fights your combos and key presses don't always go through and it leaves you wide open. There is also a significant frame rate drop at times, even when my computer far exceeds the recommended specs.  Note it also only takes 4 hours to finish.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is fun, but unless you have a gamepad or want to spend a bunch of time customizing your controls don't bother. It is definitely a console port and no thought was put into the controls on a PC",
            "review_score": "-1"
        },
        {
            "review_text": "My favorite fighting game, shows how much i play fighting games.",
            "review_score": "1"
        },
        {
            "review_text": "Worse than Call of Dogshit ports.",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who enjoys good fighters and gets really deep into frame data etc. this game is the perfect game to jump into the fighting genre or for everyone who enjoys the DC Universe as much as I do. Before this game was ported to the PC I actively played on the PS3 version of the game climbed the ranking ladder even on the 7th place, after playing around 5 hours a day, for about 4 months and it still didn't get boring. It may not be as challenging as a Street Fighter or a Mortal Kombat, but there are plenty of combo strings to master, many characters with very diverse playstyles and many things to do outside of just fighting online. There are two downsides to this game particular: The first problem is that the online play on the PC is quite underpopulated. This can result in waiting 5 minutes for a match and then getting downed by someone very good if you are completely new to the game and you just start to experience PvP experience. The second thing is the 'STAR Labs' Missions, which are character specific minigames. even though every character has 10 of those, you will soon recognize that there are missions that are 3 times in this mode, for 3 different characters, just with a reskin.  Other than that I would say this should be an instant buy.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game if you like DC comics. The story is a bit too much out of the ordinary but so is having many Superheroes and Supervillains in one game fighting each other. Awsome Game!",
            "review_score": "1"
        },
        {
            "review_text": "I am not normally into arcade style fighting games but I have thoroughly enjoyed the very brief story campaign of Injustice. I wish the story had gone on a lot longer and a little more indepth -- but I'm normally an RPG guy.  You don't need to be a pro at fighting games to get through the story, pull off the occasional awesome combo and appreciate the pretty graphics (unless you're on 4k rez in which case it will look a little rough...)  I had so much fun playing my favorite comic book heros. I strongly suggest a controller (keyboard was clunky and I made the switch to controller fast!) and don't be scared to try it if this is not your normal game genre -- you might actually find yourself having a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Wtf 2 days of waiting for this the gamme keeps crashiing ",
            "review_score": "-1"
        },
        {
            "review_text": "'And justice for all.' 9/10  For someone who isn't too familiar, or very good at fighting games, 'Injustice: Gods Among Us' was surprisingly easy for me to get the hang of once I battled a few opponents. Most fighting games I play just aren't that interesting to me, and that's mostly due to the fact that memorizing button combinations, and taking the time to find a player that I like isn't a journey that I'm willing to take, majority of the time. And it's that reason, and that reason alone why only a few fighting games such as 'Smash Bros, Power Stone' and few others really stand out to me as being highly memorable.  But with 'Gods Among Us', I found myself landing combination after combination early on, almost as if the control scheme was tailored for button mashers, and unskilled fighters to catch on quickly, and it kept me interested and playing long enough to actually get halfway decent at the game. Now maybe all of that is just some stuff that I made up in my brain, or maybe it's not, but 'Injustice' is one of the few fighting games I have actually enjoyed in recent years.  Another aspect of this game that I enjoyed way more than I thought I would, was the story. Most new age fighting games create some strangely flowing plot that barely makes sense to explain all of the fighting, and this game is no different, but it worked nonetheless. There's just something about an evil 'Superman' that really gets my blood boiling. If you're like me, and have a difficulty getting into most fighting games, but would like to, consider picking this one up.",
            "review_score": "1"
        },
        {
            "review_text": "Worst port ever GTX 770 phenom 6 core overclocked to 3.7ghz im at like 28fps tried lowering everything or turning it off still the same another crappy port my WB good job why is this s**t has high reviews I do not know.",
            "review_score": "-1"
        },
        {
            "review_text": "dont get mne wrong its not a bad idea but the thing that utterly drove me away was its dumb as ♥♥♥♥ ♥♥♥♥♥♥♥♥ control scheme for keyboard users",
            "review_score": "-1"
        },
        {
            "review_text": "I actually preferred this game to MK9 made by the same developer. However for the price I would not recommend unless you have other friends who will play. Fantastic game however would not recommend for this reason.",
            "review_score": "-1"
        },
        {
            "review_text": "11/10 would bang... simple. great game",
            "review_score": "1"
        },
        {
            "review_text": "I Love DC Hero Game Very Much",
            "review_score": "1"
        },
        {
            "review_text": "Injustice will appeal primarily and obviously to fans of DC and hardcore fans of fighting games. The Ultimate Edition is worth picking up because of the additional content and the cinematically interactive environments that crumble and transition around the fighting. Unsurprisingly the PC release isnt without its flaws and comes wih alot of tricky button mashing as these kinds of games are known for; apparently the only way Aquaman could ever have a chance of winning against Lex Luthor is by stunting out a TAB, K, K, L + J, LCTRL + TAB. Be prepared to either buy a controller or seriously configure the key layout.   Other than that, its a good game and definitely one I'd recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - You get to fight as Batman, the Joker, Harley, Flash, and whatnot. - Decent graphics. - Cool moves, in the spirit of classic comic.  Cons: - ♥♥♥♥♥♥♥♥ default control schemes. - This might be me, but the special moves are pourposefully obnoxius and unreliable to perform. - Atrociously surrealistic plot, in the spirit of classic comic. - Tekken-style movement (as in, all characters except Flash seem to have weights attached to their feet).  Veredict: 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game. Like the characters. Kinda funky controls on the keyboard. Otherwise ok",
            "review_score": "1"
        },
        {
            "review_text": "Really dumb game... but also really pleasant to play through with a fun story and characters. I didn't touch the multiplayer, just went through the entertaining single player content and messed around. If you aren't overly concerned about spending money, there's a good 6 or 8 hours of entertainment here.",
            "review_score": "1"
        },
        {
            "review_text": "Like Batman? Like Scorpion? Want a good fighting game with good story? See the pros and cons  Pros: - Have Batman - Have Scorpion - Great game - Great Story - Nice challenges - Cool maps and transitions - Cool unlockables  Cons: - Not totally otimized to PC - Online community almost dead - Game desconnects from online battles  I, personally, would recommend ONLY for the local multiplayer (still works) and for the single player",
            "review_score": "1"
        },
        {
            "review_text": "My lifes dream has finally come true. To play as Zatanna, catwoman, harley quinn, martian manhunter, hawkgirl, killer frost, raven. I can die happy now. Great port for the Pc version. No lag or problems at all.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Still a better port than MK9. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You need gamepad to play this, or better yet, two of them. Playing the game with friends is the best choice you can make, seeing who will win in a fight, Doomsday or Wonder Woman, Lobo or Superman, each hero/villain has different fight style and they are so much fun to play with. Along with Mortal Kombat, the best PC fighter game.",
            "review_score": "1"
        },
        {
            "review_text": "5.1/10 - Urgh. Just... Urgh!  This annoyed me. Plays well, looks good. Decent amount of characters with a host of skins available. Easy controls to master for those who are familiar with the Mortal Kombat series. The story was rubbish, as is the leveling system.  It's not a beat'em'up, well it is, but it doesn't quite feel like it. It just feels a little hollow. It makes me wonder if LEGO had made this how much better it would have been, which is odd but likely true.  Would recommend only for those that are a a fan of DC as you'll get some fan satisfaction, especially with the voice acting if nothing else. Or if your a MK fan as the gameplay with sit nicely with you. For those that love beat'em'ups, nah it's just not quite there.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this title because of the DC license, being a huge fan of comics...  Long story short, it's not very good at all verging closer to straight up awful. The controls are clunky even after manual configuration, the graphics are second rate for even last gen console and the tranistions between areas is plain ugly and jarring.  The game focuses on the Justice League who are taken into another timeline, a great little setup for an alternate story that's not really bogged down by the rules of the new 52 of pre-52 universe. It's a shame that this story line is tied to a Mortal Kombat fighting game which seems to waste the potential it gave itself, instead of focusing on a badass new world ran by a tyrant superhero we get one transition fight scene to another, since this game is a fighting one. It's not super smooth going from one fight to another and comes across forced, unfortunatley this genre game is not built for an intense story that they try to offer.   Whoever redesigned the suits needs to take a step back and let someone else take over, the over armored and over styled outfits look ridiculous, especially Batman who straight up looks like he has a pair of underpants for a cowl, what is that faceplate?   The voice actors are not great, sounding bored through most of the lines given. This is most evident in Hal Jordan who lacks any real charisma or attitude, instead opting for cliche male super type voice.  Overall even on sale this game disapoints, it's potential that's wasted on a game type that doesn't need elaborate storys to succeed. As a standalone animated film this would be enjoyable, as a game it fails utterly. Going from 8 different areas or so and through each character twice is an absolute slog.",
            "review_score": "-1"
        },
        {
            "review_text": "Shia says this is a good game for recking scrubs but its dead now.",
            "review_score": "1"
        },
        {
            "review_text": "^^",
            "review_score": "1"
        },
        {
            "review_text": "This game put Batman V Superman: Dawn of Justice to shame. Why? Well because it doesn't suck. Injustice: Gods Among Us has an interesting story and great and fun combat to enjoy over and over again. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "fun game really short",
            "review_score": "1"
        },
        {
            "review_text": "I'm not usually a fan of these type of fighting games but I couldn't pass up the chance to play as some of my favorite comic legends. It's a fun button smasher and the campaign isn't too bad over all (though a little short). If it is on sale, go ahead and grab it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Awesome story line, graphics, combat and controls (if you have an X-box controller)! Though, it's super lagy on steam link.",
            "review_score": "1"
        },
        {
            "review_text": "I think you'd better use your controler to playthis game.It is hard to control with your bloody keyboard",
            "review_score": "1"
        },
        {
            "review_text": "This game, is f**king amazing. The only problem is that even with a great computer, certain parts in this game tend to lag up a bit, but it usually always works fine.",
            "review_score": "1"
        },
        {
            "review_text": "I love thsi type of game and i more love DC. But this game dosn´t got any dlc or new character like mobile version. I mean chalenge on phone when you can get reverse flash, and new and new champion :(",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game if you like fights, also you will meet there batman superman and other dc characters",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. No messing around with fetch quests or running to your next mission. it goes from cinematic to fight back to cinematic with a story that draws you in.   Good game if you're bored. I completed it in one sitting.",
            "review_score": "1"
        },
        {
            "review_text": "This game is everything you would want, but the biggest battle is against the controls.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but controls for keyboard are weird. I'd reccommend getting on a console if you don't have a controller hooked up to your computer.",
            "review_score": "1"
        },
        {
            "review_text": "the game was good 9.57/10",
            "review_score": "1"
        },
        {
            "review_text": "This game just barely gets a yes on my recommendation. The actual fighting engine is competent, but the online component has been broken every time I've had to use it. I'd recommend buying this if you want a single player experience, but skip it unless the online matchmaking gets a solid fix.",
            "review_score": "1"
        },
        {
            "review_text": "3/10 This game in my opinion is the biggest let down of 2014 for me as a big DC fan.  -Clunky controlls (Good luck getting your attacks to work like you want them to) -Slow paced fighting (Aside from computer players) -No block button (DC Heros are not smart enough to block)  Review:  If you are expecting a Mortal Kombat style fighting game with DC Heros, Villians and Story then half of your expectations will be met. Yes the charecters are DC Heros and Villans with Scorpian because why not and the plot is rather nice infact I love the story.   However I find the controlls to clunky and slow which makes enjoying playing as my favorite DC Heros impossible, Even the Flash, One of the fastest in the universe is slow as molasses.    You may be thinking well SERUniversal probably just sucks at fighting games. I loved Mortal Kombat 9 and was excellent at the combat (Although I hated the trashy ♥♥♥♥ story) and it was fast paced and smooth even though there were points in time I would get demolished and would rage out.    I would highly recomend not spending anymore then $5.00 USD on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed mostly everything about the game, but let me tell you what I hated about the game: THE ♥♥♥♥ING STAR LABS MISSIONS. I'll admit I did have some fun with them, but trying to complete every mission with 3 stars could take its toll on a young man like myself. I shiver whenever I think about how much misery and anger they have caused me. They reminded me how many times I wanted to staple my nutsack to the ceiling. Nevertheless, it's a very solid fighting game with (most of) your favourite DC Comics characters. Just be aware of the STAR Labs.",
            "review_score": "1"
        },
        {
            "review_text": "Injustice is my favourite combat fighting game... My favourite character in this game is Scorpion because this character can attack your enemy so fast with fantastic skills... I like playing Mortal Kombat XL too, so that's the reason why i like Scorpion in this game... I recommend you to buy this game when in sale because you will get this game very cheap with complete DLC's... That's for my review and i hope you enjoy this game... :)",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed it, keen for Injustice 2, The only fighting game my wife will verse me on because she can be Harley Quinn haha :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, but it's difficult with keyboard :/",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with great gameplay. Single player mode is like playing a movie and will take around 4 hours. The graphics are good, but not really great. Some older games have better graphics. The gameplay makes up for this however.  Whats up with Wonder Woman? She looks.....manly.",
            "review_score": "1"
        }
    ]
}