{
    "app_id": 242780,
    "name": "Cognition: An Erica Reed Thriller",
    "release_date": "2013-09-19",
    "developer": [
        "Phoenix Online Studios"
    ],
    "publisher": [
        "Phoenix Online Publishing"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Female Protagonist"
    ],
    "achievements": 59,
    "positive_ratings": 503,
    "negative_ratings": 101,
    "price": 10.99,
    "description": "FBI agent Erica Reed has an uncanny talent: she can see the past and piece together how a crime unfolded. But not even this sixth sense could save her younger brother, Scott, from a brutal serial killer. Three years later, the investigation into Scott’s murder has gone cold -- but Erica’s work has only just begun.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/242780/header.jpg?t=1478025368",
    "minimum_requirements": "最低配置: 操作系统: XP/Vista/7 处理器: 2.0 GHz 内存: 2 GB RAM 图形: ATI or NVidia with 512 MB RAM** 存储空间: 需要 7 GB 可用空间 附注事项: ** - Not recommended for play on Intel systems with integrated/shared video memory",
    "recommended_requirements": "推荐配置: 操作系统: XP/Vista/7 处理器: 2.0 GHz 内存: 4 GB RAM 图形: ATI or NVidia with 1 GB RAM** 存储空间: 需要 7 GB 可用空间 附注事项: ** - Not recommended for play on Intel systems with integrated/shared video memory",
    "reviews": [
        {
            "review_text": "You play as Erica Reed, a Boston FBI agent with a deeply troubled past and some supernatural abilities, which are introduced to you throughout the first episode.   Cognition is a traditional point and click adventure game, and it doesn't add too much to the formula. When you click on something, a small radial menu shows up of things you can do with the object, and its context sensitive. You can look at it, use it or grab it, or use your currently equipped inventory item on it. The graphical inventory is on the right side of the screen, and you can not only equip an object, you can also look at it, use it, or combine several objects together.  It definitely has a very mature comic-book feel to it. The cutscenes are delivered in the standard 'motion comic' style, with minimal animation - mostly to highlight the important aspects of the scene. The actual gameplay has full cel-shaded environments and characters, complete with mouth movements to accompany the voice acting. The music is also wonderfully done and definitely sets the mood for each scene. The best thing I can say about it is that it didn't get in the way, which is the point for a game like this. It highlights the atmosphere appropriately.  Cognition: An Erica Reed Thriller may have some clumsy animation, some robotic faces and the occasional instance where the tech and the art don’t quite gel, but it is a hugely competent adventure game in every other regard. One that provides stimulating puzzle mechanics that make perfect sense within its world, and a compelling story that quickly gains momentum and keeps it up until it culminates in a thrilling, memorable finale. That’s categorically what you want from the genre.",
            "review_score": "1"
        },
        {
            "review_text": "  When a friend of mine gifted this to me about a year ago, I was touched and happy to finally have this game in my library. Sadly, it took me a while to get around to picking it up and actually playing it, but once I started, I couldn't put it down. I remember thinking that the Still Life series was the grittiest and most realistic crime thriller that I had ever played. Then Cogniton came around...  Trying to tell the whole story would take too long. Suffice it to say that you play as Erica Reed, a FBI agent with a promising career in front of her. The game begins as you are racing to stop The Cain Killer from murdering Erica's brother. What follows is an awesome, episodic thriller that does not let go until the final moments of the last episode. Even through there are different killers and cases woven through all 4 episodes, the major theme of catching The Cain Killer is the thread that binds them all together. The pacing is well done.   The voice acting and the depictions of the characters are wonderful. These are characters that you will love or hate. Depending on how you play the game, you will definitely see character development. There is nothing static about these characters. Apart from the supernatural gift given to the protagonist, they feel like real people in really desperate situations.  The game play is mostly your standard point and click with a scroll down inventory, but Erica Reed's cognitive powers set this game apart. She has four abilities that she uses throughout the game, starting with just bein able to get slight visions of the future. As the game progresses she learns more about her gift and her abilities start to broaden. By the final episode, you have use of all 4, sometimes using them all in the same puzzle or scenario. The only tedious think about this is that in the early episodes (1-2), you are constantly going back to visit Rose, who helps you realize your full potential. This can really break the pacing, since you will be at a crime scene, or in an interrogation and you suddenly have to break what you are doing to go to a different area entirely to learn more to progress further in the game. Luckily, the later episodes fix this and you don't feel that you break with the story in order to go into a tutorial mission.   The game is gorgeous, gritty, and violent. I love the comic book style. Even though it looks hand drawn or painted, the imagery is very vivid. I could only play an episode at a time, because the final images of each episode would stay with me, and I had to get up and take a break. The music just adds to the tense and thrilling feel of the game. As I write this review, I am listening to the soundtrack, because it is just that good.   I am starting to notice a serious trend in adventure games feeling less ridiculous and more common sense. That tone is definitely felt here, since you are solving cases. Sometimes you have to think slightly outside the box, because you are being covert, but it still feels within the realm of reality. Some of the puzzles can be difficult, but that will only be if you don't pay attention to details: what is said, the evidence you collect. Not paying attention to details can cost you a lot in the game, from losing trust with co-workers, to flat our losing partners to a killer. There are timed scenarios. Even in Still Life 2, my palms didn't sweat. My palms sweat in this game. A point and click. They don't happen often, at most once in an episode, but once is enough.   I honestly can't think of any negatives. The story was well told and it ended very well. Not necessarily a happy ending but one that is true to the plot. I can honestly say that even though I was given this as a gift, it is worth every penny that is being asked for. I know there is another playthrough in my future, but I may need some time to get over my first playthrough!",
            "review_score": "1"
        },
        {
            "review_text": "Good people + hard work = great product. As naive as it may sound, I strongly believe that. When people with the right ideas and enough love for their project show real commitment, failure is just not an option. And this is the case of Phoenix Online Studios and Cognition. Crowdfunded through Kickstarter, Cognition is a crazy good adventure game, and playing it you kinda wonder how this game could have been made with just 35k dollars.  Despite being pretty common the story is very interesting, it's a thriller story with a strong paranormal vibe and a revenge theme, but what is really good is how they managed to link all the investigations Erica will be involved in. Great work, cool plot twists. Characters are also well described, I loved Erica from the very beginning with all her flaws, fears, doubts. She's a very strong character, but at the same time someone you can relate with. Tridimensional. Puzzles are interesting, not very hard to crack but not super easy either, you'll probably get stuck a couple of times (at least it happened to me, and I loved it, getting stuck and having to think it's a big chunk of what an adventure game is about, for me). Plus, having Jane Jensen (yes, you heard, Jane Jensen *__* ) as a story consultant is a real added value.  So, to wrap it up, a very good game. Interesting, challenging, not a game you'll easily forget. Try it.",
            "review_score": "1"
        },
        {
            "review_text": "Serial killers, torture devices and psychic powers - the story of Cognition is a mix of Saw and The X-Files. You play as FBI agent Erica Reed, trying to solve a series of serial killings with the help of a unique psychic ability. Each episode focuses on 1 serial killer, but there's an overarching story connecting all of them. I would like to say more, but I'm afraid of revealing too much.  Gameplay-wise, the best thing about the game is the hint-system. If you're ever stuck, you can message one of Erica's friends in-game with your phone. The hints are helpful most of the time, but they won't give you the answers outright, so you still keep a sense of accomplishment when making progress.  Another nice feature is that there's a button that reveals all hotspots, so you won't be pixel-hunting!  The graphics are decent enough although the character animations aren't the best. The music and voice acting are excellent though. Some of my favourite tracks are played when you're solving a puzzle or trying to escape a scary situation.  Complaints: 1) A few logic glitches allow you to do the same thing more than once, but the effect is the same. Luckily this doesn't actually hinder progress, but it may confuse the player a little. 2) Dialogue is mostly skippable, but there are some you can't skip, and it gets annoying when it occurs in the middle of a puzzle.  Overall verdict: 8.5/10 One of the best point-and-click adventure games ever.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good psychological thriller game which I will remember for a long time.  I'm really glad that I could play in it, we need more games like this one :)  ",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the point and click genre, get this without second thought. You play as the guttsy Erica Reed, an fbi agent trying to find her brother's murderer. The gameplay has a nice new twist from the usual point and clicks as she uses her psionic abilities to solve puzzles, like touching an object and seeing its past, memory manipulation to recover lost memories and more. The story gets more and more intriguing as it unfolds, all the puzzle pieces comes together to form a clear and crazy picture at the end.",
            "review_score": "1"
        },
        {
            "review_text": "Solid adventure game, exactly my speed.  Quick description: An FBI agent with psychic powers can't let go of the unsolved case of her murdered brother. A series of apparently unrelated cases, with a high body count and plenty of gruesome crimes along the way, eventually lead her to a final confrontation with her nemesis.  Gameplay is well done. A traditional point and click interface adds a thoughtfully designed psychic angle, giving play an extra dimension. I normally find point &amp; click games tedious but this one was fun. Agent Reed's powers develop as the game goes on and new mechanics are introduced right up to the last chapter, which keeps things fresh. There's no pixel hunting, as you can always highlight interactive items in any area. The built-in hint system has a very light touch - it was enough to get me through the game without ever consulting an external walkthrough, yet it wasn't a big enough crutch that it felt like cheating.  I liked the writing. There is a large cast of characters, most of whom are a bit too stereotypical, but still likeable and well-acted. I could have done without the old black woman full of gentle wisdom and mystical knowledge, who you have to visit time and again to receive psychic tutorials; but the forensics nerd, the by-the-book FBI captain, the donut-eating street partner, and the random people you meet at the post office, college administration, etc. are believable and entertaining enough. Dialogue gets right to the point which is always welcome. Some characters recur enough for you to become very familiar with them over the course of the game; but except for the woman mentioned above, none overstay their welcome.  The story is well thought out and compelling, and kept me always motivated to find out what would happen in the next scene. So many other adventure games start strong and then lose my interest in a swamp of nonsensical items and locations, but everything that happens in Cognition is on-task and furthers the plot. Well ... almost. Chapter 3 begins with a long, long sequence about reading the past of a sister and two brothers, that doesn't feel like it has much to do with anything. This section came very close to losing my attention, as Agent Reed is presented with several different scenes all at once, some of which cannot be solved until others are completed, requiring a lot of tiresome flipping back and forth to try to figure out where the critical plot point is that will unlock progress in another scene.  Once I got through that section, it became clear why this  was  all relevant to the story, and the game returned to its (thankfully) more straightforward puzzle-oriented idiom.  The graphic style is a little weird. There's something ugly about the lighting and the bright highlights on all the character outlines. I don't play games like this for AAA visuals and the game communicates well, but be warned that this is a low budget game and looks it.  I like the soundtrack. Scary. I'll be loading it into my road playlist to remember the game by.  Bottom line: worth 17 hours of my time, and nowadays when I have more games than I can ever play, that's a big deal. I would not have felt ripped off if I'd paid full price $15 for it. Of course it goes on sale from time to time so you should be able to grab it for just a few bucks if you're patient. In any case, get this game and support these devs. They did a good thing here and are taking adventure games in a good direction.",
            "review_score": "1"
        },
        {
            "review_text": "1. Interesting story and atmosphere 2. However... the UI/UX design is simply horrenduous and it takes up to 90% of your time: - Walking around is ultra slow - Interaction with 'cognition' is buggy (i got stuck in episode 2 with it and couldn't recover) - Inventory interaction is a blasphemy for anyone who's played any adventure games before (even games done 25 years ago in Sierra style had MUCH better inventory control).  Review: If u dont mind the bugs, glitchiness and horrible UI the story is probably a 8/10 (havent played past episode 2).  If you do mind, the game is a 2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Good stuff. Very high production values for an indie game. It also has Jane Jensen (Gabriel Knight, King's Quest 6) stamp of approval so that's a selling point.",
            "review_score": "1"
        },
        {
            "review_text": "I tried to enjoy this game, I really did.  But when Rose started explaining some expositional crap about how certain cognition powers worked in episode one (it just dragged on and I simply didn't care), it was unskippable, and I just brought up Facebook in the Steam overlay and missed nothing at all when it finished.  It's just not immersive, and the puzzles were more annoying than interesting. I did like the art style, and the demo I thought was quite good which was why I ended up buying it, but the full version just felt like it dragged on so much. I used the message Dad thing a lot more toward the end because I just wanted the episode to end and couldn't be bothered looking for the solutions myself.   Also,   how many times do you have to show the same vision of her dying? Like, we get it, you saw yourself die. Stop seeing it repeatedly and acting surprised each time it happens.     Should clarify I gave up partway through episode 2.",
            "review_score": "-1"
        },
        {
            "review_text": "A very good third-person view adventure game with modern graphics. The story line is exciting and the dark atmosphere is also unique. There are some graphical bugs, but not too many. The full game include 4 episodes, which are different in quality but in overall it is a highly recommended game for those who like dark/horror classical adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "Cunning puzzles, an intense story, and well crafted cinematics. I AM NOT BIASED!",
            "review_score": "1"
        },
        {
            "review_text": " A rough and tumble game with glitches and bugs",
            "review_score": "1"
        },
        {
            "review_text": "A great adventure, totally recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Just my favorite game. ever. #Corica",
            "review_score": "1"
        },
        {
            "review_text": "My wife likes point-and-click adventure games, mysteries, and strong female characters, so I started playing this with her. It got way too gruesome for her, but I liked it. The puzzles are interesting and difficult, often in a good way but sometimes their scope is too wide: there are too many tasks in too many places with too many items, so you're left just trying to find a way to do *anything*.",
            "review_score": "1"
        },
        {
            "review_text": "Cognition: An Erica Reed Thriller has many things I could say about it, but because the plot is a thriller/mystery I’m going to try and keep away from spoiling any surprises the game might have in store for anyone daring enough to give it a try.  Ultimately I gave the game thumbs up. Cognition was by no means a flawless creation, but it impressed me with how different it was from other point and click adventure games I have played.   It was basically a horror game that made you think. Not to many of those lying around.  Now I know it hints at what to expect in the title. The game is technically a thriller, yes, but it is so full of gore, twisted psychology, mind games, deathtraps and people dying in horrible ways that the only thing that seems to keep the game from plunging into the full fledged horror-only end of the spectrum is the fact that the main character, Erica Reed, is an FBI agent with some psychic abilities.  Still, the writing is so dark an twisted that even being a psychic investigator in the FBI doesn’t really help Erica Reed much and she often comes out as more of a victim trying to survive than anybody who is successfully solving anything. It’s not even to hard to guess who the evil sick killers are as soon as they are introduced, but the puzzles, sick mind games, and music are so disturbing that most players will find it hard to stop playing.  Despite it's ability to grip an audience, the over all presentation of the game still does flip flop a bit in quality. Sure there is the great draw of that dark atmosphere and the developers do a ton of things right as far as creepy tension goes, but there are a couple of moments where the presentation trips over itself. Voice acting was hit or miss. The 3D animations would occasionally go from wildly over the top movement to actually breaking the character model, causing the character to glitch out and crash. It can be a bit distracting, listening to what sounds like a bipolar Erica Reed doing an anime style fist pump and then spontaneously having her head spin 360 degrees kind of takes a person out of the seriously tense moments. Luckily these bizarre issues were few enough to not really bother players with a forgiving sense of humor.   The over arching storyline is divided into five parts. Each of the five episodes seemed to have their own strong moments, paired together with little flaws in detail. There were plenty of moments when, if anyone stopped to really think about it, it would seem that the characters did things that would make no sense just to further the plot. In fact, there were many ways for the killers to have been caught in each episode, but FBI protocol and any logic associated with that setting is conveniently thrown aside in favor of a over dramatic scene or additional puzzle.   For instance, there is one laughable moment were Erica Reed thinks she has to figure out how to steal an old tape recorder and tape from a grumpy colleague then goes about breaking a couple of laws in the process, but the whole time I can’t help but wonder why she can’t just go to her boss, use her smart phone to record things or, heck, hop in her car and go to a local electronics store to buy her own hand held cassette recorder for around $20 or so.   Does Erica Reed's actions make any sense in the above situation? No, but it's not distracting enough to ruin the game for anyone who has tried other games in the point&amp;click genre. Sure the dips in logic are noticable but not crippling to the bigger scheme of things and most casual players will probably shrug them off.  In the end, what really won me over was how the game made you thinks when it came to puzzles. If it’s a very mature game with mature content, you expect some very difficult and mature logic solving puzzles right? Well the player actually can get that here! It actually makes the player think and a player can solve most of them without using the hint system if one puts one’s mind to it. I really enjoyed the complexity of the puzzles and I ended up using the hint system more to navigate through nonsensical parts of the story to find them than to do any actual puzzle or logic solving because of the long awaited challenge they represented.   In conclusion, I give Cognition: An Erica Reed Thriller a thumbs up, although it's a twitchy thumb with warts just around the thumbnail. Honestly, I’m not sure if this game is for most audiences, since the game seems to have been made for people so desensitized that they no longer have a gag reflex combined with the tendency to have the patience level of a saint. I'm not even sure making any more 'Erica Reed' thrillers (if that's the intent behind the needlessly lengthy title) would be a good idea considering how random the plot was, but was this game was different enough to stand out in a crowd and entertaining in it’s own right. I say give it a shot, just be aware that you might have to talk to a therapist when you are done playing.",
            "review_score": "1"
        },
        {
            "review_text": "The only way to win at this game is to actually eat the egg sandwich.  Just eat the damn egg sandwich Erica, you dumb hoe.",
            "review_score": "1"
        },
        {
            "review_text": "Cognition is a masterpiece, and I would strongly recommend it to anyone who enjoys mysteries / thrillers, regardless if they're fans of the adventure game genre. The plot, music, aesthetics, graphics, gameplay, and aesthetics work amazingly well together. The game's puzzles are flawless, and the script / voice acting remains strong from start to finish. This game really is a work of art - it is the most thrilling and emotionally powerful game I've ever played, and I strongly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Classical style point and click adventure game, with interesting charaters, interesting story, good music. If you like the Still Life or the Post Mortem, you will love this.",
            "review_score": "1"
        },
        {
            "review_text": "Cognition is an absolutely wonderful mystery/thriller with a well plotted story that is very satisfying to play through. Everyone who thinks they might like it should definitely buy it.  I want to make that very plain at once because everything else I have to say about it is complaints. The constant frustrations from beginning to end are just astounding. Towards the beginning they are most game design issues, while in the last two chapters they are mostly technical issues. In fact the last two chapters froze up so many times, I felt like I'd played through them both twice by the end. The suspense was primarily situated in whether I would make it all the way through a cut scene or if it would hang between lines of dialogue. And this is particularly troublesome because the last two parts are wonderful and genius. Before I got to them, I thought the game was good, but not as good as Still Life. In the first two chapters there are a lot of poor busy work puzzles, two absolutely obnoxious characters (the CSI guy and the coroner), and this horrible idea of giving you a cell phone but ALWAYS forcing you to actually go visit a person when you have to talk to them. It's like the cell phone is taunting you. The other bad thing, is all the time you spend watching slow jerky walking animations. Why are the sets so large with about three things to interact with on each? They could easily all fit on screen. But no, invariably you must walk back and forth slowly and jerkily over at least two screens just to find out there's still something you need in another location completely. The worst offender is the beautiful apartment in chapter 3. (You notice how I'm compelled to compliment it even while complaining about it?) In this apartment where you spend most of your time you must walk back forth around kitchen counters, islands, and coffee tables and dining tables that fill the screen. The game seems to mostly be how to find a pixel's worth of floor space you can click on to get Erica moving in the right direction.   The only problem I have with the plot is that there is a suggestion throughout the last chapter that you will have some opportunity to decide what happens to certain characters, whether you kill them or bring them to jail, I'm fine with what the game decides to happen but not so fine with the fact that it suggested you'd have more agency in it when you do not.  The game is so good. While the busy work puzzles are generally awful or unbelievable, the central puzzles are always wonderful, the way the various psy powers work out always very inventive and intricately planned out, the plot is very well done and never disappointing. I like too that you don't have to like the good guys or dislike the bad guys. Cognition is wonderful gem, but really Phoenix Studios, shape up.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, excellent voice acting. There were a couple puzzles that didn't quite work for me (You have all of Boston, why can't you just *buy* a tape recorder?), but for the most part it's very good.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best point &amp; click puzzle games i've ever played! Really enjoyed it so far.   I've yet to play Episode 4, but love the characters, music, and artwork. Brilliantly polished game, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "What an incredible bang for the buck! Lengthy...captivating...beautifully written.. fantastic and imaginative story lines! Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Apart from the unpolished graphics and animation it is a good and atmospheric pnc adventure. Some of the puzzles lacked logic and there was quite a bit of go here then there then go back to increase playtime - and also some bugs that almost hindered completion. Still, one of the better adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Meh, the voice acting and weird animation ruin it for me. sure the story is great, but thats what lets plays are for. without a good gameplay aspect, it just isnt worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "66 Freaking hours... Because it made me fall into a deep sleep for 65 of those hours. Actually, I forgot to shut this boring game off.  Review completed,  Goodbye",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent music and well-drawn visuals can't save an adventure game with actual loading times (on a quad-core i7 - yeah, it's not my computer that's the problem) and poorly-designed UI (unskippable cutscenes that can trigger multiple times, the 'cognition' system is cumbersome (why do we need to click cognition, then click what we want to use it on, then click it a second time? At least one of these steps is not necessary), and a lot of forced waddling).  The voice acting is absolutely abhorrent (whoever did the voice for John should never use a microphone again), and - perhaps worst of all for a point-and-click adventure game - the mouse pointer is a bit strange, it feels like it's swimming through syrup even at low graphics settings.  The plot may be the most gripping thing on earth for all I know, but I'm not going to suffer through the bad UI and poorly-thought-out mechanics to find out. I gave it an hour on Desura, and that's an hour of my life I'm not going to get back.   Just buy the soundtrack and read a Stephen King book while listening to it.",
            "review_score": "-1"
        },
        {
            "review_text": "The movements of the characters are totally awkward, they need a year to turn around.",
            "review_score": "-1"
        },
        {
            "review_text": "It's hard to tell that Jane Jensen merely consulted on plot elements, because this feels like one of her games. That is a good thing.   The story of a cop with psychic powers is a bit of a trope and I went into playing this thinking 'oh great, here's another Syfy crime drama', but they really took it further than I anticipated. It's actually really thrilling and good. As proof that I mean it, the same company did another game WITH Jane Jensen, my personal game development hero, and I think this one is stronger. Hurts to say, but I'm being honest. I crave a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "you can see ghoust and see memorys this is cool game",
            "review_score": "1"
        },
        {
            "review_text": "Good story with genuine twists, likeable characters, great astethic and voiceacting. Some small bugs, but no plotstoppers or anything.  All in all a good package for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Decided to give a review since it’s not getting a lot of love/credit.  The Good: It successfully creates that dark/thriller murder mystery atmosphere (a bit like se7en in a way). The serial killers cases are dark, gruesome and pretty interesting to follow. This is definitely the strong point of the game. Putting all clues together to discover the identity of the killer is done in an unconventional way. It enters into the Psychic world, looking into past and the future, tampering with memories and all that good stuff. The story does take a while to get going, and there are some obvious “fillers” (basically all the Rose scenes which serves as tutorials/progression) but overall it’s pretty good, dark, filled with twists and stakes definitely pick up much earlier on the other episodes.  Oh and soundtrack is pretty good!   The Bad: It does have some flaws. Some people point out bugs, but in my entire play through I only encountered one (when I failed one puzzle and had to reload a save) so can’t say much for that. But yes there will be character walking glitches but that’s nothing out of the ordinary and the voice acting can be weird (lack of emotion, delivery, and big pauses between lines in some cases) but it got better in the latter episodes (or maybe I got used to it?).  Edit: Forgot to say the way character moves is pretty.... ridiculous. Yes It kinda looks bad, and when someone talks (cutscenes) it looks unpolished but the same could be said to the telltale series. So graphically expect the same as telltale games.   The only thing I’d complain is the “delay” between actions, or inputs. Doing something like trying to open a locked door can take up to 10-12 seconds! Only to say it’s locked in the end. And then to take back control of your character can take another 5 seconds. And there are a lot of “locked doors”. This is my only complaint but the game was good enough for me to ignore that, and note that it doesn’t happen for everything but you definitely notice.",
            "review_score": "1"
        },
        {
            "review_text": "This game is more than a typical point-and-click adventure game. It is a rich story told in an engaging manner with a great soundtrack. It holds well even though it is more than a few years old. Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I rarely comment on any games but as a fan of Point &amp; Click adventure games I fell in love with Cognition so much I had to express my opinion on it. Complex characters, intriguing storyline, and the amazing talents of the protagonist keep gamer on edge all the time. To be honest I didn't think the episodic formula would fit into this kind of adventure game but I have to admit that I was wrong. When you finish the game it makes you want more but in a good way- the ending gives closure, and leaves the feeling of satisfaction and accomplishment. Loved each and every second of it. I would recommend this game to a fan of adventure and story-driven games.",
            "review_score": "1"
        }
    ]
}