{
    "app_id": 242840,
    "name": "In Verbis Virtus",
    "release_date": "2015-04-03",
    "developer": [
        "Indomitus Games"
    ],
    "publisher": [
        "Indomitus Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Magic",
        "Action"
    ],
    "achievements": 34,
    "positive_ratings": 1102,
    "negative_ratings": 266,
    "price": 14.99,
    "description": "Use your real voice to cast spells in In Verbis Virtus, a fantasy adventure unlike any other. Step into the shoes of a wizard in search of an ancient power. Explore a lost temple, making your way through forgotten chambers brimming with unspeakable beauty and terror.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/242840/header.jpg?t=1521043743",
    "minimum_requirements": "OS: Windows XP SP3 / Vista / 7 / 8 Processor: 2.0+ GHz dual core processor Memory: 2 GB RAM Graphics: Radeon HD2000 series or higher, Geforce 8000 series or higher, minimum 256MB dedicated memory DirectX: Version 9.0c Storage: 4 GB available space Additional Notes: Requires a microphone (notebook integrated ones do not guarantee best performance)",
    "recommended_requirements": "OS: Windows  7 / 8 Processor: 2.4+ GHz quad core processor Memory: 4 GB RAM Graphics: Radeon HD6000 series or higher, Geforce 400 series or higher, minimum 1GB dedicated memory DirectX: Version 9.0c Storage: 4 GB available space Additional Notes: Headset microphone",
    "reviews": [
        {
            "review_text": "In Verbis Virtus is a fantasy adventure game where you cast spells in Maha’ki, the language of the gods, using your own voice. I gotta say: the very first time I cast a light spell just by saying a few words and the game responding immediately after I said it....I had the biggest nerdgasm ever. I felt the need to put on my robe and wizards hat. Yeah, it excited me. I won’t apologize.  Throughout the game you discover and learn multiple spells, each with its own purpose and power. You solve challenging puzzles, escape traps and battle monsters with magic.  You could lose yourself for hours in captivity by it's stunning graphics. It's one of the most unique and immersive games I've had the chance of buying. In otherwords, I give this game a 10/10. I would become a wizard over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "Its a puzzle game, but the whole, voice thing, its an amazing idea, and works way way better than I actually expected! I never do reviews, but, for this game? It's definitly worth the buy, just for a different flavor of the month! ^_^",
            "review_score": "1"
        },
        {
            "review_text": "7/10  New concept, pretty fun to play-- using your voice. However as stated by others the game is very disorganized which makes puzzles that the game is full of...even more confusing. If you're willing to deal with some lack of direction and think the game looks cool then buy it.",
            "review_score": "1"
        },
        {
            "review_text": "That game is entirely new, unique experience that you must try out. Main idea, that you're casting spells by your own voice. We have never met such a challenge!   It's especially amazing in a difficult situations, with little amount of time available.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I give this game a solid 4 stars.   The gimmic of voice activated spells never loses its charm. With every light spell to every fireball I get tingles every time. The powerful feeling of chanting out your spells just makes you as a player feel good.  The visuals are superb, even on my craptastic computer I am blown away at the scenes. The big begining desert entrance, the glowing caves and mushrooms. the vast puzzle rooms. Gah so much to see.  The lore and the journal entries are very well written, and provied excellent immersion into the story and getting to know just what happened in these ruins.   But alas, the game is not perfect. The casting while all together glorious, can be a little hit-or-miss. Especially if you have an accent (Cajun American here) so the spells sometimes missfire. ( Somehow i ended up casting one spell instead of my intended one, and the pronunciation for both have nothing in common. )  Second, with the misfire of spells, means the bad guys dont always get the knuckle sandwich you were trying to serve. And instead they feast on you. The aiming is tough to get down pat at first, being used to when you shoot, it hits immediatly after. The spells fire slowly, so you have to learn to lead and anticipate. And some of the bosses are damn fast and s♥♥♥♥♥tic in movement, so it is sometimes like a bullet hell of just repeating chants until you land a hit.  The puzzles while they do have that grandeur from the visuals, arent all that complicated initially. They are really just a tad obnoxious run arounds of find the right angle for this, or find the out of the way symbol. They arent bad, but they arent brain benders.   The spells, while fun to cast, are a tad one trick pony. It is always obvious from the time you get into a room which spell you are gonna be repeating the entire time. Every spell has one use, and one use only. (Save for 2 basic spells you can 'stun' enemies instead of killing them with these) One charges this, the other opens these, the other activates this thing, and so on. There is little diversity to how the spells can be used.   ***[TL;DR]***  So all in all, great visual game with a real great hook for gameplay, just combat is a bit messy and wishing that the spells could be a little more creative with how you use them. But it is a really really great game, worth the money, and worth supporting these devs to taking this to the next level and exploring all possibilities. Really looking forward to a expansion or sequal to this game. Really want to see more voice recognition in games like this. Has excellent potential and this game is a great start for what can be an epic game changer.",
            "review_score": "1"
        },
        {
            "review_text": "So where to begin with this game, I love the Story and Mystery behind everything you do in this game. The Audio is amazing and engaging. The Art Design is beautiful and stunning. The Stage progression was good and it was easy to understand where you were supposed to go as long as you explore a bit to begin with. Now the Voice recognition is cool and all but there were a few times were I would cough and it would count it as the Command spell or I would say one spell and it would interpret as another and I even set up my own Voice profile in the settings though it was mostly on the dot with what I said most of the time. Oh but I do love the sounds of the language used for the spells it was mystic yet regal.  So to wrap it up I love everything about this game even with the few times I got annoyed at the Voice stuff. I would give this game a 9/10. Mostly because there are a few areas where you can bug the game out a bit and the voice recognition still needs some improvement in techonogly before it can be prefected for a game like this. Still though Great work for a very small team.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging puzzles, dark surreal ambiance, huge Balrog-like enemy. Sweet.  For me the speech-recognition worked mostly flawlessly, if it didn't, it was almost always my fault for talking to fast in a hectic situation.  For some puzzles the hints that may be there are easy to overlook or misconceive., making them really hard to solve.  Overall really recommend the game, but don't wonder if your flatmate will think you are crazy for shouting ATUL AGHNI multiple times aloud.",
            "review_score": "1"
        },
        {
            "review_text": "This is a cautious recommendation, it's definetly not a game for everyone for a few reasons:  First of all it's a puzzle game and it doesn't hold your hand at all, this can be a positive depending on your point of view but some solutions definetly get on the harder side later on and another problem is that each of the chapters (2 and 3 especially) take place in really huge maps and it can be disorienting as to where you have to go / what you have to do next, which isn't really helped by the backtracking you have to do a lot of times  Then there's the main gimmick of the game which is the voice recognition spells and aside from the obvious factor that you could be saying a bunch of weird things in front of other people (the game uses it's own fantasy language but you can change that if you want, although it's recommended for immersion) I've got to admit that it is quite cool at first but more than a couple of problems start to appear later on  The speech regonition seems fine at first but it only seems to get worse after you get more spells and it starts confusing between them sometimes like I can't tell you how many times it confused 'Obee Kehnu' with 'Udah Notem' and so you just keep saying the same spell over and over again until it actually works, which you sorta need it to be 100% or very close to it especially near the end of the game which sometimes ended up in me shouting the spells sometimes in frustration and also the novelty of the whole thing starts to wear off too somewhat and makes you wish you had hotkeys for all of them so they'd be guaranteed to work / not mix up  Story wise it's kinda basic and totally optional, you get journal entries at certain points in the game and you can find documents that tell you a little bit more about the game's world and all that, so you can read them if you want, a few of them can provide clues in certain points of the game though, side note here it's usually a stone tablet with runes but weirdly enough later in the game they change that and I didn't even realize it at first because the new 'documents' really just look like decoration more than anything else so I ended up missing quite a few of them, but the ending at least was somewhat interesting but obviously story wasn't the main focus of this game  Overall it's a nice game with an interesting gimmick, it looks quite good too, there are some really beaultiful enviroments most notably in the third chapter and the game isn't that long either so it doesn't really overstay it's welcome too much (although I gotta admit it was starting to grind my gears near the end) so if you're into this sort of genre I'd say give it a go, it's at least worth that much",
            "review_score": "1"
        },
        {
            "review_text": "I completley and totally Recomend this game.. Having to incant your spells adds a whole new feel to the First person puzzle game the puzzles are challanging and the combat is intense  Get this game now!!!",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer : this is more a puzzle game than anything else, so if you expect to fight with spells like in an RPG but with voice recognition, you will be disappointed.  The game has a very interesting concept. The voice recognition can sometimes fail (which can be quite frustrating at times) but most of the time it works just fine.  The puzzles (and even finding your way in mazes) can be quite challenging.  The combat can be very frustrating, but fortunately there is not too much of it.  Overall not a great game, but a very good one.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, inovative and fun, excellent graphics, amazing story and awesome gameplay. Too bad that In Verbis Virtus isn't very famous, it deserves lots more visibility. Just indicated the game, you guys deserve it",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay, great graphics, great music, great voice casting, great game. I really love this. Totally recemmend. 12/10 IGN Would cast spells again",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game! I think the voice control is really awesome! Puzzles are well dispersed. Extremely immersive game that you will really enjoy playing!",
            "review_score": "1"
        },
        {
            "review_text": "In Verbis Virtus is a unique RPG Magic Adventure game in that instead of clicking to cast a spell, you can use the power of your own voice to cast. Feel your way through the game, memorizing different incantations and beating your foes with magic you created. It has very nice graphics, although if you don't have a good enough processor, all the special effects can slow down your game.  Conclusion: In Verbis Virtus is a innovative, immersing, and pretty RPG, although can be difficult without proper software. Overall: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "This game, oh my god...this game, oh my god...this game. Altho it can be agravating at times, it's awesome and...it's the most beautiful game i have come across. Enphisis on the beautiful part.   I would greatly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, amazing game! Worth every penny!  I was not so excited since I found Portal. BTW: Portal fans should love this game I think.  Beautiful designs, interesting story, consistent (and original) worldbuilding, puzzles are captivating (even if some are a bit frustrating while you try to solve them) and often have unexpected solution.  Also there are hints available in comunity forum (which is important for me - you can check hint if you stuck, insteat of dumb reading solution). ",
            "review_score": "1"
        },
        {
            "review_text": "This is a really neat game. The voice recognition is superb, it only fails maybe once in like fifteen casts. The game looks beautiful, it's fun, the puzzles are pretty challenging and it's super dorky shouting magic spells at your PC. Dorky in a good way. This is great.",
            "review_score": "1"
        },
        {
            "review_text": "Hold onto your socks gamers, you’re just about to get the opportunity to geek out like you’ve never geeked before! Enter the world of In Verbis Virtus and learn the Maha’ki language to impact and control your surroundings. No… your character doesn’t learn Maha’ki, YOU do! Well you’ll need to if you want to get anywhere in these puzzles. Continue reading for the rest of our In Verbis Virtus review!  I just had to try out In Verbis Virtus. A game that lets you cast spells with your own voice? I was all over that idea and I have to say that I’m impressed!  The whole game is played through a first-person view using the usual ‘WASD’ keys to move around, and your mouse controls where you look. Holding down ‘left-click’ raises your character’s hand and allows you to speak into the mic to cast a spell you’ve learned.  The beginning of In Verbis Virtus starts you off in a desert outside of a temple. Navigating to the entrance of the temple acts as the tutorial, introducing you to moving, jumping, sprinting and interacting with objects. After this brief period of learning, the puzzles begin.  Placed throughout each level are signs showing a map of the area you are in. The maps show your current position, places of interest and the pathways needed to progress. If you don’t have a very good memory or you prefer to progress through games methodically, it might be a good idea to take a photo of these maps to use for reference further down the track. The entire game is pretty much one giant maze.  By using these maps, you can successfully navigate through tunnels and the like, to find new spells or puzzles to be solved. Most puzzles will require you to have learned a certain spell in order to solve them. So there is a little bit of backtracking.  For example, right at the beginning, one of the passageways you can take is completely dark. Not only that, but the only way to get through this room is to walk a very thin path that zigs and zags. Therefore, you need to have learned a spell that lights the area up to avoid falling down a bottomless pit. Falling is bad, but not bad enough to kill you. Instead you’ll be transported somewhere nearby to where you fell, albeit missing a portion of your health. However once that health bar is depleted, death will follow, prompting you to restart from your previous saved game. So make sure you save whenever you get to one of the few save points.   Puzzling Times",
            "review_score": "1"
        },
        {
            "review_text": "Ran around yelling EXPECTO PETRONUM and shot light out of my hand 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Cast spells with your voice. Learn of the past. Defeat the enemy. Save the-  I mean, I don't know. I can't stinkin' make a jump. Dumb jump.",
            "review_score": "1"
        },
        {
            "review_text": "Note: This is a borderline game, some people will really enjoy it in spite of its flaws, but I can't recommend it for the average consumer, as you will almost certainly need to look up a guide at some point -- read on for reasons why (no spoilers).  This game has a lot going for it, but as a puzzle game it's really let down by the level design. Your objectives are extremely unclear and though the levels are open, it only serves to confuse and frustrate, as you can't actually complete tasks out of order -- there is a very linear progression to each level, but you have to figure out what that is through trial and error. That's fun when the game is asking you to figure out how to use your arsenal of spells to get through an area, but it's just annoying when you don't have the tool to solve a puzzle, and you can only find that out by banging your head against it for half an hour. Multiple times so far I have looked up a solution for a room only to discover that I was in the wrong place and needed to go do something on the opposite side of the map. It adds nothing to the difficulty of the puzzles or the enjoyment of the game. I'm seriously questioning my resolve to finish the game at this point, since I know it will take me 2-3 times as long as it could have if levels were better designed and playtested.  If you have a high tolerance for obscure puzzles and obtuse level design, the voice-activated spells are truly unique and the game is a lot of fun. If, however, you're not an early adopter of new mechanisms, I would hold off on IVV for now -- maybe the levels will be reworked to be either more linear, or the open world will be given a purpose beyond stretching the game time. If not, someone will steal the verbal spellcasting idea and put it in a better game soon enough.  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Love the unique concept, unfortunately the game failed to recognize my voice most of the time. The platforming felt out of place and imprecise. I found that the 'combat' was extremely frustrating because it relies on quick use of your spells, and yet the game doesn't feel responsive enough.",
            "review_score": "-1"
        },
        {
            "review_text": "As others have said, the voice-casting would have been great as a mod/feature added to another game, like maybe Skyrim ('Fus-Ro-Da!'). But in this game here it feels out of place.   Basicaly, you walk until you find a spell . . . use that spell to open the next path . . . to get to the next area . . . to start looking for the next spell . . . repeat.   Ther are a couple of tricky platform-jumping spots, but nothing exciting. There are no real challenges along the way. There are a few places where you think you're in the right place, and just need to puzzle out exactly which spell to use on what object or such in order to advance, only to eventually figure out that you don't kave the right spell yet, and you need to go wandering the map again to find it.   To, me this is a good proof-of-concept for a voice-based spell casting system (maybe as a mod for the next Elder Scrolls game), but not a great game on it's own.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks nice, feels nice but the puzzles are ♥♥♥.  Been stuck on the water/ball puzzles for two hours. Figured out the trick in five minutes(which I later confirmed through walkthroughs and video as to what you were supposed to do), spent half an hour trying to make it work and finally just quit.  Even with a decent microphone the voice recognition is ♥♥♥, combat is clunky and unsatisfying often times you won't get the spell you want when you want it.  Don't buy unless it's on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent visuals, excellent atmosphere, excellent technology (the voice recognition works far better than i expected). However... Some of the worst level design i have seen in years. You never know what you are supposed to do and often you can only find out by trial and error. There are too many puzzles that require exact timing, overly precise positioning etc. The voice recognition is good, but it's not good enough for that.  For instance, in chapter 2, there is a labyrinth. you don't know where to go at first. easy enough, right? now imagine there being enemies in the labyrinth. bit tougher, you have a fireball spell but it needs to be detonated with an additional spell, and the enemies don't seem to die in one hit. bit harder, but still managable. Now imagine that you also CONSTANTLY TAKE DAMAGE while in the labyrinth. Have i mentioned there is a health bar? have i mentioned some puzzles involve platforming, and not making a jump yields fall damage?  tl;dr: I came for spellcasting, i stayed for the H.R.Giger inspired visuals and rich atmosphere.  ... but then i left for obtuse and frustrating gameplay. So only get it if you can deal with that frustration. I also recommend playing this like a point'n'click adventure: with a guide at the ready.",
            "review_score": "-1"
        }
    ]
}