{
    "app_id": 243280,
    "name": "Poöf",
    "release_date": "2013-11-08",
    "developer": [
        "Arkedo"
    ],
    "publisher": [
        "Neko Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "achievements": 38,
    "positive_ratings": 155,
    "negative_ratings": 42,
    "price": 4.99,
    "description": "Poöf has been tricked by accepting a golden laying kitten. But the precious kitty makes all the greedy monsters envious. Survive waves of monsters trying to steal your revenue!Poöf vs the cursed kitty is a mix between tower defense, and platforming action, a game focused on hardcore gameplay, tight controls and choices, inspired by games...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/243280/header.jpg?t=1447358115",
    "minimum_requirements": "OS: XP/Vista/Win7/Win8 Processor: Intel Core 2 DUO @ 2.4 GHz/Athlon 64 X2 4200+ &amp; above Memory: 1 GB RAM Graphics: DirectX 9.0c compatible graphic card with at least 512 MB RAM DirectX: Version 9.0c Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "i can honestly recommend this title. it's just that cute.  despite the kitty being dressed in bdsm leather outfit, it's a very fun little title to play. it borrows from Super Mario Bros (you remember that game where you were closed in a room, right?) and tower defense games. the animation is nice. the mechanics are plentiful, and they expand as you play and unlock them.  oh, and it's another use for my controller.  so, no point in waiting for a price drop - grab it now, i don't think you will be disappointed!  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Silly, but very fun game!  Fans of Super Crate Box and its ilk will definitely find something to love in the gameplay of Poof. It's frantic and dynamic, and will have you rushing all over the stage to jump on bad guys, collect items, and place towers. If you get an item you don't want, you can quickly convert it into a 'golden poo' as well, which will slow down any enemies that walk over it, buying you precious time.  There's lots to unlock, but there is sadly only one play area. It's well designed, and it will be expanded through unlocks as you progress, but some more level selection would be nice. This is the only real complaint I have with the game though: the visuals, audio, and gameplay are all top-notch. If you are a fan of skill-based games, or frantic twitch platformers, this is something you definitely want to check out.",
            "review_score": "1"
        },
        {
            "review_text": "If there's one thing I can say about this game, it's this: THAT CAT IS CUTE!",
            "review_score": "1"
        },
        {
            "review_text": "This game is addictive! I like it :D",
            "review_score": "1"
        },
        {
            "review_text": "I'm a sucker for cute characters and that was the main reason why I bought this game. I really, REALLY underestimated the greatness of Poof. Once I started playing, I couldn't get enough of it.   The game started off very simple but as I spent more time on it it became trickier and the missions became harder to accomplish.   Don't let looks fool you. This seemingly adorable game is full of surprises, fast-paced action and is devilishly addictive. I keep coming back for more and it's worth it every time.",
            "review_score": "1"
        },
        {
            "review_text": "I tried the game at PAX and it seemed fun. However, trying the Mac version of the game, the controls seemed a bit off, the sound cut out, and the game would randomly crash after a while. So I tried playing it on a PC in hopes of a better experience. It crashed immediately after startup, even after clearing the files and reinstalling.  I can't recommend the game when I can't even play it myself.",
            "review_score": "-1"
        },
        {
            "review_text": "Loads of fun!",
            "review_score": "1"
        },
        {
            "review_text": "It gets boring very fast, if you like this kind of game, then get it, don't even think about it.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! This game is crazy! Insane! Honestly, if you are looking for a nice mix of platform game and tower defense game... well, there is nothing else at the market at the moment, really. The game is easy to start and hard to master. The graphics, sounds and the the mechanics are just great (for such a little game). Difficult, but also very rewarding. I would buy it once again, it is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Poöf is a good and cheap platformer with tower defense elements, but it is quite repetitive in its gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "It's an ok game, but it stopped working on windows 8.1, it crashes on first splash screen and the devs are no where to be seen nor even care. So... save your money.",
            "review_score": "-1"
        }
    ]
}