{
    "app_id": 243360,
    "name": "TrackMania² Valley",
    "release_date": "2013-07-04",
    "developer": [
        "Nadeo"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "VR Support",
        "Steam Workshop",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 282,
    "negative_ratings": 80,
    "price": 16.99,
    "description": "TrackMania² Valley is the third environment of TrackMania², the sequel to Nadeo Studio’s online racing phenomenon TrackMania, already enjoyed by millions of players. Valley is a new take on the classic arcade rally racing genre. Flirting between arcade and simulation, Valley marks a new checkpoint in the history of racing games.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/243360/header.jpg?t=1499178110",
    "minimum_requirements": "OS:Windows Vista SP2 or Windows 7 or Windows 8 or Windows 10 Processor:Dual core from Intel or AMD at 2 GHz or better Memory:2 GB RAM         Sound:DirectX Compatible Sound Card with latest drivers Graphics:Video card must be 512 MB or more and should be a DirectX 10 - compatible or DirectX 11 - compatible DirectX®:11 Hard Drive:5 GB HD space Other Requirements:Broadband Internet connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For veterans, this is my favourite of the TrackMania² environments. The car handles on tarmack better than the other two. If you liked the Island environment, I would say this one is the closest to it of the three. Keep in mind, however, that it also contains dirt tracks which are more like Rally. I also think this environment is the most beautiful, though they are all nice in their own way.  If you're new to TrackMania, let me say that TrackMania is AWESOME. It is basically a time trial game, but what a game! The driving is not realistic. You will do tight turns, stunts and drifts. You will drive at ridiculous speeds, stack, and try again. You will make a tight, high-speed turn, followed by a jump, fly across an enourmous gulf, land, do a loop, and then crash into a finish line. Or miss, but eventually you will succeed.  And then there is the extraordinarily powerful (AND easy to use!!) level editor, which has led to large community of excellent user created tracks and multiplayer servers.",
            "review_score": "1"
        },
        {
            "review_text": "TrackMania 2: Valley offers amazing online support, solid precision racing and new graphics. Its enjoyable and strictly arcade as always. However, its new more complex driving physics knows how to torment you sweetly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun and graphics much better!  + Graphics and gameplay + Very easy Map and Replay Editor + Easy Car Painter Editor + Demoversion + Lot of Languages + Official race  - Eviromment as one game - Official race 5 minutes interval (But that is not too bad. It shows, how you are good.) - Sometimes music bugs  Game is very good and fun like I said.  Recommended! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "It is great arcade racing game, as all trackmanias but it lacks good programming, it feels like 5yr old kid would do it better:  -multiprofiles don't work, each of them need TM2 activated account which is hopeless -it is impossible to properly setup SplitScreen controls, because you need profiles for each person playing and you cant have multiple profiles (you can have them but you can't log on them lol) -it started to give me f*****g bluescreen on startup.  Although what I can recommend is:  -Flawless multiplayer, even 256 ppl at one time and doesn't feel crowded -Steam Workshop integration, you can change your jeep into mercedes SLS or something -Level editor  -Challenging default tracks  For the gameplay means, I really recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "This is a cool game. Ya cool.",
            "review_score": "1"
        },
        {
            "review_text": "PROS--- - Beautiful environment overall! - Hundreds of hours of tracks to play! - Addictive track/paint editor!  CONS--- - Driving the car is like trying to use an FTL vehicle. It turns too quickly, so it's going to be difficult for non-gamepad players.",
            "review_score": "1"
        },
        {
            "review_text": "really awesome game :)",
            "review_score": "1"
        },
        {
            "review_text": "The track mania series is one of the first games i played. I always used to call one of my friends on a house phone talk for hours racing on track mania nations(a free version), i spent likely more than 400 hours total playing the series. I just bought the valley version, and its alot better than nations. 11/1.0",
            "review_score": "1"
        },
        {
            "review_text": "This game feels like the runt of the litter when it comes to the Trackmania games. The handling is strange and often too sensitive, maps are dull. Nothing really stands out.  However if you are a die hard fan of the Trackmania series and have squeezed every last drop out of all the other titles then you might as well just get this to entertain you for a few more hours.  I would put maybe if steam reviews allowed the option, but i cant and its not a bad game, so i'll recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Trackmania Canyon and Valley are my two favorites. I'm still not sure what genre of game to put this in. It has a car and a clock, so ... racing? But ignore the cars and replace it with any object you want and... overall it just feels like a great (arcade?) puzzle game! Trying to constantly tweak your route to finish 1 second faster... 'just one more time!' is a strangely rewarding experience and can really only be understood by people who have played, and really got into, this game.  If you're looking for something totally different and refreshing gameplay, you've found it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Level Editor is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "A great expansion to the trackmania series!",
            "review_score": "1"
        },
        {
            "review_text": "When compared to its predecessor 'TrackMania² Canyon' ... this game falls short for me on so many levels. The gameplay and handling are nowhere near as tight. The cars look like they were designed in lego land. The stunts and tracks do not have the same 'awe' factor. Environment visuals are pretty good. But the fun factor just isn't there for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried getting this to work with a controller connected and the menu did not work. Must play with keyboard which I won`t do.",
            "review_score": "-1"
        },
        {
            "review_text": "the one that noone plays",
            "review_score": "-1"
        }
    ]
}