{
    "app_id": 243800,
    "name": "Gas Guzzlers Extreme",
    "release_date": "2013-10-08",
    "developer": [
        "Gamepires"
    ],
    "publisher": [
        "Iceberg Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Valve Anti-Cheat enabled",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Action",
        "Multiplayer"
    ],
    "achievements": 105,
    "positive_ratings": 2511,
    "negative_ratings": 415,
    "price": 18.99,
    "description": "Gas Guzzlers Extreme is a fast, furious, armed-to-the-teeth, trigger-happy shooter, shifted into top gear! Take a white knuckle ride in this crazily addictive combat racing game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/243800/header.jpg?t=1508770972",
    "minimum_requirements": "OS: Vista(TM)/Windows 7/Windows 8/Windows 10 Processor: Dual-core 2.0 GHz Memory: 3 GB RAM Graphics: DirectX(R) 9 Compatible Graphics Card with SM 3.0.  (GeForce(R) 8800 Ultra or 4850 AMD/ATi) with 512 MB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 12 GB available space Sound Card: 16 Bit Sound Card",
    "recommended_requirements": "OS: Vista(TM)/Windows 7/Windows 8/Windows 10 Processor: Quad-core Q6600 2.4 GHz or Equivalent Memory: 4 GB RAM Graphics: DirectX(R) 9 Compatible Graphics Card (Radeon(R) 6850, GeForce(R) 560) with 1 GB RAM DirectX: Version 11 Network: Broadband Internet connection Storage: 12 GB available space Sound Card: 3D Compatible Sound Card",
    "reviews": [
        {
            "review_text": "Car combat games can be hit or miss, and I'm very happy to say that Gas Guzzlers Extreme is a hit through and through. The game features a single player campaign spanning over three separate championships and a multitude of races leading up to unlocking said championships, in which you can pick and choose which type of race you'd like to play. You have your classic race with no weapons other than specials (mines, smoke, oil spills, and the like), battle races (where you must complete so many laps and stay alive while trying to kill your opponents), and knock out races (number of laps equals number of opponents, and you can either win by killing everyone else or completing the laps remaining). Over time, you'll unlock some fantastic game modes such as deathmatch (whoever kills 10 other cars first wins), capture the flag (my personal favorite, where you must capture a flag and drive it to the other flag, which in many cases is picked up by the opposing team; death and explosions ensue),and last man standing (eight cars spawn on the map, kill and try not to die until you're the last). You can pick and choose from whichever game modes you want to play, earning points to further your standing. If you find classic races boring, you don't have to play them at all (other than one per championship), which is a pretty cool feature.  The cars control great, and differentiate a bit between one another. You have options to upgrade your car's body, weapons, and paint job, even down to what color your license plate is. There are quite a bit of cars to pick from, and many unlock during your journey through the campaign. The cars are not licensed, but are made to appear like real branded cars (the car The Matador, for example, shares the likeness of the Lamborghini Aventador). The settings screen allows you a variety of options, including turning cursing off, which I did simply because I liked having the option (this also would make this game suitable for children, as other than the cursing, there is no blood or graphic violence other than explosions, which are fun for the whole family).   I beat the game's entire campaign in about nine hours, but it doesn't have to end there if you don't want it to. The game also features multiplayer for those who like to play online (not my cup of tea, personally, so I did not check this option out), quick races, and you can even continue in the campaign like normal, sans championships. For those who only play single player like myself, don't fret. The game's AI is some of the best AI I've ever seen in a game of any genre, and I'm not exaggerating. The AI in this will not let you win easily, and their ruthlessness in battle is what made capture the flag so fun and memorable for me. I did not notice any rubberbanding, however. The AI will mess up like you do, driving over mines and crashing into each other, keeping the game fair, yet challenging.  The game doesn't feature a very memorable soundtrack, but it's not terrible by any means, and the music that plays during upgrading sessions reminded me a lot of Fallout 3. The graphics of the game are pretty great for 2013, other than some blurry background textures that you shouldn't be paying attention to anyway. The only two negatives I have for this game are that for one thing, I never did figure out how to use the smoke special every single time I picked it up. It seemed finicky, like it would only work a third of the time you legitimately picked it up, so I'm not sure if it had a cooldown or what. The second negative would be that although you can pick between multiple game modes throughout the campaign, the race tracks seem to randomize, and you often have to play some of the same tracks quite often, despite unlocking new ones nearly every race. Also, if you are wanting to play a certain game mode but don't want to play on the track it offers, you can't switch the track within that game mode. You'd either have to suck it up or play a different mode (the latter of which I usually did, since they all are fantastic).   Gas Guzzlers Extreme is a fantastic game that should belong to every racing fan, and it serves as a great 'learning tool' for those gamers who are looking for a good intro game to the car combat genre, as its options and various difficulties make the game approachable for genre veterans and beginners alike. It's one of those games you'll keep on your hard drive even after you beat it, because it's an easy game to drop in and drop out of. I would personally rate this a 9/10. I was looking for a car combat game that would make my heart race and fulfill my need for destruction and explosions, and Gas Guzzlers Extreme did so in every regard.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man....this is as adrenaline pumping a racing game as I have played. In addition to the kick ♥♥♥ soundtrack, the cars are beefy in an arcadey way, the tracks are fun and often challenging, and the guns....oh man the guns!  So, there are a few different race modes (all the racing standards really), but in addition to all the standards, there is also deathmatch. DEATHMATCH! That is balls out crazy bad assedness! There is also capture the flag (which is pretty much deathmatch with an obvious objective added).  The campaign mode (so far as I have gotten) involves moving up through the rankings while buying new cars, upgrades, weapons and of course tricking out your cars as well. Each race features three modes to choose from (typically standard race, battle (with guns), and elimination). It's as simple as that.  You can select a cheeseball voice for your racer and s/he comments throughout. I chose Arnold, and get some laughs out of it.   So, in addition to the guns (THE GUNS!!!!), there are also pickups such as smoke, oil, mines, etc....flapjacks happen to be one of them lol...that you can then drop to mess up the other drivers. There is also nitro for that extra boost. You obviously have a myriad of ways to destroy your fellow racers, not the least of which include good old fashioned ramming. You can also pick up buffs like shields and double damage along the way. All are obviously single use or timed (depending on the type of pick up).  Multiplayer features all the modes in a seven race round robin of sorts. They are team oriented, and if you play with somebody you know, you can definitely incorporate tactics into the matches to increase your odds of winning. There weren't a ton of players online when I played last night, but it was still a ton of fun and the game populates the matches with bots to fill them out if you don't have all 8 players to fill a server. The bots are actually pretty solid players as well lol.  I would say this may go down as my fave racer. It is intuitive and easy to grasp, but still rewards practice. It has fun tracks, cool guns and upgrades, and no small amount of humor involved (outside of the voices, you might have a blow up doll or president bust passenger in your car, you might find penguins on the track, etc....).  Definitely must own, must play.  Do Eet. Do Eet Nowwww!!!!  9 skid marks/run over penguins out of 10",
            "review_score": "1"
        },
        {
            "review_text": "It's been awhile since we had another Car combat game, and this one is worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "The best Combat Racing game available on Steam. My only complaints are that there's usually not many people online and I think it could benefit with more car customisation in multiplayer - earning cash during multiplayer races to trick out your chosen car would make this more appealing in my opinion as there isn't much difference between how each car handles or performs.  Otherwise, this game is definitely in my top 10 of the past decade.",
            "review_score": "1"
        },
        {
            "review_text": "undeniably flawed but still manages to be fun. just make sure you have people you can play it with. solo or with randoms is a little....boring (to me)  some major standout flaws : the matchmaking with friends is none existant, unless you are on voice chat with friends it isnt easy getting a server together.  the zombie mode gets repetetive fast. if you dont mind that, not a flaw  the optimization is a little bad, my friends had to lower theyr graphics to the lowest possible setting to get a stable FPS.  it says ''full controller support'' yet my ps4 controller gets no responce.",
            "review_score": "1"
        },
        {
            "review_text": "Bought the full package (game + 2 dlc), never see zombies. Steam says me that I have it, but I just can't play it (if someone know why, and how to fix that, tell me).  Meanwhile, I rated the game itself positive, and if I could, I would multiple kill the like button, because it's an AWESOME game made of scrap metal, bad jokes, bullets, explosions, chickens, and fun, and that's why every fan of Burnout, Jack X, or simply cars 'n guns should have it and love it every day of his life. May be a bit short in story mode, but there is MULTIPLAYER, and if you come here with your buddies, BE PREPARED FOR WW3/4/5/THE RETURN OF THE JEDI AND well you get it. Move your ♥♥♥ outta there and go for money to buy this piece of metal art.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game however carefully. This game is also not split screen which is it's biggest down fall.  I've read somewhere that this game could be comparable to an xbox 360 version of Mario Kart. Can such a comparison be made? Sort of. The game does deliver a fun arcade impact but instead of over stepping its boundaries and becoming limitless, Gaz Guzzlers Extreme simply plays it safe.  As mentioned earlier, the fact that there is multiplayer is nice however there is NOT split screen (... seriously... get on the split screen thing for PC already people). The gameplay controls are what would one expect from a crash into everything type of game. The impact system is rewarding and when knocking out a player with a good nitro boost kamikaze, apparently you get more points. There are weapons that can be attached to the vehicles but this is where the game starts limiting itself. Playing career mode I've gone through four different types of weapons (one being a shotgun may I add and a second being a shot gun able to shoot forward and backwards). This is where it sort of sucks because I feel a lot more (maybe such as adding mortars etc...) could have been added. There are oil slicks as well as smoke clouds that are added into the game but serve more as defensive measures than offensive. This saved a bit of grace with the game giving it a little more to do. Career mode is fun and unlocking new cars slowly becomes rewarding. My favorite part to this game though is being able to choose different sort of races while moving on with your career. There are races where you can put weapons aside and make it a bump only race. This is a high light to this particular racing game, and sadly one of the only things to allow the player to step outside of the box. Career mode also offers players sort of side bonus races where the sponsor will have you play capture the flag. The variation in races is nice, and the tournament feature is a neat bonus.   If you want to run the game at 64x... do it because changing graphics within the game sometimes leads to a crash. None the less my computer goes nuts when running this game but the graphics do look good. The car selection is decent and the weapon selection and effects could have been better.   Sounds are as good as any vroom vroom sound.   This game is cool and has it's moments, but I don't see much replayability in the future either than a game of multiplayer once in a blue moon. If it added split scren this game could have got a +1 easily, followed by another +1 for having a multitude of weapons. But falling short with an appropriate rating of :   RATING : 7/10       Gameplay   B-     Story / Campaign   B-     Visuals / User Interface   B-     Sounds / Music   B-     Replay-ability   C+     Overall    C+      ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": "Very underrated arcade racing title. If you are a fan of Twisted Metal or Cart Racing games, this is a great pick up! Especially when it goes on sale for 5$.",
            "review_score": "1"
        },
        {
            "review_text": "This game is GREAT. If you loved Flatout Ultimate Carnage you'll probably love this one too, expecially online with friends. MP is a blast with lots of different game modes, dedicated servers, voice and text chat, you can vote in lobbies, tons of weapons and much more stuff... It comes with VAC too, get it now! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "An awesome car combat game that has fun handling and exciting action. Its a rare racing game that finds the perfect mix between arcade playability and competitive driving.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed the Flatout series of racing games, you'll love this one too. Very similar, with weapons instead of the silly driver-flinging mini games.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with combination of Twisted Metal, and Flatout.",
            "review_score": "1"
        },
        {
            "review_text": "I'm about 7 hours into Gas Guzzlers Extreme as I right this. As a lover of Rogue Trip on PS1 I have been hunting for a game like this for some time. I went through a couple indie games before I got to this one and it's exactly what I was looking for: Cars with guns.  The career mode reminds me of Need For Speed Underground 2 in many ways... but with guns. It does take some getting used tot and the default key bindings are rubbish, however once you're up and going and shooting and racing it's a really great game. I love that is has a plethora of ahievments to unlock that actually feel meaningful to get (similar to Counter Strike: Global Offensive). The graphics really are top notch. If you don't have the specs to play this game at max settings you're really missing out on some great stuff.  It's challenging and rewarding as a PvP race game. I don't like the Power Race mode (cars WITHOUT guns, boring eh?) and I'm not a massive fan of the Deathmatch/Last Man Standing/Capture The Flag modes either. They are fun to play around in but the lack of a minimap of any description is just killer, it's like playing a FPS game without a radar. It's fun, but it's not as fun as the races.  Haven't done a lot of multiplayer just because there aren't really many people playing it as far as I can tell. One thing I like aobut the career mode is that you progress, you upgrade and unlock, you have to think about where and when to spend your money (not that there's a real shortage of it), and that isn't present in multiplayer. All cars are the same and all upgrades are unlocked, which is fun in a sandbox mode kind of way but it is much more satisfying to have earned those things yourself.  Would love if I knew some more people playing the game because I think there's a lot of great things to explore and experiment with. No regrets buying the game at all and will certainly continue to play it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a decent racer/vehicle combat game with a (slightly juvenile) sense of humour and a slightly obscure progression system (I just keep racing and get money - that's all I understand)  Some of the Deathmatch/CTF open-world stuff isn't really my cuppa (tho it works just fine) but the racing is quite well done - the weapons are 'fair' - whoever designed the cars had an appreciation of cars too!  No other game has included a Hillman Hunter - the car which went on to be the first 'Iranian National Car' (the Neykan)  Note: the 2nd Iranian National Car - the Peugeot 405 aka Peykan - is sadly missing - DLC perhaps? :)  My ONLY complaint jere is it's a massive install (16Gb) and it has some whopping loadtimes (not noticably reduced on an SSD so uncompressed data I guess?) but if you can live with that, it's fully worth the relatively small sum I paid (Steam Sales eh?) :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game if you love arcade style car combat. Kind of a Vigilante 8 and Burnout meet Dirt Showdown. Looks great and plays solid. Good assortment of game modes and thankfully a decent enough to work singleplayer campaign. From standard racing to full blown vehicular CTF warfare.  I only have 2 problems with it.  It locks up my desktop when I exit it forcing me to sign out of my windows account and back in as the Game screen sits frozen on top of everything including taskmanager.  And secondly every time I go to play online there is nobody playing forcing me to play against AI. Honestly quite surprised this game doesn't have loads more playing it. Definitely has a AAA polish to it. If they could get more people playing online this game could easily consume hours of my life. Time for some PR work from the devs me thinks. This game could easily become a name franchise like Flatout and Burnout.  Only thing I'd add to the game is having some kind of progression and levelling unlocks so you could upgrade and buy vehicles like in the offline career mode instead of having everything available from the get go.  But yes, if you like shooting cars with cars while racing in realistic looking environments then this game is definitely worth checking out especially if it's on sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "Do your remember those all good times? If not, too bad. I mean games like old carmageddon, 1st flatout, crashday. If you like good racing/crushing/arcade/bu*t Rap*ing game with AWANSOME soundtrack, go ahead and buy it. If you dont like good games, dont buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced and exciting car action game that is simply great chaotic fun with plenty of replay value. Both races and battles are thrilling and the game is easy to learn, but hard to master. Grinding the various events to unlock new cars, weapons, stickers, engines, and even sponsors can get incredibly addicting really fast. There have been times where I didn't intend to play more than a couple of races before moving onto something else, but ended up quadrupling that number as the unlocks kept rolling in. But even in defeat, the game stays satisfying and you can earn plenty of money losing as long as you complete the bonus objectives; vice versa if you ignore the bonus objectives and simply win the events. The music is mostly hard rock, which fits well with the action. None of the tunes are very memorable, but they get the job done. You can choose a voice for your character. For mine, I choose an Arnold Schwarzenegger type voice, and he actually says lines from Arnold's actual films, specifically Jingle All the Way (one of my favorites), which gets quoted the most. It gets a bit repetitive hearing the same phrases repeated over and over again, but at first, it was amusing and elicited quite a few chuckles from me.   Seeing how much stuff there is to unlock can be overwhelming to the player at first, especially when they first boot it up, but once you really get into the game, it'll seem too easy. The only thing that would make the game feel more complete is having a better multiplayer community. That way, people would have more of an incentive to buy the cool looking dlc. Nearly ever time I went on, there were only a couple of lobbies, both with very few players. However, whenever I did play an online game, I had an absolute blast; it brought back memories of playing Twisted Metal with friends, and the action was even more insane than the highest difficulty of the single player. Overall, this is easily one of best racing games on steam, especially on the non-sim side. I highly recommend it if you enjoyed the Twisted Metal series growing up, or even if you never got to try it, as it's a very entertaining game that respects the player's time.",
            "review_score": "1"
        },
        {
            "review_text": "oh this is just SOOOOOOOOOOOOOo much FUUUUUUUUUUUUUUUUUUUUUUUUUN!!! come on!! great looking cars, weapons, and some very , VERY vindictive opponents!!!  the game evolves in a good rate, it is fairly easy to advance (even in above medium difficulty) and win races (with a few restarts on the way, because in the 2nd to last turn, of the last lap, you get a missile in the a** or find a mine on the road, or whatever) and earn money for new cars, upgrades and weapons.  The game modes are a lot, and quite diversified (deatchmatch and dominator are just awesome), the tracks also (race and deathmatch like Junkyard and Port), the opponents are quite smart...... really mean (FUNNN)... and with such funny names.  took me about 24h to finish the game in hard (if I remeber correctly)... has a lot of races, you can spend additional time earning money before advancing.... (I did that a bit, finsihed with 0.5Million).  When you get one of the top 2 cars with full upgrades, you just have a great speed advantage.  Again: FUN, FUn, FUn, FUN!!  Pushes your hardware a little bit too much IMHO and uses 16GB of disk. But, really worth it!!! REALLY!!! SO MUCH FUN!!  8.5/10 (for the 'DIE B*TCH' feeling you get during the races :D)",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun so far",
            "review_score": "1"
        },
        {
            "review_text": "If you like Twisted Metal, this is a good game to buy. It's basically an updated/current version of that classic. Good times. Most of the cars are European'y with a few American mixed it. I did however find it highly offensive they put a Dukes of Hazzard skin on a European piece of garbage car. For that they should be ashamed of themselves. Everything else however is nicely done. Fun game. ",
            "review_score": "1"
        },
        {
            "review_text": "  Very fun multiplayer. Lots to do!",
            "review_score": "1"
        },
        {
            "review_text": "The closest you can get to Insterstate 76 on PC today.",
            "review_score": "1"
        },
        {
            "review_text": "5/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, gametracks are a lot of fun. Must have for the battle race gamer, nice snce of humor in it. The variety of tracks and game modes , makes it a realy fun game to play and doesn't  get boring fast and in multiplayer it is even more fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, gametracks are a lot of fun. Must have for the battle race gamer, nice snce of humor in it. The variety of tracks and game modes , makes it a realy fun game to play and doesn't  get boring fast and in multiplayer it is even more fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fast, frantic, fun mayhem - a great game to play with friends. A great arcade combat racer that runs smoothly and provides some great game modes.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.   Gas Guzzlers Extreme is an arcade combat racing game. If you enjoy these types of games--everything from Blur to Wipeout--then give this game a try (there's a free demo). This is about as good as this genre gets.  Pros:    Weapons:  There are a variety of weapons to choose from and most have a tremendous feeling of heft/firepower.     Explosions:  When you blow up an opponent, the resulting explosion is extremely satisfying.     Tracks:  A nice variety of tracks that feature plenty of shortcuts and alternate routes.     Difficulty:  There are several difficulty levels. The game can be as easy or hardcore as you want it.     Demo available:  The demo is great for trying out the gameplay and playing with the graphics settings to make sure the game runs well on your system.   Cons:    Humor:  It's a mixed bag. It's a bit on the immature/borderline offensive side of things. Some of it was funny, but it sometimes crossed the line of good taste (IMO). Thankfully, you can turn off the voiceovers, which is the primary source of the questionable humor.   The one thing I won't comment on is the graphics. That's because my system actually comes up a little short of the minimum specs. While the game is technically playable on 'medium' graphics on my system, I prefer to play it on 'low' for silkier gameplay. Admittedly, it doesn't look that great. But it plays great. That's good enough for me.  On a system closer to the recommended specs, I bet it looks great. Again, download the demo, play with the graphics settings, and see for yourself.   Bottom line:  It's a great arcade combat racing game. Get it if you're a fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "ENG:   Armed with a totally awesome car racing game where you can tune your own car and compete in various stylish cars of different competition formats. The best thing about shooting car game on Steam, testimonials!  FIN:  Aivan mahtava aseistettu kilpa-auto peli, jossa pääsee tuunaa omaa autoa ja kilpailemaan erillaisilla autoilla eri kilpailu muodoissa. Parasta ammuskelu autopeli Steamissa, Suositteluni!",
            "review_score": "1"
        },
        {
            "review_text": "I love racing games, but sometimes I need a bit more variety and action. This game definitely delivers with a nice selection fo vehicles and weapons you can unlock as you progress through the game. Highly recommended if you enjoy brutal combat racing gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "This combat racing game is really awesomesauce. Reason? Because there's enough content in this game that'll make you play it more and more. The experience with this game never get old, had it for a year and still is playing it because the fun never dies out. I recommend this game to anyone that loves to destroy other vehicles with weapons. Also the music is great!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome oldschool multiplayer fun that works in LAN-mode!",
            "review_score": "1"
        },
        {
            "review_text": "In the past i've enjoyed games like Carmageddon, Twisted Metal, Dirt Showdown and Mario Kart, so when i spotted Gas Guzzlers Extreme (Gold Pack) on sale i couldn't resist.   NOTE: Have not tried multiplayer yet since i want to get through singleplayer first. (will update review)  Overall i'm very satisfied with the game it definetly satisfies my thirst for wreckage.  Pros: 1. Graphics are excellent, both enviroments and cars.  2. Quite a bit of destructabilty Trees/Signs not to mention chickens! 3. A lot of customization possible to controller set-up; sensetitivity &amp; mapping. 4. Combat is fluid and satisfying to see the actual bangs and dents on your opponents. 5. Great variaty of Maps and Modes to keep yourself occupied with. 6. Creative licencing always cracks me up, from driver voices to sponsor and AI names.   Cons: 1. The ghrapics optimization is lacking a little bit can get occasional FPS drop (not to unplayable extent) 2. Weapon Shockwaves in certain game modes can (especially when targeted my multiple opponents) can be extremely frustrating  Would definetly recommend this game to anyone who likes games as i mentioned above.",
            "review_score": "1"
        },
        {
            "review_text": "The testosterone flows out of this game. Really fun to blow the F##K out of Reliant Robins. This game also caters towards car guys \\ gals.",
            "review_score": "1"
        },
        {
            "review_text": "Cluster♥♥♥♥s Inc.",
            "review_score": "1"
        },
        {
            "review_text": "it's like the good old 'Flatout 2' just with weapons^^",
            "review_score": "1"
        },
        {
            "review_text": "It's like Mario Kart on steroids. Or you could almost describe it as Serious Sam if Serious Sam was a car-based game, at least in attitude. Cars! Guns! Explosions! Arnold's voice over! What else do you need?  To be a more honest reviewer, I should play this game more before writing a review but I've played the open beta/alpha and also enjoyed it then.   On the negative side, it could use more voice overs characters as they can get a bit tiring. For multiplayer, it'd be great to have a server filter to weed out empty servers but at the moment, there's a lot of empty servers so hopefully it'll pick up soon. Also missing is a split screen option and at the moment, devs are saying they'll 'look into it' but I'm cautiously hopeful. But overall, if you're into racing games, especially the small niche of destruction derby/racing-type games, then I definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good but it runs terribly on my computer. It might just be my laptop even though it has really good specs, but just be wary. I still recommend it though.",
            "review_score": "1"
        },
        {
            "review_text": "  I've looked for more than a decade",
            "review_score": "1"
        },
        {
            "review_text": "If you like racing games, this is a must have for you!!! it is the best racing game that I have ever played. You start from the bottem and rise to the top by blowing things up and winning.",
            "review_score": "1"
        },
        {
            "review_text": "really cool game",
            "review_score": "1"
        },
        {
            "review_text": "had hours of fun with this game always kept me entertained....needs some updates for new cars etc but well worth the money!!",
            "review_score": "1"
        },
        {
            "review_text": "Oh my wow... It's the 'Gaurdians of the Galaxy' of games. Brilliant. Unexpected. Witty. EXTREME! This game is everything I've wanted in a combat racing game since playing this sort of stuff on a Sega Dreamcast. I instantly fell in love with combat racers back in those does and this game packs just about everything it should. It's got a very Flatout-y vibe to it which I adore. It's pure awesome. IT'S SO MUCH FUN and that's really all that matters isn't it? Runs super smooth on an older GTX 470 on ultra. Very pretty.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I had with a racing game since Flatout!",
            "review_score": "1"
        },
        {
            "review_text": "You will need a good pc for this game, don't know why the graphics aren't that good. But it's a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, tons of fun. Could use a little optimization to help with framerate on lesser computers but other than that it is an amazingly fun game.",
            "review_score": "1"
        },
        {
            "review_text": "awsome game",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: to the people who don't like to read, there will be a short summary at the bottem of this revieuw.  This game is awesome. Basicly it's a racing game with weapons and powerups combined with a strange kind of humor that if you can apreciate that kind of humor will make you like the game that much more. I've played the game for about 4 hours now and I think i've seen enough to write a revieuw about it. If I'll encounter more awesome stuff in this game I'll change the revieuw.  The game starts off pretty awesome, You create a profile and get to choose a protagonist for your driver. You get to choose between 2 voices no-one cares about, Arnold Schwarzenegger and Duke Nukem. Of course Arnold and the voice actor of Duke Nukem didn't record these lines but I know who voiced Duke Nukem and I'm familiar with his Duke voice, and although the guy sounds like Duke there's a clear difference between him and Duke's voice, but the develloper went the extra mile and made him really sound like Duke Nukem and that's something I have to give them credit for. I don't know how acurate Schwarzenegger's voice is as I'm not as familiar with his voice as with Duke's voice but it does sound like Schwarzenegger.  After you created your profile you're good to go. You start off with a little bit of cash so you can buy your first car, put some guns on your car and you're off to your first race. At the start there are 3 game modes you get to choose from: Power Race, Battle Race and Knockout Race. Power Race is a race without weapons but with powerups like mines, oil slicks, smoke trails nitro's and repair pickups. Battle Race is a race with powerups and weapons. Those weapons are attached to your roof and can be used to shoot the living hell out of your opponents with weapons like machine guns, shotguns and rocketlaunchers and some of those can even shoot in 2 directions so no one is safe in front or behind your car. Oh, and cars donnot respawn so if you got destroyed it's race over. Knockout Race is basicly the same as Battle Race but this is more like an Elimination race as the last player that crosses the finish line gets eliminated and that goes on till there's only one car left. There's also Last Man Standing after completing the first tournament, which is basicly a battle in an arena that ends when only one car is left.  Now you might be wondering what the goal of the game is. For as far as I know it's winning all the tournaments. To get to a certain tournament you have to race untill you scored enough points to take on the tournament, you'll get points for winning races and killing opponents. Than you can participate in the tournament to compete for the most points which will be rewarded for winning and killing opponents. after you won the tournament you'll get some money and a new car. It isn't the most origonal idea but it works fine.  Another big part of the game is it's humor. Not all of you can apreciate it but it doesn't affect the gameplay if you don't enjoy it but it makes the game that much better if you do. from wheird opponent names like Sum Dum Guy, Kent U. Seemee and Lui Bricant to sponsors with names like Happy Smoke that fill your car with pictures of weed if they sponsor you. I personaly enjoyed this kind of humor. Talking about sponsors, sponsorship is a big deal in this game. They will give you extra money if you win races and you'll unlock special sponsor events that reward you with a lot of cash if you win. Sponsor events are mostly team based games like Capture The Flag and Team Deathmatch. You can get a sponsorship by winning a few races in a row. If you do well they'll pay you more money but if you end up on a losing streak they will stop sponsoring you.  I also want to mention something about the music in this game. The music in the main menu and during the races isn't anything special, but it isn't bad either. it pretty much concists of generic metal tunes that will get you in the mood but nothing memorable. The music in the garage however concists of things like country, jazz and I even heard the Dutch and American national anthems, it just adds to the fun factor of this game.  The only downsides to this game are the ability to restart races during a tournament which alows you to try the smae race over and over again untill you win and the amounth of racing tracks. There aren't that many which can make the game repetitive. I didn't think it was a big deal because I had a blast playing this game no matter what track I was playing and it is 3 times cheeper than most tripple A titles but keep that in mind if you want to buy it. Also the game is pretty easy on it's default difficulty setting as you will barely lose a race so sponsors keep bringing in more money and you'll become too rich. I don't say this to critisize the game it's just to tell you that if you want a chalange you should crank up the difficulty. You can also change the difficulty later on so you don't have to do that while creating your character.  Long story short it's an amazing game. If you want to play a Racing game as Duke Nukem or Arnold Schwarzenegger with more action than just driving around in circles then this is the game for you, races are fun and the gameplay mechanics work very well. The only downsides are te ability to restart tournament races and the amounth of racing tracks but that can easily be justified by the game's relatively low price tag. Therefor I give this game an 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Basically a good flatout game with guns.   I've been playing only the single player and am really loving it. More than Forza 5. Controls are fluid, weapons and cars are plentiful and fun to use.",
            "review_score": "1"
        },
        {
            "review_text": "best Combat racing ever",
            "review_score": "1"
        },
        {
            "review_text": "this game is good but now i cant start up the game so it NEEDS to be fixed :)",
            "review_score": "1"
        },
        {
            "review_text": "for those who remember the days of Activision's Death Track from the 80's for the pc, you will love this. You can pretty much do anything that death track could do except fire caltops. The only downside to the game is that for looking back, in any cam view, you have a rear view mirror. You actually have to look back via gamepad/key bindings to see what's behind you. As for variety of customization, it starts slowly and allows you to enjoy the build up of your cars you own (you can own multiple cars). Good variety of race types and tracks too.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Alot of fun Twisted metal style racing with nice graphics guns game modes. Great game .",
            "review_score": "1"
        },
        {
            "review_text": "Alot of fun Twisted metal style racing with nice graphics guns game modes. Great game .",
            "review_score": "1"
        },
        {
            "review_text": "A truly hidden gem. Brings to mind the best of Interstate 76 vehicular combat mixed with racing. Pure fun.",
            "review_score": "1"
        },
        {
            "review_text": "Death Racer the Game easy play, easy fun, it fun to get behind other player and swing machine gun  the war track is huge, the main mission in this game not get finish, but kill others XD",
            "review_score": "1"
        },
        {
            "review_text": "If I'm going to be perfectly honest, 10 years ago this would have been one of my favorite video games ever. I could see a younger me, at 2 am, wired on Mountain Dew, playing this until dawn's early light started to creep through the window. Mega Race, Road Rash, Twisted Metal, they're all here. The names and some of the wording of things is a bit Meta, but entertaining. It's one of those racing games I enjoy because they're not all cutting edge and technically bloated like San Francisco Rush. If I have a complaint it's that the tiers for unlocking cars is spastic. I unlocked the first 6 cars in the first 2 hours and haven't unlocked anything since. Seriously, I haven't unlocked any new cars in the last 3 days and I the number of times I haven't come in first (And by that I mean second) You could count on one hand of a lousy shop teacher. I thought there was something I was missing. I slowed down just to kill the other cars to get bonuses, even cranked the difficulty. Nothing. I looked it up and everyone else says 'Just keep grinding and you'll start unlocking cars again'. I'm at 181 points. (Number two in the game is at like 50). If I don't start unlocking new things around 200 I might give it up... Still fun though.",
            "review_score": "1"
        },
        {
            "review_text": "Twisted Metal meets Mario Kart. Zombie rampage in DLC that is similar to Serious Sam. Enough Said. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "I love games where you have to fight and earn money/power to slowly get better cars/upgrades and not just atart straight away with the best ones...   the rewards you get makes this game beautiful and satisfying. I really recommend it !",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun packed into this game. I havent put many hours into it yet but the few i have, have all been worth it. Love the Creative names for the other racers, sponsers and cars. Highly recommend for a good time and laugh.",
            "review_score": "1"
        },
        {
            "review_text": "Gas Guzzlers is the perfect 'racing game'. Short: Pro: - Nice graphics - Great racing style (I use the xbox360 controller) - Perfect mix of racing an shooting - 12 Weapons - each has advantages/disadvantages - simple but good storymode - good balanced bots - you win enough cash to buy and upgrade several cars (so there is no stupid repeating of races for money like in NFS)  Con: - the driver has only a few 'phrases' - which can be annoying when you play for a long time and hear alwys the same sentences - 2 buyable addons   Long: It combines the best parts of Need for Speed racing with alot of Weapons and tactics.  The game offers a total of 7 race types such as Classic Race, Power Race, Battle Race, Knockout, Capture The Flag, (Team) Deathmatch, and Last Man Standing.  Everyone finds his perfect match.  Do you like Racing? Go for a 'Classic Race'. Do you like slaughtering your enemies and do not care for racing at all? Go for 'Deathmatch'.  The Singleplayer takes about 10-15 hours to be played through and is fun (most of the time). If you fail to win a race - just buy a better car. Luckily you earn enough money to spend it on several cars and upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "Gas Guzzlers takes me back a few years to the days when video games were fun first and realistic last. I got it on a whim when it was on sale, and I've gotta say I'm happy with what I payed. At the time of this writing I've only clocked in about two hours, but it was two hours of explosive combat driving with the right amount of humor to leave a smile on your face. This game isn't bogged down by some stupid plot to explain why everyone attached guns to their cars, and there's no slow-moving rpg elements as you build your cars. No, this game is just full-fledged arcade histaria as you blast your way through the pack of cars while Arnold Swartzeneger laughs and screams out cheesy movie quotes. It's a fast-paced game that gives you some challenge, even if it does rely on rubber-band physics. It'll keep you playing on the edge of your seat. If you enjoyed games like 'Full Auto', 'Twisted Metal,' or other similar games, you will enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "Now I understand that I have been waiting this game many years!",
            "review_score": "1"
        },
        {
            "review_text": "If you loved the mighty 'Blur' you'll like this game. It's the best racing/destruction game I have seen since then...I could play for hours...and sometimes DO!",
            "review_score": "1"
        },
        {
            "review_text": "Ever seen the movie Death Race? Well this ♥♥♥♥ is exactly like Death Race but you are controlling everything and your not in a prison.",
            "review_score": "1"
        },
        {
            "review_text": "This is more of a mario kart but with a twist of burnout. I'm enjoying it even though I am a fan of more simulation racing",
            "review_score": "1"
        },
        {
            "review_text": "If you're like me, you're very skeptical of racing games. Especially ones that include weapons against your opponent. Hell, we haven't had great ones come to mind for years (Carmageddon, Diddy Kong Racing, etc). So what makes this one stand out?  Everything. This game spoils you with some seriously cool graphics, gameplay, and humor right from the get-go.  *WARNING - THIS IS NOT A DRIVING SIMULATOR - TURN AWAY AND GET ASETTO CORSA OR WHATEVER IF YOU WANT THAT KIND OF GAME*  What kind of cool graphics? Well, let's just say this game isn't going to run smoothly on your old 2009 PC. I'm fervently against graphics-over-gameplay gaming, but this is so beaufitul and the way it plays is so much fun that I can't wait to run it when I get my GeForce GTX 770 in (planning on running two of them, but I'm getting off-topic). So I guess I'm kinda griping and praising the game at the same time, with saying it's 'necessarily beautiful' and if you don't have a PC that's capable of running it without horrible lag, it's going to affect your gameplay a TON (perhaps even unplayable).  Where do I begin about the gameplay? You drive a car, shoot opponents, win, get money. It's not that easy, though. There are different types of races available that you need to get to know to advance yourself in the 'Career Mode'. Tons of tracks. Tons of cars. Tons of weapons. Tons of playability when you mix and match all three. As I write this, I'm only 4 hours into the game, and I'm blown away. I picked this up for $10 on a sale, but I would be happy paying the $25 had I known about it's existence prior to clicking on the 'Weeklong Deals' button.  The humor? It's all around. If you don't have a good sense of humor, well, you're just a stick in the mud and aren't going to have a good time with the game. Yeah, it's a little juvenile in some of it's humor, but that's what makes it great. Your opponents have names such as 'Jack Kass, Luke Likesheet, and Alotta Fagina' (you giggled at at least one of those, didn't you? ;) *snicker*). Currently, I'm driving a car that's sponsored by Buttwesser. Yes, Buttwesser. Once more... Buttwesser.  9.5/10 - This game is going to get a lot of playtime from me.  P.S. - Haven't tried the multiplayer, but holy crap that would be awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Good looking, responsive and funny. I'm really enjoying this.",
            "review_score": "1"
        },
        {
            "review_text": "i wish i see vigilante 8 again",
            "review_score": "1"
        },
        {
            "review_text": "No surprise here, just grab the demo. Be sure to take some time to adjust the settings, I found with many of the special effects set to 'low' (textures/anisotropy to max) that the game still looks great and also runs smooth as silk. Most fun I've had with a car game. At first I found the non combat races lacking.. but by the time you unlock some of the higher tier cars, even the racing without the weapons is great. I expected the tracks to run out long before they did. Many thanks to the developers.",
            "review_score": "1"
        },
        {
            "review_text": "The first race is a little confusing, this game could really benefit from a couple of tutorial screens before the first race to explain the controls, hud and power ups. But after a few races it all slots into place and I was driving a candy pink reliant robin with shotguns on the roof, sponsored by “buttwasser” beer, racing against characters named after Bart Simpson's prank calls to Moe's bar; how could I not love this game?  The driving is smooth, the weapons are satisfying, the events are reasonably varied, there is a nice range of cars, the single player campaign is a good length, the humour is not exactly sophisticated but did keep making me smile. All in all it a very solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game, I love it. I like car choose in game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Takes a little bit to get good at steering and shooting at the same time but it becomes very natural quickly. Great graphics, good game play, enough customization to make it fun and an awesome spin on a car game and shooter!",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing racing game especially if you like cars racing with guns. When i got this game it had mixed reveiws and some of them said the game didn't it was no got etc. I'm pretty sure those people did not have the best computers since ours is a beast and runs it fine. This game runs our computers RAM % to around 90%. It also has awesome graphics but if you had a bad graphics card it could not run this game. We have 8GB of RAM and for a graphis card we have a EVGA Nivida Geforce GTX 960.  I recommend this game but do nat get it if you have a bad computer.",
            "review_score": "1"
        },
        {
            "review_text": "My driver comforted the blow up doll sitting in the passanger seat while exclaiming 'Mommy, tell the mean man to stop' or something like that because a car behind me fired a rocket at me.  Do you need anything else in a videogame?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game whitch i play !! This game i recomment on 100%",
            "review_score": "1"
        },
        {
            "review_text": "just looks a bit out dated for me ps2 in looks but thats just me but the game plays good",
            "review_score": "1"
        },
        {
            "review_text": "This game is GREAT! reminds me so much of the game that was on ps1 i played.",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly, it reminds of me of twisted metal back in the old days of ps2. The game is super addictive and it's really easy to learn. Give it a shot..",
            "review_score": "1"
        },
        {
            "review_text": "alot of fun to play cuz cars n ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Simple racing game, but fun.",
            "review_score": "1"
        },
        {
            "review_text": "choke on my exhaust fumes bra",
            "review_score": "1"
        },
        {
            "review_text": "Make sure your Graphic card is above 3.0 ghz and you will like this game otherwise you won't have much fun.  The graphics and game play is only as good as your computer in this case. In other words this game would rock if I had a better computer. As for what I observed durring my game time in the game it reminded me of the movie Death Race, pretty fun idea and game. So have fun good luck.",
            "review_score": "1"
        },
        {
            "review_text": "A car combat racing game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game!",
            "review_score": "1"
        },
        {
            "review_text": "Ok, this is a reworked version of my review so let me try this again.  Gas Guzzlers Extreme is a car combat arcade racer, that type of genre that is usually missing in action when it comes to racing. There is a very high amount of cars that are parody versions of their real life counterpart (this is the only racer I know of that lets you race in a Reliant Robin), a ton of game modes, maps, and weapons, as well as pick ups in races.. Graphics and performace wise, this game is very pretty. Really impressive damage models on the cars where they can have bullet holes, dented metal, and falling off parts. My only gripe is that there isn't that many people on the American servers, but hopefully those numbers will grow.  Great game overall!",
            "review_score": "1"
        },
        {
            "review_text": "A bad racing game. It's a fun combat game but the driving is so floaty and janky that it's borderline unplayble.  Real shame since it has quite a bit of content: - Normal Racing - Battle racing (racing with weapons) - Knockout racing + weapons - Capture the Flag - Battle Arena  But because of terrible car handling the game is pretty much unplayble. Just go get flatout 2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Top Banana, although I was lucky enough to catch it on a Daily Deal. I don't think I would've paid full whack for it. I just wanted something quick, and fun, to play....something to kill 15-20 minutes at a time. Saying that, the first time I played it I think I was on for about 2 hours (highly addictive).  10/10 at Daily Deal price 6/10 at £18.99 (although having played it I would probably be willing to fork out about £12.99 just for the mass destruction and general playability.)",
            "review_score": "1"
        },
        {
            "review_text": "absolutely fantastic game. a muct buy for anyone whose even a mild interest in battle racers",
            "review_score": "1"
        },
        {
            "review_text": "I didnt like it because my i3 with all the recomendations lagged so much on lowest graphics and stuff :( ",
            "review_score": "1"
        },
        {
            "review_text": "I have played almost 30 hours of this game so far. It is a good, funny game.  If you watch the gameplay you will notice it has nice graphics and good soundtrack.  Besides that, I believe the best thing about it, when compared to previous versions, is that in this one they included tons of tracks, weapons and cars. That´s why I have spent some good 30 hours playing it.  Lately I have enjoyed playing it online with friends, it is very easy to set up and it works just fine.  It is simply funny, an enjoyable game,for a good price I think.",
            "review_score": "1"
        },
        {
            "review_text": "Bought during holiday sale, was very interested to try it since it's a developer from my country. Turns out, the game is extremely laggy even on the lowest settings, the cars are absolutely uncontrolable and while they look pretty shiny and all, the enviroment looks very low-poly and bad. Flatout 2 is a much better game even though it's older. The 'humor' is forced and on the level of a 5 year old.  And to think I could have bought The Talos Principle for the same money instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely fun car combat game. While its predecessor was mediocre, this games improved upon every aspect of it.",
            "review_score": "1"
        },
        {
            "review_text": "It does NOT have local couch multiplayer, despite the video showing 4 way split screen. Whal the hell... The gameplay itself is sluggish",
            "review_score": "-1"
        },
        {
            "review_text": "A truly great game made by a great developer, however i cannot give this game a thumbs up from the experience that i have had so far.  Sadly the game uses direct x9 which is fine, however despite it being a game produced in 2013, direct x 11 doesnt exist exist for the game.  This however is nothing in comparison to the games stability as it constantly crashes no matter how hard i try, the 64 bit version of the game is very unstable and sometimes crashes on launch and the fps of the game is sometimes woeful for its age and graphics, the game can often feel very sluggish in reguards to the gameplay and the frames can suffer realy badly.  If you dont believe me, just search it up. The community have posted about this for years and the developers seem to be either ignoring the issues or taking way to long to fix them, especially as they have only just released a christmas match which is a sad sign that this wont ever be fixed :(",
            "review_score": "-1"
        },
        {
            "review_text": "I've give this game a 'meh'.. Luckily I only paid $5.60 CDN as it was on sale. The reviews for this game were so compelling, I had to buy it, but I feel ripped off, eventhough I only paid 5 buks.  I give this game a 60/100. The graphics are ok, the driving feel is not that great. A game similar to this with better graphics, better driving feel, and overal realism is Flatout: Ultimate Carnage.  I dont know why this game is given such high reviews, honestly its just not that good.  Don't buy it, unless you are dying for a new game and only pay next to nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing special.",
            "review_score": "-1"
        },
        {
            "review_text": "It's ok... but the question of why is the republican party so prominent in the USA? Can't be that many people that benefit from 'the tax cuts' because most americans are broke as ♥♥♥! HA! (c is omitted because murican society seems to enjoy their panties in a bunch up the cavity) Poverty breeds poverty in that female dog! LAWLZ",
            "review_score": "-1"
        },
        {
            "review_text": "graphics are ♥♥♥♥ so ya",
            "review_score": "-1"
        },
        {
            "review_text": "This game compare to 'Wreckfest' or other racing types, this one has low quality graphics, small rate of cars, and a bit ♥♥♥♥♥♥ gameplay to beggin with! Sure, it takes back the time in 2012th, when the Beta version came out, but the point is, that this game is weak with short story line in it. Just *bleh* xq",
            "review_score": "-1"
        },
        {
            "review_text": "Jolly multiplayer, functional bots, and there's ye olde standard SP thing too. The SP races have great names.  You can choose between racing, full on deathmatch, a variety of modes blending those, customise how much rubberbanding there is, and so on.   Some rough edges and some rather curious dev stances ('you want to disable permanent voice broadcasting? pull our your microphone or disable it for all Steam games, easily fixed!') though. It's not unknown that criticism is met with thread deletion, especially in cases where a dev is called out on any of the frequent questionable statements.  This was a 'Yes' review before I noticed the disappearing threads.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not get me wrong in any way: I love to play this game. I am a big fan of arcady vehicular combat games and this one delivers in spades - but wait until it goes on sale... $25 is really only worth paying for if you're really into the genre, or you're like me where you fell in love with the game after trying the demo.",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: As of version 1.8, the Steam controller now works, although you have to rebind all of the controls to get it to work.",
            "review_score": "1"
        }
    ]
}