{
    "app_id": 243950,
    "name": "Divinity: Dragon Commander",
    "release_date": "2013-08-06",
    "developer": [
        "Larian Studios"
    ],
    "publisher": [
        "Larian Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Dragons"
    ],
    "achievements": 100,
    "positive_ratings": 1274,
    "negative_ratings": 431,
    "price": 29.99,
    "description": "You are the Dragon Commander. Your mission it is to reunite a broken empire and become the new emperor. Success depends entirely on your ability to efficiently rule your empire, build invincible armies and lead them to victory.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/243950/header.jpg?t=1447357292",
    "minimum_requirements": "OS:Windows XP SP3 Processor:Intel Core2 Duo E6600 or equivalent Memory:2 GB RAM Graphics:NVIDIA® GeForce® 8800 GT (512 MB) or ATI™ Radeon™ HD 4850 DirectX®:9.0c Hard Drive:15 GB HD space Sound:DirectX9c compliant Other Requirements:Broadband Internet connection",
    "recommended_requirements": "OS:Windows 7 SP1 Processor:Intel i5 2400 Memory:4 GB RAM Graphics:NVIDIA® GeForce® GTX 550 ti 1GB ram or or ATI™ Radeon™ HD 6XXX DirectX®:9.0c Hard Drive:30 GB HD space Sound:DirectX9c compliant, 5.1 surround sound Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "The single-player mode in Divinity: Dragon Commander sets up a decent plot about a being who can transform into a dragon who is disputing with its other, equally crazy siblings. The story portrayed through the cutscenes is certainly well told, but serves as more or less a justification to go from one map to the next.  Though the tutorials don't do much to explain this, Divinity: Dragon Commander is a mix of boardgame-style territory control (a la Risk) and real-time strategy (RTS) battles. The majority of a 'match' will have players moving pieces around a game board in an attempt to control and dominate as much of the map as possible. The biggest problem is that the tutorial doesn't even attempt to explain any of this.  After watching the multitude of tutorial videos, it's easy to assume that the game is only an RTS game, as it doesn't touch on any of the mechanics associated with the boardgame portions of a match. When first confronted with the board, some tooltips are displayed to help explain things, but they are incredibly insufficient. The tutorials for the RTS elements are also insufficient, as is the case with just about every non-interactive tutorial. There is a 'Training Ground' that allows players to screw around as they please, but it does little in the way of actively teaching anything.  The boardgame portions of the game take place in turns and require a 'big picture' type of thinking in order to play effectively. Two types of resources are up for grabs: gold and resource points. Occupying various areas on the map will add to the amount of resources gained per turn, the exact amount being displayed on the territory itself. When a battle occurs, the player has the option to choose a specific general, each with their own playstyle, to auto-simulate the battle and play the odds, or they can control the Dragon Commander and head into battle themselves.  The battles play out like many other real-time strategy games, but with one twist: the player can take control of a jetpack dragon and partake in the battle themselves. Doing so is somewhat limited; there are a couple of minutes in the beginning of the match in which the dragon cannot be spawned (it takes resources, which you don’t yet have, to spawn the dragon), and there is a brief period after death in which the dragon cannot be spawned. The dragon has specific abilities at its disposal as well, each with its own separate cooldown. There are also three different dragons to choose from, each with their own abilities and playstyle.  Playing as a dragon is like playing a third-person shooter; it's very action-oriented. When doing so, however, it is important not to forget about the troops on the ground. Battles will be fought in tandem, as the player commands the dragon in the sky while their troops march beneath them into battle. There are limited army commands while in dragon mode, so it is possible to command an army while simultaneously breathing fire on enemy scum. Mastering these army commands is a hugely effective way to get a leg up on an opponent, since it's incredibly easy to forget about a ground army while soaring through the air and toasting fools.  As for the non-dragon RTS mechanics, battles consist of vying for resources called Recruits. Recruits are gained over time as long as the player has Recruitment Centers built on top of certain locations around the map. These locations are neutral in the beginning of the map, and need to be captured by having at least one unit nearby. The beginning of the match is incredibly important as players have limited units and must try to capture and hold as many build locations as possible, both for Recruitment Centers and unit-producing buildings.  The RTS controls do feel a bit clunky when compared to the standards of the genre. Intermediate tactics like control groups can be utilized, but most units move way too slowly to micromanage effectively. In addition, the camera is constantly shifting position when going back and forth between RTS and dragon mode and it can be quite frustrating to constantly have to re-adjust the camera.  The true highlight of the single-player campaign is what happens in between turns, aboard a ship called the Raven. This is where the diplomatic elements come into play, as a group of five diplomats will constantly bug the player with proposals and recommendations as to how to run a country. Each diplomat represents a specific race: Undead, Elves, Dwarves, Lizards, or Imps. Making certain decisions will alter how each race feels about the player, so balancing the favor of each race becomes quite the juggling act.  The Raven is also where players will spend their research points. These points, accrued each turn, can be spent on new units and unit abilities or on new dragon abilities. Deciding where to spend research points is no easy feat, as doing so can drastically alter a playstyle. One player might want to spend heavily on their dragon, making each player-controlled battle that much easier, while someone else might want to focus on their army and let their AI generals auto-simulate the battles.  It is, of course, also possible to take the battles online against honest-to-goodness humans. The Raven doesn't make an appearance in any multiplayer mode, since chances are people would spend forever in between turns, but its absence is made up by the presence of dragon-on-dragon battles. There are two game modes: Campaign and Skirmish, the latter of which is a single battle in the RTS-style of gameplay, without the boardgame map. The former is just like single-player but without the Raven.  The dragon battles are the clear highlight of multiplayer. Battles are no longer instantly won once the player decides to command their dragon, because the enemy player can do the same thing and fight back. The strategy shifts dramatically when a player knows that a dragon can emerge at just about any moment. Anti-air units are way more valuable as most of them, when grouped up, can take out a dragon pretty quickly. The dogfights, er, dragonfights, that can happen in the air are intense and are a true test of a player's focus, as it's even easier to forget about a ground army when using skills and dodging.  Each area and NPC looks unique and beautiful, both in terms of technical graphics power and character design. A pretty big issue for some players, though, is the lack of a colorblind mode, as the default colors of the single-player campaign are red and green. This issue persists on both the overworld map as well as mid-battle. During the battle, enemy units are labeled when far away from the camera with a red icon, but the icon goes away as they get closer for some strange reason, reverting back to the reliance on color differentiation.  The voice work of Divinity: Dragon Commander deserves special mention. With so many different characters aboard the Raven, the voice acting was immediately a cause for concern for me. Luckily, each character performs well and it is a joy to talk to each and every one. Sure, no one character's voice actor stands out as particularly amazing, but the sheer virtue of not having a single character grate on the nerves is not to be understated.  Divinity: Dragon Commander is a prime example of a game being bigger than the sum of its parts. The RTS elements are a bit rough, but at least it's possible to control a dragon with a freaking jetpack to blow stuff up, while the boardgame-esque territory map requires players to think of the big picture. Talking to the colorful cast of NPCs aboard the Raven in between turns in single-player was easily one of my favorite non-dragon parts of the game and really highlights the writing and wit that the Divinity series has come to be known for. The tutorial needs a lot of work and the game isn't very friendly to colorblind players, but Divinity: Dragon Commander will certainly unleash the dragon strategist in all of us.",
            "review_score": "1"
        },
        {
            "review_text": "Divinity: Dragon Commander is partly an opportunity wasted. On one side is a rich strategic elements to consider, in an interesting setting, and chock full of original ideas. On the other hand though his simplistic gameplay during battles, poor game balancing in the individual, and the inability of developers to deepen certain inspired as the mechanical use of the cards or the Dragon in battle, lower the overall quality of the game to 'just as good'. Although a bit disappointed, we cannot not make compliments to Larian for originality, and hope they can exploit their talents equally distinctive projects in the future. The basics are there, and they look very solid.",
            "review_score": "1"
        },
        {
            "review_text": "Before this game I'd never played any of the other games in the franchise. I purchased this game simply for my love of RTS strategy and the insane(ly good) concept of dragon combat.   So what does this game do right?   There is an interesting research system integrated into the game, research is conducted through research points that you pick up per turn depending on the territories controlled and the buildings on those territories.   The politics system is actually a lot of fun (though frustrating at times) and a large part of the game. Political decisions are made throughout the game knowingly or not. For example if you build far many buildings in your controlled territories you can lose reputation with the elves (which are predictably nature orientated). Every turn or so you vote on some initiatives brought up by certain representatives and can lose or gain reputation points. At first you might think, so what? However, since each faction inhabits certain territories the amount of troops can build or the resources you gain per territory are highly dependent on how much that faction likes you.   Additionally, also must manage your responses to your friendly generals and the princess you choose to “woo” as well. Dialogue options between these characters lead to some pretty significant outcomes during the game so it is wise to pay attention to the characters and faction personalities.   Oh and by the way I can't really stress enough that each voiced character you come across has a unique personality that will develop over time with their own specific needs and wants.   Dragon combat, how how I love you. During the normal RTS strategy portions you can become a dragon and blaze around the combat area using specific abilities and really punishing enemies that come against you.   So what didn’t I like about this game?   Combat can feel really messy without there being much strategy that just having 'more' than the other opponent. Sure there are a ok sized amount of abilities for each class and each class has a counter class (or building) but it really feels under utilized.   Combat on higher difficultly levels can be extremely punishing. Each territory can only draft so many troops before it is tapped out, this encourages you to expand into fresh territories. However if the enemy decides to attack a tapped out territory that doesn't have a large amount of troops stationed on it, there won't be much of a way to fight back.   What kind of irked me as well is that no matter how many troops I had at the end of each act it seems that there is a standard set amount placed around the map when starting a new chapter. This kind of took away from my sense of accomplishment when taking down an enemy and managing my armies.   Finally, I felt the game drags a bit on the final act not really giving you much to do besides to slug it out with the final enemies until the end. For me, this was kind of a unsatisfying conclusion and would have liked to see even more personally engaging missions involving your generals, allies, or princess.",
            "review_score": "1"
        },
        {
            "review_text": "While i haven't experienced online multiplayer, i can say that the singleplayer storyline is worth it on its own; the RTS elements may be considered weak as there is only one 'faction' as such when it comes to units; and most of the units fall into basic and uninteresting roles; this is but one part of a much larger and more intracate strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "I really wish their were more games like this. There are so many different ways to play. If the technology tree was bigger and more balanced this game would be perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Over 60 hours played, i can simply say i am loving this game.  + Good graphics + Entertaining characters + Good story + Combat is simple but great fun when you play as the dragon + Replay value due to the different political decision and romance options ",
            "review_score": "1"
        },
        {
            "review_text": "The social/political system of this game is what I truly recommend to experience. Everything else leaves to be desired.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike many other reviewers, I actually enjoyed the strategy aspects, though they still aren't as good as the (beautifully written) politics aspect. Are the two strategy aspects as difficult or deeply involving as other strategy games? Not once you figure out what you're doing (which you should figure out after a couple battles). But what the game does, it does well:   The Risk-like segment is pretty easy once you learn how it works but can still hurt you badly if you try to ignore it. Figuring out what units work best with you straegies iis essential here.  The RTS segment requires quick decisions and alot of tactical thinking (though it isn't as complex as other games) unless you either bring in a massive army from the Risk-stage or learn how to use the dragon. If you learn how to use the dragon well and upgrade him appropriately, he can wipe out small armies singlehandedly (but what could you expect from a dragon than to burn everything?).  The politics stage is the best part. It is, again, beautifully written, and its light satire is not only believable for the world it's in, but also manages to be humorous at times. However, my only complaint is also in this section: I rarely felt the effects of my decisions on the battlefield. The support aspect of it is very obvious (and painful) if you really ♥♥♥♥ off any of the races- since your support with a race (how much they like you) determines how many units you can deploy during an RTS battle in their territory, ♥♥♥♥♥♥♥ a race off (30% or less support) will make those battles much harder. The other aspects of decisions, such as consequences that reduce your empire's income, I rarely felt- they are usually so easily counter-balanced during the Risk phase that I could usually undo the consequences of a decision by conquering 1 territory.  This game's definately a 9/10 for me. It's not the most complex, involving, or challenging strategy game ever, but what it sets out to do, it does extremely well.  Long live the Dragon!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's worth buying on sale if you are into politics games. It has interesting characters, good shake of funny lines here and there. Unfortunatelly not many of them are explored into greater depth, but they've got me intrigued and wanting for more. The map strategy part is kinda fun. But it's simple. And I would have prefered if it was the main combat part because:  The RTS part is horrid and I am avoiding it every step of the game through auto-resolve. That whole part just doesn't fit with the rest and is obnoxious click-fest. But successfully ignoring it, I am indeed having lots of fun with this game.  BUT! IT HAS A DRAGON WITH A JETPACK!",
            "review_score": "1"
        },
        {
            "review_text": "Looking at the ambition of this game no one could be faulted for fearing it to be a jack of all trades and master of none. However, that is not the case at all. The individual parts complement each other fantastically, and come together to form a diverse and engaging gameplay experience the like of which hasn't been seen in years, maybe decades.  The characters in story mode deserve special mention -- they are more fleshed out and entertaining than in many highly rated RPGs. It's also suprising how well polished the game is despite the great variety of mechanics and modes present.  Dragon Commander will make you laugh with its playful, but biting, treatment of political issues, it will make you clench your teeth and try to salvage the strategic situation after a hard-fought tactical loss, and it will give you the satisfaction of burning your enemies to cinder as a dragon.  Now buy it. Buy two.",
            "review_score": "1"
        },
        {
            "review_text": "A hodge podge of strategy games that feels oh so very right. I enjoy the way they mesh together, and nothing feels better than turning the tides of a RTS battle that you had only 1% chance to win by turning into a dragon with a jetpack, and leveling all the non anti-air units. The strategy elements aren't hard to figure out for anyone who's played any type of RTS, and is a great game to lose some time in.  The politics of this game contribute by enhancing or hampering your controlled territories by the decisions you make, plus there are factions you can either appease or essentially treat like a tiny bug by crushing their hopes of ever being significant.  All the characters are interesting, and you have the ability to marry someone from each of the factions, including a lizard, a dwarf, and skeleton. I never found myself wishing for different scenarios in the game outside of the ability of diplomacy which is my only real gripe with an otherwise fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an Underrated Game, RTS Combat may be a bit lackluster but the story elements are quite good. Plenty of decisions to be made in how to run the Empire you are forming which can be quite interesting, engaging and amusing.",
            "review_score": "1"
        },
        {
            "review_text": "i married a lizard woman................where did my life go wrong",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it. Spawning into the rts map as a dragon is an interesting concept and allows to win tough battles you would otherwise lose instantly.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Politics that affect everyone. Battle on air, land and sea. Research and a crew with their own personalities. The twist of being a dragon. It's right up there with Civ5, Warlock and other games I replay when I want to kill time.",
            "review_score": "1"
        },
        {
            "review_text": "Quite good. This game isn't overly, thoroughly fleshed out in its three pillars of play: narrative, world strategy, and direct unit command. Somehow, though, what they produced in each of these pillars is just enough to enjoy, particularly when the game presents them one by one every turn.  The dialogue and story really surprised me. Its premise is intriguing, and the developments are startling. You'll receive jarring political proposals from left and right wing factions, discover a villain in hiding right under your nose, and settle matters between squabbling generals who don't immediately have your respect. The personalities shone through brightly and the voice acting was sufficiently hammed up for what is essentially a fantasy soap opera. But, as stated, not entirely fleshed out. Reaching the conclusion of any story conflict, beyond some spoken words and the occassional shadow puppetry cutscene, is abrupt and unfulfilling. It's a real shame for all the build up, so have your imaginations ready to fill in chapter epilogues.  The world map isn't overly sophisticated. Producing units and shuffling them about the board can be satisfying if you're quick thinking. But if you get caught up pondering your next move, like my undeveloped strategic mind will often do, you wake up and realize you're staring at something that's mostly static, with hardly a thrilling flair when battles are won or lost. More amusing is shoving units into battle knowing your odds are poor but selecting the option to directly control the battle.  This phase of gameplay gives a view and functions similar to games like StarCraft, but more like Dawn of War. Expect to manage control points for money, build units that move in real time, and eliminate the opponent's army or base. The battle is determined by the number of units present on the strategy map that prompts this specfic battle, and this where you can turn the odds in your favor by using your dragon form. Out of nowhere, you can materialize a dragon onto the screen and maneuver it like a character out of a third person shooter, controlling your position and height while breathing fire onto troops or activating spells to benefit allies or cripple enemies. If you were caught off guard on the strategy map, expect to concentrate on using the dragon form very intently. You may have to frantically fly about avoiding ground to air fire, scorching key units, and shielding your army. All in all, not as developed as a true real time strategy game, but mixing these elements was really fun.  Honestly, this game doesn't need a huge commitment to see the appeal and it was really great to get to see different genres interwoven together into something relatable for avid game players and manageable for interested players that might not be familiar with so many titles.",
            "review_score": "1"
        },
        {
            "review_text": "I really, REALLY enjoyed this game. I'm a huge fan of the Divinity universe overall, so when I heard about this I had to pick it up and try it. Obviously, the Divinity game world's strongest genre is RPG, so it was interesting to hear of a RPG/Strategy hybrid set in one of my favorite RPG universes. I also love strategy games, and I love making political decisions in games...so I tried this.  Some people say they were disappointed, and although I guess I can see what they were disappointed in (the game touches upon so many aspects of a few great genres, so it doesn't delve too deep into any of them), this game is a hybrid of sorts, and is very interesting to boot, so I expected this. As a huge strategy fan, I wasn't expecting this game to blow AoE II out of the water, so I wasn't disappointed. This game delivered exactly what I wanted it to. The strategy aspects aren't greatly complex, though the game has a naturally harder difficulty due to its action-oriented AI (it DOES have four difficulties, though, for those looking for a more casual playthrough). Best of all, because you are the dragon commander, you are able to spawn as a dragon (you also get access to lots of special abilities and upgrades!) and follow your troops into battle to help them take over the map, which is awesome. I really don't have to explain why. :)  The game is really into getting you involved in political decisions where you decide everything from whether or not to allow gay marriage, to allowing the church to charge civilians for 'forgiveness,' to sacrificing worker safety in order to create outlandish war machines. You have a team of councillors that all chime in to help you decide, and each councillor represents a race that you can either make happy or unhappy with your decisions. This affects what type of bonuses and benefits you get that either help or hinder your troops on the strategy map. Basically, this game has quite a few little pieces to it that all work together very well, in my opinion. I immensely enjoyed speaking to my councillors and getting to know all of the interesting characters I was introduced to (it was arguably my favorite part). And as is a Divinity staple, the dialogue in this game is top notch, so it is always a joy to read, and the voice acting is also incredible.  Part strategy, part card game, part politically charged RPG, Divinity: Dragon Commander is a fantastic game with high replay value for the storyline decisions alone, if nothing else. I am so glad I bought this game and experienced its highly original concept for myself. I highly recommend it!  Edit 4/29/2016: I've noticed that an abnormal percentage of people have marked this review as unhelpful. As I always try my best to cover all aspects of a game in a review to be helpful to potential consumers, I would appreciate any comments on my review letting me know the information I've left out, or any questions you have about the game which my review left unanswered. I will update the review as applicable. Thank you!",
            "review_score": "1"
        },
        {
            "review_text": "This is probably my favorite pc game for a long time now, and one of my favorites ever. I have a big thank you to say to the company, since they seemed to have pried into my head and found all the things i wanted from a game and made one with them.  Graphics. The world of rivellon looks really beautiful especially from above, as does the council, the raven, your advisors. The music is also a very strong part, the melodies stick with you and put you in the mood. the characters, scenario and background, are great and well designed. The one exception is not enough to bother. The gameplay ranges, from tabletop strategy to rts to action, and its lovely.  I recommend this game to anyone, and though i finished it i know i will play it again.   The only thing i was left wanting from this awesome game now that i finished it is MOAR-moar dragons, moar wives, moar councillors and glory! (and that buttefly dragon we never got to see.) Methinks its expansion time.   Once more, thank you for making this game. You have made a follower from me. Do i recommend this? A thousand times yes.",
            "review_score": "1"
        },
        {
            "review_text": "Decent execution at campaign, good tactical aspect, but real time strategy part isn't too good. It is about time management and micro-management, plus a bit of mastering of the geography. More about speed and multi tasking than anything related to strategy. Can be difficult, as CPU can multitask better obviously and I imagine it can be frustrating with human opponents in multiplayer. Graphics are ok, but once again they suck in the real time aspect. Most time is spent there, so I'd give game 5/10, and that's being generous. For me it probably would be actually 6/10 if they just removed the real time combat aspect entirely and left the % one on tactical (qick battle system). Fighting manually is just a huuuge chore and not fun.",
            "review_score": "1"
        },
        {
            "review_text": "i hardly see players play this game why is that??????",
            "review_score": "1"
        },
        {
            "review_text": "great game as far i know ^^",
            "review_score": "1"
        },
        {
            "review_text": "This is a weird mish-mash game. It has dragons, RTS elements and amazing characters. I love it. It's great! Play it! It's that gem in the indie store except it's not an indie game.",
            "review_score": "1"
        },
        {
            "review_text": "The ideas are great, but I fail to see how the heck am I supposed to invade if I am constantly invaded and can never muster up enough units to invade!  And how can I build more units or buildings when in dragon form!!!! come on, didn't anyone think of this?",
            "review_score": "1"
        },
        {
            "review_text": "Divinity: Dragon Commander is NOT a typical game – it takes elements from many different gameplay styles and mixes them together to create a unique gameplay experience. The well written characters and the political decisions feel like an RPG, but the map screen is more reminiscent of Risk. Then, the actual battles are fought in a real-time format, like Red Alert or Warcraft. The developers tried to stick 3 very different styles and unite them with the main character – a dragon with a jetpack. The basic plot of the game is that the Emperor has died, and his children are in a civil war over who gets to rule the empire. The player controls the “black sheep” sibling – whose mother happened to be a dragon. Honestly, this isn’t the most exciting or original plot – “The main story of Dragon Commander is simple and doesn't really break away from your standard 'noble hero saves the day' trope”. However, the other characters are far more interesting than the main story – first you have your generals, who include a gruff “solve all problems with violence” military man, a snobby upper-class stuck up lizardman, and a woman who used to be the Queen of a matriarchal society and shows distain for all males. Unsurprisingly, these generals don’t get along, and it’s up to the player to unite them.  But the most entertaining part of the game comes from the political decisions. There are five councilmen representing each of the five races in your empire, and every decision you make effects their opinion about you. For example: the dwarf council representative proposes that the law exempting the church from taxes be repealed. The undead council representative, who is extremely religious is strongly opposed to this proposal. The player can also run into surprisingly modern issues, like copyrights, women in the military, or gay marriage. The laws will also affect how your empire runs – passing those church taxes will increase your income, granting women equal pay increases your expenses and so on. I often felt like a real politician making the decisions, and rejected proposals I actually favor in real life either because they were too unpopular, or because they would be too expensive.  However, this component of the game has one major flaw – every choice the player can make is either “yes” or “no” with no stops in between. At one point, the player is offered a bribe to allow a murderer (who *happens* to be a member of a wealthy and high-ranking family) to go free. One of your generals (who is linked to the victims) asks permission to assassinate the murderer. The player’s only choices are “Accept the bribe and let the killer go free” or “give permission for the assassination mission”.  There are two other main aspects to the game, because you need to continue fighting the war while all this is going on. Basically, you can build and move units on a map screen, in a manner not unlike Risk. This phase of the game is decently designed, and the player can also spend gold to build structures in their lands such as a gold mine to increase income, or a war factory to produce units. However, the cards come up at complete random (the player can invest in buildings to increase the quantity of cards, but not the quality) and range from near-useless to game-breaking. For example – I can draw a card that gives a bonus trooper (the weakest unit) to the next battle, and lose every battle because the AI opponent drew a card that gives 5 bonus juggernauts (the strongest unit). In addition, while the various effects of your policies are in effect, “luck” outshines them all. Luck gives a bonus or penalty to every battle, and there is no way to know what decisions will affect luck without looking them up or having played the game before. Finally, there’s the actual battles themselves. While they can be resolved on the world map automatically with the odds favoring the stronger side (or who has better cards), the player can also choose to command the troops themselves. This sends the game into the real-time strategy component, where the most playtime is spent. But basically, you'll usually just build tons of units and throw them all at the enemy. The real time battles are more often than not dull, drawn out exercises in futility as the winner is often known before 2 minutes have passed, despite the fact that most battles last at least 10 to 15 minutes. It doesn't help that the AI opponent is generally a complete moron, repeating the same tactics over and over (regardless of whether they actually worked before) but the big problem is the lack of super-weapons, creative units, or in-battle dialog most real-time strategy games offer. I feel “sub-par” would be more accurate. There is one upside to these battles however: the player can transform into a dragon.  Using any dragon abilities the player has researched, the dragon can breathe fire on the enemy, but also curse them, heal nearby friendly units, and use the jetpack as a speed boost while flying. Surprisingly, the dragon isn’t overpowered despite the fact that the opponent lacks this ability, because anti-air units have a high priority among the AI. But even the upside has its own downside: controlling the normal units while playing as the dragon is awkward to do, and most players simply transform back before giving orders. Overall, Divinity: Dragon Commander is a decent game, though not really with its asking price of $40 – it can be finished in under 10 hours. Many players attempt to become so good at the ‘risk’ portion that they can skip the battles entirly and enjoy the politics. I -DO- recommend getting this game, but don't pay full price. ",
            "review_score": "1"
        },
        {
            "review_text": "8.7/10 Its very enjoyable game - a great mix of RTS and RPG. I really like political choices u have to make and how they affect gameplay. Im not big fan of RTS but in this game im enjoying it very much. The dragon form in RTS battles is very clever invention and handy in dire situations. Story is predictable but still good enough to keep u interested.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to have to go with an 8/10 on this one.   I have a mixed opinion on the many elements that Dragon Commander offered me. Some I liked while others I didn't. Let me start from the beginning. You are thrust into a world that is being ravaged by war. Due to certain circumstances, it is up to you to stop that war and then begin an entirely new empire. The enemies that you're supposed to defeat don't really have much background to them, only having their names said in a cutscene and also giving a reason why they would be considered crazy.   The way you fight in the war is done by viewing into a world map where you summon your soldiers, invade other countries, build different types of buildings that have their own bonuses that helps out whoever is control of that country. You also have the ability to use cards that have their own effects to them on those individual countries. For example, you can increase the income of gold in the capital of your country for a certain amount of turns so that you can produce more troops. Or, you can decrease the population to the enemy faction's capital to a certain percent. There are many more as well so I did like the variety that I was given. It let me strategize my moves better for when I decided to take a country from my enemy.   Now, when you do invade a country and that country is already inhabited by the soldiers of your enemy, you are given the option to fight it yourself, or autoresolve the battle by having one of the four generals that join you along the way and the imperial army. Using the imperial army is free but it offers no bonus to your chance to win while the generals each specialize in commanding different types of troops, the chances of winning varying on who you choose. If you command the battle yourself, you're put into a level with your troops already at one base and your enemy across from you in another.   You use recruits to build different war factories that range from naval, aerial, ground, and heavy combat troops. You're able to move individual troops to go to an unclaimed build spot so that you can use it to make more troops or increase your recruitment speed. The enemy will do the same and it's a battle for dominance until you either kill all of their soldiers and take their headquarters or they do that to you. One really cool part during this combat that the game is rather famous for is that the player can directly enter the battle.  As a dragon. With a jetpack.   With this mechanic, players can help out their troops if things aren't going so well during the battle. I thought that a very creative idea by the developers. Because... who doesn't like killing enemies as a dragon that is equipped with a jetpack? The downside to this, however, is that I actually rarely needed to help out my troops. I'm not much of an RTS gamer but even I was able to figure out the way to win every single battle in this game. Spam your troops and swarm compounds. That's really all you can do in these battles. Coupled with how similar the levels are that you fight in, some even looking exactly the same, I didn't really feel a satisfaction to winning. I was never really on the end of my ropes and biting my nails, wondering how I was going to win. I literally just stared at the screen and clicked my mouse to produce more troops.   Oh, another thing about the battles is that the camera isn't all too great. Whenever I was up against one of the 'invisible' walls in the level, the camera wouldn't let me control it and I wasn't able to get the proper angle I wanted to get. I didn't really like that so it made me have to stay away from those boundaries, even if my troops were fighting against the enemy near one.   Alright, I think I covered that part of the game enough. Let's move on to the other side. The side of where you're thrust into politics and everyone looks to you to decide on whether a certain policy is allowed or not. You deal with the different races in the world, the dwarves, the elves, the lizards, the imps, and the undead. You read that right. Undead. Each race has their own beliefs and how they think the world should run and they propose many different policies to you, all of them similar to issues that have been brought up or are being brought up in real life. Like, the legalization of their version of weed, or allowing government healthcare.   I don't really like politics or politicians in general but it was a really interesting aspect in the game because of how different it was. I also liked how everyone was different and had their own charms to them, even if I didn't agree with their policies at all.   And you did all of this inside a ship that was called the Raven. The overall design was aesthetically pleasing to me. There were various NPC's doing there own duties as you switched to the differnent rooms. I wished there was a free roam so that I could explore it more thoroughly, but I was still satisfied with what I was given. While doing this, you can access the world map, where you plan your moves in the war, talk to your generals who are also interesting with their own personalites and views. At some points, their are issues that they also have to deal with and ask you to give them permission to go deal with them. Some have consequences that you can choose to have them be tried for or to get them off scott free. It's really up to you. As it should be.   Okay then, now I think I should tell my complaints that I haven't already stated.   The tutorial isn't very good. As I said, I'm not much of an RTS gamer, so I've rarely played them. So it took me a while in order to figure everything out before I could do them properly. I wasn't told how to control my troops while in dragon form so I would have to jump from mode to mode to make sure they weren't dying while I was off doing my dragon thing.   Then I experienced a glitch in the game where the meter that told me when my next unit would be ready did not end and that unit wasn't produced, leaving me with just the ones I had at the beginning of the battle. It happened to me once but I thought I should let that be known anyway. Also, the enemy variety isn't very diverse. All of the troops are the exact same as yours. No other countries have their own unique units that you have to fight, which I thought would've been a pretty interesting thing to have. These things don't change my opinion of the game or how much fun I had with it but I don't think it did a really good job introducing me to the RTS style.   All in all, Dragon Commander is a good game. Depending on whether you want to put up with the various downsides to the rather lackluster RTS sequences is up to you. But, you will definitely enjoy getting to run an empire that is made around the policies you instate.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game but not a gem. The RTS part gets repetetive and boring really fast.  But I really enjoyed all the politics parts with their rich characters (kinda, colourful might be a better word) and dialogue options. Too bad they are so short and few.",
            "review_score": "1"
        },
        {
            "review_text": "Ever want to give gays total rights and flip off the religious/industrial jerks while doing it? Ever want to deny gay rights and ♥♥♥♥ off the hipies that whine and moans about it? Ever want a semi-understand of why nothing ever gets done in government because you don't want to ♥♥♥♥ people off too much because you still need their help on other matters? This is the game for you. The strategy part of it is simple, a bit too quick and a tad confusing, but it's alright. it's not horrible, but it's not that great. No, the real fun of this game is the deciding rulings you make between turns. Allow the elves to smoke weed? Let imps dig up a grave site to make bigger bombs for your army? Or even ban nudest beaches, all these and more are choices you'll make in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a dragon commander.... Need know more?",
            "review_score": "1"
        },
        {
            "review_text": "I'm a dragon commander.... Need know more?",
            "review_score": "1"
        },
        {
            "review_text": "Turn in to the Dragon is what I always want But I want Female dragon too! ",
            "review_score": "1"
        },
        {
            "review_text": "You can marry a skeleton.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastically entertaining blend of strategy and political RPG.   The writing and voice acting went way above my expectations, easily AAA quality. Most people will find the dialogue excessively wordy, but it's pretty rare to ever hear that comment about a game. Dialogue choices do impact the game, and I made multiple save points so that I could go back and explore the other outcomes. The game very frequently forces you to make the best choice out of several bad choices, and tries to really punch you in the morals at every opportunity. It leans heavily on real-world allegory, and reminds me a lot like being in a commanding role on Deep Space 9 or Babylon 5, but in a fantasy/steampunk setting.  The rest of the game is fairly standard turn-based overmap strategy, and real-time tactical combat. The overmap game is very simple, although you'll feel burned by some of the 'rules' in your first playthrough - the map expands and resets your assets, which can leave you in awkward positions at the start of the next story phase. The tactical combat is generic, however the dragon-mode spices things up. I found myself frustrated at all the limitations on the dragon game mechanics, especially since it's one of the most unique (and heavily advertised) features of the game.  Overall I recommend the game to any RTS, RPG, or moral dilemma fan. This game has left me dreaming of a perfect world where the Divinity RPG/story components are married with the solid strategy of a game like StarCraft II.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting take on strategy based games with both RTS segments and tabletop territory capture and troops movements. You also get to discuss politics with your Generals with realworld topics about war, racism, sexism, religion and more. Eveyone has their own opinion and you get to decide either by doing what you think is 'right' or by playing the politics game and manipulation your alliances.  It's pretty profund in some aspects but sadly, at the time i first played it, the RTS part of the game suffered from a lack of polish as base building and capturing was tedious and pointless when you only needed to spam your fireballs around the map and be agile. Units do have strengths and weaknesses but ultinately, it's not really a question of strategy but if you participate actively as a dragon or not.  Still fun though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is defintelty in my favorite games. The combination between strategy, politic and STR is a really good idea and really well done. I have a lot of fun playing the game and it's really nice to play it with other players too.  So there are 3 big features in the game.  The politic part in the solo where you make choices as chief. It is really interesting for the impact it can have on your army and the world and for the fun it has too. Sometimes the politics ask you very strange or useless things and they are fighting each other to make you choose their decision. This parti is very well written and the story very nice.  The strategy map turn based. Interesting part too. The maps are really beautiful and it can be very strategic. There is a card system too where you can use some cards to build buildings on the map, decrease the price of the units in a place, or even mercenary cards to help you in a fight you are disadvantaged. The map , the strategy, and the cards make it really nice and interesting.  The RTS. The maps are nice, the different units and capacity too and the fights are really fun. Being able to help your unit by changing in dragon in real time is so good. But I find it a little fast and not always well balanced.  To conclude this game is a pearl. You have to play it and have fun with it . Yes all the part are not always well balanced and the RTS is not the best RTS, the strategy map the best strategy map etc... BUT all this combined make this game one of the best game i've played. Judging the game only with one aspect ( like a lot of people do with the rts part ) is bad i think because the game is not only a RTS. The RTS is a part of the game, like the strategy or the politics and it's their combinaison who make this game so good. This is an independant studio so they haven't millions it's why every parti is nice and fun but would need some enhancement.  Play It :D",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game once you get use to it. Its different from a lot of the RTS games I am use to",
            "review_score": "1"
        },
        {
            "review_text": "its a fun game to play, its strategy is good, its maps are good, its story if both good and funny. and its more then just a top down strategy making it feel like you are actualy there instead of being 'god - like' in battle",
            "review_score": "1"
        },
        {
            "review_text": "8.5/10. I really enjoyed it! It's political challenges were more than awesome! Being able to turn into a dragon was really fun, it added a nice touch to the game. However managing the battle map was bit hard at times due to a lack of a proper tutorial within the story mode. Overall it was a good, and well worth what I paid! I would recommend it to anyone looking for game that is 50% Political choices and 50% combat.",
            "review_score": "1"
        },
        {
            "review_text": "Great game only wish instead of idustrial robotic warfare it would be like midevil or some sort of melee",
            "review_score": "1"
        },
        {
            "review_text": "Also known as Political Simulator 2013.  Divinity: Dragon Commander places you in the role of well, as the name applies, a Dragon Commander in charge of an army (duh)!  The game is divided into several parts, much like the Strategy games of today. The first phase involves you walking around your command ship, talking to various politicians, your generals and the adorable little imp to research upgrades for your army.   After talking to them, you head on the battle phase of the game. This is where you're thrown into a map for you to manage your armies, which country builds what unit or structure, the movement of your armies and the activation of player cards (which gives you a slight advantage in combat).  Combat is much like Star Wars: Empire at War -- You start off with a bunch of units, keep sending them to their deaths to try to achieve victory and call in more reinforcements when needed. Reinforcements are based on the amount of population you have in that particular area where the fighting is. Your fight is over the sea? Too bad, you'll have to make do with your current fleet and can expect no reinforcements for that fight.   The most interesting part about this is that you can morph into a Dragon as and when you want to join the battle, throwing fireballs down at people, healing your own armies or just to fly around being silly. You might find it overpowered in the first few levels. However, do expect to get shot down within a few seconds by a barrage of missiles should you try and charge the enemy army head on in dragon form later on in the levels.  Of course, you can opt for the lazy option of clicking 'auto-resolve' battle. The outcome of the battle is determined by the amount of troops you have and the general leading them. Quite more than often, I find myself clicking on that button just because I want to know more about the story than actual fighting.   Besides fighting, you can settle down with some tea and biscuits with the various politicans, arguing over petty things like nudity being banned. I mean, who the heck cares when there's a flippin' war going on? Nope. Politicans will be politicians and thus will keep pestering you for your decisions. Your decisions WILL have an impact on the combat of the game, be it increased gold or having a certain race support you when fighting in their land.   What I'll remember about this game would definately be the character voice acting. Quite often, I find myself listening to the long essays that several characters have to say. Music isn't half bad either--catchy, upbeat and pretty fun to listen to when you're commanding armies in the heat of battle.   Dragon Commander shines in it's aspect of story-telling and character developement. However, if you're looking for a solid RTS fight--this isn't the game for you.   Overall however, Divinity: Dragon Commander is definately worth the pick up for it's price.   And hey! It's on sale as I write this. So yes, it's definately worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Troopers? 3 Gold. Transports? 8 Gold. Jetpack for your Dragon? 300 Gold. The look on Catherine's face when you refuse her demand for a pay raise? Priceless.  There's some things Gold can't buy. For everything else, there's Mastercard.   10/10 would get called a chauvinist again. ",
            "review_score": "1"
        },
        {
            "review_text": "You're a dragon with a jetpack. Game has humour, politics, and plays like many games put into one. The real downside is the main campaign may be short (depending how good you are).",
            "review_score": "1"
        },
        {
            "review_text": "can be difficult, and requires you to think ahead before making decisions. So a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious political diplomacy, vibrant characters, solid turn-based strategy, and fast-pased RTS? Absolutely fantastic!   My only complaint is that the RTS portion of the game is a little weak. This really doesn't affect the single-player experience at all, but it hurts the multiplayer quite a bit. If you're primarily looking for a competitive RTS game, you could probably do better.  If, on the other hand, you're looking for a good single-player strategy game with an engaging story and gripping characters, then this is an excellent deal.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome universe, fantastic characters, and a dragon with a freak-in jetpack, need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "This game is a real mixed bag. No one single element in it really stands out. Even the game's core RTS gameplay is only passable at best if taken on it's own. Yet Dragon Commander is far greater then the sum of it's parts. A crafted mixture of emmerstion, characters, storytelling, and strategy makes the overall experience with this game as enjoyable as it is unexpected.",
            "review_score": "1"
        },
        {
            "review_text": "Really compelling gameplay, layering turn-based strategy, real-time strategy, CCG and RPG modes. Campaign is somewhat short, but worthwhile and well constructed. Overall great game just for single-player, and I haven't even tried the multiplayer yet.",
            "review_score": "1"
        },
        {
            "review_text": "The politics is where this game is at. The RTS elements are pretty weak, it's mostly a case of having more guys than your opponent and if that's not the case you better be a good dragon. Using the Dragon a lot makes it more of a bullet hell game especially in the bigger battles, but as I said the replayability of this really comes from the choices you make and the nations you choose to appeal to, the exaggerated characters and the dialogue is worth diving back into this game for just to see how your council will react if you side with someone else this time.  It's simple, but it's a worthwhile experience.",
            "review_score": "1"
        },
        {
            "review_text": "nifty game. highly recommend if you liked divinity 2.",
            "review_score": "1"
        },
        {
            "review_text": "Had a 0% chance of victory, still won. 10/10 would feel like a movie hero again.",
            "review_score": "1"
        },
        {
            "review_text": "'Let me tell you right off the bat, ♥♥♥♥♥♥♥...' Not everyone likes you, half breed, you will have to prove yourself as commander.   rofl, how can you not like this game? The dialogue is colorful and amusing and the characters are loveable; the added layers of depth to them really go a long way for immersion. What will my crew say next, will Henry ever be comrades with 'syphilis incarnate' Edmund? Meanwhile, Catherine is furious about gender inequality on board your ship and Oberon won't stop being an annoying little bish elf.   There are plenty of diplomatic choices your Councillors will seek your advice, same for your Generals. Your choice will have an entertaining impact to say the least.  What I didn't like much was the combat. The RTS combat itself is so disappointing after a handful of times I ended up using auto-resolve. The units are ok but the enemy AI is pathetic that going into Dragon mode does not even save the day. Don't even bother.  I love the overall game experience, especially, the macro, diplomacy, and character interactions - really pulls you in. I actually got this free for KickStarting 'Divinity: Original Sin'. Definite recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "This game contains a unique blend of Risk-like gameplay, RTS and RPG gameplay. Larian Studios has done a immensely spectacular job of creating this game and not screwing it up! So, if you are looking for something new or a completely different game to play, I highly recommend this game for it's storyline, soundtrack and the fun of leading your troops into battle as a dragon! Some things to take note is that some of the areas of the game are not in depth and feels rather simplified. An example would be the decision making, it's either a Yes or a No, but not all decisions are clearly cut out some are in the grey area etc.",
            "review_score": "1"
        },
        {
            "review_text": "My wife turned into Judge Dredd.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is very much a game of two sides. Unfortunutely, one side is pretty awful.   The game is divided into the story driven, non combat based and relationship building aspect; and then the RTS combat and risk map like world view.   I have to say, I honestly really like the non combat stuff. The characters are fun, they are a poke at the stereotypes of today whilst offering a little bit of comedic social commentry. The characters are great, the dilemas you get are great and they even have a point to them, as each desicsion you make has consequences for resource aquirement, combat and other things.  Where it falls flat on its face is the RTS combat. By christ it sucks. Its entire concept is basically built around zerg rushing and turtling your forces. very little stratigic combat involved here. Yeah, being a dragon is kinda a cool twist but it takes away from being an RTS and it turns it into a click fest action game. Tries to do too much, whilst also doing almost nothing. Saddening really. On the plus side, once you get your generals you can shelve off battles to them. Though, you can only use any general once per turn, as in once you use a general on any battle that turn you may use no other generals. Why? I dont understand.  All in all, I would only recommend it to players who can really get immersed into the non combat stuff. If you are looking for an incredible RTS experience, you will not find it here. However, personally I think the non combat aspects outway the combat.",
            "review_score": "1"
        },
        {
            "review_text": "You play the role of not but a mere comander, but one of a dragon that rules an empire. Game play is good, story considerable. though it hast its ups and downs, still a hell of a game.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and enjoyable game, full of allusions to modern political issues. each race represents a political group in modern society. Undead - Pious believers, Elves - Environmental Nature lovers, Dwarves - Capitalist entrepeneurs, Lizards - Rational but SJW people in favor of a republic, Gnomes - Crazy scientists. The campaign is invigorating and the compromises you have to make to maintain power are unsettling. Overall good game",
            "review_score": "1"
        },
        {
            "review_text": "This game mixes many different game types into one epic package. It has three main game types, A risk-like board game, an RTS/third person shooter game, and a political simulator.   The battle board will be familiar to anyone who has played risk. The player moves units turn based and can choose to join a battle to aid the troops. This part is well executed and integrates well with the ability to upgrade and research new units.  When in a battle the RTS gameplay takes over. The controls take a little getting used to in the rts mode. The ability to transform into a dragon and change the tide of the battle is what really sets this game apart. It is so unique and refreshing and it give a whole new responsibility for the player to use skills.  The political simulator is decent. It is lacking in some depth, but what it is lacking is easily made up in the rest of the game. The choices are yes and no and are somewhat predictable. However juggling the outcomes and viewpoints of the races was very fun in my opinion.  If you follow the story line, it is easy to stay interested. The gameplay can get a little repetitive though. Luckily there are things that can keep it interesting such as the strategy cards.   Overall I would give this game an 8/10 because it is so unique and refreshing to use your brain to follow the different possible outcomes.",
            "review_score": "1"
        },
        {
            "review_text": "This is literally the best RTS I have ever played just take your average basic RTS and press R to turn into a dragon and take matters into your own hands it combines the flash RTS game ultimate war orcs dwarves fighting along with FABLE 3 after you become king and make diplomatic decisions about your country.....but all seriousness turn into a dragon BA. ",
            "review_score": "1"
        },
        {
            "review_text": "Buy it for 10€ and you re covered for sweet gametime and alotta bang for a buck. The RTS part is clunky and selfrepeating but the 'worldwar map' and making choices for kingdom are really fun!",
            "review_score": "1"
        },
        {
            "review_text": "5.5/10. 6/10 at its best  The RTS is very, very average. The role-playing is a lot of fun. Many of the characters are poorly developed and their relationships spawn seemingly out of thin air. There is no 'choice' other than 'yes-or-no'. After a while I felt like just beating the game, as in at around act 3 it stopped being fun and became more of a chore. Very big problems with it.  But despite this, it is fun in that it is unique, the steam-punk style is very interesting and there is a lot to do. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is not the best at doing RTS battles. It's not the worst either. But what you really play it for is the interesting interations your politicking has on the overmap. It really makes you quesiton what your personal beliefs are. It provides a really gratifying experiance. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "It seems to me that what shines the most in this game is the story aspect of it more than the actual gameplay.  If you like your strategy games with a lot of flavor, then this game might be for you. Otherwise, I'd recommend you look somewhere else.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious political diplomacy, vibrant characters, solid turn-based strategy, and fast-pased RTS? Absolutely fantastic!   My only complaint is that the RTS portion of the game is a little weak. This really doesn't affect the single-player experience at all, but it hurts the multiplayer quite a bit. If you're primarily looking for a competitive RTS game, you could probably do better.  If, on the other hand, you're looking for a good single-player strategy game with an engaging story and gripping characters, then this is an excellent deal.",
            "review_score": "1"
        },
        {
            "review_text": "If you were to describe this game with the 'A meets B' method, the list would get incredibly long; there is a fair chance you'd run out of letters. It draws inspiration from many genres and mixes them into a remarkably sapid blend. Strategy map with Risk-like figurines representing units, managing the empire's internal affairs with a bunch of crazy councillors, commanding and conquering on a real-time tactical map, smiting foes as a dragon in third-person combat, playing cards which give you advantage or undermine the enemies' efforts, all seasoned with marvelous music and splendid steampunk setting... Yet nothing feels out of place nor included forcibly. And in just how many games you can play as a dragon with a jetpack?",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so...a Dragon that has a jet pack that breaks the sound barrier in less than a second. That should be enough for a person to purchase this game. Oh it also helps that this game is brilliantly written, wonderfully voice acted also helps. Deal with political issues that we are trying to figure out in this fantasy wrold such as; Gay marragie, and government halthcare and much, much more. Add some RTS elements (even though it feels a bit repeatative) and you got your self a fun game that should have been given more attention that it did. I would give it a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever mixed bunch of sodas together in an attempt to make something unique and good tasting? For strategy games thats what Divinty: Dragon Commander is. It's quite ambitious in how it brings together concepts that you've probably seen in other games, separately. It takes some of Risk, some Starcraft 2, some Mass Effect and adds a jetpack wearing dragon to the mix to make a memorable gem that balances out serious and comedic moments as you go from blasting enemies on the battlefield to discussing whether or to legalize a certain plant for medical purposes, this and many other political issues in the game are downright parodies of the issues in present day politics, almost making the game an unintentional period piece of our current day and age. The RTS portion can be a little lackluster, but the ability to jump in in the form of a jetpack wearing dragon to fight alongside our forces to tip the scales makes it cooler, and for those who dont want to deal with that and enjoy the admittedly more fun empire running segments it can be auto resolved in a manner similar to the Total War series, with your chances of victory being boosted by paying your general and your various cards.   At the end of the day it is a jack of all trades, master of none but the gestalt ends up being greater than the sum of the parts making th experience memorable and makes you want to play the campaign again and again to see how differently things can go and to interact with the very amusing characters in the empire running segments. For strategy fans its worth a buy, for those new to the genre it would be a good gateway to some of the bigger franchises.",
            "review_score": "1"
        },
        {
            "review_text": "I'm totally ignoring the RTS portions of the game and autocalculating combats, and despite not even playing these Dragon w/ Jetpack sections, which is easily 1/3 of the game, it is still filled with win for the political rpg and risk like strategic portions.",
            "review_score": "1"
        },
        {
            "review_text": "must play",
            "review_score": "1"
        },
        {
            "review_text": "I found the 'Overworld' gameplay fun; Management of armies and map control is fairly similar to the Total-War series and the politics and character interactions were somewhat interesting.  The backstory was alright; a little quirky and mildly amusing as most stories by Larian Studios tend to be. The RTS portion of the game was a bit lacking and felt a bit non-sensical overall, though I'm no RTS expert so I won't delve too deep into that. Apart from a few practice attempts in the RTS mode, I played through the entirety of the game in the 'Overworld' mode which is thankfully possible, atleast on the lower-middle difficulties.  5/10 Recommended because I like Larian and am somewhat familiar with their games, would suggest purchasing on sale if you're not a huge fan of the genre or unfamiliar with the company.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addictive game, Really recommend for strategy fans",
            "review_score": "1"
        },
        {
            "review_text": "be the dragon :3",
            "review_score": "1"
        },
        {
            "review_text": "If you want to live in a perfect world, you will try to make the Undead Happy.  The Gods will smile upon your battles while you purge women rights, and gay marriage. Making deals with Demons, and sacrificing your wife for more power!  Unless your a pussified elf, well ♥♥♥♥ you. You'll lose in the end either way.  8/10 I actually enjoyed a game.",
            "review_score": "1"
        },
        {
            "review_text": "Went in expecting a solid strategy game with steampunk and fantasy elements  I got so much more.  I went from playing more for more battles to wanting to finish the battles faster just so I could have more story! This game has some of the most diverse and loveable characters in any game I've ever played.  Highly recommend it to anyone who likes good rts games and a compelling story.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite the unique game, a part risk strategy, another part RTS, a part FPS as a dragon flying around in your RTS battle burning up your enemies, all wrapped up in a single player storyline or pure multi-player mayhem without the story.  It is a tricky recommend since it does have all these different facets to it, you honestly need to like all these aspects to fully enjoy the game.",
            "review_score": "1"
        },
        {
            "review_text": "I found the 'Overworld' gameplay fun; Management of armies and map control is fairly similar to the Total-War series and the politics and character interactions were somewhat interesting.  The backstory was alright; a little quirky and mildly amusing as most stories by Larian Studios tend to be. The RTS portion of the game was a bit lacking and felt a bit non-sensical overall, though I'm no RTS expert so I won't delve too deep into that. Apart from a few practice attempts in the RTS mode, I played through the entirety of the game in the 'Overworld' mode which is thankfully possible, atleast on the lower-middle difficulties.  5/10 Recommended because I like Larian and am somewhat familiar with their games, would suggest purchasing on sale if you're not a huge fan of the genre or unfamiliar with the company.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game but some of the voice actors and about half of the RTS portion were bad IMO. I recommend it for the story. The gameplay is good till you get intot he RTS portion where it failed to meet my expectation.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like a lot of people are going to give it a pass just because of it's absolutely ♥♥♥♥ing atrocious name but the game is actually pretty good. If you can forgive some occasionally broken RTS controls, the RPG/Civ side of the game is one of the most compelling features in a game I've ever played. Maybe wait until Divinity: Dragon Commander drops to a ridiculously low price; but check it out!",
            "review_score": "1"
        },
        {
            "review_text": "It's an fairly simple RTS that has political decisions you can make that help affect the realm outside of combat, research to upgrade your dragon or army, etc. Also, you play as a dragon. With a jetpack. And can jump into the RTS battle at virtually any time to shoot fireballs. 'Nough said.",
            "review_score": "1"
        },
        {
            "review_text": "Following on from the excellent RPG 'Ego Draconis' (get it if you haven't), this is a change of direction for the Divinity bulldozer, and probably a disappointment for anyone (like me) who enjoyed the RPGs. Takes a bit of reorientation to pick this one up, and if set to easy/casual mode it's just a walkover. Some difficulties with certain mice using the centre button/wheel as this just doesn't click in. Otherwise an interesting strategy game, whose continuing appeal is in the voice-overs. A great many games like this out there, and while this is a good game, hard to see it has anything above any of the rest. And there really are a lot of them if you look!",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game where your decisions truly matter. It combes both politics and a basic RTS System and makes for a fun experience! The music, the writing and the voice acting are fantastic! And while the graphics might be a bit dated the art style is also very good!",
            "review_score": "1"
        },
        {
            "review_text": "As pumped as I was to get this game, I can't help but feel like I should have done more research. This game looks incredible at a glance, combining real time strategy with third person shooting action with a dragon (not enough games let play as dragons like that IMO) and all this complimented by the political decisions you have to make between each match. So much to do, and yet none of it is as deep or thought provoking as you may think.  On the plus side of things, the graphics and the voice and conversations of this game are pretty good. While some of the unit designs seem uninspired, all the characters aboard the Raven (the hub you go to between turns) all have intersting designs. Futhermore, these characters you converse with have their own distinct personalities and are generally enjoyable to listen too. The political banters these guys get into often reflects current real world problems, and getting to have your say in them can be fun. However, the decisions you make are always either 'yes' or 'no'. This may work for some things, but other times I didn't like the all or nothing approach this game presented to me. Overall though, this was still my favorite part, as it was fun to see their reactions.   Unfortunately what you may consider to be the main part of the game, the RTS and turn based map sections are lacking. On the map, too much comes down to sheer luck. Whether it's what cards you get, which you can use to boost your advantage or cripple an enemy in some fashion, or just moving into the wrong place at the wrong time, there is just too much that can change in one turn. Sure many strategy games are like this, but in this one it feels more like luck instead of skill. In battle, the real time strategy elements are hardly even there. It is difficult or sometimes even impossible to try to micro, and the macro only consists of taking over building plots and building one of a very limited number of buildings (only five different ones all things considered) and keeping them from being taken over. It just feels like a tug-of-war. The only fun thing is playing as the dragon, although I found that to be repetitive after a while as it was so much easier to sabatoge the enemy's attempts at expanding than it was to fight with my units as the designers probably hoped you would.  Overall, this isn't a terrible game. Though it has some good points, they aren't enough to overcome the badones. I would certainly not recommend this at full price. Even at 50% off, you may not get your money's worth, as much of the value of this game comes from playing it repeatedly and making different political decisions, but it's hard to go through all of those conversations a second time. This game is worth a look ONLY if you are looking for a strategy game that tries some things different. Otherwise, there isn't much here to warrant your attention.",
            "review_score": "-1"
        },
        {
            "review_text": "Not at all what I expected, I read many posts where people explained that in co-op one player would play as the ground troops and the other player would play as the dragon... this is simply not true and thus extremely disappointing for our gaming group. Sorry if bad rumors killed this one for us, but it did.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased this game on sale for 6 dollars, but even so I cannot recommend it. I feel like this game doesn't know what it wants to be.  The voice acting is great and really makes you think you're in a well written rpg. The strategy element is somewhat lacking, and the battles are quite similar from the early game even into the final stages of the game. Dragon Commander tried to tie in both RTS and RPG elements, but in doing so fell short of being a good RTS or a good RPG.   For $40 this game should have been better. You can beat the main campaign in about 7 hours and feel no need to go back to it at all. I purchased it for $6 and still don't recommend it. I know that sounds harsh, but this game really let me down.  Also. - The game will crash on you in battles. In order to fix this you must lower your settings to minimum even if your graphics card can run the game on max settings. Also, you must download the 2 files listed ont he dev's discussion post. If you do these two things the game runs fine. I just don't like that I have a modern gaming PC and I need to do all of this extra stuff just to get the game to work.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Usually i write long and detailed reviews in games, but this time i will make an exception.  There is just one thing i want to say.  Control system in battle is awful. I mean not just awful, it is one of the worst i've ever seen in a game in my entire life.  I enjoyed much the Divinity series and played them all (except Beyond Divinity, that's just miserable), but anyway i really wanted to play this chapter even if i'm not really an RTS player, but with this control system, no way.  Sorry Larian, for me this time it's a thumb down. You can't mix the cotnrols of a shooter with an RTS play style like you did and pretend it works. It just doesn't.",
            "review_score": "-1"
        },
        {
            "review_text": "Had loads of technical issues before I could even start the game, but when I got in I found a pretty bog standard rts with a light spinkling of grand stategy that boils down to nothing more than arbitrarily picking diplomatic options and covering the map with units.",
            "review_score": "-1"
        },
        {
            "review_text": "this was supposed to be a total war-like game with an rpg twist but went quite wrong.  the only pros here are graphics and the general idea of commending your troops as a dragon while fighting the enemies.  cons the strategy map is way too simple, there's no building or social managment involved at all and units management is clunky and rather uninteresting, there's is a card system which should bring you advantages/disadvantages but they reveal to be quite unrelevant especially later in the game. the rts part resembles the strategy one, very simple, no different factions to choose from, very low unit type count, just a few maps to play on, you'll end up basically repeating the same battle over and over again. dragon controls and ui design it's ok but it's almost impossible to avoid anemy attacks. the rpg section it's useless. they used it to bring on the story, the characters are good but there's no point in interacting with them; they'll ask you to decide on various aspect of your empire's politics (stuff like gay marriage, criminal deportation, military politc etc...) which will earn you their favour or their antipaty, but with minimal impact on the game itself.  so it's a game with potential but it's too simple to be interesting to play",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to recommend this game, really did, but I can't just give it a blanket recommendation, though for certain people out there this might be the game for them, but it's not for everyone.  The game is a mix of Strategy, RTS and Dragon flight/combat and I'm not sure that any one part is that great. All of the are good/okay, but if you are looking for a good RTS there are better, if you want a good strategy(4x) game there are again other options. And the Dragon flight/combat isn't all that great either, still satisfying, but it got stale somewhat quickly for me.  I'm going to focus on the single player because after finishing it I didn't really have the desire to try multiplayer, as some minor spoilers ahead.  For me there was just a lot of annoyances that just didn't make it as enjoyable as I was hoping it was going to be. For starters the difficulty caught me by surprise. When I first started playing I tried it on normal, this was a mistake for me. I'm not a good RTS/4x TBS player at the best of times and the way this game starts (enemy has a ton of territory and units, you have nothing) did not help matters. After getting my ♥♥♥ handed to me I gave it another shot on a lower setting (Casual makes the Dragon flying/combat part of the game incredibly satisfying).  As an extension to the last point, starting the game at a big deficit isn't a bad idea and can work but the biggest problem for me was that it happens 3 times. You start the story at a deficit and then get huge only to finish the first map/story arc and move into the second phase and start from nothing again against an enemy that holds a ton of units/territory. It was silly enough to happen one time BUT THEN it happens AGAIN after the second map/story arc. The third time you start with a few more territories/unit, but again you are at a huge deficit, it's okay that the game starts out that way, but to do it two more times feels lazy.  Another thing was that I got hit with more than a few crashes. But the biggest one for me was that I had finished the second arc of the game/story(With frequent saves along the way), started out the third arc and then saved/quit for the night. When I hit the continue button, it was like I had never did any of it, all my saves gone. I tried all the saves and found one auto save that thankfully brought me back to my most recent progress.  Lastly, in the story arc you are given series of moral choices by your council. While I enjoyed them for the most part, they didn't exactly add anything for me. Maybe in the harder difficulties a -3 gold/+2% luck would mean a lot but for the lower difficulties it didn't really matter. So I could easily juggle the choices and ended with all 5 factions at around 90% or above favorable making the choices feel more about math than the morals involved. I would have liked to see the choices mean more, even at lower difficulties, maybe with revolts in territories or additional units joining or something, but for me I just seen it as a background thing and added a light fun/humorous touch to the campaign. Also the Wife choosing thing felt unfinished. Picked wife, had two or three conversations and nothing ever happened after that, no side quests, no challenges she put forth, just hung out in her room and said had another boring/straight forward case before her. The generals were a nice though and added some flavor to the story, but for the most part on the lower difficulties I ignored them entirely, why would I want them commanding the army when I get to fly around as a Dragon? Or why give up gold when I can click on the Imperial Army tab to auto finish the battle when it's at 100% or close to 100%?  I think the game is an all-around good game, but if I give it my own recommendation I'd say no, because I didn't have much fun playing it. It started out quite fun, but reusing the same mechanic and other frustrations kind of took their toll on the fun I was having.",
            "review_score": "-1"
        },
        {
            "review_text": "Cons ~RTS aspect completely blows. ~Combat graphics blow. ~Campaign is short without much replayability.  Pros ~Political decision making is interesting. They need about triple the ammount of them tho, with a non campaign mode where you can make RNG selected politcal choices.  As is the game is not nearly worth the pricetag. ",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "A compilation of a bunch of games, all of which are fine, but none of which are great.. and are all made weaker by their proximity to each other. Lame setting.",
            "review_score": "-1"
        },
        {
            "review_text": "This game ranks up there with as one of the most disapointing ive played. Its stupidly hard, ie your units cannot beat the same unit of the enemies. You are pretty much always outnumbered in battle, and to top it off playing as the dragon isnt really that much fun; it is far too arcadey and makes Ace Combat look realistic. I WANT to like this game, I was so excited to finally have a game that you play a dragon in, but this game is not it.",
            "review_score": "-1"
        },
        {
            "review_text": "Massively annoying game.  On the strategic level, the enemy starts off in control of all territories and, despite the story of many conflicting siblings, as a unified oponent. Enemy has the resources to throw overwhelming numbers of troops into the fight each turn right from the start of the game.  On the tactical level, when manually managing a fight, the enemy is almost perfectly efficient. The AI is able to direct many groups of units simultaneously to accomplish different objectives, while at the same time managing troop construction and resources across the map. The player, on the other hand, can only be in one place at a time, doing one thing at a time, and attempting to keep up with the AI in terms of capturing buildings and resources is impossible, by the time you have selected a unit, moved the camera across the map to the first thing you want to capture, moved the camera back and selected another unit, the enemy has placed troops on three sites.  The only possible way to win a battle at any level is to steamroll the AI with vast numbers and/or overwhelmingly superior units. Unfortunately, the AI starts off the game better equipped to do this than the player.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a poor, confusing, awkward game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "A ppor addition to the Divinity franchise...I expected much more",
            "review_score": "-1"
        },
        {
            "review_text": "its a complete random unbalanced game it was a waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "This game attempts to fuse three different styles of gameplay (RTS, TPS, Strategy) and they do a terrible job of every single one of those. The game also throws you into battle with hardly any advice or instruction on how to play, not to mention the overwhelming amount of micro and macro management right from the get-go. I don't often write reviews, and they're usually about four words. This game, however, did the especially terrible job.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game for $2 thinking it was at least worth a try after watching some videos on youtube about it, as it seemed very good. I can say that it sets the story very well, and I found the characters interesting (though for some it might not be). However, as a new player to Dragon Commander, I found it very hard to play with almost to nothing tutorials. The only tutorials they really have is a pop-up screen (for the conquest part) and videos for the RTS component.  For those looking for a similar RTS style I would say that it would be close to Dawn of War, except you are limited to the number of buildings you have. But by far the worst part of this game is it's tutorial for the RTS. All they did was put a video in, watch the video (you had to click on it instead of it coming up before the battle) and send you on your way. The videos didn't even explain much. There wasn't even like an easy RTS mission to set you up so that you can get familiar with the style, it just throws you right in. Also I have no idea how the cards work.  It's a shame that I am not interested in playing this game anymore because some elements of it seem really well put but they just went lazy on some parts that wouldn't exactly help a new player to the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Its bad. really bad.",
            "review_score": "-1"
        },
        {
            "review_text": "got it on 66% off i still feel ripped off forced charecter development",
            "review_score": "-1"
        },
        {
            "review_text": "I would not recommend this game for anyone who has a basic understanding of sociopolitical issues or that are easy to offend. The choices a player must make in this game during the 'Adviser' cut scenes are way out of line in my opinion. One has to wonder what the developers were trying to accomplish by putting in dialogue that attempts to bring awareness to particular 'classes' of people. There was no need to do so, and in my opinion it ruined this game. If Valve would allow me to remove it from my game inventory I would. Maybe I can convince them to let me pay for the privilege....",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, but it doesn't work without crashing (mostly on multiplayer)",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting, creative characters, good interaction with npcs, and abysmal rts gameplay. Get it if you like the Divinity series and writing, but avoid it like the plague if you want a good RTS.",
            "review_score": "-1"
        },
        {
            "review_text": "the controls in battle are awfull.",
            "review_score": "-1"
        },
        {
            "review_text": "Everyone hates you but follows you regardless. Tactical map made me laugh, doesn't tell you what to do, then tells you 'oh, you know you could have done stuff right?' when you end your turn. Then comes the combat..... Well.... just mash out troops and send them to their doom, which also seems to be the AI tactics too... Overall, the 38 minutes i spent playing this game were wasted and I can never get them back. So much potential, so much dissapointment.",
            "review_score": "-1"
        }
    ]
}