{
    "app_id": 244430,
    "name": "realMyst: Masterpiece Edition",
    "release_date": "2014-02-05",
    "developer": [
        "Cyan Worlds"
    ],
    "publisher": [
        "Cyan Worlds "
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Puzzle",
        "Exploration"
    ],
    "achievements": 34,
    "positive_ratings": 521,
    "negative_ratings": 102,
    "price": 12.99,
    "description": "realMyst: Masterpiece Edition is a beautifully updated version of realMYST for today’s Mac and Windows computers - celebrating the 20th anniversary of Myst! The models and textures have been reconstructed to provide an amazing graphical experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/244430/header.jpg?t=1529442592",
    "minimum_requirements": "OS: Windows XP, Windows 7 or Windows 8 Processor: Intel Core 2 Duo 2.2 GHz; Athlon x2 2.0 GHz Memory: 4 GB RAM Graphics: 512 MB DirectX 9.0c SM 3.0 compliant video card Storage: 3 GB available space Sound Card: DirectX compatible sound card with latest drivers",
    "recommended_requirements": "OS: Windows 7 or Windows 8 Processor: Intel Core i7, 2.66 GHz Memory: 8 GB RAM Graphics: 1 GB DirectX 9.0c SM 4.0 compliant video card Sound Card: DirectX compatible sound card with latest drivers",
    "reviews": [
        {
            "review_text": "Vanilla Myst had two major issues, and with this game one of them has been fixed. The first issue is the nature of the puzzles themselves. Although they are deliciously challenging at times, there is quite a bit of 'find solution, write down solution, walk across map, apply solution'. This will never be fixed, but it certainly doesn't make the game anything less than spectacular.  The other issue, and by far the most severe issue, was how old the damn game was. Assuming you could even get it to start, you had to find a legacy version of Quicktime and were playing the game in 320x240 which some monitors don't even support anymore. A side effect of it's age was the graphics quality being garbage. Usually I can overlook graphics in a well-crafted game, but when a game relies so heavily on immersion and observation, and is prerendered with zero fluidity of movement, having visuals as poor as Myst's simply detracts from the overall experience.  It is for these two reasons that I had trouble getting people into the Myst series. Riven, which is quite possibly the greatest game of all time, relies on players having experienced Myst's universe and story. So you were left with two choices: Wrestle Myst into submission and persuade yourself to beat it, where the only redeeming factor at this point is it's imperfect puzzles, or play the also-ugly and also-buggy realMyst.  With the release of realMyst Masterpiece, I can finally say that Myst is fixed. While the graphics aren't quite perfect, and there are still a few cosmetic bugs, and the puzzles are the same puzzles as ever, I feel like this game actually deserves to be Riven's prequel.  In short, there is no longer any reason why you should not play through realMyst Masterpiece and then play Riven.",
            "review_score": "1"
        },
        {
            "review_text": "As a kid (we're talking around 5 or 6) I remember playing the original Myst for Windows 3.1/95 and being two things:  1. I was terrified that at any second I was going to be attacked by some unknown foe.  2. I was absolutely enthralled with how good the game was.  Now, I didn't beat the game until I was probably 9 or 10 because it was difficult at that age, but ever since then I've revisited it from time to time. I've played the original, Masterpiece Edition, and now realMyst: ME. I love that it now runs properly on Windows 8 and it fills my screen. As others have said I was surprised at how choppy the graphics are, but I'd say they've done a very good job updating the original graphics while still very much feeling like Myst. I wish they could have remastered the sound a bit better, as that alone was one of the best parts of Myst.  All in all, I'm happy I bought it, but then I've played every game in the series. If you weren't a huge fan of the original, then it's probably not for you, but if you somehow have never played Myst, this is a must-buy, as you can't call yourself a gamer if you've never played (and beaten it without guides!) Myst.",
            "review_score": "1"
        },
        {
            "review_text": "realMyst ME is a real huge improvement from the original Myst which is by far the best game of the 90s'. Indeed, it has been almost 20 years, I still have the original CDROM and also the user manual of Myst! You can find all the puzzles from Myst in realMyst ME but with state-of-the-arts graphics in 3D compared to the orginal 2D 8bits colors under 640x480 resolution!",
            "review_score": "1"
        },
        {
            "review_text": "If you were a fan of the original or a new comer, the latest patches have made realMyst: Masterpiece Edition a gem to play again. One thing to note as of 6/14 the achievements still do not work from what I can tell. Developer Cyan has stated that they are still in testing and will update further whe they are ready for general public. The game has classic point and click controls as well as wasd/mouse first person controls. I personally used the classic controls and instead of shifting panes like it used to do many years ago, now you get a nice walking simulation to the next area of interest. This walk movement simulation can also be scaled faster or slower. In classic Myst fashion the game is extremely hard with puzzles that stretch across the environments. You have to use memory, sounds, and quickness to complete many puzzles in this fantastic setting. If you are looking for a new challenge or haven't visited the original myst since the 90's you will be in for a treat with some of the toughest puzzles in any adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "I had never played Myst before so I had no idea what I was getting into.  At first I was furious. The puzzles aren't insanely hard in and of themselves; but rather: No one tells you 1) that you are looking for something, 2) how to operate that something and 3) whether what you just did had any effect at all. Especially that lack of positive and negative feedback drove me nuts and - even though it got better later on - I could not have played the game without the hint system.  But the atmosphere and story really appealed to me in the strongest sense. I loved exploring the worlds and I am glad I was stubborn enough to play this all the way through.",
            "review_score": "1"
        },
        {
            "review_text": "RealMyst is an interesting beast; it exists partly as a proof of concept for later 3d Myst games, while also slightly furthering the details and connections between the earlier games. The traditional world building is all there, with the added flexibility of more recent full 3d games. It's perhaps the most accessible way to experience a classic game, while improving much of the rigidity of the original.  The new visual improvements also help with replayability, though the atmosphere is still there from the original game the less detailed textures have been replaced by much more realistic ones and more environmental elements have been added to give a sense of immersion that the hyper card and quicktime event original could not achieve.  For those that preferred the original click interaction, the game provides a way to setup the old style navigation. I personally liked free movement after years fo click through mavigation systems.",
            "review_score": "1"
        },
        {
            "review_text": "Myst still manages to hold up as one of the great adventures of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous visual makeover, fantastic environments, engrossing puzzles. Definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "It actually works on modern computers with no hassle.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game. Excelent updated game mechanics while still managing to keep the same feel that I remember from playing as a child. Still so much fun and frustration. I'm looking forward to playing the whole series now too.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game as a kid and loved it. Played it again now and love it even more.",
            "review_score": "1"
        },
        {
            "review_text": "The controls take a little getting used to, but this is a beautiful remake of the classic game. I'm very glad I got it.",
            "review_score": "1"
        },
        {
            "review_text": "it's Myst, Remasted to the height of mid 2000's technology.",
            "review_score": "1"
        },
        {
            "review_text": "This game has been with me my whole life. This edition was really great, although somewhat unoptimized. It should run better on my hardware (both Macbook Pro Retina 15' and pc with amd r9 280x and core i7 with 16 gbs of ram).  I can't wait to play this with the Oculus Rift.. that has GOT to be the best way to experience Myst...",
            "review_score": "1"
        },
        {
            "review_text": "I heard a lot about Myst and reallly wanted to play it, but this game has so many technical issues, I had to stop playing.  The controls are horrible! Being the second remake of the same game, you would expect this to be the least of a problem. The game suffers from mouse acceleration problems and the combination of free mouse (standing) and mouse lock (walking) really takes some getting used to. Also the controls can not be remapped and a XBox controller isn't supported either.  The graphics is good but the screen resolution can not be changed and the game suffers from micro stuttering. What is worse, the FOV can not be changed either. So people with large screens will probably suffer from simulation sickness. At least I did.  All this is not acceptable for a game which was released in 2014. At least controller support should have been added so people can play from a greater distance and don't get sick all the time. As it is, the game is not worth your money.",
            "review_score": "-1"
        },
        {
            "review_text": "amazing game the first game I ever 100 %.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe fix the pressure tree glitch and the mirror box bug in the tower...",
            "review_score": "-1"
        },
        {
            "review_text": "Let's start off by saying that this game is great. It's got great HD textures and Camera mobility. You can use the classic Myst point and click option. Also, you can use the Free Roam mode, just like in realMyst. The game is pretty much the same as far as story mode goes, including adding Rime from realMyst. However, I was slighty disappointed when I had to do only 1 puzzle to unlock Rime and do 2 puzzles in that age. The real question is, 'Should I buy it?'. This is only a good purchase, if you're a big fan of the Myst series or you want to experience a more High Definition look to realMyst. Cyan, Inc. are making a new game called Obduction, which was a Kickstarter game that they sucessfully funded just a few months ago. I'm assuming that all the purchases from this game will be put towards that game. Overall, this game is not really worth the buy. If you want a more high playing performance and great graphics gameplay from realMyst, then I would suggest on buying it to help support Cyan, Inc and add it to your collection of Myst games.",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't play this game because it was too much for me. I got scared and quit and never looked back. The graphics are not as they seem either.",
            "review_score": "-1"
        },
        {
            "review_text": "This was really fun, until I was half way through the game and figured out that an outdated game mechanic is broken, requiring me to replay vast parts of this game.  I would have recommended realMyst if it wasn't for this. IF you have a lot of patience, tho, pick it up! :S",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a joke.  I bought this 'thing', not knowing that it was just a ♥♥♥♥♥ier version of Exile. I thought it would be this cool, patched up reboot of Myst with some great new features to it. God was I wrong.  Little backstory: when I was eleven or so, I had this Myst collection with every single Myst game in it and boy did I play the living crap out of that (even Uru live, like, can you believe?). Especially Exile, never had I seen a game like that in my life. It had nice graphics, beautiful colours and challenging puzzles. So a few weeks ago, I wanted to pick it up again after six/seven years. And of course the CD didn't work, so I decided to buy it on Steam instead for a prize I thought it would be worth.   No. If this is ever on sale for €0,02, it's still a waste of money. You'd better spend it on Tony Hawk's Pro Skater 5.  Here's why: the 'game' is broken and outdated. It's extremely laggy, and I'm pretty sure that's not my computer's fault, as all other games run just fine. This 'game' is ONE enormous lag-glitch-mistake-monstrosity. And then the controls! The person who thought: 'you know what? Wouldn't it be a GREAT idea to make have the mouse control the camera angle AND the actions, but not at the same time? We could just have them left-click to freeze the camera, before they can select things.' DO YOU EVEN UNDERSTAND HOW GAMES WORK? And the interface is so slow and broken that you can't even change the controls because that literally takes 5 years and then the game crashes.  So even if you magically manage to fix all of that, welcome to the vaguest gameplay ever. Oh, and you can barely walk anywhere, so good luck with that.  There's a lot of decisions I regret, but buying this piece of nuclear waste has been the worst mistake of my life.   -1/100000000000000",
            "review_score": "-1"
        },
        {
            "review_text": "The world must be ending....it actually works on Vista. This game is a real treat for those like me, who have traveled all the Ages and read all of the books. The story of Atrus and Catherine and the fall of D'ni is one of the best ever told. Being able to visit the resting place of Ti'ana was a nice surprise but, the addition of one book in the library was the highlight of the game. It makes me feel hopeful...I still have my journals...I still hear D'ni calling.",
            "review_score": "1"
        },
        {
            "review_text": "If the original Myst was a 10, this was a 7. Now don't get me wrong, I enjoyed playing through it and would recomend picking up a copy, but there are some very irritating graphical annoyances which occur in certain worlds.   The videos within the books, alongside some of the sounds dont seem to havebeen updated so if you're running the game on a larger display enjoy your pixelation. I guess it was too difficult to upscale a video that only took up 1/5th of a display that back then ran in a resolution of usually 800x600, so 1/5th of that upscaled... won't probably look very good and it shows unfortunately. While I realize that re-recording the scenes with Atrus and his sons would probably been difficult to have done, It might have really helped the game.  POSSIBLE SPOILERS BELOW, READ AT YOUR OWN RISK OR IF YOU PLAYED THE ORIGINAL!     The main reason why I gave RM:ME a 7 instead of an 8 is probably the stoneship age. When comming back from the lighthouse if you look at where the waters edge meets the edge of the rock that the ship is on, there's some really funky squares missing or overriding other textures. For the most part though the new effects and heavy rain made up for it somewhat, making it harder to notice but still obviously there to anyone who looks to the left.     One gamebreaking bug I found in the mechanical age involved the elevator that also serves as the controls for rotating the entire tower, if you stand halfway between the door to the elevator and the top floor, and push the down button, (NOT THE MIDDLE ONE THAT YOU'RE SUPPOSED TO) the elevator will go ALL the way down, without the ability to bring it back up. If you walk to the controlls on top of the elevator, you will fall down on them. The controlls then become locked and if you attempt to use them the game will teleport you up to where you're supposed to be, without the elevator, so you keep falling back down upon it. Very irritating lost about 30 minutes of progression from having to reload a previous save. Easy to replicate this bug, I did it again just to make sure It wasn't a one time thing and you can definitely do this, even today as I'm writing this review.   Other than these 2 bugs I found the majority of this remake to be pretty much on par with what I was expecting, They didn't remake the game from scratch as far as I can tell and was expecting. They just moved it to a newer system and adjusted some graphics and tweaked a few things. I enjoyed this version of myst but I didn't feel that it was that big of an improvement from the last remake in 2000. I would recomend getting this when It's on sale. As someone who owns the original ps1 copy of myst still, I feel this remake is more of a graphical retexture/update. Even if it's 20 dollars there's some pretty ugly seams in the stoneship age, along with the feeling that the channelwood age is a bit lacking now, it's hard to explain but when you go there it just doesn't really feel like someone lived there. Hard to explain, but if you grab a copy perhaps you'll feel different.   I guess in summary, this remake was somewhat what I expected, although it disappointed me in a couple areas and ruined a bit of the immersion that the original myst worked on building up. Even with the problems I'd still say it was an interesting experience, and worth the 8 dollars I paid for it when it was on sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr version: Highly recommended if you like adventure games and/or puzzles, and if you don't rage on non-major technical issues. --------------------------------  Since I'm mostly used to point-and-click or modern adventure games, Myst was a new experience for me. It's a great concept- the player has to rely on visual and auditory observations to solve some large-scale puzzles, which are all completely logical and range in difficulty from easy to medium-hard (but I've played quite a lot of adventure games and am used to them; newcomers to adventure gaming may find the puzzles harder, but still doable). There is no pixel-hunting and no inventory system, which automatically dispenses with inventory item combination puzzles found in most adventure games.  The developers suggest playing the game as if the players were actually present in the Myst universe, for a fully immersive experience and to better appreciate the story. Therefore I recommend playing Myst when you have quite a bit of spare time and are mentally relaxed. This is not the sort of game you'd want to play to take a break from your hectic activities or in the midst of a busy time to relieve stress. I made that mistake and my general attitude was just to plough through all the puzzles. Nevertheless, even though I didn't pay much attention to the story (or the environmental story-related clues), I found it fairly intriguing.  The environments are simultaneously strange and beautiful, and have certain mystic feel to them (probably why the game is called Myst?). There are not a whole lot of things to interact with, which I think is very good, because that means there's very little noise in terms of puzzle-solving; most of the things the player can interact with are related to some puzzle or the other. The music and soundscapes are soothing and appropriate to the environments, especially in Rime age.  Now for some technical issues- first of all, realMyst: Masterpiece Edition is a remastered edition (graphics/interface overhaul) of realMyst, which itself was a remastered edition of Myst. The masterpiece edition also has a free roam feature. In the previous versions, the player had to click on a place the go there and the field of view was quite limited, which may have been restrictive but was not necessarily a bad thing. However, mouse movement in free roam view is very clunky. There are no subtitles, which makes it hard to listen to the characters' monologues, and there are no options to adjust the music level. The graphics aren't -that- good and the game suffers from poor optimization.  Still, I highly recommend it for adventure gaming or puzzle aficionados who don't mind the above-mentioned issues (plus RMME supports achievements and trading cards, and has additional puzzles to Myst or realMyst).",
            "review_score": "1"
        },
        {
            "review_text": "myst was the first game I ever played and was effectively my first gaming love so excuse me if my view is slightly biased towards amazing.  this remake is stunning and although it has very little difference from the original gameplay wise and has some troubles in areas with lag especially rime although it's graphics make up for this in spades and these problems will likely be fixed in the future. it also has myst 5's free roam system so you don't have to slide along predecided routes this also allowed several easter eggs to be hidden in very sneaky locations but for those who liked the classic point and move system you can swap between them at will.  word of warning you may need a fairly beefy computer to run this at the graphics levels where this remake really shines.  all up an amazing remaster and with real riven in the works it could only get better  if you are a myst fan you will adore this game if not then if you don't want to spend 15+ dollars on this then consider the original myst first it may be old but it is significantly cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "Playing the 2.0 Version of realMyst: The Masterpiece Edition is an even more Relaxing and Atmospheric experience no one should miss out on.  The puzzles are not that much 'hard' as in Riven, but for the most part they're very well designed and executed.  I absolutely recommend to give this one a try!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, beautiful and engaging, it takes a day or two of game play with time off for reflection to get your head around some of the less obvious parts. Nothing rock solid which keeps it fun. The controls are infuriating at times; I suggest only bothering with the free roaming function to get some steam achievements. Said steam achievements are there to make sure you get the most out of real exploration. Have a few save files on the go and a notepad and camera handy to get through it with as few curse words as possible.  If on offer buy Riven as well as you might get withdrawal after you finish this game.",
            "review_score": "1"
        },
        {
            "review_text": "From the moment I first bought Myst I was hooked, and have managed to buy almost every one of the DVDs, so I am an obvious fan - lol. After playing this particular game for four hours, I can only say that I am thoroughly enjoying it. I have the original Myst Masterpiece from way way back when it first came out, and it is too old to work on my latest pc. This version is really an improvement on the original Myst :))) It works great on my Acer Win8 64bit. What is especially nice about this updated version, are the night and day sequences with added sky features. The torch is very handy to look around in dark places. For those who like to explore, I totally recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Classics in a modern performance",
            "review_score": "1"
        },
        {
            "review_text": "An incredible game  Pros: Great puzzles Wonderful Graphics Mind Numbing confusion  Cons: Not much replayability",
            "review_score": "1"
        },
        {
            "review_text": "My most fav game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "I remeber watching my brother and my dad play this game as a little kid, and its now awesome to actually get a turn on the computer to play as a late teenager. But wonderful game, brings back a lot of memories. Quality amazing... probably better than the 1994 edition.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the most beautiful and amazing iteration of Myst to date. If for some bizzare reason you haven't played Myst, now's a good a time as ever to pick it and play it.  Seriously, play this game. It will change your life and give it new meaning.",
            "review_score": "1"
        },
        {
            "review_text": "While I do not dislike this game, the experience playing realMyst just doesn't quite compare to the original game. Somehow the world feels smaller and simplied. Where a room or an area used to be filled with small details you could look at and wonder over, the same room in this version may feel very sparce, containing the main set pieces but lacking much of the personality. There are some areas where this game is neat, but overall I prefer the original.",
            "review_score": "-1"
        },
        {
            "review_text": "Update the review to a thumbs up with the new version 2 and the better controls. It took a really long time but it's finally here.",
            "review_score": "1"
        },
        {
            "review_text": "This game brought back a whole lot of nostalgia for me. My dad used to play it back when I was a kid and when I asked him to play, I got no where. Definately not a kid game; not because it is graphic, which it is not at all, but because of the percise logic that this game demands from you. However, I resorted to watching my dad play it hours on end. The mysterious storyline and the music is captivating. I've been looking for it all over since I'm a lot older and I own a Mac (it used to only be on PCs). I just beat the game, but if it wasn't for the hints, I'd still be banging my head on my desk. What I appreciated is that they put hints/clues that did not give you direct answers unless you really wanted them. They gave you clues or thoughts to help trigger solutions to problems you might be facing.   You start off this game by entering this Age called Myst and you just have to explore since you don't know how or why you got there. If you liked Amnesia, which starts the same way and also requires you to explore to find clues and requires reading, this is a great game. However, it is NOT as dark as Amnesia. It is more Sci-Fy then Horror and there are no monsters jumping out at you. But this game can be very eerie, simply because you are alone. There's no other physical beings around you, just their stories that have been left behind. It also requires you to figure out who and what to trust based on your judgment. There's 4 possible endings to the game.   If you like strategy or findings clues and putting one and two together, get this game. Some of the visuals changed from the original PC, but it was still satisfying for me. There's so much thought and logic put into the puzzles in this game, which can make it VERY challenging.   Will forever recommend.",
            "review_score": "1"
        },
        {
            "review_text": " Update June 2015:  Over a year has passed since my initial review, which in hindsight I realize was pretty harsh. As a 3D artist who was inspired by Myst to work in the games industry, I have high expectations of Cyan. While I was grateful for an update of Myst, I mainly focused on the negatives, intending for the heavy critique to stand in contrast as tough love.  When news came to me that the game had been updated, I reinstalled because I believed RMME deserved another shot. It is difficult to express what a massive difference the latest update made for me, but I will try to express it in few words.   The spark is back.   Upon loading up the game and wandering the various Ages, all I could focus on was what felt  right . The controls felt right (especially Free Roam). Day and night felt right. I am charmed by the chunky new rock formations and lovely handcrafted textures on almost every surface. Visually, every Age feels far more cohesive, which goes a long way to selling the whole. These are real places.  It's an entirely different game and I'm excited to revisit it again,  hopefully  with some VR goodness down the line. I have changed my review to now recommend the game. Thank you, Cyan. --   March 3, 2014 Review:  I purchased the new realMyst on Steam for the sole purpose of having a copy of Myst that will actually run on modern hardware. Revisiting Myst is a tradition for me. The feeling of 'standing' on Myst Island is akin to building a warm fire in my brain. It is a deep, nostalgic trip to my childhood; dreamlike, mesmerizing, and incredibly familiar. I return to Myst to remind myself of who I was when I was younger, and reflect on the person I am now. I was optimistic when purchasing the new Unity-based realMyst, despite some disappointing pre-release screenshots. Unfortunately, my fears were well-founded.  realMyst: Masterpiece Edition (RMME) suffers from dramatic inconsistency. It is often sloppy and unoptimized, but can be, at times, staggeringly beautiful.  I feel the consistency in art direction which made the original realMyst [which also suffered from poor optimization] look good for its time was lost to accommodate for shaders and surface normals in the Unity engine. I suspect most of the normal maps from the game were generated from the original diffuse textures in CrazyBump, and not much care was put into the nooks and crannies to make things look right. The original Myst gave attention to every detail, with every bolt and screw painstakingly rendered. RMME is plagued with glaring texture seams and poor texel density distribution across the various Ages. Things are not made to look lived in, but are clean with poorly tiled textures. Comparing the foliage on Myst Island to Channelwood, I can't help but think how some level-of-detail work could have really paid off while showcasing some of Unity's best features, or would have at least made these choices less apparent.  When the game gets dark, it gets  really  dark. I imagine the flashlight was included to combat this, but it only serves as a painful reminder that the artists neglected to put proper spec maps on models. Everything I shine the flashlight on turns a blinding white, even with bloom disabled.*  The control scheme has also taken a misstep from the original realMyst. In Free-Roam mode, you are unable to stand in one place and look around without holding right-click, and the cursor reacts awkwardly as you look around. Moving up and down ladders is a chore, and having to rely on my meta-game first-person camera instincts to navigate breaks all immersion the game tries to render. Classic Mode completely locks your camera view, disabling the ability to appreciate various angles in realtime without accessing the menu again to disable it. I believe while trying to simplify the control scheme that the designers have in fact created a more cumbersome system that alienates and punishes users who are already familiar with playing first person games on the PC.  I hold out hope that Cyan plans to release future updates to refine RMME, for I would really appreciate having it be my go-to Myst game in the future. The fact that Myst, Myst: ME, and realMyst cannot be made to work on modern hardware without breaking your computer is tragic.   [Edit: I stated before that there was no hot-key for the flashlight, which somehow I recall the F key being unresponsive in-game. I tried again and it works. I've edited my review to reflect this. Thanks, Vec! *I also realize that the flashlight brightness may just seem a tad high rather than the spec maps being wacky. Sorry for that.] ",
            "review_score": "1"
        },
        {
            "review_text": "Classics in a modern performance",
            "review_score": "1"
        },
        {
            "review_text": "Stunning! Great to see a faithful reproduction of the original.",
            "review_score": "1"
        },
        {
            "review_text": "I played the original Myst when i was a boy. This is just reliving my memories with a cherry on top.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a lot of fun. Full of wonderful waves of nostalgia, but somewhat updated for the current age",
            "review_score": "1"
        },
        {
            "review_text": "Such a beautiful classic remastered into a 3D free-roam masterpiece with a bonus Age. This game has puzzles so clever, yet so challenging that you gotta write notes, very good atmospheric soundtrack, and amazing worlds that are so unique, amazing and breathtaking. Definitely recommend this game to anyone looking for a challenging puzzle game.   9/10 - Awesome",
            "review_score": "1"
        },
        {
            "review_text": "I refunded 'Myst:Masterpiece edition' and bought this one for a few dollars more. It's a great title with better graphics, better resolution and more modes. If you want the definitive Myst game this would be it.",
            "review_score": "1"
        },
        {
            "review_text": "If you have not played MYST, play this version. the original would be hard for a modern palate to appriciate, but the world and puzzles are as great as ever.",
            "review_score": "1"
        }
    ]
}