{
    "app_id": 244410,
    "name": "Supreme Ruler 1936",
    "release_date": "2014-05-09",
    "developer": [
        "BattleGoat Studios"
    ],
    "publisher": [
        "BattleGoat Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Grand Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 169,
    "negative_ratings": 61,
    "price": 9.99,
    "description": "Real-Time Strategy Game. Guide your nation through the most violent era in modern history. Play massive campaigns as one of the principal nations, set-piece scenarios of famous battles, or set your own victory condition and play as any nation in the world in Sandbox mode.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/244410/header.jpg?t=1528989779",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows XP SP3 or later Processeur : Intel Pentium IV or better Mémoire vive : 512 MB de mémoire Graphiques : ATI/Nvidia/Intel DirectX 9 Compatible DirectX : Version 9.0c Espace disque : 1 GB d'espace disque disponible Carte son : Direct X Compatible Notes supplémentaires : Screen Resolution: 1440x900 or higher",
    "recommended_requirements": "Recommandée : Système d'exploitation : Windows XP SP3 or later Processeur : Intel/AMD Dual Core Mémoire vive : 2 GB de mémoire Graphiques : ATI/Nvidia/Intel DirectX 9 Compatible DirectX : Version 9.0c Espace disque : 1 GB d'espace disque disponible Carte son : Direct X Compatible",
    "reviews": [
        {
            "review_text": "I stumbled upon Supreme Ruler 2010 years ago and ever since then I have been hooked on the Supreme Ruler series. Having played the previous titles and almost 60 hours of 1936 I can say the game is great so far even with the current beta issues. The issues which are to be expected as the game is still in beta do render the game unplayable and require you to start over but when the issues’ happen you can report them and usually find a way to avoid it in the next game until a patch is released. I myself have reported a few issues and made a few suggestions all of which the developers took note of and added to their system. The gameplay in of itself can seem overwhelming to new players but if you spend the time learning to manage your economy, military, technology and diplomatic relations you will find the game very rewarding and challenging. My favorite aspects about the Supreme Ruler 1936 excluding the gameplay right now would have to be the ability to mod the game, the ability to communicate directly with the developers, the amazing community, and the lack of any anti-piracy system screwing up or limiting my ability to enjoy the game.",
            "review_score": "1"
        },
        {
            "review_text": "I have only put 30 hours into this game, but have easily put 500 hours into the series in total. My opinion? Stay away. If you want large scale strategy based around modern/semi modern warfare, get Hearts of Iron 3. It is a better game in almost every way.  The SR series of games are large scale stragey games based in the 20/21st centruries.You control the economy, diplomacy, government and military of any nation you choose.  The problems with this game: 1)There is no tutorial (or at least not a very good tutorial). Be prepared to spend plenty of time trying to figure out how the game works (The economy is especially convoluted)  2)The territory system is a mess. conquering a country will often result in it being broken up and divided in the most nonsensical way possible.   3)The AI is abysmal. For Example: As Canada, I helped France obliterate Germany, barely having to cede land at any point (Hard/Hard/Hard), not because of skill, but because the AI does not understand how to use their armies properly.  4)As the game progresses, the performance gradually gets worse, until the game is unplayable. I have never been able to 'finish' a game because of this, usually after 6 years the game runs so poorly that I have to quit.  The only positive thing that I can say about this game is that once you figure it out, the economic system is somewhat entertaining. You aren't able to transform a fledgeling nation into a super power overnight, and resources have to be carefully managed and balanced.  I like the concept of the SR series, but the games are not rewarding or challenging in a fun way. If you are thinking of getting this game, or any game in the SR series, make sure you try Hearts of Iron first. It is better in nearly every way imaginable.",
            "review_score": "-1"
        },
        {
            "review_text": "its a very good game. i think people should stop looking at it for its bugs or problems and start looking at the good points.  1st: it has a very detailed hex map, most games like HOI4 would have provinces the equivellant of 7 hex's together.  2nd: the economy management is very detailed  3rd: research&amp;development goes from 1914 to the future. which is an impressive amount of effort, that needs to be awarded  4th: there is no restrictions to whatever you want to do, for example you could backstab your allies, demand 1billions worth of goods from your allies and pay only like a couple hundred million  5th: it simulates how your millitary performs, affects your evonomy. like if you have built too much units, the maintanance will take up your profits, and if you increase taxes, your gdp will slow down increasing/ start to go down.  6th: infrastructure is physical and can be seen whereas in HOI4, its just a value in its condition, so like if i wanted my enemy to lose all i have to do is bomb their land production.  7th: interesting things happen, random events happen to different countries. on one of my saves, america went into a 97 billion dollar debt, another one japans mainland got invaed by china, another one romania invaded russia while germany only pushed at infantry speed. another, finland gained ground on england, ireland took back the north (but later lost though, sad), america invaded all of the american continent, england became facist, south africa became facist, hungary invaded yugoslavia. and to be honest it gets interesting as time goes on, all of the above in the 7th category are from sandbox though.  8th: russia invaded germany(me) and i built a wall to keep them out, but they went around it, invading hungary, romania, italy and went through the austrian-italian border to get to me.   CONS  1st: files go corrupt  2nd: there is only 1 explosion animation  3rd: at about 1940-50 you cant keep up with the demand for consumer goods and eventually you have to buy them, then a bit more, then alot, and then youve no money to buy them.  4th: countries dont send you help, but if your lucky youll get that 1, ww1 infantry that gets blown up before it can touch the enemy  5th: if your not a middle eastern country or romania, or russia, say gg to getting oil.  6th: austria doesnt agree to the annexation thing, as far as i know it wasnt an invasion by germany but a contract handing austria to germany.(sandbox)  7th: japan loses the chinese war (sandbox)   CONCLUSION a gernerally good game, i give it a 9/11, i would only be able to keep playing if my saves would not corrupt themselves",
            "review_score": "1"
        },
        {
            "review_text": "Very complicated at first, but once you know the basics very entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "The game at first, strikes you as the same as SRCW, then the reality hits. The ticks are much improved. I let this run for almost 2 days now and the ticks are still fairly quick at the fastest setting. Unlike the old days of my SR2020 games where I'd alt tab it into the background for weeks on end and when you did go back to check, the ticks would take forever. sometimes 1-2 minutes per tick or more. There is a lot of work to do yet, that I can see. But for the most part I like it.   Some things I've found: - When you play as a country that isn't a known tech powerhouse, you are limited. I'm not sure if this is a bug or not, but playing as Mexico, I have not been able to get tanks. I can't even trade for them.   - I wish I could minimize the tool bars. I play on a 14' alienware and with all the clutter I don't have much of a window to see things.  - Somtimes things just seem to pause when building. Buildings, tech research, and unit building. They just freeze. I found if you pause, then unpause or save and then resume it fixes this.   - A lot of pathing issues to resolve yet I see too. As Mexico I was invading Germany, then I invaded Romania. I was then attacked by France, so for some reason, my units decided to hit the coast near Constanta and turned into merchant vessels and just sat there spinning. I clicked on them and told them to unload at the port there and everything was fixed at that point.   - The BG forums themselves are having problems these days too. I went to log in and it said there was no record of my account. So I made a new one. I never got the activation email after 12 hours so I clicked to send a new one. Again it says no record of account. So again I try to make a new one and now it says I can't cause an account already exists. It's a circle of frustration.   - The next game, I'd like to see this SR format where you can go from a caveman society to future tech. With expanding influence/country borders like SR offers.",
            "review_score": "1"
        },
        {
            "review_text": "Very good strategy game. But it's a slow start so not all will like it",
            "review_score": "1"
        },
        {
            "review_text": "Great Britian Took over all most all of eastern europe and took moscow after germany declared war on poland.  10/10 would see GB back stab france and destroy germany",
            "review_score": "1"
        },
        {
            "review_text": "The Multiplayer keep desynch. i love the old games with cold war and 2011 edition . but supreme ruler 1936 is not better than the old games . not anything new else than you start in 1936 .. i realy like the game but too many bugs and too bugged multiplayer destroyed it for me . i wont recomment it because they already have startet alpha on the next version of the game and that i realy think is sad . i have hoped they least will fix the bugs and put alot of history into the game before they even think about close the alpha in supreme ruler 1936 and call it 'done'. .. but sadly they did .",
            "review_score": "-1"
        },
        {
            "review_text": "Love the gameplay, but i hate how after May 1945 it just goes all weird with no producing of materials. I hope they make a expansion pack to fix this problem so you can play the game the right way past 1945",
            "review_score": "1"
        },
        {
            "review_text": "Maybe its because I´m new to the Supreme-Ruler-series, but I cannot recommend this game. For long-time strategy players like me its just to arcade-like in its warfare part. But its easier to make a list anyway.  PROs - the economic side is cool. You can built and reinforce your economic sectors in six categories and three manufactured goods. Plus you trade surplus and buy things you lack with ease. - the builtup for war is easy. Units are built with land-/naval-/aircraft-factories in different cities. Plus you can hold them in reserve so they don´t clutter the map and cost immense resources - I like the importance of recon units and the extra range of artillery. Makes the tactical combat fun.  CONs - research is far reaching, but the easy way to trade it, destroys the fun. If you have researched the general tech, you can trade or buy unit-schemes from friends (or just anybody) for next to nothing. As Italy I ended up with advanced carriers of Japanese design and cool German recon units. Plus I think that there should be far more not tradeable research areas, so it´s more difficult to excel in research as a minor nation.  - producing units is very cheap, so you end up piling up units in reserve. which leads to: - in my view your armies are far to vast to really control them properly in all theatres. So you end up losing small or prestigious units somewhere without even noticing it right away. Even units like carriers can be destroyed in seconds (which I did) or four submarine in a wolfpack are oblitarated in a glimpse. Its better in land and air combat, but naval combat just goes on to fast. - the AI is not useless, but not very clever either. For example: As Germany attacked Poland the Western front to France was unguarded. Later it tried an invasion of Britain only with (zillions) of transports risking a good portion of its army. Fortunatly for Germany the British navy drove around aimlessly. - the manual does not explain very much. So I looked in forums and learned much the 'hard way' via losing.  For me Supreme Ruler 1936 has many fun aspects, but it´s not properly balanced and too confusing in large scale combat. The AI is not clever enough to watch theatres for you (not mentioning your Allies) so you win mostly by sheer numbers.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is fine but there is problems,for one its not finished needs major updates.One you cant colonize or liberate things.Two russia sometimes get gangbanged by Germany,Italy,Romnia, and other eastren countries.Three italys navy is to big they have like 200 warships total this is fine but a little overpowerd because they do nothing but sit in the ocean all day.Four by 1945 germany dont even have a V-2 rocket and japan does not get nuked.The answer to this is monet issues America goes broke sometimes, when its at war with the other nations its money goes into debet which is sad.Please fix this people",
            "review_score": "1"
        },
        {
            "review_text": "- interface is horrible (3D map that is useless, the menu you will be using 90% of the time is far too small in the corner of the screen) - the economy informations are laughable - no combat reports at all (only info about losing a unit) - prepared only for big countries (if you will take f.e. Poland, Belgium or Denmark there is no way to survive and when your country is occupied you just disappear)  overall waste of time - buy it only if it's very very cheap",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of money...",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely no improvement on the User Interface, Interface, Game Mechanics, Performance or Graphics from the previous SR 2020 and SR CW (Which I own both). Forums are almost deserted and you could see the dustdevils in the modding section. During the game No relevant information is immediately available to player and even the most basic tasks require multiple clicks. Stay away from it unless they reduce the price to something along the lines of $12-15, for all of the Supreme Ruler games.",
            "review_score": "-1"
        },
        {
            "review_text": "I just cannot play this game, the lag makes it unbearable, Read of loads of other high performance Nvidia/ATI users struggling with the same thing, just google 'Supreme Ruler 1936 lag' and you will find troves of it.  The game is amazing, I would have sunk many hours into this game but the lag just makes it unplayable. Gutted.",
            "review_score": "-1"
        },
        {
            "review_text": "You can play as Hitler or Stalin!",
            "review_score": "1"
        },
        {
            "review_text": "Tell them why they should?  DO NOT PLAY THIS GAME!  There is no manual and the interface in unintuitive.",
            "review_score": "-1"
        },
        {
            "review_text": "It needs. Mods? Great game. My favorite of its type.",
            "review_score": "1"
        }
    ]
}