{
    "app_id": 244710,
    "name": "Shelter",
    "release_date": "2013-08-28",
    "developer": [
        "Might and Delight"
    ],
    "publisher": [
        "Might and Delight"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Cute"
    ],
    "achievements": 0,
    "positive_ratings": 2774,
    "negative_ratings": 479,
    "price": 6.99,
    "description": "Experience the wild as a mother badger sheltering her cubs from harm. On their journey they get stalked by a bird of prey, encounter perils of the night, river rapids crossings, big forest fires and the looming threat of death by starvation. Food is to be found, but is there enough for everyone?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/244710/header.jpg?t=1554130222",
    "minimum_requirements": "最低配備: 作業系統: Windows XP SP2 處理器: 2.6 GHz single core 記憶體: 1 GB 記憶體 顯示卡: GeForce 400 series, ATI Radeon HD 2xxx DirectX: 版本：9.0 儲存空間: 2 GB 可用空間",
    "recommended_requirements": "建議配備: 作業系統: Windows 7 處理器: 3.0 GHz dual core 記憶體: 2 GB 記憶體 顯示卡: GeForce 8 series, Radeon HD 5xxx DirectX: 版本：10 儲存空間: 2 GB 可用空間",
    "reviews": [
        {
            "review_text": "I got really drunk and played this game... ended up naming my precious badger babies. When I lost turtle I was screaming at the river. Then when I was done I wanted to punch a bird. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is almost too emotionally engaging. I often found myself seriously distressed at the thought of losing one of my beloved badger babies or being unable to feed them. I can't handle this game.  Pros: + Emotionally jarring as you experience life through the eyes of a mother badger. + Unique atmosphere. The graphics and soundtrack added to the experience. + Gameplay is smooth, although some things I found very difficult (like sneaking up on a fox).  Cons: - Crying, lots of crying",
            "review_score": "1"
        },
        {
            "review_text": "I would like to introduce this game to all animal lovers,playing as a badger will be a pleasant experience. You are going to write your own story,there is no exact winning or losing,no objective,just life or death,this is how nature works. Not a game that can be played for a long time,but it will definitely make you reflect. When you feel like you are not going to open this game again,maybe you can give your mother a call before clicking the 'uninstall' buttom.",
            "review_score": "1"
        },
        {
            "review_text": "Although short, it is worth it. You play as a mother badger protecting her young from the dangers of the world and feeding them. That's all there is to it really. Its about nature and how cruel she can really be.  The unique art style and music really contribute and make the game something special. There is some replayability here, get to the end with all your babies alive and feel like a champ doing so!  It will take about two hours of your time to do so, you will not be shooting at people or aliens or bananas and you will not be driving super fast cars. Its simple and unique, short and sweet.",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game I realised I would be a terrible mother.",
            "review_score": "1"
        },
        {
            "review_text": "has badgers and badger babbies  also taught me how to cope with losing my loved ones  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Expect overwhelming cuteness (づ◔ω◔)づ",
            "review_score": "1"
        },
        {
            "review_text": "A short but lovely game. I wish it had been a bit longer, but for what the story is and such, the length fits it. Anything longer and it probably would've changed the game completely and would take away from it rather than adding anything. The story is fairly straight and to the point. A sad but true story of life.   Definitely recommend if you enjoy these sorts of games. The art style is beautiful, and considering the length it's more than worth it's current sale price ($1.99). If you have the change the spare, definitely pick this up and give it a shot.  Also, I dare you to play it and NOT get sappy or emotional. Bet you can't.",
            "review_score": "1"
        },
        {
            "review_text": "Neat little game. VERY short. Less than an hour of gameplay. Buy it when it's on sale. Not worth $10 for 50 mins of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "★★★☆☆ - 'Worth a try, but only on a discount'   PROS: - Innovative idea - Tough loving, its hard being a mum and this game has the ability to make you attached without any characters - Art style just works beautifully  CONS: - Short, takes about an hour but losing your little ones makes you wanna try again - A little aimless, I got a little bored just waddling around. Could have done with a bit more, as theres only a few animals to catch and food to find.  VERDICT?  Im a little on the fence with this game as I found it disappointing and a little boring, however I've decided to recommend it due to its intelligent and fresh idea, but it could and should have been expanded on with better execution.",
            "review_score": "1"
        },
        {
            "review_text": "The art in this game is beautiful. And when my children left meh... :-:",
            "review_score": "1"
        },
        {
            "review_text": "(╥_╥)",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is a third-person survival game where you play as a mother badger attempting to protect her 5 cubs from hunger, predators, and the elements. It's quite short (it can be completed in roughly an hour - less time than it takes to drop all the trading cards), so consider the price accordingly. The graphics are a washed-out stylized pastel, which works well for the rather whimsical feel of the game at times, which contrasts nicely with the danger which is present.  All in all, I enjoyed it - the short length plays to its benefit as it didn't overstay its welcome. I felt terrible when I lost one of my children, so it's effective at conveying that loss.  Recommended if the concept sounds interesting - it's well executed, so if it sounds like something you might enjoy, you probably will.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just too good. I managed to be angry, happy, hopeful, sad, and in despair within half an hour, as a badger. I'm sure there's plenty more content from where I've left it, but my purchase was rightfully justified in the first piece of this level-based masterpiece. Polygon per polygon, this game packs the most into the smallest of spaces.",
            "review_score": "1"
        },
        {
            "review_text": "There is no questioning that Shelter is a work of art. It employs a graphics style all its own, the end result of which delivers at once a realistic and alien world. The natural environment is at once your friend and enemy, and you and your five badger cubs must make a truly hazadarous journey through it. Can you provide enough food for each badger cub to survive? Can you guide them safely past the flying bird's shadow? Can you hope to navigate them all past the deadly rapids? When the forest is aflame, can you quickly discover the safest route?   Shelter is a tense and emotional experience you should make time to play. The whole game isn't much longer than an hour in length, but that brief time spent is really something remarkable.",
            "review_score": "1"
        },
        {
            "review_text": "My babies were killed. I know it's my fault. I could have saved them. The game's fun though!",
            "review_score": "1"
        },
        {
            "review_text": "it's a nice little game,only took me 1hour to complete.But the ending felt like it had a meaning to it. Overall,buy if you want to get rid of an hour of your life with something that might just change it alittle.",
            "review_score": "1"
        },
        {
            "review_text": "Yes the game is short but the art used in the game is unique and beautiful. The game is about being a mother badger and protecting your badger cubs from predators.",
            "review_score": "1"
        },
        {
            "review_text": "You are a badger; you have 5 children who need food; turnips, apples, frogs, rats, foxes are food that can be found/caught; wolves, floods, fire and eagles are trying to eat/kill your kids; keep them alive and kepe them fed.   This game is incredible. Such a simple concept and yet so enjoyable. It's the kind of game where you can get a beer, and just sit down and play without having to be totally invested, mentally, in what is going on. It has a simplistic art style that reminds me of children's bedtime books, and a wonderful soundtrack that is relaxing and yet telling of events both happening and coming.   It's not a long game, but it is totally worth every penny you spend on it.",
            "review_score": "1"
        },
        {
            "review_text": "I ...I ...I want to cry... The end its so sad ....  The game himself look simply and it is..but its so fun exciting and make me CRY!.. amazing game idk what to say after that ending... :( I am definitely going to buy the second game in a series shelter [11/10]",
            "review_score": "1"
        },
        {
            "review_text": "I was like haha virtual badger puppies there's no way i can love them. I liked the back of one, and named him Johnny.  A hawk took and killed him. I literally shocked.  JOHNYYYYYYYYYYYYYYYYYYYYYYYYYY I can't sleep now.  I miss Johnny  10/11 would miss Johnny again.  Did i say i miss Johnny?",
            "review_score": "1"
        },
        {
            "review_text": "A short (~1 hour) game showing the cycle of life and possibly    what a bad ♥♥♥♥ing mother you can be.     It's   sweet   and it makes me wanna kill myself. Totally recommend it.    It also has a really calm/sad soundtrack so I urge you to buy it as well.  ",
            "review_score": "1"
        },
        {
            "review_text": "I can't say particularly enjoyed playing this game, but I think everyone needs to play it at least once.",
            "review_score": "1"
        },
        {
            "review_text": "This game was short, but I felt so much parential instinct for my little babies. Only two survived -- I hope they enjoy their apple forest.",
            "review_score": "1"
        },
        {
            "review_text": "A lovely game, but I couldn't bring myself to finish it. I was just too worried I'd lose my pups and couldn't bare the loss.  This is the closest I've found to a singleplayer Journey",
            "review_score": "1"
        },
        {
            "review_text": "The only reason I like this game is because it gave birth to the best emoticon ever  :shelterfrog:",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is a beautiful and charming game where you are a mother badger tasked with the responsibilities of taking care of your five pups.   Some players may find this simulation too linear, but the structure allows for it to be divided into chapters which shake up the mainly slow-paced action.   The game is beautiful, made up of pastel textures stitched onto the world which change with the acts and colour palettes.   It is a heartwarming journey in which you are able to witness the growth of your pups as they grow in size and speed, but it leaves you with a gnawing sense of failure in the almost inevitable death of your pups due to hunger, predation or just nature itself. The ending is an ode to motherhood that leaves you with a sense of legacy, grief and hope.   It's only around 2 hours long, so probably wait for a sale, but it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't long; it took me 68 minutes to complete. I was really intrigued by the concept, and at first I just thought it was a bit funny. After a while I grew attached to my little baby badgers, and quickly learnt to keep them alive at all costs. When one died, it made me sad. The game is kinda sad all the way through. The ending was the most depressing thing ever. It might be coz I smoked a blunt half way through but I was really sad when it finished. It felt like my soul had been torn from my mortal frame. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I am kinda glad this only lasted about an hour. I understand what the devs were going for and I think they achieved it to some degree, but in the end I found the whole experience more frustrating than enlightening. I enjoyed most of it up until the camera angle shift, then I was just annoyed. Worth playing for it for the hour for the experience, but at the full price of $10 not worth it. I got mine in a bundle. ",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is a very gorgeous game.  The graphics are simple but lovely, the feelings for your children so authentic as the fear of the 'enemies'. The gameplay works better than in the most AAA titles you can find on the market nowadays and the ambientmusic in the background works perfect and supports the action on the screen.  Although it's short I think it's near a perfect game and if you think what you would get for this money from a AAA studio, then I would totally recommend Shelter and say it's worth every single cent.",
            "review_score": "1"
        },
        {
            "review_text": "Aaaand I've lost all of my kids to the first eagle",
            "review_score": "1"
        },
        {
            "review_text": "Nice game! bit scary!",
            "review_score": "1"
        },
        {
            "review_text": "this is the most emotionally difficult game I have ever played. not for the weak of heart.",
            "review_score": "1"
        },
        {
            "review_text": "Despite its duration, the adventure you take through Shelter's beautiful world is worth taking. I literally shouted out loud when a hawk took one of my cubs and the ending provides a opportunity for the player to think about life from perspectives other than their own.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't long; it took me 68 minutes to complete. I was really intrigued by the concept, and at first I just thought it was a bit funny. After a while I grew attached to my little baby badgers, and quickly learnt to keep them alive at all costs. When one died, it made me sad. The game is kinda sad all the way through. The ending was the most depressing thing ever. It might be coz I smoked a blunt half way through but I was really sad when it finished. It felt like my soul had been torn from my mortal frame. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I lost two of my babies to darkness+lagging monster... ^^; And two of them to that eagle,   who finally took my life too.    My biggest and fattest baby was the last one alive. Hehe.   This was nice game, but too short, I think. ♥",
            "review_score": "1"
        },
        {
            "review_text": "In a world of clones, look-alikes, and generic brown hallways, Shelter is a breath of fresh air. Much like the fresh air your digital badger family is undoubtedly breathing as you guide them through the beautiful and often dangerous world of Shelter.  Obviously the most readily noticeable aspect of Shelter is the unique sort of washed out/watercolor/paper-craft aesthetic. It might look overly washed out in screen shots and videos but while playing it that wasn't my feeling at all. In fact there is a lot of variety between levels, scenery and color palette wise. While the game is relatively short, you can rush it in under 2 hours (not recommended) but typical length is probably 3 hours, if you're engaged it's quite tense. It does a good job of making you aware that there is danger but not directly showing it to you. It's up to you to determine what is safe and what isn't and if you let your guard down or take to big of a risk it will likely result in the death of a cub. Above all else though, finish the game. The ending has that sort of perspective shifting impact that can stick with you beyond even the context of the game. Overall Shelter is a great example as games as art, even beyond it's aesthetics and in it's mechanics and message.  Shelter is a game I think everyone should play, it's well worth the time, at least once. The standard price might be a little steep for a once-through experience so unless quirky little indies are your thing wait until you find a sale price and then absolutely jump all over it.          YouTube™ Video:  Cheap &amp; Cheerful - shelter&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Good day. I have bought the Shelter when it had a promotion price discount. I had heared about this game before and I wanted to check it out because the review that I've heared were very positive.  The whole completion of the game took me 1 h 30 m. However, I have to admit that the game is very well done. It is unlike anything else. The controls and gameplay are rather straight forward, nevertheless it still makes you strongly care about your small fluffy heroes.   I have to praise the atmosphere created by the developers. Despite the graphics are not particularly intricate, they grasped my attention because of the sophisticated impressionistic style which added up to the whole game universe.   The game itself makes you appreciate things that we usually wouldn't notice. The plot twist was a cherry on the cake, even in spite of being slightly predictable.  To sum up, I recommend this game to every gamer, as it is something unlike the usual games. Appreciate it rather as a piece of art, then a challenge (which you can find there as well :) ).",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful. Love the artwork and the gameplay and the music and the cubs and the everything",
            "review_score": "1"
        },
        {
            "review_text": "This emotional survival game is really a fun game where you're using this badger mom and your trying to protect your kids and helping them survive in the forests. Shelter has a really nice soundtrack that makes you feel connected with the game's atmosphere. For every action you make there is this relaxing sound that you will hear except when you are being hunted by birds. Shelter may have been an experimental game because it's short but overall this game is pretty amazing.",
            "review_score": "1"
        },
        {
            "review_text": "The best time I've had being a Mother Badger.",
            "review_score": "1"
        },
        {
            "review_text": "It's just 10 of 10.  This is the story of one badger who did everything for her children.  This is a story about real events occurring in the lives of not only animals, but also people.  The game is like Dear Esther, such as the ambiguous-this-is outstanding.  I recommend to all and sundry.",
            "review_score": "1"
        },
        {
            "review_text": "It's said that the greatest despair that a parent can face in life is the loss of a child. Shelter is a small story that you play which mimics parental love and the sorrow of loss by making you take care of five young badgers (You're the mommy badger) who need to be fed and protected as you go across the dangerous wilderness through day or night. I've noticed you should always try to keep them more or less fed at the same level or else the one that's least fed doesn't grow as much and becomes slower, therefore your possibility of loss of that young one is higher. I've loved playing this little story/simulation for it actually makes you want to protect the little ones as if it is your responsability - and when you lose one, it actually hurts.  It also has a very distinct and great look to the game, with various textures to give that abstract depth of the wild life, the soundtrack choices are great for each moment... All I can say is that I loved it. Now it's time for you to find out if you're able to feel the pain of a mother.",
            "review_score": "1"
        },
        {
            "review_text": "I named one of my baby badgers simba. Eventually he was the only one left. I lifted him to crown him king of the land for all the other animals to see. Then he was taken away by a bird. Mufasa shall remain king after all.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "A game that definitely portrays the life of a zigzagoon",
            "review_score": "1"
        },
        {
            "review_text": "fun, but can be boring during mostly walking scenes",
            "review_score": "1"
        },
        {
            "review_text": "Simply beautiful",
            "review_score": "1"
        },
        {
            "review_text": "I have never played anything quite like Shelter. Visually stunning, and emotionally resonant, this is one of the most memorable games I've played in quite a while. It's the sort of game you have to experience for yourself to truly appreciate.  Throughout the gorgeous landcapes, death is everywhere. Your cubs don't have the experience you do; all they know is that you, their mother, will protect them. But you are just a speck in the vast outdoors, and nature doesn't care about your pitiful pleas for mercy.  This game is what indie games are all about (for me). Totally breaks the mold of what a traditional game should be about, look like, or play like. It's certainly not for everyone, but everyone should still play it. Such a beautiful, artistic gem. I enjoyed this game immensely.",
            "review_score": "1"
        },
        {
            "review_text": "Feed your babies simulator.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this simplistic game of survival. Enjoyed the story and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "You literally be a badger. Learn how to take care of badgers as a badger. 10/badger",
            "review_score": "1"
        },
        {
            "review_text": "I AM A TERRIBLE MOTHER :(",
            "review_score": "1"
        },
        {
            "review_text": "Great game with artistic sceneries... even if it's very heartbreaking when you loose your babies.",
            "review_score": "1"
        },
        {
            "review_text": "Nice relaxing game, very calm and unique. Not recommended for full price imho, I completed it in 1 hour. Great game if you want to clear your ''to play'' list.",
            "review_score": "1"
        },
        {
            "review_text": "the government took my baby",
            "review_score": "1"
        },
        {
            "review_text": "Great game with artistic sceneries... even if it's very heartbreaking when you loose your babies.",
            "review_score": "1"
        },
        {
            "review_text": "It was very easy to find food, but the sense of loss and danger keep you on your toes. The game pulls at you emotionally, but unfortunately fails to expound very much upon the mechanics it establishes.   For instance, none of my cubs ever became hungry enough to fall sick which could have added the challenge of leaving a cub behind and keeping the others safe while trying to find food. Although the game begins with a sick cub, this idea is not once revisited.  Overall, the game is wonderfully made and thoughtfully put together. I definitely recommend playing this, but I wish the ideas were a little more fleshed out. I don't know if I can say that the $10 price isn't worth it, but the game's 1hr length definitely brings it under question.",
            "review_score": "1"
        },
        {
            "review_text": "cute game with nice story :)",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is a unique little game where you play as a female badger who must protect her offspring as they journey with her throughout the game's world, which consists of forests, mountains and rivers. You must feed your babies regularly or else they will starve - there are plenty of food items around the world, which is useful, however during more intense moments you'll need to make sure that your offspring aren't going hungry as you spend your time trying to reach a safer area.  Dangers in the world come from other animals such as hawks as well as factors in the environment such as rushing water. These provide the player with a lot of challenge, especially if they want to keep all of their babies alive. Whilst the babies are cute, their AI isn't perfect, and on several life or death situations I've had them prance around a turnip instead of following me to safety. There are also a few glitches with falling fruit, where it falls on top of a baby badger, it will cause the baby to freeze up. This can be solved easily however.  The music and environments are very beautifully-designed, and look like they've just come out of a book. I did encounter a few FPS drops, however, which seemed strange as I have a very powerful PC. The game's soundtrack is also wonderful, and it will also change in composition depending on what action is unfolding on screen, which is very effective, especially during the more tense parts of the game.  My main gripes Shelter are probably the mentioned issues, along with the game itself which is a tad on the short side. However, there is also a nurture mode which I've not played yet, which has a much longer replay value and is a sort of tamagotchi-like mode where you must feed your offspring every real-life day.  Overall, I think Shelter is a great little game, and a good example of a unique game concept that works well.",
            "review_score": "1"
        },
        {
            "review_text": "Probably a lot better if I were high. Or a badger. But I was neither. In the end, I was just a ♥♥♥♥♥ of a badger that lost all her babies and went looking to go badger clubbin' hoping to find some badger ♥♥♥ to knock me up for the next batch of babies. The original badger welfare queen Reagan warned you about. Then a bird ate me. The end.",
            "review_score": "1"
        },
        {
            "review_text": "Of all the kinds of decay in this world, decadent purity is the most malignant.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pleasurable little game about being a mother Badger leading her cubs through the woods, feeding them and protecting them against dangerous predators. I loved hunting frogs for my offspring to eat. The nibbling and squeaking noises are adorable. It's definitly worth the buy, especially if it's on offer.",
            "review_score": "1"
        },
        {
            "review_text": "So I started out with 5 pups, two met an untimely demise when a great winged demon swooped down and swept them away with its talons *eyes begin to water*, two more were devoured by nocturnal creatures when I failed to keep an eye on them *tears begin streaming down cheeks*, I-I only turned away for a second and then I heard their cries of mortal terror! They sounded like they were in so much pain! My poor babies...I'm a failure as a mother! *bursts into tears* So I was only left with but one pup, but as I write this it pains me greatly to say that while the two of us were heading back to our burrow the great winged demon returned and spirited me away as well, leaving my only surviving pup to fend for itself out in the cold hard world. I-I can see something in the distance...its..its a nest! Oh god no! Please! Please! I'll do anythin-  7/10 Would go through a tremendous amount of emotional turmoil only to be eaten alive by birds again.",
            "review_score": "1"
        },
        {
            "review_text": "best art style to any game I've played to date. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A really nice looking indie game with a message. Even though it's a bit short and I expected it to be a bit more open world it gave me a good story and a great badger experience :)  Indielovers _enjoy",
            "review_score": "1"
        },
        {
            "review_text": "If you find it cheap buy it, nice game to play. UNfortunately no save. Also has no replay value.",
            "review_score": "1"
        },
        {
            "review_text": "I was an amazing mother badger..",
            "review_score": "1"
        },
        {
            "review_text": "love this game. there is always the fat ♥♥♥ who kills the others ",
            "review_score": "1"
        },
        {
            "review_text": "Well... it's a Badger simulator! Quite a unique idea, and it's certainly interesting being put in the middle of the food chain, trying to protect your cute little badger cubs from those mean predators, then biting a mouse's head off and sneaking up and killing a fox then feeding it to them. Only downside is that the game doesn't really have any replay value and isn't really that long. I suppose you can retry and see if you can get more of your cubs to the end the next time.",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wondered to yourself how a mother badger feels BOY DO I HAVE THE GAME FOR YOU",
            "review_score": "1"
        },
        {
            "review_text": "I absolutly love this game. It's relaxing yet stressful. The animation is beautiful, like walking in a Group of Seven painting. I hope the developers continue to make games like these because I will buy them all.",
            "review_score": "1"
        },
        {
            "review_text": "I put my heart into raising my children, but in the end it's clear that I'm a failure as a mother. Two thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "My babies and I survived everything all the way until our log collapsed into the darkness.. and I realized I only had four. I panicked for about five minutes but knew I had to quickly find a safer spot for the remaining babies. Then I guess I ran too fast, and I lost one to the dark. Then, two starved to death in the dark and wouldn't eat. So I had to leave them behind. I had one baby with me finally and I was fierce and protective, but that baby was swept away by a wave while crossing the river. In the end, I didn't even care if I lived or died, and I was eaten by a huge bird.   My heart is broken. So broken. :(",
            "review_score": "1"
        },
        {
            "review_text": "We will teach as mother of an animal to protect her son from prey birds . is so beautiful game ive never seen before",
            "review_score": "1"
        },
        {
            "review_text": "Pretty sick, ♥♥♥♥ed up some frogs and fed them to my kids.",
            "review_score": "1"
        },
        {
            "review_text": "kill 2 birds with 1 badger. entertaining / 10",
            "review_score": "1"
        },
        {
            "review_text": "It used to be 2 hours for the story but the new mod can be days long depending on how much you feed the babies and they grow big enough to leave and live on their own. i still feel sad to see them go. you can sharpen your hunting skills in this mod before going into the story or vice versa. i still don't like how the ending got confused before i researched that it was supposed to end that way, still felt like i lost in that impossible end.",
            "review_score": "1"
        },
        {
            "review_text": "This is a hard game but you need to feed your babies so that they do not die.",
            "review_score": "1"
        },
        {
            "review_text": "Sit down child (or, rather, stay in your seat I guess), and I will tell you how a game named Shelter not only will destroy your emotional center for the day, but also how it strangely makes you happy that you are not a badger mommy.  Artistic beauty aside, Shelter is a story about you, a badger mom who just had five badger babies and need to keep them alive. You need to avoid starvation (as a baby badger that's hungry turns grey as it withers and dies), drowning (in a river with surfer waves that snatch your children away), fires of death (that chase you and eats your babies if you don't run fast enough) and 'murica (haha, no, but seriously, even eagles want to eat your babies, what is that about, badgers eat you eagle dugnubbit).  I'd be lying if I said I didn't care whether or not my badger babies made it out okay, and that they're just a life-bar for me to get through the game and see some pretty neat sights. I suddenly realized what true motherly pain feels like over losing ones brood (or its fake, videogame-induced cousin, I guess), and genuinely panicked whenever that blasted eagle swooped down to snatch little Michael Jackson (Yes, I named my badger babies). I've said this about a lot of games lately, but the way it envelops me is just amazing, and the way the story (though little there is) just wraps around to thank all mothers leaves you satisfied rather than upset (you'll se what I mean if you play through it).  The game is short, but there's a lot to what it has. Personally, I don't think much of the after-game mode where you can care for badger babies and have them grow up, but they'll die if you don't feed them daily or something. The story-mode, however, is what makes it work, and if a game can make much of very little, that's immensely okay to me.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me sad.  It's really short, and can be completed in around an hour or so. In this case, that's a good thing as the gameplay isn't very deep or varied and would probably become boring if it lasted much longer. With that said, it is a unique concept and is worth a playthrough if you can get it on sale for a dollar or two.",
            "review_score": "1"
        },
        {
            "review_text": "The whole time I played this game I couldn't help but wonder what my mother badger and her pups were saying as I was leading them through this amazing world that laid before me! It probably went something like this:  Pups: Are we there yet? Mother: No Pups: Are we there yet? Mother: No Pups: Are we there yet?...",
            "review_score": "1"
        },
        {
            "review_text": "A great change of pace to your standard shooter or rpg games. Its a great game for a casual gaming but still with the challenge. Trust me at times it gets pretty crazy when you're trying to keep your cubs alive while you're searching for food and especially when a hawk can swoop down at any second.  pros + artstyle + satisyfing challenge + cool premise + you're a freaking badger  cons (only one) - not multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Loosing babies is soul crushing and I find myself crying and even yelling at the screen everytime I play... But, this is a good thing because I also find myself thinking about this game often and how much I really do appreciate it. It's super solid and the visuals are great. The ending was also something I wouldnt have expected, but it was a wonderful way to wrap things up. Fantastic and highly reccommended!",
            "review_score": "1"
        },
        {
            "review_text": "Cute but also shows the hard life",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty cool animal experience game. For some reason though, personally graphics makes it very hard for me to play, aside from that, the game is great.",
            "review_score": "1"
        },
        {
            "review_text": "Super nice little game about being a badger and caring for smaller badgers.",
            "review_score": "1"
        },
        {
            "review_text": "To cherish, to worry and to nurture. To worry, to hide and to fear.   Shelter is a cute and unique looking game about being a mother badger with multiple children (who you will name to remember which is which) who you must feed, protect and lead to a new less dangerous home with more plentiful food. The experience quickly goes from intriguing, to heart warming and then to harrowing.   The game is currently on sale for -89%, it is going for 1.09 USD. If you're reading this and enjoy games that tug on your heart strings and pressure you important decisions I can't recommend the game enough at this price.   To be a parent is to prioritize yourself second after your children. Struggle on mother badgers. I give this game 4/5 badgers... the 5th badger got washed down the river.",
            "review_score": "1"
        },
        {
            "review_text": "Eventually the floating thistles of grass turns in to snow,   and the hawks try to eat your babies    As a game it's not extremely enganing but the effort they put into this really shows. Not worth full price but if its 75% or 66% off it's very likely worth the money depending on what kind of person you are. You may be a penguin, badger or walrus.  For 3$ it gets a 7.5 score from me, but i dont recommend it full price.",
            "review_score": "1"
        },
        {
            "review_text": "Note: You definitely need/want an external mouse hooked up to play this game if you're using a laptop keyboard. You control movement with the WASD keys, and look around with mouse.   This game is exactly what the gameplay video shows: no plot beyond getting from point a to point b, no surprise twists, and no level ups. It takes about an hour to play through. If these things are not your cup of tea, do not buy this game. If it is, and the game play video appeals: that is the game you are going to get. Enjoy!   I resigned myself to only saving 1 of the cubs after I noticed that the hungrier siblings could be shoved out of the way by the others, and end up dieing of starvation unless I micromanaged the eating order. I am happy with my decision - it's like I'm taking revenge on every stupid AI I've had to escort in past video game ever. The art style is something different, and the soundtrack is very important to set the emotional tone in the game - there was clear effort made there.",
            "review_score": "1"
        },
        {
            "review_text": "The artwork is very cool, a small relaxing (sometimes intense) game.",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is a very good game, I liked how you needed to get through Obstacles and you needed to find your way to the next level.  I would give it a 4.5 out of 5  I would highly reccomend it",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is an exciting and thought provoking game. It really makes you think about the things that animals have to go through to rear their young and gives you a taste of it. Though it is vertially impossible to raise ALL your cubs successfully, it is defenitly one of my favourite games EVER. The graphics are AMAZING. The scenery is sooo artistic and stunningly realistic. The storyline is great and you actually feel genuin pain when you lose a cub. I did. :'(   RIP Pip- Starvation Maple- Hawk Rustle- Fire Lily- River",
            "review_score": "1"
        },
        {
            "review_text": "it's not that bad,it's just the bug's in level 2 that you end up can't move,can't sprint or cannot drop anything you picked or pick up something sometimes unless your lucky.But i still recommend this game tho it's just sometimes encounter bug's sometimes but feeding them all 5 is very demanding then you ended up fed the wrong pup that you don't want to feed yet but that's not the negetive add in actually thats just details but's  its pretty awesome, but it kinda sucks that it dont tell you controls in the beginning till you get out i had to search up and stuff to get the control's right :T",
            "review_score": "1"
        },
        {
            "review_text": "amazing game. i had troubles with it because i became attached to the children and i could hardly keep them fed. i thought that i should return home after feeding them, but it turns out i had to continue onward, which only led to starvation. i had to quit because a few of them died. i know i cannot save them all, but it is still my mission.   i found a light and happiness in this game - it is quite good.",
            "review_score": "1"
        },
        {
            "review_text": "Losing a child will make you feel like more of a monster than the one that killed it.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant piece of art and music combined. Not a fun game because it's heartbreaking.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing art, with simple, captivating gameplay. You'll need stealth to survive eagle attacks, agility to capture prey, and a sharp mind to keep your pups fed. A unique experience you won't find anywhere else.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game but I have too many emotions for small animals so I can't play this without getting sad.",
            "review_score": "1"
        },
        {
            "review_text": "I was surprised to find this engaging from the first moment.  The camera, music, and visual simplicity serve to focus your attention on the important things, primarily threats to your avatar's family and the environmental features like cover from threats and wild-grown nourishment.  These features also tinge everything with a subtle emotional quality that you won't even notice until the first dramatic moment.",
            "review_score": "1"
        },
        {
            "review_text": "8/10  This game is super cool, don't get me wrong. One thing I'd like to see is maybe the ability to save, because I accidently exited a game thinking it would save and lost all my data. The art style is beautiful, and the concept is something you seldom see in other survival games. Great game, above all.",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is a short Survival game with badgers.  In five short, but really different levels you play the mother of five badgers and your job is it to survive. The atmosphere is great, the soundtrack is great, too &amp; the graphic is something different and makes it a masterpiece. Made me cry. Short, very short, finished it two times in under 3 hours. But it's really nice!",
            "review_score": "1"
        },
        {
            "review_text": "You think life is tough? Try being a mother badger. Badger life is brutal. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Ate a turnip, dominated the world.",
            "review_score": "1"
        },
        {
            "review_text": "This game will teach you what it means to be a mother badger. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Quickly forms a strong emotional bond, then does all it can to evoke that emotion. If your heart doesn't hit your throat at least once, you may be dead inside. A unique 1 to 2 hour experience.",
            "review_score": "1"
        },
        {
            "review_text": "Scarred for life.",
            "review_score": "1"
        },
        {
            "review_text": "Any game that can make you feel is a good game. I was immediately drawn in by the concept, the graphics, and the execution. Evading the eagle was harrowing and I subconciously ended up naming my puppies. Then, during the night level, I lost one of my puppies...and I was hooked. I felt sad. I felt loss. I felt remorse. I felt an overpowering desire to do better and pay more attention to my puppies. AAA titles could learn a lot from Shelter; it is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Friggen love this game. It doesn't take long to play through and it loads too slowly on my computer for the 'Nurture' section to be very worth it, but it's compelling and adorable.  I lost a single pup on the second to last stage and I almost restarted. I refused to set this one aside until I saved them all and I did manage on the second play through!",
            "review_score": "1"
        },
        {
            "review_text": "Quickly forms a strong emotional bond, then does all it can to evoke that emotion. If your heart doesn't hit your throat at least once, you may be dead inside. A unique 1 to 2 hour experience.",
            "review_score": "1"
        },
        {
            "review_text": "GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Short, but sweet. The music in the game is superb, and so is the animation. The little yaps that the cubs make are adorable, and the game really connects you to them. A very basic game, but lovely none the less.",
            "review_score": "1"
        },
        {
            "review_text": "Very original and heartbreaking. Lasts a little more than 1 hour, but you'll want to play it again until you save all your cubs. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic! Bought at release, but haven't had the chance to finish it yet! I'm going to do it tomorrow now I've remembered! In the steam sale, so get it people!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics and sounds, but i would like a better save system, because i don't like start over again when i can't make it to each level",
            "review_score": "1"
        },
        {
            "review_text": "In this game, you play as a badger. Yes, a badger. And it is awesome. The graphics are stylized and strikingly beautiful, and the music is excellent, always fitting the mood and indicating different things going on (if a baby has just eaten, if a predator is nearby, and so on). You must care for your five little baby badgers, and if you don't, you WILL feel like a heartless monster. My only qualm with this game is that the camera will sometimes go through trees (though this never happened at any crucial moments), but otherwise this is an excellent short game.",
            "review_score": "1"
        },
        {
            "review_text": "Well that was emotional. This game really shows you what it would feel like to be a parent, and face the horrible idea that your spawn ARE very vulnerable. This is a game I will not forget, and despite it's short length/linearity ( It has quite a lengthy second game mode called 'Nurture') I completely reccomend it for it's unique visuals, and the overall experience that it will give you. Another great indie title :)",
            "review_score": "1"
        },
        {
            "review_text": "You are now a badger, You have to keep your cute babies alive and fed until they're all grown up and can fend for themselves.  Only about an hour long but it has another mode where you nurture badgers for as long as you can.",
            "review_score": "1"
        },
        {
            "review_text": "Named all of my babies...remembered there names...only Jeffrey lived ;~;",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. Great art. I wibbled a little.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty sick, ♥♥♥♥ed up some frogs and fed them to my kids.",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful!, you get so immersed, and its so exciting! Any one considering to buy this game, DEFINITELY SHOULD, although the game last about an 1 hour and a half- 2 hours, there is all ways nurture mode, where you can feed and protect your cubs- without an ending, as it is endless i think But this is my story Although the first time i died. Basically, i was very happy- i had got to the last section, with 4 of my badgers healthy and happy, their names were Oscar, Jerry, Sam and John- I lost Joe to the waves. So i was feeding and feeding and feeding them. Then i was crossing between these two ridges. But then i heard the eagle scream, and the music came on. I was paralyzed with fear, and then the eagle took John. All my happiness went instantly. I tried to run to the closest bush, when i looked behind me to see Oscar being taken. I was filled with shock and terror- everything had changed so quickly! Eventually i gained the courage to go back, i ran into a bush- and sure enough, the eagle was there. I then spent an odd 6 minutes to find where to go. Then the music stopped, the eagle went, i sighed a sigh of relief. Then the eagle was yet again there again- BUT THERE WERE NO BUSHES AROUND!!!!!!! You can see how this can get very exciting In went into i thin bush, the eagle was coming down and down, but i and my cubs were still alive. But a swoosh of an eagle pushed me out of the bush, then- CRUNCH- i was in the eagles arms. With mama dead, the little puny cubs had to defend themselves, i wonder what will happen to them. But the good news is that i can play stage 5 again, because a wonderful thing called save!",
            "review_score": "1"
        },
        {
            "review_text": "This is a hard game but you need to feed your babies so that they do not die.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game, Great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know what to expect when first playing this game but it turned out to be one of the most captivating experiences I've had in a long time. Really beautiful environment, creative art and unforgettable story.",
            "review_score": "1"
        },
        {
            "review_text": "I did enjoy this game the art style is gourgous and the the consept is nothing i have ever seen before it got me into panic evry few times about the hawk and the waves :( and sadly none of my babies survived I want Shelter 2 as i have seen many people play it and it looks like alot less danger awaits.  I hope that Shelter 2 makes it alot esier as in Shelter 1 there was only one path to go but i still loved it.  i noticed a couple bugs one including my camra pan being stupid and turning me around when i was attempting Nurture (i dont get how thats played though...) one of them as well being that when I tried to get away from the Hawk that last time when your babies enter the cave but you cant so you are etean by the hawk i got lost and my two remaining babies died but it still had me continue the game i wnet up the hill but th hawk wouldent follow... (i hope this is good for a review...)",
            "review_score": "1"
        },
        {
            "review_text": "When I first got this game, I had trouble running the thing! The graphics weren't loading on the title page, and once the game 'Started' I could hear background noises and the sounds of animal cries. Yet I couldn't see a thing! Just a white screen saying 'Loading'.  I posted on the forums, and got no response. I tried contacting the developers...again, no response. I eventually managed to get the game going, by heading to the games steam folder, and setting it's compatibility mode for Windows 98/me (for some reason). Then the game would run, but hang when you exited it..I fixed this by running shelter as admin.  Finally it all worked! So if you have similar problems, try that! Now, about the game!  This game is heavily stylized and while beautiful, can be hard to make things out since items and creatures are of abnormal shapes. Even when you can make out the item, it still might be difficult to find things(Say, a hopping frog) due to the fact that the colors used in the game are all so light, that it makes everything seem faded and washed out.  Other than that, playing as a mommy Honey Badgers leading her children through the treacherous wilds is incredibly enjoyable. The trouble getting the game running, was well worth the effort, and while the game is fantastic, it has HORRIBLE support.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't realise you could actually keep all of the babies alive, when one died I was like 'oh god! Oh well guess I can't change it' And I got to the end of the game alone, and was like 'that was sad' Looked online... now I feel like an awful hedgehog mother",
            "review_score": "1"
        },
        {
            "review_text": "OMG I said I would not get upset with this game lost 2 babies early game cause of hunger but what got me near to tears was my sacrafice at the end when the eagle takes you away but i am a proud that my last 3 babies got to safty love you all Spike,minx and scruff live your lifes and know i will always watch over your with your sisters chloe and fizz.   As a proud 18 year old male i am glad to say this is one of the best and most heart pounding games i have ever played and not ashamed to say I cried.   Now on to the 2nd game cant wait to cry more.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Overal, loved it. It is beautiful, casual and appropriately entertaining for its subject matter. I do have an issue with the beginning since directions could be better and I notice the colors tend to have a bleached quality about it (maybe that's just the style, I don't know). It may be good for children since it is simple to play and very pleasant. If you like animals and open worlds, I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I highly suggest you don't play if you cry easily. This is like the saddest game I've ever played. This game really gets you protective about your badger babies. Super emotional. 10/10 would bang",
            "review_score": "1"
        },
        {
            "review_text": "1. Boot up the game 2. Start new game 3. Play until one of your babies die 4. Rage quit 5. Cry over the loss of your child 6. Swear you'll never play the game again 7. Repeat",
            "review_score": "1"
        },
        {
            "review_text": "This game teaches people how to protect the others,epecially like a single parent. Pretty enjoyable atmosphere indeed.",
            "review_score": "1"
        },
        {
            "review_text": "This game teaches people how to protect the others,epecially like a single parent. Pretty enjoyable atmosphere indeed.",
            "review_score": "1"
        },
        {
            "review_text": "'Ha! This game is so easy' I said right before a ♥♥♥♥ing eagle stole one of my babies :(",
            "review_score": "1"
        },
        {
            "review_text": "I lost at least one pup to starvation, another to some rapids while I stood safely on a rock next to him, and a good two or three the hawk got. This game is essentially Child Neglet Simulator 2013! 5 out of 5 kids lost/dead, would totally let them all die again!",
            "review_score": "1"
        },
        {
            "review_text": "1 awesome hour of cuteness and emotions :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I got it on sale and highly recommend it. It has great visuals and music, and it really draws you in. I found myself devastated each time I lost a baby badger and got really invested in the game. It isn't very long (took me about 75 minutes to beat) but it's defintiely worth the it. There's also an extra game type called nurture that is also fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant game. Although short in play time, you become so emotionally invested in keeping your young alive it's probably a good thing, as one more level and I'd have gone bald from the stress. Beautiful graphics, nice simple game play and just enough strategy to keep it interesting. Although this game will cause more heartache than all your highschool girlfriends put together. Just sayin'",
            "review_score": "1"
        },
        {
            "review_text": "Shelter is a beautiful little game. The atmosphere is great and even though the concept might seem a bit simple, I really becoming more and more protective over my cubs as the game progressed and was very sad whenever I thought I lost one!  Pro's: - Beautiful atmosphere - Really immersive - The harshness and beauty of nature in one small package  Con's: - The start is a bit confusing - Sometimes a bit slow - Choosing which cub to give food is a bit akward controlswise  Final conclusion: It's short, It's immersive, it's good, play it!",
            "review_score": "1"
        },
        {
            "review_text": "It's emotional, man....               all my babies are dead...  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite short but it catched my heart &lt;3 beautiful game! I love it",
            "review_score": "1"
        },
        {
            "review_text": "Great short game. Wonderful blend of colors and shapes of the world that make this unique. Simple gameplay. The game is linear, but I'm not saying that as a negative. I saw Shelter 2 on sale, and figured I'd come check out Shelter 1 first. I'll probably check out Shelter 2 later on.",
            "review_score": "1"
        },
        {
            "review_text": "I WILL SEE YOU IN HELL BIRD",
            "review_score": "1"
        },
        {
            "review_text": "Makes you feel like a mother badger. That's all that really needs to be said for this game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would badger my friends to play this!  Shelter is a rather short game, with a cute story centering around just what nature is all about. The art and playstyle are very simple; there's nothing remotely difficult to this game, but every detail ties in to really invest your emotions into this badger family and everything they have to go through. Even the music is beautiful, giving just a small amount of unease to solidify that anything could happen during your trek through the forests.  There is also a 'Nurture' mode where you play for several minutes a day to feed and raise cubs, and the map size available to you gets bigger every few days. Just a cute little additional time-waster.",
            "review_score": "1"
        },
        {
            "review_text": "Designed as an experiment to see how far you can ramp up the gamma in the Unity engine, the scientifically accurate  Badger Simulator 2015  primarily serves to teach kids that badger cubs are omnivores that eat a grown cat's RDA every hour. In an epic play full of deep &amp; morally relevant messages about adolescence, parenthood and the circle of life (sans Elton John), you are assigned the part of Badger Mommy, genetically engineered not to need any food whatsoever herself, and you bid your time (your hour, to be precise) babysitting your most adorable [citation needed] kids along a reasonably linear path of invisible boundaries, not passing go or collecting $200 until the game eventually runs out of scripted encounters. In the meantime, this corridor shooter without any shooting will hurl tons (I measured!) of emotionally charged music out of your speakers. Functionally it's a bit like a third person Lemmings game with the Lemmings following you 95% of the time, furthermore devoid of the various joyful abilities proper Lemmings have. Worth the purchase (or the effort of playing) only for the peculiarly jolly Predator-esque airborne takedowns Badger Mommy can perform on the various hostile mobs inhabiting Gammaland.  Length: 1 hour Evils: Unity; scripted as much as any CoD campaign; omniscient bird AI; bugs Replayability: You can hypothetically strive for a perfect playthrough. Depends on how often you'd like to endure 'dat gamma'.",
            "review_score": "-1"
        },
        {
            "review_text": "Well i saw the game and wanted it so i got it... but no just cant recomend this game   8.99 euro is way to much for the game its to short adn gets boring fast. I get that the game is about apreciating the art work and everything but just no if it was 1 euro i would recomend it.  So the game is about you being a Mom Badger that has to protect your children aswell feed them. This is the part that really made me want the game.  The game is interesting and gives you different challenges which is nice and the art work is well a bit edgy but still nice however what makes not recomend this game is the price point aswell that the game is so short and its actually trying to drag itself out. The world is pretty empty you are the predetor hunting frogs, foxes and rats. while there is a predetor far superior to you... the eagle. They could have added rabbits, bears maybe even hunters to make it more interesting and have more content but no. So the game is way to empty and to short for me to recomend it at that price point, there are far better indie games for that price as well cheaper  You can go out and play Free Games that a browser based that got way more content and will take more time to complete compared to this.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this game. I really did. But I think it's really terrible. The gameplay mechanics are minimal, you are mostly just playing four-legged walking/running simulator. The art style is garish and incredible desaturated to the point where I can't tell what the heck is going on. It was painstakingly slow waiting for my little badger to run to the next area. There was one point where it seemed clear I needed to run into a little cave but the game forced my badger to turn around and not go in. No explanation. I hate that kind of crap in games. This game doesn't respect my time at all. I know it's trying to be all artsy and get across some kind of emotional message, but for me I was so annoyed with the bad gameplay there was no chance to make any sort of connection. It is a cute idea, and the little badgers are cute, but this just seems like lazy and terrible execution on that idea. I'm sad because I can tell a lot of people love this game, but I just don't get it. Sorry!",
            "review_score": "-1"
        },
        {
            "review_text": "While I did enjoy the story and the graphics were very very interesting and amazing (in their own artistic way)... there wasn't much to the game. It felt a bit misleading to what the game would be about.... which really is walking through enviroments trying to keep your babies alive... only to be met with your own fate at the end... yeah.. spoiler... but you might as well know it now before buying this game.  I did enjoy it... and would recommend people to play it, but I wouldn't recommend it for anything more than Free to Play (or when it's on sale... as it is as of this review).  There's just about 0 replayability to the game, and while that's not /terrible/ .... it certainly isn't worth very much to buy a game that takes, for me, just over an hour to play, only to be met with nothing different on another iteration of the game.   I commend the developers, ten-fold, for the game, as it really does have a high sense of artistic creativity stuffed in such a quick game, but must ask that in future updates, possibly have more of a RND aspect to the events therein. At least some new aspects or areas... or expand the game a littlle more than it's at.  Otherwise... there's 0 gripes about this fabulous work of artistry!",
            "review_score": "-1"
        },
        {
            "review_text": "Let's start off by saying that I'm a big fan of the casual indie genre. I'm not sure how this game managed to not get a casual tag, but it definitely deserves one. You're literally just walking around a forest as a badger with little badger pups. Not a whole lot else going on.",
            "review_score": "-1"
        },
        {
            "review_text": "The art and music are nice but the gameplay is boring. Fortunately it's also very short. Don't pay more then a cople of euros for this.",
            "review_score": "-1"
        },
        {
            "review_text": "Right so i have been utterly dying to play Shelter 2 for ages as it looks awesome, but i am far too tight to pay the full price so i have been waiting for it to go on sale. It hasn't yet, but this one did today and while i am not as interested in Badgers as a Lynx, i coughed up the money and bought it.  And i actually regret it.... It wasn't a bad game by any means, it was just not a lot of game for my money, even at half price.   There is very little in the way of a tutorial and the beginning of the game was rather confusing, as half the time it doesn't tell you what to do. But i started with five lovely cubs- after eventually figuring out that i had to feed one of them at the start to carry on in the game. And to start with it's a nice game. Feeding five cubs is actually rather demanding and i searched for food all the time. Though catching the Foxes is really hard. I only caught one and i never caught a frog at all. xD And keeping your cubs safe from the evil birds and wolves was quite fun and challenging, on my first play through.   I lost four and only managed to get one to the end. :( And the ending, wow. Not what i was expecting at all and personally i don't like it. But for £3 something this game doesn't have a lot in it and for full price it's certainly not worth it. 1) You pretty much just walk in a predetermined direction, while picking up food and feeding your cubs, while trying (and failing) to avoid getting them killed. 2) And there are only 5 levels, which took me just over an hour to get through and that's with replaying the last one. 3) It does have some replay value, as i will try and get all five cubs to the end, but once i have done that, it will probably just sit in my library gathering dust.  Which is unfortunate really, as this game could be much more. There are not nearly enough animal simulation games out there.   So in the end, it's not a bad game and i was rather gutted when i lost each one of my cubs, it's just not much of a game and i would therefore sorta recommend it, but only at half price or more preferably. (I will put not recommended though, as i just think it's too expensive for what it is.)",
            "review_score": "-1"
        },
        {
            "review_text": "Shelter is a game where you are a momma badger in an adventure with your five lil badgers through the seasons of the year in the woods. You'll probably end up with just one surviving them all, though. Even though the aesthetic is beautiful, the gameplay itself is pretty tame. I missed some kind of inventory or maybe a health bar for the little badgers. Also, the camera was a bit messy sometimes.  If I were a badger, I'd rather have no children.",
            "review_score": "-1"
        },
        {
            "review_text": "The look is very cool and the music sets a beautiful atmosphere... but the game is boring, really boring. I tried the first two levels and there was nothing challinging about them, so I got tired pretty quickly.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is agony. Just agony. Don't do this to yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved the concept, the game play had some potentials, so does the music and art, but sadly, all poorly executed. It almost felt like the team lacks strong direction and the whole game just got wrapped up and pushed out. I wouldn't recommend it unless it's on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Shelter has some great ideas and a different look, but the pieces never really come together. The gameplay is obscured (purposely) to a fault and just comes across feeling amateurish. The sense of loss it tries to put on the player is lost because the core gameplay is frustrating.  While the art style is different, it also simply doesn’t look to pretty when playing it. It bought this game based on the graphics, but was disappointed when I actually played it.",
            "review_score": "-1"
        },
        {
            "review_text": "NOTE: I actually do recommend this game, if you're a fan of SHORT, indie, minimalist games. I value my experience at about $1, and I wouldn't recommend paying more than that. I finished the game in just under an hour.  Shelter was short so I'll try to be too. You're a parent badger and you need to get your 5 cubs to safety. You will forage for food and avoid predators and other dangers along the way. How many babies can you get to the finish? Shelter has a low-poly minimalist style, and I think this is a detriment to the game. What is food doing? Does it help? How much? How urgent is it versus rushing past everything? The game didn't communicate this. The game occurs over 4 medium-ish sized levels.  With so little to talk about, because there's so little to the game, I was expecting more emotion in the experience, and it didn't really do it for me. Moral of the story: Nature is harsh, so pump out those babies, everyone!",
            "review_score": "-1"
        },
        {
            "review_text": "If you like walking simulator, escort missions and polygonal badgers, this is probably the game for you. Personally I wouldn't pay more than a dollar for it, the only things I enjoyed were the music and astethic of the game, in that regard it's very well done. I couldn't connect with the badger kids at all though and I usually have no problems being empathetic towards polygons..",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a game. It's either an 'Art' or 1 hour technical demo. Both ways - it's bad.",
            "review_score": "-1"
        },
        {
            "review_text": "very strange, your a banger, and you walk around the forest while your babies get killed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game only has a sad ending and no good ending is possible. Was really hoping that it would have a happy ending and cannot reccomend this game until it does.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed Shelter for what it was; A casual survival game with a message about life to convey. However, I cannot commend it for the story alone. Clocking it at almost exactly 45 minutes, Shelter is remarkably short. Despite the game being so short, it introduces a lot of gameplay variations, only to discard each one. By the middle of the game, I had forgotten to butt trees for apples because there were so many ways to gather food. Survival is hardly a struggle, just a happening in this game. Fun mechanics, like the night level and river crossing, were discarded not 15 minutes after they were introduced. The final level introduces nothing new, just the same easy Hawk-dodge mechanic from early in the game. The game is also stuck between the 'do-it-yourself' school of gaming and the 'please-hold-my-hand' brand of tutorial-based gameplay. (The only challenge in the game is figuring out how to feed your baby in your den. Everything else is given an instructional pop-up lesson.) A fine message and an interesting artstyle, not worth the price of admission.",
            "review_score": "-1"
        },
        {
            "review_text": "In Shelter you embrace the role of a mother badger protecting her kids. The game has an amazing concept, where you grow an emotional attachment to your children. It also has a unique art style and a joyous soundtrack to listen to. Despite all of this, Shelter can not execute well due to the repetition of the gameplay. You are stuck doing the repeating the same tasks while going through various perils through different stages. The only other fault is the length, it is around an hour in length and in my opinion not worth the $10. Even though Shelter has a great concept, it can not execute it well enough, 65/100 at most.",
            "review_score": "-1"
        },
        {
            "review_text": "Game does not work, it hangs on white screen on loadup.... not impressed",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like this game anymore. I got to the end and wished I hadn't played. They took my boy.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game and It just doesnt work... Can't get pass the ESRB rating. Stuck in a white screen. Please refund... Dont buy if you have a mac.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool art, but really the game wasn't fun. I never felt like it was one of the better games I could pick up, so I rarely did.  I would think that maybe the game would be fun if it were advertised as a shorter game. I found myself waiting for my pups to catch up, even though I knew they were safe which really killed the pacing of the game. I didn't find myself caring about the pups because I was just picking up every onion or whatever up.  We'll see if I start it up again another time.",
            "review_score": "-1"
        },
        {
            "review_text": "I do like the artstyle that game delivers, it's the style I love.   However, this game has failed to deliver good game experience as controls aren't really fluid, gameplay is very short (1 hour). Game could've been good with mod support and whatnot, currently it's not worthy much paying for.",
            "review_score": "-1"
        },
        {
            "review_text": "Ah man I guess this is not for me. I'm approaching an hour and I'm still not enjoying it and I got to pretty big area where the run button is disabled for some reason. Too bad. The critters are cute but I don't have the patience to save them.",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't costs it money. It's too short and primitive. It more seems to a demo than normal game.",
            "review_score": "-1"
        }
    ]
}