{
    "app_id": 244850,
    "name": "Space Engineers",
    "release_date": "2019-02-28",
    "developer": [
        "Keen Software House"
    ],
    "publisher": [
        "Keen Software House"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Steam Achievements",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Space",
        "Sandbox",
        "Building"
    ],
    "achievements": 27,
    "positive_ratings": 60221,
    "negative_ratings": 9609,
    "price": 15.49,
    "description": "Space Engineers is a sandbox game about engineering, construction, exploration and survival in space and on planets. Players build space ships, space stations, planetary outposts of various sizes and uses, pilot ships and travel through space to explore planets and gather resources to survive.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/244850/header.jpg?t=1555574351",
    "minimum_requirements": "OS: Microsoft Windows 7 (latest SP) 64-bit Processor: Intel i5 @ 3.0 GHz or higher (or AMD equivalent) Memory: 8 GB RAM Graphics: Geforce 750/Radeon R9 270X or higher DirectX: Version 11 Storage: 25 GB available space Sound Card: DirectX® compatible on-board Additional Notes: No internet connection needed for single player, but for multiplayer we recommend 5Mbit/s or more",
    "recommended_requirements": "OS: Microsoft Windows 7 (latest SP) 64-bit Processor: Intel Quad Core i7 @ 4.5 GHz or higher (or AMD equivalent) Memory: 16 GB RAM Graphics: Geforce 1070 GTX / Radeon RX Vega 56 or higher DirectX: Version 11 Storage: 25 GB available space Sound Card: DirectX® compatible on-board Additional Notes: No internet connection needed for single player, but for multiplayer we recommend 5Mbit/s or more",
    "reviews": [
        {
            "review_text": "This game is a good space sandbox game. I recommend trying it.",
            "review_score": "1"
        },
        {
            "review_text": "Whilst this is in an alpha state it is a very promising game the engine works well on my build   i5 4670 3.4ghz  8Gb 1600mhz Kingston Blue EVGA 560 GTX SC 1gb 500gb Western digital 7200rpm cavlier blue ",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game, Developers listen to the game comunity and are making they game the way the comunity wants it, it is by far the best early access game i have ever played or bought. You guys are an amzing team!",
            "review_score": "1"
        },
        {
            "review_text": "So, you're in Spess. And you're not a Mehreen. So. It's alright.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has serious potential to be as good as Minecraft. Like Minecraft it requires time and patience to get anything out of it. It has a steep learning curve and it could do with more help on how to make things. As this is still an Alpha phase project at the moment, I hope the developers will look at the comments and address them.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic fun , great gameplay for a game still being developed worth the money , controls need to get used to but overall very solid game well worth buying and playing",
            "review_score": "1"
        },
        {
            "review_text": "Best idea ever. Can't wait for this to be finished.",
            "review_score": "1"
        },
        {
            "review_text": "It's space minecraft - only better! buy this game on sight!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent space simulator game and getting better every week. highly recommended for anyone who likes to design and build",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! It is like Minecraft and Space combined.",
            "review_score": "1"
        },
        {
            "review_text": "I've only been playing this game a short while. What I do know is that this game shows great potential. It is still in development and hopefully future updates will be plentiful.",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing game; harvest mionerals, process them, turn them into construction materials tehn build anything you want and cause havoc with it. I've turned my rescue ship into a pirate Sloop, complete with extra armor and rocket launchers",
            "review_score": "1"
        },
        {
            "review_text": "why are you reding this play the god damm game",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Constant updates and its fun...",
            "review_score": "1"
        },
        {
            "review_text": "Fan of Austin Powers movies. Built a space johnson.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing game; harvest mionerals, process them, turn them into construction materials tehn build anything you want and cause havoc with it. I've turned my rescue ship into a pirate Sloop, complete with extra armor and rocket launchers",
            "review_score": "1"
        },
        {
            "review_text": "It's space minecraft - only better! buy this game on sight!",
            "review_score": "1"
        }
    ]
}