{
    "app_id": 24480,
    "name": "King Arthur II: The Role-Playing Wargame",
    "release_date": "2012-01-27",
    "developer": [
        "NeocoreGames"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "RTS"
    ],
    "achievements": 23,
    "positive_ratings": 188,
    "negative_ratings": 169,
    "price": 7.99,
    "description": "Experience the sequel to the Role-playing Real Time Strategy Hit!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/24480/header.jpg?t=1545355535",
    "minimum_requirements": "OS: Windows XP with SP3; Windows Vista with SP2; Windows 7 Processor: Intel Core 2 Duo (2 GHz) or equivalent AMD CPU Memory: 1.5 GB RAM (XP) or 2 GB RAM (Vista, Win7) Hard Disk Space: 16 GB Video Card: ATI 3850 512MB; Nvidia 8800GT 512MB DirectX®: 9.0c or higher Sound: DirectX 9c compliant sound card Additional: Nvidia (AGEIA) PhysX",
    "recommended_requirements": "OS: Windows Vista with SP2; Windows 7 Processor: Intel Core 2 Quad 2.4 GHz or equivalent AMD CPU Memory: 2 GB RAM Hard Disk Space: 16 GB Video Card: ATI 5850 or greater; Nvidia 460 or greater DirectX®: 10 Sound: DirectX 9c compliant sound card Additional: Nvidia (AGEIA) PhysX",
    "reviews": [
        {
            "review_text": "This is a pretty cool game. The game could have been very enjoyable if the devs decided to actually polish it and fix the thousands of issues that will cause the game to crash for absolutely no reason. It's unplayable, my loading screens give me an error for no reason, whether its after a battle or after trying to load a save it will crash whenever it feels like it. Even moving units makes it spazz out and crash. Im glad i got this for only 6 bucks. I don't know who in their right mind would charge 40 dollars for an unfinished beta of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "An intresting game, I personally like the first one better in the army mechanics and how you ran your lands, but the story in king arthur 2 is an intresting enough for a play though. I think the magic works better than in the KA1 and it pretty epic to watch a whole group of spearmen get taken out by a lighting bolt. So if you see it on sale pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "First off, I haven't had any issues with the game crashing, not loading, etc. From what I can tell from other reviews, this game plays similar to the Total Wars series. I can't say since I haven't played them before, but I have played the first King Arthur. This game plays similarly to the first game with a few exceptions. The developpers have tried to make a few balance changes from things that generally seem overpowered in the first game; namely magic, cavalry, and archers. There's now a magic shield that helps prevent your units from getting completely mashed before they even make contact with the other team, along with cast times for most spells. Cavalry now actually gets mashed by spearmen instead of the other way around, but they still pretty much trample everything else. Archers have a much lower starting accuracy, and you can't get skills to prevent decrease in shooting distance to take advantage of combinations such as Storm of Avalon to counter cavalry. Of course, by the end of the campaign, all of these points are moot anyway because units level up to 15 and destroy pretty much everything regardless.  The campaign has an interesting story, but runs into the same issues of the first game after a while. Namely that auto-batlle becomes an extremely appealing option regardless if it causes more casualties to prevent the tedium of fighting the same battle over and over again. This is especially an issue since you can only have 3 armies by the end of the campaign, thus giving you little room to vary your tactics.  All in all, it's a fun game, especially for the price during sales. I enjoyed the story and the puzzles in the campaign, but should probably have stretched out the game a bit more so battles didn't become a chore.",
            "review_score": "1"
        },
        {
            "review_text": "I like the idea but this game feels more like an unfinished work in progress than a polished product.  ",
            "review_score": "-1"
        },
        {
            "review_text": "The first game was refreshing, it had a few minor flaws but overal was a great game that was deep and inventive. I'm sure this game will be no different, so if you like the Total War series but with magic and dark fantasy RPG elements aswel as RTS style gameplay then get this!!",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, there were too many bugs for me to enjoy King Arthur 2.  I really liked the presentation. (The artwork was outstanding. Really, very fun.)  I really liked the idea of playing in this magical, medieval world.  I liked most of the combat.  I didn't like how the cities were managed, but I dealt with that.  I didn't like how I could only control one or two armies (maybe later there will be more, I don't know), but I suffered through that.  I didn't like how players were herded towards attacking certain territories instead of where they wanted, but I went along with it, because I knew the developers were trying to tell a linear story.  However, the few quest-breaking bugs (such as the game sometimes being unable to handle it when the AI attacks you two times in a row during the same turn), a few poor design decisions (such as allowing heavy cavalry to charge in dense forest during combat phases), and random crashes destroyed the experience for me.  I tried. I played for nearly forty hours and got to the point in the story where Arthur is closing the Roman gates.  But, after refighting one of those 'invincible' armies and having the game bug on me, because I didn't close a window in time for the AI to attack my other army... nope, done.  If the next game can get rid of these issues, I'm sure I'll buy it, but I'm done with this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a joke. Intel i5, 8GRAM, gtx970 and it dasn't work well even if I changed graphic to low. Dont waste your money for crap like this.",
            "review_score": "-1"
        },
        {
            "review_text": "Loading Simulator 2012, lol.  The Prologue took me 7 hours to get through. Game runs smoothly enough, but it seems bogged down with all the exposition. It acutally feels more like a superb, fantastical Total War mod than a separate game.  Love the character models, okay soundtrack, impressive visuals, solid combat, and enthralling storytelling (you can tell the voice actors really got into it, haha). There's enough good here to warrant examining. Wishlist it till a sale comes up.  7.25/10",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game, but it crashes far too much for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried to start on few occasions. Can't get past the intro loading screen. on 2 different PCs. Save your money for something that actually works.",
            "review_score": "-1"
        },
        {
            "review_text": "this game simply refuses to play, DO NOT BUY THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't quite sure what it is. RPG and wargame... It tries to be similar to the Total War franchise in regards to its combat. Unfortunately, a number of the units are unbalanced, and so the combat can take a lot longer than it should. It adds spells, which I found to be an annoyance, as my archers were always literal lightning rods. The overarching strategy seemed deficient as well, as there aren't many ways to get gold so tech, infrastructure and army all suffer. It also limits the number of armies that you can have roaming around, so wandering armies just take over buildings of mine, which admittedly didn't seem to affect me at all. As far as the RPG factor goes, it again struggles. For some reason the player is fighting Irish demons. You don't get to see or use King Arthur, and end up killing multiple knights of the round table. Other knights don't even appear, which would be understandable for most, but they cut out Gawain, and left in Agravain? A lot of the leveling really didn't feel like it mattered for heroes. Overall, depending on what you want there are games which do what this game does, only much better. I can't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like fantasy games and or RTS games this could be the perfect game for you",
            "review_score": "1"
        },
        {
            "review_text": "not a good games",
            "review_score": "-1"
        },
        {
            "review_text": "EWWW, ♥♥♥♥♥ pls!!!!  Seriously, this game sucks Aruthur's balls big time. Now, I have to study hard to get good grades to cover mah pocket money that I foolishly spent on this Role Playing ♥♥♥♥♥ game &gt;.&gt; The camera view is almost as whacky as the gameplay &lt;boohoo&gt; Neocore needs to realize that they should rather release this junk as expansion for the first game.  'King Arthur II commence avec sa propre terrible histoire ... pour moi aussi' ♥♥♥♥♥ ",
            "review_score": "1"
        },
        {
            "review_text": "I like the video graphics here and the background music",
            "review_score": "1"
        },
        {
            "review_text": "At the strategy level the game is interesting but, compared to games like the Total war series, the tactical battle are much less controllable and funny",
            "review_score": "-1"
        },
        {
            "review_text": "Game never worked, and is now the only reason why I will never buy game bundles from Bundlestars.  Seriously, it's ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "one of life's biggest disappointments",
            "review_score": "1"
        }
    ]
}