{
    "app_id": 244870,
    "name": "Electronic Super Joy",
    "release_date": "2013-08-23",
    "developer": [
        "Michael Todd Games"
    ],
    "publisher": [
        "Michael Todd Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Indie",
        "Great Soundtrack"
    ],
    "achievements": 37,
    "positive_ratings": 3032,
    "negative_ratings": 306,
    "price": 5.49,
    "description": "Electronic Super Joy is a brutally hard platformer set in a world of pulse-pounding electronic music. Run, jump, smash &amp; fly your way through 45+ weird &amp; different levels, with low-gravity, world rotation, giant monsters &amp; swarming missiles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/244870/header.jpg?t=1504456548",
    "minimum_requirements": "OS: Windows XP Processor: Intel Dual Core or Equivalent Memory: 1 GB RAM Graphics: DirectX 9 compatible video card DirectX: Version 9.0 Storage: 375 MB available space Sound Card: On-board sound",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Dual Core or Equivalent Memory: 3 GB RAM Graphics: DirectX 9 compatible video card DirectX: Version 9.0 Storage: 375 MB available space Sound Card: On-board sound",
    "reviews": [
        {
            "review_text": "My mom thought I was watching porn one night when I was playing this game. Now I can watch porn and tell her its the game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i just killed the pope in a spaceship with dubstep and pretty lights.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly difficult game Awesome soundtrack Insanely addicting",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy is a 2D Platformer that centers around challenging microstages while listening to amazing electronic-themed music.  The story is about a lone, wandering hero who's fought in many battles and wars, losing many limbs including, most importantly, his butt. This entire journey is to find and defeat the one that took his butt. The story is really simple, and is told through quick dialog that's thrown out to you as you go through the level. It doesn't take itself seriously, it's very silly, and you'll get some laughs out of it.  Gameplay is very addictive. It mostly involves around precision platforming, an endurance race outrunning the screen while dodging obstacles, or surviving an onslaught of missles which you need to get rid of. There are 5 worlds with 20 stages each, lasting any time from 10 seconds to a couple minutes; with the exception of World 4). It sounds short, but it's a hard game. A very hard game, later on. You need to bring your platforming A-Game if you want to survive the difficulty it brings.You can think of it as Super Meat Boy, but a little less extreme. As you can tell, this game would be ideal for platforming lovers and gamers who love a good challenge, and I'm both of those. Achievements further reward your skills with painful goals such as earning zero deaths on each level, or beating all the time trials. If you love challenge, and want to be tested, this is for you. For other game modes, there's Infinite Love Mode, where you try and go through as many microstages as you can in a row before you fail. There's also No Checkpoint Mode for the most hardcore players out there.  The soundtrack is one of the highlights that everyone keeps talking about, and rightfully so. The game offers many tracks to keep your spirits high and your ears a lovely taste of music with each step. For most people, it's what keeps them going, and offers motivation to move on to continually hear the amazing beats this game pulls out. I suggest you find the soundtrack when you can.  Overall, Electronic Super Joy is a fantastic difficult platformer with stellar music and a hearty challenge that platforming enthusiasts would surely love, and achievement hunters will get a run for their money.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game but it gets pretty hard at times because of multiple rockets launching at you . You also get a lot of frustration when you fall to your death but it makes you motivated to reach a flag and then the end of it . The music is pretty good especially when you reach a flag , then you hear the ' ♥♥♥♥♥♥ ' sounds which is the best part ( jokes ) . Overall , it's really worth the money , and frustration",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to kill the Pope whilst jamming to sensational music alongside the calming sounds of manly grunting and feminine moans? Well have I got the game for you! Electronic Super Joy is infuriatingly difficult, but never takes itself too seriously with it's over the top story. Rhymically mesmerizing visuals match to the beat of the pneunomenal soundtrack of which is one of the best since Pepsi Man.  Not once was I cheated by the level design, all are fair and with enough tries are completely possible to beat. The game is relatively short in retrospect, however the high difficulty is likely to add several hours to your total playtime. Be warned the game is difficult and as such it's recommended more for hardcore platformer players. Also take note that the visuals may cause motion sickness.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to kill the Pope whilst jamming to sensational music alongside the calming sounds of manly grunting and feminine moans? Well have I got the game for you! Electronic Super Joy is infuriatingly difficult, but never takes itself too seriously with it's over the top story. Rhymically mesmerizing visuals match to the beat of the pneunomenal soundtrack of which is one of the best since Pepsi Man.  Not once was I cheated by the level design, all are fair and with enough tries are completely possible to beat. The game is relatively short in retrospect, however the high difficulty is likely to add several hours to your total playtime. Be warned the game is difficult and as such it's recommended more for hardcore platformer players. Also take note that the visuals may cause motion sickness.",
            "review_score": "1"
        },
        {
            "review_text": "Game full of Challenges. Great precission Plattformer Game. Its about timing jumps and smashs :) Not so easy- Not so hard -funny game.",
            "review_score": "1"
        },
        {
            "review_text": "I think the only thing keeping me from punching my monitor is the music.",
            "review_score": "1"
        },
        {
            "review_text": "gut but some levels are too easy/too hard especially second world boss (imo)  dont buy for full price",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Electronic Super Joy: Impressions&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This game is a 9/10 for me. The music is awesome and the gameplay is insanely hard. The sound effects used for the little aspects of the game are perfect and often hilarious. You will love and hate this game at the same time. Must buy at such a low price.",
            "review_score": "1"
        },
        {
            "review_text": "Deceptively hard platformer with an amazing soundtrack and graphics that make you feel like you're in a rave. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome music in the background. The controls are a bit odd, but you will get used to it.",
            "review_score": "1"
        },
        {
            "review_text": "It's really, REALLY hard, really, REALLY fun, and the amazing music stops you from ragequitting (too often). Thank you, Michael Todd, and thank you, EnV.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me hate my friends, family, and the human race as a whole 10/10 I miss my loved ones",
            "review_score": "1"
        },
        {
            "review_text": "I can very well say its a good and fun game but its hard. REALLY HARD. I have found myself spending hours on one level but the soundtrack is one of the best I have ever found. with that being said I caught myself having trouble with anything regarding missiles. you can kill them but there are always to many of them that trying WILL get you killed. The bosses are really fun and the jokes are good as well. So if your looking for a hard game, you found it but as i have said, its hard and that makes some people not like it. All and all I give this game an 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy brings you back to what it means to be a platformer. You are constantly moving, constantly calculating in your head, and if your timing isn't just perfect you won't get there. It’s so satisfyingly frustrating that it leaves a smile on my face every time I instinctively mash the button to respawn. Because once you figure out the precise choreography and you get your mind to match your fingers and send your impulses through the keys it runs like a machine and it is everlastingly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Funky music,challenging levels,bonus levels..etc",
            "review_score": "1"
        },
        {
            "review_text": "I still haven't forgiven the devs about that star in 'Hell Club'. And I probably never will.",
            "review_score": "1"
        },
        {
            "review_text": "Rob Mayth: The Game",
            "review_score": "1"
        },
        {
            "review_text": "A fun fast paced game with an awesome soundtrack!  Have found some of the soundstrack though is just edits of the old 'Impossible Game' By FlukeDude  7/10",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly hard platformer with an equally amazing soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy is pleasing to the eyes and the ears but not so pleasing on the fingers after you've smashed the respawn key 300M+ times to save yourself that extra second or two once you've missed a jump or fell behind in an auto-scroll level.  Only downside is having to keep the volume low what with the checkpoints having a loud ♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "hardest game eva,but full of joy :D",
            "review_score": "1"
        },
        {
            "review_text": "With a warning list that long, you know it's going to be good. Addictive, catchy, challenging and fun.",
            "review_score": "1"
        },
        {
            "review_text": "I WAS NOT READY FOR THIS!",
            "review_score": "1"
        },
        {
            "review_text": "So far what I have seen. It is awesome it is just like super meat boy, but not as slippery of controls",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy is a great example of how two things that are great apart might not be the best together. While I enjoy the game and would definitely recommend it to others; I noticed a trend in that the music and gameplay would be disjointed. I would oft find myself sitting somewhere listening to the frenetic music pounding away while I was waiting for the screen to catch up. Similar scenarios presented themselves throughout my experience shattering the fast paced conglomeration I was revelling in.  All things included I found Electronic Super Joy to be a fun, yet strikingly difficult, experience that fell short in combining the soundtrack with the gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "5 stars, p1ssed me off.",
            "review_score": "1"
        },
        {
            "review_text": "  Described as 'The Unholy merging of Super Meat Boy &amp; Super Hexagon!'    That quote tells you all you need to know about this game.   Do you like a good soundtrack with a healthy dose of anger, sweat, screaming, tears, an epileptic fit, a possible ♥♥♥♥ing heart attack, and maybe even a broken keyboard from typing out a review while still incredibly angry? These are thing to expect from this bloody game.",
            "review_score": "1"
        },
        {
            "review_text": "Likely to be the best Platformer out there. The game has a great soundtrack, that carries you further even if you've died the 70th time. Its hard as hell at some points but always fair, so you wont rage quit. The humor in this is great, it challenges you, its fun... you really should get this as fast as you can! ",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing and tranquil, are NOT the appropriate words to describe this hectic platformer filled with an oddly creative idiosyncratic art style for maximum aesthetic feels. (srs)  This game has had me hooked by the first couple levels, which drastically get harder and harder..and harder.  If you're looking for a trippy challenging game with an amazing soundtrack, THIS IS THE ONE FOR YOU.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ridiculously fun in a I want to kill myself while playing it sort of way",
            "review_score": "1"
        },
        {
            "review_text": "Get high. Play this game. Enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine if Super Meat Boy and Hotline Miami ♥♥♥♥ed in a back-alley behind a shady bar. Electronic Super Joy is the surprisingly good game that would result.",
            "review_score": "1"
        },
        {
            "review_text": "This is crazy as ♥♥♥♥ I don't even know what to say.",
            "review_score": "1"
        },
        {
            "review_text": "       Electronic Super Joy - Gameplay Commentary (NO RAGE!) HD Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Really fun if you like indie platform games and electro music. If you don't like one or the other or both, this game would make you lose your sanity ",
            "review_score": "1"
        },
        {
            "review_text": "BY FAR the best soundtrack in any game EVER!",
            "review_score": "1"
        },
        {
            "review_text": "OMG I love tis game so much! Definitely worth buying if you have not already. OOOOH YEEEAH!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun if you like indie platform games and electro music. If you don't like one or the other or both, this game would make you lose your sanity ",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I saw this game at a convention, and I have to say, it is good. The game runs super smooth, and it is sucessful at getting me frusterated :P. The only problem that I have with it is the music. The music is great, and I love it, but it doesn't help out with the actual gameplay, it's just distracting. If the beat of the music could somehow work along with the game, the overall quality would be outstanding. That's all, and this game definatly deserves to be priced higher than what it is now!",
            "review_score": "1"
        },
        {
            "review_text": "If Super Meat Boy and I Wanna Be the Guy had a child infused with electronic music, this would be it.",
            "review_score": "1"
        },
        {
            "review_text": "Its a nice hardcore platformer!",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy is a pretty simple game. You run and jump, avoiding missiles, lasers, and frogs that spit shurikens. You can also cancel out of a jump and instantly slam down towards the ground, which is a mechanic so simple I'm kind of shocked I haven't seen it before, and it feels great to use here. What makes the game really stand out though are the extremely stylized visuals, relentless techno soundtrack, and really tight controls, Electronic Super Joy is a really fun, if a bit too brief, challenging platforming experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game has moaning girls. What else do you want?",
            "review_score": "1"
        },
        {
            "review_text": "if you thought Super Meat Boy was easy.. Electronic Super Joy is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Game made me rage quit, cry, break things, rip my hair out and yell countlessly at the Pope and my computer screen Best game I have ever bought - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game, this soundtrack, yesssssssss.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy Indie games you won't go wrong with this, It's enjoyable. But it will leave you frustrated just like Super Meat Boy if you keep failing. Also, the soundtrack is fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and stressful game. Decent music (this is coming from a guy who hates electronic music) and quick responsive controls.",
            "review_score": "1"
        },
        {
            "review_text": "This game, THIS ♥♥♥♥ING GAME. Its so damn good. Platforming bliss. If you like Super Meat Boy or VVVVVV you will enjoy this.  Soundtrack is so good. Contender for soundtrack of the year? I think so.  The only things I don't like about this game is that most of the levels are auto scrollers and the fact you can't see ♥♥♥♥ing missles that are below you, so you could die at any given moment if you don't know where the ♥♥♥♥ing missles are. I mean come on. Thats bloody cheap.",
            "review_score": "1"
        },
        {
            "review_text": "A game with electronic music; who can ask for anymore from an indie game. I wish there was one with all dubstep....",
            "review_score": "1"
        },
        {
            "review_text": "Sex &amp; Electronic Dance Music. That's what this game is about. The platforming is there to serve as a distraction. No complaints here.",
            "review_score": "1"
        },
        {
            "review_text": "The f*ck is this?",
            "review_score": "1"
        },
        {
            "review_text": "If you like Techno and absurd platforming, this is the game for you. Imagine Super Meat Boy just dropped acid and ecstasy with the Mario Brothers and you get this game.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute joy to play, if I was to sum it up in one word that word would be 'Marvellous' A must for fans of platformers",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly difficult, and I reccomend it for fans of challenging platformers. However, take solace in the knowledge that the longer you are stuck on a difficult level; it just means you get to spend more time rocking out to the amazing soundtrack which fuels your jump-lust.   Probably the most simplistic yet gratifying and, most importantly, fun experience I have had with a video game in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "As an electronic music artist and fan, this game probably has the greatest soundtrack ever.",
            "review_score": "1"
        },
        {
            "review_text": "  I didn't get this game...    but the pope made me lose my virginity.  (he ♥♥♥♥ed me up)",
            "review_score": "1"
        },
        {
            "review_text": "Sexual noises and funky music. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "2 words : sexual content",
            "review_score": "1"
        },
        {
            "review_text": "Great game! But uninstalling after 100+ tries at level 9 'Slow Dance'",
            "review_score": "1"
        },
        {
            "review_text": "You fight the pope in a spaceship, shooting rainbow rockets while blasting techno music. Among other things...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "frustrating to no end but damn it feels good when you finally get passeed that one irritating lvl  plus buy the soundtrack its fooking epic",
            "review_score": "1"
        },
        {
            "review_text": "very intense, great music that i listen to out of the game, great humour, nice level design wiht the right amoutn of rage",
            "review_score": "1"
        },
        {
            "review_text": "Great in every aspect. Music, humor, gameplay, level design, visuals and mechanics. It's all great.",
            "review_score": "1"
        },
        {
            "review_text": "A true masterpiece in both platforming and music. Electronic Super Joy is one of those games that you can casually rage at, yet still have a great time playing nonetheless. Among the other pixelated platformers out there, I rank this wonderful game in my Top 3.",
            "review_score": "1"
        },
        {
            "review_text": "I just dont recommend playing this if you are tired and w/o lights in your room your eyes will be like &gt;&gt;&gt; O.O  otherwise the game is beast.",
            "review_score": "1"
        },
        {
            "review_text": "After several seizures and developing a brain tumor 10/10 would play again.  Seriously tho it's a good platformer with crazy visuals and pumping sound track.If you liked Super meat boy then this is the game for you, recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A rage platformer that plays sexual noises every time you respawn/get to a checkpoint. Whats not to like?",
            "review_score": "1"
        },
        {
            "review_text": "That music, that game, that everything, love it!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and difficult platformer with (like everyone else has pointed out) a totally freaking amazing soundtrack. Check out my video review!          YouTube™ Video:  Electronic Super Joy Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Hard-as-nails platformer with an amazing soundtrack - works on Linux too!",
            "review_score": "1"
        },
        {
            "review_text": "My friend showed me this game, all i could think of was how bangin' the soundtrack was. I kept listening to him rage and rage and all i thought to myself was 'It can't be that hard.' Boy was I in for a long night. You can see exactly what you need to do but the fast paced soundtrack, the sound of you're beating heart growing more and more inside your head, and the fast paced do it all at onceness really gets to you. Its one of those games where the more you try, the more you fail.   I thouroughly enjoy it though, id give it a solid 8.5/10. Its fun until you beat it, i dont really have too much to go back to since I bought the soundtrack and unless you're a hardcore, have to beat my friend's best time sorta guy/gal, this game is just a quick cheap fix for that platformer that you wanted to play but didnt want to buy a SNES for.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with an amazing soundtrack by my favorite music artist, EnV. If you buy this game, just make sure you are prepared to scream in anger, because you will die... a lot.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Electronic Super Joy - #1 - Uhn tiss uhn tiss uhn tiss!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy combines fantastic music with infuriating music. I am still yet to work out if I like the game, because it makes me very angry...",
            "review_score": "1"
        },
        {
            "review_text": "Loud music, sex noises, twitch controls, platforming mayhem; a hard on. This game is fun.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up on a whim for $0.79 during a flash sale over Christmas and thoroughly enjoyed my time playing it. Despite unashamedly being a Super Meat Boy rip-off (you can tell that from the title!), the game is well-made. The best example of its polish is the collision detection, which is very precise and required for this type of platformer. The frequent checkpoints, varied levels and colourful backgrounds help keep rage quits to a minimum.  Two slight gripes which may put people off. Firstly, I am playing this on a mac. The first time I loaded the game it froze at the title screen. To address this problem, I had to run the game in development mode. After changing this setting, the game worked flawlessly, including access to steam achievements.   The second gripe will be a deal breaker for some: the electronic/dubstep soundtrack. If you cannot tolerate this type of music, you should avoid this game. Every level has a thumping electronic soundtrack in the background which I imagine would be extremely offputting if you don't like that type of music. However, I found it ok and often at times found myself enjoying it.   A must buy at $0.79. And otherwise recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, Sound works simple but difficult platforming and YOU SHOULD GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Hard, but extremely fun. Amazing music too. The checkpoint sounds do sound like someone having s3x. LOL",
            "review_score": "1"
        },
        {
            "review_text": "A brutal platformer with absolutely amazing electronic music, awesome visuals, and just enough of a hook to keep you wanting more after dying for the hundredth time on various levels. Oh, and it's on sale right now for a few bucks. It's worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play a game similar to Super Meat boy but have varying forms of electronica blaring at you the entire time, get this. Also Battle Pope.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. Very interesting visually and the soundtrack is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "lets just say I have to wear a condom while playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Super Meat Boy meets VVVVVV. It's a modernized, retro-graphics, chiptune/techno music, hard-mode, quick-death/quick-respawn, learn-as-you-play platformer. It features quirky 8bit-esque sprites and reflex-based levels. If you like VVVVVV, you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "The game is/has : -Awesome.  -Godlike music. -Pixel art is great. -Simple control. -Challenging. -It is on sale -80%.  Caution: You will love to replay a level 10000000000 times. (not as hard as Meatboy i think) You are not allergic to women moan.",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy is very similar to Super Meat Boy. You'll be jumping around, dodging obstacles and enemies while a electronic beat plays in the background. It's simplistic (foreground) silhouette graphics give the game a certain eerie vibe while the background provides plenty of color. It makes for a good contrast. But the game still is hard as hell sometimes.  [Rating: 75/100]",
            "review_score": "1"
        },
        {
            "review_text": "A very simple but very good and awesome game! Despite it's a simple platform game, with 'low' design, this is what gives the feeling to the game. I like the simple but colorful background, the dark characters, the ♥♥♥♥♥♥ jokes. And the music just boosts up the mood. I really recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "The game makes sexual noises whenever you reach a checkpoint. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One heck of a ride. If you like meatboy and techno, you need to check this game out. I personally am pretty tired of retro type platformers, but the games sense of humor, balanced challenge, TIGHT CONTROLS, constant mechanic changes and fantastic visual/audio flare kept me going! Definite Recommend!",
            "review_score": "1"
        },
        {
            "review_text": "This game is an epic quest to get revenge.  Revenge for your butt.  Why are you still reading this and not buying the game?",
            "review_score": "1"
        },
        {
            "review_text": "Really fun a cruel platform game. Still in World 1 at the moment, so I'm imagining a whole world of more pain lies ahead.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I've never hated moaning so much in my life.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Super Meat Boy on crack with a rediculous techno soundtrack that will have you bobbing your head as you scream explitives at the screen. This game is challenging and forces you to think on your feet with strategizing how to dodge this missile, while trying to jump over this gap, landing near a pit next to flying baddies. The bosses also add their special charm and give you a good laugh while they're at it. I mean the pope chasing you in a speceship? Down right makes me XD everytime I play that level(s). Yes the boss battles last over 3-4 levels, but it's totally worth it! A game well worth your time and money!  Addicting and fun to listen to all the way! 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This is more of a first impression but as someone who barely plays any platformers I found this game to be very entertaining. The music is very interesting and I enjoyed it a lot. In my opinion the lighting effects could have been avoided but overall it seems like it will be a very good game for a good price.",
            "review_score": "1"
        },
        {
            "review_text": "Loving this game so far. Certainly has some Super Meat Boy in it, oh yeaaaahhh.",
            "review_score": "1"
        },
        {
            "review_text": "Pros *Music is ♥♥♥♥ING AWSOME!!! *The more you proceed throughout the game the gameplay itself becomes more intense/harder to beat.  ---Sugestion--- *Can you bring more challenging levels please?  Cons *None  ---Overall---  Why are you reading this, GET PLAYING!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I've played This Week. It controls well, has good music as well as a playful sense of humour.",
            "review_score": "1"
        },
        {
            "review_text": "It's ♥♥♥♥ed up that's why you should buy it. Especially if you like listening to electronic trance and girls making sex noises. If this recomendation has tempted you to buy it, then you're also ♥♥♥♥ed up.  :)",
            "review_score": "1"
        },
        {
            "review_text": "If Super Hexagon was a platformer............",
            "review_score": "1"
        },
        {
            "review_text": "I love electronic music and pixel games. So trust me when I say this is the BEST game ever created of all times.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "ooh~ yeeeaaaahhh~ mmm~~ I mean, i enjoy the musics :3",
            "review_score": "1"
        },
        {
            "review_text": "this is connanna",
            "review_score": "1"
        },
        {
            "review_text": "Super amazing game. Great music and awesome humour.",
            "review_score": "1"
        },
        {
            "review_text": "Played it",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game. Hard as ♥♥♥♥ and will make you rage a lot but it's still a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "You might think the high intensity music and eye-popping colors might get old after a little while, but once you start progressing through some of the harder levels, you'll realize just how amazing this unforgiving rhythm game really is. As you have lose all hope in passing through the next ♥♥♥♥♥♥♥ of a level, the music will keep you moving as though you are on drugs andthe bosses are super satisfying to defeat!",
            "review_score": "1"
        },
        {
            "review_text": "Very good gameplay for a platformer. It stops you from getting too frustrated with the INSANELY good music!",
            "review_score": "1"
        },
        {
            "review_text": "The best buttless-masochistic-jumping-EDMy-blasphematory game out there. It's Popetastic ! \\o/",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers on Steam. Great art style, incredibly tight controls, awesome music and brutal difficulty that never feels unfair.",
            "review_score": "1"
        },
        {
            "review_text": "An immediate warning: This is not a game for people who suffer from seizures or have an aversion to sudden and constant brightness.   It's amazing how much pressure you can feel in a platforming game with a minimalistic color palette, pixelation, and constant movement both by the level and the enemies in that level. I have always enjoyed platformers, so I have to admit a bias with this type of game. And with the minimal graphics, then all attention must be paid toward the control since platformers are made or broken by poor controls.   ESJ, thankfully, does not suffer from poor controls. It's quite responsive and intuitive, which makes the learning curve easy. That said, the difficulty curve is quite an undulation between easy portions and hair-tearing difficulty. I've found often enough that the 'simplicity' of the game makes it all the more frustrating at times because you start to push yourself and jump earlier than needed, only adding to the difficulty.   The music should also be mentioned. It, like the colorful brightness both adds to the feel and flavor of ESJ and can be distracting in its own right (which is a perfect blend for a platformer in this manner). It is a soundtrack worth the cost alone.  While I thoroughly recommend this game, I would add the caveat that you should look at this as a platforming game. I would also recommend only doing a few levels at a time. The colors can get to you after a while (though it does nicely change hues enough to not be too terrible) and some of the levels change in brightness enough to be a bit hard on the eyes.   All and all, a solid platformer with a great deal of fun to be had. And enough challenge to keep you playing without too much frustration.",
            "review_score": "1"
        },
        {
            "review_text": "*suggestively moans*",
            "review_score": "1"
        },
        {
            "review_text": "Most fun and great music",
            "review_score": "1"
        },
        {
            "review_text": "This game for me is a spiritual followup of Super Meat Boy. I have not been so challenged in a platorm game since I have beaten Super Meat Boy years ago. This game follows the same idea, levels are super difficult, jumps require millisecond timing and you really need to know your jump button very well to know how long to press it.  The soundtrack is just great, it has enough variety to prevent you noticing that after a while some songs are repeting. The soundtrack also tie in very well with the game. The are levels are very intense and fast, others that are slow, and the soundtrack matches very well.  The levels itself are very creative. At first you may think you just go to the right, jump on platforms, smash enemies, but then in some levels you face low-gravity, upside down screen, slow-motion, double jump, flying, light and darkness, an so on. There are many mechanics that are introduced in each level so that the experience is always kept fresh.  Boss fights are very challenging as well.  Definitely recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Great action and amazing music. It can be a little hard at some points and make you want to cuss your brains out.",
            "review_score": "1"
        },
        {
            "review_text": "intense platformer à la super meat boy. i'd buy just for the soundtrack alone. although now i realise you can just buy the soundtrack, but buy the game too! it's fun. everyone likes fun.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Seriously bloody difficult, but I love it :P",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. Even through extremely tough levels, I still find myself smiling. If you are into dancing, jumping with joy, and having fun, then this is for you. If you are not into those things, then you need to redefine your priorities…",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing amazing. I haven't even played it for very long and I'm already in love.",
            "review_score": "1"
        },
        {
            "review_text": "The name doesnt lie, it has great music and brings great joy and great frustation. When it comes to story, its not really that developed, but that doesnt matter because in this game the music and platforming is the main thing. Its worth the money go buy it! And there should be a sequel, just saying Michael Todd if you read this, make another Electronic Super Joy!!",
            "review_score": "1"
        },
        {
            "review_text": "The soundtrack of the game makes the difficulty less aggravating if you get stuck on a level (which has happened on multiple times). Instead of rage quitting, I laughed it off and continued, just enjoining the music as I died multiple times. Would definitely recommend this if you like electronic music, platform games, or if you have a Macbook, which is what I am playing it on.",
            "review_score": "1"
        },
        {
            "review_text": "Propllay the most ragiests game of all time i love it 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "You love bullet hell games? You love electronic music? You love Electronic Super Joy.",
            "review_score": "1"
        },
        {
            "review_text": "intense platformer à la super meat boy. i'd buy just for the soundtrack alone. although now i realise you can just buy the soundtrack, but buy the game too! it's fun. everyone likes fun.",
            "review_score": "1"
        },
        {
            "review_text": "I've never played Super Meat Boy (that's what first comes to mind when I see this), but this was fun and challenging. The graphic style is semi-minimalist (not like Thomas Was Alone, obviously) while still being flashy (if that's possible) at times, and the soundtrack sounds like something The Situation probably listens to while staring at himself naked in the mirror, right before he starts crying about owing tons of money or having a baby ♥♥♥♥. That is to say, it's really great if you like EDM (or comparably dance-y).  The game itself isn't very long, however the replay value comes from trying to hit all the 'gold' speed run times and getting all the other achievements. If you're into achievements, these will keep you busy for awhile. My suggestion is that you drink plenty of your favorite alcoholic beverage while going after these so that you don't pay attention by the 120th time you've restarted a level.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game... I hate this game... ummm that's it. Yes, both statements are true. :P",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It has a great soundtrack and challenging levels that require a little bit of thinking. I highly recommend a controller fo rthis game, it's a lot easier in my opinion. This game is a great buy fo rthe price, it is a must get.",
            "review_score": "1"
        },
        {
            "review_text": "A great, difficult, yet fun game that's full of funny sexual references and well placed strong language. This games controls are easy to use and function well with the levels. The graphics and design are also great and are classic 8-bit but still unique in their own way. The music is also well done and makes the game feel very polished.",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "This game is really amazing, and addicitve. Warning, it goes hard mode.",
            "review_score": "1"
        },
        {
            "review_text": "ooh~ yeeeaaaahhh~ mmm~~ I mean, i enjoy the musics :3",
            "review_score": "1"
        },
        {
            "review_text": "If you like to torture yourself...this is the perfect game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I can't make it past the first boss and I want to slit my wrists while listening to dubstep.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "wow this game is amazing  buy it now do it :)",
            "review_score": "1"
        },
        {
            "review_text": "Holy S.hit... This game takes platforming and humor to a whole new level. The game is incredible, and I am highly hoping for a longer sequel. And with the price, why not buy it!",
            "review_score": "1"
        },
        {
            "review_text": "This is a stupidly addictive and humorous hardcore platformer with a soundtrack you will absolutely love. The graphic style fits the game perfectly; simple with a lot of colours and movement and flashing. The gameplay is super easy to pick up and you'll be into it in no time. Normally, dying over and over would have people frustrated as hell, but I found that no matter how many times I died and how difficult some parts were, I still wanted to keep playing just because of the music. The storyline I'll admit is not very indepth and focuses almost entirely about butts, but it's hilarious and the game is brilliant so I couldn't really care less. Overall, this is a super amazing game that I had a lot of fun playing and barely paid anything for. I definitely recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy is a colorful, foot-tapping, butt-stealing, hardcore platformer with a soundtrack thats sure to get your pulse pounding! The main story may only take you a few hours, but you'll spend several more at the games many bonus levels perfecting every jump and navigating your way to the next. While the gameplay is hardcore, the world of Electronic Super Joy is lighthearted with many NPCs just waiting to say something silly to you. I think you will enjoy Electronic Super if you like things such as: hardcore platforming, loud electronic dubstepish music, and groove wizards.",
            "review_score": "1"
        },
        {
            "review_text": "By far, THE BEST 8-Bit, Bit-Trip Runner-like, game ever. The music, the puzzles, the visuals, holy crap. 10/10 Would rub with a bear.",
            "review_score": "1"
        },
        {
            "review_text": "like smb but doesnt make me punch a whole through my monitor",
            "review_score": "1"
        },
        {
            "review_text": "This game is alot of fun to play. The perfect soundtrack puts you in an unbelievable cool immersion that you just dont want to break. The style and gameplay are fantastic. wonderfully balanced (artVgameplay).",
            "review_score": "1"
        },
        {
            "review_text": "great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Great at platformers? Lightning-fast reflexes? Ultraprecise? Like electronic music? Was Super Meat Boy too easy and boring? Electronic Super Joy may be the right game for you. Ohhh yeah... ",
            "review_score": "1"
        },
        {
            "review_text": "I died a million times in this game...   AND ITS AMAZZZZZZZZZZZZZZZZZZZZZIIIIIIIIIIIINNNNNNNNNNNNNNNNGGGGGGGGGGG!  Fun game very challenging but worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Super technical platformer with the kinkiest soundtrack ever.",
            "review_score": "1"
        },
        {
            "review_text": "I was like 'BOING' and then I was like 'RUN' and then I was like 'SMASH! Take that you dirty missle!' And then I was all in my spaceship like 'Pyew-PYEW!'  It should be called Electronic Super Rage.  GIMME ALL THE STARS!",
            "review_score": "1"
        },
        {
            "review_text": "The name doesnt lie, it has great music and brings great joy and great frustation. When it comes to story, its not really that developed, but that doesnt matter because in this game the music and platforming is the main thing. Its worth the money go buy it! And there should be a sequel, just saying Michael Todd if you read this, make another Electronic Super Joy!!",
            "review_score": "1"
        },
        {
            "review_text": "A weirdly random and super addicting game. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Frustrating angers me but the funky beats keep you hooked :OOO",
            "review_score": "1"
        },
        {
            "review_text": "This game is nuts. A wizard steals yo booty, and you gotta get it back through crazy-♥♥♥ platforming with rave music thrown in like some sick spice. The enemy placement is Crazy as the game progresses, especaly on moving stages because it requires you to be so gosh dang pixel perfect, you'll want to throw something out a window because whoopsie, you missed by thaaaaaat much. Oh, speaking of moving stages, sometimes the stages throw in slight rotating! So it sucks if you have vertigo, because this game will mess you up. Its like a party where the punch got spiked, and your playing like your some guy who just hung over from said drink, because god dang its hard.  10/10 will throw this game out a window after i beat it",
            "review_score": "1"
        },
        {
            "review_text": "Really addicting and frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely recommend Electronic Super Joy. Everything is so solid, and it all comes together in a way I would not have expected. Pixelated foreground with multi-layered background, and some of the best music I have ever heard in a game. It all just works beautifully. I haven't even mentioned how crazy hard it is. It's hard to be more difficult than Super Meat Boy, but Electronic Super Joy achieves it at breakneck speed. You may find yourself rage-quitting an unusually large amount of times. Another thing that caught me off guard was the humor. I personally love the type of humor it uses. It does a wonderful job of showing yourself how stupid what you're doing sounds (i.e killing the pope). Ovarall, I think Electronic Super Joy offers an experience that I have never seen in any other game. As such, I think it deserves a spot in your Steam library.",
            "review_score": "1"
        },
        {
            "review_text": "This unforgiving platformer boasts an amazingly epic techno soundtrack, and some pretty great level design. It does feel a bit jagged around the edges at times, but nothing that can't be overcome through lots (and I do mean lots) of deaths. It's only a couple of hours long depending on your skill level, but the soundtrack and leaderboards make you want to come back for more.",
            "review_score": "1"
        },
        {
            "review_text": "A fun planformer which has some amazing soundtracks. The levels get extremely hard and involves dieing many times before completing a level. But it gives you a greet feeling once you complet a level.",
            "review_score": "1"
        },
        {
            "review_text": "Hard, unforgiving platformer with an absolutely fantastic soundtrack. Easily one of the best games ever made in this genre. A rare gem and a welcome challenge. Must have!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most crazy, 'wacked in the head' games I've play in a while. Kinda hard. Better when you get handle of controls. Soundtrack is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "This game is enjoyable and possibly one of the weirdest games I've played. You go on a quest to find your butt(that's the actual story) through flashing environments with techno beats playing in the background. In the 33 minutes I've played, I've gone through world one, where I had to kill the Space Pope who told me he was going to '♥♥♥♥ me up' by chasing me down in his UFO. I then had to shoot down his UFO with one of my one, and then I had to collect rainbow rockets to shoot at him while dodging his own rockets. It's a strange game, but pretty fun. The soundtrack is very good too.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very simple platformer with an amazing techno soundtrack to play along with. A bit short and can be a bit frustrating, but you can't really get angry with the humour and screen bopping music. I found it quite entertaining and love the OST. As long as you have a sense of humour and don't have epilepsy then you will probably enjoy the couple hours of gameplay Electronic Super Joy brings to the table; just try and grab it on sale!",
            "review_score": "1"
        },
        {
            "review_text": "It's all you ever wanted. Sexual Noises and Techno Music,",
            "review_score": "1"
        },
        {
            "review_text": "Very good gameplay for a platformer. It stops you from getting too frustrated with the INSANELY good music!",
            "review_score": "1"
        },
        {
            "review_text": "great music and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Freaking intense game but love the music! ",
            "review_score": "1"
        },
        {
            "review_text": "good game, good ideas but ♥♥♥♥ controls!!",
            "review_score": "1"
        },
        {
            "review_text": "Epic games in the world",
            "review_score": "1"
        },
        {
            "review_text": "I find myself spitting curses and pulling my hair out, with the biggest smile on my face I've ever had.",
            "review_score": "1"
        },
        {
            "review_text": "Really hard. Amazing soundtrack that mixes great with the platforming. Also really freaking hard. They don't complicate things by having multiple mechanics at once, and beating it gives you the sense of satisfaction only a hardcore platformer can give.  Did I mention it's crazy, super, incredibly hard?",
            "review_score": "1"
        },
        {
            "review_text": "it cool",
            "review_score": "1"
        },
        {
            "review_text": "This game is enjoyable and possibly one of the weirdest games I've played. You go on a quest to find your butt(that's the actual story) through flashing environments with techno beats playing in the background. In the 33 minutes I've played, I've gone through world one, where I had to kill the Space Pope who told me he was going to '♥♥♥♥ me up' by chasing me down in his UFO. I then had to shoot down his UFO with one of my one, and then I had to collect rainbow rockets to shoot at him while dodging his own rockets. It's a strange game, but pretty fun. The soundtrack is very good too.",
            "review_score": "1"
        },
        {
            "review_text": "Heaps of fun, rage inducing and addicting :D 8/10",
            "review_score": "1"
        },
        {
            "review_text": "you will dance all the time you play this game. light version of bittrip runner",
            "review_score": "1"
        },
        {
            "review_text": "Do yourself a favor and play this game. It's funny, challenging and has an amazing soundtrack. In short, GET THIS.",
            "review_score": "1"
        },
        {
            "review_text": "Electronic Super Joy is a hardcore platformer. I love the soundtrack even though I am not a fan of electronic myself.  The game is hard, yet rewarding. Heads up, the DLC is pretty hard as well, but completing one gave me so much satisfaction.  For the platforming, the colors, the music, and the rewarding feeling of finishing a level, Electronic Super Joy is a game that I really enjoy and i'm sure you would too.    ",
            "review_score": "1"
        },
        {
            "review_text": "Fanastic!",
            "review_score": "1"
        },
        {
            "review_text": "7/10 Would punch a hole in my moniter again.",
            "review_score": "1"
        },
        {
            "review_text": "Oh boy this game is so fun buts its also really hard like the kinda hard where you want beatt the livng ♥♥♥♥ out of your keyboard but thats ok because you get to listen to awesome music so in short buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Addicting, Challenging and Rage inducing. If your looking for these in a game then this is the game.",
            "review_score": "1"
        },
        {
            "review_text": "So good, dont normally do platformers but i played this one all the way through. Music is incredible.",
            "review_score": "1"
        },
        {
            "review_text": "man, F evil wizards",
            "review_score": "1"
        },
        {
            "review_text": "The soundtrack is making this game so HYPE",
            "review_score": "1"
        },
        {
            "review_text": "Every time you die someone has an ♥♥♥♥♥♥ ++ would reccomend!",
            "review_score": "1"
        },
        {
            "review_text": "Violence, missiles, ♥♥♥♥♥♥ic 'Oh yes' sounds, and a good soundtruck. What more could you ask for? ",
            "review_score": "1"
        },
        {
            "review_text": "My girlfriend gave this to me 2 days ago. She now owes me a new monitor, and we haven't talked since then.",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing! Great soundtrack, challenging gameplay and hilarious dialogue. A must have for platformer fans.",
            "review_score": "1"
        },
        {
            "review_text": "Why did i not find this game sooner? O_O This game is frikkin aaaweesomeeeee O_O O_O O_O Got it for like 1 euro in a sale. The music is awesome! The gameplay is awesome! The humor is awesome! O_O just....awesome!  This game is kinda like 'They Bleed Pixels' gameplay wise...and it's pixelated too xD It also resembles 'Rush Brothers'..but that game sucks ♥♥♥ compared to this one.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game alot. I hope developer makes more of this with different twists and new soundtracks. Im not one for completing everything challenging but i appreciated the options of harder paths and the failures made me want to complete it even more unlike other games where failing causes interest to be lost. I dont like to eat pie because i feel like its not needed but who am i to judge",
            "review_score": "1"
        },
        {
            "review_text": "This Is Game For Me Got Annoyinly Hard At Some Points But The Game Is Still Very Fun. Although It Kinda Costs Alot For How Short It Is. The Game Lasts A Long Time If You Get Stuck But The Actual Game Lasts Around 5 Hours Without DLC And The Game Costs 7.99! I Got It When It Was On Sale But Still Thats Kind Of Alot For A Short Game You Could Beat In One Day.",
            "review_score": "1"
        },
        {
            "review_text": "  This game was so gud,i almost broke my hand(and my entire butt).Within the first hour of gameplay,this game blew me away withs its amazing music,challenging platforming levels,and its funny dialouge.Just a warning,when they say'may cause seizures' they arent kidding when they say that.This game is trippy as balls.",
            "review_score": "1"
        },
        {
            "review_text": "Slide across floors or stick to walls covered in mysterious coagulated white material in this addictive platformer game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and challenging game. For me, it is all about muscle memory. However, I would only pay $5-6 for it. Also, do not play if you are easily offended because it has some *cough* crude humor.",
            "review_score": "1"
        },
        {
            "review_text": "Should you get this? Ohhh Yeahhh",
            "review_score": "1"
        },
        {
            "review_text": "Epilepsy game with amazing music but hard to play :)",
            "review_score": "1"
        },
        {
            "review_text": "This game appealed to my love of challenges and EDM. I highly reccomend it to anyone who shares these interests!",
            "review_score": "1"
        },
        {
            "review_text": "Killing the pope was fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is like Anal, at the beggining it hurts, but then you get used to it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Very difficult. If you like to hear random moans, and emphathize with a loss of butts, then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This Is Game For Me Got Annoyinly Hard At Some Points But The Game Is Still Very Fun. Although It Kinda Costs Alot For How Short It Is. The Game Lasts A Long Time If You Get Stuck But The Actual Game Lasts Around 5 Hours Without DLC And The Game Costs 7.99! I Got It When It Was On Sale But Still Thats Kind Of Alot For A Short Game You Could Beat In One Day.",
            "review_score": "1"
        },
        {
            "review_text": "The music is great, the platforming is hard yet fair, and it is just fun overall. There is a lot of bonus content, but the main story is pretty short. Each level has a gold standard time to hit if you enjoy speedrunnning and there are many challenges to attempt as well as hard collectables to find in some levels. This game is a great buy on sale for people who enjoy platformers like Super Meat Boy.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun music, great visual effects, tight controls, and enough wrinkles to keep it fairly fresh as you play throug. If you're looking for a challenging side scrolling platformer, this fits the bill. Feels a bit like a cross between Super Hexagon and Super Meatboy.",
            "review_score": "1"
        },
        {
            "review_text": "Super Meat Boy's second cousin at EDC",
            "review_score": "1"
        },
        {
            "review_text": "Honestly a game that is great fun to play when there isn't much else happening, but it is really enjoyable and is great to just chill and enjoy the rythem",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers on Steam. Great art style, incredibly tight controls, awesome music and brutal difficulty that never feels unfair.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing awesome electronica music, solid platforming, colourful backgrounds, and girls moaning at every checkpoint.  What more could you want out of a platformer?  ... well, I guess the answer to that is a game that isn't slow, buggy, and filled with pointless gimmicks to make up for the lack of anything unique.  Electronic Super Joy is a game that has a lot of potential and looks like it'll be great, but falls flat on its face once you dive in. Let me explain why.  The first thing was my controller just didn't have the right buttons mapped. Now this isn't an unknown problem for the gamepad I use if I'm not using x360ce. I'm guessing x360ce for some reason doesn't work for this game which is a real bummer and put all my controls everywhere. Considering out of over 100 games I've played with this gamepad using x360ce and this is the first one that's given me problems I'm going to have to count that as an obnoxious negative.  Anyways, once I got going.. It sounded amazing. This game has some great music. I can't say much more. It wasn't memorable though. Not necessarily a downside, but lets just say I let the game idle on the title screen for an hour without bothering to mute it in order to get the trading cards.. after turning it off, I couldn't remember the track I had been listening to the whole time. Speaking of the title, it doesn't loop properly and just fades out before replaying. I wouldn't be surprised if other music in the game was the same way. Regardless, the music did sound great. I loved the style and it was very energetic.  Visually.. its kind of.. boring. Yeah. Its boring. Look, I like my share fair of retro pixelated graphics but this game's art is plain lazy. Yeah, the backgrounds are colourful but they're not much more than basic colours thrown together.. Throw some black blocks everywhere and that's all there is to it. The character you play is just some black pixels. Uncreative and more forgettable than one of those games where you play a blob.  Alright, so the gameplay. The control.. was... Okay, well I immediately thought the game felt slow. It feels like a game that should have a run button. Imagine playing Super Meat Boy or Mario without ever using the run button. That's what this game always feels like. Speaking of Mario, imagine playing Mario and dying everytime you jump on an enemy. Yep. You can't kill enemies by jumping on them in this game. Instead, you have to jump and then use an attack in mid-air that slams you down on to the enemy. Honestly, it just feels pointless and would be better off with a standard jump-to-kill method.   So its a platforming game.. with a lot of platforms that seemed to always be above bottomless pits. You jump here, you jump there. It worked and felt pretty solid. But the levels had some kind of silly gimmicks. There were things that launched you in the air and teleportals that were cool. Though one problem was the levels are set up so sometimes a teleportal entrance requires you to run a direction that'll immediately kill you after you teleport unless you completely let go of the movement button. A bit annoying, but not that big of a deal. Also, how many levels will the screen constantly scroll in? Those are in a lot of games, but just in my first few levels it was all I was seeing. It wouldn't be so annoying if the game was a bit faster but it just isn't due to the lack of being able to run.  Most of the gimmicks were just plain bad. In one level, the visuals were so crazy that it gave me a headache and made me dizzy. It was a pain to try and play through all that was going on. Hard to explain over this, but if you end up playing the game you'll see what I mean.. and you won't like it.  As for the actual difficulty, the game was tough but it didn't feel overly hard. However, being tough early on makes it seem like it could easily be one of those games with a stupidly hard difficulty curve late-game. Unless it has a flat difficulty curve. The things that felt hard weren't even pure user error, but failing from silly gimmicks that felt forced in to try and make this game more unique.  The game seemed kind of buggy. One level the music went absolutely apeship and was just a huge distorted wall of noise. At first I was questioning if it was intentional but the longer it went on and the worse it got I knew it couldn't be. It just sounded absolutely horrible and cringe-worthy.   Do I think people could like this game? Definitely. Do I think its a bad game? Not at all. But I feel it has a lot of problems and just isn't too great. It has potential and could easily be turned into something awesome, but when has a released game ever been completely reworked? Its been a long while since I played this game, so maybe its changed for the better now.. but because of how awful my first experience was with it I won't be giving it another try.  If you really want to then its worth checking out I guess to see if you might like it, but I don't recommend it. There are so many other platformers out there that do all this game does and more while doing it much better.",
            "review_score": "-1"
        },
        {
            "review_text": "I was really looking forward to playing this game, and enjoyed it, for only a short amount of time. There's too many glitches I've encountered, and it ruins the experience overall. And the only way I can un-glitch the game is to actually close out of the game, and start it again from Steam. Restarting a level doesn't fix it. It really needs some patching before I can actually recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Dirt cheap for a reason. Its feels like they tried to make a rythem game, failed, turned it into a hardcore platformer (but kept the awful club music) and then failed even harder. Distinguishing the difference between the background and the hazards is hell thanks to the lazy sprites. There isn't any momentum with the running and when they finally try and spice things up with a new ability they take the old one away. I just had to quit entirely on the level which removes checkpoints because it was getting tedious enough already.",
            "review_score": "-1"
        },
        {
            "review_text": "back in the early 80s, a flood of really bad games hit the atari 2600. this reminds me of them. adding elements that just make the game more frustrating instead difficult (twitch controls, crap flying everywhere, forced scrolling) in a colorful-yet-drab environment. The dated EDM music really doesn't help.",
            "review_score": "-1"
        },
        {
            "review_text": "Even though Electronic Super Joy is a decent game, I have to give it a thumbs down. It's not because of the controls, they're tight. It's not because of the level design, it's good. It's a solid platformer with good variety.   The problem, for me, is in the presentation. It's a electronic music-themed game, with flashing lights and strobe effects and all sorts of distracting stuff. And it gives me a headache in less than 20 minutes. And it usually comes with some dizziness and nausea.   I might just be wimpy, but it's never happened to me with any other game. If you happen to have a strobe light in your bedroom so you can practice your Melbourne Shuffle and you like platformers, you'll probably like this game. On the other hand, if you have any sort of tendency for motion sickness or seizures or something, I strongly suggest avoiding this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Fake and gay",
            "review_score": "-1"
        },
        {
            "review_text": "This game really just hurts. It just hurts to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Theres a difference between being 'hard' and just being badly designed - this is the latter.  For example, the age-old Super Mario Bros. force scroll levels - in SMB, they pause for a moment when you spawn and when you reach the edge of the screen, they push you along. In Electronic Super Joy, they kill you instantly, which is somwhat annoying when even the first few levels requires significant backtracking with little leeway for error, meaning I found myself dying needlessly, as my character touched the edge of the screen before he (would have) touched the teleporter.  Add to that the lack of acceleration on the main character, levels which are monochrome and hide the platforms from you frequently, a inconsistent frame rate (I strongly suggest you go into the options and turn frame locking on) and no leeway when it comes to pixel-perfect jumps, it seems to be making a point of being difficult, when it could be a significantly more enjoyable platformer, in the vein of the Trials series.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just OK. Meh.  Pros: Sweet music which sounds great on decent equipment (turn the bass up!). Simple controls (but they are hard to time like any platformer.) Funny. Has trading cards.   Cons: Hard and overall frustrating. Sometimes it scrolls WAY TOO FAST. The graphics will also hurt your eyes after a while of playing. You die 50000 times. I think this is meant for more serious platform players.  If you can get this game cheap and are into hardcore platformers then this is the game for you. If you are into more casual platformers or don't play platformers, steer clear of this one.    I got it for 79 cents. Don't buy it for more than a buck.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very difficult. You have spent your whole life to play it to the end.",
            "review_score": "-1"
        },
        {
            "review_text": "Only for ppl who like this kind of game and ... electronic music. So it is not me albeit I finished the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the worst thing to have ever been made. The music is horrible and the design of the game is horrific. The game tells you to press different keys to get through obsticles but the keys do nothing. I got this game as a gift and I now hate my friend for it.",
            "review_score": "-1"
        },
        {
            "review_text": "no quality memes in t his one 10/10 wouldnt recommend sry",
            "review_score": "-1"
        },
        {
            "review_text": "MAKE THE GAME MORE EASY THAT'S TOOOOO HARDDDDDDDDDDDD...I'M NOT ENJOYING THE GAME AT ALL!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "A blend of bad music and Super Meat Boy, you will often hear the game saying, 'yes,' in a provocative manner. Don't listen to it, just say no to bad games.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is okey if you want to kill some time, but you may want to turn the PG mode on, as the 'sexy' sound effects are too annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a jumping platform with a decent soundtrack that ruins it with poor 'sliding window' mechanis (a la Super Mario 3) that hinder more than help gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to recommend this game - I genuinely do. It is a fairly entertaining platformer that's deceptive in it's simplicity and has a very unique sense of style. I have for the most part enjoyed the game.  However, infuriating difficulty spikes caused by poor level and boss design have led me to abandon this game completely only a quarter of the way through. I'm sick of playing the same 30-60 seconds in one room over and over again because the environment is too cramped to actually navigate around. I have been stuck in it for forty minutes or more.",
            "review_score": "-1"
        },
        {
            "review_text": "About the music: They praise themselves with the music, even selling you a soundtrack if you want to. I acutally like electronic music in games a lot (e.g. the hotline miami soundtrack), but the tracks here are almost completely cheap dance crap music that sounds like 'Scooter' or similar Euro Dance 'Artists'. This may be popular with a lot of dorks out there, but in my opinion it's like ♥♥♥♥♥♥ your ears. And it unfortunately ruins the game for me by killing its main selling point. What stays is a soulless and hard platformer.",
            "review_score": "-1"
        },
        {
            "review_text": "Pay for a seizure",
            "review_score": "-1"
        },
        {
            "review_text": "Music was great, fantastic even. But I never want to play it again. Once through was enough. Nothing new was brought to the table.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is solid. The level design and the basic mechanics felt a bit divorced from each other. (stopped after the first world plus some) I was sort of sad to find sparse sound effects and no correlation between the play and the music. The graphics and mixture of pixels and vector was done well, even if some of the effects felt thrown in. (let's shake the screen!)   Not bad on sale, but not my cup of tea.",
            "review_score": "-1"
        },
        {
            "review_text": "DONATE TO MY ♥♥♥♥ING PAYPAL @ ICEAGEFAN58",
            "review_score": "-1"
        }
    ]
}