{
    "app_id": 245450,
    "name": "Wizardry 8",
    "release_date": "2013-09-10",
    "developer": [
        "Sir-Tech Canada"
    ],
    "publisher": [
        "Gamepot, Inc.",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Party-Based RPG",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 460,
    "negative_ratings": 41,
    "price": 6.99,
    "description": "A New Wizardry for a New GenerationThe universe is in the throes of violent upheaval and change. Vast and mysterious forces are preparing for the final confrontation. A small group of heroes from distant lands must plunge into the heart of the maelstrom, to uncover long-forgotten secrets, and bring about a new era.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/245450/header.jpg?t=1466791316",
    "minimum_requirements": "Mínimo: SO: Windows XP Procesador: Pentium 233MHz Processor Memoria: 64 MB de RAM Gráficos: 8MB 3D Accelerated Video Card DirectX: Versión 9.0c Almacenamiento: 2 GB de espacio disponible Tarjeta de sonido: 100% DirectX 9 compatible card or onboard sound Notas adicionales: Sound Card and Mouse also required for the best experience",
    "recommended_requirements": "Recomendado: SO: Windows 7 Procesador: Pentium 333MHz Processor Memoria: 128 MB de RAM Gráficos: 16MB 3D Accelerated Video Card DirectX: Versión 9.0c Almacenamiento: 2 GB de espacio disponible Tarjeta de sonido: 100% DirectX 9 compatible card or onboard sound Notas adicionales: Sound Card and Mouse also required for the best experience",
    "reviews": [
        {
            "review_text": "One of the best computer RPG of all time. Unapologetically hard (in the typical Wizardry fashion), Wizardry VIII is one forgotten gem makes clearing of every level a satisfying player achievement that will make you rejoice the experience for years to come.",
            "review_score": "1"
        },
        {
            "review_text": " A must have game for anyone who likes turn based RPGs",
            "review_score": "1"
        },
        {
            "review_text": "There is no other RPG like this. A full 1st person 3D open world with a combination of turned-based and real-time combat, full 6-party with 2 hirable NPC characters that can swap in and out (or simply become permanent), meaning 8 characters you can use as you progress through the lengthy game.   The main features:      amazing character progression:  with classes like Lord, Valkyrie, Bishop, Bard, Ninja and yes, Samurai - among many others including the staples like Priest, Mage, Rogue, etc., this game rewards the player with every encounter. It's a use-based skill system where characters have simply tons of potential skills, stats, and magic options to increase, all packaged in a very workable and mostly modern UX (that supports right mouse click to open, close).  By amazing, I mean amazing. Players have completed the game on its Iron Man mode, without losing a life, and have also completed the entire thing using just one character. I am on my 6th playthrough of the game (and I know many have much more than that). Any character combination is viable, and they are always growing in some way.      great combat:  what would a great progression system be without some place to show off. Here's where you can. While it's not the easiest game to at first get into (as it has more depth than almost any other RPG I've played), with things intuitively displayed such as your cone of facing, party positioning, short and extended weapons, all kinds of status effects you can get and inflict, all types of ranged weapons (including modern weapons and even a couple sci-fi influences), the game just puts it all together in an extremely well thought out experience. For example, cast a fireball spell and you'll get a nice draggable marker that extends out into the world with a range indicator, highlighting all it would affect.   And there can be big battles. You'll be roaming the countryside and see a group of 10 bandits. They have an aggro range so when they 'sense' your party, they'll start walking toward you. As soon as they get within combat range, turned-based combat will ensue. NOTE: by default you'll want to speed this up in options as it'll be too slow. Just slide it to its max.  After any combat, you'll get a very cool list of all your character's skill increases, which always makes any combat worth entering into. By the end of the game, you will feel exceptionally, and appropriately powerful.       open non-linear world:  the world is a scary place. You can definitely travel to areas with creatures way too tough for your party, which makes exploring so fun. The path is not always exceptionally clear - a good thing in my book as it really relies on the player to get immersed and explore its lore. But you'll get to travel around and within cities on the ground and in trees, military bases, outposts, swamps, and hidden labs, among other places. And the order you do this is up to you. There are factions you can ally with and work for with meaningful rewards / consequences.       replayability:  the depth of the character progression and party options, as well as the non-linearity of main storyline, key randomized chest drops throughout, faction choices, as well as enemy spawn system, make for a highly replayable game.    TIPS FOR BEGINNERS :     important:  for most wide screen monitors this game will by default looked 'stretched'. You'll likely want to (until a widescreen patch with proper UI support is made - there is one but the UI stretches) play this in 4:3 ratio. Which means you'll need to go into your graphic card settings (e.g., nVidia control panel), go to 'Adjust desktop size and position', and for GPU set maintain original aspect ratio, then save changes. Also when you run the game and its 3D setup, choose Direct 3D as your mode, and ensure that it's set to 4:3 ratio. Then you'll get the correct black bars and your mouse will be nicely constrained. It will also look much better, and I find is completely playable.     google search Wizardry 8 tips and you'll find a few key websites with information on party building, etc. GameFAQs also has some good guides     make sure you have one or two spellcasters in your party (e.g., mage / priest) as they have beneficial long-term spells they can cast like Armorplate or Enchanted Blade that can be up at all times starting from not long into the game. And don't forget light. :)     positioning is key. As you travel in the Monastery and in the wilderness, mostly stick to the sides of the area, as they'll have nooks and crannies you can get your party into, so enemies won't surround you and get your back-positioned party members. Doorways and narrow hallways help with this, too.      don't be afraid to find a corner, press 'c' to camp, regenerate your spellpoints / hp, and then start again.     there's a quicksave - simply press 'q' and there will be multiple slots worth that recycle. It's instant, and do it often.     practice using skills and spells - the more you practice, the more effective they become. For example you can practice examining locked chests for traps, or picking a complicated door over and over (when you find one) to increase your locks &amp; traps skill.     focus on only a couple primary stats at first until at least one is 100. It then unlocks a special trait that's usually very helpful. This won't happen until early-mid game if you're persistent.    Sure there's more but there is a ton of info about this game still... and a somewhat active player community, even 15 years later. Crazy.  This is a classic, and a great end to one of the series that started it all. This is by far the most accessible Wizardry, and the first (and last) one in 3D.",
            "review_score": "1"
        },
        {
            "review_text": "A great old style RPG. It combines real time 3D exploration with turn based combat. The plot is complex even if almost linear.  While the game can be played as a strategic combat game with some tme spent hanging around, the great depth in character evolution and the vast amount of enemy types and abilities make it an always evolving challenge.  Two thumbs up: masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "I've never played any of the Wizardry games before, and I actually found out about them from Todd Howard mentioning the series and playing it before he took hold at Bethesda. I can see relations between Wizardry 8 and Morrowind (the first TES game involving Todd Howard in development) and it's really interesting. It seems like a Fallout/Morrowind/Daggerfall mixture with it's own touch. Only playing three hours, I've found this to be really addicting. When killing, it feels more rewarding than most RPG games that I've played. I really feel like character progression is more refined in this game, especially for it's time. The game to be honest, is pretty hard if you don't know what you're doing. Essentially trial/error is what you have to do if you don't watch gameplay or not know what you're doing. I've found having a priest, tank, ranger or two, and a bard is standard. Bard's lute helps out loads and having the extra ranger if you choose, helps in sticky situation when your spellcaster(s) and ranger can only attack the far-away enemy. Overall, this game is great, I'd definitely pay the full $10.00 if it wasn't on sale. It's worth it if you like RPG games.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the release date of 2001 scare you away because this is a very playable and enjoyable game. The controls and graphics are fully acceptable by today's standards (though you may want to swap your cursor keys for WASD) and I've seen many modern mobile games look worse. The introduction basically tells you all you need to know about the Wizardry games that came before, so no need to play any other titles prior to this one.  The Wizardry series was hit and miss for me in the old days since it was one of the worst offenders in the 'ecology of a dungeon' -- with rats and ninjas one step down a corridor from slimes ready to pounce you from total darkness. Wizardry 8 is much more realistic in that sense with slimes in rooms where it looks like they'd thrive, for example, although it still has some of the wacky characters and races more suited to science fiction than fantasy. I'm not sure how I feel about that aspect of the game - but this particular Wizardry seems less corny in that way.  The locations are varied and interesting, and the game makes you want to explore every nook and cranny rather than blow through it. Sometimes you will find little hidden items and clues, so the searching is worth it.   The gameplay is a hybrid between Castle Grimrock / Dungeon Master / Bard's Tale classic-style and 3D full-range movement CRPGs, and allows you to position your characters to the sides in your party formation. I have yet to decide if this works well (since while you can be flanked you cannot flank the enemy with your 'blob), but it does add interest to how you form your party.   If you like dungeon crawls with inventory management, healing spells, and a casual tone (but with ample challenge), this one is a good use of your time.",
            "review_score": "1"
        },
        {
            "review_text": "It's an old game, but it's a good example of a classic rpg.  I keep coming back to this game every year or two and play it again.   Sure it's not perfect, but the new games depended on these forerunners to blaze the trail for them to smooth out later.  And yes, there is a storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Immortal Classic. Too bad SirTech is no longer with us. This game was incredible when it was released and still is amazing.   Games problems are few: eye piercing graphics, scaling of enemies and pretty much absense of tutorial.   There is not much else to say really, so many words were already told about this game we could probably create several massive tomes comprising all the reviews and praise.   Buy it, enjoy it, just remember this came out more then a decade ago. A huge shoutout to those who ported this game to steam, along with system shock! You guys are awesome!  ",
            "review_score": "1"
        },
        {
            "review_text": "9/10 It's tough, complex and one of the best RPG out there or at the very least on PC. You can also make tiger and chewbacca like people which is cool. Salt",
            "review_score": "1"
        },
        {
            "review_text": "i still like the game even today its a truly masterpiece of the RPG Games.  i Wish there whould be more game like wizardry 8 that you grow not in level but youre skills becoming more effective over time  i really recommand this Wizardry 8 if you like to play into 6 Characters in party  2 in later game 8 in total ",
            "review_score": "1"
        },
        {
            "review_text": "Mixture of an old school MUD with a modern RPG? Pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "A pioneer among CRPGs. Character creation is amazing, battle can be challenging yet provides a sense of accomplishment. Not very many games, vintage or modern excell at overaccomplishing aspects that usually leave a lot to be desired.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit, I didn't think I would like this game but after playing it for 5 mins it was brilliant. One thing to be aware of is that there isn't really a tutorial so you might have to restart a few times at first before you get the hang of it. Just make sure you read what all the buttons do first. That will help. Overall really fun once you get into it.",
            "review_score": "1"
        },
        {
            "review_text": "Wizardry 8! Ridiculous future tech fantasy RPG with excellent combat. Try not to worry about the outdated graphics, the rest has aged plenty well.",
            "review_score": "1"
        },
        {
            "review_text": "Old classic still delivers. It about the fun not the graphics.",
            "review_score": "1"
        },
        {
            "review_text": "3dfx supported ",
            "review_score": "1"
        },
        {
            "review_text": "I made a dual wielding, samurai Faerie with a thick, female German accent and named her Tinker Bell. In Wizardry 8, Making your own characters is a blast. This game is full of interesting races like the Dracon, Mook and Rawulfs and classes like the the psionic, Bishop and Ninja; this is so refreshing compared to the generic human, elf, dwarf races and the fighter, mage and thief classes you see in most modern day RPGs. I also love how the custom characters are brought to life with a variety of wonderful voice actors and animated portraits that make your creation feel alive; I haven't felt this attached to characters in an RPG in a long time. I know many RPGs allow you to customize your characters appearance, but Wizardry 8’s character experience stands out to me; theres just something special about taking the time to craft the whole cast of characters in your group, then crash landing them onto the planet and see how far they can go as a team. My only real complaint is that the combat seems a little drawn out compared to other rpgs (there are mods to speed it up but I haven't installed those yet) Of course the graphics might look dated (to be expected for a game this old), but Im having a blast playing this game so far with my crazy cast of comrades. Now Excused me, I have to go make sure Tinker Bell doesn’t rip the bartenders face off...",
            "review_score": "1"
        },
        {
            "review_text": "One of the most enjoyable games I have every played. The combat system is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "My wizard cast a frost spell an killed herself. Best game ever. 15/10  But srsly this is a very fun game, the magic is powerful both ways. You can kill all your enemies with a single spell, or kill your party with a single spell. The charater creater and level system are some of the best I have ever seen. Difficult but very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest RPG ever made!",
            "review_score": "1"
        },
        {
            "review_text": "RPG dungeons and giant sea turtles, 8 people in a group and lots of magic to throw around. i have put in over a thousand hour s of game play in this game. best part of the game is having to kill a monster called briket. there are a few places in the game where the diolog should go a few steps farther, but all in all it is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "+ Awesome graphics! Circles, arcs and curves are non existent. You can count the polygons of every model on one hand! Textures are blurry from all distances! These graphics are on-par with the popular '8bit retro' graphics in indie games these  days.  + Intense battles against   20+ super giant killer ants   that take ages before you can finally take 3 hits. And then you have to wait for every monster enemy to move again! INTENSE!  + Interesting world breaking away from the traditional RPG theme with brand new and original ideas from the developers, in all nine Wizardry games.  + Approachable for modern gamers! The novice option makes this game approachable even to modern gamers!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Enough challenge and game kept it interesting.",
            "review_score": "1"
        },
        {
            "review_text": "...the publisher even scanned the 135 page paper manual! Bravo!",
            "review_score": "1"
        },
        {
            "review_text": "Love the diversity and style in this RPG",
            "review_score": "1"
        },
        {
            "review_text": "I have 45.9 hours on record with Steam for this game, but the save file I played from was over 10 years old with countless hours invested in it.  This game is difficult. It is awkward. It is annoying at times. This is offset plenty by the rich storyline, the character creation system, an interesting formation-based 6-person party (8 w/ temporary NPCs you can control) that can engage in combat in either turn-based or real-time, and the fact that no matter how hard you smash this game you will almost certainly never beat it. In a timely manner.  While the game itself is outdated, its playability is not. If you want a game that you will spend countless hours playing with no hope of an easy victory, coupled with the lack of Achievements to document your epic feats, then this game might be perfect for you.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. Spent ♥♥♥♥ knows how many hours playing my old version of this back in the day. What little ive played on steam is probably like when a todler pisses in the ocean of my many hours of time spent on this ♥♥♥♥. Amazing game",
            "review_score": "1"
        },
        {
            "review_text": "Buy it for the nostalgia, buy it because it's a fun way to waste an afternoon, but don't buy it for the Mac port. There basically isn't one. They just threw Wine at it and called it a day. The game supports resolutions higher than 800x600, but you'd never know it if you ran it on a Mac. It comes with 3D setup programs for Glide and DirectX7, but you can't run them from OS X, so there's no way of knowing what resolutions Wine might support. Hand-editing the text file with common resolutions just fails. For the best experience, you're going to want to run this under Windows.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of money:  Combat is incredibly slow. The graphics are terrible even by 2001 standards. The draw in distance is really short. The world design sucks and is totally forgetable. NPC interaction sucks. Towns are worthless. It is not fun at all.",
            "review_score": "-1"
        }
    ]
}