{
    "app_id": 245490,
    "name": "Trials Fusion™",
    "release_date": "2014-04-24",
    "developer": [
        "RedLynx, in collaboration with  Ubisoft Shanghai, Ubisoft Kiev"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "In-App Purchases",
        "Partial Controller Support"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Multiplayer",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 1141,
    "negative_ratings": 615,
    "price": 16.99,
    "description": "Trials Fusion is the gold-standard platform racer for the next-generation of gaming. Built upon the Trials franchise’s proven gameplay foundations, Fusion challenges players endlessly in both classic and all-new ways.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/245490/header.jpg?t=1511961896",
    "minimum_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 or Windows 8.1 Processor: Intel Core i3 550  @ 3.2 GHz  or AMD Athlon II X4 620 @ 2.6 GHz Memory: 3 GB RAM Graphics: NVIDIA GeForce GTS450 or AMD Radeon HD5770 (1024MB VRAM with Shader Model 5.0 or higher) DirectX: Version 11 Storage: 8 GB available space Sound Card: DirectX 10.1 Compatible Sound Card Additional Notes: DirectX 10.1 or higher required",
    "recommended_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 or Windows 8.1 Processor: Intel Core i5 2400s @ 2.5 GHz or AMD Phenom II X4 955 @ 3.2 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 560 Ti or better / AMD Radeon HD7850 or better DirectX: Version 11 Storage: 8 GB available space Sound Card: DirectX 10.1 Compatible Sound Card Additional Notes: DirectX 10.1 or higher required",
    "reviews": [
        {
            "review_text": "In my opinion this game stands on its own as a Trials game, but there are a few things that I hate about it and force me to not recommend it. First up is Uplay. Everyone hates Uplay.   There are never any players online, so there goes that whole section of gameplay... there's never anybody to play with.  The DLC is just a huge money grab. The game by itself doesn't have enough content to justify the $19.99 price tag. I paid it and expected a lot... I got a little with the offer to pay more to get tracks that should have come with the game. That extra $19.99 for the season pass seems steep, because it is. $40 for a 'complete' game that doesn't have much depth or the replayability of the older Trials games is a rip off. If the DLC (which should have come with the game anyways) was included in the original price, I would be more apt to recommend it.  Screw Ubisoft for being so greedy, and for forcing Uplay on the innocent.",
            "review_score": "-1"
        },
        {
            "review_text": "as much as I love the the Trials series, I can't recommend this game to people. I'll play the living hell out of it because I'm obsessed with the series, but it takes a very specific kind of person to really squeeze 50 dollars of play value out of this (base game + all DLC).  Ubisoft really did some damage to the series and this game hardly stands well against previous games in the series. I still believe Trials HD is the best in the series, but that's more a personal opinion. I would recommend checking out the previous game, Trials Evolution Gold Edition, rather than settling on Fusion. Although the multiplayer is still rather empty, it's still a more down-to-earth title that keeps a lot of the aesthetics that make the Trials series so great. Plus it has way more tracks in the base game than Fusion does.",
            "review_score": "-1"
        },
        {
            "review_text": "Trials Fusion is the latest installment in what has generally been a game that offers a simple premise but provides a lot of gameplay punch. While there aspects of Fusion that I am greatly impressed with, there are a few things that I am unhappy with.   For those unfamiliar, the Trials games are a very simple premise. You're riding a motorbike (along with other vehicles in Fusion) across a large variety of tracks with physics being the ultimate gameplay component. You have to control the bike properly or you will wipe out.....A LOT!  I've broken this into a simple pros/cons list for anyone that has tl;dr issues :-)  Pros: + Looks fantastic. The colors are rich and have real pop to them. If you can play this in Ultra at the highest resolution you're in for a treat, even at lower resolutions it still is great eye candy + Base game course design is interesting for the most part and the futuristic setting adds more than I thought it would. + Trick/FX gameplay styles really add to the depth and encourage playing tracks multiple times with both fastest times and trick scores being seperate goals. + A ton of community made tracks at your fingertips.  Cons: - Pricey DLC with the season pass costing the same price as the base game making MSRP for both base and season pass (a.k.a. Deluxe Edition) just $20 less than a AAA title. There have been two DLC packs released thus far with more to come. - Some base game courses are much shorter than you'd expect. - Lacks the challenge at the lower levels that earlier Trials titles brought. Seems watered down for casuals/newcomers in respects. The physics are still brutal depending on course, but definitely easier to get the hang of. ATVs are disgustingly easy. - Four months after release and online multiplayer is still not in the game, yet is promised by the developer. This is UNACCEPTABLE when being advertised as having multiplayer especially at the cost of the full package. Local multiplayer only at the moment (8/23/14 is the date of this review). - Tedious unlocking system. - There seems to be some measure of a 'story' mode to the single player game where you're regularly spoken to by a female AI similar to GlaDOS of the Portal games, except the Trials AI lady lacks the wit of that classic character and is generally just grating.  Let me be clear, while my cons are glaring, I do not regret my purchase of this game. I have a real soft spot for this series and have gotten a lot of mileage out of the earlier titles and am going to continue to play this one as it plays well and I can't overstate how great it looks. I was first introduced to Trials when it came out on Xbox 360 Arcade and I put well over 100 hours into that iteration of the game. I hesitated on this new one until I upgraded my hardware and now that I have, I am very glad I waited at least until then. That being said, unless you are like me and a fan of the Trials series and know what you're getting into, do yourself a favor and hold off until this is on sale.   I recommend this with a caveat. Definitely pick it up when on sale, but unless you're really into the series/gameplay style, you're fine waiting. ",
            "review_score": "1"
        },
        {
            "review_text": "Trials Fusion is a work of beauty.  I may not be an aficionado, having only spent ~100 hours playing the original. Mostly by myself, but often with friends, loving every second of it. I've probably crashed 100,000 times, but I have a few accomplishments in the more extreme trials that I'm proud of.  If that describes your love of the game, then you will like this one too. I've read that some people have problems with framerates, but I have not. The video options allow for a lot of tweaking to match your video card's capabilities it seems. I have 18 hours clocked on Trials Fusion at the time of writing this review.",
            "review_score": "1"
        },
        {
            "review_text": "game constantly crashes sayin trials_fusion.exe has stopped working many people have had this problem so i dont reccomend it at all",
            "review_score": "-1"
        },
        {
            "review_text": "The track creator alone is better than most games of this price. Utterly brilliant and addictive as hell. I also loved the previous Trials games too, though.",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game with a passion... 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "THE GAME IS SICK! Lots Of Stuff Of Crazyness!",
            "review_score": "1"
        },
        {
            "review_text": "it suck ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "no multiplayer, no refund, 1/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is essentially Trials Evo with tricks and nicer graphics. What could be better than that? Very rage inducing at times, as the last few tracks verge on impossible.",
            "review_score": "1"
        },
        {
            "review_text": "Whilst it sucks that you have to deal with uplay, Trials Fusion is a really fun game, and the tracks are more challenging than those in Trials Evolution. However each individual track does not feel as unique as those in Evolution, which is quite a shame, also the Gigatrack does not make a return which is a real bummer. Hopefully some good community content will fill in the gaps.",
            "review_score": "1"
        },
        {
            "review_text": "I have always loved Trials! I wish they would've kept the online multiplayer but I understand their decision behind making it local only. Great game!   Brings me back to playing hours of Excite Bike as a child  Edit - They've added the online multiplayer as of a recent update! Thank you!!! &lt;3 The last pack in the season pass took a while but they brought a lot to the table and over all the DLC definitely worth the value!",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, I love this game. Just not on PC.  2 reasons why. 1: Its Uplay, 2: It's super laggy unless you have like a huge super gaming computer.  It's waaaay better on console... Sorry to say that, but it's true.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, I love this game. Just not on PC.  2 reasons why. 1: Its Uplay, 2: It's super laggy unless you have like a huge super gaming computer.  It's waaaay better on console... Sorry to say that, but it's true.",
            "review_score": "-1"
        },
        {
            "review_text": "Requires UPlay account to play.",
            "review_score": "-1"
        },
        {
            "review_text": "That 0.3 hours it has said I've played? Yeah, no.  Game crashes before I even get to the menu, so I don't know where that time played comes from.",
            "review_score": "-1"
        },
        {
            "review_text": "KEEP AWAY from this game if you liked Trials Evolution Local Supercross.  I bought this game only to play with my friends i Local multiplayer 4-player Supercross.  Well... the track central is DEAD on that category. And when i say DEAD i mean DEAD.   really stick with Trials Evolution and to be honest forget Trials franchise after evolution if you like Local Multiplayer like me.",
            "review_score": "-1"
        },
        {
            "review_text": "It's good, I guess.",
            "review_score": "1"
        },
        {
            "review_text": "beast of a game oh yea i beasted it to ",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly really fun. Tough as nails at times, but that's part of what makes it so fun.",
            "review_score": "1"
        },
        {
            "review_text": "Trials Fusion is an excellent entry to the series. Here's why:  RedLynx tried something different this time around, and it works quite well. The trick system is an excellent feature put into the game. It promotes replayability of tracks by having the user see how 'flashy' of a run they can nail and show off to their friends. It's based off of the famous RedLynx physics engine, making it intuitive, nice to look at, and at some points, silly to observe what may happen during a crash.  But beyond the trick system, there's even more in terms of the traditional trials game. There's the usual spike in difficulty, where the last few groups of levels WILL test your patience, skill, and sanity. The levels themselves still keep their usual charm; being put in wacky/amazing environments, seeing things interact around you, it's all here. The environments all look great and there's enough variety to keep you happy.  Now there are trick runs, where you have to see how many points you can get on a special track designated for this new system. I like this, because sometimes you want to do tricks on the normal tracks, but you know it may hurt your time. It seems they're trying to cater to those who like to have a little fun in between the serious time trials, and I respect their approach to it. It works for them.  Skill games are back, and they're as fun and silly as ever. I don't agree how they made them a requirement this time around, but it's not the biggest issue in the world  Each of the bikes actually has a specific purpose and will be used depending on which track you're participating in. This is WONDERFUL. I remember in evolution you would use one or two bikes, because the only things the new ones did was have more power. I REALLY appreciate RedLynx making each bike unique and useable.   There's some really nice biker customization as well. Lots of cool, future-y outfits to choose from.   I'm really excited excited to see where the DLC takes this game. Although the game had a less-than-stellar launch, I'm still very happy with this product, and cannot wait to play through more trials. It feels like a trials game through-and-through to me, and that's what matters. It's a quality product that will only get better with more tweaking and additional content. I believe this is completely worth your money if you are a fan of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Eh the book was better.",
            "review_score": "1"
        },
        {
            "review_text": "Top shelf game. I usually don't get into single player centric games but this one got me by the short and curlies. some 600 hours dumped into this game. Brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "good game. especially if your like mee andrecently broke your hand.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, if you liked gold evolution you'll like Fusion, a lot more tricks to do in it and creating games is fun as well!",
            "review_score": "1"
        },
        {
            "review_text": "Yeah you know UPlay? Like that one kid in school who was weird and pushy and agressive and annoying and you couldn't stand him, but since he had a slight mental disorder and was like twice the size of you you had to play with him. Well yeah, thats trials fusion's plus one and theyre in-♥♥♥♥ing-seperable. (It now also comes with a special feature of making the game near impossible to start, as in i have been trying unsuccessfully for 10 minutes now)",
            "review_score": "-1"
        },
        {
            "review_text": "It's a great game, but when turning your bike it's a bit difficult controller or not. There's tons of levels and can make you rage a bit. I would recommend this to anyone who likes a big challenge. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "now, I bought this game a while ago and found out this game has good graphics, too good. i cant play because of the video card it looks awesome so.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, but when turning your bike it's a bit difficult controller or not. There's tons of levels and can make you rage a bit. I would recommend this to anyone who likes a big challenge. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Seeing L0TS of butthurt in these reviews.  This game has an insane difficulty curve. That's just how it is. Keep playing easy tracks until you get used to how the bikes handle, THEN try the hard tracks.   0ff that note, this game looks simple but has a lot of depth, like any other Trials game. The finesse and timing required for the harder tracks is something you won't find in almost any other game. Every little tap of the throttle, little shift of weight makes a huge difference. The gameplay is truly something to behold.  The graphics are pretty nice, though they aren't particularly well-optimized. A somewhat beefy PC is required to run this game well.   Track customization is limitless; you have the same tools the developers do.  FMX is my only complaint; the tricks are super unreliable.  While not the best in the series, this is definitely a game worth playing if you have a lot of patience for difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Have played all the Trials to date and love every minute of it. Not sure what problems people are having with the PC version of this game, but it loaded up fine for me and plays smooth. Multiplayer is local atm, but they are releasing the real content very soon. It's fun, buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Taking everything the previous games did right, and combining it with even crazier level designs, and greater physics! Welcome to Trials Fusion, the perfect game if you're up for a challenge. And I can promise you, there are levels that are close to unbeatable, but that's part of the fun :D",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of Trials I recommend picking this up. If you're not a fan then you probably won't have a good time with this game.   A controller is definitely recommended, but I'm getting comfortable with my keyboard now.",
            "review_score": "1"
        },
        {
            "review_text": "Crashes way too much. Get Trials Evolution Gold Edition.",
            "review_score": "-1"
        },
        {
            "review_text": "buy trials evolution, dont waste your time with this one",
            "review_score": "-1"
        },
        {
            "review_text": "Symply put, the game does not work.",
            "review_score": "-1"
        },
        {
            "review_text": "Game has flips 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's like Super Meat Boy, but with bikes instead of platforming. It uses a whole different skill set, but if you liked Super Meat Boy then you'll probably like this game. Very precise, very challenging, very well put together. Uplay is annoying, but not deal breaking.",
            "review_score": "1"
        },
        {
            "review_text": "this game is great.If you liked the original trials games then you will love trials fusion.great graphics and awesome tracks.",
            "review_score": "1"
        },
        {
            "review_text": "The game by itself is amazing and the $/hour value is insane with all the content you get from used created content, but there's a slight flaw which is best explained with an example:  1. Decide to play the game. 2. uDontPlay update 3. Launch game - unskippable logos, but that's okay they're short. 4. Preload before the main menu. Okay, could've done that during splash screens, but okay. 5. Connecting to Ubisoft servers..... 6. Still connecting. 7. Failed to connect to Ubisoft servers, hit retry, 8. Finally connected to Ubisoft servers, yay. 9. Browse around the menus checking for new stuff. 10. Random freeze, Ctrl+Alt+Del =&gt; End task. 11. Wait for uDontPlay to do some bs before it shuts down. 12. Relaunch game, surprisingly uDontPlay hasn't been updated since then. 13. Splash screen logos, preload, connecting to Ubisoft servers. 14. Failed to connect to Ubisoft servers, hit retry. 15. Go straight for playing this time, let's see the new content. 16. Spend ~2minutes to complete the first medium map in the new pack, loving it! 17. Autosave after the level completion takes about as much time as the level itself. 18. Lost connection to the Ubisoft servers............. That explains it. 19. Hit retry, twice this time, before it actually works. 20. Back, back, back, back, quit game.  That's ~15-20 minutes of Ubisoft bullcrap to play two minutes of an otherwise solid game. Guess I'll try again in a couple months.... but every time I try to pick this game back up it's the same reason that makes me shelve it and that's uDontPlay. I'll admit, the freeze could've been a bug from Redlynx's side, but I wouldn't be surprised if Ubisoft DRM is so well integrated that it is the reason why the menus are so slow to swap inbetween to begin with. Setting up Excitebike on a NES emulator from scratch would probably take less time than each fresh launch of Trials through uPlay after a prolongued absence.  TL;DR Great game that's close to unplayable thanks to a U shaped anchor.",
            "review_score": "-1"
        },
        {
            "review_text": "it's soooooooooooooooo awesome. if yuo liked it get trials frontier for free on the app store.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "It's really just more of the same. I preferred the last one, as this futuristic style just feels weird. I like driving over objects that actually exists and that you'd actually drive over in real life.  If you're a perfectionist and refuse to have errors and need to restart every time you wipe out, you'll get annoyed with the pre-scripted voice lines playing over and over and over again. They didn't need to add vocal parts for a game that is based on repitition. Oh well, decent buy I guess, but wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan, stay away until all DLC release",
            "review_score": "-1"
        },
        {
            "review_text": "Not evolution. Closer to that one playstation kartingTM game. 0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "no multiplayer and a lack of community levels (that you can dl without the dlc) makes this game not worth the time. Buy trialsevolution instead.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're a fan, stay away until all DLC release",
            "review_score": "-1"
        },
        {
            "review_text": "Never played any of the Trials games before, Seen this on sale for £6 so becasue it was something alittle different than id normally play i thought id give it a try, Kind of reminds me in ways of a mixture of FlatOut &amp; TrackMania but on a trials bike. Great graphics and really fun gameplay, The physics can be really fun too. Some of the late tracks are really insane and really challenging.  Cool thing is there is a track editor and the devs share maps between console &amp; pc.",
            "review_score": "1"
        },
        {
            "review_text": "Great game highly addicting ",
            "review_score": "1"
        },
        {
            "review_text": "The game is like an ipad game moved to the PC, it only runs in so little resolution that its like playing on the ipad but i cant forcefully press my fingers on the screen, unless its me trying to smash that little ♥♥♥♥♥♥'s head in the main menu out of frustration. It then makes me feel worse at the people playing this game saying it looks great and is fun, while im sitting here watching my guy go in slow motion as a mash the A button madly doing backflips and jerk off with my tears. I feel like an idiot staring at the tiny screen that the game runs on and it doesnt help that the rest of the game wont run at normal speed unless it looks like pong and trials HD had gay sex in a back alley. I dont think anybody should buy this game due to my problem but who gives a ♥♥♥♥ Trials can ♥♥♥♥ in a potato, cook it for 5 hours and slam it in a case and name it Trails Fusion and everybody wil buy it anyways.",
            "review_score": "-1"
        },
        {
            "review_text": "Play this game and have fun! Well if your fun constitutes repeatedly crashing and ragequitting...",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, but it's not as good as Trials Evolution. That game was very long and offered so much deversity in the modes and level design. Add the crazy amount of unique user created levels, multiplayer and you have a classic.   Cons - Fusion is a pretty short game and the heavy handed futuristic theme is off putting after a while. If I have to hear that, welcome to future song one more time, ugh! The DLC has been pretty nice but they're short levels and not worth the price. The selection of user created levels is limited and not very interesting so far. No online multiplayer and the local multiplayer is a shallow experience. The later levels get ridiculously hard.  Pros - It's still a Trials game and the controls are awesome. The new trick feature done with the analog sticks is a welcomed addition. The soundtrack during the levels are pretty sweet. So I still have to recommend it if you're a Trials fan, but I'd wait till i goes down in price.",
            "review_score": "1"
        },
        {
            "review_text": "there's a more exxtreme version of ninja tracks....named SINJA.....",
            "review_score": "1"
        },
        {
            "review_text": "The last 2 tiers of Trials Fusion made me just play another game instead of this.",
            "review_score": "1"
        },
        {
            "review_text": "BUY EVOLUTION INSTEAD.  For people deciding on which trials game to buy, BUY EVOLUTION. Trials evolution was better than this game in pretty much every way, once you've squeezed evolution dry for all of its content, you can buy this one and play it too.  Good: + This game has a bigger online community than trials evolution. Even so, its good to play through single player first, which is why I still recommend evolution over this.  Bad: - Some of the music in this game is good, but trials evolution had much better and more memorable music. The title screen music for this game is nauseatingly bad. 'welcome to the future'  - The grapics on this game are so boring compared to evolution. They went way over the top with the 'futuristic' style. Everything is made of polished metal and strip lights, which gets very boring after a while. Trials evolution is grounded in reality which makes it look much nicer and it ages better.  - Uplay  - Uplay  - Uplay...",
            "review_score": "-1"
        },
        {
            "review_text": "u need to pay to play the campaign after u have done all the easy once....",
            "review_score": "-1"
        },
        {
            "review_text": "Keeps crashing at the loading screen, waste of money get it for console",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks!",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME. If you dont have the perfect gaming computer, and you are just a kid, do not buy this game. Apparently your 'gbu' thingy needs to be updated or something so you basically need to spend more money. It also makes you download and create so many new accounts. YAYAYAYAYAYYAYAYAYAYAY I HATE YOU STEAM FOR EVEN ALLOWING THIS GAME TO BE BOUGHT.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy fusion if you have never played these games.  I hadn't played them before so I had no tie to any- I got gold edition on xbox and fusion on pc and like Fusion Way More.   Evolution is just a bunch of old wooden planks, but I found fusion to be very crisp, diverse, and colorful.   Although I hate Uplay, I had no issues with this one.  ",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game, fun with friends !",
            "review_score": "1"
        },
        {
            "review_text": "I've always like the Trials franchise and this one isn't any different. Its pretty easy and entertaining up untill you get to the hard levels.... Then it's very frustrating but theres nothing like learning how to beat a level that has beat you so many times in the past.  The graphics are beautiful but it seems like the game isn't very well optimised or my graphics card is showing its age. I had to turn the setting to medium so it wouldn't fall under 30fps (most of the time. It still does sometimes). Another thing I noticed is that the framerate seems to effect the gameplay. When my frames would drop the game would get slower.... dunno if that means its hardcoded to the framerate or what but it was quite annoying till i lowered the settings.  The online tracks range from awesome and fun to terrible and frustrating. Some tracks are smooth where you can hit most of the jumps perfect and just makes for an enjoyable experience. On the other hand some tracks are horribly designed (understandably, these people aren't pro designers) with bad camera angles and obsticles that you basically have to have blind luck not to crash into. Another thing about online tracks is that a lot of them aren't rated correctly. You'll have tracks that are medium that should be labeled easy and some that are hard/extreme that are labeled medium.  Overall it's an enjoyable game if you like these type of games. At the moment it's on the humble bundle store for $9.99 which I'd say is worth it.  One other thing I forgot, it's a Ubisoft game so it requires Uplay. Uplay is annoying  Edit: One last thing I forgot to mention is that there's this bug that has been in most of the trials games where you're going up a hill and you let off the gas and lean forward and your back wheel comes off of the ground, you lose traction and fall to your doom.... I ♥♥♥♥ing hate that... Theres no physical way to actually lift your back wheel off of the ground when you're in that position....... I have no clue why they think it works like that but it is very frustrating and will (judging by it being in the last trials game too) never be fixed.",
            "review_score": "1"
        },
        {
            "review_text": "The actual gameplay is 8.5/10 but this game is not finished. For a premium price game I expect multiplayer and way more content.  Ill give it 5/10 overall.",
            "review_score": "-1"
        },
        {
            "review_text": "Controller support for this game and trials evolution is f**ked ubisoft must have updated the game and broken them both",
            "review_score": "-1"
        },
        {
            "review_text": "'trials_fusion.exe has stopped working' nuff said",
            "review_score": "-1"
        },
        {
            "review_text": "This. Awesome game! I dig it so much. It's hard as ****. But extremely rewarding when you finish that level you've been struggling with! It is also alot of fun in multiplayer! :) NB: The title song will haunt your dreams! (But it's awesome).",
            "review_score": "1"
        },
        {
            "review_text": "Good game but Trials Evolution Gold Edition is better.",
            "review_score": "1"
        },
        {
            "review_text": "game itself is not the worst thing... but the FMX trick system sucks. I cant even finish the stupid wind turbine training. they don't give you any clue how to do the trick and for some reason tricks overlap on buttons. I tride every button combination in different bike possisions &amp; twists, but he just won't replicate the screen. If you wanna play trials, go for evolution",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great! Whether you want to drone out, play seriously, or just watch the hilarious animations after you crash, this one is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Lacking in Content and Repetitive",
            "review_score": "-1"
        },
        {
            "review_text": "What a waste... I had tried the demo on Xbox and didn't like but I figured 'hey they made 2 great games before, they know what they do', well they do not. I love the first two games but this one is only broken version, everything I loved has gone : - Music is now some kind of pop crap - I had a gold medal in all the races (but extreme) within an hour. - The motorbikes seem less reactive, the quads are a shame - Who hadn't thought before 'it would be fun if we could do tricks', now we realise it is not. - No online multiplayer yet...  By or keep he previous one.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow this is hard. Play this if you ever thought you were good at driving games. Then think again",
            "review_score": "1"
        },
        {
            "review_text": "This game has the most awesome loading screen ever. Awesome music, makes you pumped to play the game! The game itself is really good, too ;)",
            "review_score": "1"
        },
        {
            "review_text": "very fun with static map designs that revolve around you ",
            "review_score": "1"
        },
        {
            "review_text": "Life getting you down? Not having a great day? Play this game and you will forget all your problems and be lost in a hurricane of frustration. 10/10 would rage again",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game but you need a good computer",
            "review_score": "1"
        },
        {
            "review_text": "__________________________8/10____________________________  Trials Fusion is a great game. Lots of fun to be had for anyone looking for a bit of a challenge. Overall, i cannot complain much about the game for the way it runs. The graphics aren't super next-gen amazing-ness, but they still are pretty, and in my opinion as good as it needs to be for this style game. I've had one crash, and I'm not convinced it was the game's fault.   As compared to the last few Trials games, it still features great challenges and a darned good selection of community maps, which gives this game near infinite playability if you enjoy how the mechanics work. Trials has always been about challenges an lunacy to me, and while Fusion may not feature as much as the lunacy as the previous games, the challenges are abundant and ready for you to make a controller shaped dent in something near you. When i speak of this lunacy being missing, in the last trials game i was always happy with how the maps, and events always caught you off gaurd, and said 'Hey, so what if there's a war going on and a nuclear shark just tried to shoot you with laser beams, ride your bike fast ad hard!!!'. Personally, fusion lacked this kick-in-the-groin lunacy i loved so much from the previous games.   Overall, Trials Fusion will offer you hours of challenging fun, but at times, may take itself a little too seriously as compared to the previous installations to the franchise.  ",
            "review_score": "1"
        },
        {
            "review_text": "Ive currently played a few hours of this game, and from my experience i can tell you this:  The cons are: Graphics Dude singing about the future  The pros: Dude singing about the future Controls are quite hard to use but you do get used to it Multiplayer.  9/11 would suicide bomb again",
            "review_score": "1"
        },
        {
            "review_text": "I know I've only logged an hour into this game, but as a very big fan of physics-based games, I have to say this one was a let down for me. I'm not going to complain about Uplay or say that the game isn't optimised correctly, because it plays wonderfully on my system at 60 FPS, ultra settings. There's really not much to Trials Fusion other than balancing your bike over different types of bumps, landing your bike correctly, and occasionally flying through the air to the next part of the track. Now don't get me wrong, there are neat tricks, solid physics, and a great presentation along with beautiful graphics. But even on sale like I got it, I'd say the $15-20 isn't worth it. Maybe at $5. If you want an awesome physics-based game where you do more than just grind through levels by shifting your weight on a bike to get over giant hills, etc., then I'd recommend you go play Happy Wheels. It's free, you can play it on flash, there is a far greater variety in vehicles/stages, and it's just more entertaining. I really love Ubisoft, but I have to say pass on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Trial Fusion is funny game, whenever u jump into trial fusion you will find a joke in your gameplay that is awesome. Mostly I play Trial Fusion when I meet DOTA 2 Try Hard Player, Thats annoying!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game steadily increases in difficulty from thinking you should probably take up motorcross, to then wanting to go back to school for a physics degree. The pacing throughout the game is pretty well done which makes you want to keep playing, but I found the trick system to be somewhat lacking.",
            "review_score": "1"
        },
        {
            "review_text": "The first level is the hardest. No not the tutorial stage, the uplay sign in. Game runs in slow-mo and have tried everything and thats when it even does log in...... 1/10 and thats pushing it.... total waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Trials Fusion at this time is nothing I would recommend.  The game is have some huge issue with frame rate drops, that will force you into super slowmotion. Even though I'm well within the system requirements, set all settings to as low as possible and ran the game in windowed mode I'm still unable to play the game smoothly.  Besides all that... The game looks great! The music and vibrant colors really gets you psyched to play. Some of the annoying audio elements such as the riders voice and the announcer could be turn off which is much appreciated.  If you are way, WAY above the system requirements then buy this game! Otherwise, do and be hopeful for a patch addressing the major issues or.... Just don't buy it.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Welcome to the Future.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a fan of Trials for some time, and I poured at least a total week into Evolution. That being said, I plan on pouring another week into this fantastic follow-up. This game has everything Evolution had and 5 times more. The stunning graphics, engaging setting and plot, FMX, and even more features in the editor are just a few of the great new things about this game. The one huge downside is the necessity of Uplay. It's really just a pain in the butt. However, the rewards and stuff along with the Trial Frontier connection kind of make up for the inconvenience. Seriously a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "It's a strange one. I played the previous game a loooooot, but this... it's not making me want to play it. It's .... sterile? It's just the same thing again, which isn't normally that bad but.... yeah, it's too similar. How much can you really do with a motorbike game? I think they needed to leave this for a longer time before coming back to the series. Let the heart grow fonder and then it'd have more impact.",
            "review_score": "1"
        },
        {
            "review_text": "A great addition to the trials series, I love the addition to FXM, The Rabbit, and the Panda. If you have the money, You better by this game!",
            "review_score": "1"
        },
        {
            "review_text": "good game tight controls, too bad there's not online multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "do not buy uplay ♥♥♥♥ it just dont work  only played it once and now cant even load the game up",
            "review_score": "-1"
        },
        {
            "review_text": "Controller support for this game and trials evolution is f**ked ubisoft must have updated the game and broken them both",
            "review_score": "-1"
        },
        {
            "review_text": "I played evolution on xbox and couldn't get enough of it. This game can have you wanting to destroy anything within arms reach then wanting to cry from joy all in the matter of minutes. Plus with the ability for user made tracks means that this game will have fresh content for a long long time at no extra cost.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ trials fusion it says i have praches asnother",
            "review_score": "-1"
        },
        {
            "review_text": "It is great. Even though Uplay is not the best I have had no problems.",
            "review_score": "1"
        },
        {
            "review_text": "There are three major issues that break this game for me. First, if you don't play for a while and want to start fresh, you can't. It's impossible to delete your Track Central data and start from a completely blank slate. Second, your times and ghosts aren't locally saved, so in order to beat your own times on the tracks, you have to have a cloud save, which cannot be completely erased. Third, you have install Uplay, a piece of software which basically duplicates Steam, in order to play.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Its good",
            "review_score": "1"
        },
        {
            "review_text": "I bought the Deluxe edition or something, telling me I get the Season Pass too. I don't have the newest DLC...",
            "review_score": "-1"
        },
        {
            "review_text": "Like so much that Ubisoft touch at the moment, this game is ruined by crazy levels of in game purchases for things we once got for free... and the annoyance I am having even activating the DLC I have purchased, correctly. I guess Uplay has something to do with it all.  After entering the product codes, the game tells me I have purchased all DLC, yet clicking on any of these items takes me to the store page via the steam overlay, suggesting I need to buy it, GRR.  The bug ruining Zombi was bad enough, forcing me to sit and wait in the vain hope it gets fixed, but this is a step too far. I am hoping it isn't too late for a refund should my cry for help go unanswered.  The game seems ok aside from this, but I have to warn others of the possibility of endless messages on forums.",
            "review_score": "-1"
        },
        {
            "review_text": "waste of money i payed £15.99 for a game that wont start up what a waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "I have owned this game for 2 years now and I have played it on and off. I have been waiting to write this review since the I purchased Trials Fusion. I have now put 103 hours into Trials Fusion and I can finally say I have 100% completed the career. The emotional roller coaster I experienced while playing this game is unfathomable. Anger, joy, sadness. etc. the list continues for more words than are in my vocabulary. I'm sure that by this point my blood pressure is that of a 87 year old chain smoker, yet I don't mind. The satisfaction from completing a level or even improving a previous record is such an enlightening feeling. The rage and hatred that was once there is replaced by an abundance of good emotions. You battle no one but yourself, it is all a battle of your own skill. It takes away from the competitive nature of so many games and brings you back to the basics of what a game should be, frustrating beyond belief but satisfying. Red Lynx has done an amazing job putting together Trials Fusion and I could not be happier with the game.  10/10 Buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Near perfect zen game. The squeal of the tires and the thrum of the engine just obliterate your mind into perfect nothingness.    PS: Turn off their soundtrack and use your own. PPS: ♥♥♥♥ Uplay.",
            "review_score": "1"
        },
        {
            "review_text": "Its amazing!!!!  But WAYYYYYYYYYY to many dlc packs  it costs to much money!! ",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying this game is actually really fun. The problem I have with it, is that it will not boot. It just crashes as soon as it tries to load. Well done Ubisoft, you have made another game which does not work on pc.   I had to edit the graphics configuration *myself* in order to get this game to boot. I should not have to finish coding the game for you in order to get the game to launch, and yes, this game has had numerous patches supposedly fixing all the problems it came with when it was released (HA!).  This has just solidified my reasoning that Ubisoft really doesn't care about the consumer.",
            "review_score": "-1"
        }
    ]
}