{
    "app_id": 245430,
    "name": "Wizardry 7: Crusaders of the Dark Savant",
    "release_date": "2013-09-10",
    "developer": [
        "Sir-Tech"
    ],
    "publisher": [
        "Gamepot, Inc.",
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 71,
    "negative_ratings": 23,
    "price": 0.0,
    "description": "For the First TimeOutdoor CampaignsFull Soundtrack and EffectsTrue Point &amp; Click Mouse InterfaceAuto-MappingUnprecedented Depth of StoryBegin your adventure in Crusaders of the Dark Savant. Import your characters from Bane of the Cosmic Forge or create a new party capable of surviving the rigors of a strange alien world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/245430/header.jpg?t=1466791313",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 3D graphics card or or onboard graphics compatible with DirectX 9.0c DirectX: Version 9.0c Storage: 768 MB available space Sound Card: 100% DirectX 9 compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Procesor Memory: 1 GB RAM Graphics: 3D graphics card or or onboard graphics compatible with DirectX 9.0c DirectX: Version 9.0c Storage: 1 GB available space Sound Card: 100% DirectX 9 compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "Old school turn-based RPG action with an engaging story, interesting NPCs, a surprising degree of non-linearity. Add in deep character customization and actions that actually have long-term (and sometimes surprising, unintended consequences) and you've got a gem with some true replay value.",
            "review_score": "1"
        },
        {
            "review_text": "OH GREAT NOSTALGIA!!  This game is aweful without nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "The next installment of this great classic! 9/10 if you are a fan of old school games like this",
            "review_score": "1"
        },
        {
            "review_text": "OK~~ WHY in the ♥♥♥♥♥ does it have to be so ♥♥♥♥ing hard to import games?? boldesr gate had the same ♥♥♥♥♥♥ problom~~!! i DONT wont to ♥♥♥♥ing have to make files and go into the diretory to ♥♥♥♥ around with ♥♥♥♥! i hop one day ONE DAY they well make a game- (not gears of war effect) &gt;mass effect) in witch you can just click inport and be done with it!!!....it ♥♥♥♥ing sucks ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "An old school dungeon crawler that has kept me entertained and enthralled for more hours than even steam can register. I played this game back when DOS was a necessity to even think about playing a game. It was fantastic then and just as good as I remember it, giving both a fun and challenging experience to any would be RPG fan.   Just do yourself a favor-- avoid the gold edition.",
            "review_score": "1"
        },
        {
            "review_text": "yeah, i guess you have to be a true die hard fan of these ♥♥♥♥♥♥ ♥♥♥ games to get the slightest amount of enjoymest from it. In your first battle you'll get your ♥♥♥♥ handed to you and I would say that makes this a bad game.   Do not buy this dogshit title",
            "review_score": "-1"
        }
    ]
}