{
    "app_id": 246090,
    "name": "Spacebase DF-9",
    "release_date": "2014-10-27",
    "developer": [
        "Double Fine Productions"
    ],
    "publisher": [
        "Double Fine Productions"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Space",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 741,
    "negative_ratings": 3134,
    "price": 6.99,
    "description": "In Spacebase DF-9, you'll build a home among the stars for a motley population of humans and aliens as they go about their daily lives. Mine asteroids, discover derelicts, and deal with the tribulations of galactic resettlement in Earth's distant future.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/246090/header.jpg?t=1479171211",
    "minimum_requirements": "OS: Windows XP Processor: Core 2 Duo or Higher Memory: 2 GB RAM Graphics: Intel HD Graphics 3000 with 384 MB of RAM Storage: 200 MB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": "OS: Windows 7 Processor: Core 2 Duo or Higher Memory: 2 GB RAM Graphics: NVidia GeForce 9800 GTX+ or higher Storage: 200 MB available space Sound Card: DirectX Compatible Sound Card",
    "reviews": [
        {
            "review_text": "sad to see this title get cancelled. it is extremely fun to play and watch your people get infected with space parasites",
            "review_score": "1"
        },
        {
            "review_text": "November 2016: Now that the game is not so buggy and it is unoficially supported by the comunity, it is good and I really liked the time I had playing it.  The major problem is the one-unique save-upon-exit (but there is a bypass for it). Permadeath is not a bad idea, since a careful strategist can beat the game and build the 'perfect' base farely easy. BUT the game still has some minor bags (once my 5 guards squad was stuck running on a wall wile 1 intruder was destroying my life support systems, another time the guard with low oxigen in his spaceswit didnt want to follow my waypoint to safty and prefered to suffocate etc). If i had only one save, I would had abandon the game in the obavo acations, writing a rage review.  BUT: I reguraly exit the game and copy-paste the two save files at another folder, so I can paste-overwrite them agan later, to properly handle buggy or annoying situations. That, made the game a really nice experience: A more casual Rimworld type of base building.  I strongly recoment if you go on with SPacebase, to get the unoficial patch 1.08. It adds things in the game and helps for better control of the guards (really useful).  So, I recomment the game, but since the publisher is not supporting it any more and community/freelances do the job instead, I am a bit sceptic about the 10 euro pricing... Check on some gamply videos and comunity feedback, and then deside if you would prefer to wait for a high discount before purchasing this actually good game.  (ps. Rimworld has also still many minor bugs, but the save system is there to make me forget about them...)",
            "review_score": "1"
        },
        {
            "review_text": "Really great IF it works. It was doing great then suddenly, it doen't work! No idea why  If it works, you've got a great, near endless game.  Can't help but feel double fine left it.",
            "review_score": "1"
        },
        {
            "review_text": "Im recommending it because it is fun and still challenging so its a good balance",
            "review_score": "1"
        },
        {
            "review_text": "May 17 2015:  It's broken asf, don't even bother spending any money on this.  I opened the game, clicked tutorial. And nothing else happened. Couldn't do anything even after several tries. It's a waste of money, and that steam is selling this for 20bucks is ridiculous.   EDIT October 8 2015:  An update rolled out and the game now actually works, I'm greatly enjoying this even though it's mostly basic base building with not too much to do other than assign people to mine, food, build and maintenance.   It's fun but gets kind of dull after a while, I'm now changing my review to positive only due to the fact something has changed and it actually works in an enjoyable way.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, Double Fine stopped working on it, but a team of coders called the 'spacebace restoration squad' are trying to finish it. Oh yeah, also, most of the bad reviews are fans who are mad at Double Fine abandoned it.",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad, its a little hard to start off but its pretty fun!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really sure why this game has bad reviews. It's so amazing.  Pros: Make a base. IN SPACE. Have emotional people in space. Realistic features like oxygen.  Cons: Needs tweaking because it gets really laggy, Building mode gets wonky. Guards don't react to pirates that well. Needs a peaceful mode, pirates are random and overpowered.  Overall, this game is really addicting. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "After glancing at the review page for this game, I feel obligated to share my experiences with this game.  Some of the positives: *You have to actually plan a base and monitor your resources in order to survive *Every play through is different.  *You choose what type of game you plan on embarking on from the very start.  - Do you want a lot of hostiles?  - Do you want to build your base close to a warp gate so you will have visitors (Friendly &amp; hostile?)  - Stellar Density: Do you want to have an abundance of 'money' or do you want to have to really work for it?  Some of the negatives: *Yes, the game is no longer being developed *Yes, there are many things not completed  -The game is still very much playable *Yes, there are many features that should have been added in, via the Dev’s constant updates, such as:  -Multi-level base construction  -Teleporters  -holodecks  This game started out as an early access game and unfortunately it also ended that way. The way I see it, anyone on steam, including myself, takes a chance when buying a game that is in early access. Will it be phenomenal? Will it suck? When will development finish? Will it ever finish? Will this new bug fix crash the entire game?   The game may not be 100% complete, but at least Double Fine released the source code to their fans to continue development. Sometimes, it's the fans that understand the game on a much deeper level than the developers ever could.   With that being said, should you purchase this game at $20?  In short...NO WAY!! Should you never play this game though? NO!!! Wait for it to go on sale and purchase once the price drops to a good amount. You can get HOURS AND HOURS of play time out of this game - and isn't that what you want from any game you decide to sit down and play?!?! ",
            "review_score": "1"
        },
        {
            "review_text": "People complain a lot because they got in early and made these fancifull assumptions they were owed a 60$ AAA game for an early 20$ drop to a small dev team.  it's a fun space base sumulator (hardly gets more niche then that), eventually everything falls apart, things get interresting, and you try to do things diferently.  Sure, it has a couple bugs here and there but people are being way too anal about tis game.  I got 18 ours of fun out of a 20$ indie title so I say it was well worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Good concept for a game, and funny at some places, but needs more game content &amp; flexibility. and I LOVE the music when you choose your base in the star system :3  I would recommend it, bu needs more content  6,5/10",
            "review_score": "1"
        },
        {
            "review_text": "great game! =)",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun for about 6 hours, then it peaks and I get bored of repetition. I do however think that despite minor functional issues like character pathfinding and a lack of replayability, it is fun if you are really a sci-fi fan. I will recommend this game in hopes that it still has a future of modability if Doublefine has truly stopped adding to the game.  Let the community make it their own!  7/10 Would play again once every 6 months or so...",
            "review_score": "1"
        },
        {
            "review_text": "Do you like DS-9.... No? Well I didn't either, but thats good cause this is completely different, You are a bunch of colonists launched from your home eons ago in stasis. And now you've arrived... with eight minutes of oxygen, you hurry to get life support on, when you finish building a basic airlock a passing ship hails you, requesting to come aboard. You send someone on to there ship and you meet someone running past you, then two killbots attack your station, you flee the station and spend your last moments floating in space, watching your oxygen level steadily deplete.......you die.  Buy it",
            "review_score": "1"
        },
        {
            "review_text": "i carnt get over the Negative (1,530) review's mayb this game was once bad/buggy/glitchy but im telling you now its a great game lots an lots of fun Double Fine Productions should get a medal for making such a great game and having poor review's from ppl who new the game was not ready you payed then played then complained instead of thinking its not fully done . Release Date: 27 Oct, 2014 this is a must buy game plz do not read bad review's take it from me GET IT then do me a favore do a good review if you agree",
            "review_score": "1"
        },
        {
            "review_text": "Hard game, but pretty fun. Takes a few run throughs to get things down. I ended up ditching several settlements before I started to figure out things. Most RTS games in a nut shell, though.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it was abandoned by DoubleFine because they realized that they had over-committed to the game. Yes, it is unfinished and feels a bit rough around the edges. This is, however, not a game worth only a 4/10 rating - people are rating their hurt feelings, not the game itself.  That said, it is not great. It's not bad, but not great. Easily worth a few hours of time, and capable of presenting a moderate challenge. Tentatively recommended for those who need a break between bigger and better titles.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game. I feel like it definitely works pretty well. It does pretty much work like Oregan Trail in Space, and I have noticed a few glitches (like if you vaporize an airlock, it leaves the air pressure gauge). Still it was pretty fun. And once you read the wiki page, it clears a whole lot up about the mechanics. Overall, good game, I recommend it.  I just wish that Double Fine could polish it up a bit... Maybe make a way to move the base?",
            "review_score": "1"
        },
        {
            "review_text": "dont listen to the other ♥♥♥ holes it may not be a finished game but if its in an alpha you cant hold it to high standards and alot of games where realeased unfinished like minecraft which will never be finished so if you what to buy a fun game that can be played whenever you have spare time like on a train get this",
            "review_score": "1"
        },
        {
            "review_text": "I know a lot of people a complaining about doubleFine not finishing the game, but that makes the game not bad. I didn't play to much of it (5-6 houres) but I realy enjoyed the game! Maybe it'll be a bit borring after more houres, but I'm sure that mods will come out soon.  About the game: The graphics are realy nice and the musik just awesome. The gameplay is simple but addictiv: You're building a space-base and have to survive attacks and the dangers of space.   I know the gam eis a bit expensive, so if you're not able or don't want to pay 20$ for it, wait for a sale.   DrBlock42",
            "review_score": "1"
        },
        {
            "review_text": "While it is sad what happened to this game, i have great hopes for the future, they are releasing the source-code with every copy of this game to allow the community to continue developing and improving it, i can't wait to see what people pump out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like prison architect, but it is funner and it is just as hard as prison architect. Do buy this game its pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "It's sad that the devs abandoned the game but, and that's the most important part for me, it's still fun playing. You want to build a digital space station in a way similar to dungeon keeper where not everything is too easy and people die or get attacked by aliens? You want to try it again and again and again till everything is fine and you can be proud about what you've done? Then buy it. You want something that's so easy every newborn gets bored? Well than look out for another game.   Some people might call it buggy and not finished, I call it challenging. Have a good day,",
            "review_score": "1"
        },
        {
            "review_text": "Well I have to start with saying that I am really surprised by all the negative comments on this game......but then again I bought this game in alpha, played about an hour, forgot about it after getting into other games and then when I got back to it there were tons of new features. At this point I had a blast playing it (even in its alpha state I could easily get 10+ hours of gameplay) and was sure that small balances and tweaks would add a lot to the games value.   I guess would sum it all up to I was not really expecting much. So as It is now I really enjoy the game, with no bias of previously reading dev posts of false promises and what could have been. What it is right now is a modern version of a god game where your in space.... think dwarf fortress meets the sims with a dash of spacestation sim. It does have its bugs and it is a shame that they still exist in the full 1.0 release but I am confident they will patch the problems over time.  As for everyone being hurt by how the devs represented themselves, the game, and double fine, (after reading the many reviews on this game) It really does suck. But Hey - At least it's not Infestation. Or any other of those super scamy games.... you got to admit that this game comes out as something pretty decent, even though it might still be a prototype.",
            "review_score": "1"
        },
        {
            "review_text": "it's a lot better now they finally fixed it up works great. now we just need Modding ability and it's sure to be a hit 8/10 buy it on sale",
            "review_score": "1"
        },
        {
            "review_text": "best game i have goten for 0.99 cents and there are still aspects that you can love with the grafics and you can become enraged quickly or play like a boss from the start.",
            "review_score": "1"
        },
        {
            "review_text": "I'm so sorry - even now with 1.06, read some episodes:  - Tried the new tutorial, how to play; got to the explore derelict task - but the derelict never appeared :-) :-( - Started a new game and despite in a sector with 'low' threats, there were plenty of hostile ships chiming in from time to time. - I was expanding my base; suddenly I got hails from friendlies. Two new ships/buildings appeared; one docked in the middle of a room building operation leaving it inaccessible; the other docked on a wall that had a ship engine. I could access the latter by cutting a wall and tearing down the engine to free the main entrance, but the former still inaccessible. - There's a dead raider lying in the room to be the second reactor room. I can not build a power generator since the raider blocks it - seems bodies just don't disappear. I also have a floating dead astronaut in the middle of my bar; he was killed when the room didn't even exist.  I've spent hours in the game but only got frustration out of it - whatever progress I made, disappearing floor tiles, stupid AI, bugs, ... ruined it. Maybe I should finally uninstall it - I'd have had fun with it if it had been more mature.",
            "review_score": "-1"
        },
        {
            "review_text": "When I get a full refund from Double Fine for Spacebase DF-9, then I'll consider buying another DF game. I don't care how great the guys developing Massive Chalice are, they're from the same studio that scamed me out of 25 bucks.  25 dollars, in the grand scheme of things, it isn't much. But there's alot of things I could've done with that 25 dollars, first thing that comes to mind is buy a case of mediocre beer.   Now when I buy a case of Budwieser I expect certian things; I expect bland taste, I expect to get a mild buzz, sounds like a pretty ♥♥♥♥ty use of 25 dollars right? Here's the thing, I was never promised anything more.  Lets expand on the beer analogy: instead of Budweiser, DF is now the brewer. DF promises me a pretty nice brew: nothing amazing, but something well worth my money. Having heard DF has produced some quality brews in the past I buy a case from the affable salesman. I take the case home, eager to try a fresh new flavor from the brewer I've heard so many good things about; then I open the first bottle. ♥♥♥♥, this bottle contains nothing but ♥♥♥♥ and ♥♥♥♥ fumes; disgusted but still hoping to at least drink my initial disgust away I open another bottle..........more ♥♥♥♥. So the evening rolls on with me opening up bottle after bottle of DF's ♥♥♥♥ untill the whole case is gone in the midst of my now pungent apartment I realize: that ♥♥♥♥♥♥♥ at DF scamed me.  I storm down to the storefront where I bought the not-brew only to find the signs down, the windows shuttered, and a note on the door: closed due to lack of customers.  That's the best way I can think to describe my one and only transaction with DF, they sold me a case of ♥♥♥♥ and said the reason the ♥♥♥♥ was ♥♥♥♥ is because not enough people bought their ♥♥♥♥. So I hope you fine folks at DF can understand why the next time someone asks me to spend my money on one of your products, I'll tell you to shove your product up your ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Double-Fine abandoned this game in a half-finished state.  When I get a refund for this, I'll think about buying something from these developers again, but the fact of the matter is that they have betrayed one of the core tenents of not only early-access game development, but also the free market. Money has changed hands. The consumers have paid for a product with the expectation that it will be finished.  That itsn't happening.",
            "review_score": "-1"
        },
        {
            "review_text": "Had so much promise, to find the developers have dropped the game &amp; handed it over to 'modders'.   The game then gets awards for 'empowering modders' which is BS. This game is dead, it should NOT be available for sale as its developement is dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Wouldn't Recommend this game A.I. is mainly broken and buggy.   The only update that they classified as it being released version of this game 1.0 are a few bug fixes and tutoral a massive 50.4mb probably done in a lunch time by the devs but took over 30 days to release.  I feel let down by double fines this was the first EA game I backed from them I had doubts at the time but felt I could trust them as they were a big company but they just seem to be using Steam for gold digging and are a fly by night EA dev's.  Don't buy this game if I had a choice I would get a refund and back a better game such as prison architect which I do own and can recommend two devs who done a better job than double fines.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfinished Game DoubleFine tried to cash grab with Early access , they thought people would buy and totally fund their game only from early access sales just like Prison architect did . they canceled this game claiming the early access did not fund the game.  the game itself is a base building survival game. you build rooms try to keep everyone alive and happy. and defend against pirates and invaders. Thats it . no plots no missions nothing  the game as it is Totally not worth the Price Tag.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is horribly incomplete, and Double Fine saw it fit to go straight to 1.0, skipping beta phase completely. It's a buggy mess, and this will likely never be fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "To start off, i'm more neutral towards the gameplay factor, but i have to give this a negative rating for the fact that DF just abandoned the game when they saw it progressed to slow. But here's the gameplay review, if you're still wondering if you should buy it or not :   The game's idea is wonderfull imo : build a base in space, maintain it and welcome new colonists into it while fending off raiders and managing the jobs the citizens do. The way they did it was not bad at all, simple drag-build controlls and assigning the different areas by a simple click of a button and design the interior as you like with various props. Easy. Simple. But the thing that made the game bad is the fact that it's unbalanced, buggy and just unfinished. The A.I is pretty bad in prioritizing their tasks, and with the new mood system there is just no way of keeping them happy, even if you furnish every room and give them their favourite jobs. they all eventualy get depressed and start fighting over nothing, which screws up the whole base and delays tasks as they recover in the sickbay. The gameplay is refined for an Alpha at the time, but there was no change in it whatsoever when it went to V1.0 .  I wouldn't recomend the game to someone who disliked game-breaking bugs and dumb A.I , but if you just like building a base and dont mind using mods to fix all of the vanilla game's problems, it is worth buying whenever it gets on sale. But otherwise, i sadly can'r recommend it, sorry Double Fine, but ya kinda screwed it up here. 4.5/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Incomplete game. Will never be finished. DO NOT BUY!",
            "review_score": "-1"
        },
        {
            "review_text": "Double Fine sold out, treated their fan base like idiots then tried to pin the consumers with finishing their game and still have the nerve to charge over $20 for a game they abandoned as soon as it finished beta. A quote from the developer: 'Double Fine is not a random fly-by-night indi dev and we are not going to silently pull the plug on Spacebase or any other in-development project. Doing so would be disastrous for our reputation and would kill us emotionally'  Unless they decide to be true to their word and finish what they started then their reputation should suffer. As for killing them emotionally they have done that to themselves.  Be warned when buying any Double Fine game in the future they are not to be trusted for games in development.",
            "review_score": "-1"
        },
        {
            "review_text": "Not finished. Should have never left Early Access.",
            "review_score": "-1"
        },
        {
            "review_text": "Why is this even still available for purchase?",
            "review_score": "-1"
        },
        {
            "review_text": "This 'game' is not worth your time. The developer and publisher could not be bothered to complete it. Labelling a game 1.0 does not make it so. It would be inappropriate for me to speculate where the money that was donated to funding the project went to or what it was actually used for but if the state of the game is an indication it wasn't allocated where it should have been.  The only reason you might consider paying money for this is if you are a skilled modder and want to prove your ability to the gaming industry. It would be very impressive if you could create a release worthy program out of this monument to mediocrity. Can you accomplish what $400k+ and a bevy of yesterday's news hipsters could not?  ",
            "review_score": "-1"
        },
        {
            "review_text": "If you want dwarf fortress/gnomoria/towns-alike but in future, get a Rimworld, it has much more content in Alpha than this game on release.   There is no real progression in this game, once you get your basic infrastructure, thats it, there are few tech upgrades nothing more above that.    The game's base is solid, just development stopped before game could get any deeper.... because DoubleFine decided if game didnt pay for itself BEFORE GOODAMN RELEASE it isn't worth investing it..... please, don't give them more money and instead support developers that keep their word ",
            "review_score": "-1"
        },
        {
            "review_text": "Abandoned Steram needs a refund option for abandoned games...",
            "review_score": "-1"
        },
        {
            "review_text": "Game was buggy, but still pretty fun. However, Double Fine's decision to drop development and essentially give a 'screw you' to the funders is despicable. I will think twice, thrice and a fourth time before buying their products in the future. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately, the game is being released WAY before it's ready.  The worst part is DoubleFine is playing it off like it's such a wonderful thing, and aren't we all so lucky. Why not just tell us 'Sorry, we didn't get enough money to continue development, but here's what we'll do - giant bugfix/polish patch, release sourcecode. We hope you guys can make the game we couldn't afford to!' That would at least have had the respect for the players and Early Access supporters that seems 'right' to me. Deleting the old 'roadmap' seems particularly dishonest at this point as well.  However, that's just me with my silly morals and standards and respect and honesty. I don't have to run a business and make decisions like 'let's pretend this is great when it's actually crap.' Sorry, DoubleFine, but you've managed to massively damage my opinion of you with the way you're handling this. I know you're just publishing GangBeasts, but there's now NO WAY I'm putting money into that until it's actually finished. And if too many people feel that way, will it stagnate and suffer the same fate as DF-9?  -----  I'll try to make an update to this review once the so-called-1.0 version comes out, and see if it's actually some working skeleton of a game.   As it is now, DO NOT PURCHASE THIS GAME AT ANY PRICE.   It simply does not work as a game. Stuff happens and your base will die, and there's nothing you can do about it. Just after the latest patch version, I lost an entire base to one raider, because the security team was either standing around and getting shot, or running away (and getting shot). None of them ever bothered to attack the intruder. Not even once. Your base will catch fire from asteroid impacts and your inhabitants will gleefully panic-run right into the flames and die, instead of grabbing the fire extinguishers you've placed across the base and actually doing something constructive. Someone will decide that they absolutely need to do floor pushups right in your airlock door, and then everybody will suffocate to death.  These things are quite forgivable in an alpha game. Frustrating, but understandable. It's alpha, I get it. Things might be broken or unfinished. I'm fine with that. But if ANY of this crap manages to slip into the 1.0 release? That's just garbage.  (Edit: Apparently The S-Word is too raunchy for a review. Sigh.)  ----   1.01 Update   It has improved nothing at all.  No. I absolutely do not recommend. It continues to just  not work . I started two bases today after the 1.01 patch, the one designed to 'finish' the game. I see no significant improvements. Build orders are randomly followed, regardless of importance. Citizens start 'running away' for no obvious reason. Random station boarding parties still utterly annihilate you base regardless of the number of security personnell you have assigned. Security teams clearing derelicts still seem to think that actually shooting the hostiles is a silly concept.  But hey, at least now there's a tutorial! A rather unnecessary one, since the game mechanics are not at all complicated, and I felt were very obviously conveyed through normal play. The problem isn't the players misunderstanding the game mechanics - it's that the game simply  doesn't f-ing work.   ----    Final  Final recommendation:   DO NOT PURCHASE THIS. EVER.   Secondary recommendation:   Never trust DoubleFine again. Only buy a product once it has been actually released, and you've tried it, and it actually works, and the community is being treated well. Do not give support (either financial or social) to companies that make bad decisions. And especially not companies that make bad decisions, then try to tell you how great their decisions actually were.",
            "review_score": "-1"
        },
        {
            "review_text": "The Dev's have given up devloping this game and it is in such a unplayable state, don't buy. I got it in a bundle awhile back so I didn't lose much but avoid this even for a dollar; it's not worth your time. At least I got some cards.",
            "review_score": "-1"
        },
        {
            "review_text": "I had such amazing hoped and dreams for this game. I wanted depth. I wanted what was 'promised' during Early Access.   And now all thats left is an unfinished game. Wow... I didn't see that coming from Doublefine. :(   Don't bother buying. The internet has already judged Doublefine guilty.",
            "review_score": "-1"
        },
        {
            "review_text": "'So long, and thanks for all the cash.' This game is a bigger scam than Game of War. The company's official line is that they are no longer going to work on this game, and they've fired everyone involved. Your money would literally be better used as toilet paper... What little they bothered to make of the game plays even worse than it looks. I don't give negative reviews lightly, but this one earned every terrible statement.",
            "review_score": "-1"
        },
        {
            "review_text": "Dissapointing.... Back when the game was in early development I fell victim to its 'appeal'. I saw a game with potential and I was all and all hopeful. In those ealier days the game was riddled with bugs and glitches, and when I found out they were dropping the game and rushing development, I was hopeful they would eliminate those bugs and glitches in the game. So as a review of the official release of version 1.06 here is the breakdown. I'll have a simple review and more in depth... or in this game... anger driven review...  ----- Simple ----  The game is crap... It had so much potential but since it got the axe and a speedy release... it has so many issues. I honestly tried to play the game again... but yet I wasn't able to play longer than 10 minues. I would not recommend this game to anybody unless it's less than a dollar or given to you free. It's buggy... rough to control, and just honestly crap.  ----- Angered Version -----  Graphics: As this is not a 'Highly graphical' game I wouls say they are acceptable. The sprites perform actions that is befiting, and nothing to standoutish. However in aspect of gameplay the 'isometric' angle makes the game difficult to know exactly what is going on. In the typical fashion the walls disappear in a way to allow you to see in the rooms, however being able to roatate the camera would be nice.  Gameplay: This is where the game loses me. Although the controls aren't 'hard' they are difficult in there own way. I've played many builder games, and most games play similarily with minor adjustments to the controls. In more recent terms since the era of shooter games almost every game depends upon the W-A-S-D model. This game doesn't stray too far fram that idea and it feels comfortable... at least until you start building. At that point the game takes a turn for the worst. Edge scrolling doesn't feel like it's in existence, so your dependant upon the WASD model, but once you open the construction menu, foul language fills the mouth as when you click with your mouse to select the item and press 'D' to move your contruction item changes. As soon as that construction menu comes up the game shifts from a comfortable WASD model to a point and click model. This wouldn't be a problem if they didn't establish you could use the WASD in the first place.... So that is annoying. Then it gets worse. As you play you decide to speed up the game, and most games using some button near the WASD (tab, 123, something) changes the game speed, but in comes the mouse model, and you have to click the speed options. Now I wouldn't have an issue with this, if it wasn't for the fact that when any ship arrived or any notification appears the game switches back to speed 1.... and DOES NOT RETURN.....I find it quite annoying because I'll be in the middle of waiting for my characters to build a room... then all the sudden a message... then the question, 'Why are my guys moving so slow'... then oh gotta click that speed... then the game goes NOPE... and another message. It just continually pesteres you until you get so angry that you give up.  AI: I don't normally judge AI as it's always an issue with all games. It is always about finding that right balance between what the computer needs to process and what the character prioritizes.... unfortunately it appears that this game said, 'F*$k it... have the guys do whatever.' And like loyal programs they do whatever. You have absolutely no control over the individual character, so when your trying to finish that bed... your have to wait until the game decides... 'know what I think I should build that bed.' But at that point your characters are now falling over because they are so tired... that they have no energy... then get depressed and not want to work... so now that bed will never get done.... it annoying the bleeping crap out of me as I was just trying to enjoy the game.  Glitches and Bugs: Yes I'm bringing it up... as a 'fully' released game you would expect most of the bugs and glitches to be taken care of... in fact thats what most of the follow up forums established... but know what.... turns out that your characters get stuck (dumb AI) and because you can't do that they sufficate.... yeah... so just started finished the basic build... airlock... air... and such... but oh no... two of my guys just sat there... doing... NOTHING... could it be AI? probably... but to me that's a bug. But it's not the worst oh no... in my honest to goodness no opinion try I got 'invaded' another ship attached itself to me, and I was assulted. After killing the AI I noticed, Hey there is a gun outside... Then I slowly watched one of my security guards go out to take care of it.... two shots later dead.... ok..... so what does the AI do? 'Well he's dead... probably should take care of that... but naa....' Guess where my miners had to go to get resources? Right in the line of fire.... so there goes two of my miners... Well maybe I can control a security... oh wait can't control the guys so whoops... maybe set a security point for them.... nope... dead... dead and dead..... I'm happy they incorperated the guns for defences... but when a gun is established as enemy and even if you took over everything it appears that that guns still acts hostile.... My frustrations knows no bounds.  Overall the game is fine.... just fine.... not great... not good... just fine.... if you want something new to distract you for 10 minutes... here is the perfect game for you... but don't buy unless it's on uber sale.... and by uber sale like... I dunno $0.99 per copy... or heck maybe if the company pays you to play... becuase honestly this game isn't worth anything more.",
            "review_score": "-1"
        },
        {
            "review_text": "Not finished so not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Was going really well, then double fine got the money they wanted, pulled the plug, they went from alpha 1.03 to being out, with a lot of features missing.",
            "review_score": "-1"
        },
        {
            "review_text": "I am really upset this game turned out the way it did. Talk a walk a year or two back, and you'll find Double Fine announcing a cool new sci-fi space station management game. Why, it looks amazing. Many of us buy in, including myself, and fork over loads of cash to get this game going. And for a long time, it went. It developed and developed and developed, and then all the coal of the development train was dumped out into the engineers' pockets, and they ran off, leaving us passengers screwed over on a train that was stopped halfway to its destination. The engineers reach the nearest town, and, without changing their names or the name of their train company, start advertising a brand new train ride.",
            "review_score": "-1"
        },
        {
            "review_text": "Not even the quit button works.  Not even kidding, the game freezes when i try to exit the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Developers abandoned the game, do not buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandoned. Well done double fine, more quality work.",
            "review_score": "-1"
        },
        {
            "review_text": "Its clear this game was never finished. The tutorial just stops giving you instructions before it explains what is needed to keep your crew alive. As such you have no clue what is the endgame to make a good station other to stay alive till the next pirate boards your station and wipes out your crew.  Then theres the horrible bugs like crew just randomly walking thru the stations walls to die in space...",
            "review_score": "-1"
        },
        {
            "review_text": "This game had huge potential until Double Fine cut it loose and ran off with the money from the early access. It was a decent start to what could've been a great game, but the devs decided to run off with the money and leave us with a half finished pile of garbage. They keep releasing 'patches' that barely fix any of the problems, lied about all of the insanely cool sounding features that were supposed to be added, and then have the gall to charge $20 for a game that's got about $5 worth of content in it.  This game could've been another colossal hit for DF, but instead it turned into a colossal mess. Don't buy it. Pirate a copy if you have to play it, but don't bother buying it. DF doesn't deserve another cent for this train wreck.",
            "review_score": "-1"
        },
        {
            "review_text": "Early access success story... for the publishers that ran off with my money, that is!  A half-finished disappointment.",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not reward you enough for your success, and is balanced poorly. Even in the better systems, the difficulty is way too hard. One mistake could mean restarting. I am likely uninstalling this game, and when I do, I will not try it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Complete garbage. Units get stuck on invisible walls; ships forcefully dock and destroy your build and not in a fun space raider style but an annoying, what the ♥♥♥♥.. kind of way; Your ship travels for 40000+ years carrying a party of 3 but for some reason can only keep them alive for 8 minutes upon arriving, when modern space suits last 1 hour? Not to mention the game is horribly boring after about 40 mins.  From beta: This company is greedy and dishonest, they will start multiple early access games and not completely finish any of them and blame it on 'lack of funds' while updating the games once every 2 months. Your lack of funds comes from paying people to not do work! I will never support Double fine ever again.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased during the very early days after it was released on Steam and I did truly enjoy the game back then even with its terrible game breaking bugs. Every update added new features that made it both easier to play and easier to get everyone on your entire base dead within minutes.  I still see a single raider take out 5 of my level 3+ security staff and also win several matches of fisticuffs with civvies... what the F..?   Also, the AI is strange... SO stange! And possibly sociopathic... with not so subtle rage issues... and a long line of family mental health problems... Someone will freak over something, probably quickly, and go around smashing half of the base until someone else smashes them in the face enough times that they pass out. If your unlucky, which you usually are, they will have trashed your oxygen recyclers and no one will repair them before the levels get low enough that everyone runs around like chickens with their heads cut off until they asphyxiate instead of solving the issue like a boss. Sorry, that got dark.  Unfortunately in its broken, unfinished, never to be finished state I cannot recommend this game. If it goes on sale for $1 or something similar depending on your region it may be nice to pick up to see how good the game could have been eventually, when it was properly finished, but that is just about it.",
            "review_score": "-1"
        },
        {
            "review_text": "Thanks for nothing doublefine. The game had so much potential but apparently something new and shiny came along to get the developers attention. Watch out and be aware for any kickstarters or EA titles DF tries to sneak funding for. They deserve nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "Was hoping the playerbase would be able to make the game more enjoyable with mods after the devs bailed and launched their pre-alpha as a full release. I was wrong, it's still lacking in content and the AI is still suicidal. Get used to watching your crew asphyxiate while hanging out right by the airlock, as this will occur quite frequently. After trying multiple times to try and get into the game then not being able to get past 30 minutes of gameplay, I can say this game isn't even worth $1 on a steam sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is incomplete and is generally unplayable after a short while. Do not recommend buying this unless the game experiences a miracle in development.",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been good, but was abandoned during the alpha. Not worth the cost.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this pretty early on in its life. Liked the sound of it. However, devs have stopped wqorking on it and its a broken husk of a game. DO NO BUY. This is why we cant have early acess things.",
            "review_score": "-1"
        },
        {
            "review_text": "This was not ready to leave early access.  Nor is it complete, yet sadly it wont ever be..at least by the developers. The current bugs are just plain frustrating, i must suck at this game because i cant play for more then 10 minutes withoug my entire base being either attacked or a few times, they would not enter the airlock, so they died in their suits! What a load of crap... i heard there were so many promises for this game.. so much potential...and yet the developers dumped it off on the community to finish the game...the whole source code comes with this..which is kind of cool if you know what your doing with LUA. Good thing i didnt pay for it, i would have been even more frustrated...Its sad there wont be any more development on it honestly.. i dont know what happened..",
            "review_score": "-1"
        },
        {
            "review_text": "unfinished game crashes all the time",
            "review_score": "-1"
        },
        {
            "review_text": "People in the reccommended section will talk about the patch that has been made for this game, and how it fixes many of the problems that the game has. Given that so many people complain about the base game, I'm reviewing the patched version.  Its not great. The UI is clunky, its difficult to figure out what you need to do in the tutorial level to a certain degree. I lost a guy in a derelict spaceship cause one of the survivors stole his space suit.  So sorry mod makers, I'm sure the mod fixes many of the game's problems, but if something is that bad to begin with, you're not gonna be able to fix it that easily.",
            "review_score": "-1"
        },
        {
            "review_text": "Do Not Buy ! the game will never be finished. this 1.0 release is nothing but them dumping the project.  if you want a game like this, get a complete game like startopia or space colony (hd). both will deliver a much more satisfying experience despite their age",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy, it's been abandoned. It shouldn't even be on Steam!",
            "review_score": "-1"
        },
        {
            "review_text": "half finished and abandoned software",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money on this game. It's just as incomplete and broken as it was in Early Access. They gave us Hack n Slash for free because this game is broken trash and they said ♥♥♥♥ IT 1.0! I honestly hope that Double Fine won't be around much longer.",
            "review_score": "-1"
        },
        {
            "review_text": "  It was fun. then double fine abandoned it in a nearly unplayable state. the AI is too dumb to survive even if their life is in their hands. What i mean is they are building something, they have 30 seconds of oxygen left, and they keep building until they die. also, you do not start with nearly enough resources.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy and unfinished, though it is 'finished' according to the develoeprs.",
            "review_score": "-1"
        },
        {
            "review_text": "It was dumped and abandoned, do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a Dungeon Keeper IN SPACE type game that showed a lot of early promise, but it was released early and in a horribly unfinished state with minimal content and game breaking bugs. It's not bad, just sad and disappointing. I recommend you spend your money elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Broken and unfinished.",
            "review_score": "-1"
        },
        {
            "review_text": "damn ♥♥♥♥♥♥ devs leaving a game half finished",
            "review_score": "-1"
        },
        {
            "review_text": "I really wish this would have been a Yes recommendation, there is so many things wrong with this that seemed liked it would be fixed during early access. Now its released as final and it is still just as bad with little to no care of fixing the major problems with the AI.   Save your time and your money and keep walking past this one. If you actualy get to this review after all the other bad ones do you really need yet another to convince you not to buy this trash?  -Sisko  ",
            "review_score": "-1"
        },
        {
            "review_text": "While the game starts good and has many interesting aspects, the dificulty simply ramps up too fast. After a few minutes of game play it gets hard to keep up with the number of negative events that happen, even in an easy zone. Interesting mechanics do not make up for broken dificulty scaling. On top of that the number of bugs present is astounding. I had to restart the tutorial mission four times because it kept getting stuck on different parts. I have been a fan of some of Double Fines games in the past but this one is not worth downloading.",
            "review_score": "-1"
        },
        {
            "review_text": "It was alright for an early access game, but for a full blown game, it simply lacks the content and many things that were actually promised.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandoned, Still noticeable bugs, they could of ATLEAST had fixed that up or something",
            "review_score": "-1"
        },
        {
            "review_text": "Who else would back a petition for double fine studios to finish this game? I would, It's a great concept with poor execution, I'll probably play it regardless, But, We shouldn't let double fine slip this little malnourished idea under the rug.",
            "review_score": "-1"
        },
        {
            "review_text": "Please no one, don't buy this scam of a game. It is unfinished, buggy and deters me and anyone who bought this from ever buying Early Access. Sure, there's always risk but for the amount of money and a well known dev...Yeaaah...",
            "review_score": "-1"
        },
        {
            "review_text": "Abandoned, unfinished, partially playable game.  But if you like this genre and it's on a (big) sale, you might try it.",
            "review_score": "-1"
        },
        {
            "review_text": "A game full of potential, it could have been one of the greats. Despite it's 1.0 release, it's still in Alpha and has been abondoned by Double Fine.  So much promised, so little delivered, just the bones remain. If the modding community get ahold of it perhaps there is a chance that it will still get fleshed out.",
            "review_score": "-1"
        },
        {
            "review_text": "TIM FINISH YOUR DAM GAMES. 0/10 MADE BY A DEV WHO CAN'T EVEN FINISH THEIR POOPS",
            "review_score": "-1"
        },
        {
            "review_text": "Spacebase DF-9 is a testament of what happens when a group of people have really great ideas but the managment does not have any business sense or know how to budget themselves. This game had so much potential, it could have been one of the best out there, instead it will be forever known as one of the reasons why you don't buy in Early Access. It's utterly incomplete, you can do and see everything there is to do in the game within 4 hours easily, and even that might be stretching it. Do not waste your money, do not get this game.  The biggest crime this game did though? It made the internet agree with Bobby Kodick.",
            "review_score": "-1"
        },
        {
            "review_text": "Was a fun game, but they haven't updated it in months and have no plan to finish it.",
            "review_score": "-1"
        },
        {
            "review_text": " Perhaps some should tell Double Fine a Tutorial stage is supposed to be easy?",
            "review_score": "-1"
        },
        {
            "review_text": "Had high hopes for this game. Fun concept, but just not a finished product :(",
            "review_score": "-1"
        },
        {
            "review_text": "If this game was ever finished, it would be fantastic. It promised to fill the StarTopia-shaped hole in my heart that wanted a space station construction/management citybuilder.  Unfortunately, the game has been completely abandoned and will never be finished, and I wish I hadn't spent the money on it in Early Access.  As I write this review, the game is on sale for $0.99. Get it at that price if you feel like it -- I easily got that much entertainment out of it. But if you do purchase the game, know that it is broken and unfinished and you will eventually get bored or too frustrated to continue.  Given that it is abandonware and really should be on sale at superdiscount ALL the time, or better yet not on sale at all, I can't recommend this game, even though it had a lot of potential.",
            "review_score": "-1"
        },
        {
            "review_text": "The game showed a lot of promise and potential during development.  Unfortunately, the developers abandoned the completion of the game in favor of rushing the unfinished game into a quick release to offset costs.  Make no mistake, what you are considering as a purchase is an unfinished game which has been abandoned by the developers. Hold no hopes that it will be completed; it will not!",
            "review_score": "-1"
        },
        {
            "review_text": "The devs took a steaming dump and released it as a finished game.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game for free all of the sudden today. So I said, 'why not'? Ive played many isometric strat type games like this and this one is pretty horrible. Right away glitches with people in space suits, glitches with building, glitches glitches glitches. So naturaly I head right to the bugs report / forum for this early access title to report it. Come to find out, its NOT early access. This is it, this is what 'shipped'. I'm going to give it another try just to make sure I wasn't too far off the mark. But ya, it's pretty horrible. Building anything is a chore, rosters are a nice idea but the UI leaves something lacking, te game 'feels' like a poorly made reboot of an old game I ued to play in the late 90's. (It's actually 90%+ desgined like that game, just poorly executed.) In short: If you get this for free, try it so you know what you wont like in a game. If you paid money for this, i'm sorry. I'm so so sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "Wtf devs? FINISHED? Well ♥♥♥♥ing not. Get your ♥♥♥♥ together and stop your ♥♥♥♥ing holidays with our money and make a comeplete game out of it.",
            "review_score": "-1"
        },
        {
            "review_text": "Now that Double Fine have decided to abandon development on this game I cannot even consider recommending it. If it's ever 90% off, you may want to give it a try and see if modders have done anything interesting, but even then buyer beware.  Boycott Double Fine tbh.",
            "review_score": "-1"
        },
        {
            "review_text": "A classic example of what happens when people lose dedication. I had high hopes for this too",
            "review_score": "-1"
        },
        {
            "review_text": "This game could had been a great theme game you know like (theme hospital and themepark games) with an awsome survival feal to it.. first off it looked so good what was planned and people started to get there own ideas on how epic this game could turn out to be.. sadly it was left to early its not a finished game by far and alot of stuff people has begged for has not been shown.. Im sad to say i cant recommend this game it has its charm but thats about it, build every room and see people work only take a few hours then your stuck in booredom.  Dont buy this game, i just hope that other developers that see this project will auctully make a game like it thats finished and more polished then this crap.   3/10  + Theme park feel for a bit + building system with Air and vacum + stupid npc trying to turn them self on fire our jump out of an airlock.. or my favorite get stucked in a door.  Rest of the 7 points is just a angry rant sorry. I dont get why people think its ok to get players dreams up and then blow it out of the airlock as this game did, shame on you.",
            "review_score": "-1"
        },
        {
            "review_text": "Lets leave aside the fact that the game isn't finished, shall we? Double fine decided its done, so lets look at this as a finished product  Spacebase DF-9 is The Sims, but in space. I know what youre thinking, I was hyped too. You can assign different jobs to different citizens and theyll like it a certain amount. Your citizens will scurry around and converse with each other about inane things like space mudcrabs. You can select asteroids to be mined, which works kinda. You can get other people to come by and ask to join your space-hovel, and supposedly they might even try to do other things, but that never happened in my playthrough. You can send you citizens to go and explore derelict ships, and they will find things. You can build rooms, and put things in those rooms, and your citizen will use them. You can give those rooms different named functions, and your citizen will use them for those functions. Spacebase DF-9 is The Sims, but in space.  Pros:  -Aesthetic: If you can count on Double Fine for anything, its that their stuff always looks good. The semi-retro looks of the interface and the hand drawn aliens look nice and stylized. Sending your citizens off to investigate a derelict ship is always a harrowing affair, as the ship is completely dark, with red warning lights flashing ominously through the hallways. Even if you have no idea whats coming, the atmosphere of the ship makes you anticipate losing a few citizens. One fult is that the play space looks very flat, even though your citizens, while in space suits, can go under your space-hovel, which was very confusing the first few times.  -Sound: The soundtrack is short but nice. Ambient trance music has a soft spot in my ear canal, but I found the music very nice, even though it will be seen as repetitive to some. If you dont like, it, you can always mute it and play Eminem, or what have you.  -Core gameplay: The game mechanics I described above are very good, and makes the base of a great sim game. I'll elaborate more on this in the negatives.  -Fun alien designs: I like the designs of the aliens. I didnt see two aliens who looked exactly alike in my playthrough, besides the two humans I started with. Reminds me of Star Wars!  Negatives:  -It isn't Psychonauts. Lets all face facts, the main reason we all buy Double Fine games is in hopes of another wacky, fun game like Psychonauts. It doesnt need to be a Psychonauts game, it just needs to have the same spirit (Although, I'm still holding out hope that if I keep buying DF games, they'll eventually make Psychonauts 2). The plain fact of the matter is that this has none of that spirit. Spacebase DF-9 is as sterile a gaming experience as there is to be found. The most funny thing I did was purposefully suffocate my citizens in the bar. Forshame, Double Fine.  -The gameplay is completely flat. As in grossly, sadly, boringly flat. If you have played 30 minutes of DF-9, you have played 30 hours of DF-9. With the exeption of the rare derlict ships, I spent most of my game watching netflix on the other monitor. Even the derelict ships suck in a way, since even with their mystery, it takes too much time and resource to explore and kill the monsters inside for it to be worth it, since all your citizens will be terrible at fighting. In other games, like the Sims 4, this could be remedied with patches and DLC, but Double Fine has no intention to patch or make DLC for this game, and so were tuck with the husk of a potentially great game.  Ending score: 4/10. A passable game that works just fine but because of its pedigree should be a while lot better than it is. If you really need your fix of a Space Station simulation game, try Space Colony on GOG, if you need a Sims-esque game, just go back to the Sims. If you want a fun Double Fine game, just play Psychonauts or Brutal Legend again.",
            "review_score": "-1"
        },
        {
            "review_text": "Although its been released as 'finished' the game is still broken as it was in alpha 6, the alleged hundreds of bug fixes are nowhere to be seen and the game is now abandoned, i highly recommend you stay away from it and rather buy Startopia or Space Colony, even though both games are older they are far superior to this when it comes to gameplay and you can be sure you wont run into nearly as many issues than in this game. Double Fine had no problems lieing to us a few months before the game was abandoned and thus i can only recommend to avoid any Double Fine kickstarters or early access titles. You are better off investing your money into a company that actualy cares about its customers and finishes what they started.",
            "review_score": "-1"
        },
        {
            "review_text": "Like so many have already said, this game was abandoned. They've simply polished the game to look appealing but the game play is downright unpleasant. It's very apparent that some of the decisions that were made in game play should have been better thought out. My advice to the creators: you should have looked to games like Evil Genius to get a better understanding of what's wrong.  Some things that bothered me while playing:  - no prioritization system in place for construction ( example: watching your workers finish building an empty room before constructing an oxygen recycler can be frustrating, especially when people start asphyxiating) - I watched a worker box themselves into a sealed room and then remove her suit. Instead of finishing the job and building a door to gain access to the base, she preffered to starve to death.   In summary, unless you see any news about much more development in this game, don't bother. It's sad to see a game with such potential be abandonned like this.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I would really love this game if it wasn't for the few super annoying bugs .. like e.g. the AI just randomly decides that your perfectly functioning airlock is not going to be used due to a dead body in front of it, and all your builders, miners, new recruits, etc. asphyxiate just because they didn't feel like using the airlock  There have been plenty of changes since the last time I tried this game a few months ago (still in pre-release), but apparently they haven't cared to fix the actual game breaking bugs, instead they've added mainly useless new features.",
            "review_score": "-1"
        },
        {
            "review_text": "on its way to greatness when suddenly the financial problems of its creator, killed the development. to call this 'finished' is just a big FU to every single person who bought it. - atleast come clean and say you went bankrupt, and scrap the game completely.  this game keeps reminding me to be VERY careful with Early Access games.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay itself is fairly fun, but I cannot recommend it for a simple reason:  Double Fines poor approach towards the game. Rather than finish implementing promised features, they cancelled any further development with no warning and crapped the game out of Early Access.  Why such a formerly loved developer would make such a colossally bad business decision, I'll never know.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically it's an incomplete game with buggy gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "They did not bother to finish the game, and they won't be releasing any new content.   Last DoubleFine game I will ever buy again.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately, this game has been abandoned. It was at .5 before being forced to 1.0 and left to the hands of modders. Which is terrible, considering the directions this game was going before it was canned.  The name is misleading, it is less Dwarf Fortress in space, and more The Sims 2 in space with dwarf fortress elements.  Definately needs mods to be in a finished state. Pity.",
            "review_score": "-1"
        },
        {
            "review_text": "Spacebase DF-9 was a really cool idea, pretty much summed up as 'Dwarf Fortress in space! ...with at least a slightly more user-friendly UI.' Unfortunately Spacebase DF-9 was also a really bad plan, pretty much summed up as 'Hey those Prison Architect and Dwarf Fortress dudes have been making tons of money off their unfinished base building simulations while they're still in production! Base building simulations make tons of money while in production! That's great let's do it!' Well it turns out that wasn't the case, so now Spacebase DF-9 is an unfinished product with no plans to ever be finished. It's for sale, for some reason. You shouldn't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been fun but too buggy and is now 'abandoware'.",
            "review_score": "-1"
        },
        {
            "review_text": "Totally unfinished. I think this company won't sell any game in future.",
            "review_score": "-1"
        },
        {
            "review_text": "Spacebase DF-9 would have been a great game, but doublefine abandoned there project, as soon as they had enough money to make another game. For this reason I will never buy another game from doublefine and I hope other people do the same. Doublefine even now consideres this broken and unfinished game a finished product, and spits in the face of early access supporters.",
            "review_score": "-1"
        },
        {
            "review_text": "To put it plainly; I loved this game. 'Loved' being the key word. The devs abandoned this game. It had great potential and much promise, but they threw all of that away. I'm deeply disappointed.  If you want to buy this game, by all means, do so. At a discount. Never for full price. Because why should you? It's not finished, and it never will be. So why should you pay full price for something that isn't even finished?  Again, it isn't a ♥♥♥♥ game. In my opinion anyways. It's just not finished. So expect bugs. Expect crashes. Expect a ton of nasty ♥♥♥♥ to happy and be there.   Anyways, I cannot recommend this game because it isn't finished.   in summary: What was once 4/5 is now 1/5. DO NOT BUY UNLESS IT IS ON A GOOD* SALE. The end.  *A sale being at least 75%+",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT buy, this game was abandoned by devs and they still ask 20 bucks for it..  DO NOT PURCHASE.",
            "review_score": "-1"
        },
        {
            "review_text": "Half finished, so many promises unfulfilled...",
            "review_score": "-1"
        },
        {
            "review_text": "Had fantastic possibilities, but fell short on every delivery point.   The game has been dropped and will forever be unfinished unless the modding community (which the game has blatantly been dropped on) steps up and finishes the game themselves.   If you are thinking of buying the game please take a look at what is actually included. Sadly a buy-beware situation.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, after playing this game for over 9 hours I can say that it is really good for a alpha. Once I started playing and getting the hang of things, I was istantly adictided.  Edit 12/2/14: Yeah, I know it is old news but this game is ♥♥♥♥ now. Double Fine cant make a complicated game so they stopped putting updates up. Don't get me wrong, the game had a lot of pontential but they just made a update going to 1.00.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a fun game no dought about it... has a lot of potental but it realy  the AI is just bad and the events generate poorly, like one mine every thing is smooth and next u get 6 raider events.  Maybe it suppost to be this way but over all the game seems realy ruff.  Needs a lot more work with balancing and event generation.  ",
            "review_score": "-1"
        },
        {
            "review_text": "It was left in a half-finished alpha state by the developers because they decided they couldn't be bothered to devote the time to making a sold game. Double Fine has a good track record of great games, which prompted the community to buy into the early access purchase model.  Don't give Double Fine the benefit of that level of faith ever again.",
            "review_score": "-1"
        },
        {
            "review_text": "So yeah, developers lied to people about this game and then just pulled to plug off and ran with the money. I will never buy a game from either Double Fine games or Tim Schafer again.",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING!  This game was rushed out of early access due to financial issues for the developer. It is incomplete and will most likely remain so indefinetely.  Unless you have an irresistible compulsion to buy every game ever, do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "If it was still early access the lack of features and bugs would be somewhat acceptable, but as a finished product I cannot recommend it",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: +Lots of events +Easy to learn Cons: -Whenever you die, it gets bored fast -Bugs -Hard to build your ship at the start -The whole game is hard to play",
            "review_score": "-1"
        },
        {
            "review_text": "To be honest, I was entirely satisifed with it's progress as it was being made. Fairly reguar updates adding lots of new content and improvements... and then out of nowhere they 'launched' straight from Alpha. I have to imagine that this was a hard choice on their part, and left a lot of hard working devs sad that they'd never get to see the finished product. It can be fun, but it's not nearly finished and super buggy, so while I apprecate the effort, I couldn't advise spending more than 5 dollars on it max.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, i play this game, i was excited,   the main idea look great, but during the game, character are so ♥♥♥♥ing stupid, Bugs everywhere ! i throw this game to the recycle bin...  if they upgrade, and correct the game i will play more, but for now .. i'm very disapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay let me first praise the idea behind the game and say that when it works properly and gets a little tuning in the .ini files...it's fun.  However, since the game is impossible to play and is nowhere stable enough to be considered a fun experience I cannot recommend this game to anyone.  Game is garbage-ware.",
            "review_score": "-1"
        },
        {
            "review_text": "This game will never be completed",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed this game, but it was never fully realized. The ironic thing is , you can now play Fallout Shelter on your phone and it's the same concept. Their short sightedness cost them potential millions, as well as destroyed the trust I once had in them.",
            "review_score": "-1"
        },
        {
            "review_text": "Just read the community page and you will understand why this game is rated so negatively.",
            "review_score": "-1"
        },
        {
            "review_text": "took the money and canceled it :( BALLS",
            "review_score": "-1"
        },
        {
            "review_text": "This is an unfinished game, not even worth buying in a Steam sale. For more, read the other 77% of unsatisfied reviews.",
            "review_score": "-1"
        },
        {
            "review_text": "A.I. IS DUMB LIKE ♥♥♥♥ AND YOU CANT TELL THEM WHERE TO GO!  The game is very nice and had potential, but i want to give you just some little examples of gameplay:  Everything worked fine for 2 hours, but then suddenly 3 raiders came and killed half of the crew....  Later on some idiot went crazy, damaged a turret, that killed 90% of the Crew... The last guy died after a sudden fire accident, that would have been no problem if it wasn't just at the infirmary.... 3 hours gameplay lost.    NO CHANCE TO SAVE! JUST THIS DUMB-PSEUDO-WE-WANT-A-INDIE-SAVEGAME-♥♥♥♥-THING will make anybody mad playing this game for later than a few hours.  Sometimes you cant even do anything, just watch anything what you had built up in this game for hours die and burn.  But people who love this, should buy it....",
            "review_score": "-1"
        },
        {
            "review_text": "Developers abandoned this product and ran with the money, so DON'T BUY IT!",
            "review_score": "-1"
        },
        {
            "review_text": "Sims in Space. Maybe if you like the sims, your experience will differ from mine.",
            "review_score": "-1"
        },
        {
            "review_text": "The idea behind DF9 is awesome. A City Builder meeting Sims in space. And that's about all I have to say to sell the game to you...  Now why I'd recommend NOT to buy it. Reasons are numerous, and most already mentioned by others and  this blogpost  [wildwoodgeek2.blogspot.nl]  explains most of it I think.  In addition to the blogpost I'd like to add an other reason why NOT to buy DF9. Once again the AI, which just plain sucks! My personal experience with the AI sucking balls is that after a debris stike, my oxigen tanks and power supply got hit. Without power and oxigen, the whole crew starts to panic, including the whole technical team. WTF? You guys should run to the power supply and oxigen tanks to fix them instead of running around like headless chickens!  An other problem is the Sims part of the game. The people have a (hidden!) worklist of stuff they have to do. So far so good I'd say. But technical maintenance (yes once again) should have a top priority for lifesupport, but noooo..... Ocigen tanks are about to break down and they fix ...a bar stool... FFS guys get real please! Or at least let me point the Sims where they should go next instead of fully automated.  Bottom line, the idea behind DF9 is real good. Sadly the developer dropped the ball and the project, leaving us with a half-baken, bugged and dumb game :'(",
            "review_score": "-1"
        },
        {
            "review_text": "not a finish game do not buy it!",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay is fun, but holy ♥♥♥♥ is the AI dumb. I cant tell you how many security gaurds I've lost exploring derelicts only to have them get stuck in an airlock or panic and not leave until they suffocate. And dont try to build extra airlocks for long range mining, 9 times out of 10 they'll use the airlock furthest away and asphyxiate. Hopefully this will be improved or at the very least add some feature to assign miners specific routes or airlocks.",
            "review_score": "-1"
        },
        {
            "review_text": "I will never buy another early access game thanks to Double Fine.",
            "review_score": "-1"
        },
        {
            "review_text": "It's abandoned, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is impossible cause 10 min in 4 raders come in with overpowerd wepons that one shot everyone it hits and im on low thret low magnetic interference and distent worp gate so nerf them a little PLUS WHEN I GO TO A SHIP THAT SPAWNS AND THERE ARE RAIDERS ONE DOOD OF MINE DIES 10 SECS LATER EVERY ONE GOS TO SHIP AND COMETS SUICIED SO ♥♥♥♥ING FIX THIS",
            "review_score": "-1"
        },
        {
            "review_text": "Games like this are why people wont buy into inde markets the whole cut and run thats been going on i hope you know from now on me and many other people will post your companys history with not finishing what you start on your kickstater page or where ever you go we will make your day to day life harder cause you cant make your goals so start looking for a new company name because if money is what your after you wont see any more of mine btw i bought 6 copys of your game for me and friends so i am bothered by your give up adtiude YOU OWE ME EVRY CENT I PAYED THERE ARE GAMES ON ANDRIOD MARKET PLACE BETTER THAN ANYTHING YOU GUYS HAVE EVER MADE AND THEY COST 5 DOLLARS. you guys are lazy and suck at your job maybe you all should just disolve your company do us a favor and remove your self from steam cause i hope by the end of the month your game will be a 1 star so i can watch you never make a dime off your work.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is barely alpha quality, if that. DoubleFine has dumped development of the game entirely, so this is it- no more polish for this turd. Do not buy under any circumstances. Given their lack of responsibility for this title, do not buy any games from DoubleFine either.",
            "review_score": "-1"
        },
        {
            "review_text": "God Damn, i bought this game and i was so happy to play it but it's completely broken, all textures are broken and i can't do nothing. None of the solutions i found were working so i unistalled it and i won't be buying anything from Double Fine anymore, such a shame that company with so much fun titles do something like that.",
            "review_score": "-1"
        },
        {
            "review_text": "It started as a sandbox with plenty of potential but was (after a long period with just a few updates) abandoned. It's unfinishedd, lacks major features, has stupid AI and gets boring quiet quickly.    Please don't waste your money !!!    This is one of Early Accesses worst examples",
            "review_score": "-1"
        },
        {
            "review_text": "Stay away, far far away. Unfinished, buggy waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "It is developing as fast as I like it",
            "review_score": "-1"
        },
        {
            "review_text": "Double Fine failed and the consumers pay the price. Unfinished game, developer that has no respect for the people who buy their products.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game! The developers have released a so called 'final version', which means that most of the features that were supposed to be available from the early access goals list do not exist on the game. Summing it up, the developers have delivered an incomplete product and have refused to admit so.",
            "review_score": "-1"
        },
        {
            "review_text": "Ever seen that horrible video on the internet, called 'Two girls one cup'? This game is basicly that video, transformed into a game.  So why pay 9.99 to puke over your PC when you can get it for free by watching the video you ask?   Because by buying Spacebase DF-9, you also get a feeling of frustration, abandonment and playing a game that is far from finished!!",
            "review_score": "-1"
        },
        {
            "review_text": "'Beware of Abandonware '",
            "review_score": "-1"
        },
        {
            "review_text": "This game promised so much and delivered on nothing. It looks like garbage, plays like garbage, and was dropped by the devs because they are garbage. Into the trash it goes.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played 7 stations so far, 2 lost because I had no clue what I was doing, 5 more lost because the game's AI makes some pretty terrible decisions (for instance 3 security guards opted to just sit and chit chat with eachother while 2 bandits entered the base and killed everyone else in the room with them - then they all died while still chatting away) or because the game decided I didn't need to keep playing and suffered from one of its many game breaking bugs. Needless to say this game needs an extraordinary amount of work before I would even have classified it as Early Access. For now, stay away.  Update: Many of these bugs still exist and production of the game has ceased. So I would strongly suggest you spend your money elsewhere. If you want a good game with similar style (though not in space) then look at Gnomoria.",
            "review_score": "-1"
        },
        {
            "review_text": "Unless this has a serious discount, don't buy it. It has a lot of things wrong with it, and the devs dumped it before finishing the game. BUT some modders have taken up the challenge of releasing patches for the game anyway using its source code, and so far they've been consistent in their releases.  The most annoying thing about the game by far is how your station residents are incredibly sluggish when it comes to doing anything. I've had two starts where everyone suffocated in their space suits because they took a million years to actually get around to building oxygen recyclers when ordered, and another where everyone suffocated because they refused to build an airlock to actually get into the mini-station they'd just built. When you order a squad of security officers to move to an area with raiders in, it's a coin flip whether or not all of them will actually go there. I lost one citizen and one of my two officers to a raider attack when one of the officers decided to - I ♥♥♥♥ you not - stand around playing a handheld game instead of actually doing his job and shooting the raider that just killed someone.  It's quite frustrating sometimes, but worth the whole 69p I paid for it. I wouldn't pay much more than that for this game in its current state, though - if you do want to pick it up, I would advise you to not pay anything more than £1.50 or so for it.",
            "review_score": "-1"
        },
        {
            "review_text": "The fact that I bought this game when it was in early access and came back recently to see if anything has changed gave me cancer. I have only 3 months left to live. Help.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this for $0.99 from a charity website and its so bad I requested a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me never buy another Double Fine game again.",
            "review_score": "-1"
        },
        {
            "review_text": "hasn't had an update for over half a year. ♥♥♥♥ you.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game, Unfinished abandonware, also I suggest you refuse to buy anything from Double Fine Productions in the future given their practices. Your money is too good for them.",
            "review_score": "-1"
        },
        {
            "review_text": "This game still lacks in many crucial areas. The AI is dumb as a post, the mechanics lack any rhyme or reason as to why the function the way they do, and graphical errors still exist (mac version).  I'm flabbergasted they're still charging $20.01 for a game that doesn't work.  Go to your nearest sink, toss in a 20$ bill, light in on fire, and you'll have infinitly more fun than playing this game.",
            "review_score": "-1"
        },
        {
            "review_text": "1.0 review update: I don't recommend this game anymore. The developer decided to quit working on it simply because its alpha release did not net them the money they were hoping to get. Not everyone goes for an alpha release. Some want to see the finished product.  Considering the developer thinks of the 1.0 release as the finished product, let me say that I'm thoroughly disappointed in the product. I would not have bought it in this state.  Instead of complaining about the lack of funds they received for their in-progress game, the developers could have simply hammered on the bugs, made a well-rounded game, and then the 1.0 release could have brought so many more people in. People who would have paid them.  This is yet another example of why Early Access fails; developers pulling the plug on projects because their expectations were impossible to realize.",
            "review_score": "-1"
        },
        {
            "review_text": "Well... I thought it was a good idea. But saddly... vaporware... they go everyones money and vanished whout even a notice.",
            "review_score": "-1"
        },
        {
            "review_text": "This game had such potential. I really enjoyed it at first, but the flaws in the psychology AI ruin it every time. I seriously don't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Hello? Is there any updates anywhere? Hellooooo",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this a long time ago, back when it had really just entered the Early Access section. My play time is more than what's shown as I play offline a lot.   The idea was sound, and I really enjoyed the game when I first tried it. Obviously, I expected more as time went on since the game was still in development. I also understand that development takes a long time, and isn't exactly the smoothest ride, so after a while I uninstalled and just let it sit for a while. Seeing it just get officially released, I decided to check in on it again and find that, really, not much has changed. I'm disappointed in the scarcity of things to do - it's a game of 'build each facility, bam you're done', when it comes down to it, like the tablet versions of city builders such as SimCity/Metropolis/Anno/etc. Just not much to it.  I don't recommend it simply because it's not worth playing more than once, and I'm not happy paying for something like that. Even the most single-player of experiences I tend to come back to after a while, but SpaceBase didn't have anything to it that made me say 'yeah, I'll pick it back up after I play this or that'. Not worth a buy, not worth the time, especially given how lackluster the support has been over the period it's been available.",
            "review_score": "-1"
        },
        {
            "review_text": "I would've liked this, if doublefine had finished it rather than half baking it and then calling it quits.",
            "review_score": "-1"
        },
        {
            "review_text": "I have about 2 hours on this game... now you're asking me, what have I done? ♥♥♥♥ING EVERYTHING",
            "review_score": "-1"
        },
        {
            "review_text": "HOW THE ♥♥♥♥ DO U MAKE A DOOR!!",
            "review_score": "-1"
        },
        {
            "review_text": "MOST ANNOING THING: CAN’T SAVE GAME WHEN AND WHERE YOU WANT TO  SPACEDATE 9160.19 -I can't get over crew number 47. The dialogues are the same repetititive ones bat the crew don't grow enymore. -There are some killbots that went in the far left corner of the screen. -The raiders and crew that get shot (not killed) do the same (go to left corner of the screen) and the game crush.  ITS A NICE GAME BUT IS NOT READY. THIS SHOULD HAVE BEEN BETA NO V 1.0 ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a money grab ive allready said it all And it isnt actuly finished And they recomended there own game though the cuator system witch is just damn stupid",
            "review_score": "-1"
        },
        {
            "review_text": "unfinished garbage. released after the ninth alpha version. if you buy this, buy a hard copy so you can physically pop a turd on it.",
            "review_score": "-1"
        },
        {
            "review_text": "What a let down. They have given up on the game. This will be the last Early Access Game I purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "i bought this game last year it had a bright future but it way to buggy and most of all the crew are ♥♥♥♥♥♥♥♥ you can never make them happy and your base will fall apart no matter how many people you have there to heep thing together. this game is now dead stay as far away from this game a possible.",
            "review_score": "-1"
        },
        {
            "review_text": "It was unfinished in early access. It's still unfinished after 'release'. Project with potential was abandoned and a lot of early access contributors were cheated. I couldn't expect such a treachery from Double Fine.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game pretty early on in the Alpha, and was interested to see how it would develop. I'm disappointed that the developers abandoned it in such an incomplete state.",
            "review_score": "-1"
        },
        {
            "review_text": "It isn't finished... UI, AI, events, just about everything. Too bad too. The idea sounded like a really good single player SpaceStation 13. Really, SpaceStation 13 seems more finished though...",
            "review_score": "-1"
        },
        {
            "review_text": "The stupidity of the NPC AI will enrage you. The game is undeserving of the name 'simulation', as the event controller is designed to be malicious if you get too successful. Don't expect any major updates as the developers have mostly given up on this buggy mess. There are many games that do these genres better, don't settle on this on.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the more expensive items in my cart, and one of the least satisfying. Like Dwarf Fortress if everyone in your fortress was really stupid.  Also, it's not being developed, or it's open source or it's not, or something. Whatever.",
            "review_score": "-1"
        },
        {
            "review_text": "I gave this game a positive review nearly a year ago in hopes that issues would be resolved. They were not. I have held a deep love of Doublefine Games for a long time, but I cannot with good conscience advise the purchase of this game in its current 'finished' state. Just stay clear of this title.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy the game I do but the problem is that it is unfinished. I read up on it and apparently the creators ran out of money and just stopped with the game. :(",
            "review_score": "-1"
        },
        {
            "review_text": "bought it in early access  it seems they stoped development so its still in ea state   dont buy it !  idea had potential but its not nearly finished",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game that did not live up to the content promised by the developers. It seems they were short sighted and didn't plan for long term development. I'm really disappointed as this is a DoubleFine game and I expected better from the company. Development has been abandoned and no new content is planned.",
            "review_score": "-1"
        },
        {
            "review_text": "There isn't much to say. I bought this game on sale last year when it went one steam sale (had considered paying almost 50$ for the founders ♥♥♥♥). The idea behind it is a fasinating one, like sims in space mixed with mining.  It's good for a few hours, I've experienced a few bugs, and even fewer game breaking ones.  BUT don't pay for this game. When there was hope for it I'd say get it on sale, but now that the developer has left, who'd pay them for it? Even they don't think its worth it.  Its sad to see doublefine as a studio not doing very well in any of there games :(",
            "review_score": "-1"
        },
        {
            "review_text": "I was hesitant at first with all the alpha games on steam. The game is great, a blast to play and pleasnt to learn. The soundtrack is enchating as space scenes are. You start with 3 characters you can only lightly influence. Each one can be assigned a task within the spacebase, they are: botanist, bartender, builder, technician, security, miner. (Botanist grow food for the bartender to serve in a pub, the others shouldn't need explanation). Each person can perform each task at a level granted by skill. So it allows an opportunity to manage your labor resources as well as material resources. After while you will slowly build a base of up to 100 or so people if you can survive impacting debris and pirate raiders. Opportunities to plunder derelict ships will give you bonus space or resources. While definently a playable alpha build, you can probably do just about everything in eight hours, more content would make replay value more substantial. Overall impressive game, can't wait for the finished build. *Edit I have to change my opinion to negative because the game was published seemingly before it was finished.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun for a few hours, if you are a die-hard strategy building fan like me. Other than that - it is not finished - by far. It could be the killer in this lonely genre, but it's not.",
            "review_score": "-1"
        },
        {
            "review_text": "They do not keep up with details about continuing the game's progress and have a poor reputation of not completing games that they create. buyer beware.",
            "review_score": "-1"
        },
        {
            "review_text": "There's likely a playable game in here. But it needs carved out of the horrible mess of painful murdering it's been left as to date. Played three games. By the time I got three rooms built in each, everyone was murderer (to death) by hostiles. I'm sure you can stick with it and find some fun in it, but I'll save my time for games that don't seem to actively hate the player.",
            "review_score": "-1"
        },
        {
            "review_text": "I just bought this in the bundle with Hack n' Slash during the winter sale. I totally messed up and didn't read the reviews or any of the news behind it because I had seen videos on the gameplay before, and thought they were still relevant.  It's a fun game, I give it that, and I bought it solely on the features it has now, not what was supposed to be planned for it. I didn't even know what they were planning from it However, the AI in this game is a mess to say the least.  The game is very incomplete in many aspects, but the most infuriating one if the AI. Raiders will raid your base, and there will be 30 or more at one time. Colonists will no build anything for some reason, even if they are happy. They will go into a panic when something goes wrong, and NO ONE will do something to fix they're situation and they usually just end up being killed by a raider or suffocate. That takes hours of making a decent spacebase, and just throws it away.  I DO NOT recommend you buy this game. The developer abandoned this game, and the code is so screwy and amateur, that no one can make mods to fix some of these very basic mechanics that any game in this genre is expected to have.",
            "review_score": "-1"
        },
        {
            "review_text": "The stupidity of the NPC AI will enrage you. The game is undeserving of the name 'simulation', as the event controller is designed to be malicious if you get too successful. Don't expect any major updates as the developers have mostly given up on this buggy mess. There are many games that do these genres better, don't settle on this on.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't really 'get' this when it was in Early Access; now that it's nominally in final release, I think Double Fine owes each of its owners a copy of Psychonauts 2.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm leaving my past review up for whoever wants to read it, but I can no longer recommend this game, the developers abandoned it during alpha, rather than refunding money or at least 'slowly' fixing the bugs, they announced full releases of a game with so many bugs it's borderline unplayable.  Game has a lot of potential! However it is still lacking. The base building is a little hard to get used to but works well, there are no clear markings for what does what when you try to build an item. No way to move items you place. Lots of bugs including: engineers don't like to repair things. all your oxygen recyclers can be at 0% and they wont bother with it (same with doors) until it explodes half the time. For so reason security officers wont move to the beacons you place, but when they do they usually go outside under the base at the spot the beacon was placed instead of inside so it's VERY hard to defend your base. Works wont work half the time. Lastly in regards to bugs my middle room for no reason what so ever went down to 40% O2 and all my guys got stuck in the room next to the air lock (which had 70% O2). So I quite and came back hoping that would fix the bug, and every single room suddenly went to 0% O2 and half the people were already dead. the other 98% suffocated. saved and went back now my rooms are back to 98% O2 and 2 people survived. then one became a parasite and everyone died can't retake.  Now that's a lot of bugs and problems yes. BUT I had a lot of fun playing the game none the less. I hope these bugs get fixed and I hope the game does great. Also This game needs more rooms (i.e. Security room, Med Bay (no idea how you heal units yet) and the like)",
            "review_score": "-1"
        },
        {
            "review_text": "Had great promise, but was abandoned during development leaving it unfinished and uninteresting.",
            "review_score": "-1"
        },
        {
            "review_text": "The alpha iss glitchy, but still awesome. Can't wait to see how it progresses.  NEW EDIT: Abandonware, DO NOT BUY!  Screw you, Doublefine. See if I ever buy a game from yall again.",
            "review_score": "-1"
        },
        {
            "review_text": "Had potential but the developers ceased production.",
            "review_score": "-1"
        },
        {
            "review_text": "Looked like a decent game wiht some promise, but the last update was 11/2014 and has since been abandoned.",
            "review_score": "-1"
        },
        {
            "review_text": " FIRST:",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun... until stuff happens! It's buggy as hell! Mostly due to raiders. Lost 3 guys standing in front of raiders for reason I'm assuming to be bugs. Raiders killed in spcae can't be cleared off, and their items dropped can't be picked up. and then there's the whole 'we are gonna stop making this game' bs.   Like I said, it's fun, but then bugs and unfinished features will kill your progress! Don't buy it, it's rushed in the end and full of bugs",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game unless it's on sale. It was abandoned in development and while playable in the early stages quickly becomes a nightmare somewhere around the 10 hour mark. I didn't realize this game had been for a while and kept waitng for updates and fixes that never came. So, I was screwed out of about 14 bucks around a year and a half ago. If you just can't resist go for it now while the whole (unfinished) thing is under 2 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Early access abandonware, not worth buying full price.",
            "review_score": "-1"
        },
        {
            "review_text": "Double Fine abandoned this game, and yet you can still buy it on Steam. DO NOT TRUST TIM SCHAFER PEOPLE! HE WILL TAKE YOUR MONEY AND THEN RUIN PSYCHONAUTS 2!",
            "review_score": "-1"
        },
        {
            "review_text": "this game is ♥♥♥♥ing amazing... its just NOT EVER GOING TO BE FINISHED, this game is worth it if you want to make mods for it and really make your own game using their engine, if you want to play a game i wouldnt even bother with it till someone makes some really good mods for it... if that ever comes... stay away from it spend you money on a finished game",
            "review_score": "-1"
        },
        {
            "review_text": "Unfinished. Thanks Double Find. I used to be a fan of your products. -.-",
            "review_score": "-1"
        },
        {
            "review_text": "Defs abandoned the game unfinished. Dont touch it at all. This is the first and last Double Fine game I will ever touch.",
            "review_score": "-1"
        },
        {
            "review_text": "Do I get my money back yet?",
            "review_score": "-1"
        },
        {
            "review_text": "This should be still in early access it's not a full game worth 10 €. This is just a bad demo. Do not buy it even on sale!! You will regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "K, I don't really like giving games bad reviews, but I've had this since it was under active development and I'm not really impressed. I got 12.2 hours out of Spacebase DF-9 before deciding to leave a bad review and they were 12.2 hours well spent but it's just not quite a completed game, so I can't in all honesty give it a Yes. And that makes me sad because I want it to be great. I would love to spend WEEKS modding the Lua code that makes Spacebase-DF9 work, but I'm not going to make an incomplete game complete because that would be Double Fine's job. It has unfixed bugs. The AI needs a lot of work. It needs a lot of spit polish. When I tried to mod it, it crashed.  I'm genuinely a little puzzled why Double Fine is just letting this languish on the market. I liked it enough to write a bunch of words about it. But the early access never hit critical mass and the dev pulled the plug.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun but there is one thing that ruined the game for me...Security Guards being cowards and not doing anything about raiders and then theres the common raids in a extremely low threat area and no passenger ships when im very close to a warpgate, honestly this is very dissapointing as every perfect opportunity is ruined by bad ai and possibly game programming PS:Improve the AI i sent some security to check a derelict and instead they went for the world edge and got killed by being sucked into space",
            "review_score": "-1"
        },
        {
            "review_text": "The game does and did feel incomplete, I enjoyed it/got my moneys worth . There were some realy annoying bugs, but the game hit the mark for what i wanted. I bought the game with no expectations tho, and bought it after the release because the other game looked like it would interest me also (havn't played it yet).  I would not recommend this game to anyone, unless the price is 5 dollars. even then it is a very nich game with tons of flaws.  The problem is this game was supose to be something special, and it isn't. It is very shallow and depends on others to complete what they started. People to tend to make great games better because it is worth more of their time; which this is not. I hope someone out there is making an awesome mod that will make this something special, but i doubt anyone with the skills to do so would even use their time on this.  I hate the lack of content, others hate that they do not quite understand what is going on or how to control it. Which feels valid to me because i spent to the time to understand most of it, and i just felt robbed of time. It all just felt so simple, just tell me how shelves, doing the same jobs, rugs, storage lockers, ect work. I am starting to get annoyed by this tatic of hidding basic information to pad out the game. show me the core game mechanics please.  I should beable to: -do job rotations because people get annoyed by doing the same jobs. -save past job selections because the way things are set up now it takes forever to do this. -easly see and select vancant beds, and people that need them -select non leathal for my basemates, and lethal for raiders in the security tab. -set diffrent parts of my base as diffrent work areas for my guys, so i can expand without AI glitches and properly expand my base or even have bases. -recall workers to a room, or atlease the base when there is an attack. -have a happyness tab, to show how many people are feeling a certain way. -to know what the hell a rug/plant does. I am sure it improves happiness, but I dono.  This is not a bad game, but it is just the core of what makes a good game. It needs more, alot more.",
            "review_score": "-1"
        },
        {
            "review_text": "Time to beat a dead horse.  Look at that description. Look at those screenshots. Looks pretty sweet, huh?  Well, it would be, if it was finished. Instead, its a half finished, barely playable tease at what could be a good game.  If progress was half that of Prison Architect, Banished, or other similar games of the genre, this game would be worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Promising concept for a game that fails to live up to expectations. Now that Double Fine has stated that the majority of the planned features will probably not end up in the 'final game', it's not really worth getting this unless it's dirt cheap on a sale. Maybe the modding community will flesh out the game into what it should be in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "Do I get my money back yet?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is extremely glitchy, and I cannot even quit the game without my entire base population dying the second I load it again. Not to mention it goes from early alpha to release with near nothing that was promised.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased this as an early-access game, and it was mildly amusing then. I knew it was a pre-Alpha at the time, and so the fact that there was nothing really to do beyond build a few rooms and poke around wasn't a big deal. It never improved, though. The developer simply released the game in its unfinished state. At best, it's simply a bad investment. At worst, it's exploitative abandonware on the part of the developer.",
            "review_score": "-1"
        },
        {
            "review_text": "While I've enoyed Double Fine's games in the past, DF9 has left a very bitter taste in my mouth and in the future I will seriously reconsider before purchasing another of their games. This game was the first time I made an 'early access' purchase and it has completely burned me for the whole concept. I played the game whil it was still being toted in Alpha and it was a clunky mess with no tutorial. While I was able eventually able to navigate the cumbersome menu setup and get the base setup the game just kinda plateaued at that point and just never got very interesting.  Eventually a tutorial of sorts was added but it had a persistent bug that prevented it from being completed. No matter what was done the tutorial messages would persist on the screen despite having completed the objective.  Bottom line, avoid this title at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandoned early access game. A shame.",
            "review_score": "-1"
        },
        {
            "review_text": "4.9 hours in and I'm pretty sure I've seen just about everything this game has to offer.  Kinda sad.",
            "review_score": "-1"
        },
        {
            "review_text": "Double Fine killed this game, any goodwill the publc has with Tim Schaffer, and early access along with it. Way to go ♥♥♥♥♥♥♥s.",
            "review_score": "-1"
        },
        {
            "review_text": "I find this game very fun to play. While i can agree that the AI and UI is pretty bad sometimes you can still controll it pretty well. If you like managing games like evil genius then i suggest this.  Edit: It's acually pretty ♥♥♥♥ing ♥♥♥♥♥. Once you've realised the tactic, every future base you build will be easy. After a while every single attack on your base will be dealt with easily. quite literally just put turrets in half of your rooms and by the entrences and any attack will be stopped within seconds",
            "review_score": "-1"
        },
        {
            "review_text": "nah, even my soul aint black enough to stand this ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible",
            "review_score": "-1"
        },
        {
            "review_text": "F**k doublefine.  Never buy another games form that man again.",
            "review_score": "-1"
        },
        {
            "review_text": "Actually i was contemplating whether to give this a yes or a no, simply because.. it's just a normal game. I bought this as a bundle with Hack 'n' Slash, which is on a discount which makes me only spending less than 1 cent for this game.  This game started as a good game, with a great concept and all, about building your own spacebase. You have no limitations, and there are a lot of things to construct while keeping balance with residents' needs. However, this game is very confusing at a start, with so few tutorial (and it has a more detailed, although still not cover most of it, in a separate section on the main menu, which makes it worse). The actual game is actually like an endless mode, which give you everything you need to build at the start and a few resident to start with.  Honestly, i hardly can come up with a good and a bad aspect with this game. This game is actually an okay game if you have understand on how to play it, but there isn't anything appealing to it. There are some 'goals' to be accomplished, but i don't really think it's that important, or maybe the game doesn't really show it as important.  Pros: - Lots of items and room variations to build - You can assign your resident to do various jobs and raise their experience  Cons: - Assigning a bed to each person one by one can be very tiring, especially if you have a lot of residents. - No 'undo' button after doing a construction 'blueprint' - No rotate button  Should you buy this game? If you like this type of game, this game can be very cheap when it's on sale, which is good. But if you don't, just skip it.",
            "review_score": "-1"
        },
        {
            "review_text": "Game never finished",
            "review_score": "-1"
        },
        {
            "review_text": "Glitches and constant bugs, your guys will just start floating around. Airlocks just stop working, constant raids that you cant kill. Had 68 people with 20 security and 1 Raider killed everyone in the base. Even had phaser upgrade. SCREW this game IT SUCKS AND IS A MASSIVE FAILURE.",
            "review_score": "-1"
        },
        {
            "review_text": "The game had such great potential. But the state that it's currently in leads it to be more of a frustration than a fun game. The AI will consistently make poor choices, the raids are relentless with no repreive.  Hopefully the community updates will help in the future but i wouldn't play this game. Look elsewhere to sate one's base-building desires.  Don't buy this. Don't play this.",
            "review_score": "-1"
        }
    ]
}