{
    "app_id": 246420,
    "name": "Kingdom Rush",
    "release_date": "2014-01-06",
    "developer": [
        "Ironhide Game Studio"
    ],
    "publisher": [
        "Ironhide Game Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Strategy",
        "Indie"
    ],
    "achievements": 72,
    "positive_ratings": 5101,
    "negative_ratings": 182,
    "price": 6.99,
    "description": "Get ready for an epic journey to defend your kingdom against hordes of orcs, trolls, evil wizards and other nasty fiends using a vast arsenal of towers and spells at your command!Fight on forests, mountains and wastelands, customizing your defensive strategy with different tower upgrades and specializations!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/246420/header.jpg?t=1456756227",
    "minimum_requirements": "OS: Windows XP Service Pack 3 Processor: Dual Core CPU Memory: 1 GB RAM Graphics: OpenGL 3.0 compliant with 512MB of video RAM. Storage: 1500 MB available space",
    "recommended_requirements": "OS: Windows XP Service Pack 3 Processor: Dual Core CPU Memory: 2 GB RAM Graphics: OpenGL 3.0 compliant with 1.0GB of video RAM. Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "I've played more of Kingdom Rush on my iPad than any other Tower Defense game I've ever played - It's absolutely fantastic.  The one problem with the iOS version was that (as is sadly standard for the platform) it had microtransactions - there was a store that let you buy consumables (for gold you earned in-game or purchased) to use in levels, as well as one-time purchases to unlock Hero characters. The Steam version fixes this, and has no DLC or microtransactions at all - all the heroes are included in the game, and it doesn't even have the consumables store anymore.  The Steam version also includes a bunch of the bonus maps/mini-campaigns added in updates to the iOS version after launch, with the promise that the rest are coming soon in a free post-launch update that will also add a new bonus campaign exclusive to the steam version.  My only small disappointment with the steam version so far is that there's no way (that I can tell) to add a keybind to call the next wave early. There does seem to be some sort of nonfunctional keybind-manager in the game launcher, so hopefully that's something they'll add soon. (UPDATE: This is no longer true - there's now a keybind for this!)  Kingdom Rush is, in my opinion, the best TD game out there, and this Steam release is the definitive version. At $7.50 it's a steal (I can't tell you how many hours I've sunk into this game), and I strongly recommend it to anyone who even remotely enjoys TD games.",
            "review_score": "1"
        },
        {
            "review_text": "I recently started playing this game and have found myself going to bed and dozing off thinking about this game while planning how to build better for my next map. The game can get intense and by that I mean am spamming all over the place so I do not leak, my hand spasms and I leak only to start swearing and restart the map! I have even woken up at 4am in the morning to play this game and pick up where I left off.  What I like the most about this game is how simple it is yet difficult. What do I mean by that? The basics of building but knowing the best spots and when to upgrade are key points. Position is also another key factor but what also keeps me hooked is the cute and detailed visuals of this game. I can't fully take this game serious when its this cute but neither do I want to continue on to the next map with only 2 stars lol  I would recommend this game for the casual gamer who is looking to pass time. You might lose track of time but that just means you are having fun right? Catch this game on sale for half the price on some sites or just buy it off steam because either way its worth the $10 bucks. I def see myself trying to complete this game and having many more clutch moments in this game hehe",
            "review_score": "1"
        },
        {
            "review_text": "A classic. I played the online version a couple of years ago and now I am replaying it on steam. If you like tower defense games (and even if you don't like them), this is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush is one of the better iOS ports on Steam. They've obliterated the microtransactions in the game and KR legitimately feels like a TD game for the PC.  After completing the game in a little under 18 hours, here's what I think..  Pro:  - battle system is refreshing all the way to the end of the campaign - the various towers and specialties are introduced at a proper pace - the bonus stages offer adequate challenges (although a difficulty selector would be great) - game has absolutely no microtransaction gimmicks - the art is vibrant (dem colors man)   Con:  - the new units introduced in the bonus stages are not too special (they were predictable to an extent) - at one point, the units got stuck outside of the map and reduced frame rate by a lot (can be fixed with RoF) - rain of fire spam and hero usage make the game much easier  Overall it's a good game. It needs more variety but that's a common issue with most TD games.  I'm definitely looking forward to playing the new content once it's available for PC!",
            "review_score": "1"
        },
        {
            "review_text": "An excellent tower defense game. Other developers should take notes. Charming graphics, easter eggs everywhere, good balance with innovative gameplay and a lot of different options.  If you are thinking of playing a tower defense game, then this is the one. When you are done with this one and grave for more check out Kingdom Rush:Origins and Kingdom Rush:Frontiers. ",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush is one of the most fun tower defense titles I've ever played. It has charming, cartoony graphics and the addictive gameplay we've come to know from games as Defense Grid and Pixeljunk Monsters. It isn't a big game, the main game exists of 'only' 12 levels, but there are several bonus levels to be unlocked for those that can't get enough of it. These bonus levels are actually quite tough, let me tell you. I had to retry them multiple times and still wasn't able to finish any of them.  Anyway, there are also heroes to be unlocked and, thankfully, these are all very different from each other. Switching between them makes the levels less repetitive and makes them more fresh, even though nothing has changed. The hero can make the difference between victory and defeat and is a must if you want to finish the levels without making any mistake.  Of course, using your buildings wisely and upgrading them as you go is just as important. The tower upgrades are done in a fun and exciting way; upgrading eventually allows you to make a choice between one of two towers. So, for example, an artillery tower can be upgraded to a tesla tower or a missile tower. After that you can start upgrading the skills of these towers, so you can upgrade it to have a bigger blast radius, things like that. Very well done.  Kingdom Rush wouldn't be a proper tower defense game if it didn't have boss fights and luckily for us, there are several bosses to be slain during the game. They're usually slow enough to kill them before they enter the base, except for maybe the last boss, which I won't spoil here.  Additionally, the game has a few fun easter eggs/achievements that can be found by clicking on random things like a fish in the sea. It has no use or anything, but it's cute nevertheless.  I think I've told you pretty much everything there is to tell about Kingdom Rush by now. Kingdom Rush is a brilliant game that needs all of our support. Like, right now. Go get it !  [Rating: 87/100]",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Can Run on a potato - Fun and challenging gameplay - Best tower defence game ever - Good Graphics - Good replayablility  Cons: - Can't think of any tbh...",
            "review_score": "1"
        },
        {
            "review_text": "Funny, addictive little game. I though it will be too easy or silly idea, but actually it takes some skill to win.",
            "review_score": "1"
        },
        {
            "review_text": "Like many others of its kind, Kingdom Rush is a td to its very core. There are not many tricks or gimmicks presented throughout the game, beyond building your towers, seeing how your solution pans out and readjusting said plan. The games progression comes in several forms. There are passive skills, tower unlocks, hero unlocks, new enemies, new armour types and more lanes. Pretty standard fare overall. At its bare bones, this game is both functional and enjoyable. Though it comes with flaws. I should preface this by saying that this game is a td, balance and design are key to an enjoyable experience for the player.   As you progress through the game, you'll get a new tower type or hero that will assist you on the current map, and will carry over to the next. With a level that is designed to be tackled with a specific tower or hero, this can conflict with the out of level passive trees. Each tree has a power curve that can potentially ruin or improve your experience. If you don't know what the level is you're facing, you can enter with entirely the wrong tree for the task at hand. If the game presented on the level selection screen information as to what the player both unlocks and will face, there would be no arbitrary difficulty added.   The passive tree's are not made equal. Some tree's add exhorbitantly more damage than others in all situations. The militia tree is particularly strong compared to its counterparts and comes with no real flaws or weaknesses. Without this tree being at max level the game can feel a little harder than it needs to be, increasing to downright impossible on some levels.   Towers as well have balancing and design problems. Some towers are just functionally better than others for all situations once unlocked. One comparison in particular is the difference between barbarians and paladins. Barbarians are meant to deal large amounts of damage in return for being very easy to kill. Instead their paladin counterparts take twice as much damage, deal more damage as a result and have a reliable AoE. The ranger tower for example does more damage per second in an area of effect than its counterpart the musket tower which albeit has a different design path. Intended to assassinate larger targets, instead it will frequently shoot fodder instead.   Being unable to control towers, to make them do what you intended them to do can be frustrating as well. Far too often the ranger tower will apply its poison on the same unit multiple times before switching, or paladins will completely ignore enemies a few feet away. This leads to an unnecessary frustrating experience as the game requires more precision and planning in later stages.   Heros as well are not cut from the same cloth. Some heros skills are just not helpful. Why would you wish to lock one enemy down for an extended period when you can cc several at a time or outright assassinate one or more enemies. The majority of heros are just plain weaker compared to the exceptional few who excel at the roles provided for them.   While these problems exist the game is still fun once you find what works. The game really kicks off when you beat the main campaign that presents a challenge and requires creative thinking.    Bosses are always a very tough and tense experience. There is a real threat of losing the level, as they all have mechanics that you will have to account for on the fly. Bosses never seem unfair as well. Tough but enjoyable all around. Enemies are in the same vein as well. They interact with each other and your mazes in enjoyable and challenging ways.   While there are flaws to the game that detract to your ability to control, or experiment within it I would still recommend this game. There are not only few td's, but even fewer are done as well. I enjoyed myself throughout, I suggest taking a relaxed or mellow stance while playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really as good as everybody says it is. Very addictive!",
            "review_score": "1"
        },
        {
            "review_text": "got this from the Android Humble Bundle, much fun to play, discovering tacticts, what towers work best...ant then doing it again on hardmode :D  also, leveling up your hero and improving towers/skills in some sort of skill tree.  I love the comic-style of this game and the catchy music, definately a recommendation, but maybe not for the tower-defense hardcore fans. I as a more or less total noob in td finished the game quite easy. after I finished the game and all achievements, i kinda lost the motivation, there is no endless wave level...  nice and fun game to play, but i guess kinda casual :)",
            "review_score": "1"
        },
        {
            "review_text": "I played this on the iPad and really liked it, but even more so on PC. What a Great Tower Defense game. A good mix of tower placement, resourse management, upgrades, and Heroes to add that lil extra, but not usually a game changer. Add in some achievments and I'm hooked. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "I originally played the Android version and picked this up with the recent Humble bundle. It's good to see that the launch day bugs highlighted by Totalbiscuit have been resolved. Runs great on my aging dell l502x laptop at full resolution.   I’ve put 6+ hours into the campaign so far and I find that the mouse control has helped me progress further than the mobile version, it’s so much more responsive. There seems to be a great deal of content for your money, loads of levels and unlockable characters. This title is a must have for any Tower Defense fan.",
            "review_score": "1"
        },
        {
            "review_text": "If you like strategy games, this game is for you. Game has cool cartoon like animations. Story line is quite nice, game is great time waste, completing all missions, you can do secondary missions, game is full of secrets, easter eggs and other stuff, I'm happy that this game finally is on steam. If IRONHIDE game studio, will add Kingdom Rush: Frontiers &amp; Kingdom Rush: Origins, no doubt, I'll 100% buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Had a lot of fun playing this on my laptop the other day, definitely the best tower defense game I've played thus far. If you're looking for some casual gaming or a TD without the trouble of staring at the screen after setting up your defenses i'd definitely suggest getting this. There's enough content here to keep you interested and the game encourages you to experiment with your defenses by respeccing the abilities and points after each game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is definetely on the top 5 best TD games Ive Played. It's graphics are better than most tower defense games and more interesting style and feel reather than the common tower defense games. 8.75 / 10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Tower-Defense games ever. 4 different towers with 2 differnt tier-upgrades. A bunch of maps with different play style. So much fun and references to other games/movies.",
            "review_score": "1"
        },
        {
            "review_text": "Fawk, just finished this game in Normal mode, and heck that last level was challenging!! This is a really great game, the design is cute and beautiful, the levels are masterfully balanced and its great tower defense fun that can please strategy buffs and more casual players alike (depending on difficulty). The only issue is that I really want more levels now, and there are none left...",
            "review_score": "1"
        },
        {
            "review_text": "This game I really like, I am a fan of the medievil cuteness that this game has to offer, love the strategy and colors and most importantly I love the little tips you get along the way...haha trust me I need them &gt;.&lt; Awesome game, lots of fun! (Please make more!!)",
            "review_score": "1"
        },
        {
            "review_text": "As of right now I am the biggest smurf of all time, I played this game since the sunray tower was a thing. Do you know what that is? I know waht the sunray tower is. I have about 6 hours in the official pc port so far but I already have all the levels beat 3 stars on normal first try and all but 2 are beat on heroic. Can't wait to beat the entire game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Fun to play when you're bored. But it's free at  Kongregate.com , so if you aren't familiar with the game, I suggest that you test the game at  Kongregate.com  (or another site) before you buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet complexe. I finished all their games on Iphone and I had a blast. This game is worth it even if it's free on iphone the dev's did such a good game they deserve their game to be sold at a decent price.",
            "review_score": "1"
        },
        {
            "review_text": "I'm nearing the end of the main campaign and can easily say that Kingdom Rush nails the formula for the perfect tower defense game. Each level is balanced with the right amount of difficulty with tons of replay value. I occasionally found myself stumped in the boss battles and special challenges.   The difference between Kingdom Rush and your typical TD is that the player can build rallied barracks to slow down enemy creeps from their fixed path. In addition to that, Kingdom Rush introduces three types of offense towers that branch out in two paths which can then be further customized with unique abilties; giving the player full control of the field.   I would definitely recommend Kingdom Rush to anyone interested in a tower defense that requires a good amount of thought and strategy.",
            "review_score": "1"
        },
        {
            "review_text": "First tower defenense i've ever played, still the best one i know. Really good game by Ironhide Games Studio! ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of new content, no DLC, all Heroes and new levels... why not ? (they are updating the game often)",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Pretty fun and smooth gameplay featured with nicely drawn graphics and a few funny gimmicks.  You can start optional challenges to earn a few extra stars and points for improvents of towers and abilities you can afford through the game. It's not the game you could play all day long, but it's worth its money when you can get it a few bucks off.  inb4 exploding sheeps",
            "review_score": "1"
        },
        {
            "review_text": "  Kingdom Rush   is a classic cartoonish tower defense game in which players deploy different types of units (Archers, Mages, Siege, Infantry) to fend off wave after wave until you beat the level.    SYNOPSIS    With the new update, the game has 20+ levels that each have a heroic + Iron mode, which makes the total count at around 60. The game also has three different difficulty levels; Casual, Normal, and Hard. I recommend playing Normal if this is your first tower defense game, otherwise play Hard. The game is pretty well balanced in terms of challenging levels that don't make you want to rage quit the game.    Achievements    The game's acheivements are all very obtainable. Just don't play Casual if you want to get all of them. To 100% the game took me about 55 hours, but it could take much less if you're used to tower defense games.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I've had in years. It's so simple, yet so addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Tower defence game!",
            "review_score": "1"
        },
        {
            "review_text": "Just like tha Android version with maybe a little extra.  Totally worth it when it's on sale. I wouldn't buy it for $10 though. For $5 it's totally worth it and great for those who love tower defense games.",
            "review_score": "1"
        },
        {
            "review_text": "my favourite tower defence  very clean and appealing art style  some heroic and iron challenges are very hard, not casual at all",
            "review_score": "1"
        },
        {
            "review_text": "a great game for stratagy or puzzle fans.",
            "review_score": "1"
        },
        {
            "review_text": "I highly reccomend this game. Buy it for yourself and see the fun that will transpire.   P.S. Ironhide Studios I made this review to get you to add the other Kingdom Rush games to Steam, for similar great values. Love your games, continue the great work!",
            "review_score": "1"
        },
        {
            "review_text": "this game was amazing, with such a beautiful graphic cartoon style art, great environment, nice mood, casual challenge and not so hard difficulty. this game is very recommended for tower defense fan, or maybe you dont like tower defense, but this game is also great for you too. so just get this game and take your time, you'll love it. some bad things are this game a little buggy but overall this was a great game.",
            "review_score": "1"
        },
        {
            "review_text": "this is a gud game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Nolifed to the max.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best tower defense sort of game there is. You can't go wrong with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Like many I have been playing TD games since Desktop Tower Defense emergered onto the scene and I have to say that Kingdom Rush is, by far, my favorite one. The graphics are simple yet beautiful and the music is top-notch. The voices are cliche in the very best of ways, filling the game with referential humor. (If you didn't at least smile the first time you heard the dwarves shout 'Yippi-Ki-Yay', check your pulse because you are probably dead.)  I can not wait wait for more content from Ironhide.  One downside though; since getting this on Steam, I no longer enjoy the phone versions as much- I would much rather play on the pc than the phone. (Hint, hint - Not so subtle way of begging Ironhide for a Frontiers release on Steam.)  To the TD initiate, KR may seem very difficult on certain stages. Just remember there is a huge component of strategy involved and some stages may take a few playthroughs to figure out the optimal placement of towers and heroes.",
            "review_score": "1"
        },
        {
            "review_text": "It's a beautiful game, so epic. And, at least in the mobile version (especially in KR: Origins) it have so many cameos to some movies like Alien, Pirates of the Caribbean, TLOTR, etc. You must have it.  The only bad thing with the game is that is too short :(",
            "review_score": "1"
        },
        {
            "review_text": "I rate this game 11/10 because of it's simplistic yet tactical game play. I played this game back when I was 9 years old, when I didn't even know that things like Origin or Steam existed. I played this on Google Chrome, normal version and unfortunately hacked version.  I loved it then, I love it now, it is not complicated to play or learn, you just have to give the game time as you progress through each level. The other thing I love is that on the Browser version there weren't as many levels and they didn't have heroes.  I recommend this game because it's relaxing to play whilst listening to music.",
            "review_score": "1"
        },
        {
            "review_text": "Bought Kingdom Rush, immediately played it, played for almost 8 hours straight (took 1 break)...my g/f is mad...do I have a g/f anymore?...Time to play more!!   TD at its absolute best!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with adorable characters. Plenty of stages and achievements to unlock. My only complaint would be to add more unlockable upgrades to use earned stars on.",
            "review_score": "1"
        },
        {
            "review_text": "its really a good TD games.. hope can find some similar game in this winter sale.. xD",
            "review_score": "1"
        },
        {
            "review_text": "Best TD game ever. Was on Kongregate and now its here. Filled with humor and such. And very good gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant Game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defence games there is! This is definitively the right game if you want to kill some time!",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense game I have ever played, every minute spent playing this game was an enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "The best Tower Defense game out there, now finally available on Steam ! Superb &amp; addicting gameplay, excellent level design.  I really enjoyed this game, a lot !",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Buy it. There's a free version available, but support the devs so they add EVEN MORE CONTENT. :)",
            "review_score": "1"
        },
        {
            "review_text": "Simply a fantastic game! If you like tower defense games there is no way around this game. I love it!",
            "review_score": "1"
        },
        {
            "review_text": "I played the IOS version of the game a lot. I recently got it on steam, and I am very happy with it. I like how it got rid of dlc.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best games I've played, certainly in the Tower Defense genre. The levels do get really difficult after the last level in the story mode. There are levels afterwards, but they're extremly difficult. I would suggest one thing: having a sandbox mode that you could just experiment with towers and the various enemies. But I highly suggest this game if you enjoy tower defense games/strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "This is a TD, that wants you to accomplish a map in one specfic way or you will never get max stars. Basically its the devs strat or no strat, this is the worst type of TD design. But if you slog through and discover the devs strat and don't go look it up, you will find some entertainment here for awhile, but because there really is only 1 strat per map, there is no replayablity, unlike other TD games that give you actual choices. Its worth its low price when its on sale for 75%-90%, but because it has no replayablity I do not recommend buying it when it is not onsale.  If you can keep yourself from visting the walkthrough section and bascially removing all the content lol you will enjoy the first run through, the diffculty sliders in game bascially don't affect jack either so set it to hard.",
            "review_score": "1"
        },
        {
            "review_text": "Updated re-release of something that turned the casual scene on fire a few years ago.  The x10 increase in download size definitely comes from higher def sound and graphics. +1 to finally being released and congratulations. The game doesn't follow F2P with unlockable DLC; instead you buy it once, and everything will be unlocked step-wise once you clear the required stages.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defence games ever. For all genre lovers - instabuy. Very addictive and very funny.  Support developers - buy the game, it cost its price.  Yippeekayay, mother *ucker!",
            "review_score": "1"
        },
        {
            "review_text": "best tower defence game on steam, the best in my opinion, kingdom rush would be brilliant if it had a multiplayer; 2 player co-op beaten; well beaten my experience pixel monsters on PSN and PS3; and the graphics and gameplay definitely are done well",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun little tower defence game. It's based on the flash game of the same name, however they updated it with all kinds of new things and a campaign that continued to be in development whilst I was playing, but recently has been completed. Basically with the upgrades, it's good to be careful, otherwise you can mess up and end up penialising yourself badly.  Besides that, it's your standard turn-based game with RPG elements for the towers and even the heroes you gain. The heroes start at level 1 on every stage, but level up with the more enemies they kill. I recommend this for anyone who likes fun and querky tower defence games.",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush is a great Tower Defense game and is guaranteed to win over the hearts of any TD player. Anyone remotely interested in a tower defense game should consider it. I played it on the iPad when it was first released, but without any of the heroes and extra campaigns. When I played the game on steam it felt new and challenging.  Gamers that think they don’t know TD should give Kingdom Rush a try –I think it might just be what you needed to appreciate the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Has a itegrated hack, its called Tesla tower.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun tower defence game that ramps up the difficulty at a decent pace. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best tower defense out there. Sending in reinforcements and using hero of your choosing adds to the feeling of being actually involved in the action of which there's a lot. Monsters come in numbers even on casual difficulty so the game does not get too easy.  + there's a lot of visibile or hidden jokes in the game which makes it even more fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Much better then mobile version.",
            "review_score": "1"
        },
        {
            "review_text": "great game, i played this a while back on my phone, its even better on pc, koodos to the dev",
            "review_score": "1"
        },
        {
            "review_text": "+ HD widescreen tower defense + Has pretty much everything from the iOS version, except for 3 heroes (Hacksaw, Oni, and Thor).  + The extra paid heroes that are in the iOS version are unlocked via completing the campaign.  - No syncing of game progress between either iOS or flash versions  *will add anything else I notice as I continue the campaign",
            "review_score": "1"
        },
        {
            "review_text": "Please make the kingdom origins in pc",
            "review_score": "1"
        },
        {
            "review_text": "There are certain games that I have played. Games that make me think about them when I go to bed and looking forward to the next day where I'll be able to play them again. This is most definitely one of those games.  If you like tower defense games, this is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this many years ago, in some Google Chrome app and have always loved the art style and the gameplay. Finally got it on sale and I am loving it! Enjoy the variety of enemies and the hero mechanic. Just defeated the first boss and hope I can continue my way to fully completing the game.",
            "review_score": "1"
        },
        {
            "review_text": "waiting for new maps",
            "review_score": "1"
        },
        {
            "review_text": "I AM A LARGE MANITEE DID YOU KNOW SAILORS USED TO MISTAKE MANITEES FOR MERMAIDS.",
            "review_score": "1"
        },
        {
            "review_text": "this is good chicken",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good,it is cute and it is harder than else games like this one,it made me nervous,but so interesting!Wonderful!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "If you are the fans of tower defence game. This is MUST buy.",
            "review_score": "1"
        },
        {
            "review_text": "Love it",
            "review_score": "1"
        },
        {
            "review_text": "quick to learn, fun to play, challenging to master",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite TD game since it came out in 2011 :)",
            "review_score": "1"
        },
        {
            "review_text": "Addictively fun. Very rewarding and fast paced",
            "review_score": "1"
        },
        {
            "review_text": "Fun little tower defence game!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best tower defense games out there. It is so well balanced that every map gives a decent challenge and offers tons of replay value. It was a nice variety of maps and towers and enemies. You really have to plan out your defense and not just plant towers down haphazardly. The Steam achievements really add to the experience. This was how the game was meant to be played, not on a 4 inch screen!",
            "review_score": "1"
        },
        {
            "review_text": "By far my favorite tower defense game. If you like TD at all you should pick up this game on at least one platform. It is great on mobile as well. Very highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "11/10 This game is absolutely awesome!",
            "review_score": "1"
        },
        {
            "review_text": "The game is quite old but it is one of the best tower defense i've ever played.  The graphics are good enough and the gameplay is flawless.  The price is a little bit high so don't buy this game at full price, wait for some offer or get it on some bundle.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defense ever now ported to Steam. A must have.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun tower defence games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "Great game sorta addicting love the animations and voices xD",
            "review_score": "1"
        },
        {
            "review_text": "This is - without doubt - one of the BEST tower defense games ever made. If you can snag it on sale, it is worth every cent. If not, you can play MOST of it on Kongregate for free. Good luck, grab a sword, and fight the Horde!",
            "review_score": "1"
        },
        {
            "review_text": "Why pay for a PC port of an iPad port of a free Flash tower defence game? In addition to being possibly the best tower defence game ever, the iOS version's in-app-purchase heroes are all included at no extra cost here (Steam seems to only allow gratuitous microtransactions for model train games) and this version looks surprisingly good in 1080 widescreen.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Best defense game on iOS now grows up and comes to PC. Could not recommend more for anyone who enjoys the tower defense genre.  The art style is fun without being childish, the strategy is deep and challenging without being cumbersome or difficult to learn, and there is plenty of content to justify the price.",
            "review_score": "1"
        },
        {
            "review_text": "God damn this TD completely blew my mind, I bought it as I saw it featured on a humble sale and I thought 'Hey, I haven't played TD in ages, this one looks fun.'. Turns out I haven't played such luxurious one since Gem TD as well. Art is cartoony and very cute. Also, unexpectedly rich for an indie game. Large amount of monsters, locations, heroes, towers, tower upgrades. You always have something new to notice and look at. From the big picture view, design is standard with expected TD patters, nothing new. However, developers gave huge focus to design details that make you fall in love with the game. You will start to notice them right away and uncover much more through the campaign. This is what makes the game so amazing. Funny voice responses of heroes full of various references to games, movies, etc. Map easter eggs to discover and interact with (sheeps, windmills, ...). Gameplay is very smooth and well designed. You can play it casually, enjoying your time, or like a pro, thinking of crisp timings and deep strategies. Simply put, playing this game will give you a great satisfaction from many different views whoever you are. I just can't recommend this gem from Ironhide Game Studio enough.  About drawbacks, there are few I would like to mention: First, the waypoints and reactions of melee tower soldiers... I am quite experienced in Blizzard strategy games and these melee units are completely unituitive for someone like me. At the same time I believe they made it intentionally this awkward to keep balance and give space to more try-hard players. Second, I feel like every level requires a certain strategy which you have to uncover and successfully use, experimenting different builds usually ends up in a failure. Last, there is no level editor. I understand this game came from its web/mobile predecessor, but giving space to talented and passionate players might yield so many interesting levels and patterns I would love to see and understand.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful, fun, and tactically satisfying tower-defense game with one of the smoothest(but not pampering) learning curves you'll ever find. Armor Games has really outdone themselves with this one, and nothing more needs be said :)",
            "review_score": "1"
        },
        {
            "review_text": "I played Kingdom Rush for free at Armor Games years ago, and was immediately addicted. I blew through the whole thing within the span of a couple of days. I was browsing around Steam when I found this here, and asked myself, 'Why would anyone buy this? Don't they know it's free at Armor Games?'   Well, I did some reading, and supposedly they added some content and some DLC, so I went ahead and bought it. After all, even if the extra content was bogus, it was still an amazing game worth paying for, and I definitely wanted to support these guys. I was pleasantly surprised with how gracefully the game aged. They applied a fresh coat of HD paint to the game, and added  Heroes , whom you pick up along the way.   Heroes aren't just a gimmick either- they add to the game in a way that the game actually really benifits from. You select one before your battle, and you can guide your hero around the battlefield wherever they're needed most, which gives you more to do than just sit there and watch your towers work. In fact, I completely forgot about the reinforcements button after the addition of Heroes.   As my favorite Tower-Defense title, let me tell you that if you played it for free at Armor Games, it's still entirely worth the buy, especially right now since it's marked down by 25%. Great work Iron Hide. I'm completely happy with my purchase, and I encourage anyone who's looking for a charming but challenging Tower Defense game to give this one a whirl.",
            "review_score": "1"
        },
        {
            "review_text": "this and Plant vs Zombie is easily my top 2 favourite TD games",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, I really like it and I've played it a lot on Armorgames . Whatever , I bought it on Steam to support Ironhide but after playing just the 3 first levels the game crashes and won't start again ( the game opens, asks me what are my graphic preferences then screen goes white and the software crashes). My review is negative until they fix that ( sorry if bad english not my main language)",
            "review_score": "-1"
        },
        {
            "review_text": "Great for anyone who enjoys TD games! Very well done and berfectly balanced. Heroes are great, the upgrades are great - and considering it's a TD game it does a pretty okay job of telling a story.",
            "review_score": "1"
        },
        {
            "review_text": "How the ♥♥♥♥ am i able to right a review when i dont even have the game. Just came to look at what it is.",
            "review_score": "1"
        },
        {
            "review_text": "a must buy game - tons of fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "its great :D",
            "review_score": "1"
        },
        {
            "review_text": "Game looked fun on the trailers But the towers seem very weak compared to many other tower defense games Tower placing are pre-fixed and requires little strategic placing Forces player to stick to some weak choke points Forces player to build melee units that spawn to delay enemies Melee heroes are useless as ♥♥♥♥ compared to ranged heroes Game is hard and requires alot of retrying and restarting levels I completed the story and i dont feel like i want to go back and play more  Not worth the price tag",
            "review_score": "-1"
        },
        {
            "review_text": "The best tower defense game I have played",
            "review_score": "1"
        },
        {
            "review_text": "This is NOT a good tower defense game. Just compare a few pieces to any other decent TD game: Does it have pathing? No Can you win later levels (or even early ones) on the basis of your tower (defence) alone? No Does it require intense micromanaging on most (and especially later) levels? Absolutely Are there levels where there is essentially only one way to win? Yep Are there very obvious holdover elements from its mobile roots? TAP TO UNFREEEEZE TAP! TAP! TAP!  It puts on a good front, it looks cutesy, the barrier to entry (during a sale) is pretty low, and there's lots of easy to get achievements. What you will miss out on if you play this versus another, more polished tower defence game, like Defence Grid or Anomaly, is FUN. Also, a lot of the core mechanics that have made TD games less of a chore and more of a puzzle. Go buy one of those instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Just a port from the flash version, contains perhaps 10% more content. Game is both easy and repetitive, maps are always the same, and offers little difference from towers.",
            "review_score": "-1"
        },
        {
            "review_text": "for a tower defense game it is pretty cool i guess nicely done artwork but still needs a bit of fine tuning all in all a decent game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defence games out there. Great graphics and fun game play. :)",
            "review_score": "1"
        },
        {
            "review_text": "fun but dont expect to get more than 2 hours out of it. At the price it is not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe I should finally get around to write a review of the first game I completed in regards to Steam achievments and almost all stars.   I've never been great at Tower Defense games, but this made me persist! The Graphics and the overall atmosphere of the game made it addictive as heck!  I wholehearted recommend the game if you like Tower Defense. Loads of levels Loads of strategies for each level Loads of tower/configurations Load of FUN! And several difficulties to boot will make this last and is easily worth the full price.",
            "review_score": "1"
        },
        {
            "review_text": "Great, fun game. Worth the $10.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. :D Should play it..",
            "review_score": "1"
        },
        {
            "review_text": "My favorite tablet game now on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "Its kingdom is in dire need of rushing :Z",
            "review_score": "1"
        },
        {
            "review_text": "I first played kingdom rush back in the early days on a website called Kongregate and thought it was extremely fun. I never imagined that they would be able to improve it so much as to be able to sell the game on Steam!   This is a Tower Defense game, meaning that you have to strategically place buildings (There are four buildings to choose from) in locations so the waves of oncoming enemies don't overrun you (get to the other side of the map). The game offers three modes for each map, each giving you currency to upgrade your abilities, buildings and your heroes.   Probably the best part about Tower Defense games in general is that there is always more than one way to successfully beat a level, so if you want to beat down your enemies with only arrows, you go girl! (or guy ;p). Unfortunately sometimes a single type of building, despite how many times you upgrade it using the money the monsters you kill drop (which you don't need to worry about picking up thank goodness), won't be sufficient in beating said level. You'll need to adapt sometimes.   What sets this game apart from the other Tower Defense games for me is the beautiful art style. I am not a huge fan of pixelated games, though I will try them if I hear good things about it. Another thing are the heroes and their unique abilities to help you in battle, as well as your own abilities.   Reviews for this game are generally overwhelmingly positive, and rightfully so. This game is perfect for that coffee break during work hours, or for sitting at home when you want something casual yet challenging and stimulating at the same time. I highly recommend this game, and if you don't feel like paying for the full version before you get a taste, go try it out on  www.kongregate.com  and get a taste of the game for yourself!   My Rating: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a huge fan of tower defense games. I've played some and most bored me very quicky. Kingdom Rush is different. It's challenging enough so it keeps you playing, but not frustrating or cheap difficulty. It also looks and sounds very nice and just has a very pleasing aesthetics. Try the flash version, and if you like it, I'd recommend either the steam or the mobile version, the bonus maps are well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "I havent played this much on steam so fat, but I have the same game on my phone and it is excelllent.",
            "review_score": "1"
        },
        {
            "review_text": "Easy at first, then gets difficult really fast, but I enjoy the challenge. I think it would help to get more explanation of the tools, but other than that it's really fun once you figure it out.",
            "review_score": "1"
        },
        {
            "review_text": "Bought in sale for a few pounds and didn't know what to expect. Found a very addictive and fun tower defence game, definitely worth a purchase if on sale again.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite tower defense games. I played the smaller free version online and had to buy it when was added to Steam. Smooth gameplay, lots of levels, upgrades, and achievements to earn. Worth every cent; you'll get dozens of hours of gameplay trying to beat the harder levels. Lots more content than the free to play version.",
            "review_score": "1"
        },
        {
            "review_text": "Out of all the games i have, I still play this one the most! One thing i liked about the mobile versions though was being able to upgrade my hero's, could this be implememted? :) Thank you for NO microtransactions!!! This game ROCKS!!! so FUN!",
            "review_score": "1"
        },
        {
            "review_text": "The best td game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Steam's reatil version of the popular online arcade game is alot of fun, with all the characters for the price. Still doing a play through, but I've already beaten the main campaign and have to say the extra missions make the game alot of fun to play even after you've beat it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush is a fun, cute, Tower Defence type game. Reminds me of Castle Crashers a bit. A bit of strategy is involved in playing this.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun tower defense game with some uniquely challenging levels.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game that requires strategy. You will get caught up in the game so much you will lose track of time. *^*",
            "review_score": "1"
        },
        {
            "review_text": "Awesome TD game! Hard sometimes and has more to do after beat it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very entertaining TD game. As an original TD dev, I had a lot of fun playing this. I just wish there were more tactical options to tower placement, but I enjoyed this game despite that.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fiddly 2D tower defense game with active abilities, units to control, setting rally points, and different upgrade paths for towers. You have to think on your feet and adjust your strategeries. Some maps require more magic, others require more martial strength, and I often find myself hitting a wall a few times before I realize I have to do a topsy turvy in my approach. The art style is highly stylized and cartoonish, with bouncy units careening across your screen and lots of yelling like 'To battle!' and 'Fully loaded!'.  I can only take so much of this game at a time and it's honestly not my favorite tower defense game out there. It's an ugly mobile port. But I've seen worse, at least it doesn't tell you to 'tap this or that' or go to a cash shop.",
            "review_score": "-1"
        },
        {
            "review_text": "Greatest Tower Defense Series on PC and Mobile",
            "review_score": "1"
        },
        {
            "review_text": "Such a great looking game. The gameplay is strangley addictive and really fun to play for hours on end! One of my favourite games of all time!",
            "review_score": "1"
        },
        {
            "review_text": "It took me only 3 hours to complete the main campaing story. But the game is good.",
            "review_score": "1"
        },
        {
            "review_text": "cartoony tower defense with charm. Liked it alot except for the steep difficulty curve towards the end",
            "review_score": "1"
        },
        {
            "review_text": "Such a shame the sequel and the prequel aren't coming to PC, this is probably the most polished tower defense I've played in ages.",
            "review_score": "1"
        },
        {
            "review_text": "Played it from the beginning about five times... Do i have to recommend it more?? Definitely the best tower defense i have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "As far as tower defense games go, this is a good one. The art is great, the sound design is especially great, the levels are fun, the variety of enemies and heroes and powers and towers and upgrades... It's all top notch. You can tell that this isn't some iOS store trash, no corners cut, it's just a solid, well-made tower defense game. So fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome tower defense game. Unlike many other tdm games this one has quite a lot of strategy on it. You have heroes that can do lot's of good stuff and few spells to aid you in the battle. However the enemies have other tricks too, including but not limited to healing other enemies, ranged attacks that can kill your units quickly, abilities to spawn other enemies and shut down your towers.  But...why would i pay for a game that can be played for free? Well you are kinda right but flash games are kinda bad as they have lag, ads and other crap. Try it out and if you like it buy it on steam",
            "review_score": "1"
        },
        {
            "review_text": "Light system requirements and interesting gameplay will make this tower defense gem a wonderful addition to any library. For tower defense fans, this title is a must. It is proof that triple A gamplay doesn't need a triple A budget or price point for that matter.  Would rush again 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Played the mobile version and I was hooked. I proceeded to play through all game modes and difficulties. As soon as I found this was on Steam I purchased it immediately and replayed the entire game again. The references (easter eggs) are clever and enjoyable to seek out. The gameplay is also fantastic and the achievements are realistic to obtain. A++++",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up in a bundle and didnt think much of it until i gave it a shot. A great tower defense game with bright color and good mechanics made it one of the best i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "If you buy this on sale you cannot go wrong. It is fun. Occupies the brain for an hour or so at a time. I bought this game on sale for about $5. I have played for 21 hours that works out to 24 cents per hour and I still expect I will play at least another 10 hours - NOT A BAD DEAL IN MY VIEW FOR SOME ENTERTAINMENT.",
            "review_score": "1"
        },
        {
            "review_text": "Good (Simple) Tower Defense Game. Played it already when a version was free to play at  newgrounds.com  (ages ago).  If you like Tower Defense Games ==&gt; Buy this one!",
            "review_score": "1"
        },
        {
            "review_text": "I have really come to like Tower Defense games and this is one of the games that has led me there. It does a wonderful job of gradually letting you do more and unlocking upgrades. I love the frantic nature of whoa, there are a lot of enemies coming. You need to figure out what strategies work best for you and each level. For example, do you spend your gold early on the more expensive, but amazing once it is fully developed artillery? Do you spend on the cheaper options? What about when you can branch off? Do you upgrade the barracks to barbarians or paladins? It is also amazing when you see the end bosses of levels come out and you are panicking.  This is a game that you will gladly spend some hours playing. When you are done all the levels, you can go back and do them on harder difficulty. If you like Tower defense games, get this. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "If i've got $1 for every giant that i killed, I'd be a millionare by now.  10/10 for the best tower defense game of all times.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game with plenty of upgrades and by the 10th 11th mission it starts getting tough and you really need to plan what towers and people you are putting and where i had to re do a level 4 times with different methods before i passed it , which makes it way more worth your money as some games in the similar ilk you can rush through in a couple of hours , this gets hard and a real challenge and therefore worth your money, good sound and good graphics 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun little tower defense game. I remember playing it when it still was a free flash game on the internet. Steam version has some stuff added to it, like more levels. I recommend to buy it because that way you'll support the developer :)",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Game, nothing to dislike.",
            "review_score": "1"
        },
        {
            "review_text": "Classic tower defence game, but the devil is in the details - lots of fun easter eggs in the maps for sci-fi and fantasy fans. Completionists will not be disappointed either!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very nice TD game. It has some nice eastereggs here and there, one just has to look for them.",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt one of the best tower defense games. Creative designs of heroes and enemies. No confusing user interface. No frustratingly difficult achievements unlike other games in this genre. Haven't got a chance to play Frontiers yet, but I definitely will.",
            "review_score": "1"
        },
        {
            "review_text": "It is a really well-made game and i enjoyed the story and tower defence aspect.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda reminds me of Ninjatown, only not as good. It's a solid casual TD game and far from simple to complete. I hope the next Bloons game is on steam...",
            "review_score": "1"
        },
        {
            "review_text": "Evrey one needs a game like this. I love playing games like CounterStrike and others of the genra but after awhile you need a unwinding game. A game you can actually play casualy and have a great time doing it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defence games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Its hard to describe how great this game really is. I think my fiance hates it. ;)   I literally beat the game in the original mode (not heroic or champion) within 2 days. It's that addictive. I've played a few TD games here or there, but this one is by far the greatest. I had some laughs (prepare for the hilariously foul languaged bombardment towers in all their Irish-accent-glory).   The one thing I can't wait for is MORE LEVELS! I really wish they would have some type of 'endless' mode like some TD's out there have. You'd be able to hone your skills and see how far you can get and compare scores with others by how many waves you defeat..  One of the funnest parts about this game is 'picking the right hero for the right battle.' You'll pick up on this pretty quick once you get toward the end-game.   After you beat this game in original mode, you'll unlock a few more levels (some are ridiculously hard! Make use of Tesla towers every chance you get.. they'll get you by.) Heroic and the other modes are fun.. they definitely require some thought. I just wish I could make use of Heroes after the end-game a little more.. they're fun to play with.  I can't wait for more content!! I give this game a solid 10/10. Great developers, great game. They also listen to the community and offer patch-releases that update some requested features. Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome TD if you are into that sort of thing. It feels quite different from most other TDs in that there are no slow or stun towers - but rather you use soldiers to keep the enemies at bay while your towers hammer away at your enemies. Quite challenging and fun",
            "review_score": "1"
        },
        {
            "review_text": "While the original game was a mobile port, this version has been remade visually and the quality is fantastic. Its a great, and very different, tower defense. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defence game ive ever played. Requires a lot of strategy",
            "review_score": "1"
        },
        {
            "review_text": "Hours of fun and just the right amount of frustration. Highly recommend for anyone who likes tower defense games.",
            "review_score": "1"
        },
        {
            "review_text": "Second favorite tower defense game next to defense grid. The ios version has more features which hopefully end up on the steam version. Recommend playing on an ipad until then.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game! I remember playing this on my mobile, but on pc it's even better! Definately worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game....need more tower defense games like this.",
            "review_score": "1"
        },
        {
            "review_text": "kingdom rush is a fun game i love the boss fights and theres a ton of towers to get i would recommend it for anybody",
            "review_score": "1"
        },
        {
            "review_text": "Hope they add in the exclusive prem content for flash version as well at this Price",
            "review_score": "1"
        },
        {
            "review_text": "A high quality port of one of the best Tower Defense games on the market! Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This game is way better than the online version and it's worth the nine bucks. You are more aware with the better graphics and bigger screen. The included DLC adds more monsters and maps for you to keep playing.",
            "review_score": "1"
        },
        {
            "review_text": "Why doesn't everyone have this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the better tower defens games out there. At master level the stages can be quite challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun tower defense game, pretty challenging at some parts, too.",
            "review_score": "1"
        },
        {
            "review_text": "Don't underestimate this game because of its aesthetics or mobile port. It's a challenging tower defense game that is addictive and satisfying. The added heroes, skill tree, and upgradeable towers all bring creativity and deeper strategy to the genre. For any lovers of TD and strategy games, I highly recommend 'Kingdom Rush'!",
            "review_score": "1"
        },
        {
            "review_text": "This is the game I played on Kongregate or something similiar few years ago... Then again, about a year ago...  Although I finished it two times before, I got pretty excited when it got Steam version...  It is a fantastic, casual, Tower Defence game, with beautiful, comic visuals, and very interesting gameplay... Every tower is very useful, depending on situation, and when fully upgraded they get some pretty cool abilities. They also added heroes (although, I think they were in newer flesh versions before) and new levels... Heroes are not too powerful, but can help you with single units that got away, because they are movable across 'battlefield'...  After all, it is a great tower defence game I cannot recommend enough to those that love the genre...  P.S. You can turn monsters into sheep... Also flying monsters... So you get flying sheep... Easily the best reason to buy this game...",
            "review_score": "1"
        },
        {
            "review_text": "Very easy game to learn with a respectable learning curve. Although some towers are clearly stronger than others there aren't any major balance issues.  Good for anyone who likes short and to the point games =D",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "Risk, Stratego, &amp; Civilization VII. All combined into you, the columbian.",
            "review_score": "1"
        },
        {
            "review_text": "Definitly my favorite tower defence game, and i enjoy every aspect, it has all bases covered, including upgrades. Highly comical and highly entertaining. Its a yes from me :)",
            "review_score": "1"
        },
        {
            "review_text": "Very good tower defense game. It will be better if have Steam Cloud support",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game! Definately worth ten bucks, the graphics are so cool.",
            "review_score": "1"
        },
        {
            "review_text": "An exellent tower defence with plenty of heart and substance! A surefire reccomend!",
            "review_score": "1"
        },
        {
            "review_text": "Much better than the flash game, I feel that I got an impressive amount of value for money. Fun, well-made tower defense that'll hook you especially if you're a bit obsessive about completing games 'fully' and aren't crazy about the freemium in the latter version.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played too many tower games but I can say that this one is excellent. It's plenty of fun and includes heroes, which adds even more to the game. At first I thought it was a bit too easy but I found the later levels, after finishing the campaign, to be a bit more challenging.  Definitely a good game and worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "The game is so addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so much.",
            "review_score": "1"
        },
        {
            "review_text": "Ironhide Games have demonstrated that doing simple things well can still result in a great game.   Although Kingdom Rush doesn't innovate the 'Tower Defence' genre, it masters the core mechanics. Towers, upgrades and enemies are all distinct and easy to understand, multiple modes create vast replay-ability, adjustable difficulty allows a constant challenge and the graphical aesthetic is charming. Nothing ground-breaking, but everything polished to near perfection.   Unfortunately Kingdom Rush lacks two features that would leave this title unrivalled. Firstly, 'Cloud Saving' isn't supported and thus replaying after reinstallation can be a pain. Secondly, there is no 'Steam Workshop' integration and thus the chance to create and play user constructed levels is non-existent.  Nonetheless, Kingdom Rush is the best 'Tower Defence' game in years. I recommend this at full price.  (A 'To The Point' review by Jake 'Azro' Hevness)",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush Is a simple concept strategy game. The point of the game is to defend against enemy forces from reaching there destination. You control the routes defense points by selecting the choices given. Some choices will work in your favor while others will be inefficient from the enemy breaching your military posts. I found the game very entertaining and replayable. 8.25 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I have played the game on Flash, iOS and Android, this is seriously one of the best tower defense game to have ever came out. The graphics is great and the gameplay is near perfect.   The only downside to the Steam version is the lack of purchasable power-up items; some stage are just way too hard without them. Also the lack of earning gems means lesser replayabilities. I don't understand why this feature was removed.  Still, it is a great tower defense in its own right. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defence game. Huge range of tower upgrade options and paths. Interesting array of different heroes to use. One of the best tower games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "fun game, but there is no more update at late",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defence game, only disadvantage I found is that the game has no way of fast-forwarding time if you've got a good defense and you're too bored to sit through annihilating waves and waves of opponents.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing and thoughtfully made. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've played a lot of tower defense games, and this is one of my favorites. The graphics are charming, the tower options are solid, and it has a lot of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy I ever played... The first part is easy... the second part is a bit too difficult and there are too much reliance on fast clicking instead of strategy thinking...  What is good about the game is the upgrade provide a real sense of progress and enough varity making the games interesting. Every enemy is a bit different and a strategy working for one may not work for the other...",
            "review_score": "1"
        },
        {
            "review_text": "Kingdom Rush is a fun tower defense game. I played this game when it first came out on mobile and found it enjoyable. There is no ability to change the difficulty and it can get very frustrating and sometimes overwhelming. Your strategy will have to change throughout the game to be successful. If you are the type of person that enjoys a good challange, definitely pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Quite enjoyable. Very easy to pick up. The levels begin trivially easy, but rapidly begin to challenge. Yet you will find that you can proceed 3/4 through the game winning each map on the first or second try, which I find enjoyable. The later maps require many multiple tries.  Between the during-session upgrades, the between-session player upgrades, and the (limited) strategic placement of buildings, there are many aspects to master.  Quite worth around $15-$20.",
            "review_score": "1"
        },
        {
            "review_text": "I summarize this game in 1 sentence. Best tower defense game I've ever played.  You will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "A simple and quaint game. Relives good memories and I like the variety of towers and strategies necessary to win. Plus a game where soldiers are your weakest class makes room for a lot of creativity in tower building.",
            "review_score": "1"
        },
        {
            "review_text": "Love the art style. Love the defense. How you wish this isn't just a tower defense game.",
            "review_score": "1"
        },
        {
            "review_text": " What is Kingdom Rush?  Kingdom Rush is a Tower Defense game. Each level has roads that enemies traverse in waves and if they get from their starting position to the other end you lose life points, causing you to fail that level when your life reaches zero. To prevent that from happening players can build towers, control heroes and summon comets and reinforcements. Towers can be built on predetermined locations alongside the road and attack the enemy. There are four kinds of towers - Barracks, Dwarven Bombard, Archer and Mage - and each affect different types of foes in different ways. Heroes are powerful individuals who will aid you, leveling up as they vanquish foes, unlocking new abilities and becoming even stronger as the level continues. Apart from that, the player is also able to summon a Rain of Fire from the skies to strike foes on the battlefield or spawn timed reinforcements.   Money, game modes and upgrades  Money is collected by slaying enemies and starting new waves of enemies early and is used to either upgrade existing towers or build new ones. There are three game modes per level in total: Campaign, Iron Challenge and Heroic. Whilst Campaign is the normal story mode, Iron Challenge and Heroic provide a new challenge, spawning stronger waves of enemies and having restrictions on what towers, upgrades and heroes may be used. Based on your performance per mode you get awarded stars; these can be used to permanently upgrade towers and summons (Rain of Fire and reinforcements), providing strong bonuses.   Why I recommend this game  This game has a lot to offer both to casual and more veteran gamers, due to the tactical nature of the gameplay.  Although the earlier levels can be beaten with relative ease, the difficulty ramps up quickly and provides the players some really tough challenges, especially during the later stages of the Campaign and the Iron and Heroic modes in general. The varied levels - and therefore ever-changing predetermined locations for your towers - always force you to strategize to achieve maximum effectiveness. As the waves of enemies per level are non-random, meaning wave X always has Y type(s) of enemies in Z amount, knowing what you're up against is extremely helpful, not just for your towers, but also when to cast Rain of Fire and reinforcements. Add to that the twelve heroes who each fight differently and have their own perks and weaknesses when it comes to different types of enemies, and you see why this is rightly called a tactical game.  For me, I also really like the bright colourful artwork and the achievements, frequently referencing games and movies.  If I have to mention a negative, it would be that later levels of the Campaign are quite lengthy due to the number of waves and as it's impossible to save during a level, some players might find it too long.  As it stands though, I highly recommend this game, especially for those fond of Tower Defense games. If you're not sure and would like to try out the game before purchase, there is a free legal version on several gaming websites. You don't get all levels and heroes, but it should provide you with enough to decide whether this would be a worthwhile purchase.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful and cute strategy game with cute heroes and demons and snipers and spiders and tesla towers. Give it a try and I am sure you wil fall in love with it. Buy it support the developer if you have a decent job. Challenging and fun, sometimes easy, keeps you thinking and improving. I defeinetly go after the next Rush series after i finish this one.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite Tower Defense games.",
            "review_score": "1"
        },
        {
            "review_text": "one of the greatess tower defense game out there. just wish we could have more control over heroes and leveling them up in different ways hint hint",
            "review_score": "1"
        },
        {
            "review_text": "Pros- Fun, Cheap, Amazing Art...cutest monsters ever...Long ...Funny... Cons- seems like a few more upgrades would be nice...actual control of hero would be nice...lightning towers too OP? For the first timer...you can change the soldiers rally pt...do so...  After having this for ages (Yeah like you dont have a problem) I finally got bored enough to try it...amazingly fun just enough interaction to keep you occupied...Bear with me...I dont like tower defense but I do like this.",
            "review_score": "1"
        },
        {
            "review_text": "Is good game with lots of improvements over the Flash version.",
            "review_score": "1"
        },
        {
            "review_text": "really fun tower defence game, recomended to all those looking for a good strategy tower defence game :)",
            "review_score": "1"
        },
        {
            "review_text": "If you own this on your Android device, and I assume your iOS device too, it's essentially the same game. It 's a bit more challenging, because you can't buy the powerups with money you earn. There is no money to earn.   The problem I have with this game is that you pay 3x more than the mobile version, and still only get the first game. I was hoping they would have given you the Frontier locations, as well as the new Origins regions.  If you are a die hard Kingdom Rush fan, then you'll like this version. Otherwise, if you own the mobile versions, don't bother.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game I played it when it was on the website. It was fun and the heroes are free now so thats good",
            "review_score": "1"
        },
        {
            "review_text": "Simple but with enough depth and number of levels to keep you entertained for a long time. I really dig the music as well.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this after playing it on  Kongregate , imo one of if not the best tower defence game out there!",
            "review_score": "1"
        },
        {
            "review_text": "The Best Tower Defense Ever  Beautiful artwork, captivating color palette, various challenges, It's the best of the best  Too bad they seem to focus in android and iphone version than the steam one. But still, worth it every penny",
            "review_score": "1"
        },
        {
            "review_text": "finished the game with all 3 stars. hard but it is possible",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun, and has much of the stages from the mobile version. However i think the game is a bit overpriced for what content it currenly holds, they should maybe set up the price a little bit and then add content from the other kingdom rush games, content from frontiers for example. Then id happily buy this game with the other games included.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense i've played in years!",
            "review_score": "1"
        },
        {
            "review_text": "long rounds = more gameplay :D",
            "review_score": "1"
        },
        {
            "review_text": "Great Tower defense game! Lots of character.",
            "review_score": "1"
        },
        {
            "review_text": "Challenges,  10/10   &lt;3 this games.",
            "review_score": "1"
        },
        {
            "review_text": "Most likely best TD I have ever played, not too easy, not impossible, just great fun :)  tip: oni is immune to demon explosion (looking at Pandemonium)",
            "review_score": "1"
        },
        {
            "review_text": "This is a surprisingly fun tower defense. I thought I'd just give it a try and ended up with a marathon. You have heroes and spells that can help you win the tide of battle. Each building has two different upgraded forms with a plethora of extra upgrades to increase damage, or add a special ability. It's not a very long or challenging game, so maybe get this on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play while avoiding responsibilities.",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric Tower Defense game with excellent voiceacting.  Fairly short Somewhat challenging Interesting towers (some slight inbalance in their cost to strength ratio) Very polished  Enjoyed this game but if you have played the flash game, think carefully if you want to spend ~10€ for this game since it is more or less the same(+champions and a few extra maps)  money to time ratio: 0,25€/h",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun, and I can get all heroes ( In mobile version, I must pay to buy legend heroes, but in this game, when I am finishing the campaign, I can unlock all legend heroes, very good and very cheap for $9.99).",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defense games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite stand alone Tower Defence games. The amount of hours spent on this beauty is endless.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best tower defense game that I've ever played, I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "best tower defense game I've played. easy mechanics, decent variety, good challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding tower defense game, haven't completed all challenges yet and have &gt;30 hours of playtime.",
            "review_score": "1"
        },
        {
            "review_text": "I own every Kingdom Rush game on multiple platforms. Best tower defense game ever. Great game at any price, finding it on sale is an extra bonus.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and challenging. It's not very long, about 4-5 hours to complete.",
            "review_score": "1"
        },
        {
            "review_text": "3.8/5  +Simple and Fun +Solid Gameplay  -Lack of Options(Settings) -Shortcut Actions/Keys were poorly done/limited -No Speed Toggle ",
            "review_score": "1"
        },
        {
            "review_text": "Definately worth the sale price of $1.99. All day fun, and only through the first 30% of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let my play hours fool you, i played this game A LOT (and failed 2 exams because of it) on my mobile.  Its one of the best Tower Defense games i ever played.  The level design is clever and has great variety in addition to different difficulties.  Plenty of towers and sub upgrades to play with, good talent tree and special heroes with different powers.  Also the game pace feels right and there are even 'NG+' modes which are very challenging and requires a lot of thought.  All this gives the game great customization, intresting gameplay and most importantly great replayability..  Highly recommended.  P.S.  Don't play this during classes...",
            "review_score": "1"
        },
        {
            "review_text": "Wicked game... try it... if you like tower defense... this is the game.. too bad they don't put their other games on steam as I would buy them. Till then I will wait.",
            "review_score": "1"
        },
        {
            "review_text": "I've played Kingdom Rush years ago via web game that time.  An amazing game , in all aspects, especially for a Tower-Defence Game player. Again I see this in steam and bought it . Heros added. And game seems a bit harder than it used to. I'm tring rush through it , later may add more comments.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun for a few hours of play, nothing special though...",
            "review_score": "1"
        },
        {
            "review_text": "The campain is short. You can finish it in one day. The campain will unlock two more difficulty levels for each map, additional heroes and enemies. I enjoyed more the Defender's Quest: Valley of the Forgotten. But this is a great game too. ",
            "review_score": "1"
        },
        {
            "review_text": "The best Tower defense game I have ever played! Very well done!",
            "review_score": "1"
        },
        {
            "review_text": "I played this on my phone years back and got it now on Steam. What could I say? It is indeed one of the best TD games out there, possibly the best.  I love how you can customise your experience by picking the tower-evolution-line you prefer (i.e. elemental mage or arcane wizard) and tower abilities you find most useful. I usually have a rather high expectation on the extent of unit-variety in strategy games, but the array of towers in Kingdom Rush has overwhelmed me with joy.  After finishing the main story (probably takes around 8 hours for most average players of the genre) there are many more missions that involve the events subsquent to your victory against the forces of evil. Finally, all missions can be played in 2 hard modes (apart from the difficulty setting!) that restrict use of upgrades and prohibits certain tower types.  I praise the developers, it's THE Tower Defence game.",
            "review_score": "1"
        },
        {
            "review_text": "why is this game so hard, even on normal difficulty",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this online on websites and when I found out it had come to steam I was so happy, i instantly fell in love with this game and i've fallen in love again I would recommend this to anyone who loves to play any tower defence games and/or stratagy games it really is a blast to play and tons of re-playability i've completed the whole game and have started to make my own mini challenges which is making the game even more fun. well im off to play some more kingdom rush cya :)",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, fun references, a lot of enemies. A bit difficult but once you get all the stars, it gets easier. Yipikay mother f***** !",
            "review_score": "1"
        },
        {
            "review_text": "best tower defense game so far",
            "review_score": "1"
        },
        {
            "review_text": "Glory to the king! Glory to Ukraine! Glory to the heroes!",
            "review_score": "1"
        },
        {
            "review_text": "The best TD ever made!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Tower Defence games I've ever played 9/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defense games of the more 'traditional' type. Cute and simple graphics. Endless ways to tackle the same level. And best of all, it basically runs on a potato (so gamers with old systems can rejoice!)",
            "review_score": "1"
        },
        {
            "review_text": "ive been playing kingdom rush since it came out onarmour games. good times. then on mobile. now on steam  I love tower defense games, and i love this one, this is probably one of my favourite td, ever.  i love all the enemy types and strategys on where to put the towers.  the game does get quite hard, but its rewarding. ish  only down side is that once youve done all the quest. thats it. nothing else to do.  highly recommend this game if you like the TD genre",
            "review_score": "1"
        },
        {
            "review_text": "  I keep getting to bed late becasue of this game lol",
            "review_score": "1"
        },
        {
            "review_text": "  Bought this for a dollar, should've paid full price instead.",
            "review_score": "1"
        },
        {
            "review_text": "Normally not my category of games, but this tower defense game makes a lot fun. Four different tower types with various numbers of upgrades make this game beeing very diversified. There are additionally heroes which you can pick ingame and level them to increase their strength.  A total recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly great tower defense game!  I was bored, browsing my library looking for something new and casual to play, tried this one, and bam, 9 hours  straight ! It's not overly complex, you get all aspects rather quickly and can play it casually, and enough deepness not to feel too simple. A perfect balance in my opinion!  You get 4 types of basic towers: weak and fast ranged Archer; invasion troops deterrent soldier Barracks; focused strong slow Mage; slow Area-of-Effect damage Siege. Each one can upgrade and then specialize into 2 different types in later levels, with 2-3 upgradeable abilities each. You also have 2 free-to-use abilities to use during the game, with different cooldowns: short-term temporary Reinforcement troops and long-term AoE Rain of Fire bombing. You get stars for how well you complete each level, and use these stars to purchase additional bonuses for the towers and the abilities . Main campaign is very fun with 12 levels and a few unique bosses, and it unlocks 10+ levels afterwards. And each level has 2 additional 'challenge' modes to complete and earn more stars. You also get Heroes with unique abilities that levels ups!  All in all, a great gem, lots of fun, and I truly recommend it!",
            "review_score": "1"
        }
    ]
}