{
    "app_id": 246620,
    "name": "Plague Inc: Evolved",
    "release_date": "2016-02-18",
    "developer": [
        "Ndemic Creations"
    ],
    "publisher": [
        "Ndemic Creations"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Online Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Indie"
    ],
    "achievements": 199,
    "positive_ratings": 20081,
    "negative_ratings": 1419,
    "price": 11.99,
    "description": "Plague Inc: Evolved is a unique mix of high strategy and terrifyingly realistic simulation. Your pathogen has just infected 'Patient Zero' - now you must bring about the end of human history by evolving a deadly, global Plague whilst adapting against everything humanity can do to defend itself.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/246620/header.jpg?t=1552342752",
    "minimum_requirements": "OS: Windows 8 Processor: 2.0 GHz Dual Core Processor Memory: 1 GB RAM Graphics: Integrated Graphics (512MB) Storage: 500 MB available space Additional Notes: Unsupported video chipsets: Intel HD Graphics 3000, Intel GMA X3100, Intel GMA 950",
    "recommended_requirements": "OS: Windows 10 Processor: 3.0GHz i5 Dual Core or equivalent Memory: 2 GB RAM Graphics: Nvidia GeForce GTX 650 Radeon HD 3600 (1GB) Storage: 1 GB available space Additional Notes: Unsupported video chipsets: Intel HD Graphics 3000, Intel GMA X3100, Intel GMA 950",
    "reviews": [
        {
            "review_text": "Sign my petition to remove greenland",
            "review_score": "1"
        },
        {
            "review_text": "Not even deadly viruses want to go to Greenland.",
            "review_score": "1"
        },
        {
            "review_text": "After you played this game, you will hate Greenland...",
            "review_score": "1"
        },
        {
            "review_text": "Edited November 2016 - They added vampires! \\^-^/  Pros: +Entertaining +Addictive +You kill humanity +Neurax is our Lord and Savior! +Zombies +Apes +Vampires (because f*ck Twilight) +Multiplayer +Steam workshop +Getting harder with every new type of disease +Multiple scenarios and alternatives  Cons: -Greenland -Canada -Greenland -New Zeland -Iceland -Mentioned Greenland?  Greenland/10 Would Greenland again",
            "review_score": "1"
        },
        {
            "review_text": "You know... this is a really fun game. Though the enjoyment you take may be a bit... questionable, I think? I mean, you eradicate humanity with a disease. Trying to imagine how people would suffer from your creation would make you sick. Thankfully, all you see is world map and few other windows.  The difficulty the game provides is very flexible. Either go for a smooth killing spree or struggle with cure progress. This game also features A LOT of upgrades for each disease (there are quite many of them which you can unlock).  Come to think about it, it's a strategy game. You start somewhere and expand until you take over the world. Or in that case, kill everyone (though it's not always necessary).  There is also a multiplayer mode. Both versus and co-op are fun to play and can give you quite a challenge.  I'm not really sure what else I should write about this game. Maybe workshop support? Millions of custom scenarios and an editor to make your own? Yeah, I guess I should mention that either. Oh wait, I just did. Anyway, that's all I can say.  If you are into strategy games (or even if you aren't) and don't mind infecting the world, then go ahead and try it.",
            "review_score": "1"
        },
        {
            "review_text": "Saudia Arabia is key to destroying humanity.",
            "review_score": "1"
        },
        {
            "review_text": "I made a Virus called 'Hillary Clinton' and killed the whole world. 9 / 11",
            "review_score": "1"
        },
        {
            "review_text": "It's the kind of game that when someone walks in on you, you switch to porn becuase it's easier to explain.   10/10 would get mistaken for a terrorist again.  That's... boy, I wish that was just a joke.  That being said, this game requries a lot more strategy than you think. When you first start out, you probably think stealth is the best way to go, until you hit Brutal and your only option is to go hard or get cured. Pretty much every plague type has a mechanic that requires tweaking your strategy, to the point where if you play blind, you have to play several games just to understand what kind of angle you need.  If you're coming from the mobile version, as I did, I would definitely recommend this version. It's not a direct port, more of an upgrade that breathes a little life into a game all about murdering everyone on the planet. Now, I haven't played it as extensively as the mobile version (I bought it on release to support the dev and never played it until recently WHOOPS), but just playing a few co-op rounds with a friend has definitely made this worth it, and the added Workshop functionality means more screaming for everyone. And, IIRC, all updates are free.  A late update: the Shadow Plague is nice, but a little easy once you figure out how it works. Still, the new achievements (even the non-Shadow Plague ones) are relatively fun to get, so not a bad addition at all.    Pros:   Great bubblewrap simulator.   Beating Mega Brutal with bacteria and almost no genes feels really nice, okay.   It makes you feel really smart with all these big fancy words wow look at them all.   Easy to alt-tab out of, for all your alt-tabbing needs. Probably to look at a guide and cry. No judging here, man. That Necroa virus sure is  killer . (Yes, you can hang me now. I've made enough bad jokes.)   The news reel and random events are kind of great. The game has just the right amount of humour for being a game about pathogens.   It just has such a nice draw to it. Makes you feel like a mad scientist kicking back and watching the world burn. (Sometimes literally. What is with these nukes, mate.) A+ ego boost.   Cons:   Greenland.   I'm probably on a watchlist now somewhere, tbh.   Being able to infect everyone after you get noticed didn't really feel right until I remembered standard precautions even in 'rich' countries is actually really poor because no one follows them as rigorously as they should. Not really a con about the game, just a little bit of an unsettling revelation.    Greenland .   Sometimes when you make a mistake, but still obviously going to win (ie, no cure prgoress being made), it takes forever for the game to finish. I've only really noticed this with the Necroa virus because of the zombie mechanic (I'm a scrub I know I know), so it isn't something that happens often, but it's my only real complaint.   I personally just strongly dislike the Necroa virus, which only grows the more I play with it. It's very gimmicky, cured easily (I assume to encourage your inner necromancer.), and just generally the least fun of all of them, even when zombies do start. Since it's part of the mandatory progression line-up, this becomes even more noticeable. I'm not sure what could be done to balance it, though my general frustration suggests buffing the lethality of the few non-zombie symptoms it has.    Maybe it's just because I'm playing on a glorified toaster, but the Steam overlay keeps glitching out and closing on me. I'm going to do some testing on this one as soon as I can. This isn't a game breaker, though.  This is my toaster. Stupid toaster. Can't even toast toast.     Greenland  .   So go get it. Be the change you want to see in the world. And for the love of God, evolve water transmission and cold resistance.",
            "review_score": "1"
        },
        {
            "review_text": "Make your own plague and destroy the entire world.It's absolutely beautiful.What more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "It's better than the Mobile version. Endless fun, new modes, new diseases, new fun (workshop), make your own share fun (workshop).  Not a direct port unlike every other mobile app to PC.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly in-depth and very accurate from an epidemiologic standpoint. Really easy to sink hours into even before you do the specific scenarios. Great for a pick-up session or in-depth trials.  10/10 from a Micro major",
            "review_score": "1"
        },
        {
            "review_text": "For all the people who didnt got the early access version, or only played flash versions like 5 years ago, i highly recommend to buy this one, finnaly released version. This game is awesome, it has tempting atmosphere, very interesting + great replayability, interesting stories and it can fit all the variety of gamers because easy difficulties easy enough for casual gamers to win, and master difficulties can be super frustrating even if you are pretty skilled. 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Hatred of Greenland aside...  This is a wonderdful game for mobile devices, however bringing it over to PC has not added anything mention worhty. It's the same game. Buy the mobile version - it's cheaper and more user friendly.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me preface this by saying that I am not good at this game.  I mean, I get the way the game works, and I'm not hopeless, but as of this writing, I've put in nearly 100 hours and still haven't unlocked cheats. And while that is largely due to the fact that I don't want to try Bioweapon again, it is also illustrative of why I recommend this game so highly. You don't have to be good at Plague Inc. to play it and have fun with it.  At its core, Plague Inc. is a casual game. You pop bubbles with your finger or mouse, tap or click to choose how your disease progresses, and that's it. However, where this game differs from most casual games is that the developers have created layers of strategy and complexity over that basic framework, layers that individual players can freely embrace or ignore as they see fit. If you don't particularly care about factors like how many uninfected countries have dry climates as opposed to wet climates or how to best target the countries that are advancing cure research, then you can simply ignore them, play on casual, and evolve whatever you feel like. However, if you are looking for more challenge and depth than the average casual gamer, then you can crank up the difficulty to normal. brutal, or even mega-brutal, and carefully plot out which combinations of symptoms, transmission vectors, and other abilities will lead you to victory.  In short, Plague Inc. has something for everyone, from the most casual of casual players ro the hardest of hardcore gamers, and I highly recommend it.  Now, if you'll excuse me, I'm going to go swear and flail uselessly at the new Shadow Plague disease type some more.",
            "review_score": "1"
        },
        {
            "review_text": "I fell in love with this game within seconds. It's challenging and addictive.  Anyone who is into science and/or strategy must give it a try; it's totally worth it!",
            "review_score": "1"
        },
        {
            "review_text": "This game's fun, but can feel a little stale at times. Luckily the scenarios add some much needed challenge and variety, otherwise you're just suppressing symptoms and waiting for Greenland to get infected. :P",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Very fun but somewhat limited replayability  The co op and versus modes fix that to a certain degree, because your opponent's strategy significantly affects your experience of the game. It also helps that it takes a while to unlock all of the different types of plagues. The news headlines are amusing. I like to read those while I'm waiting to get more DNA points. Oh yeah, sometimes it can take multiple minutes to save up points, especially early-game when you haven't infected very many people yet. Also, as a pedantic person it bothers me that you can become 'antibiotic-resistant' as a virus. The game obviously isn't supposed to be scientifically sound, considering it contains zombie viruses, so I'll let that one slide.  ...I always feel slightly guilty when I win a game, too.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun you can legally have killing everyone     F*ck you, Greenland.   ",
            "review_score": "1"
        },
        {
            "review_text": "It is pretty good at first, but it does get boring after a while.  Pray 4 updates.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, will infect world! Absolutely extraordinary game worth every payment made on it :D",
            "review_score": "1"
        },
        {
            "review_text": "started as a flu... 2 days later I was supreme overlord of the world... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I Remember Playing This Game On My IPhone, And It's Even Better On Steam. But This Game If You Want A Little Mini Game To Play In Your Freetime &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "start plague   infect all the world except one country dont notice it make plague lethal 'greenland has shut its borders'",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun. not a whole lot different from the mobile game.",
            "review_score": "1"
        },
        {
            "review_text": "Three Words:  â™¥â™¥â™¥â™¥ you Angola.. You crisis bench warmer piece of â™¥â™¥â™¥â™¥. Closing off your borders when the rest of the world is dead. I got your number..... -_-",
            "review_score": "1"
        },
        {
            "review_text": "One of, if not the, best game to ever exist. Why i have this opinion is because this game has a compelling single player and the multiplayer mode lets me have friends with benefits 'wink' :]",
            "review_score": "1"
        },
        {
            "review_text": "play it. destroy humanity. live out your wildest dreams! the scenarios are pretty cool, the gameplay can be fast paced, but you can also keep it chill if you want a more casual experience - and, lets be real, who hasnt spent their entire childhood dreaming of bringing about the end of humanity through a disease you have personally concocted?  10/10, would end humanity's existence again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good outlet for the days I want to kill evrybody for real",
            "review_score": "1"
        },
        {
            "review_text": "So much fun on my phone I had to get it on pc as well!",
            "review_score": "1"
        },
        {
            "review_text": "I've played Plague since early access, and the devs are without doubt some of the best in the industry. Intuitively, you'd think there are only so many times you can destroy the world with your pathogen of choice in a 10-30 minute rampage, but you'd be wrong just like I was.   When I first got the game, there were the standard pathogens to choose from - Bacteria, Virus, Prion - and I'd proceed to destroy the world (Greenland notwithstanding) for 15 minutes at a time in single-player. I played for maybe 4 hours in 15 minute bursts, but soon grew bored.   A year on my GF bugged me into installing it on my old laptop so she could play it.   I looked over her shoulder and saw she was entrenched in a multiplayer battle, her disease fighting to destroy the world before her competitor's, actively seeking to spend her precious little DNA to sabotage her nemesis' pathogen and strengthen her own. I swiftly took the laptop from her and played for the next 4 hours straight.   In my absence, there was now a fully-fledged multiplayer mode - versus or co-op. There were new diseases - Neurax Worm, Simian Flu, Vampires. There were scenarios that forced you into abandoning your tried-and-trusted strategies and finding new ways to kill everyone.  I later found out that many of these changes had come long after the early access period was in the rear-view mirror, which brings me back to my original point - the devs are great.   After its full release, the devs could have moved on, taken on new projects, made more money, but instead they stayed to ensure Plague became a 40-hour game, not a 4-hour game. The reason you'll see reviews that state the PC version's supremacy over the iOS game is because the iOS version is pretty much the Early Access version, comparable to the one I first alluded to - fun for a while, easy to pick-up-and-play, but not the game you sink hours into - whereas the devs continue to work on Plague (Steam version), adding new content and improving gameplay to this day.   This is the only game I've ever bought twice - I bought my GF it so we could play together. I don't recommend doing the same, or if you do avoid Versus mode, because it caused several considerable arguments when one of us did something underhanded to expediate our annihilation of the free world at the others expense. Stick to Co-op.  This game has my highest recommendation. I believe it is one of the most content-rich games available (considering its price) and, given a reasonable chance, could be enjoyed by nearly anyone with a Steam account.",
            "review_score": "1"
        },
        {
            "review_text": "A cure for boredom (or a break from Biology). Strategy and sometimes sheer luck is needed, but I highly recommend this for sadistic people or those interested in science. Multiplayer can also be a challenge for you and your 'friends'... yet the rewards are worth it. (The price, not so much)",
            "review_score": "1"
        },
        {
            "review_text": "play it. destroy humanity. live out your wildest dreams! the scenarios are pretty cool, the gameplay can be fast paced, but you can also keep it chill if you want a more casual experience - and, lets be real, who hasnt spent their entire childhood dreaming of bringing about the end of humanity through a disease you have personally concocted?  10/10, would end humanity's existence again.",
            "review_score": "1"
        },
        {
            "review_text": "Really love this game! Think co-op can do better by matching you with equals but really love the co-op too. Every game is different and every starting point is too. I have a gene that chooses my starting country for me when I play co-op, which makes every game a suprise and not just the same strategy over and over again. I would recommend this game to others because it really is a great game and you can also play it when you have like 20 minutes left before you have to leave or something. I like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is addictive. I have lost so much sleep playing this......",
            "review_score": "1"
        },
        {
            "review_text": "The outbreak of putin started from russia!",
            "review_score": "1"
        },
        {
            "review_text": "OH MY CTHULU!!This game it's just AWSOME!!",
            "review_score": "1"
        },
        {
            "review_text": "We have multiplayer! My previous rating I suggested will go through.   11/10, excellent â™¥â™¥â™¥â™¥ing game. You gotta support Ndemic, they're doing an amazing job!",
            "review_score": "1"
        },
        {
            "review_text": "Want to kill the population? Do it!",
            "review_score": "1"
        },
        {
            "review_text": "My pen happens to be filled with plague inc......",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun game but its not a game you can play for hours at a time, its a nice little challenge but not worth full price get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to lose buckets of time evolving and chasing secondary objectives and challenges, Plague Inc. Evolved is very unique in that it also teaches you epidemology at the same time, putting you in the driver's seat of a world-threatening pathogen in its quest to spread over and extinguish the breadth of human existence. You can start as contagious but cautiously benign, and then upgrade to a killing level when you have the world under your thumb, or you can come out like gangbusters with immediate killing potential and race against time to wipe out the planet.  With constant updates, an incredible mod community, and limitless potential for fun, you'll find yourself stuck playing it again and again just to see how far you can go this time. Whether you enjoy the game for the achievements or you just want some fun way to spend ten minutes, this game is the tops.",
            "review_score": "1"
        },
        {
            "review_text": "I accidentally discovered that my favourite game on Android is now available for PC in steam with all the features that were locked on mobile version :D   Amazing game that allows you to feel like an evil genius that desires death for an entire human race!  #iwillmovetogreenland  10 of 10!",
            "review_score": "1"
        },
        {
            "review_text": "Basically you dominate the entirety of the human race on a cellular level. How can it get any better than that?",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, for a low price, working on any computer and OS (Linux too, thanks dev).  You will have to manage the propagation of a virus or a bacterium, trying to infect and kill all mankind, but governement will take mesures to prevent the propagation and will try to find a cure. That's time pursuit, to be faster than cure research.  Pros : very addictive at firsts games. Fast and easy play. Good graphics. Full stats per countries. Lots of scenarios (including Rise of Ape and Vampires). True symptoms names and behaviors. Dynamic propagation (birds, ships, planes..., depending of your strategy). Cool game.   Cons : after 10 or 20 games, you will find it a bit repetitive, as it's quite a small game. You unlock some bonus, but game remain the same, then you can play in multi-players. Some end game failure with harbors locks are not really realist, and it make then impossible to win. Should be better with deeper biological parameters and choice, there's not so much choices, so it's quite easy, but you can try harder difficulty. Well, for a low price, it's a good game (8 or 9 bucks), more it will be too expensive.",
            "review_score": "1"
        },
        {
            "review_text": "one of my faveourite games would recomend",
            "review_score": "1"
        },
        {
            "review_text": "Take a moment and imagine that you aren't a Homo saipen. Imagine the damage that their species has caused, the mountains of waste that they produce, the species that they drove to extinction, the species that are reduced below food, stripped of their pride and turned into their playthings. Without a doubt, on this planet, they consider themselves to be the ultimate predator, deluding themselves into thinking that they were made in the image of 'God'. They do not understand that they're nothing but parasites violating both themselves and the world that they were born in. There is but one solution. With extreme prejudice and misanthropy, it is your task to design a 'cure' to wipe this filth off of the face of this planet.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I have had with a game in a long time. I recommend not just single player, but also the little special events. I had so much fun with the Planet of the Apes virus, haha   Best $8 I ever spent on a Steam sale for a random game I had never heard of really.  9/10, -1 simply because with more added features, like being able to have my apes rampage in that special scenario to destroy humanity instead of the virus, with just a few flame effects or something, would have made my day.",
            "review_score": "1"
        },
        {
            "review_text": "I think I need mental help  It is so satisfying to kill off the human race......",
            "review_score": "1"
        },
        {
            "review_text": " Long story short; it's fun to name your disease after something weird. I.E 'Miley Cyrus.'",
            "review_score": "1"
        },
        {
            "review_text": "simple yet addtictve killing of humanity asa virus or a zombie plague its allways fun",
            "review_score": "1"
        },
        {
            "review_text": "Fell in love with it as a mobile game, still in love with it on the PC.",
            "review_score": "1"
        },
        {
            "review_text": "  I originally played Plague Inc. on mobile (sadly had to remove it for space), and I LOVED it. I recieved the PC version as a gift, and I must say I like it a lot more! :D   This game has a simple goal each time you play: Take over and destory the world! How will you complete such a task? Your choice of any plague type this game has to offer! It's a lot of fun to create different strategies and figure out the unique puzzles to each disease, and it's incredibly satisfying to watch the spread of your deadly illness.   I highly recommend this game to anyone who enjoys strategy games, a game with a simple concept and goal, or anyone who just wants to watch the world burn. :)",
            "review_score": "1"
        },
        {
            "review_text": "I Recommend this  game..why?   1. Strategy,use ur brain to win this. 2. You can learn Disease Type, Tbh, I learn the disease from this game 3. Help ur Geography Lesson (for knowing country and their environment) If it cant,make motivation for you to study Geo 4. Help ur Biology lesson (Especially for Disease Subject) if it cant,make motivation for you to study bio 5. There's a Imagination disease,they arent exits. but its fun to know and play 6. there's 7+ billion people.  For my experience. 1.I love this game. Im misanthrope(Hate Human). so i love to kill 7+ billion people with my disease i have made. 2.Yeah, i know few real disease and play some imagination disease.its fun,...really. 3.My Favorite disease is Neurax Worm. i want have that creature, and slave the human race. Fun to play 4. 2nd is virus. for me, Virus is the easiest disease. 5. i hate greenland. u know why? play this game and u will feel it. 6. Zombie,Simian and the Hot New Vampire Diseases. Hard for me. but its fun.  10/10   (Sorry for bad english)",
            "review_score": "1"
        },
        {
            "review_text": "A very simple game, yet creative and interesting. You need to control a disease and make mutations to your own DNA so that you may infect most of the world being undiscovered, then try to eliminate all menkind. Funny and entertaining, for what it is worth. I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Got South Africa to nuke Japan.Again.  11/10 would nuke weebs again.",
            "review_score": "1"
        },
        {
            "review_text": "There are few things more satisfying than infecting the American population with a disease called 'Democracy,' then guiding its evolution as it spreads across the globe. I was all swole up with patriotism as I watched the American ideology invading every nation on Earth one at a time, blessing the indigenous with the Democratic way and insominous American dream, and killing them all in the process. Just like in real life. And then on one fine evening, a tear was nearly brought to my eye when writ on my screen was 'Victory. Democracy has successfully eliminated all life on Earth.' Finally, the commies and the terrorists were gone. There was only freedom now.  In all seriousness, Plague Inc is an interesting game. It's challenging, more complex than you might imagine, and allows for many choices as you choose the next mutation of your disease, customizing it to the situation at hand in order to, hopefully, exterminate all life on Earth. Before a cure can be developed of course, and before you accidentally cripple your progress, such as through making the disease too lethal, killing the infected before they have a chance to infect the rest of the world.   To be completely honest though, I disagree that Plague Inc is worth fifteen dollars. X-COM: Enemy Unknown is thirty dollars, which would imply that Planue Inc thinks itself at least half as good as X-COM. It's not. Command and Conquer Generals Deluxe Edition cost $20 at launch. Plague Inc is certainly not almost as good as CnC:Generals either. It's an interesting game, I like it, but it's not worth fifteen dollars. I'd say a reasonable price for this game is five dollars or less, not fifteen. I recommend Plague Inc, but not at the current price. Wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun to play solo or with a friend, for a few hours. It very much reminds me of those free phone games you get and play when you're bored, which is what it should be. 16 dollars for such a shallow game with a very short concept just isn't worth it. For what it is, its a very polished and well made game, but it should be 5 dollars or less.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're having a bad day and people are grinding your gears....what better way to get back at the whole of humanity than creating, naming and nurturing your very own plague!  Feel the pow-ah! Watch the world turn red as people kiss themselves into a hell that you have created. Unleash your inner psychopath and fine tune your plague to ensure there are no survivors and the world fades to black.  10/10 will kill humanity again.",
            "review_score": "1"
        },
        {
            "review_text": "A game/simulation where you can kill the entire humankind with a virus which name can be as stupid as you want it to be. 100% recommended of course.",
            "review_score": "1"
        },
        {
            "review_text": "i name all my plagues things like 'cultural Marxism', 'globalism' and 'mainstream media' then proceed to genocide humanity via deadly pathogens when i do this in multiplayer it triggers millennials who then trounce me for some reason 8/10 would trigger millennials for the sake of not being a shill again #MAGA",
            "review_score": "1"
        },
        {
            "review_text": "Plague Inc. is a very fun simulation game in which user decisions shape how humanity ends. The best part of Plague Inc. is that the user can name their disease anything they want and upgrade it to kill humanity before they complete the cure. Something about having Bananas infect thousands and kill more than the black death brings fun and humour into the game. So here are the things to look forward to while playing this game:  - Difficulty levels are very accurate and include Casual, Normal, Brutal, and Mega Brutal - Each plague has special abilities/characteristics which add variety - Genes are unlocked after winning, allowing you to customize your disease for the next game - Start your plague wherever you want and upgrade transmission/symptoms/abilities to your style of play. This leads to having no set way of winning / lots of variety - Straightforward game, but randomly upgrading will NOT win you the game, therefore requiring some skill - You can unlock cheats making the game pretty funny - Many game modes - Very few glitches (sometimes manually saving game freezes) - FAST FORWARD X2 AND X3!!!!!! My favourite feature :) - After the game you can check your disease stats/cure stats and see a replay of your game  Cons - You will hate Greenland after this game. Every time you look at a map of the world you will look at Greenland and naturally become enraged. This is only normal. -Also the games take what seems like a long time so don't expect a quick run.  Overall I give it a 8/10 as this game provides endless hours of fun, thinking, and stress relief. Great game and I strongly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "There's just something so satisfying about meticulously building a harmless little pathogen into a multiple-organ-destroying-mega-death-monster and wiping out the entire planet. Except Greenland, of course. â™¥â™¥â™¥â™¥ Greenland.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for a while but lacks depth in gameplay. Replayability factor is low (after destroying humanity several times, the urge to launch the game is practically non-existent for me). Had a few interesting games but can't get enthusiastic about playing again. Get it on sale or perhaps don't get it at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game for mobile but wont recommend for PC",
            "review_score": "-1"
        },
        {
            "review_text": " PLAGUE INC: EVOLVED",
            "review_score": "1"
        },
        {
            "review_text": "Over-pricing is the biggest issue; the content to cost ratio - considering they get lots of money from the mobile app - is drastically out of balance. It gets highly repetative and after not very long, highly boring.  I guess, if nothing else, it's a very aquired taste.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're an evil mastermind that plans to destroy the whole world one day, this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game but can get bland at times.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun Mobile game",
            "review_score": "1"
        },
        {
            "review_text": "Started virus in Greenland, now I hate Madagascar.",
            "review_score": "1"
        },
        {
            "review_text": "you've killed us all jonas my teacher said after winning one game  you've killed us all.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "amazing game also greenland can go die 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you hate Greenland :)",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game and its amazing if u can play online or with friends",
            "review_score": "1"
        },
        {
            "review_text": "Nice Puzzle Based Game.  Recommend for smart people, and people who want a challenge. If you are stupid don't bother this game requires an IQ of 120 so get smart before buying it.  But other than that Lovely graphics, nice game concept.",
            "review_score": "1"
        },
        {
            "review_text": "you've killed us all jonas my teacher said after winning one game  you've killed us all.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has a good concept, but I don't think it's worth $14.99. I even bought it for $8.99 and it still wasn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 Would totally wipe out the entire world population from the face of the earth again.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "I would not recommend this game. The concept is intriguing and the game sounds like it would be a lot of fun be the truth is that it's very simplistic. Basically all you need to do is repeat the same steps over and over and climb higher up the disease tree to unlock new forms of disease and mutations (from bacteria to virus and so on). If it was cheaper then I could perhaps recommend it but as it has pretty much no replayability value and considering the price it's definitely a 'no' from me.",
            "review_score": "-1"
        },
        {
            "review_text": "Love it. Simple and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "really fun game execpt for one little thing that kinda bugs me If the whole world is infected with your plague, and you have symptoms like blindness, halucinations and many worse how the hell is the cure progress moving they should all be crazy",
            "review_score": "1"
        },
        {
            "review_text": "Great game, worth the money. the only issue is that it doesn't update on it's own",
            "review_score": "1"
        },
        {
            "review_text": "I've wanted this game for a while, since several Youtubers I watch play it. I bought it on sale and it is NOT worth the price. Even on casual, the difficulty is too hard. I'm using the same tactics as the gaming channels and still can't beat it. The game is frustrating and disappointing, not the experience I was expecting. Currently awaiting a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Love the game. Had it on mobile for a long time, and thought 'why not upgrade to PC?' ... Now I can't even open it. I tried opening under admin, opening from desktop, from steam, from its source folder... nothing. It just will not get past opening. Steam even shows it tries to start up, and friends show me logging into it, but then.. nothing. Anyone else running into this problem on Windows 10?",
            "review_score": "1"
        },
        {
            "review_text": "It's like Command&amp;Conquer, but more like Infect&amp;Infect some more. So, really, nothing like C&amp;C, or D&amp;D, for that matter",
            "review_score": "1"
        },
        {
            "review_text": "'Prion, slow, subtle and hard to cure' Cured faster than any other type ive played so far. 10/10 should have stayed a flash game.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a cool and school bench game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game,to me, it's like a more in-depth version of the popular pandemic flash game series. If you love the Pandemic flash games, then you're gonna love this game. Killing humanity off is surprisingly fun! At least Madagascar is not a near impossible country to infect like it was in Pandemic 2.",
            "review_score": "1"
        },
        {
            "review_text": "Its a cool and school bench game. :)",
            "review_score": "1"
        },
        {
            "review_text": "A nice break away from traditional games. It's a puzzle game in disguise. Create and name your own plagues set out to destroy mankind. Entertaining for quite some time but I did find myself burnt out after a few weeks. It's always something to come back to for a break away from those FPS games...",
            "review_score": "1"
        },
        {
            "review_text": "Plague is bae",
            "review_score": "1"
        },
        {
            "review_text": "Good fun, killing humanity is enjoyable. We deserve to die. Don't worry, our end is planned !",
            "review_score": "1"
        },
        {
            "review_text": "Take my warning and do not play, it is entertaining at first but the game gets hard and stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "  It's fun.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to kill all humans on earth ?  If not it's still very funny to do that :DDDD",
            "review_score": "1"
        },
        {
            "review_text": "Rubish unless you know Russian, at least the mobile version is English",
            "review_score": "-1"
        },
        {
            "review_text": "I want my money back! Multiplayer is a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "Mostly play on mobile.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is so Cool! and I Love the soundtrack and the Theme song for this Game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome and I reccomend getting it . Pros Fun Time Consuming Awesome  Cons Greenland Repetitive",
            "review_score": "1"
        },
        {
            "review_text": "You will love India and Chian. You will hate Greenland truely hate it really hate it really really hate it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would kill entire world again",
            "review_score": "1"
        },
        {
            "review_text": "dont download it,its fun a first then your gonna get board of it",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but has in game ads for Planet of the Apes.",
            "review_score": "-1"
        },
        {
            "review_text": "Created a Simean Flu named 'Harambe' Start in US 'Harambe is making apes more intelligent' (2 ingame years later) 'Apes infected with Harambe have learned to wield guns against humans'  DixOut/Harambe - Would avenge again. ",
            "review_score": "1"
        },
        {
            "review_text": "I destroyed the world with Hentai, 10/10 would die from Hentai again. Actually no, nevermind.",
            "review_score": "1"
        },
        {
            "review_text": "Created a virus called Left testicle. it mutated to an ape  it then infected 99.999999999999% of the worlds population Scandinaver finds a curer. Game over Left Testicle has been cured  would let .01% of the world not lick my ball bag :D",
            "review_score": "1"
        },
        {
            "review_text": "its just the mobile game prettied up to make you waste your money on it. what a rip off.",
            "review_score": "-1"
        },
        {
            "review_text": "Ooh bubble-clicking and watching.  At least it is being updated. Still though.",
            "review_score": "-1"
        },
        {
            "review_text": "this is about the online   this online game mode sucks   you cant find anyone  dont by",
            "review_score": "-1"
        },
        {
            "review_text": "no way near enough diseases as there should/could be.",
            "review_score": "-1"
        },
        {
            "review_text": "one of the best games i have played it's very complex especially in the scenerio creator and the multiplayer is just brilliant",
            "review_score": "1"
        },
        {
            "review_text": "ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘ğŸ‘",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great way to kill some time, pun intended. Thinking of various ways to wipe out every last human being in this game is both sinister and rewarding. I have this game on my phone and now pc. I have no regrets.",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun game. A bit dependent on knowing some stuff from the mobile game but still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Played the mobile app for many years, and found it on Steam. I haven't played it very much on Steam, but the game is wonderful and I would recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting just don't play it everyday. I like the game but it gets kind of boring if you play and unlock all genes and pathogens in one gameplay so just take some time off between gameplay so you won't get bored. other than that I recommend this game if you want to test your strategic skills",
            "review_score": "1"
        },
        {
            "review_text": "it's about time",
            "review_score": "1"
        },
        {
            "review_text": "This game made me grow a inhuman hate for Greenland",
            "review_score": "1"
        },
        {
            "review_text": "a game that lets you play god and a virus and try to destoye the world ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Engaging gameplay, fun visuals and solid soundtrack. The premise is pretty fun and it becomes pretty challenging. It's worth it. It's fun. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game, worth every penny.  Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. That's it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really addicting strategy game. I wasn't too impressed at first, but that quickly changed. Knowledge of countries and geography helps, strategy is different for every pathogen. My daughter likes the game too and is learning new words. She has a new interest in microbiology.  Greenland is very difficult to infect. Ironically, my bacterial infection wiped out humanity on the game I started in Greenland.  Great strategy game!",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to become a virus and spread awfulness all over the world killing everyone in your path?? Well, here you get to have the chance to do exactly that. Here's the challenge though... Step 1 - You need to infect everybody in the entire world. Step 2 - You need to evolve your DNA as a virus to slow down research for a cure. Step 3 - Kill absolutely everybody not leaving anyone or a spec of dust alive. Sure no problem, easy! ....Ehhh that is what I thought! This game involves strategy and thinking!  Where in the world should the virus begin? Should we be aggressive and become known to the world and researchers sooner? Should we not be as aggressive at first and then pound everyone to the ground later? How can we get the virus to different parts of the world?   This is a very very fun game. The concept is simple but trying to become a scary killing virus that takes over the world in the modern age is most definitely challenging. Not to mention Greenland is just annoying and it's difficult to get the virus there! Just thought I should point that out! :D  Definitely try it and I am pretty sure you'll enjoy it! Because who doesn't want to take over the world??? ;-)",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes, when I get frustrated, I just start up this game, then I sit down, relax, and eradicate all of humanity via slow and painful deaths. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: This game is now worth it. Maybe not full-price worth it, but it's quite enjoyable and the multiplayer is challenging. UI and graphics have been fixed and game looks excellent now.  Old Review: Fun, but for free you can just go play Pandemic 2. Better UI and practically the same game. Good luck getting Madagascar though.",
            "review_score": "1"
        },
        {
            "review_text": "'An African Child enslaves humanity The whole world worships An African Child as their god and master.'  10/10 Would make an african child enslave humanity again.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game deserves a lot of credit - it's currently my most-played game, other than Terraria.  A few improvements and things I suggest you add:  1) A few new viruses:  a) Vector Virus  This is a virus that can change the DNA and RNA of people. Added scenarios, more options, and a world population counter that changes using a simulated world population chart that rises and falls to current events.   b) 'Cure'  The cure option is available to those who have mastered more than 25 custom scenarios. This will get them the option of a 'cure setting' on the plauge singleplayer menu, after the Vector Virus. They can then choose which virus type to cure, and then a randomizer will select an online scenario. You will play as the cure, and will have different traits and options of extra genes than you normally get. If you win on every cure mode, from bacteria to vector virus, you'll get another achievement, called 'Cure Complete,' and that will also unlock a multiplayer cure mode. In the end it will all pay off.   2) Some new features!  a) Gene Splicing  You can decide wether or not to combine diseases. You'll get two rows of traits now, and the option of double genes. That would be fun for someone who has unlocked all of the plauges.   b) New Custom Protest Effect  Protests for the disease can now occur randomly, forcing cure to speed up for some time, or start the cure. This only happens if the world has noticed this disease and is very severe and/or lethal.   That's all I've got. That would be sooo cool if you added those.    CUBELOVD RATING SYSTEM:   Disgustingly bad | Horrible | Bad | Could be better | Meh | Kinda good | Good | Great |   Incredible   | Amazing | Timeless",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I've spent more than 1 hour trying to kill every single person in the world but Madagascar is the best God damned place in this world! In case of global pandemia you should immidiately immigrate to the Madagascer. Or Greenland.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game that offers multipel and fun mechanics, to turning the world into zombies to enslaving humanity. All the disease types are fun and have unique mechanics. Except one, the simian flu is the most useless, anoying to play disease in the game. I haven't beat it once and its keeping me from geting the cheats. These promos should not be able to keep you from cheats and are jsut anoying, frusturating, and unfun to play.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite the scare for reality but it shows how hard but how much power you have as a tiny cell, infecting, KILLING people to make humanity itself extinct from the universe. I love how the music gets dramatic when you start the game as bacteria, shwoing you ways to make your pathogen infect, server, or lethal. The game will take up most of your time in a good way, you can also create your own scenarios! That feature is great for creative people. The game's FPS is also amazing and is not lower than 10 for a normal PC.  The game is also has detail for descriptions, it makes it feel like your in some secret organization or you're in a lab doing some professional research (Without knowing the fact,   You're   the antagonist here.) the game also has cheats if you're wanting to have some 'fun' but you have to acheive them and that will be mean to a lazy person. The game even has good graphics and 3D models too! This game i s the best for stimulation strategists unless you have Mysophobia, which is bad and I feel very sorry for the person who has that sadly. But besides that, this game is amazing and should be played by billions of gamers!   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Voted this game for 'The Best Use of Farm Animals' award... ;) I can play this game for hours.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for a long time on mobile devices (phone, tablet, etc.) I still get the same thrill that I got the time I played this first time. Wastes so much time and it is really fun.",
            "review_score": "1"
        },
        {
            "review_text": "There are three games I like to relax with. Stardew Valley, Chocolatier (no judging!!!) and definateltly this game.   Destroy humanity and chill.   Now with added vampire flavour!",
            "review_score": "1"
        },
        {
            "review_text": "Finding new ways to wipe out the world is fun. And it makes you hate Greenland. A lot.",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet so entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Do yourself a favor and buy this game. You get to kill the world if you do. Multiple times. In multiple malevolent ways.   *evil laughter*   Also seriously:  -A lot of game modes -Mod support with a huge of successful mods -Multiplayer vs other people or Coop -A â™¥â™¥â™¥â™¥ ton of customization -A â™¥â™¥â™¥â™¥ ton of game scenarios  And also why is it so satisfying and addicting to kill everyone? Do I need help?",
            "review_score": "1"
        },
        {
            "review_text": "Fairly simple, very strategy based.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game about diseases, I would recommend to all who want a good but simple strategy game It runs on almost any device It's devs are active, updating and adding features, while more fun can be had by creating your own scenarios and taking a look at the other ones from the Steam Workshop",
            "review_score": "1"
        },
        {
            "review_text": "Never thought wiping out humanity could be so fun. Very addictive and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "First off, you can see that I have played this game for a decent amount of hours - that means it managed to keep my attention for a long time, which is not easy. I just keep coming back to it and it's great every time I play it. I would never have thought that obliterating the whole population with sneaky pathogens that strike everyone down with cruel and gruesome symptoms (which are admittedy, quite funny sometimes - 'Ooops', I am looking at you), would be so much fun. Plague Inc really is a game well done and I honestly recommend it. Go buy it!  Pros: +great replay value +challenging but not too annoying +you can actually learn how to beat it and then come up with new, creative ways yourself +custom scenarios and multiplayer are an awesome addition +very fitting soundrack +there are loads of achievements and it's fun to try to obtain them  Cons: -Greenland. MOTHER. EFFIN. GREENLAND.",
            "review_score": "1"
        },
        {
            "review_text": "I Can't recommend this game BECAUSE THE DAMN THING WON'T OPEN!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Plague Inc is a ton of fun. I highly reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Bought to see if Greenland is really that hard. Wasn't dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this title. Click on bubbles and level up your virus/bacteria/etc to wipe out humanity. That is 100% the game. There are different strains that require different approaches (aka leveling up differently) to be the most effective. Save your money and time.",
            "review_score": "-1"
        },
        {
            "review_text": "I like murder and killing the entire human race with a plague. I recommend this game :^ )",
            "review_score": "1"
        },
        {
            "review_text": "  Had this game on android, g/f brought this for me to wipe the floor with me in matches. Gamer g/fs can be cruel. :p",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "When I started the graphics looked terribe but it gets better I dont how it did that but besides that its a great game. first inficte the world then KILL EVERY ONE in your upgrades thats how you win at like all the games.",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Maybe it gets repetitive but it's quite relaxing - a game where you can destroy all humanity? Yes, please.  ",
            "review_score": "1"
        },
        {
            "review_text": "Too damn fun! Where else can I name a bug after my precious lil girl and be sssoooo proud when she manges to kill off the entiredy of human race....Im am such a proud daddy!",
            "review_score": "1"
        },
        {
            "review_text": "Is a Virus  Reaches Total Organ Failiure  Notices Greenland is not infected  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Created a bacterial disease called white-death and destroyed australia within a year..now white-death has spread to the rest of the world with scientists unable to detect it. World extinction here we come!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Fun -Can name your virus 'JOHN CENA!'   Cons: -Greenland. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun. Creating plagues is fun as well as destroying the world. Plus, Custom Scenarios create replaybillity.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: THIS GAME IS ADDICTIVE AS ****  I love this game so much. Yes, Fungus is a bit of a turd, but other than that I will not stop playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "I want co-op to be added i am a fan of you guys and plz add this: Virus Shell 1, 2 and 3",
            "review_score": "1"
        },
        {
            "review_text": "A Fun game marred by the fact that they've literally done nothing to make it a fun game to play on PC. Much better getting it on android. The mechanics of the game are specifically designed for android phone and are just tedious on PC. Nothing worth Â£12 was added on PC.",
            "review_score": "-1"
        },
        {
            "review_text": "Its fun to either kill or enslave the human poplation. And when you think your going to win you fail due to Greenland or another land.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game with an original playstyle and beautiful graphics.  Recommend 69/10",
            "review_score": "1"
        },
        {
            "review_text": "Great time killer and hard enough to challenge you if you like that :)",
            "review_score": "1"
        },
        {
            "review_text": "Played the mobile app for many years, and found it on Steam. I haven't played it very much on Steam, but the game is wonderful and I would recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "While an interesting concept, this game becomes monotonous after a while. However, if you're looking for a quick, fast paced game that doesn't take much brain power, then this might be the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Very Fascinating game. I enjoy playing it on my time off from work. Always something more to do on it as well than just having an ending. Awesome work!",
            "review_score": "1"
        },
        {
            "review_text": "Never though I'd see the day when a game said to me:   'Victory Capitalism has successfully eliminated all life on Earth'  10/10 would question the dominant world socio/political model again",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the mobile version you will like this one alot more  edit: still play this game from time to time, still love it.   ps. everyone will hate greenland.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolute. Not only that it is:  - Nearly completely bug free (if you don't bother digging around there is virtually none) - Awesome replay value. You could spend hours looking for better ways to kill yourself. - Scientifically accurate. I mean they use the correct terminology, right guys?   - And that Feisty little worm that you need to pay for in your phone can be unlocked by playing!    Development is also incredibly active as tension grew more and more while a confirmed update release date have been branded. James is such a community man, he literally goes around every hour checking and listening to what the community have to say at the discussions. Until that eventually got me into a conversation with him.   I don't recommend this game for run n gun fans though  .   I rate this game 99999/10 for the active responses and community support+repeatable gameplay this game has to offer.",
            "review_score": "1"
        },
        {
            "review_text": "Quite repetitive but interesting and challenging. Pretty thought provoking when you see the accuracy too.",
            "review_score": "1"
        },
        {
            "review_text": "I just love killing all of humanity with my Weeaboo virus.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, addicting game.",
            "review_score": "1"
        },
        {
            "review_text": "this is game is so fun i got it last night and multiplayer is great too i love doing scenerios this game is amazing and so are the graphics",
            "review_score": "1"
        },
        {
            "review_text": "Take over the world with mindcontroll? Yes please.",
            "review_score": "1"
        },
        {
            "review_text": " What is Plague Inc...?",
            "review_score": "1"
        },
        {
            "review_text": "Great game, it's better than trapping your Sim from Sims in a house with no door and getting the room to light on fire. Great strategy game and a good way to pretend to destroy the world, especially when stressed or just..Angry at your neighbor named JIM WHO BORROWED YOUR HAMMER AND HASN'T RETURNED IT! C'MON JIM, SERIOUSLY?! All jokes aside, Plague Inc.: Evolved is totally worth the money in my honest opinion, even if I've spent so little time playing. I plan to change that.",
            "review_score": "1"
        },
        {
            "review_text": "A real addictive game, love it!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.  Well designed.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is tots g bro",
            "review_score": "1"
        },
        {
            "review_text": "Greenland is an excellent place to go without the risk of an infection during a worldwide pandemic... unless the plague starts in Greenland, then you're screwed too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and its perfect for those would be serial killers to let off some steam. Why kill people in the real world when you can do it all on this game!?",
            "review_score": "1"
        },
        {
            "review_text": "If you like SIM games and eradicating the world, Plague Inc. Is for you. I first played this game when it was a free flash game on some obscure site and I fell in love with it then, and my love for the game only grows with each passing disease.",
            "review_score": "1"
        },
        {
            "review_text": "Highly enjoyable game, reminds me of good times with the first one way back in the day. The map looks beautiful, the upgrade paths are fun to experiment with, only cons would be that it seems a bit difficult to actually win by wiping out ALL of humanity, and I actually got a 'pity mode' that allowed me to unlock more diseases by beating a game on casual. Also con, the in game pop ups/tips seem a bit excessive, at first they were helpful, but now they are wildly annoying. But I'd still say this game is super fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Best game on the market! Played this for hours non-stop, enhanced graphics, advanced interface, and just in better detail with a destruction-simulation disease game that I just can't stop addicting to it for a decent amount of time. Would recommend anyone who likes simulation, destruction-disease or just having fun with a real-life panic of a game! :)",
            "review_score": "1"
        },
        {
            "review_text": "Name your favorite friends or characters name and watch them dominate the world with their virus, 10/10 will play again :D",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE this game        You can kill all the humans      11/10",
            "review_score": "1"
        },
        {
            "review_text": "a good game if u are planning to kill everyone. just do a vÃ­rus called pyro (or heavy, but pryo won, so) ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Warning! This game has evolved so far that it may cause protracted levels of elevated dopamine and delusions of being able to wipe out the world with engineered nano-machines. Would risk exposure again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive stratigy game. Infect seven billion people and bring down humanity with a supervirus. Easy to pick up with simple beginner difficulty, with harder diffculty for advanced players.  Always remember to wash your hands, friends.",
            "review_score": "1"
        },
        {
            "review_text": "Great strategy game. Really cool, and scary, to see how easily germs can spread.",
            "review_score": "1"
        },
        {
            "review_text": "Infect, Evolve, spread...eliminate? In this still developed game, go for one of 10+ pathogens with own Background stats ad mostly even abilities to either eradicate the world or take control over it. Sounds easy, doesn't it? Well: if you started in Arabia, don't expect your sickness to be effective in Russia, or even reach to Canada, since it might be neither used to cold or long travelling via boat or plane... let's help that and evolve! if only those pesky humans would not want to get rid of you again, doing research in the background... will be a race against time, for both, i guess...  Additionally, there are scenarios to spice things up, changing start effects like global wealth, making all countries have access to antibiotics and good healthcare, havin a new iceage etc. . Also, the Scenario-creator helps greatly that you won't run out on supplies ;)  Only multiplayer is not working so far, and no reference was done so far.  My verdict: it can be much fun to experiment on different difficulties and pathogens, sadly on some parts the pathogens still are congruent to a high level (Virus, bacteria, Fungus, so to speak the first 5) except their special abilities, so you might find your working way on infecting the world and might hardly change that, which can become a little boring. On the other hand: no one duresses you to always start in the same country and with the same Evolutions... so it's up to you.",
            "review_score": "1"
        },
        {
            "review_text": "awesome graphics, cool displays, same gameplay as the IOS android one, but here much awesome A REALLY TERRIFYING BIO WARFARE SIMULATION",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic 'evil scientist who wants to kill the world with viruses' simulator where you can even customize and adapt your virus as it spreads. Game times can very greatly depending on difficulty level, virus strain, and player skill and knowledge, though it's not something I can personally play for more than an hour at a time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fantastic and thoughtful simulation on the potential lethality of things we take for granted.",
            "review_score": "1"
        },
        {
            "review_text": "I am terrible at this game, but I love it anyway. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, hours of fun, tons of amazing mods, a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and has almost endless disease combonations, can get borring if you play it for a while though.",
            "review_score": "1"
        },
        {
            "review_text": "Keeping everyone alive is boring, so why not kill the earth as we know it. Now with more modes to kill people and you can also create your own complete scenario from scratch where you can decide how difficult you want the scenario to be, your own country legacy. You can make Greenland great again!!!",
            "review_score": "1"
        },
        {
            "review_text": "i think that is worth it to buy it",
            "review_score": "1"
        },
        {
            "review_text": "They added mutherf*cking vampires now, why not get this bloody game? Jesus Christ,   Also, I don't have so much time on the game mostly because I used to play it 24/7 when it was only on iPad or iPhone   8/10 seems simple yet complicated, still very fun!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It's a fun strategy that has to do with something I really am interested in: diseases. I also made a few crappy scenarios. Not promoting them or anything,   I swear.  ",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game when I'm feeling socially withdrawn. Not sure what that says about me.  I actually stopped playing for a while thinking I'd 'figured it out'. Basically, lay low with asymptomatic infection, then once the entire world is infected, go super lethal.  I find fungi make it harder to do this though, because you need to spend extra points helping your fungus spread to distant nations. Basically you need to budget your points more and can't rely on having the points at the end to both infect those last stubbornly remote places (Greenland, Iceland and New Zealand I'm looking at you) and slow the world's efforts to find a cure.  So yeah if you were like me, tried bacteria &amp; virus and said 'meh, is that all?' the new disease types both increase game difficulty and open new win conditions as well. Hope that helps people who haven't bought the game yet who are thinking of doing so! Do it! Feel terrible for cheering on the death of humanity, then dive back in and do it again!",
            "review_score": "1"
        },
        {
            "review_text": "This game... UNBELIVEABLE!!! ITS AMAZING for all those people that say 'dont buy' they just are 80 year olds that dont know how to play. this game is amazing i highly recommend 1/1 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Destroying the world one night at a time. Thumbs up. R8 8/Ebola",
            "review_score": "1"
        },
        {
            "review_text": "Funny when u have rage",
            "review_score": "1"
        },
        {
            "review_text": "This game is really really awesome. I love that its about destruction, instead of redemption. It's my go-to game on mobile, and has been for years and years.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing simulator of plauges and sicknesses. played on android since launch and on pc since it was greenlit, great value and very addictive.  I highly recomend it and the phone edition.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, always love watching the updates.. lazy review here.",
            "review_score": "1"
        },
        {
            "review_text": "Keeping everyone alive is boring, so why not kill the earth as we know it. Now with more modes to kill people and you can also create your own complete scenario from scratch where you can decide how difficult you want the scenario to be, your own country legacy. You can make Greenland great again!!!",
            "review_score": "1"
        },
        {
            "review_text": "A fun and addictive game",
            "review_score": "1"
        },
        {
            "review_text": "Learnt valuable lessons for world domination.",
            "review_score": "1"
        },
        {
            "review_text": "Ok. So my playtime might not be THAT high but hear me out.  Ever wanted to see the world drowned beneath an unstoppable wave of rotten zombies (that you control, like some pustulent god?) Ever wanted to enslave humanity, either thru nanotec, virus or as an mighty ape overlord.? Or, do you sometimes just wish that you could wipe humanity off the face of the planet with that great pandemic plague? Look no further, this is your game of choice..",
            "review_score": "1"
        },
        {
            "review_text": "Really love this game!  It's great if you want a quick game to waste a little bit of spare time without getting into anything important like you would in a bigger game. I played this game on the mobile before the PC version, and this is so much better!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it really is fun to play and fun to play with your friends. I think the creator makes it 5 times better.",
            "review_score": "1"
        },
        {
            "review_text": "So amazingly challenging! It's so difficult to get exactly the right amount of deadliness and infectiousness... but it's so addictive! Thouroughly enjoyable and great if you like a challenge.  Would I have paid Â£12 for it? To be honest, probably not. It's really a device game, not a PC game, but still provides a great experience.  Now to get back to killing off the world.",
            "review_score": "1"
        },
        {
            "review_text": "I have played Plague Inc. on mobile for a few years now and have always enjoyed it. When it came to the PC I knew I had to pick it up. In my opinion, the PC version is way more dominant than the mobile version. There's just more to it, and that's most likely due to the more use of GPUs and of course space on screen. I truly enjoy it. More recently I've been grinding out achievements because I enjoy doing so on many different games, and have completely been loving the game. There are a few very, very minor bugs that occur within the menus, but I just have to go to the main menu or go back one page usually to fix it. So the game is basically flawless. I truly enjoy playing it and want to thank the developers for making it an enjoyable experience for the user and continue to add content every few weeks to keep in engaging.",
            "review_score": "1"
        },
        {
            "review_text": "Must...kill...iceland....I'm...coming...for....yoouuuuuu....  Aaannyway that was weird. But in all seriousnes really good game there are some difficulties with iceland being pretty dogey to kill/infect if you don't know how to play but once you know how to play your all good.All plagues constantly provide a challenge no matter how long you've played the game for. Also with all the community created content there is a lot of different things to play! 10/10 Would recomend!  (P.S. If I made any spelling mistakes please alert me so I can fix them. Thanks.)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very good feeling, enjoyable in all platforms (including the board game!). Recommended purchase.",
            "review_score": "1"
        },
        {
            "review_text": "  Single Player-Main Game and i click Play but game don't open. How can i solve this problem?",
            "review_score": "1"
        },
        {
            "review_text": "  Plays VS with friend. Gets noticed first despite having weaker disease. Repeat x3 11/10 pvp",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game because I got addicted to the version for my phone and I wanted more. I was not disappointed! It still features all of the stuff in Plague Inc that I adore - epidemiology, news alerts, a certain level of diabolical world domination, etc - PLUS added content, which I would expect for a PC platform version of this game. I love the Santa's Little Helper challenge, its creative and deceptively adorable. The depth of the game is considerable, and it offers challenging content that make it worth the money. Overall, I'm SO addicted to this game (even though I suck at it.)",
            "review_score": "1"
        }
    ]
}