{
    "app_id": 246740,
    "name": "Huntsman: The Orphanage (Halloween Edition)",
    "release_date": "2013-09-13",
    "developer": [
        "ShadowShifters"
    ],
    "publisher": [
        "ShadowShifters"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Horror",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 66,
    "negative_ratings": 159,
    "price": 6.19,
    "description": "MORE STORY THAN GORY! A HYBRID OF ALTERNATIVE HORROR AND CREEPYPASTA...Welcome to the Halloween Edition v1.03! Take a deep breath, dim the lights, put on your headphones...Non-linear first-person gameplay lets you explore Grimhaven Orphanage and discover the characters who once lived there – voiced by Dan Bull, Chuck Huber and Raychul...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/246740/header.jpg?t=1447358342",
    "minimum_requirements": "OS: Windows 8, Windows 7, Vista Processor: Intel 2.6 GHz single core Memory: 1 GB RAM Graphics: OpenGL 2.0 &amp; DirectX 9.0c compatible video card with 256 MB shared or dedicated RAM (ATI or NVIDIA). Storage: 2 GB available space Additional Notes: Please note that the game does not run on most integrated video cards such as Intel GMA. It also requires at least 256 MB of video memory to run smoothly.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's rare to find a horror game that has no blood &amp; violence but the prob with this game is that I don't like it. (I'm going to post my thoughts on why I don't like it).  Cons:   1. It does a terrible job at making you nervous since the game's antagonist moves way too slow &amp; does a lame life sapping technique if you look at him (Doesn't that sound familiar?)  2. Your main character moves slow and your always tapping Shift all the time just trying to run (The running in that game feels like fast walking)  3. The lack of names on the graves makes it annoying &amp; time wasting  4. The lack of exploration sucks too because the orphanage is too small in my opinion which has a short basement, 2 short floors &amp; that annoying hedge maze which takes forever to figure out  5. Finding Treasure and setting them on a certain grave kinda reminds me of a matching game except a more boring version of it  Pros:  1. Really good voice acting on each of the characters  2. The story is decent  Overall I personally think this game is terrible but some people might like a creepypasta based game with no blood or violence but don't bother wasting $15 on this game (I'm sorry about the negative review but I just didn't feel it).",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this for 2.99 on sale. If you get it for free, good for you, if not, don't bother paying for it.   I like the story idea of the orphanage and hunting down the parts for the kids but that's about where it ends.   The game play is glitchy, you have to figure out how the keyboard is configured (fairly easy) and no options.   Given time in delevopment, this game could have been a really good horror game. I'm sorry to give this game a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this game would be scary. Turns out its really not. At first the atmosphere is a little creepy, but theres not much to interact with. Finding the first key to get to the maze was a huge pain. I searched every room in the orphanage and I still didn't find it, I had to look up the location of it online. The Huntsman is a windup-Spider-Puppet-Guy, who is really not very scary at all. If he is in the house, he usually doesn't move from one spot. You can always tell where he is because of the clicking noise, so it's easy to avoid him. He moves very slowly and He basically doesn't attack you or run at you. When you are too close to him for too long your screen just starts fading to black. So you lose if you stand next to him for like 15 seconds. The reason I don't find it scary is because he doesn't seem very aggressive towards you. He doesn't attack you or anything, I never feel threatened when playing the game like I do when I play other scary games. The developers said that they made it this way because they wanted a different, less violent approach than most games, but I think that was just an excuse so they didn't need to put anymore work into making the AI smarter. Overall, the graphics are pretty bad, you can't interact with much, and the game is not very scary. Definitely, not worth $15, I'd say even $5 would be stretching it.",
            "review_score": "-1"
        },
        {
            "review_text": "got this game recently and I love it, can't deny a good spooky chilling game, have had goosebumps at some parts... I suggest to anyone who likes spooky games, to give this one a go :)",
            "review_score": "1"
        },
        {
            "review_text": "Ugh, if I would've known it was a simple item finding game with a lot of boring details and story I wouldn't of purchased. The trailer seemed so cool I didn't want to watch videos in case of spoilers. Well, nothing to spoil, since the trailer is arguably the best part about the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Wander around in the dark with your phone, wait for something to happen, lather, rinse, repeat; thats about it. I guess there's some people that like this kind of stuff; but I don't consider it a game. I can go out in my yard at night with my phone and have the same experience, and save whatever this game costs (I got this in a bundle, so I paid maybe 10 cents).",
            "review_score": "-1"
        },
        {
            "review_text": "Can only carry one item at a time which is incredibly annoying since this makes hording all items at one point a must.  Husntman doesnt do anything, and the picking up/putting down of items is incredibly slow.",
            "review_score": "-1"
        },
        {
            "review_text": "Let's just say 'Holloween Edition' is right...",
            "review_score": "1"
        },
        {
            "review_text": "At this very moment (28/12) it is NOT ready for prime time.",
            "review_score": "-1"
        },
        {
            "review_text": "this isnt for me gameplay was crapy at best i guess for some chicks it might b ok but no where near enoughh action to keep most men ocupied",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst games I have ever played in my entire life, I would rather rub my face on sandpaper while someone shoots me with a flamethrower than play it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Played 7 minutes,.. uninstall and never sleep again....",
            "review_score": "-1"
        },
        {
            "review_text": "It is a great jump out and scare you game. First time i played it was great. It seem to be hard to complete. the only thing is that most of teh action happens in the phone in your hand.",
            "review_score": "1"
        }
    ]
}