{
    "app_id": 246720,
    "name": "Wayward Manor",
    "release_date": "2014-07-15",
    "developer": [
        "Moonshark, Inc."
    ],
    "publisher": [
        "Moonshark, Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "achievements": 81,
    "positive_ratings": 29,
    "negative_ratings": 50,
    "price": 4.99,
    "description": "Neil Gaiman &amp; Wayward Manor invite you to jump into the afterlife of a disgruntled ghost, trying to reclaim his house from its newfound owners.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/246720/header.jpg?t=1478027664",
    "minimum_requirements": "OS: XP Processor: Intel Core 2 Duo 2Ghz+ or better Memory: 2 GB RAM Graphics: 256 MB Video Card DirectX: Version 9.0 Storage: 2 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "After reading some reviews, I was wary. I could understand some of the points others were making and I went into the game worried about gameplay, graphics, and story; but I pleasently surprised.  There were a few bugs here and there, but it looks like the developer is taking care of them as they find them. This would explain not encountering some of the bugs others had previously mentioned. As time goes on, I am sure there will be little to none to speak of.  The graphics, although not up to the quality of some of the larger titles, has character and style. It was actually an enjoyable break from the drab color-palatte of larger games. And since this game is tagged as both indie and casual, I am to take into assumption that it isn't meant to rival a heavy-budgetted game and just live up to what it wants to be; fun. Intent aside, the rooms are fun and visually enjoyable, the characaters are amusing to watch, and the resolution seemed fine for whatever screen I played on.  The gameplay was simple, a point and click combination puzzle game that didn't have me frustrated by level 2 by some overly-complicated design. Even further in, the difficulty was raised, but feasable. The complexity came into the 'secret scares' which would be the achievements for this game.  The story felt a bit loose, but the quick cutscenes between the worlds as well as blurbs from stuffed animals/gargoyles/tutorial-like house narration helped keep you tethered to the story and who was involved. I didn't feel like it was a visual narration of one of Neil's books, which I can only assume others felt dissapointed by. All in all, the focus was more on the fun gameplay than bogging the player down with too much story.  As a over-all whole, I enjoyed the game. I even spent time trying to get all the secret scares, some of which took me a while to get, and some yet elude me.  TL;DR : It's a fun casual puzzle game with some character with a bonus of Neil Gaiman's narration.",
            "review_score": "1"
        },
        {
            "review_text": "A game of ever-increasing complex puzzles, with clever characters that make me laugh. The learning curve is quick, the controls intuitive, and it's a pleasure to control with only the mouse (no keyboard). I do wish there was more history, background, and a longer game. Overall, happy and reccomend you buy it!",
            "review_score": "1"
        },
        {
            "review_text": "About half way through the game and having a great time! Love the art direction and the puzzles are a lot of fun, I'll definitely go back to solve them in different ways. Ran into a few minor bugs, but nothing that stopped me from playing. Defintely worth it for the music alone.",
            "review_score": "1"
        },
        {
            "review_text": "Like other Neil Gaiman fans, I was excited to hear he was taking his story-telling talents to a new medium with this game. I was personally not disappointed. All I expected was that I'd like it. I'd learned that you can't expect much other than good story-telling from Neil; he mixes it all up too much. Between Neverwhere, Sandman, American Gods, Anansi Boys, Coraline, his picture books, Fortunately the Milk, the Graveyard Book and The Ocean at the End of the Lane (all of which I have read or seen), no two are alike. While I think it would be great to have more to the game, especially a longer story, I was pleased with Neil's work. I would love to see this as an illustrated novella of sorts.   That being said, I do have certain expectations about games, though keep in mind, this is from a very casual game-player. I expect them to run. I expect them to work. I expect a finished and released game to be complete and fully-functional. I expect them to entertain. I expect them to be worth the money. I expect them to be worth my time. It worked for me and all (I don't think I had any bugs, but I could be wrong), but I also expect narration to be coupled with text, particularly if audio is unavailable or undesirable (even if it is the wonderful Mr. Gaiman narrating). And I expect some sort of tutorial, even if it can be disabled, and there was none. I think an option to return to the menu between levels or chapters could be added; I had no idea I was almost done until the plot twist came.   Do keep in mind: a patch/update was released within a day of initial release, so any issues may have been fixed. The designers made some slight adjustments, too (i.e., there wasn't the magnifying glass when you couldn't click things before).  In all, I liked the game. I did not have ideas about what it would look like or what it would be about (save for the pre-release description), so on this I had no disappointments. Nor was I disappointed by the story, though as I said I wish there was more. The puzzles could mostly be solved multiple ways, which means you can play them differently several different times, and people who are great at these types of puzzles and those with less experience can all enjoy. Some were more challenging than others, but mostly, this is a casual puzzle-solving story. The background art was nice, though the moving pieces were rather square and jagged, as some others have complained (I don't put as much emphasis on graphics as most people seem to). The music had a nice haunting (but not quite scary) tone, which was pretty cool, too.  Bottom line: It was a cute, casual puzzle game, and I wish there was more.   Also, make up your own mind about it. Was it worth my time? Yes. Was it worth my money? I'm not sure, based on the length, depth, etc., but I don't mind supporting a favorite author and an indie company.",
            "review_score": "1"
        },
        {
            "review_text": "When I started playing this game was a bit confusing, but after a while I found it very fun, I can play it with my granddaughter and share the scary moments, and we enjoy a lot to see the furniture all flying around the rooms. The characters are funny, the game it´s easy to play, very well designed and the music is nice (but sometimes a llitle repetitive). I definitely recomend it, hope I can see it for iPad, because I travel a lot with mine.",
            "review_score": "1"
        },
        {
            "review_text": "I am a Neil Gaiman fan because I've never read anything made by him that was bad. I've been waiting for this game for a long time and when I star to play it sux. The story sux the gameplay sux.  You have to click on points of the scenario to scare the people and that's it. Level after level of this. I do not recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very, very bad indeed. I can't even recommend it if you see it going cheap, because it will still cost you time. It is poorly conceived and shabbily constructed. I should not have backed this.  The gameplay is extremely simple and unrewarding - you just click items to briefly 'haunt' them, and some items can be turned between two angles to reflect projectiles while some can be slid across the floor in response to gusts of air. I'm making that sound better than it is. It's extremely dreary, and there are much better games to be had for free on flash sites. You will not have any kind of fun or excitement here.  On the technical side, there is only one graphical option, and that's your screen resolution. There is no controller support, no language option. The graphics are astonishingly badly modelled, animated and textured, although you only see the models up close in the cut scenes. The music's quite charming the first time you hear it, but you're going to hear the same music and flourishes in the same order over and over again, and it won't seem very appealing then.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is such a disappointment. Like most people I got this game because Neil Gaiman wrote the story, and well his narrations are the best parts of the game. Unfortunately they're also the only good parts, sure the art style is nice but it's hindered by it's 2005 quality. The gameplay is rather boring to begin with and it just gets worse and worse because it never changes, it's just entirely repetative.  Don't get this game, even for Neil Gaiman's ontributions, because you'll tire of the game before you can get to the whole story.",
            "review_score": "-1"
        }
    ]
}