{
    "app_id": 246800,
    "name": "BeatBlasters III",
    "release_date": "2014-02-21",
    "developer": [
        "Chainsawesome Games"
    ],
    "publisher": [
        "Chainsawesome Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Rhythm"
    ],
    "achievements": 13,
    "positive_ratings": 31,
    "negative_ratings": 46,
    "price": 6.99,
    "description": "Welcome to Accapella! When Joey and Gina arrive in the musically starved town that outlawed groovy tunes, a chance encounter with the music hating tyrannical ruler of the town (and local butcher) sends them flying.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/246800/header.jpg?t=1447358346",
    "minimum_requirements": "OS: Windows XP, Windows Vista SP2, Windows 7, Windows 8 Processor: Intel Core 2 Duo 2.1 ghz Memory: 1 GB RAM Graphics: Intel HD Graphics 4000 Storage: 800 MB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista SP2, Windows 7, Windows 8 Processor: Intel Core 2 Duo @ 2.8 GHz / AMD Athlon II X2 @ 2.8 GHz Memory: 2 GB RAM Graphics: Nvidia GeForce 6800, ATI X1800 XT Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I love music. It's always been a huge part of my life, whether that's listening to a fresh track or making my own, and I couldn't imagine a world without it. The citizens of BeatBlasters III aren't as big fans of it, in fact they've gone so far as to outlaw any and all music being played or listened to in their quaint little suburbia. Obviously this simply won't do, and thus you must liberate the town from itself...by escorting monkeys to choppers and protecting panda bears from giant gumdrops?  To try and make sense of BeatBlasters would be a foolish endeavor, as everything about it is as nonsensical and random as any game I've ever played. Putting you in the head bobbing, foot tapping shoes of the musically powered Gina and Joey, each level tasks you with a bizarre objective requiring you to utilize your three abilities: a shield, a plasma shot, and a hoverboot jump.  Where the musical aspect comes into play is recharging said abilities by tapping to the beat of the song. Keeping a steady rhythm forms combos which let you charge them faster, making getting into the groove a necessity as levels quickly become more challenging. It's a moderately interesting idea, but in practice only serves to frustrate.  Everything about BeatBlasters is slow and clunky, from your movements to character animations, to the awkward transitions between track layers which constantly skip and repeat themselves. It's frustrating to play even when it works, but during hectic moments requiring quick timing it's an abysmal mess of trying to charge your shots and complete your objective in time. The objectives themselves are of little consequence, as almost all fall into the same mold of protecting or escorting the dumbest NPCs to ever inhabit a game. You would be forgiven for mistaking them for being on deaths door for how sluggishly they move through levels, all but begging enemies to kill them and get it over with.  The artwork itself hovers from moderately interesting, too simplistic and unimaginative. Characters especially suffer from awkward transitions and an extremely limited move-set. I can appreciate the variety in locals, but even then there is little character in the backgrounds and no consistency with whatever theme the developers themed to be going for. As a musically themed game, the loop heavy tracks are uninspired and aggravating to hear continually repeat themselves off time as they unsuccessfully attempt to sync with your actions.   I'm not sure exactly what I expected from BeatBlasters III, but what I got was a dull, repetitive and unpolished experience that wouldn't cut it as a third-rate flash game. There's nothing I can recommend about it besides not being inherently broken from bugs, as the presentation, controls, and underlying mechanics all work against themselves to suck any fun that could have been had with the game.  And if King Banana wants anymore bananas he can bloody well get them himself!",
            "review_score": "-1"
        },
        {
            "review_text": "I was unfamiliar with BeatBlasters 1 or 2 (in reality I can’t actually find anything on these games at all) when I was invited to check out the third instalment of the franchise by Chainsawesome Games.   Describing itself as a “rhythm/action-platformer” game I was a little bewildered as to what to expect. Was it Super Mario Bros. game with Guitar Hero elements? No. With BeatBlasters III it’s not that simple.  Story wise you play either Joey or Gina (choosing either appears to have no value other than cosmetically) a musically inclined pair as they, for reasons not explained, decide to visit a town called ‘Accepella’ which in true Footloose-esq fasion has banned ‘groovy tunes’ (possibly not all music is outlawed I suspect, maybe it’s just the dubstep ‘beats’ the pair produce which would be quite understandable). The ‘ruler’ of the town promptly sends the pair packing and thus begins a strange journey to return to the town and, err I guess, you know, free the town? Again it’s not very well explained. Each level is inhabited by, but again not explained; quite random occupants (butterfly cows, pirates, ghosts, monkeys, penguins – both good and evil, robots etc.).   So how does it play? As blurbed it’s a platformer for one so your character has to navigate a 2D side-scroller world both protecting and defeating the surreal world inhabitants with your abilities, of which you posses three: attack, a shield and a rocket jump. Often the levels have you using these powers frequently so management is essential - which is where the ‘beat’ element comes in. When not shooting, protecting or jumping you need to replenish each power. This is achieved by putting yourself into a recharge mode (holding down a button) and then rhythmically tapping that ability button to an electronica tempo matching a swinging metronome. Having to recharging keeps you busy and being good at doing so, especially when under pressure, can be difficult to do. Once successfully recharged all of your skills you’ll also unlock the ability to for a short time let loose an infinite energy burst of all powers at once. The better you tap in time, the faster you can recharge and the better you score. Thus in turn the better you play the more stars you earn at the end of each level to upgrade your abilities. Because of the three powers plus recharge button it’s nay impossible to play with a keyboard. A controller is definitely recommended.  Graphically the game is easy on the eye with a Rayman gloss that looks good and animations for the most part are quite well done (although the characters jumping movement doesn’t look quite right). It’s vibrant and colourful with its own art style making it stand out. As with in-game graphics, the presentation is solid with good clear menus, options and features well laid out. To be expected from a game that relies on rhythm the audio is of a good high standard however does lack some diversity with each level only giving a slight variation on a theme.   Its shtick is that it’s certainly unique. I’ve never come across this type of game in my years of playing and in some ways it reminds me of a modified tower defence or Plants vs. Zombies type game. Some levels (only 16 in total!) are more puzzle geared while others have you require more platform dexterity. I found the escorting character missions to be very tedious and boring and only wishing to scrape by (getting one star by allowing only one of my party to survive) just to progress to the next level. Naturally doing better scores you more points to spend on upgrades, but had little inclination to do so.  Certainly unique and ‘niche’ I found at times I had fun, but oh so often I was left asking myself “Why am I playing this?” Although novel with a innovative mechanic I found the game slow, tedious and offer little in the way of longevity/replayability. Yes the game is budget (£6.99) but I just didn’t get enough out of BeatBlasters III to enjoy it. Maybe I was expecting it to be a little more casual, but instead found it too slow and at times challenging – even frustrating in moments. The pace is all over the shop and its gimmick didn’t hold my attention. Perhaps if the game had some charm and humour I would have been more enamoured. Failing that if they had given each level a different musical genre with its own tempo or, dare I say, even use a licensed or recognisable track (classical or a parody of a known song could avoid licensing costs) may have made the game more fun.  I’m going to wait for BeatBlasters VI to see if they make it more enjoyable and maybe have that X-Factor (pun intended).",
            "review_score": "-1"
        },
        {
            "review_text": "Could've been better, I only voted up because it reminds me of an iOS type game that would be played while taking a dump.  So if you like those kinds of games 'Which I'm sure if you do, you're just playing farmville on facebook' then this is the game for you.  Trying to keep an open mind here.",
            "review_score": "1"
        },
        {
            "review_text": "Rhythm games: you either love 'em or hate 'em... If you belong in the former category you will love BeatBlasters III. If you fall in the later then stear clear, you won't like it.  I personally like the fact that the designers comes from my province, something that is kinda rare... Although this fact didn't alter my purchase decision at all as BeatBlasters III is a great game and definitely worth a purchase. ",
            "review_score": "1"
        },
        {
            "review_text": "Feels like it should be fun. The curve from tutorial to first stage.. sucks. The storyline is not interesting enough to have me that involved to put up with such a succky first stage.  I'll have to try it again when sober.",
            "review_score": "-1"
        }
    ]
}