{
    "app_id": 246900,
    "name": "Viscera Cleanup Detail",
    "release_date": "2015-10-23",
    "developer": [
        "RuneStorm"
    ],
    "publisher": [
        "RuneStorm"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Gore",
        "Multiplayer"
    ],
    "achievements": 85,
    "positive_ratings": 6753,
    "negative_ratings": 580,
    "price": 9.99,
    "description": "In Viscera Cleanup Detail, you step into the boots of a space-station janitor tasked with cleaning up after various horrific sci-fi horror events. Instead of machineguns and plasma-rifles, your tools are a mop and bucket. That hero left a mess, and it's up to you to deal with the aftermath.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/246900/header.jpg?t=1544437804",
    "minimum_requirements": "OS: Win XP SP3, Win 7 Processor: 2.4GHz Dual core CPU Memory: 4 GB RAM Graphics: 512MB Shader Model 3.0 Nvidia GeForce 8800 GT or AMD Radeon HD 3870 DirectX: Version 9.0c Storage: 5 GB available space",
    "recommended_requirements": "OS: Win XP SP3, Win 7 Processor: 2.6GHz Quad core CPU Memory: 8 GB RAM Graphics: GB Nvidia GeForce GTX 560 or AMD Radeon HD 5850 DirectX: Version 9.0c Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "Clean the floor in our house =NO Clean bodies and blood in a video game= YES",
            "review_score": "1"
        },
        {
            "review_text": "Watching all the bloody mess and gore turn into a sparkling clean level is extremely satisfying. Picking up bullet casings is so zen.  Make sure to play with friends, though. I can't really see myself playing this game alone.",
            "review_score": "1"
        },
        {
            "review_text": "I've played so much of this game, it's to the point where, in the middle of playing DOOM, I was thinking about where my bucket and mop are. As someone who likes to put things in order, and make progress towards a goal, this game is like the satisfaction of playing a perfect game of solitare, where all the cards eventually fall into place. This game is like a zen experience. Just you and your mop, working towards a goal. There's no time limit, no limit on the number of buckets, or anything, so you can always make progress and finish a level if you have the desire to.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very interesting game. There's a certain zen that comes from just sitting back and completing a task. It's similar to the satisfaction from making deliveries in Euro Truck Simulator.  In any case, one of the more interesting parts is simply exploring a giant level and seeing all the cool sci-fi crap sitting around. Some of these levels are beautiful, sans the blood and guts.  My only complaints would be that sometimes it's a bit vague whether the level is clean or not and the grading is very unforgiving (it hurts to do a full level for the first time, meticulously clean everything you think you need to clean and get a 76% rating). Once you read a bit and figure out all the crap you need to do, it's a little easier. It might ruin some of the magic of a first time playthrough though.  It's on special so I'd definitely pick it up. I'm sure it's a good laugh in co-op. I have no idea if the developers will provide any support or content past the release though.",
            "review_score": "1"
        },
        {
            "review_text": "Recommend 10/10 Manages to be the bloodiest game in my library without being violent. It's really fun to play with friends, but the multiplayer usually has too much lag for us to have a clean gameplay (pun intended). It's also fun to do it on your own, but takes much longer",
            "review_score": "1"
        },
        {
            "review_text": "CLEAN UP, CLEAN UP, EVERYONE EVERYWHERE, CLEAN UP, CLEAN UP, EVERYTHING EVERYWHERE  preschool simulator 2016  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "If you want to buy this game you need friends, because it's so funny with friends :D If cleaning was funny in real life :((",
            "review_score": "1"
        },
        {
            "review_text": "Good game for wasting time and laughing at some of the weird ways people died. It's super tedious, though. Takes forever if you don't have anyone with you.",
            "review_score": "1"
        },
        {
            "review_text": "So, if you're the type of person who looks at the reviews first, you might be wondering: What is Viscera Clean-Up detail? To quickly summarize, it's basically a game where you clean up the aftermath of your average old-school FPS level/sci-fi movie mishap. Mopping up blood, burning the remains of gored aliens etc. It's a game almost certainly born from a joke, but it's execution certainly isn't one. You're given a variety of cleaning implements to perform your job, from things as low-tech as a simple, if slightly stylized mop to as futuristic as a laser gun that can mend bullet holes, and actually doing a thorough job takes an understanding of all the gadgets on your toolbelt.   It's bizarrely relaxing, and perfect for doing things like listening to podcasts or audiobooks over. Much like the games it lampoons there's also plenty of fun secrets to find, including a bunch of momentos you can take back to your office at Aerospace Sanitation and put on display. Speaking of your office, even it has secrets to discover! There's even a sort of larger narrative one can slowly piece together across the game's many levels if they take the time to really search every nook and cranny. It's a lot of fun. This all comes from someone who played the game entirely single player, so I can't speak to the funcitionality or fun factor of the multiplayer personally, but having seen the YouTuber Criken's video on it, I get the impression it's a blast, whether your friends are actually interested in cleaning or not.   Overall, I'd very much recommend Viscera Clean-Up detail.",
            "review_score": "1"
        },
        {
            "review_text": "possessed trash bins &amp; end of good friendships.  10/10 would clean again.",
            "review_score": "1"
        },
        {
            "review_text": "If you have friends this is fun but I dont have any it is still fun you might want to play a podcast or music in the background its a nice time killer and somewhat relaxing",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play with friends. Completing a game takes a few hours, buts that's one of its best features I think.",
            "review_score": "1"
        },
        {
            "review_text": "*mop* *mop* *mop* *mop* *mob-SMEAR*  ... Crap. Mop's dirty. *splash splash* Mop should be clean now. *SMEAR* *SMEAR* *SMEAR* *SMEAR* ... *SMEAR*  I thought I just cleaned you! Is the water dirty? *splash splas- BANG-SPLASH* What? ARE YOU KIDDING ME? BUCKET. I DIDN'T SAY YOU COULD DUMP YOUR CONTENTS ON THE FLOOR. Grr... *walk walk walk walk walk walk walk* WHAT?! I LEFT A BLOODY FOOTPRINT TRAIL?! Why. At least I can get a new bucket. *Punshes machine* *vrrrrrrrr* *leg comes out of machine, falling on the floor, making more blood* WHYY *punch punch punch* *bucket of water comes out* *BANG... SPLASH: another bucket comes out pushing that one off and dumping it over* ... *heavy breathing* Okay. I can do this. *grabs bucket, start cleaning up footprint trail and leg blood splatters* *BANG BANG BANG SPLASH SPLASH: grabs bucket to move it closer but smashes it into the other bucket, knocking this one over and sending blood everywhere* WHYYyy.... DO YOU DO THIS?! *punches machine again* *mop* *mop* *mop* *mop* *mop* *splash* *carrying-sounds* *more mopping* ... Finally! I made it back to the mess. *mop-SMEAR* ... WHY?! *carries bucket all the way back and over to the incinerator* *tries to put bucket in incinerator* *physics decides to not exist for a moment, sending the water bucket in random directions as high velocity, making a BIGGER MESS ALL AROUND THE INCINERATOR* (five minutes later) Finally, I cleaned up the original mess. Wow, my mop is dirty. I better clean it. *splash splash splas- BANG SPLASH* Alt + F4  10/10 would clean viscera again",
            "review_score": "1"
        },
        {
            "review_text": "Can't really understand which power does this game have, but it owns me totally, can't stop playing it until everything is 99% clean(cause 100% is impossible).",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious game, don't bother with single player...   You get home and have to do all the boring housework, finally you finish and sit down at your computer and think... Now that I've finished all that tidying up, I should tidy up AND do paperwork! But for some reason It's fun.... No really it is, get some good friends together and it's an awesome laugh. Just watch out for those sneaky buckets!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! It is simplistic yet surprisingly addicting. Ive put almost 20 hours into it and love how the maps are very in depth. There is a lot more potential here and I look forward to seeing how this game turns out.",
            "review_score": "1"
        },
        {
            "review_text": "Let's get things straight: this game is statisfying for certain poeple so don't hate on it right away.  Viscera Cleanup Detail (or VCD for short) is a game about cleaning murder scenes. You probally think that that is disgusting, but it's actually quite interessting. I personally discovered this game by a video of Nerd³. Since then I played this game for 28 hours already and I love it. It has funny bits and pieces and also some story in every map. For people who are new to this game should definitly ask someone to get them started (like me). The game does not have a tutorial and that's one of the things that makes this game a bit less likeable, but as always someone made a tutorial level on the steam workshop to get you started.  The maps on this game go from 45 mnutes of playtime to 3 HOURS of playtime and the sizes go from small to huge. Most maps have around 1-2 hours of playtime wich is long you may think but once you play the game you won't even notice (I've done 5 hours straight without noticing.).  A far as mechanics go there is not too much special. Only some tools and machines that appear in every level. Some tools are level specific. There are also secondary objectives that won't influence your score. The controls are quite easy, just WASD and mouse buttons (or xbox 360 controls).   As far as multiplayer goes there are few options:splitscreen co-op for wich you need to be on the pc and need two xbox 360 controllers. Then you have multiplayer server for up to 28 people (not recommended though). The servers are not paid or don't require any difficult set-up things to do but are a bit slow sometimes. For the multiplayer servers you can make them public or friends only wich comes in handy when you're trying to do a speedrun or so.  For VCD I would give a 9/10. I hope you found this helpful and thanks for reading. Regards, Spider.",
            "review_score": "1"
        },
        {
            "review_text": "That feeling when you walk with an full Disposal bin and you hear the splashes",
            "review_score": "1"
        },
        {
            "review_text": "A mop to soak up all types of ill sh*t A laser welder to melt whatever I can find Dynamite to blow up my janitor friends  ahhh....good times",
            "review_score": "1"
        },
        {
            "review_text": "I went cleaning up another map with my friend, it was in the outside. With my great glitch skills, I ended up outside of the limits of it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Mum: Instead of playing that game, why don't you go clean your room? Me: But my room doesn't have blood and guts all over it. Mum: It will if you don't clean it more often... Me: o_o",
            "review_score": "1"
        },
        {
            "review_text": "The biggest mistake I have made was to buy this game before my exams .",
            "review_score": "1"
        },
        {
            "review_text": "You can put human remains into a giant oven. 10/10 would holocaust again.",
            "review_score": "1"
        },
        {
            "review_text": "Grab a friend, grab a mop, get going. Best enjoyed if you have someone else to throw legs and such at.",
            "review_score": "1"
        },
        {
            "review_text": "Nomally you'd get paid to do this.  I paid $10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best (and I'll assume only) space-mop-cleaning-janitor game on the planet! clean up Human and Alien guts, sweep away spent shell casings, and one you get the rifle-that-shoots-lasers gun, just burn everything and then mop away the soot. there's just one detail that has raised a personal question; since your character obviously uses the force, when will there be a Star Wars themed DLC? This is the perfect game to put you in the place of a First Order janitor that has to clean up after one of Kylo Ren's hissy-fits. This is a great game, and I highly suggest it to everyone, especially if you would rather clean an interstellar space station than your own home.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to commit a mass murder ? yes ? well too bad for you ! cuz you're the guy cleaning the aftermath up ! sucks to be you ! HAH !     but on a serious note ;) very fun to screw ♥♥♥♥ up with your friends :D   10/10 would throw bucket at friend again !",
            "review_score": "1"
        },
        {
            "review_text": "I've cleaned longer in this game than in real life I think.",
            "review_score": "1"
        },
        {
            "review_text": "Me being the HC Viscera Cleanup Detail player I'd highly recommend this game to everyone who enjoys a bit of cleaning alien debree and dead bodies. This is in it's own unique way so relaxing.   What I would love to see more to this game are more achievements and new maps!",
            "review_score": "1"
        },
        {
            "review_text": "Considering my life is a plethora of stress - this game, despite the premesis, is extremely relaxing.  The colors are vibrant, the core is meaty and though simplistic in mechanics, opt you to think about the order of operations when you're cleaning.  I absolutely love the many many many maaaany nods to old horror movies and scenes, considering I'm a horror fanatic. Honestly, if it wasn't on sale when I bought it - I would have bought it full price anyway. It's definately worth it, and you'll get your hours of playtime out of it.  It's especially good to play after a stressful day at work. My only complaint really, are there could be a lot more DLC. But I expect that'll come in time - I'm just impatient and enjoy the hell out of this game! ",
            "review_score": "1"
        },
        {
            "review_text": "This is such a cool Janitor game!",
            "review_score": "1"
        },
        {
            "review_text": "A great game to mess aound in with friends, but can get pretty boring after a while. Still worth the money, though.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best (and I'll assume only) space-mop-cleaning-janitor game on the planet! clean up Human and Alien guts, sweep away spent shell casings, and one you get the rifle-that-shoots-lasers gun, just burn everything and then mop away the soot. there's just one detail that has raised a personal question; since your character obviously uses the force, when will there be a Star Wars themed DLC? This is the perfect game to put you in the place of a First Order janitor that has to clean up after one of Kylo Ren's hissy-fits. This is a great game, and I highly suggest it to everyone, especially if you would rather clean an interstellar space station than your own home.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure where my life has gone when I've spent more time cleaning in this game than my actual apartment",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique games on Steam buy it and you will be able to clean on your computer. 8/8 - Actually came out of Steam Early Access",
            "review_score": "1"
        },
        {
            "review_text": "Gotta love when you're just cleaning away and then your friend decides its a great idea to block you in a room with buckets and baskets, then throws body parts around the halls making the room look more like hell before you even came.",
            "review_score": "1"
        },
        {
            "review_text": "an accurate description of what my room looks like",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most time consuming game I've ever played. 10/10 Would clean a vurtual room besides mine.",
            "review_score": "1"
        },
        {
            "review_text": "Collect the skulls of your fallen crewmen, incinerate there less collectable torsos, file paper work on all of it. what could be more fun?",
            "review_score": "1"
        },
        {
            "review_text": "Great fun at times, but seriously flawed.  + Lots of maps/content + Workshop maps + Surprisingly fun and satisfying to clean - Glitchy physics - Some FPS issues depending on map - Incredibly annoying to clean last few messes (sometimes have to rely on cheats just to 100% complete a map)  Would still recommend if you can get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely engrossing gameplay, love the rush that I get when I play this movie-like masterpiece of a game. The premise is absolutely exquisite; the characters and atmosphere make this a real winner",
            "review_score": "1"
        },
        {
            "review_text": "Found out I'm psychotically addicted to cleaning. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You clean up a mess",
            "review_score": "1"
        },
        {
            "review_text": "i enjoyed this game (not that im done with it) because there were so many uniuqe maps and things to clean up and after you have cleaned a whole map it so nice to go and look around at how beautiful the map is and there are even some creautures i beleive and i think you should get this!",
            "review_score": "1"
        },
        {
            "review_text": "Not gonna lie...this gave me a booner",
            "review_score": "1"
        },
        {
            "review_text": "clean clean CLEAN",
            "review_score": "1"
        },
        {
            "review_text": "Tonight!, on Kitchen Nightmares!.....",
            "review_score": "1"
        },
        {
            "review_text": "Played with a friend, whilst talking on skype.  2 hours in, room seems clean.  Friend kicks over a dirty bucket, and drops a bin full of body parts.  I screamed at him. 10/10 would ruin friendship again",
            "review_score": "1"
        },
        {
            "review_text": "Playing with two other friends  -Finish map and go to employee area -Try to clean it up -Friends start spawning infnite amount of buckets and bins -'STOP SPAWNING SO MANY BUCKETS' -Hide in the backroom -Decide to take a look outside -Opens door to be flooded with buckets and die -Game crashes ",
            "review_score": "1"
        },
        {
            "review_text": "forever never finding that last bullet shell",
            "review_score": "1"
        },
        {
            "review_text": "forever never finding that last bullet shell",
            "review_score": "1"
        },
        {
            "review_text": "She loves cleaning, even videogames aobut cleaning",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to recommend this 'game' to just anyone because although I love it, I suspect 90% or more of gamers would find it dreadfully boring. The entire premise is simply cleaning up messes. There is no other gameplay. Nothing attacks you or attempts jump scares because you've arrived on the scene after all the action has happened. Unless you play with someone else, you basically don't encounter another living creature in-game. It is possible in very specific circumstances to die, but there are no repurcussions for death, you just respawn.  The mechanics are all designed to be repetitive, semi-tedious busywork with mediocre tools. That being said, I find it deeply meditative to turn on some music or a podcast, enter a level and just set everything to rights. Going through an area covered in trash and gore and making it spotless... there's genuine satisfaction to be found here. I prefer to ignore the in-game evaluation system, which seems inconsistent and irritating, and just clean things to my own standards.  What a typical session consists of:  1) Picking up countless bits of trash and gore and running them to the incinerator. This is by far the most time consuming element. You thankfully have access to trash bins that allow you to carry more than one item at once. 2) A lot of mopping. Mop buckets need to be replaced after a short while or you just redeposit filth. The dirty buckets must to be incinerated. 3) Little odd jobs like welding bullet holes shut or restocking emergency kits. 4) Recleaning stuff because you accidentally made it messy again with bloody boot prints, fire damage, a severed limb getting blood on something, etc.  To be clear, this is not an exciting game and arguably not a fun game, but as previously stated, it can be rewarding. There are also a lot of nods to familiar gaming and sci-fi tropes or moments. The game has a dark sense of humor, evident in some of the massacre sites you encounter, and although there's no narrative to the game as a whole, every level has a vague backstory that can be explored through found objects and data logs.  A couple negatives... the game has sometimes triggered motion sickness for me, some of which can be mitigated via the options, but not all. The netcode feels wonky, with more distant friends having significant lag. Obviously this doesn't make a huge difference because there's nothing happening action-wise in the game that necessitates rock solid sync-up, but the lag can do weird things to the game's physics.  I would suggest watching some gameplay vids before buying this game, but I do enthusiastically recommend it for people who want to try something different.",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "For a cleaning simulator it has surprisingly deep story and lore behind it.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Entered a very messy room &gt;Picked up a body to dispose of it &gt;Accidently spilled my bucket of clean water &gt;Cried 10/8 would cri again",
            "review_score": "1"
        },
        {
            "review_text": "Showed me that all I need to get my room clean is a mangled human corpse.   10/10 would paint my room red again",
            "review_score": "1"
        },
        {
            "review_text": "8 pimps out of 10 pimps",
            "review_score": "1"
        },
        {
            "review_text": "Sci-fi cleaning simulator. Never thought I'd be so pleased to clean.",
            "review_score": "1"
        },
        {
            "review_text": "  is great game",
            "review_score": "1"
        },
        {
            "review_text": "Yes this game is good, but damn it runs like ♥♥♥♥ for some reason, so bad to the point were i get motion sick because the FPS is too low, jesus christ they need to fix that ASAP!",
            "review_score": "1"
        },
        {
            "review_text": "Best clean up simulator 10/10 IGN would play again.",
            "review_score": "1"
        },
        {
            "review_text": "  This game has taught me that messes are fun to make, but horribly unfun to clean up. :D",
            "review_score": "1"
        },
        {
            "review_text": "This Is My Bae Need People To Play With Though Make It On Mac Too Please :)",
            "review_score": "1"
        },
        {
            "review_text": "  This game is pretty awesome, would be awesome if you could flush the toilets, instead of being stuck with a bloody toilet and no more fresh water. It would only make sense and would make things much easier",
            "review_score": "1"
        },
        {
            "review_text": "NO, I DIDN'T TIP OVER THE BUCKET! -SIMULATOR 2016",
            "review_score": "1"
        },
        {
            "review_text": "  is great game",
            "review_score": "1"
        },
        {
            "review_text": "Weirdly addictive and fun in short bursts. Overall more fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Sugar Baby simulator 2016. Learn to please your Sugar Mama in *12 easy steps.  * Steps may or may not include blood",
            "review_score": "1"
        },
        {
            "review_text": "I found a foot in a vending machine. 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "started cleaning  cleaned a whole map got 80% clean  whent to office cleaned office whent to frost bite didn't give a ♥♥♥♥  killed my self x5 stopt job got fired  whent to santa rampage  blow my self up   11/10 elf heads would kill my self again",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER 20/10 IVE ALWAYS WANTED TO LIVE OUT MY DREAM OF BEING A MURDERS ♥♥♥♥♥ AND ALSO NOW WHEN IM PLAYING THESE SORTS OF GAMES I MAKE SURE NOT TO LEAVE TO MUCH OF A MESS ;)",
            "review_score": "1"
        },
        {
            "review_text": "Time it takes to clean my actual room: 5 - 15 minutes  Time it takes to clean one level: 45 min - 2 hours   10/10 would make cleaning games my priority again.",
            "review_score": "1"
        },
        {
            "review_text": "Spends 3 hours cleaning a level top to bottem Checks entire level with sniffer and even does stacking challanges Clocks out 99% the level Redo the entire level Clock out again 98% the level this time  11/10 would rewaste hours recleaning",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "*will clean up entire bulding* *wont clean up room*",
            "review_score": "1"
        },
        {
            "review_text": "Funny to play with friends! :)",
            "review_score": "1"
        },
        {
            "review_text": "Pros : Nice concept, Pretty easy, Multiplayer, Relaxing, Devs really working ! Cons : I can play only 6 hours a week or it become boring  In fact, really nice game, and the 4 pack include the original game plus the santa's rampage and shadow warrior. (bought during the alpha ... don't know if it's always the same)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 its great.  But.. Not for what you think.  Ive seen people say this game is ocd simulator, which it is, but still. thats not all  If you play this game and just clean the levels and dont dig deep, you will maybe play this game a week.  If you dig deep and get into the lore and find out about bob, or go achivement hunting, it gives you more reason to play.  I have over 500 hours on this game and I still love it.  You should to.  More spaces.  More lines.  Cause OCD.  Thus why I like this game.  Its g8 m8.  I like 8.  8. ",
            "review_score": "1"
        },
        {
            "review_text": "10 out of 10 would clean again.",
            "review_score": "1"
        },
        {
            "review_text": " R ape people's ears while cleaning up a  s hit ton blood and organs. AST MST EST CST PST AST MST EST CST PST AST MST EST CST PST AST MST EST CST PST",
            "review_score": "1"
        },
        {
            "review_text": "Seriously whattt... This game was a surprise... Love it, and continue to play. haha",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  + Interesting 'anti' game; feels like discovering an unlockable play mode in a more 'serious' FPS game  + Good for OCD, Project-oriented, Process-optimization types of folks, or just folks that had more fun in 'serious' games messing around then playing the 'real' game  + Game starts like an actual min wage job. No tutorial; just dumped into the middle of things. So, you have to experiment to learn how to use your tools. First level may turn into an absolute mess/disaster as you do, but it'll be entertaining.  + As you conquer the learning curve, find efficiency methods, formulate plans to tackle certain levels, etc, you get a certain satisfaction of being a pro cleaner. It's more then just mindless grunt work. There's strategy involved, and art form, especially when your cleaning supply machines are located in different parts of the level. (Do you pick up itmes first, and make a mess of the floor while walking every where? Or, do you mop first, but stack up the buckets until you can finally get to the incinerator? How long can you keep using buckets as cut-rate disposal bins until a path is clear to the actual disposal bins? etc, etc)  + Game has lots of potential. Developers say they're planning a mod tool, and being a janitor by yourself at some place during off-hours screams 'potential' in what you could eventually have the janotor do... find secret passages, solve puzzles, etc... all while cleaning. The cleaning scenarios can also expand greatly... have a level where you clean up a government assassination gone wrong, clean a crime scene and alter it to place the blame on someone else, clean up the results of mini-guns consantly holding off an assault on a base, etc ... this game and the concept has so much potential to tap via the Devs and the Fan Community.  ~~~~~~~~~~~~~~~~~~~  Cons:  - I mentioned the potential as a 'pro', but the current levels don't exercise it enough, and as such it's a 'con' for them They don't take advantage of their settings to let you do more then just clean. EG:The Office has a few secret areas. But, other levels don't really have much. You get some back-story, but no exploring, secrets, mysteries to solve, fix major issues, experiment with issues that caused initial catastrophe, etc. Nothing. Just cleaning.  - Unforgiving game mechanics are aggravating at times. EG: buckets tip over too easily making a mess sometimes (even when you're just trying to dunk your mop in them). The welder to seal bullet holes can make a royal mess if not pulsed carefully. Mopping can be tedious with all the buckets you have to haul, etc)  - Malfunctioning tools are also very aggravating. The devs decided to be jackasses by making the bucket and bin dispensing machines spew out body parts every now and then, but they do it way too often to be funny; just aggravating. Also, the platform machine that lets you clean higher surfaces malfucntions every other time you use it, from minor jams to major errors that will send you and anything on it flying. This happened 3 times in a row while I was trying to use it, spilling the gear I had on the thing. All of this is 'haha' funny the first time ('lol, this is just like a real-life min wage job with tools that hardly work.') But, it's just a huge PITA afterwards. They need to make an option to turn it off, so folks that just want to zone out with the game don't have to worry about faulty equipment ruining the experience.  - Some levels are designed to purposefully be aggravating. Some have layouts where you need to carefully plan your cleaning, since the machines are in different rooms. But, some levels have the incinerator on one side of the level and the bin/bucket machine on the other. This just creates this massive annoyance of having to spend hours walking back-n-forth ad nauseum. It's not fun, especially when the bucket machine dumps a bucket due to poor ability to grab/operate things.  - The welder in general deserves special note, because it's so tedious and time-consuming to use. You can't just blast a wall with it, otherwise it makes a huge mess of soot that you have to mop up. Plus, you have to blast each individual bullet hole or indention separately. Make it where it mends everything in a 4'x4' vacinity or something. IE: the welder should be akin to more of a 'magic wall eraser' instead of an actual spot welder. Some levels have like 30 bullet holes in a tiny area, and you will waste a good 10 minutes just zapping your welder. It's boring, there's no strategy to it, and it makes me want to stop playing certain levels.  - Game really needs some kind of progression. You go through levels, and you can get some awards that stack up in your Office. But, you don't get any money, so you can't upgrade your tools. You don't have a skill, so you can't get better at mopping (other then just learning how to do it better as a player). The Office needs to get fleshed out as a trophy room much more by letting you solve certain hidden goals or activities in levels (more then they have now), then The Office gives you a display case showing a progression. Likewise, make the game a campaign. Let the player start off with small messes, then work their way towards larger levels with more interesting dynamics, better gear, so forth. In this way the small levels can act as a tutorial. It just seems like the game needs some kind of progress to feel like you're working a career instead of isolated instances.",
            "review_score": "1"
        },
        {
            "review_text": "Just bought it....swept up some 500 gallons of blood, 34 heads, and a weird alien body part. 11/10 would sweep again.",
            "review_score": "1"
        },
        {
            "review_text": "I could be cleaing my own house but instead I'm cleaning up body parts pretending to be a space janitor.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! this is one of my favorite, a great game to play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "I have never hated buckets with a passion before and then I played this game.",
            "review_score": "1"
        },
        {
            "review_text": "its just Janitor Simulator with carnage.... I'm not OCD, but why can't I stop playing this?",
            "review_score": "1"
        },
        {
            "review_text": "I work part time cleaning up a grocery store.   This game help me take my mind off it.",
            "review_score": "1"
        },
        {
            "review_text": "Be the poor sod who has to come through with a mop &amp; bucket after B. J. Blazkowitz goes on a Nazi-flavored rampage (or some other suitably disgusting, blood-gorged disaster).",
            "review_score": "1"
        },
        {
            "review_text": "It's oddly cathartic, and incredibly satisfying when you get a 105% clean rate. Cool to play when nothing else is really grabbing your fancy. It's got multiplayer, so it's also a cool chillout game to play with friends while you shoot the ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Who knew cleaning could be so much fun ! That's not what my mom would say... +_+",
            "review_score": "1"
        },
        {
            "review_text": "Knocking over buckets full of blood can end friendships",
            "review_score": "1"
        },
        {
            "review_text": "beast",
            "review_score": "1"
        },
        {
            "review_text": "You will probably think this game is boring and wonder why it exists. You probably think playing a game about being a janitor would be so boring. Nope. This game is so much more than 'Janitor Simulator 2015'.  Pros:  - Good representation of being a space janitor - Mechanics and systems are rewarding - Plenty of maps to complete - Steam workshop for even more levels - Amazing multiplayer  Cons:  - Physics tend to glitch out sometimes, making cleaning a pain - Rarely find any public multiplayer servers up, most servers are private  Being a space janitor is more fun than it sounds, and this game has taught me that.",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the price. It is oddly satisfying to sit there for hours cleaning up gore. Co-op mode is a blast too.",
            "review_score": "1"
        },
        {
            "review_text": "Me and my brother played for the whole afternoon. it was okay. we're qualified to be Clean up details for NASA in the future!",
            "review_score": "1"
        },
        {
            "review_text": "I could be cleaing my own house but instead I'm cleaning up body parts pretending to be a space janitor.",
            "review_score": "1"
        },
        {
            "review_text": "A nice game, has the same relaxing feeling as Euro Truck Simulator. It is also really satifying seeing a newly cleaned room. Recomended to anyone who has OCD and loves cleaning.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, and a tip if you can't run it and just installed it:  Restart your computer, it helped me.",
            "review_score": "1"
        },
        {
            "review_text": "Who Knew cleaning would be so much fun?  11/10 would be a Mom again  How to be a Mom Simulator.  Overall a very good game... I loved santa's rampage and this game even has a steam workshop WHAT ELSE DO YOU WANT?",
            "review_score": "1"
        },
        {
            "review_text": "good for podcasts or just relaxing. have spent too many hours tidying up science facilities and the like, it's a neat concept. being able to work on something for a while and step back and see the progress is incredibly rewarding. i'd reccomend you'd buy it, that is if you can run it.",
            "review_score": "1"
        },
        {
            "review_text": "100% Cleanup, Took 5 hours, and did it alone. This game is great",
            "review_score": "1"
        },
        {
            "review_text": "If I put this game on my resume will I be able to get a janitor job? Probably not.",
            "review_score": "1"
        },
        {
            "review_text": "Bring This TO LINUX!",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunally i clean more in this than i clean my own house ._.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure what it is about this game that makes it fun, I'm really not. But It's fun. If you want to try something strange and unique, VCD is the right choice :)",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game to let my OCD shine. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "10 out of 10 would clean again.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes I am cleaning things and my friends hit me on the back of the head with a mop and I die.",
            "review_score": "1"
        },
        {
            "review_text": "It's very good, i like to clean-up. :)",
            "review_score": "1"
        },
        {
            "review_text": "A game where i can sit on my butt, and still clean? Yes please!",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game to let my OCD shine. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "When you'd rather clean in this game than in real life...  You know it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "2 LIT M8'S BE WARNED  lit/10~ign",
            "review_score": "1"
        },
        {
            "review_text": "Mop some ♥♥♥♥, pick up some ♥♥♥♥, fix some cracks and ♥♥♥♥, repeat. Basically game of the year 2015. runestorm pls add throw button",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun game.",
            "review_score": "1"
        },
        {
            "review_text": "It's surprisingly fun for a game where you clean up the aftermath of gory sci-fi encounters, especially in co-op. Viscera Cleanup Detail will leave you repeatedly asking the question, 'How did blood even get up there?!'",
            "review_score": "1"
        },
        {
            "review_text": "There is something deeply calming and soothing about moping up blood and removing peoples internal organs in a furnace. In game too ; )",
            "review_score": "1"
        },
        {
            "review_text": "Spent more time cleaning in here then I do in real life.   10/10 would waste time again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the perfect thing to play after a busy day. It's calming, therapeutic, and just plain enjoyable. You basically play as a disposable space janitor cleaning up messes made by the hero of some other game. Each level has it's own set of messes to deal with and have obstacles to hinder your cleanup efforts in ways that make them each unique and fun to work around (throwing things out of an airlock to get rid of them, for example).  I highly recommend this game to people who are perfectly fine with something different every once in a while.",
            "review_score": "1"
        },
        {
            "review_text": "Bucket Spill Simulator 2015  10/10 Would spill buckets with a friend again.",
            "review_score": "1"
        },
        {
            "review_text": "Perfection -ism. Mind♥♥♥♥ -ism. What the hell is going on -ism. I won't cleanup my apartment but i'll clean this m♥♥♥♥♥♥♥ for no reason -ism.   10 out of mop.",
            "review_score": "1"
        },
        {
            "review_text": "It's very good, i like to clean-up. :)",
            "review_score": "1"
        },
        {
            "review_text": "an interensting game , perfect for playing while you listen to a podcast",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would clean again.",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "Strangely satisfying. I find this game quite relaxing despite the gore. Would reccommend.",
            "review_score": "1"
        },
        {
            "review_text": "fun to play with friends nothing like cleaning up gore festering facitlities with people you like",
            "review_score": "1"
        },
        {
            "review_text": "i literally quit my job as a janitor to p lay this game. should be game of the year imo.",
            "review_score": "1"
        },
        {
            "review_text": "I love cleaning in reality. ****ing Love it more in a video game. 10/10 Would scrub off the blood again.",
            "review_score": "1"
        },
        {
            "review_text": "Too hard and scary 5 me",
            "review_score": "1"
        },
        {
            "review_text": "You could say i spend a considerably amount of time on this game. I will tell you if it was worth the while. (Singleplayer Experience)  It was at the beginning really funny to check out how the game works  And see the scenery of the game. They hid nice stuff and also had a funny story to tell. And i bet it is really funny with more people  It just happened that the developer care for this game so no downvote D:  After a while however you notice those physic bugs which are kinda annyoing and also very frustrating. Plus all the Dispenser for Water and carry boxes were really bad distributed and could hold almost nothing. I felt myself spending more time cleaning after my own mess than take care of the actual mess. Archievements were more of a tryhard one than fun ones to get. It felt like the game try to be funny but at the same time a good cleaning simulator.  At the end of the day i will only try to get the archievements but never look back again at the shiny but broken game it was/is  Yeah I'm a real tryhard Janitor....",
            "review_score": "1"
        },
        {
            "review_text": "If you ever find yourself listening to a podcast or audiobook, and want something to do while you listen, this game is for you. Or, if you like to bother your friends, you can always play multiplayer and sneakily sabotage everything they do. This game is great for both.",
            "review_score": "1"
        },
        {
            "review_text": "Literally one of the most relaxing games you can play. It's a pretty simple premise, there was a gigantic space battle like thre always is in video games but the space bttle is over and you have been hired to clean up after the space battle. With all the blood, gore and, yes, viscera. It can be pretty fun and you can do it with more than one person",
            "review_score": "1"
        },
        {
            "review_text": "A very relaxing game I don't really like cleaning in real life but this game is different. You can try to beat your score by finishing the level as fast as possible. Making sure you didn't forget ripped heads, body parts, bullets, empty bags of chips, and much more.  It's great to start a level and everywhere is a freaking mess, when you clean that up you see the progress you make, it's hard work but it's rewarding. It's one of those games you don't see often, you can play with someone and have a great time with funny moments.  There might be still some little glitchs and lags but the devs are working on it and each time the game is getting better. Give it a try if you feel it is for you, all I can say is I don't regret it and there should be plenty of more maps to come with the workshop that I can't wait to play once more. For now I give it a 7 out of 10, which is a good game, but it needs more stuff, more levels, better online, and things like that, when all of this will be done then I would give it a 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game i just want to play with my friends and my Brother BUT it won't let me I have looked up this issue and SO MANY PEOPLE still have it. when trying to join a game with friends It Pops up saying connecting then it fades and nothing happens i am still on the main menu. people have had this issue for so long and I really would like it to be resolved this is obviously some sort of bug and it needs to be fixed I am not going to download hamachi to play multiplayer  Please fix this issue when u can because it has been around for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Went into this game not knowing what to expect. 4hrs later, im blown away!! so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Finally my dreams of cleaning up thousands of human and alien corpses is playable.",
            "review_score": "1"
        },
        {
            "review_text": "  Cleaned an entire map and still got fired in the end. 10/10 I love this game",
            "review_score": "1"
        },
        {
            "review_text": "There's blood everywhereeeee, must need a good team of cleaners to clean this mess up :)",
            "review_score": "1"
        },
        {
            "review_text": "Be the poor sod who has to come through with a mop &amp; bucket after B. J. Blazkowitz goes on a Nazi-flavored rampage (or some other suitably disgusting, blood-gorged disaster).",
            "review_score": "1"
        },
        {
            "review_text": "It's oddly cathartic, and incredibly satisfying when you get a 105% clean rate. Cool to play when nothing else is really grabbing your fancy. It's got multiplayer, so it's also a cool chillout game to play with friends while you shoot the ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "You could say i spend a considerably amount of time on this game. I will tell you if it was worth the while. (Singleplayer Experience)  It was at the beginning really funny to check out how the game works  And see the scenery of the game. They hid nice stuff and also had a funny story to tell. And i bet it is really funny with more people  It just happened that the developer care for this game so no downvote D:  After a while however you notice those physic bugs which are kinda annyoing and also very frustrating. Plus all the Dispenser for Water and carry boxes were really bad distributed and could hold almost nothing. I felt myself spending more time cleaning after my own mess than take care of the actual mess. Archievements were more of a tryhard one than fun ones to get. It felt like the game try to be funny but at the same time a good cleaning simulator.  At the end of the day i will only try to get the archievements but never look back again at the shiny but broken game it was/is  Yeah I'm a real tryhard Janitor....",
            "review_score": "1"
        },
        {
            "review_text": "This game pushes your nerve, especially when you knock over a bucket of blood. But that's the fun patience and stupidly funny mistakes. No matter how you cut it this game is one of a kind.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really addictive and fun great for people with friends to bad I only got one friend so its alright for me, great for nerds really grat for them kids.",
            "review_score": "1"
        },
        {
            "review_text": "What a bloody mess  10/10 would clean again.",
            "review_score": "1"
        },
        {
            "review_text": "This game gives you your own office. I realized you could bring stuff from jobs to your office. I collected many heads and stored them all around. And painted my office red.",
            "review_score": "1"
        },
        {
            "review_text": "This game hits a certain feel to me, probably because I played Super MArio Sunshine and Chibi Robo when I was really young. I just have to clean everyting!",
            "review_score": "1"
        },
        {
            "review_text": "This game was surprisingly fun when you played with your friend! :-D",
            "review_score": "1"
        },
        {
            "review_text": "Brilliantly revolting, disgustingly perfect, Viscera Cleanup Detail is a stinking, putrid mess of serenity and beauty wrapped up in the perfect package of an interactive game. In short, you get to clean up the guts and gubbins of all those who failed to survive in a sci-fi movie. That may sound ridiculous and abhorrent in writing, but when you get down to the nitty gritty of the matter (brain matter, fecal matter, you name it), you find that Viscera really does have a knack for keeping you enthralled in the sterilisation of a beautifully repugnant science fiction disaster. The ultimate hot mess.",
            "review_score": "1"
        },
        {
            "review_text": "This game really sates my OCD and urge to want to mop my house even though I have carpeted floors. It's time consuming and don't expect to finish any decent sized map in a couple hours. ((I only have low playtime because I play offline. ))",
            "review_score": "1"
        },
        {
            "review_text": "I've never experienced such janitorial zen. I wish we could get a tv series lol",
            "review_score": "1"
        },
        {
            "review_text": "This game is strangely mesmerising, and pretty fun to play with friends. Cleaning an entire area just to walk around the corner to see how much your ♥♥♥♥♥♥♥ friend has screwed things up is as hilarious as it is infuriating.",
            "review_score": "1"
        },
        {
            "review_text": "I use mopping ♥♥♥♥ up in this game as a procrastination tool to avoid cleaning my house.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I've had cleaning ever. 10/10 amazing game to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I've had cleaning ever. 10/10 amazing game to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game to play with friends. Namely while listening to something and talking about it on a call. I can't imagine it being very fun on your own though, so before you invest money in it see if you have some friends to join you with it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really relaxing game. I play it to unwind. No twitch gameplay, and it's satisfying tidying up the levels.",
            "review_score": "1"
        },
        {
            "review_text": "This is very relaxing game and has some great opportunities for laughs and moments of profound frustration when playing with buddys (Voice chat is really a must)  I play this game I think.... I am really glad that you can't smell it....  It's a great title to visit once in a while to just chill out with, the tunes on your in game radio are pretty sweet and at the end of it all you even get the option to fill in paperwork.... which is hilarious....  There are hours to be had in the vanilla maps if you wanna 100% them which is super satisfying and honestly if you don't burn yourself out on this gem of a game you can just come back and do them again... or play the christmas, ninja or workshop levels.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun with friends.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game. I enjoy cleaning, and thought that the mindless, menial in-game cleaning would be fun. It's not. I found the controls to be janky, and for the love of gravy, they need some sort of a 'dustpan' for things like bullets. Picking them, and crisp packets, and tiny bits of people by hand wasn't fun, it wasn't cathartic, it was annoying! There was a small bit of satisfaction when leaving a room 'clean', but all that kept going through my head was: I should be cleaning my own house.   Also: in my own house, I have slightly more control over my body movements so that I'm not constantly knocking over my big ol' bio-bin full of assorted nasties. Not that I have a bio-bin full of assorted nasties, mind you.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a great idea behind it, but it has enough flaws to receive a negative review from me. Here's why:  - No optimization whatsoever (I can't run it on full details with my GTX 980) - Extremely ANNOYING thing: Whenever you click on the bucket or box dispensers, there's a high chance body parts come out - Many times, blood squirts are almost invisible, through which you are required to annoyingly search every spot on the map to be able to get a 100% rating - Cleaning buckets behave very weirdly, they fall over for no reason whatsoever sometimes - Picking up bullet shells is extremely tedious  ",
            "review_score": "-1"
        },
        {
            "review_text": "It's exactly what you'd expect: a bunch of messy levels to clean up. No more, no less. There is some lore and secrets to be explored that make it a little more interesting than that. However that's not what bothers me about this game. The main crucial drawback is the broken multiplayer and the total absense of public servers. If you want to play this game, make sure you have some friends ready to play with you and possibly a few hours to set up the damn thing to work. It supports splitscreen, which is always a plus, but it really gets fun when you're more than 2 players.",
            "review_score": "-1"
        },
        {
            "review_text": "im extremely ticked off. ive done everything in my power to get this game to work. anything you can thinkof i've done it. i wouldn't buy this game ATM due to the fact everytime i open the game it says the UDK isn't working. sad part is ive had the game too long to get a refund prob.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this game would be interesting, despite my general avoidance of simulators. Why the hell I thought a CLEANING simulator would be any better is beyond my own comprehension. There is no progression, nothing to get, the most you can do is put stuff in a trunk and take it back to your office. It's funny to read a few notes after some jobs (so you got cut in half tripping over a barrel that was turned over when I got there?), but this game is so stale after a while. There is nothing to reward you for doing stuff. Your better off cleaning in real life, because at least THAT has a reward. Maybe if they addded some incentives to the game, it might last a few hours longer, but not in it's current state.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a janitor simulator built in UDK. Really not much else to say, crazy physics errors and insanely tedious janitor-ing. Buy it on sale if you need a game to put you to sleep but still feel satisfied that you're doing things.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game hoping to play with friends, however whenever i try to join them it just says ''Connection Failed''. My Connection isnt bad as i can play with them any other game and i know someone who has the same problem as me. I reinstalled it but still didnt work!  Dont buy this game unless you plan to play Single Player as Multiplayer obvously isnt finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Is there a problem with steam refunds on the website?",
            "review_score": "-1"
        },
        {
            "review_text": "feels more like work then an actual game.",
            "review_score": "-1"
        },
        {
            "review_text": "Unable to connect to my friend via him hosting and vice versa. Done the port forwarding and yet its still unable to connect. Waste of money if you want to have a co-op game.",
            "review_score": "-1"
        },
        {
            "review_text": "very slow, laggy and leaves pc frozen after quitting, i enjoy when the game when it is working though.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an enjoyable game, that's if you can get it to work. I dont enjoy the game single player and think its great with friends, however - I wouldn't say this game had a multiplayer option. To get this to work for us (which only happened twice out of 10's of trys) we had to create ports, join in spesific orders, one of us had to have our games closed in order for all of us to join, only one person could host and it was very laggy. I would recommend this to anyone and everyone if this issue was fixed, but as this game is now I strongly recommend that you don't buy it, unless its on sale for about £2.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really my thing. Too tedious for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I don\\'t see the appeal of a cleaning simulator  feels like work, not a fun game",
            "review_score": "-1"
        },
        {
            "review_text": "It sucks.  Oh my god it sucks.  This is the worst thing to ever happen to the planet earth. I mean like...  YOU LIKE UUH... CLEAN UP IN THIS GAME?? WHY WON'T YOU DO IT IRL AND CLEAN UP YOUR MESS AFTER YE WANKED YA ♥♥♥♥♥♥♥!?  ♥♥♥♥in ♥♥♥♥♥♥. Unbelievable.",
            "review_score": "-1"
        },
        {
            "review_text": "The concept was great. The intent was great. I love innovation and developers trying new things. However, the execution fell apart to where the game's flaws outshine any fun that might be had trying to play the game. When it feels like doing the actual physical work that the game entails is easier and more satisfying that playing the game, it's hard to keep going. I hope they look at the issues and make a sequel that addresses them. When they do, I may give it another shot, but I can't with what they put out.",
            "review_score": "-1"
        }
    ]
}