{
    "app_id": 247370,
    "name": "Mutant Mudds Deluxe",
    "release_date": "2013-11-21",
    "developer": [
        "Renegade Kid"
    ],
    "publisher": [
        "Good Shepherd Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Indie",
        "Action"
    ],
    "achievements": 10,
    "positive_ratings": 328,
    "negative_ratings": 114,
    "price": 6.99,
    "description": "Love pixels? Fond of platformers? Is there a special place in your heart for the 8-bit and 16-bit era? Want to have fun? Yes!? Well, you’ve come to the right place, my friend. Mutant Mudds Deluxe is a “12-bit” action platformer full of pixels and platforming fun!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/247370/header.jpg?t=1529538007",
    "minimum_requirements": "OS: Windows XP / Windows Vista / Windows 7 Processor: 1.8 Ghz Memory: 512 MB RAM Graphics: 3D Graphics Card DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": "Memory: 1 GB RAM",
    "reviews": [
        {
            "review_text": "Classic games never go out of style. It’s why we keep going back to them, and why their design influences the cutting edge games coming out in the modern age. Mutant Mudds Deluxe– a Wii U port of a 2012 3DS eShop game– may seem like an anachronism, as it doesn’t appear to be any sort of recent game at all. It looks, plays, feels, and sounds just like a title at least 20 years older. However, it holds the retro gameplay and aesthetics up as its foundation, and is a great modern game.  If you’re familiar with the original Nintendo 3DS version of Mutant Mudds, then you know what’s up. Evil mutant mud monsters have come to Earth, and its up to Max to save the day. Armed with a water gun, a jetpack, and the ever-watchful eye of his Grannie, Max has to platform through many levels to stop the muddy menace. Mutant Mudds Deluxe keeps every bit of the nail-biting platform goodness intact from the 3DS version, with some notable additions and changes.   So, what’s Mutant Mudds Deluxe got that the 3DS version doesn’t? This version of the game adds an entirely new mirror world, with darker versions of the game’s main 20 levels. These worlds feature ghost enemies that are unkillable (without the aid of a special gun that has limited shots) and must be dodged. It adds yet another layer of difficulty to the already tricky terrain featured in Mutant Mudds, and augments the main game a good bit. The special levels featuring Grannie from the DLC of the 3DS game are also available in the package (they are stupidly difficult). All in all, there’s about 80 levels to conquer, an impressive amount of content.  One little thing that also makes a big difference in Mutant Mudds Deluxe is the addition of checkpoints to the levels. Mutant Mudds is an often brutally hard game, and the original release made you restart the entire level over if you met an untimely death. The checkpoints in the PC version really helps ease frustration. But if you are the masochistic type, you can always turn them off from the main menu.  But some improvements in Mutant Mudds Deluxe aren’t in the actual content; it’s all in the delivery. Deluxe enjoys the inherent benefits of being on a PC, such as improved control inputs and better visuals. The pixel worlds have flawless detail with the high definition. This also allows the visible game display to be much larger than the 3DS screen could offer, so you can see much farther around your character, which makes some of the challenges a lot more manageable.  Now, if you’re not already a platforming fan, Mutant Mudds Deluxe probably won’t change your mind. But if you just want some good old-fashioned jumping challenges, this is a great game to play. It can indeed become repetitive when you get stuck, but the compelling gameplay wins out in the end. Going for the 100% level completion doesn’t feel like a chore at all, and Mutant Mudds consistently raises the bar in terms of difficulty as you advance. If I had to nitpick one thing, I’d ask for a run button. Sometimes Max feels like he’s walking terribly slow, and there is a time limit on the levels.  For new players of Mutant Mudds, I would wholeheartedly recommend Deluxe. However, if you already have it for 3DS or Wii U you have to ask yourself if the addition of checkpoints and the extra ghost levels is worth buying the game again. Either way, PC has gained an excellent and unabashedly retro platformer in the form of Mutant Mudds Deluxe.",
            "review_score": "1"
        },
        {
            "review_text": "Mutant Mudds is one of those games I feel like it only gets positive praise just because it's based on the NES classics. If you look past the fact it's based on NES games you just end up with one of the most boring platformers I've ever played.  First off the game has really stiff controls which makes the platforming harder than it needs to be as it almost forces you to use the jetpack for every single jump you make. I feel like if the character's speed increased a bit like to around Megaman's walking speed it would help make the controls more responsive for a platformer like this. The level design is the typical get from one end of the level to the other end while dodging enemies and 3D thwomps, which I would be ok with but it stays the same through out the game with next to no new gimmicks added in every world.  On your way you get diamond pieces which there are 100 in each level and these star pieces with one at the end of the level and one in a secret room. In order to beat the game you have to collect all of them. So if you miss some collectables by the time you beat all the levels you are going to have to backtrack and get the collectables you missed because without those you are not going to beat the game.  There are upgrades you unlock during your journey but you can only carry upgrade at a time, and you're going to need them in order to access the hidden areas. The upgrades include a jetpack upgrade which has your jetpack last alot longer and a gun upgrade which has your gun deal more damage and also break certain yellow walls. So if you find the door which leads you to a hidden level and you don't have the upgrade to get to it....you have to exit the level, equip the upgrade and go all the way back to where you found the level. This can get tedious very quickly especially when you're in the backtracking stage of your playthrough.  Speaking of hidden levels, these doors you find in the middle of a level take you a challenge room where everything is either black and white or red and black (because virtual boy) and....they the same as the regular levels....nuff said.  SPOILER ALERT: So what do you get for getting all the collectables in the game.......NOTHING because the game just ends. No final boss, no final level, just ends and shows credits. After you get beat the game you unlock the nerd's grandma which has all the upgrades you had to switch through equipped. There are also some harder versions of levels you completed but at this point I just stopped caring about this game.  This game has a major problem where it gets boring after a while with the same enemies and level gimmicks being pasted over and over again, the collectables don't even help make the game more fun as it just adds more tedious gameplay to drag it out. Doesn't help that there is no boss fights to test your skills on.  At the end of the day it's just a boring, generic platformer that just happened to get tons of praise (and a Wii U sequel in the works) just because of it being 8bit. If you want to play a retro platformer then I don't recommend this. There are much more enjoyable 2D platformers to play including retro ones.  Infact here are some I recommend over this which are available on steam: Freedom Planet Shovel Knight Ducktales Remastered Megaman 1-6 via the Legacy Collection Sonic the Hedgehog 1-3 &amp; Knuckles Rouge Legacy Rayman Origins and Legends  If you really have to get this game then I recommend wait for the game to come on sale as it's not worth the £7 price tag even if you're a NES fanatic.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a game. It's not really that fun. It's more annoying than anything. I would almost enjoy it if the input to do the high jump was more forgiving. Honestly it works like 40% of the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Would I recommend this, yes.  But there are some issues on to it. Here are my pros and cons.  Pros: There are good bit-chip tunes in the game, yes everyone recommends the tunes the most, the game gives a nostalgic feeling on the NES and Game Boy, a very great plot into the story.  Cons: If you have a bad computer, it would most likely lag for you. The controls are kind of difficult, but they are ok.   If you like retro and nostalgic games, this I would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what bundle I got this game in but this was a great find in my library. I installed it and let the madness ensue. For one, you're character, Max, plays well. The player can allow Max to jump, fire his water gun, or move left or right. Now the whole game you are collecting these water jewels and there are forty in total. In order to get some, you'll need to unlock and use some of the upgrades, one at a time unfortunately, like a vertical leap, increaed hover, and power shot. The game at this point is easy, with enough difficulty that it can allow wiggle room for. You'll die a bit but will get the gist of the level eventually. That said, the deluxe version of this game includes dark levels. That is, all the enemies are unkillable, unless you have access to a special gun which only has ten shots on it. The level is also much harder and I must say, these levels are frustrating. I don't think it was a good idea having the enemies invincible as it creates jumps which are almost impossible without taking damage or tricky platforming. That said, the Granny medals, probably supposed to be the harder thing to get, were surprisingly fun. I mean, there was a difficulty to them but it was enjoyable to figure out and play. Also, before I forget, Granny has access to all power-ups, not just one at a time. Ok, overall, this indie game is very enjoyable in actuality. The dark levels are very frustrating and grating but the rest of the game is great. I'd pick it up if you could, though maybe take the dark levels slowly.",
            "review_score": "1"
        },
        {
            "review_text": "10/10   Its pretty neat!",
            "review_score": "1"
        },
        {
            "review_text": "pretty nice game tho.",
            "review_score": "1"
        },
        {
            "review_text": "IMO the best platformer on Steam. Quite challenging in the later levels, but always rich in variety. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Mutant Mudds Deluxe is a not-so-original platformer where you jump back and forward between landscapes, all the while shooting mutants and collecting coins. Rayman Origins/Legends does it 20x better so I suggest you pick up one of those two. They have way more content (obviously, because of the bigger teams) and are generally more fun to play.  [Rating: 65/100]",
            "review_score": "-1"
        },
        {
            "review_text": "I like HOT Double-D Lady! 12 pack of beer! and this GAME! GOTY!",
            "review_score": "1"
        },
        {
            "review_text": "This game ruined my sanity. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The control in that game are so stiff that it makes it stressful and annoying, plus there are very few upgrades so it gets boring. the big question is why so much praise !!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Mutant Mudds Deluxe brings us back to the 8-bit and 16-bit era. This game gives a simple story, a simple concept, and let's not forget, it was inspired by an awesome game I like, Virtual Boy's Wario Land. By far one of the best platforming games I've played in a long time. :)",
            "review_score": "1"
        },
        {
            "review_text": "i like it just missing sound effects :/",
            "review_score": "1"
        },
        {
            "review_text": "You have to time every ♥♥♥♥ing jump to ~ 100 ms accuracy or you are dead. Great concept, disturbing difficulty.",
            "review_score": "-1"
        },
        {
            "review_text": "Never thought I would spend so much time on a platformer game... Well done Renegade Kid, this game has opened an entire genre of games to me.    Thoughts",
            "review_score": "1"
        },
        {
            "review_text": "Mutant Mudds Deluxe is a really bad platformer. Trying to make tight jumps in the beggining is irritating but you quickly earn a powerup that lets you fly past 90% of the levels. this powerup however is very unresponsive. there was no creative level design. if you couldnt simply fly past with the powerup gameplay consisted of jumping to a platform sitting on it for a minute while you shoot all the enemies up ahead and then jumping to the next platform. the '3d' gimmick was used to no effect the most it did was put foreground objects so you cant see.  This game sucks i dont know why i finished it 100%. It was a decent time waster. I got it in the humble bundle with the MUCH better (my favorite) platformer dustforce. Get that instead. Do not get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend it for those who want to waste their life, or rage quit after playing some time...",
            "review_score": "1"
        },
        {
            "review_text": "Mutant Mudds Deluxe: Is a 2D plattform game with a few enemies in it. You can kill them with a gun that you have from the beginning. It's not a really fun game to play but maybe if you are very bored. It's not really a story based game, just maps you play through with no actully story. The game is really slow with a charater that isn't able to run, it make's the gameplay really slow too. They don't show you the controlls so you have to learn them yourself while playing. So overall I didn't like the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Cant recommend this game at all....graphics are stale and boring and game play is just terrible. You can jump and shoot...wow. This game is not retro or old school...its just a poor imitation of that.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a pretty standard platformer. There's nothing very offensive, there's nothing very good. I'd say it was worth the dollar I paid for it I guess, but any more than that and I'm not too sure.   It's really slow, but it plays all right I suppose. The music is almost good, nothing really memorable. The artstyle is almost good, nothing really memorable.   It's just a very inoffensive game with nothing that really makes it stand out from other platforming games. Try it out if its really really cheap and you've gone through your other platformers",
            "review_score": "1"
        },
        {
            "review_text": "This game was originally made for N3DS, that's why it looks and feels so different than normal games. The landscapes thing was made for a 3D screen.  Though, I recommend this game, I loved it in 3ds and I still feel the same with the pc version, the art, music and everything is unique in its own way. It would have been nice to have an option for 3d screens.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little platformer that borrows the mechanic from Gargoyle's Quest. Thumbs up.",
            "review_score": "1"
        }
    ]
}