{
    "app_id": 24740,
    "name": "Burnout Paradise: The Ultimate Box",
    "release_date": "2009-03-12",
    "developer": [
        "Criterion Games"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Open World",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 9739,
    "negative_ratings": 1487,
    "price": 9.99,
    "description": "Download Burnout™ Paradise: The Ultimate Box today. Paradise City is the largest and most dangerous setting yet for the best-selling Burnout series. The massive setting gives players an open-ended world to explore, as they race their vehicles through hundreds of miles of roads and underground passages with more than 70 different cars.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/24740/header.jpg?t=1450909984",
    "minimum_requirements": "Supported OS: Windows XP (SP2), Windows Vista Processor: 2.8 GHz Pentium 4 XP / 3.2 GHz Pentium 4 Vista Memory: 1 GB RAM XP / 1.5 GB Vista (2 GB recommended) Graphics: DirectX 9.0c compatible with Shader Model 3.0, requires 128 MB or more and contain one of these chipsets: Nvidia 6600 or greater, Radeon X1300 or greater Sound: DirectX 9.0c compatible Hard Drive:  4 GB of free space or more  ACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO PLAY.  ACCESS TO ONLINE FEATURES AND/OR SERVICES REQUIRES AN EA ONLINE ACCOUNT AND REGISTRATION.  REGISTRATION FOR ONLINE FEATURES IS LIMITED TO ONE EA ACCOUNT PER GAME AND IS NON-TRANSFERABLE. EA ONLINE TERMS &amp; CONDITIONS CAN BE FOUND AT <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.ea.com\" target=\"_blank\" rel=\"noopener\"  >www.ea.com. YOU MUST BE 13+ TO REGISTER FOR AN EA ONLINE ACCOUNT.  EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.ea.com\" target=\"_blank\" rel=\"noopener\"  >www.ea.com.  INCLUDES SOFTWARE THAT COLLECTS DATA ONLINE NECESSARY TO PROVIDE INGAME ADVERTISING.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Burnout Paradise is an open world, survival horror game developed by Criterion Games, who are most known for making popular racing titles. The game is set in a horrific post-apocalyptic city, ironically called Paradise City. I can assure you however, there is no paradise to be seen in this hellish landscape.  You play as an unnamed, sentient car. The game revolves around completing the same missions over and over in order to upgrade your licence, to prove that you are king of the cars. The missions mostly involve destroying other cars, however, there are some racing elements involved here and there. As a working class peasant who cannot afford a luxury sports car, this appeals to my deep seated resentment of people who have more money than me.  [SPOILER ALERT] The story is fantastic. Towards the end of the game, you discover that you are not the protagionist at all. In fact, you are the villian. The real hero of the game is a DJ driven to madness named Atomica. Who has been broadcasting Paradise City's only radio station the entire game. His true motives are to get all of the cars in the city to destroy eachother, so that he can free humanity from its chains and rebuild society. Many games have tried to copy Burnout Paradise's clever plot twist, and have failed miserably. Ken Levine, eat your heart out. You can never hope to recreate this masterful storytelling.  In summary, Burnout Paradise is a masterpiece. There isn't a single game in existence that can match its artistic calibre. So I award this game ten out of ten cars. You will never get TYRED of this game.  (A lot of people are leaving comments pointing out the similarities to Yahtzees review. Fine, but Yahtzee wasn't the only person to think of this. This was meant to be a small joke amongst friends that just happened to get popular. Whining won't make me take it down.)",
            "review_score": "1"
        },
        {
            "review_text": "This is a great racing game that's all about driving in the open world of people-free Paradise City, of which the title song claims has green grass and pretty girls. Along the way, you'll be bombarded with advertising billboards for such things like Burger King, EVGA motherboards, Crash FM, and this very game. Sadly, you can only demolish one of these billboards, which keep reappearing continuously. Somehow, I feel real sorry for the cleanup crews having to fix up the damage caused by driverless cars. It's like Twilight Zone stuff, man!  While you repeat the events that you've already cleared with each new license, you get to hear a selection of licensed songs that usually repeat a pretty good deal. Or you can listen to past Burnout songs from a time Acclaim published those games. Maybe you just feel like listening to that Avril Lavinge song over and over. Did you know that song was also in Burnout Dominator AND in multiple languages? There are also classical songs in the game, but nobody listens to those. ;)  The damage model is quite glorious, parts flying off, cars flipping about, and [my favorite /s] the game going into super slow motion because you were too slow in reacting to a barrier right in front of you. It's like you know you're going to be taunted mercilessly, especially if you crash mere seconds before the time trial expires. But if you feel like crashing into things and causing mass destruction, there is a Showtime mode. It's not quite like the crash modes in previous games, but it counts for something.  Even with the minor flaws like the lack of a certain bit of DLC that the potato consoles got to enjoy, super slow motion crashes that test your patience, and the general grind with each new license, this is still a very enjoyable racing game that people continue to play to this day.",
            "review_score": "1"
        },
        {
            "review_text": "burnout, one of my favorite game, the speed and Brakes so good and the crash was awesome and don't forget the best thing  the music, quantity or quality wise you will not be disappointed. There are a lot of songs that play while driving around so chances are if you play for an hour or two, you will not hear the same song twice :)     -9.5/10-",
            "review_score": "1"
        },
        {
            "review_text": "PSA to everyone buying the game, you can redeem the cd key included with the steam version on origin, where it also has 4 of the dlc missing from the steam version for only $1.50. If the key doesn't work, contact origin support and they should help you like they did me.  (This doesn't include Big Surf Island, as that never came to pc. Google that and I believe there was a mod being worked on to port it to pc, but I'm not too sure how far it got.)  Edit: Also the cops and robbers never made it over either, but the cars did get ported in the same mod that's working on bringing Big Surf Island over.",
            "review_score": "1"
        },
        {
            "review_text": "The DOOM of car games.",
            "review_score": "1"
        },
        {
            "review_text": "I nominated this game for the “Whoooaaaaaaa, dude!” award because it perfectly sums up the entirety of my thoughts while playing it.",
            "review_score": "1"
        },
        {
            "review_text": "the ultimate racing game to me, to be honest wish Criterion decided to continue the series with a new installment",
            "review_score": "1"
        },
        {
            "review_text": "My 'Test of Time Award' goes to Burnout Paradise a game so good, i 100% it twice !  With a huge map full of secrets and so much to unlock it's still the most fun single player racing game ever made.  It's all about speed, taking crazy risks and spectacular crashes like no other game out there !  Such a shame this was the last 'real' Burnout game ever released, i miss you old school Criterion :(   Take me down to the paradise city Where the grass is green and the girls are pretty... ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! But make sure to check the followings before purchase.  - Play game.  -Love it.  -Can't stop playing it.  -Get 0 mark on school.  - Your mom gets angry.  -She doesn't let you play it.  -You are sad.  -Start studing.  -Get 20 mark.  -Your mom gets happy.  -Let you play.  -Everything happens again from the start. ",
            "review_score": "1"
        },
        {
            "review_text": "Burnout Paradise  Story - Ok I'm not sure if this is story mode, but I'd count at it. I'll explain what you gotta do in a sec. There are 5 types of events, Races, Marked Man, Stunt Run, Road Rage, and Burning Routes. Races ~ Pretty self explanatory, race with other cars (or one car) to a point on the map. They're not laps, it's just get from one point to the other. A to B. Marked Man ~ Heavily armoured and fast cars are trying to take you down, you have to get to a destination on your map. It's harder than it sounds. I'm pretty good at racing games and I've failed a coulpe times at this. Stunt Run - You get points for each stunt you make, all you gotta do is do enough stunts to pass the score limit. Road Rage - Destroy a number of cars before the timer runs out. This is my favourite one. Burning Route - It's like a race, except you're on a timer and there are no cars racing you. 'Well then what's the point of this?' If you beat the time limit, you get a better version of the car you own. They're actually quite fun. 10/10  Storyline Length - A long time. Very long. You'll play for days on end.  AI - On everything EXCEPT Marked Man, they're a bit weak and slow and dumb. They're still fun to play against, but I'd love a difficulty setting. 7/10  Experience - You also get to play on a motorbike, which is amazing. Anyway, around 75 cars to get, and like 3 bikes to get. All the missions are fun, and there are even yellow gates to smash through and billboards to destroy! You can also set a time road rule and showtime record on a road. Play the game and you'll know what I mean. This game is awesome. Enough said. 10/10  Graphics - I love them. They're not realistic, but they're not cartoony. They're just as you'd expect a game from a few years back to be. Just amazing. 8/10  Sounds / Voice Acting - The radio is just amazing, I'm not even saying that lightly. It has literally one of the best soundtracks of all time. The DJ's voice is nice to listen to, it grabs your attention and the car sounds are beautiful! Some cars have a different 'rev' sound, which is amazing. Can't quite believe the amount of detail in this game. 10/10  Controls - Ok before you guys start going 'OMG WASD AND ARROWS ARENT WORKING ARHFDGNFHGNFHN' lemme tell you the controls. A ~ Move forward. Z ~ Move backwards. Left + Right arrow keys ~ Turn. I don't know why, but I actually very much like it when the controls are layed out like that. 9/10  Overall - 9/10   Hands down the best racing game I've ever played it. Finished it so many times in the span of a few years. You'll enjoy it. Buy it! It's marvellous!",
            "review_score": "1"
        },
        {
            "review_text": "About Bonus Vehicle Pack DLC: altough you can not buy it on Steam if you have an Origin account with the same email address as the Steam account and buy it on Origin it will show up on Steam too. As for the game itself, it's a 10/10 even without the DLC. Get it !",
            "review_score": "1"
        },
        {
            "review_text": "I'm in my mums car. Broom broom.  Get out me carr!  Aww",
            "review_score": "1"
        },
        {
            "review_text": "Hella fun, especially if bought at a discount.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good games, even if it gets boring sometimes cause you have to run the whole map to start a race..",
            "review_score": "1"
        },
        {
            "review_text": "Great game overall and online is still here, only problem with the pc/steam version is that there is no Big Surf Island dlc and no Steam Cloud support",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. It is a true masterpiece. Of course there is always those slight problems. It is quite a shame that Big Surf Island was never put into this and the Title for the game is quite misleading. Graphics are great as well the the Crashes :3 The Game does have its glitches still and at least some consideration by Criterion Games would we Good. Other than that, Great game though if you do have a PS3 or Xbox 360, probably more recommended to get it on them.",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap this is the best game ever. Thank god it went on sale. I love the multiplayer! Buy this game now no matter what you think.",
            "review_score": "1"
        },
        {
            "review_text": "Really really amazing racing game,tons of fun and man,it's only 5 euros now.If you like racing games and cars this definitely should be in your library.",
            "review_score": "1"
        },
        {
            "review_text": "Has nice cars.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Burnout fun! Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun. Like racing games? Give this a go, fast, action paced, peaceful when you need it to be.",
            "review_score": "1"
        },
        {
            "review_text": "kid playing with matchbox cars, just slamming those ♥♥♥♥ers against each other and throwing them down the hotwheels loop-de-loops",
            "review_score": "1"
        },
        {
            "review_text": "it is a brilliant exiting game and dosent require a expensive graphics card",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game so much. It is just so fun to play :D I especially love that you keep getting new and new cars.",
            "review_score": "1"
        },
        {
            "review_text": "love this game. played it when i was a kid.",
            "review_score": "1"
        },
        {
            "review_text": "I really reccomend this game if you have eyes because if you don't you cant see you ♥♥♥♥♥ing ldiot. I give it a 9/10 because you can't drive a Ford Pinto but you can drive a delorian. Also the traffic cones look like pénises.",
            "review_score": "1"
        },
        {
            "review_text": "Somehow still the best open world racing game ever made.   Multiplayer is surprisingly still alive, but the server is a bit of a recluse. To connect to it, you first need to make an EA account elsewhere.  If you try to log in to Burnout Paradise with this right away, the server will claim it doesn't exist. Instead, 'create an account' though Burnout Paradise,   using the username and passord of your EA account.   The server will now check with EA if it exists, which it does. Tada! The Burnout Paradise server are now aware of your account!  Restart a final time, and log in with your account. A minute or so of loading, and you should be in, and online.  Enjoy your visit in Paradise city!",
            "review_score": "1"
        },
        {
            "review_text": "If you like adrenaline packed races and very good crash physics i recommend you buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "I fell out of driving games for a number of years, but this one looked like too much fun to pass up. And now I'm hooked on them again! This game is so much fun, I almost feel guilty. I'm trying to squeeze a race or a Road Rage session into every spare moment I get. The soundtrack can get a little monotonous after a while if you're not careful, but the gameplay, graphics, sound, car unlocking, achievements, free exploration... it's all just a ton of FUN. I highly recommend this one if you like cars and driving games. I use an XBox 360 Controller on my PC for this one, and it works WONDERFULLY for it. GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "No option for Jihad. 0/10",
            "review_score": "1"
        },
        {
            "review_text": "In mother Ukraine we do not have car, we have to race cat but game like this make me dream of time when eu save us from evil putin.",
            "review_score": "1"
        },
        {
            "review_text": "im just reviewing this for a badge tbh",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable racing game, good car handling and interesting mechanics. I especially enjoined the map design, you can just start driving, and (whitout thinking much) race around, and never hit a dead end.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "much fun very car",
            "review_score": "1"
        },
        {
            "review_text": "One of the best arcade racing games to come out after the Need For Speed Underground 1 &amp; 2 games. However today the game is a bit old, but for the asking price and on a sale, it's still worth it. Both the SP and MP was fun, when I Played it on the PS3. I even got the Platinum trophy. Seems I can't load my stuff from the PS3 to Steam even though, it uses the same EA/Origin account. Back then, I would give the game a nearly perfect score, but today there are newer games out there. Still recommend it though, if you just want a cheap fun arcade racer, to play from time to time.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great racing game. It follows well in the footsteps of the other burnout games, however it is rather limited by only having one large map rather than several small ones. However, this means you can get to know lots of different areas, and hone your expertise that way. If you want to fully complete the game, be aware there may be a lot of repetition. The graphics are very good, and the AI is fairly good.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best open world car games I have ever played, nice cars, great events and one of the most detailed cities in any game ever, and don't forget the crashes!",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't contain all the DLC, which is a ♥♥♥♥♥♥ move, but mods will fix that, its an enjoyable experience however",
            "review_score": "1"
        },
        {
            "review_text": "This is and will always be one of my favourite Games for several reasons. First of it runs very well even on a potato ( Laptop must be 7-8 years old by now, and I do not have lower the settings and it still looks pretty), which is a great plus. Second, this game does not only offer good races, but also Stunts and Takedowns as an option. I mean, who doesn't want to ram his opponent at 200mph into a bus? Third, good music to go with. Drive down the mountainwhile listening to Guns 'n Roses in your golden F-1 car. I did mention you can unlock the cars to be golden, right?",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best racing game I have ever played, or will ever play. I spent so much time in this world, and it was great!",
            "review_score": "1"
        },
        {
            "review_text": "The greatest racing game of all time with or without the DLC, shouldve had all included but dont be such a sour sob this is the bees knees of racing fun. None better greatest of all time , the best game Criterion have ever made. Play it at 60 fps plus at 1080 p and start a road rage of above 25 cars and there isnt anything to compare to it . Its 6 years old and I'm still playing like it was Christmas morning opening a new toy. Dont listen to the pessimists ,this is it the the most diverse and exciting driving game ever, the only driving game to make it into PC Gamers Top 100 games of all time. And you know how picky those ♥♥♥♥♥♥♥s at PC Gamer can be. Go on with ya Cockers and get this game !",
            "review_score": "1"
        },
        {
            "review_text": "An amazing racing game. One of the best in franchise, not to mention the catchy music! Great and fluid controls, lots of missions and freeroam.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Played it on Xbox and now that I'm on Steam, I had to see how it compared. If you like racing games, but like to be able to just drive around, this is the game for you. Burnout Paradise allows you to play the game at your own speed and lets you take control of what tasks you complete to advance to the next level.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and I've played it so much on my Xbox 360... the only thing really annoying is the lack of fast travel and 'Welcome to the Jungle' music repeats too much even for people who like Guns and Roses.  For the current price no one can complain :)",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that is wrong with this game is there is no way of telling how fast you're actually going, maybe this is what the develepors were going for.  After you unlock car after car in the many challenges this game offers you, go online and play with some friends , organize races or just mess around in the city.",
            "review_score": "1"
        },
        {
            "review_text": "great game to waste time having fun, but the other games in the burnout series are better.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun and addicting. It's simply the best racing/driving game you can play unless you want one of those realistic boring ones.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastically fun racing game. Sadly M$ stopped supporting this game, so you can't download any of the add-ons for this game. The 'Ultimate Box' doesn't include much at all. And you'll never be able to play as Ecto-1 or the Delorian from Back to the Future. Don't buy this game, download a crack or something. You can't even legally have the full game experience anymore, so why pay for it?",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend this game because the Burnout series is one of my favorite, but this probably being my favorite of this series. The only downside i will note is that i am sad that this does not have the console dlc i really wish that they would bring surf island to the pc. I have spent well over 400 hours playing the 360 version and just couldn't bring myself to buy the pc version because it was missing that piece of dlc. But a friend bought it for me so i can't complain too much.",
            "review_score": "1"
        },
        {
            "review_text": "This Games brings back so much nostalgia i loved this game on the PS3 and i still do this game is the best racing game i´ve ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, don't let the bad reviews deter you.",
            "review_score": "1"
        },
        {
            "review_text": "More for people who like to play an easy game and sit back maybe play with some friends. I enjoyed it but it didnt last to long cuz of all the other great games on steam but this is still a GREAT game! (More with friends but thats up to you.)",
            "review_score": "1"
        },
        {
            "review_text": "Arcade to the Maaaaaaaaaaaaax! This time in Paradise City (open 'world')  As a great fan of the series, since Burnout 3 Takedown, I'm glad the Paradise Ultimate Box is available on PC/Steam. I also bought it on my 360 back in 2009 and with the controller support in the Steamversion its pretty much the same feeling so to speak. But of course the whole graphics looks much much better. Content stays the same except the Big Surf Island DLC, which is NOT available on PC :&lt; Bikes, Mini Cars are in.   Pros: + variety of races + many Cars, 3 main types of cars/boost (race, stunt, crash) + bikes + graphics, sound + DJ + soundtrack   Cons: - No BSI DLC - No Trafficattack (as in Burnout Revenge)   IMHO Paradise adds the openworld feature to its predecessor and almost exceeds your 'need for speed' so to speak. This Game will definitely match your expectations as an Arcade and Burnoutfan.  Just hit the Boost and get it on!",
            "review_score": "1"
        },
        {
            "review_text": "One Of The Best Racing Games Out There. Made In 2009 But Still Rocks,Way Better Then Most Of New Racing Games,It Is Awesome. Taking Down Others Are  Cool,Why?  Physics Aren't Real,Cars Fly Like Planes,Physics May Be Broken,But Broken Physics Make Game More Better,Racing Is Really Really Intense. Marked Man Is Like Police Pursuit,Burning Routes Are Awesome! Give You Mark on Your License And Give You Enhanced Version Of Your Car! Game Is Completely Awesome And Satisfiying. 10/10 - Would Crash More Cars",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you love cars. The greatest part of the game is just the ability to roam the city freely breaking and jumping on whatever you find.",
            "review_score": "1"
        },
        {
            "review_text": "One Of The Best Racing Games Out There. Made In 2009 But Still Rocks,Way Better Then Most Of New Racing Games,It Is Awesome. Taking Down Others Are  Cool,Why?  Physics Aren't Real,Cars Fly Like Planes,Physics May Be Broken,But Broken Physics Make Game More Better,Racing Is Really Really Intense. Marked Man Is Like Police Pursuit,Burning Routes Are Awesome! Give You Mark on Your License And Give You Enhanced Version Of Your Car! Game Is Completely Awesome And Satisfiying. 10/10 - Would Crash More Cars",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun, just ashame the cars are not branded and there is a lack of music! This doesn't mean it isn't good though, it's 10/10 for what it does!",
            "review_score": "1"
        },
        {
            "review_text": "Burnout: Paradise has something for every type of gamer. If you just like the racing aspect, you got it. Do you just like showcasing cars in action? there's the stunt mode so you can take snapshots of your card in mid-air. Or you're like me and like crashing into ♥♥♥♥ and watching it tumble around, that's what road rage mode is for. Also, you can just activate this mode where your car suddenly starts flipping and the objective is to cause as much damage to other cars before you loose momentum.  This game still plays as good as when it came out and hasn't felt any older. The world is so big, some people can still get lost in the middle of a heated race in multiplayer. The variety of cars is there and each one drives really differently.   I would buy it now since it still has people playing it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a great recing arcade game i would recamend this game to any one, though it does take time to get used the open world but still a great game. and the online is.....okay but not the best.",
            "review_score": "1"
        },
        {
            "review_text": "Burnout Paradise has to be the best racing game I have ever played. The city has lots of different events to do, cars to unlock and collectables to smash, find or jump. You start with one car and have to win races which puts a new car into the world and you must take it down to be able to drive it. The events include: Races, Road Rage (taking down other drivers,) Marked Man (like race but you have to survive instead of coming 1st,) Stunt Run (Do stunts for points) and Burning routes which have 1 per car and it's a point to point that you must beat the clock to get a new car (really just an upgrade to what you were driving.) All of this adds up to be an unique racing game with lots to keep you occupied.   If my hours look low i managed 118hrs on xbox and did EVERYTHING.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. If you loved the old ones you musut buy this",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly well done racing game! Definetly one of the best of racing games ever made,  and second best Burnout acording to me! 9.5/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Because this game has Avril Lavigne's Girlfriend in this game OST, I consider this game's soundtrack a good one. The game's mechanics and everything else in the game are very well done and the game is a unique racing experience, compared to most other games I've played.  Trust me, this game is a ♥♥♥♥ing great one and I recommend you buy it as soon as you can. It's totally worth the £5 or less if it goes on sale.  Here's an extra screenshot for the Avril Lavigne fans:        Yay, Avril Lavigne! lel :D&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "The greatest racing game of all time with or without the DLC, shouldve had all included but dont be such a sour sob this is the bees knees of racing fun. None better greatest of all time , the best game Criterion have ever made. Play it at 60 fps plus at 1080 p and start a road rage of above 25 cars and there isnt anything to compare to it . Its 6 years old and I'm still playing like it was Christmas morning opening a new toy. Dont listen to the pessimists ,this is it the the most diverse and exciting driving game ever, the only driving game to make it into PC Gamers Top 100 games of all time. And you know how picky those ♥♥♥♥♥♥♥s at PC Gamer can be. Go on with ya Cockers and get this game !",
            "review_score": "1"
        },
        {
            "review_text": "How the hell are you supposed to get to the settings? it's really starting to ♥♥♥♥ me off not knowing how to get to the flipping settings...",
            "review_score": "1"
        },
        {
            "review_text": "Sooo...  Pros: -Addicting gameplay -Cool looking cars -Mass city to explore -Awsome soundtrack -Still has a active online comunity  Cons: -Can get boring real quickly -The 'gps' is a mess -Some glitches where you crash for no reason  Soo i give this game a 7.5/10 It's a fun game,but it dosen't fell much liek a burnout game,but it's worth the price you are paying for. ",
            "review_score": "1"
        },
        {
            "review_text": "Graphic is nice and the game is much fun to play.  &gt; PROS The world is pretty big and heterogeneous, maybe just with a bit too much 'shortcuts'. Cars are either accurate (I felt like I was driving a proper Lancer) or funny (in a good way). Challenges are as they should be, easy at start and hard (but still not insane) toward the end of the game. You get to listen even classical music on the 'radio' and so music is good...  &gt; CONS Sadly the login/login-server system is a huge mess (couldn't ever connect to game-servers because the game crashed if I tried so). Running through the city is fun but not being able to pick a race without moving to the starting location 'manually' is a bit stressing after 5+ total hours played. Also, to compete 'equally' in every type of race you have often to change your current car for another (moving to one of the 'bases')... additional stress. The menu system is just plainly wrong and confusing.  To recap, the game itself is quite good and enjoyable but it's still a console port and most of the cons come from that.",
            "review_score": "1"
        },
        {
            "review_text": "Still offers exhilarating, smooth and responsive arcade-racing gameplay. Great graphics and solid framerate (especially on a modern spec pc... in 4K 3D Vision). Awesome retro soundtrack and insane speed and stunts. What's not to like?! Nominated for the 'Test of Time' award.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best racing games out there. No matter how many years have passed since it launched, I still come back to it to have fun racing and crashing cars.  HOWEVER, beware many people, including myself, are having problems starting up the game. I believe the game servers shutdown, and ever since it's been a pain to get it working.   Startup game homepage (there is an ingame browser that starts everytime you start the game, before opening the actual game) is broken, so working around this to get the game working is a painful process, unless criterion releases a game patch.  In the mean time, go to the file burnoutparadise.exe location (right click in steam game, properties, browse file location), and then in windows explorer right click the burnoutparadise.exe file, set it in compatibility with windows xp sp3, and that will do it. It did it for me, after a research on the web on how to make it work.  If you have the option to get this game on console, is a different story. The consoles work with no problem (ps3 and xbox 360), but the game will not be as beautiful as it is on PC. It's your choice.  One of my favorite racing games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "This is One of the best racing games that I have played in a while.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best racing games out there. No matter how many years have passed since it launched, I still come back to it to have fun racing and crashing cars.  HOWEVER, beware many people, including myself, are having problems starting up the game. I believe the game servers shutdown, and ever since it's been a pain to get it working.   Startup game homepage (there is an ingame browser that starts everytime you start the game, before opening the actual game) is broken, so working around this to get the game working is a painful process, unless criterion releases a game patch.  In the mean time, go to the file burnoutparadise.exe location (right click in steam game, properties, browse file location), and then in windows explorer right click the burnoutparadise.exe file, set it in compatibility with windows xp sp3, and that will do it. It did it for me, after a research on the web on how to make it work.  If you have the option to get this game on console, is a different story. The consoles work with no problem (ps3 and xbox 360), but the game will not be as beautiful as it is on PC. It's your choice.  One of my favorite racing games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "A great racing game. For those who liked the previous games of the serie, this is a must play. The soundtrack is good and the graphics are great.  It gets a little repetitive after some time. I felt like the only things being added to the game was the cars, and I think there should be more.  Still, I had a great time playing it.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what to say about this, it was half good and half bad but I can't pick the 'IDK' rating to this.   I liked the soundtrack, quality and cars on this game.   My dislikes are bikes, crappy controls at the start (I wouldn't have problems if I changed them to Valve-like later. Oh and, after a few tries it's not a bad thing), takes too long to get into my destination and I don't even know where to go and I screw up (but then I realized there's 'Easydrive'), I can't hear a such THING when I have every sound level the highest of my game (I don't want to have more than 10% volume, because then I would be ear-♥♥♥♥♥ by a Microphone beep/voices or Steam message/online sounds. But then it's normal...) and no crashbreaker on Showtime or it's not like a Crash mode anyways.   The showtime is like the recent game 'Burnout CRASH!' with infinite Aftertouch function instead of Crashbreaker and it ends only when you run out of boost and your car stops. Also why are the records so impressive (minimum a million dollars) on this mode?  Another problem is that unfortunately Electronic Arts has abandoned the in-game Burnout Store, which makes it impossible to buy the rest of this game's DLC (Cops and Robbers, Toys, etc.) unless someone knows how to use Amazon. They are still purchasable on Xbox 360 however.  There's also a DJ guy that talks random ♥♥♥♥ between music tracks and tells the objective of many races/events, just like in Burnout 3, except this is totally not our beloved Stryker but that ♥♥♥♥er named 'DJ Atomika' from the SSX series. Didn't you know that Stryker already has a job as a DJ for KROQ-FM and he was sent to EA Studios as a guest for just one time? It's not like he's gonna be a Crash FM DJ for every single game for the Burnout series, but still, he was the best in my opinion.  Don't know about you, but it personally looks like Rockstar Games' Midnight Club with a few of Need for Speed's functions slapped on. Overall 6.4/10. Although earlier I was like a '♥♥♥ ZOMFG DIS GAEM IZ ♥♥♥♥♥ -1/10 MAEK BORNOWT TREE ON STIM!!11' guy, but then it was my first time playing...",
            "review_score": "1"
        },
        {
            "review_text": "I love racing games and this is one of my favorites. This one has a great feel to it: challenging, seamless arcade racing with lots of crashes and cars to unlock. Great multiplayer with not only races and takedowns but cooperative challenges for up to 8 players!",
            "review_score": "1"
        },
        {
            "review_text": " Graphics  Well detailed game. You can read (albeit dangerous) the license plates on other cars. The lighting from the sun shines off high gloss paint jobs like in real life. The small detail damages are realistic; if you broke a headlamp it stays broken and doesn’t light up. The back ground is realistic enough to tell distance. I’ve played this at both regular television and hi definition 1080p while it is still good at the lowest setting I highly recommend the playing at the highest possible detail.   Sound and Music  You can tell from just driving around what types of cars are around you with even having to look at that area. The screeching of the tires to the roar of an engine is clear with any vehicle you use. Now the music, quantity or quality wise you will not be disappointed. There are a lot of songs that play while driving around so chances are if you play for an hour or two, you will not hear the same song twice. And you don’t like a particular song you can always take if off the play list. One should note that a good portion of songs are the same songs from older Burnout Games.   Game Play  As you win events you upgrade your license. The higher the license, the larger amount of vehicles you will be able to use. These events are littered all thought Paradise City. To start the event simple pull up to a light to start it.  Here is the events.  Races: Standard Race. From one to seven other opponents you drive to a specific end point. Road Rage: Timed Event. You use your vehicle as a battering ram to smash other vehicles into traffic, walls or other hard objects. Target amount is usually displayed. Event ends when either you take to much damage or time ends.  Marked Man: Almost like a race. You goal is to reach one destination while four other computer cars try to inflict enough damage to keep you from reaching your destination.  Stunts: Use your vehicle like a little acrobat, jumping off ramps, crashing bill boards and doing spins. The more you do in a sequence the more points you get. There is a target score to get per event.  Burning Route: One route per vehicle. It’s a timed race where you just have to get to the finish line by a certain time using a certain vehicle. Every route you finish unlocks a upgraded version of the vehicle used. All these events get a bit more difficult as the game wears on but not that much more. I would say once you get used to the way the game plays you find that most of these events range from easy (one or two attempts) to medium (fifteen minutes maximum).  Now there are a few side events or tasks that are fun to do. Running certain billboards, barriers, and super jumps. They are littered everywhere, cant be avoided just driving around. There are few hidden but find to fun all of them and as a reward for finding all it unlocks more vehicles. There are also two events per street, one is time trails and the other is showtime. Showtime is just you bouncing around hitting vehicles for points.  Online play is quite fun with tasks and races, connections are usually stable. One thing I like is with Xbox Live Vision take a photo of you when you get taken out by another drive and sent to the aggressor. The online experience is a whole new game in itself and worth playing.   Negatives  Although it’s a very good game here is a few of the things I didn’t like. Showtime is very repetitive in the sense you have to do it to all 64 streets of Paradise City. Also Showtime replaced Crash from previous games. The on line challenges are very repetitive where if 2 players you have to do it for 7 players. And some of them are very very basic like driving in oncoming traffic. Also while doing online challenges if one person get disconnected, the challenges are cancelled. The difficulty level is somewhat misleading as the more cars you unlock the easier the game is when trying to do the events. One last thing that kind of surprised me is the amount of advertising in the game, from billboards to vans there is way too much advertising in this game. To show how much advertising there are four unlockable cars, all of them are plastered with the names.",
            "review_score": "1"
        },
        {
            "review_text": " Graphics  Well detailed game. You can read (albeit dangerous) the license plates on other cars. The lighting from the sun shines off high gloss paint jobs like in real life. The small detail damages are realistic; if you broke a headlamp it stays broken and doesn’t light up. The back ground is realistic enough to tell distance. I’ve played this at both regular television and hi definition 1080p while it is still good at the lowest setting I highly recommend the playing at the highest possible detail.   Sound and Music  You can tell from just driving around what types of cars are around you with even having to look at that area. The screeching of the tires to the roar of an engine is clear with any vehicle you use. Now the music, quantity or quality wise you will not be disappointed. There are a lot of songs that play while driving around so chances are if you play for an hour or two, you will not hear the same song twice. And you don’t like a particular song you can always take if off the play list. One should note that a good portion of songs are the same songs from older Burnout Games.   Game Play  As you win events you upgrade your license. The higher the license, the larger amount of vehicles you will be able to use. These events are littered all thought Paradise City. To start the event simple pull up to a light to start it.  Here is the events.  Races: Standard Race. From one to seven other opponents you drive to a specific end point. Road Rage: Timed Event. You use your vehicle as a battering ram to smash other vehicles into traffic, walls or other hard objects. Target amount is usually displayed. Event ends when either you take to much damage or time ends.  Marked Man: Almost like a race. You goal is to reach one destination while four other computer cars try to inflict enough damage to keep you from reaching your destination.  Stunts: Use your vehicle like a little acrobat, jumping off ramps, crashing bill boards and doing spins. The more you do in a sequence the more points you get. There is a target score to get per event.  Burning Route: One route per vehicle. It’s a timed race where you just have to get to the finish line by a certain time using a certain vehicle. Every route you finish unlocks a upgraded version of the vehicle used. All these events get a bit more difficult as the game wears on but not that much more. I would say once you get used to the way the game plays you find that most of these events range from easy (one or two attempts) to medium (fifteen minutes maximum).  Now there are a few side events or tasks that are fun to do. Running certain billboards, barriers, and super jumps. They are littered everywhere, cant be avoided just driving around. There are few hidden but find to fun all of them and as a reward for finding all it unlocks more vehicles. There are also two events per street, one is time trails and the other is showtime. Showtime is just you bouncing around hitting vehicles for points.  Online play is quite fun with tasks and races, connections are usually stable. One thing I like is with Xbox Live Vision take a photo of you when you get taken out by another drive and sent to the aggressor. The online experience is a whole new game in itself and worth playing.   Negatives  Although it’s a very good game here is a few of the things I didn’t like. Showtime is very repetitive in the sense you have to do it to all 64 streets of Paradise City. Also Showtime replaced Crash from previous games. The on line challenges are very repetitive where if 2 players you have to do it for 7 players. And some of them are very very basic like driving in oncoming traffic. Also while doing online challenges if one person get disconnected, the challenges are cancelled. The difficulty level is somewhat misleading as the more cars you unlock the easier the game is when trying to do the events. One last thing that kind of surprised me is the amount of advertising in the game, from billboards to vans there is way too much advertising in this game. To show how much advertising there are four unlockable cars, all of them are plastered with the names.",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe I waited this long to check out this game. Incredible in every regard.",
            "review_score": "1"
        },
        {
            "review_text": "Take me down to paradise city where the driving is fun and the music is ♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I almost never replay games. I’m too busy and handsome. I’m on my fourth go through with BP. Take some element's from the Need For Speed series and combine them with the distruction of the best Burnout games and this is what you get. It’s madly splendid, letting you smash through, jump over, and race down for ever and ever and ever. Although if I ever hear Paradise City again I might blow up the Earth.",
            "review_score": "1"
        },
        {
            "review_text": "I got so many mixed feelings about this game. I love racing games but I kinda hate it if they turn out to be a chore to finish them..  I'll be short and simple on this.   pros:",
            "review_score": "1"
        },
        {
            "review_text": "What a piece of ♥♥♥♥ game. ♥♥♥♥ing terrible. Avoid at all costs unless you like Guns and Roses Paradise City over and over. Like annoying cut scenes you can't skip? Like the attentio of detail of having no driver in your car nor pedestrians? This game is for you!  Can't connect to multiplayer because the 'Server is currnetly unavailable' although my friends can play it without me.  EA took the name of Burnout and pumped out this lazy piece of ♥♥♥♥ title. It's truly a shame. Once again avoid at all costs. It wasn't even worth the $0.50 I paid for it in the Humble Bundle.",
            "review_score": "1"
        },
        {
            "review_text": "i an very happy to say that i have wasted quite a few days of my life playing this game, and i would recomend you do as well. if you are in to smashig, bashing, compleatly ignoring physics and running out of boost all the time then this is your game. (SPOILER; i would get all of the gates, bill-boards and jumps to get some of the faster cars earlier on)",
            "review_score": "1"
        },
        {
            "review_text": "Take me down to the Paradise City!",
            "review_score": "1"
        },
        {
            "review_text": "The best cars game ever , you never find game like it . +7 UP TO 99 !",
            "review_score": "1"
        },
        {
            "review_text": "I'm not usually a fan of racing games but Burnout is one of my favorite games of all time. When it was new I bought an XBox just to play Burnout with my living room projector. Just got it again during the Steam sale and it's still just as awesome as I remember. The graphics are still good enough that you can just sit back and enjoy blasting through the city and smashing some other cars.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of fun stuff about this game:  1. Smashing through the yellow smash gates 2. Crashing through billboards 3. Showtime mode, where you basically crash into everything in sight and cause the most damage possible 4. Leveling up your license by winning events (Stunt Run and Race are my favorites) 5. Seeing your car get severely crunched up against walls in slow motion 6. 90% of the soundtrack is awesome.  You should buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Burnout Paradise: The Ultimate Box Pros +Cool nice looking cars +Lots of locations +Loads of events and game modes +Road Rage never gets old +You are free to take which ever route you want in a race +Lots of cars +Good Crash physics +Graphics are pretty good  Cons -Repetitive -No Multiplayer -Unable to purchase DLC which means The Ultimate Box part is useless  7.4/10",
            "review_score": "1"
        },
        {
            "review_text": "Controller...not really playable with keyboard/you might keep calm and work something out due to that issue. Also i dont think dis is something fine in general, id say basic random game, nothing special.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best racing game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Show us where to go in a race via GPS and I will give a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome game, one of my absolute favorites. Nice open world, cool racing system and, well... Interesting DLC. This game is quite underrated tho, as well as the whole Burnout series. Not a lot of people like it, but yeah, I reccomend it, it's just an AWESOME and fun game to play.  DENATTADEN                                                                   P.S. Hey, Jacksepticeye played this and also reccomended it! So you know it's good.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would #rek my car again",
            "review_score": "1"
        },
        {
            "review_text": "BRUUUUUUMMMMMMMMM Take me home to Paradise City where the grass is green and the girls are prettyyy, why won't you please take me hoooooooomeeeee??? :3",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░▄▄▄▄▄ ░░░░░░░░▀▀▀██████▄▄▄ ░░░░░░▄▄▄▄▄░░█████████▄ ░░░░░▀▀▀▀█████▌░▀▐▄░▀▐█U HAVE BEEN FASTED BY  ░░░▀▀█████▄▄░▀██████▄██ ░░░▀▄▄▄▄▄░░▀▀█▄▀█════█▀ ░░░░░░░░▀▀▀▄░░▀▀███░▀░░░░░░▄▄ ░░░░░▄███▀▀██▄████████▄░▄▀▀▀██▌ ░░░██▀▄▄▄██▀▄███▀░▀▀████░░░░░▀█▄THE FAST MASTER ▄▀▀▀▄██▄▀▀▌████▒▒▒▒▒▒███░░░░▌▄▄▀ ▌░░░░▐▀████▐███▒▒▒▒▒▐██▌ ▀▄░░▄▀░░░▀▀████▒▒▒▒▄██▀ ░░▀▀░░░░░░▀▀█████████▀ ░░░░░░░░▄▄██▀██████▀█ ░░░░░░▄██▀░░░░░▀▀▀░░█ ░░░░░▄█░░░░░░░░░░░░░▐▌ ░▄▄▄▄█▌░░░░░░░░░░░░░░▀█▄▄▄▄▀▀▄ ▌░░░░░▐░░░░░░░░░░░░░░░░▀▀▄▄▄▀ ░▀▀▄▄▀SEND THIS TO 7 OTHER PEOPLE OR UR TOO SLOW",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "As a burnout fan of old i must say i was dissapointed with this outing. Dont get me wrong, whats not to like with loads of cars and bikes at your disposal while free roaming a large city, its just the game was already good enough to forgo them so came across to me anyway as a failed attempt to re-ignite our passion while competing with the likes of need for speed so as to gain new followers.  That said its still fun, just not as much as games of old in the series so if your not into emulators, then 5 quid is a small price to pay for a bit of good old arcade drive, jump and smash.",
            "review_score": "1"
        },
        {
            "review_text": "The online made me drink the bleach 8/8",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is the realistic racing game and if u want to buy u should its worth it",
            "review_score": "1"
        },
        {
            "review_text": "apparently t boning someone more masterfully than the bonemaster himself grants you the failure of being taken down by the person you just t boned   9/10 would t bone myself into next friday again",
            "review_score": "1"
        },
        {
            "review_text": "- start game - head to options - set music to 0 - alt tab to youtube - start playing the Top Gun soundtrack - go back to game and enjoy",
            "review_score": "1"
        },
        {
            "review_text": "best racing game. i really wish they ported over burnout takedown from the older gen consoles that one is beast too",
            "review_score": "1"
        },
        {
            "review_text": "This is hands down one of my racing favourites! It's a little short (Took me 9 hours to get the Paradise drivers licence). If you have some cash to spare on a game, buy this game! I promise you won't be disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "i dont like racing games but i love this game (also played on console)",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "the crashing reminded me of nam",
            "review_score": "1"
        },
        {
            "review_text": "does it have big surf city?",
            "review_score": "1"
        },
        {
            "review_text": "I got a new car for free by crash to that car  Wanna know how? Check out Burnout Paradise",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Especially with the added motorcycles.",
            "review_score": "1"
        },
        {
            "review_text": "this is a good Multi-player car game ,, so ♥♥♥♥ing hardcore fun :D",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "great game. good racing system and i like how you have do win things to upgrade your lisense ",
            "review_score": "1"
        },
        {
            "review_text": "Value for the money paid. Darn good fun on the PC.",
            "review_score": "1"
        },
        {
            "review_text": "One of the more fun racing games! You don't need to expect realistic driving and that's a good thing here. Crashing your car or even better, crashing other cars, is ome of the good things of this game. But what I like about it the most is collecting the enemy's cars and the many choices of vehicles. It was so fun that I got it on console as well.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, bad publisher. 'Nuff sed.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible game. Many, many hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "It is the greatest game ever. I have a 100% complete game on my PS3 and now looking for to do it again!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I've played in a while, the crashing, the smashing of billaboards, the flips, jumps, and car derbying. Get it on sale, its worth every cent and you'll be playing on hours ends. You won't regret it for sure.  I give a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Burnout Paradise delivers as a fantastic racing game any racing fan should own, and that even non-racing fans will likely get some enjoyment out of it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, don't regret buying this 4 times over three systems.",
            "review_score": "1"
        },
        {
            "review_text": "Only Played for a day so far, but this is a great game. Anyone who has played Need For Speed: Most Wanted (2012) will find farmiliar elements in this game. A load of fun, with awesome jumps, smashable billboards and collectables. The original Need For Speed: Most Wanted from Criterion Games.",
            "review_score": "1"
        },
        {
            "review_text": "Best car game so far :D",
            "review_score": "1"
        },
        {
            "review_text": "Best racing game ever created.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game.  Had a little bit of issue with crashing, but running in windows 'compatability mode' seems to help drastically.",
            "review_score": "1"
        },
        {
            "review_text": "Servers are down permanently? Great way to test out the refund system then! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I don't like racing games, but Burnout is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Before I played: ┬┴┬┴┤ ͜ʖ ͡°) ├┬┴┬┴  After I played: ┬┴┬┴┤ ͡ʘ ͜ʖ ͡ʘ) !!! ├┬┴┬┴",
            "review_score": "1"
        },
        {
            "review_text": "This is like FlatOut meets Need For Speed :) One of the best racing games i've ever played and the best crash game ever played  Extremely entertaining game, can't get enough of it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is soo cool!!!!!!!!!!!!!!!!!!!!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "I have no recollection of playing this game",
            "review_score": "1"
        },
        {
            "review_text": "Most ♥♥♥♥in' Amazing Racing Game",
            "review_score": "1"
        },
        {
            "review_text": "Burnout Paradise is a racing game, SImply awesome! You race around what is called Burnout City. You can try different tracks, You can race your friends online And the best of all is: You can create custom cars!",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that is burning out is my will to live after playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best choices for multi-monitor/widescreen gaming enthusiasts. Native support for multiple monitors and optimized gameplay make this one of the most immersive driving games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Within the 5 minutes in this game i was already having a blast smashing through gates and buildboards.. One thing i was very excited is that when i tried online and there were some servers so i was having a blast playing online!  Its just a shame that we Pc gamers cant Experience Big Surf Island without a Mod..  But overall i would still recommend this game to a friend...",
            "review_score": "1"
        },
        {
            "review_text": "As a longtime fan of the Burnout series this is my least favorite. It ONLY has a massive open world, a plethora of content, generous graphics and addictive gameplay going for it. Oh yeah, worth it.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to feel the speed while listening to great music, buy this game..now! Free roaming through Paradise City, insane stunts and a lot of missed turns. Worth the money? Yes! If it's on sale and you don't have it yet, you sure are missing a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most enjoyable games I ever had. Bought it for PS3 i 2007 and recently on Steam. And it was worth it. The destruction on cars still amazes me and not many games have that detail of collision.  The only downside is being unable to purchase addons in game, which are amazing - the toy cars, some more classic and speedy vehicles, and of course, the Paradise Island which features extreme jumps and has some nice secrets too.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of this writing, this game is $5. I don't know a lot about driving or car combat, but I love this game. It has big impacts, a huge open world, and just generally a fun aesthetic. It doesn't take itself too seriously, and what it does, it does right. This game changed my opinion of racing games. You should buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "Fun racer game that doesn't take itself at all seriously, the crash scenes are great and the speeds are ridiculous. Great fun!",
            "review_score": "1"
        },
        {
            "review_text": "Before you buy, READ: DO NOT buy this thinking you will be getting all the DLC for this game. The in-game store was shut down almost 2 years ago, which also resulted in making us unable to ever retrieve the DLC cars through it. There are other ways of 'unlocking' these vehicles, but it invalidates your save-game, and you're forced to play on a save-game with near 100% game completion. This game is quite a deal when it's on sale though - so if you tried this game before, and liked it, go ahead and buy it. But prepare to have to do some tweaking with third-party software, to unlock the extra cars from the Ultimate Box.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "Best casual driving sim I've ever played, Simple yet so much fun. Plus it runs on lower-end PC's so Keep that in mind, I used to run this on intel-intergrated graphics and it ran 30+ fps. Highly reccomend the Vanity mod, adds a small island thats fun to cruise on.",
            "review_score": "1"
        },
        {
            "review_text": "There are two kinds of racing game enthusiasts:  1. 'I want a realistic racing sim with authentic vehicular physics and official competition rules.'  2. 'F*ck the first kind.'  If you're the kind of person who heavily identifies with the second option, who proudly throws a third-finger salute in the face of such fruity ♥♥♥♥♥♥♥t as 'closed tracks', 'realistic damage' and 'physics', lest they interfere with your sweet jumps, 100+ KPH drifts, and incredibly violent automotive rampages, then this is undeniably THE racing game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Few years ago I had a lot of fun with this game, and when I have picked it up lately I was wishing for the same. And well I have not been dissapointed, this game is pretty fun although not longer supported by Criterion, and not that much players left in it. Still tough it is well planned game, and quite cool even now :)",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. You're racing in a city built for racing, but there still is other traffic to avoid. This keeps the game interesting. There's a lot of variety: five types of racing, several dozen cars, collectibles, and more. As well as every street has a time to beat. There's a race where you have to destroy the other racer's cars, as well a trying to survive the trip with other cars trying to destory yours. And that's just single player. You can race online against others in a wide variety of modes. Using a webcam; you'll receive a picture of the people you beat (from the moment of impact) and they'll receive a picture of you when they make your car crash. One of the best things about the game I think is how they handle crashes. Because, you will crash. A lot. But it is not a death sentence as in a lot of other racing games. You're back on the road in about 5 seconds. And you can still win the race after your car has crashed. This also goes for your opponents, though. As for the down sides: 1. There are really just 8 finishing points in the game, after a while that gets really repetitive. 2. The game takes a long time to load, with a lot of different screens and menus. 3. There's a 'showtime mode' where you crash your car on purpose and destroy other cars to get points. It doesn't seem to work properly and is largely based on luck. When I was looking online to see if I was doing something wrong: nope, it really doesn't work well. Still, a great game, definitely worth the money (especially at a discount). FInally: play with a controller to enhance your experience.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, reccomend for those who don't have good computrers.",
            "review_score": "1"
        },
        {
            "review_text": "I was driving around and then Avril Lavigne started singing on the radio about how she wanted to be my girlfriend.  10/10 would accept her offer.",
            "review_score": "1"
        },
        {
            "review_text": "Exactly what you'd expect of Burnout. Destroy damn near everything. As usual, anything but the absolute heaviest cars are armored with thin paper, so even the slightest bump can send you careening off into a terrifying spiral of flying destruction. Not that you'd expect any less.",
            "review_score": "1"
        },
        {
            "review_text": "Really, really fun. Never liked car games or racing games until I played this. ♥♥♥♥ EA though.",
            "review_score": "1"
        },
        {
            "review_text": "because crashes",
            "review_score": "1"
        },
        {
            "review_text": "Fast and fun!",
            "review_score": "1"
        },
        {
            "review_text": "The game is getting on a bit, but it stands the test of time. Still a fun game to play, and there are still people online to play with. It doesn't need a powerhouse of a PC to play, and if you're coming from consoles the graphics are far superior to the xbox 360 version.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing, intense racing game that allows you to demolish opponent's cars with your own. Has the most freedom in any racing game I've ever played. My only complaint is that car customization is just limited to the paint job, but I love how you have to earn your cars, not buy them.",
            "review_score": "1"
        },
        {
            "review_text": "Great sandbox, great driving controls, pretty much a good, solid and fun open world game to just sit down with and faff about in cars.  Only caveat: DO NOT TRY AND ALT-TAB OUT OF THIS GAME; IT WILL FREEZE WINDOWS AND FORCE YOU TO DO A MANUAL SHUT DOWN/PULL THE POWER CHORD.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, but it tried to do something new which set Criterion games back to the drawing board. With the transition to an open world, a lot of things that made the past games great were lost in translation. Some people say its showing its age(?), but it really isn't. Keep in mind this 'Ultimate Box' doesn't actually come with the DLC, but only the free updates that were given out to the game. lame af, but whatever. Still though, its a good game and you can find it pretty cheap on sale these days. Also if you can play the older games like Burnout 3 and Revenge, because they're complete gems.",
            "review_score": "1"
        },
        {
            "review_text": "Great game concept, no more boring round tracks. good graphics, loads of fun altogether. no way round axl rose though, other than to turn down your speakers when starting the game and no way out of the game, other than alt+f4... hitting EVERY lamp post and getting wrecked at least 20 times per session 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest racing game since Stephen Hawking Cart 64. Your balls will shrivel up in the face of this game and your uterus will shrink to the size of a dime.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is the only game where I have shouted the phrase, 'YEEEAAAH BOIIII' while playing alone against the computer.  It's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Explosive fun. One of, if not the most enjoyable racing game released in previous years. Great mechanics, absurd stunts and a lot of stuff to do. Oh, and it's also a great port. Did I mention it's really cheap? Cop it!",
            "review_score": "1"
        },
        {
            "review_text": "If you like racing and totaling other cars for fun this is the game.",
            "review_score": "1"
        },
        {
            "review_text": "MOTORBIKES RACING!!!!!! classic and still awesome, despite graphics (good for 2008, but in 2014 a bit outdated) worth",
            "review_score": "1"
        },
        {
            "review_text": "This game i quite good except some annoying factors: The Game loves to spawn cars in your path so you only have a second to move to not crash into it. This element of the game is fusterating when you are trying to unlock the game. Even at night when there is hardly any cars. when you get into a even. they spawn a ♥♥♥♥ load of cars in your path. The Crashes are over dramatic. Like if you are about one meter away from a car, this game counts it as a crash and spends about five to ten seconds making the car roll and loose wheels when they are not nessisary.  Things like that make this game quite fusterating. Over all the single player is a challange. having many events to complete to unlock cars and test your skills.  Multiplayer on the other hand. Mostly the community for burnout paradise is rude and immature. I don't know why they are, but they abuse you for kicking them out of the game when you spacificly tell them that you will kick if they continue to crash into you. and numerious amount of times, they have the threats of, 'I'm going to kill your whole family because you kicked me'' and other serious threats. Then you get the funny threats of 'I'm going to put you onto youtube if you kick me more.' You do have the occasinol nice person that helps you along the way, But best advice i can give is to just play with friends.  Over all this game has its ups and downs. The overall rating that i give this game is a 6/10. Because of the fusterating game machanics and multiplayer. But the graphics and the challanges give it the highlights",
            "review_score": "1"
        },
        {
            "review_text": "Got this game with a Humble Bundle and wasn't expecting much. In the end, I've played so many hours (offline and online) and I can't tell you how much I enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a huge racing gamer, but this game is loads of fun. The game looks pretty darn good, and the damage modeling on the cars is fantastic. When I crash, I can't help but smile because it is so beautiful. The racing is fast paced and fun, and it is loads of fun to just explore Paradise City and mess around. This game is certainly worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "8.5/10 Fantastic racing game, very open and gives you the option to do what you want while keeping you immersed in the game. You drive your car around picking races depending on their location on the map earning your self new licenses depending on how many races you win. Handling is fantastic as well as the boost and “takedowns”. Environment is very fluid, races are very well placed and you will start to get to know all the shortcuts in no time. The best part of this game is the Biker expansion, the controls for the Bikes are fantastic and although there aren't a huge amount of races to be played its a awesome add on to a awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously amazing. Best game around for motorcycle driving, however takes quite a bit of time to get new vehicles. 9/10 worth buying",
            "review_score": "1"
        },
        {
            "review_text": "It is a really good game.I am suprised it is only 20$.You can do free roam or racing and stunt runs and lots more.",
            "review_score": "1"
        },
        {
            "review_text": "You can take off a ramp at 180 miles per hour, fly over an entire freeway overpass, and come crashing down on top of your opponent when you land on the other side. Nothing short of thrilling.",
            "review_score": "1"
        },
        {
            "review_text": "This is a sit down by yourself and crash into everything in site when your feeling destructive mood, Game! Excellent!",
            "review_score": "1"
        },
        {
            "review_text": "Don't be discouraged that the In-Game DLC store is shut down - you can still get the DLC Vehicles! Just search for the Bonus Vehicle Pack on Amazon or GMG.  All in all, probably one of the best racing games I've played, and its held up rather well despite having come out...what, 5 years ago?",
            "review_score": "1"
        },
        {
            "review_text": "The game is getting on a bit, but it stands the test of time. Still a fun game to play, and there are still people online to play with. It doesn't need a powerhouse of a PC to play, and if you're coming from consoles the graphics are far superior to the xbox 360 version.",
            "review_score": "1"
        },
        {
            "review_text": "A fine game but it is no match for the previous xbox 360 titles (takedown and revenge). Whoever have the 2 games i mention knows....(all but the OST ;p)",
            "review_score": "1"
        },
        {
            "review_text": "Though it isn't as good as the previous 2 in the series (Takedown and Revenge) It is the 3rd best in the series IMHO. It's cars are all unique, fun, and different in their own ways (kind of like tf2's classes) and the burning route cars aren't always upgrades from the normal ones. All of the gamemodes are really fun, and the cars handle really tight. The slo mo crash cam, though annoying and taunting at times, works really well and is a treat to the eyes. DJ Atomica, however, is probably the most annoying thing about the whole game.   'OH BTW FIND RAMPS'  8/10",
            "review_score": "1"
        },
        {
            "review_text": "My favorite arcade racer series and a solid PC port. My only complaints are that the menus are a bit inscrutable and the game won't stop nagging you about online options that no longer exist due to the game's age. Tons of races and variety -- love it!",
            "review_score": "1"
        },
        {
            "review_text": "Races aren't as good as Burnout 3 or 4, because you're pretty much expected to find your own way, but it otherwise retains a lot of the fun and all of the insane sense of speed.",
            "review_score": "1"
        },
        {
            "review_text": "Because if you YOLO in real life you'll get arrested.",
            "review_score": "1"
        },
        {
            "review_text": "ea amazing as always iv played this sice i was a kid on ps3 now iv finaly got a muity media pc its eivn more amazing from the sounds grafics and deatil ea will allways be amaizing",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game just really dissapoined that they didnt include big surf island or any of the DLC. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "its boss",
            "review_score": "1"
        },
        {
            "review_text": "the graphics are better than my xbox 360 version",
            "review_score": "1"
        },
        {
            "review_text": "Burnout, what else to say? Now with bikes too and hot rods",
            "review_score": "1"
        },
        {
            "review_text": "If you have a wheel, you NEED this game. It's that simple. Drive fast, set time records against internet opponents...a super fun game with plenty of challenges. Go get this game now.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, with decent driving mechnics, love how the cars handle. it is really fun to just drive around and proform tricks. lots of content races and cars. Graphics are okay and will be fairly timeless. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game, especially if you don't love driving games. It's not technical, it requires no hard skills, and despite this it's fun to play. ",
            "review_score": "1"
        },
        {
            "review_text": "It's cool!",
            "review_score": "1"
        },
        {
            "review_text": "Best arcade racing ever",
            "review_score": "1"
        },
        {
            "review_text": "An easy to pic up, fast paced, ultra easy to run game that will keep you going. Not for hardcore racing fans, but rather those who just have the urge to pick up a racing game with a JUST GO DONT STOP mentality. Also, more content than Destiny, but most games have that so it isn't really hard to do. In the end, this is probably the best racing game out there, but dont take it from me, take it from the massive fan base this game has years after being left alone for NFS.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is no where near the visceral 'blink and you die' adrenaline fueled mayhem of Burnout: Revenge, infact this is more of a casual spin-off that lacks any real challenge in the single player. With that said it's more fun to just drive around Paradise City with friends or alone than any Grand Theft Auto or Midnight Club game.",
            "review_score": "1"
        },
        {
            "review_text": "This game proves that vehicles can work without a driver! different vehicles to unlock, spectacular crashes and some great tracks all add up to make a fabulous game!",
            "review_score": "1"
        },
        {
            "review_text": "Go buy this game its a good racing game. ( If you dont like NFS you will love this anyways )",
            "review_score": "1"
        },
        {
            "review_text": "I only got this game on PC because it was in the winter sale and also because i used to play this game on PS3 and it brings back a lot of memories. Good game if your into burnout games.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best racing games out on the market right now. By far the best car game I have ever played throughout my years of gaming!",
            "review_score": "1"
        },
        {
            "review_text": "Great open world styled racing game wiht plenty of challenges and cars to keep you busy.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, reccomend for those who don't have good computrers.",
            "review_score": "1"
        },
        {
            "review_text": "'The ultimate box my ♥♥♥♥!'   But hey, its burnout for a tenna!  YEAH BOI  72/100",
            "review_score": "1"
        },
        {
            "review_text": "Some sick game laak, proper moist driving mechanics; 10/10 would drive again",
            "review_score": "1"
        },
        {
            "review_text": "Its a decent game, very enjoyable for a few hours but it feels way to easy.  Im not a huge follower and i dont consider myself amazing at the game but the targets set in missions you can achieve within the first 30 seconds. Its just not challenging enough, missions are really easy and I cant find a way to restart a mission because of the seemlessness between missions and the freeroam world; I like to restart if i ♥♥♥♥ up to drastically but it doesnt let you do this and you have to finish the challenge, their is no opting out once youve started. Things like the map that auto locks on and the long animations in the garage have all started to bug me.   Overall i think its fun to speed around and cause hidious crashes but im just hoping it gets to the point where I dont win every race with complete ease.",
            "review_score": "1"
        },
        {
            "review_text": "Burnout Paradise is an excelent game, lote of good cars, nice fast action. The Utimate Box(sadly the only edition available now) is even better. It adds motercycles, new special boost cars, two new multiplayer only cars, and some really awesome mini versions of the popular cars!    Too bad EA stopped supplying half of the DLC required to use the Boost, legendary and toy cars. It' possible to modify your save to get all of them, but then you can't use the online mode, because EA is filled with a bunch of ♥♥♥♥-gargling-♥♥♥♥-bags. But oh well, the cars are good, it has a good multiplayer mechanic, there are enough cars and races in the version available for you to play and not get bored. Overall, it's a very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Better than GTA V.",
            "review_score": "1"
        },
        {
            "review_text": "Drive around aimlessly or race across the city! Paradise is one of my favourites in the the Burnout series and offers a wide range of cars and bikes with different abilitles and uses, some cars are more suited for races and others for events that requre stronger cars!  Burnout paradise is a must buy for anyone! 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Honestly its a game that gives you the simple joy of driving fast and wercking the ♥♥♥♥ out of cars ",
            "review_score": "1"
        },
        {
            "review_text": "Game does not come with box. Don't be fooled.",
            "review_score": "1"
        },
        {
            "review_text": "ALL CARS MUST BE CRUSHED!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great driving game to pass the time. Burnout always me of San Francisco Rush.",
            "review_score": "1"
        },
        {
            "review_text": "The Nostalgia is real (love this game)",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Gets game &gt;Spawns in the first car &gt;Spends 10 minutes figuring out controls  Okay, so legit the starting controls are:  A- Accelerate  Left/ Right Turn- Arrowkeys  Like legit what is this  Other than that, an awesome game  ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Fun to play alone, even more fun if you play with your friends. So if you get it at a discount go for it. The only downside with it though is that you can't buy the cars from the shop, unless if you live in the US. And even then it's like 10$",
            "review_score": "1"
        },
        {
            "review_text": "Best casual driving sim I've ever played, Simple yet so much fun. Plus it runs on lower-end PC's so Keep that in mind, I used to run this on intel-intergrated graphics and it ran 30+ fps. Highly reccomend the Vanity mod, adds a small island thats fun to cruise on.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game, but with some things that bother me. First of all, I have no sense of direction, so this might only apply to me: The racing part of this game is really challenging if you have no flippin' clue what roads to take or where to go. I also don't like the fact that you have to register and make an online license and stuff, but that hasnt been too much of a hassle so far. Overall, I can enjoy the crashing, the music and the cars in my own pace. So it's all gutt.  I'd say a good buy if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This remains, and probably will considering Criterion is a husk of what it once was, the best arcade racing game available for PC. The driving feels tight, the open world is just big enough with good variation in locales, and the crashing looks fantastic. If you need maximum eye candy there's an enbseries .dll floating around for the game.   The multiplayer has both event based modes and a mode where you set objectives for everyone to complete co-operatively while 'freedriving'. You'll have to manually add friends through their EA account to play with them which is kind of a pain but worth it in my opinion.  The online portal and news splash page are all gone now so you have to close blank white screens now and again. You can no longer buy any of the DLC ingame and have to buy it on Amazon to add to the Origin version. Luckily, you can copy your Steam key and activate it in Origin if you desperately need to pay $10 to drive around in the Knight Rider car.  BE ADVISED: This game does NOT have Steam Cloud support nor does it retain your save game when you uninstall the game. BACK UP your save unless you want to start over every time you get the hankering for some high speed wreckin'.",
            "review_score": "1"
        },
        {
            "review_text": "I'm on my way to the paradise city!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Take me down to the Paradise City",
            "review_score": "1"
        },
        {
            "review_text": "Best way to mod a car ? Pile another one into it ! This has been public service announcement message brought to you by CRASH FM.",
            "review_score": "1"
        },
        {
            "review_text": "It does not mention but it has full controller support. you can play with an Xbox controller and its works fine , layout changes to match with the controller.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun racing game EVER.",
            "review_score": "1"
        },
        {
            "review_text": "Besides EA showing the middle finger to all steam users by offering 'The Ultimate Box' and closing the in-game store, the game was and is quite a fun one.  Don't expect any storyline, nor any customization besides changing the color of cars, but besides that you'll find a solid fast-faced gameplay from which you squeeze a lot of hours.",
            "review_score": "1"
        },
        {
            "review_text": "If you're like me, you suck at racing games because it actually takes skill and talent. Luckily, this game is just all about crashing into things, which makes me a master at this game.",
            "review_score": "1"
        },
        {
            "review_text": "YOU CRASH INTO STUFF  yeah its really fun and it isnt all about racing",
            "review_score": "1"
        },
        {
            "review_text": "its awsome",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "I love all of Burnout games. Burnout series is the best racing game on the world. Here is the reasons;    Very realistic phisics    No lags    Right amount of bugs [list/] Just a bad side; I CAN'T F*CKING FIND HOW TO EXIT THIS BEAUTIFUL GAME  ",
            "review_score": "1"
        },
        {
            "review_text": "100%'ed this game on 360. Best arcade racing game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun but unless you have 7 friends whom also own the game and are willing to play then you don't have much of a chance to beat the challenges(missions).",
            "review_score": "1"
        },
        {
            "review_text": "Sick game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! A lot's of fun!",
            "review_score": "1"
        },
        {
            "review_text": "i at least spent 80 hours on this piracy game,and i feel very guilty about it so i bought it it is old game so for now it is not a very interesting game but it bring me lots of fun and kill time 我至少玩了80小时盗版，这游戏很值得去买 虽然现在过时了，不过那时很有趣也很能杀时间，无法忘却",
            "review_score": "1"
        },
        {
            "review_text": "Paradise City...seems nice. I'd go there, seems like a decent vacation place.   ...so yeah, this game is fun. Probably the best open world racing game I've ever played. I usually don't much care for car games, racing games and such besides Mario Kart. This game however, is fun. It gets a little tedious from time to time with the whole 'every stoplight is a race' (which actually means the starting point changes but the finish line is one of the same 5 intersections so you basically race the same race a few hundred times but in different directions and sometimes different ways) but its fine.   I enjoy a lot about this game, but I can't fully explain why. Its just well crafted...the vehicles are fun to drive, and although its easy to crash and get offcourse from bad GPS directions.. thats part of the fun of it.. is making your own path through the city, through the cliffs and buildings and traintracks and intersections and ...those stupid cars.   Overall, it is good. If you want a racer that is more than just race around a generic racetrack, then I'd say totally go for this.",
            "review_score": "1"
        },
        {
            "review_text": "I have bought Burnout Paradise 3 times. The PC version was my most recent purchase for mod purposes and playing when I don't have my saves and crap on Xbox 360. For DLC purposes (Cops and Robbers and the Island DLC were never released for PC), but the DLC 4 pack code off of Amazon and install through Origin, EA's crappy version of Steam. I'm having fun replaying the game listening to the Burnout Soundtracks of previous games. Oh, by the way, TAKE ME DOWN TO THE PARADISE CITY WHERE THE GRASS IS GREEN AND THE GRILLS ARE PRETTY!",
            "review_score": "1"
        },
        {
            "review_text": "Very funny, as a game should be. Great soundtrack and most non realistic mechanics ever makes this game the one choice for those who want fun above stress. Just drive, smash someone's car, fly over bridges, run agains psycho drivers, and stuff :D Recommended. Test Drive: Ferrari Racing Legends is the evil-twin, the most (worst) hard driving mechanics ever :/...",
            "review_score": "1"
        },
        {
            "review_text": " Still fun after all these years. Too bad the store is gone :( Then again who needs it. Their's plenty of cars to choose from. And best of all it's still online. :D Play it now before EA takes it offline (Or when/if the sequel replaces it). ",
            "review_score": "1"
        },
        {
            "review_text": "going 300 mph, still uses turn signal.",
            "review_score": "1"
        },
        {
            "review_text": "What a game!!  Best sound and gameplay ive seen for the bike part of the game that is, in ages. Well worth the buy ",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite racing game after Burnout Revenge. The only flaw I found is that the addon no one knows about didn't get a release on PC.",
            "review_score": "1"
        },
        {
            "review_text": "One game of my childhood, this says everything",
            "review_score": "1"
        },
        {
            "review_text": "At the time of writing I've played Burnout Paradise for a couple of hours. Overall I would recommend it but it has its problems and it is by no means the best Burnout game I've played. The arcade-style driving is really good fun, so much so that on the strength of it alone I will recommend the game. The cars are easy to handle even at the preposterous speeds you will normally be travelling and the game is fairly forgiving when you hit into walls and barriers. There are a large variety of cars of various types and you unlock them at a pleasing steady pace. There are no real world cars but that doesn't bother me becuase cars are boring.  To try out events you simply stop at an intersection and press a button. On the whole the event types are good. There are a few subtly different types of races and a mode in which you have to destroy as many cars in a time limit There's also a mode that's new to me called 'marked man' where you have to get across the city in one piece while a load of other cars try to destroy you. It's good fun if (so far) a bit easy. One let down is the crash events. In older Burnout games these would be carefully choregraphed sets which required ingenuity to score high damage. Now you simply crash into whatever happens to be in the section at the time. Success in this mode now feels more luck than design.  Throughout the city there are tonnes of jumps and shortcuts. Just driving around with no purpose but to find these is very fun and this is when the open-world setting is really played to its strengths. On the other hand, the open world setting also has the effect of turning races more into exercises of navigation than driving skill or tactics. So far whether or not I have won a race has depended almost entirely on which route I take and not really how I take it. Every race has proceeded thus: the race starts and within 20 seconds at most I have a healthy lead, then I'm not sure where to go because the mini-map is so zoomed in so I take a road which heads in the general direction of the finish line, that road turns out to be a windy road with no exits which takes me back in the opposite direction, then it either it takes me too far out of the way and I quit the race (and annoyingly there is no way to restart the race) or its a minor enough inconvience that I can make up the difference over the other races who all drive incredibly slowly. Now in time I can see that I will get used to the layout of the city and this problem will dissipate as the city is reasonably small. But I imagine this will lead to boredom at the familiarity of the tracks and the setting.   The game is well presented though the menus can be a bit confusing to navigate and I hate being bugged all the time to register online. The soundtrack is reasonably small and consists mostly of bland rock music (but with notable exceptions). Additionally, the DJ who talks to you frequently has already started to grate on me. I imagine he will become insufferable if I put many more hours into the game.   Overall still a good arcade racer but I can't help feel it would have been better to ignore the trend of the time for open world locations and just give us another solid entry in this enormously enjoyable franchise.",
            "review_score": "1"
        },
        {
            "review_text": " Burnout Paradise: The Ultimate Box  (alternately known as Burnout Paradise PC) is a re-release of Burnout Paradise with all of its free updates and Game Changing Content Packs which include Astaire, Bogart, Cagney, Burnout Bikes, PlayStation 3 Trophies (PS3 Version), the Party Pack and the Free February Update.    source   [burnout.wikia.com]   The DLC was never included, people need to stop ♥♥♥♥♥ing. You can still buy the DLC from Amazon. The game is awesome without it anyway.  Burnout Paradise is great,  Lots of content, car smashing, a whole city to explore, great graphics, controller support, good music (Guns N' Roses!)... what's not to like?  I personally miss the aftertouch takedown from previous games but whatever, still a good time.  BTW cars in this game have no drivers which is quite weird.",
            "review_score": "1"
        },
        {
            "review_text": "Years later, this is still the greatest driving (arcade) game ever. Please, please, develop another one. I own this on PS3, Xbox360 and 2 PCs... and I'd kill for the island on PC. Literally. I would kill.",
            "review_score": "1"
        },
        {
            "review_text": "If i could describe this game in 1 word... Horrid. Dont buy this.",
            "review_score": "1"
        },
        {
            "review_text": "If you have a Logitech G27 racing wheel and you're looking for a fun game to play, get this one. I originally purchased a simulator racing game to use with my wheel. It was DiRT Rally. I like that game but I was looking for something more of an arcade style. This Burnout Paradise game is definitely fun. I've played this WAY more than DiRT and I've had DiRT for a longer period of time. Anyways, I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Open world racing at it's finest. Drifting around corners is addicting. So is flat spinning and barrel rolling off ramps. So is ramming other drivers into walls and oncoming traffic. The game even rewards you for doing that, and has a game mode for doing it. xD Doing Freeburn online is a great, somewhat relaxing time waster.",
            "review_score": "1"
        },
        {
            "review_text": "This game has it all. Cars. Crashing. Racing. Crashing. More cars. What more could you need?",
            "review_score": "1"
        },
        {
            "review_text": "It's fun man.",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun car game",
            "review_score": "1"
        },
        {
            "review_text": "It is really fun to play, especially when you smash people into walls!! ( ^_^) ",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game. It has cool cars, lots of crazy driving and ... Radio! Who doesn't like a good radio channel. But I have a confession ... I haven't completed it. It's like Just Cause 2 and GTA. You just don't complete it. At least me and other casuals don't ... often. Ok, back to topic. (Personally) like the controls.  Recommended :)",
            "review_score": "1"
        },
        {
            "review_text": "one of the best game ive played so far",
            "review_score": "1"
        },
        {
            "review_text": "I Love this Game if you want to smash cars in very cool graphics this is the game you can even play with your friends! :D\\ I give this game 5 stars and A+++",
            "review_score": "1"
        },
        {
            "review_text": "Burnout, a franchise high in crashing cars that doesn't bore you fast.  Paradise city is one hell of a city, so many challenges and even more if you take it online.  This game I enjoyed a lot, and racing through it was surely the most fun thing ever.  Also the party mode makes for a nice party game, it might be a bit steep for non burnout fans but if you go first the other players will be able to follow you fast and crashing.",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you are bored, however is a bit repetative after a while",
            "review_score": "1"
        },
        {
            "review_text": "Haven't enjoyed a racing game since 2004's Need For Speed: Underground 2. Lot's of stuff to do here: races, stunts, takedowns, etc. My only gripe is the absence of licensed cars. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "cars, cars and more cars",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!!! I got it back at the begining of july when it was on sale for $5 I didnt think it was going to be this good!!! Ive had it for 2 months and still play it at least 30 minutes a day. Gameplay and controls are great to also there is a great selection of cars!!!!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing, not to mention cheap, racing game!  Although this game is not a SIM (I can not stress that enough), the game is absolutely hilarious at some times, gruesome at others. Particularly amazing with a controller in hand, for when you just feel like causing some road rage.  Burnout Paradise is an open world game, with absolutely no story, but a tonload of fun, and should be picked up by anyone who enjoys the occasional havoc and chaos.",
            "review_score": "1"
        },
        {
            "review_text": "I was afraid that the whole 'EA account registration' will screw up my whole enjoyment. But it turned out just fine. Multi-player is awesome, you can compete with people on various objectives or take them down if you wish and make you want to return the favor and chase them all over the map.  The game is totally worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "This game cheats where it possibly can. Not really worth the money, unless you have friends to play with. Because online it's stupidly fun, but the singleplayer is kind of meh.",
            "review_score": "1"
        },
        {
            "review_text": "This is pretty much the greatest racing game ever made. Just saying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good; its not like regular sandbox racing games. Billboards, fences, jumps, cars, bikes, traintracks, everything makes this game interesting. you might be able to learn the map, but it doesn't make it easier to navigate throughout it. This is way better than NFS: Most Wanted, but that's just what I think (maybe I just like the radio anouncer that talks to you all the time). Sometimes it may get boring, but turn down the game volume, and just put on some intense music, and you'll feel like your in an action movie. :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Not only is the racing world open, but the race is by itself open. This means you don't get a selected route through which you drive your car to victory. You get to take whichever route you think is the shortest.  The gameplay is quite different from what most people are used to so it takes some time to adjust to it. It can also be frustrating. Take a wrong turn right at the end of the race that you've been leading for 95% of the time and you will lose.   My only complaint against the game is that it could have had partial GPS to make things a little easier (like fix some way points at least ?). Otherwise this game is great and you should try it.",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the best arcade racer for PC in last years. Huge city, fast cars, attractive crashes, different modes...This is the asphalt counterpart to flatout.",
            "review_score": "1"
        },
        {
            "review_text": "Best car game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure where Someone thought this was a post apocalyptic racing game..it is not... its just a sandbox style racing/crashing game with many modes of play.. and a fun way to vent your driving aggression out the way you cannot legally or realistically in Real Life. I minor Downer was I bought this when they advertized several of the purchasable add-ons including a hovercar.. which it turns out was only available while the game was being supported by the console community and Criterion games. But I have enjoyed hours of slamming cars off the road and searching out all the secrets in the City. A great addition if you have liked the other Burnout franchise games.",
            "review_score": "1"
        },
        {
            "review_text": "Owned this game for a long time before I ever got it on Steam. Fantastic arcade nonsense racer. Fun cars, and bikes. Cool challenges and a fairly decent open city to find them in. Soundtrack had good and bad as most racing game do, but overall had a great time and put a lot of hours into before I moved on.",
            "review_score": "1"
        },
        {
            "review_text": "I've heard mainly good reviews from this game for a while, and finally decided to try it out (when I mean finally I mean three months ago...). And fortunately I was not not let down THIS GAME IS AMAZING the controls are top notch for mouse and keyboard and for the Xbox 360 controller (which I prefer but mouse and keyboard is just as good). Truthfully there isn't much of a story (which is practically just trying to be the best racer that ever hit the streets), but the gameplay is excellent and the AI isn't bias (in other words they won't be trying to just get you they will rain on anyones parade, including innocent bystanders). During races the game is truely open world, because you don't have a set path to take to get to the finish line of a race. There is also a good amount of cars in the game which you can use in burning routes to get a newer hotter sexier version of those cars. Even the online mode is a satifying and fluid experience where you can excess it in a moments notice from the single player mode. But there are a couple of cons the first is the whole open world deal, the problem is if you don't know the map well u may be screwed in many instances during a race (as was I). The other part is that even though there is like 100 events once you get far enough in the game you start repeating them a lot, but due to the overall entertainment of the game it is still fun (believe it or not it's your opinion). So if I had to rate it I would say 8.5/10, due to the fact it is perfect but there are a couple of set backs.",
            "review_score": "1"
        },
        {
            "review_text": "I may not have much hours played here, but believe me, i passed this game i can't even remember how many times. This is definitely one of the most fast-paced, full of madness racing games you'll find on PC. Well, unless Criterion will make another Burnout, which probably will beat this one, as the series so far only got better (update - Burnout Paradise 2 is out under the name of NFS Most Wanted 2012). There are no such unnecessary things as scenario, overboard realism or car overcustomisation, these all can't cover up bad gameplay, and latest NFS proved it. And this game is all about crazy arcade racing. Even if graphs were bad and cars weren't so various, i still would definitely play this game. If you haven't played it, you don't know what arcade racing is about.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most fun racing games I've ever played. It's great to just drive around without any objectives sometime, but if I'm in the mood to compete, there are starting points everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "It's always fun to take to the streets with a fast car. It's  much  better when you can bump somebody into a bus at 200mph.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome racing/crashing simulator. Highly recommended to any racing fan 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A tragic tale of a post apocalyptic world where sentient cars drive aimlessly around a city that is devoid of human life and smash into each other and do races to find some purpose in their cold metallic existence.",
            "review_score": "1"
        },
        {
            "review_text": "Every single time you start the game, you start with the same routes available to you with the same car and the same song (Paradise City, naturally) blaring. And it never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "Best racing game I've ever played, simply because of the ridiculous crash physics.",
            "review_score": "1"
        },
        {
            "review_text": "Hugely entertaining arcade racer, hi octane speed around an open world city and quite possibly the best crashes around. Hours of entertainment straight out the box.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of this writing, this game is $5. I don't know a lot about driving or car combat, but I love this game. It has big impacts, a huge open world, and just generally a fun aesthetic. It doesn't take itself too seriously, and what it does, it does right. This game changed my opinion of racing games. You should buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "off the first 5 hours i played this game, this game WOW'D me, i mean sure its like a bunch of other racing games out there namely the Need For Speed series but this game has something about it that attracts you towards it and makes sure you keep playing it over and over",
            "review_score": "1"
        },
        {
            "review_text": "If you like racing games Burnout is one of the better games out there. Also has a very excellent cycle portion to the game. Only cons I have with it are that it's a console port and the intro music is enough to drive someone crazy. :D",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite arcade racers, it is really fun to spend hours free roaming the city, which is full of stuff to do and is wonderfully looking. There are many cars to unlcok and bikes to drive, the multiplayer is also quite fun, it's a shame that the community is almost dead tho.  Overall, it's a really enjoyable game which almost anyone would like.",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't have as much emphasis on crashing as others in the series, so it's sort of misleading to give it the Burnout name. But it's still pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game if you like to crash your racing car :P",
            "review_score": "1"
        },
        {
            "review_text": "Drive all around and crash into ♥♥♥♥. Recommend",
            "review_score": "1"
        },
        {
            "review_text": "Great driving game for those of us who aren't super 'into' racing games. Open world map with random challenges throughout make it much more relaxed feeling than just constant nail-biting racing. Graphically beautiful. Worth it for the challenges too.",
            "review_score": "1"
        },
        {
            "review_text": "Great time killer, pure adrenaline rush, when you get it right it will make you smile. When you get it wrong, it can be glorious at times. I find myself ranking up without even knowing it, open world is great, game looks great, plays great, a must have for a popcorn 'racer' just simple go fast fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourate arcade racers. Its almost perfect its just a shame they shut down the DLC server and didnt bring over Big Surf from the consoles",
            "review_score": "1"
        },
        {
            "review_text": "It's not just a box, it's the ULTIMATE box. These ♥♥♥♥♥es at citroen games better explain why there isn't a single box in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! the realistic crashes and racesing system make this game a must have!",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, but it tried to do something new which set Criterion games back to the drawing board. With the transition to an open world, a lot of things that made the past games great were lost in translation. Some people say its showing its age(?), but it really isn't. Keep in mind this 'Ultimate Box' doesn't actually come with the DLC, but only the free updates that were given out to the game. lame af, but whatever. Still though, its a good game and you can find it pretty cheap on sale these days. Also if you can play the older games like Burnout 3 and Revenge, because they're complete gems.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best,most enjoyable racing games out there.A must-buy,in my opinion.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "pls burnout paradise city 2",
            "review_score": "1"
        },
        {
            "review_text": "The game is freakin' crazy  However I easily get boring with it Maybe because the graphics is outdated now? Im not complaining about it since the game is alr 5 years old. Worth trying 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is the reason why I don't have a driver's license.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't even know I had this game  Played it on console, it's pretty nice. Worth buying on a sale",
            "review_score": "1"
        },
        {
            "review_text": "Crash and burn baby!",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable, great fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, it has alot of action and really gets you hyped at bits, it really shows off how good it is at the destroy-cars-while-going-at-fast-speeds missions, those are awesome, you really get a sense of speed, it generally makes you feel 'cool' in a way. The only down point is that the missions can get repetetive and you can get bored if you play for too long.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that will never go out of style. Sometimes you just wanna lay back and do stupid ♥♥♥♥ in a car to pass the time. Sometimes you want to do it with friends. This game gives you all of that.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game - even better with a controller",
            "review_score": "1"
        },
        {
            "review_text": "9/10 like Skyrim with cars, but prone to crashing",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome game although it glitches when trying to save once in a while, also...THERE IS NO DRIVER IN THE MAGIC CAR! I r8 8/8 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Realistic car crash, love it but kinda boring, idk. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game. First had it for the Xbox 360 then got it here. Weird playing a racing game on a computer but if u have a controller u should be fine. Amazing graphics and cool cars. Some things in the store are not available for some reason but whatever. Probably the best Burnout game next to Burnout 3: Takedown.",
            "review_score": "1"
        },
        {
            "review_text": "Even though this game was released a while ago, the graphics are still breathtaking and the crashes are still unmatched by any other mainstream game. I do miss certain aspects that were present in the older Burnouts, such as a proper Crash mode, but Paradise has so much to offer and has aged very well.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best racing games that I played.",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this game for quite a few years. I originially owned it on Xbox 360 but bought it during a Christmas sale when I switched to PC. I'm not huge on racing games, but I've played my share and I've played other Burnout Games in the past. This game lives up to its name Paradise in that you have a fairly large open world setting to drive in. You aren't bound to any races and can simple drive away if you don't want to finish it. The graphics, even for a dated 2009 game, still have an attractive appeal. I would reccommend this game to anyone who likes to race but doesn't want the strategic racing and just wants to bash and run into ♥♥♥♥. This games a riot.",
            "review_score": "1"
        },
        {
            "review_text": "You drive a car or bike, use your turbo and crash. Mindless fun with great music! However EA has pulled the servers so there is no legit way of unlocking any of the DLC vehicles. Also by no legit way I mean there is a trainer posted on the Steam forums.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome game although it glitches when trying to save once in a while, also...THERE IS NO DRIVER IN THE MAGIC CAR! I r8 8/8 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "U gotta love this one, on and on! Good graphics, music and game play, just give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game especially when you got a steering wheel.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, if you like proper street driving, then this is perfect",
            "review_score": "1"
        },
        {
            "review_text": "This is the best arcade racing game I ever played. Dont care if it is real Ultimate or not.",
            "review_score": "1"
        },
        {
            "review_text": "Best arcade racing game everrrr. To buy the DLC, you can buy a key from GMG or Amazon. Shame developers stopped supporting it since PC version is missing two DLC packs...",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game with many hours of game play. I would recomend it to almost any age group because there is no pedestrians to run into or any thing bad the only thing wrong with the game is the song choice but you can choose to skip a song. 2 thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Open-world design creates a great sense of destructive freedom.",
            "review_score": "1"
        },
        {
            "review_text": "Best of his kind...   10/10 masterpeace",
            "review_score": "1"
        },
        {
            "review_text": "Too good for a game that created in 2009, Perfect graphics, Nice gameplay, Customizing cars, all good.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing and i love it but steam should totally make us able to buy burnout 3",
            "review_score": "1"
        },
        {
            "review_text": "Tire consumption? Since when! ",
            "review_score": "1"
        },
        {
            "review_text": "OK, First let me get this out of the way in saying that THIS GAME is one of the coolest free roam/open world racing games out there STILL in 2014, it's addicting, it's fun and it's got everything you'd want from crashes that make you go 'OHHHH' to graphics that still drop your jaw. the game is pretty.   Now that that's all done, let me tell you where this game falls short:  DLC, I know you might be thinking 'But there's DLC out for the game, how can it fall short?!' well I'll tell you! the only way to currently get DLC is by buying it on amazon for origins and linking your account to EA which will download it for the steam and origin version (apparently.). There's no way that I've found (legally) to get the DLC other than amazon and it's a shame! some of the stuff looks legitimatly cool as hell!  Listen...listen. I love this game, I really really do. this game is perfect! I got it cheap for the humble bundle sale they were doing and I fell in love with it all over again! I'm just a little disapointed in the DLC aspect (which. once again can be fixed through amazon.) but buy this game! you really can't beat it, it's a top of the line game and everything about it is just great!  EA, if SOMEHOW you're reading this I want you to know two things:  I won't download the DLC illegally and plan on picking it up through amazon.  Please consider adding the DLC to steam so people don't have to do work arounds. We still love you.",
            "review_score": "1"
        },
        {
            "review_text": "Great game this. I bought this for the Xbox 360 the day it came out and still play it quite often to this day. I was stoked when I got it here on Steam however I find the online modes are a bit of a let down as most people play on consoles and the fact that the DLC is no longer available is also quite gutting :( All in all it is a great game to mess around with and have fun and I shall keep playing it both on Steam and Xbox until they shut the servers down :)  8/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing and i love it but steam should totally make us able to buy burnout 3",
            "review_score": "1"
        },
        {
            "review_text": "This is the COOLEST raceing free roming game out there. Do anything you want in any car you want. And it looks amazing!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game i love all the races and challenges. all in all it is an awesome game",
            "review_score": "1"
        },
        {
            "review_text": "This has been a blast. Fast cars, fast crashes, and fast fun.",
            "review_score": "1"
        },
        {
            "review_text": "Open world. Guns and roses.... and open world. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the greatest racing game ever created.  Yes, I will go that far in my praise.  The driving physics are Burnout. That would be enough said, but I should elaborate that they are very arcadey, very slidey, and so much fun.  Really, buy it for the multiplayer. Freeburn is incredibly fun, especially in some of the more ridiculous Freeburn Challenges.",
            "review_score": "1"
        },
        {
            "review_text": "Good: -Open world -lot of different cars -up to 8 friends can play together -very cheap (bougth it in sale for 1,50€)  Bad: -cars only singleplayer unlockable -cars arent 'tunable' -missions arent very different  Conclusion: Burnout Paradise is a good game to have a funny afternoon with friends or to play it sometimes if you are bored  Points (7/10)  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is freaking amazing !!!!!!!!!!!!!! &lt;3  best car/race game i ever played &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This is the game of my childhood  -Nice graphics -Awesome gameplay 10/10",
            "review_score": "1"
        },
        {
            "review_text": "bump into a car - rekt bump into a streetlight - rekt bump into a house - rekt smoke wed everyday - rekt ride the toy cars that a man cant fit in - shrekt ride a wagon - dosent start - rekt l am writing this ♥♥♥♥ - wasted bought to fulfill my hunger at burnout games this game contains loominaty sign - very spook rating this game 10/snoop rekt edition best game evt",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't get boring even when you unlock 100%",
            "review_score": "1"
        },
        {
            "review_text": "One of the best aracde racers of the last decade. On the negative side: you can't purchase any DLCs for this version, the Burnout Store is offline.",
            "review_score": "1"
        },
        {
            "review_text": "pls burnout paradise city 2",
            "review_score": "1"
        },
        {
            "review_text": "This game keeps on bring me back even years after its release. Do your self a favor and buy this insted of something like the crew.",
            "review_score": "1"
        },
        {
            "review_text": "a better title compare to NFS",
            "review_score": "1"
        },
        {
            "review_text": "burnout paradise is a fun racing game which i first played back in 2011 on my birthday and it was a lot of fun back then and it still is a top notch racing game in my opinion today i first got it on origin but unfortunately lost the game and i was sad but thanks to Valve and Steam i was able to find this game and rebuy it. burnout paradise has a very good damage engine and is very fast once you get some faster cars. it is also optimized for my laptop and works like a new game for Windows 10 this is still one of my favourites and when I have some time i usually go to burnout paradise. i recommend this game even though the later dlcs after party play, bikes and cagney dlcs are not there the game is still fun even without them. i give this gam a 9.5/10 only because the dlcs don't work.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game i love all the races and challenges. all in all it is an awesome game",
            "review_score": "1"
        },
        {
            "review_text": "u gotta patch ♥♥♥♥ if u want the DLC but this is one of my faves",
            "review_score": "1"
        },
        {
            "review_text": "very fun, creative, and very open thanks jacksepticeye for showing me this game love it def recomended if you like open racing games",
            "review_score": "1"
        },
        {
            "review_text": "Best free roaming racing game for 10 bucks 4/20 IGN",
            "review_score": "1"
        },
        {
            "review_text": "You choice your way , not the developer !",
            "review_score": "1"
        },
        {
            "review_text": "'God, I'm going fast...God, that was close...God, I got ♥♥♥♥ed up...Stupid van...'  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game. The only thing I wish were different is how easily your cars will obtain noticeable damage. It just really messes with my OCD lol. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Take me down to the Paradise city where the girls are green and the grass is pretty",
            "review_score": "1"
        },
        {
            "review_text": "I don't have much to say about this game in sentances, so I'll just go on with pros and cons. Pros: +Good graphics +Not lagging +Cool map +Open world / freeroam +Has races too (quests) +Supports controller  Cons: -Sometimes crashes the whole steam app when exiting -Multiplayer can be really frustrating (But thats what the game is about, right? Yep, I just dont like it that way.) -No DLC added in this game. (YOU HAVE BEEN WARNED!)  After all I think its boring and you can't really play it for 100+ hours while beeing entertained all the time. Its cool with all the crashes but its not really the thing I was looking for. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is 7 years old and it's still one of the most amazing car games to exist.",
            "review_score": "1"
        },
        {
            "review_text": "I quite enjoyed this version of San Francisco Rush",
            "review_score": "1"
        },
        {
            "review_text": "This game in 4 words: Chaos, Destruction and Fun",
            "review_score": "1"
        },
        {
            "review_text": "It's all about driving fast and seeing what stunts you can pull off. Great fun. Burnout online adds to the fun.",
            "review_score": "1"
        },
        {
            "review_text": "the game is not working at my pc ,its get out when is loggin throught my online profile ",
            "review_score": "1"
        },
        {
            "review_text": "Kinda fun, gets boring after a while since there are no specific goals though. However, the game itself looks beautiful and speeding across the streets feels amazing. I give it a 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Played the heck out of this one on Ps3..  1. Open Spotify 2. Look for Burnout 3 OST 3. Play while listening to oldschool Trax 4. Nostalgia Overkill  Closest as you can get to the oldschool series",
            "review_score": "1"
        },
        {
            "review_text": "must activate key on origin to play online doods...    amoozin game",
            "review_score": "1"
        },
        {
            "review_text": "Really cool game just wish the ultimate box came with the dlcs other then that the game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "i find frustrating how when my gmail got deleted it removed my burnout account and now i cant create a new one with my current gmail because the cd key is invalid any help please its still a good game though",
            "review_score": "1"
        },
        {
            "review_text": "A fun and beautiful game with a lot of cars to unlock and wreck. I played this game and thought I was a master of the road. Then I accidentally played an online multiplayer game and then realized some people do nothing other than play this game.... umm I hate them. However it is a fast fun and interesting game give it a shot it couldn't hurt its a burnout game after all.",
            "review_score": "1"
        },
        {
            "review_text": "the game crashes evry time i go into audio settings apart from that its a great game",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. I only wish that some of the older game mods would have made a return. One of my favcorite modes was the one where you crash your car and earn points to see how much havoc you can create. This has been replaced with stunt driving, which is also really fun.  Overall, the cars and collisions still look great compared to something in 2016, its the world and environment that has definitely shown its age.  The game itself is really addictive. Cars are fun to drive, every single game type feels fun and replayable and the steady stream of unlocked cars keeps the momentum going.  Hopefully we'll get another one of these games in the future. It really is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "dispite what my profile might say i have 2000 hours plus playing this game on my xbox 360 and can i just say those were some of my best hours",
            "review_score": "1"
        },
        {
            "review_text": "this is just one of the best race games there was when it came out, and its still fun to play with friends..",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. Unfortunately, i don't like the fact that races are almost 'randomized' and they don't feel unique. It's a bit outdated now but still better than most Need for Speed games.",
            "review_score": "1"
        },
        {
            "review_text": "Burnout Paradise is the game Hot Wheels wishes it could make. For me, it lived up to the trailer. I've spent hours and hours playing the game; unlocking all the cars, finding and re-finding all the secrets, generally exploring Paradise City and cruising, or wreaking havoc everywhere. The game really pulls off a very, very awesome style (the soundtrack, the cars, the radio host, the city itself) that no other racing game that I've played matches.  THE BAD: - This game is 7 years old at this point, which is basically ancient history in the eyes of EA. And that means...  - The console DLC never came to the PC, and it never, ever will, even though I'd buy it in a heartbeat. EA thinks you're a loser for still playing this.  - THERE'S NO WAY TO TURN OFF THE TRAFFIC. This nearly killed any fun I had in this game. There are so, so many areas that are perfect for awesome stunts, huge drifts and pure racing, but you'll never unlock that full potential because some random hatchback or city bus is in the way.  - The AI cheats. Yes, this game is an example where having the fastest car doesn't actually matter, at least in the Marked Man events. The AI can and will always be on your tail.  I listed several dealbreakers above that would have probably deterred me from buying the game originally, but if I actually had to do it all again, I would over and over. Paradise is just too much fun despite its faults.",
            "review_score": "1"
        },
        {
            "review_text": "If you want it get it. Worth every second you spend on it, from wrecks to riches.",
            "review_score": "1"
        },
        {
            "review_text": "Open world racing at it's best. Great variety of cars, huge open city to drive and complete dynamic challenges in, great music, stunts.. what else do you need to relax and have a nice evening?",
            "review_score": "1"
        },
        {
            "review_text": "Best arcade racing game ever. Not even worth trying to agrue otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "Because sometimes you just want to drive, and some other times you just want to destroy something beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "how to drive left and right i cant drive it",
            "review_score": "1"
        },
        {
            "review_text": "One of the games you play when you buy it, then don't touch it for months and then play it for two days straight. Amazing",
            "review_score": "1"
        },
        {
            "review_text": "'Take me down to Paradise City, where cars unlock fast and the jumps are steepy, ooohhh ooohhh take me hooome...'",
            "review_score": "1"
        },
        {
            "review_text": "Burnout game cant go wrong always a blast smashing everything in sight.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I really appreciate skill based rally, where you have different types of vehicles, first motorbikes and cars, then cars: sports, aggressive, fast. There are many challenges, first you can ride free style through town and beat other online players records, then rallies: eliminating oponents, being chased, rally, drifting or flying competition with boosts. Especially you can find short cuts, bridges, billboards. It is all for cars, till now I played only one motorbike, you can ride on the back wheel and it gives you differents rallies. I recommend this to anyone who wants to kill time driving in high speeds, but the game itself is repetitive, everything is open to you, only cars and motorbikes unlock as you are winning more competitions. No storyline, this is basically just playing like sandbox, you are earning better driving licence, you use boosts in the cars which can be refilled in certain points, repainting cars, motorbikes can be designed to your liking but cars only in certain points. I am playing probably 5 hours and got as far from D to B licence, 25 more wins to get A. So I am curious what will happen, it seems there is more traffic now, also knowledge of map is more important as you will have to navigate yourself alone, no pointers, just one icon of the finish line in the distance. Game is very easy at the start, later on it is based on the skill and the type of a car that suits you best. I won this game, super awesome feeling. To win the game, you need to win 91 competitions.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Action Packed With Some Amazing Cars",
            "review_score": "1"
        },
        {
            "review_text": "If you love arcade racing, you're gonna love this one!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a ♥♥♥♥ing. But Seriously Awsome music with awsome racing, an open world and a million things to do. One of the best racing games ever",
            "review_score": "1"
        },
        {
            "review_text": "Love this kind of racing games. Gameplay and music is top!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun, but you'll have to work your way past the in-game sales features that were stripped out of the game when the developer abandoned it. This means that periodically, you'll hit a button or trigger an event that takes you to an all-white screen you have to mouse you're way out of. It may not sound like much, but it turns a complete product into a constant reminder about the developer didn't care about end users at all (oh, it's EA, no wonder).  Since they didn't have the decency to patch the game and remove the offending elements (as if that would have been to difficult), this game can be considered irresponsibly abandoned, and without warning on the store page, I can't up-thumb it in good conscience, regardless of how much I enjoy the gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game. EA ended support for this game. It's broken.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't play it, apparently when I try to create an account the maximum number of Personas have been reached and I can't register an account.  What? I go to EA's site but they don't have log-ins, its Origin. I log in to origin but don't see anything about fusing Personas. If I knew what the hell the issue was I'd fix it. I'm not the only one getting this either, Duckduckgo brings me a thread on EA's site where a lot of people have this issue, and it's been marked as 'solved' but its just 8 posts with people saying they have the issue with no solution in the thread.  ♥♥♥♥ this game. Also apparently 'The Ultimate Box' doesn't actually bring all the DLC as advertised. lol EA.   Steer clear of titles needing an EA account. Thank God for Steam's refund policy.",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who loves racing games, this one just never clicked for me. I sunk a good 50 hours into it back in the day on console and it was just okay back then. Any way you slice it, it is easily the worst of all the Burnout games (it's a shame the better games never made their way onto Steam). While a bit disappointing, Paradise was still a solid game at it's time, but it simply hasn't aged well. The city is bland, the cars handle very poorly and the takedown system gets really annoying over time. It seems we've had a deluge of open world racing games since this one launched, and with the exception of NFS Rivals, I'd say all of them are superior to Paradise in one way or another. Even The Crew, despite suffering dreadful gameplay, has a much more vivid and engaging world than Paradise. Not that this is a bad game, it's just the weakest in the series, below par when compared to more recent open-world racers, and for me, the “ultimate” kicker that turns this from a “buy during a steam sale” into a “no way”, is the fact that the game is blatantly falsely advertised. What EA meant by ultimate is a mystery seeing as it does not contain the DLC. Big Surf island, the most important piece of DLC released was never even ported to PC, and the rest of the DLC you have to purchase through Origin. How exactly is that “The Ultimate” edition?",
            "review_score": "-1"
        },
        {
            "review_text": "I'd rather drag my balls though 100 miles of broken glass then hear 'take me down to the paradise city' one more time!",
            "review_score": "-1"
        },
        {
            "review_text": "Another glaring example of how games are ruined because of the recent trend of injecting social and open-world elements. The first Burnout games worked because they were unique in what they offered. Now it's another drop in the bucket of overwhelming garbage where you can't just play the game without being bombarded with ranks and incessant social account reminders. But also the game is vague in a lot of ways and the camera was pretty irritating. If this were a physical copy, I would snap the disc in half and go play the first Burnout on ps2. At least it was fun the moment you booted it up without having to sit through half an hour of disembodied dialogue telling you all about how awesome it is.  Pros: I got this game in an ultra cheap Humble Bundle Cons: I got this game in an ultra cheap Humble Bundle Overall: The very first song it played to me was Paradise City by Guns n Roses. No.  Score: -0/0",
            "review_score": "-1"
        },
        {
            "review_text": "While the gameplay is fun and chaotic as it should be, the progression system is enormously unrewarding. Unless you force yourself to do it before then (completionism, yay), many of the cars will remain locked by the time you finish the game. The last couple of hours felt like a chore to me.",
            "review_score": "-1"
        },
        {
            "review_text": "It doesn't even come with the full game! Are you serious EA?",
            "review_score": "-1"
        },
        {
            "review_text": "It doesn't even come with the full game! Are you serious EA?",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game a few minutes ago, and I regret my purchase. I'm having tons of issues, and I'm quite upset about this. If I cannot get the game working, I will ask Steam Support for a refund. ;(   EDIT (2 Days Later): I have gotten the game working. Bugs (mostly) aside, here's my ACTUAL review below. --------------------------------------------------------------------------------------------------------------------------------------------------  For years, I'd heard little blurbs about this racing game called Burnout Paradise here and there. I'd seen it used at GameStop back when I was primarily a console gamer, but I never really paid it any attention. After seeing a popular YouTuber named NerdCubed do a video on it with his dad, I was sale hunting for this game.  The Steam Summer Sale came, and the game was $9.99 USD. A few of my close friends had the game, and loved it to death. I thought I'd pick it up, but it didn't just come with the game, nor just the DLC. I got an unwelcomed bonus - A NONFUNCTIONAL GAME. Multiple reinstalls, a lot of Googling, and hours of tinkering came before I got to properly experience this game. One problem after another bit me in the ♥♥♥♥; the infamous DMV screen, crashing at the loading screen right when you start up the game... yada, yada. I got the game to open occasionally; sometimes, rarely, the game would launch flawlessly, and let me play just fine. The other 8 out of 10 times, it crashed. Until I fixed it, I'd only successfully launched the game three times in two days. I probably made 30+ attempts to launch the game. I tried every fix I could find on the internet, and none worked. I eventually thought to try Windows 95 Compatibility Mode 'again,' or so I thought. I thought I'd tried it already, but I must not have! After applying that fix (some people can only get it to work on certain compatibility modes; some XP SP3, some Vista only, some Win2000 only, etc.), the game launches flawlessly. Now, the only bug I get is the game freezes when I try to quit. Saves fine, just I have to manually kill the process on exit.   Steam claims I've played 8 hours of this game. I don't know how many hours of that (probably about 2) are just me trying to get it to launch properly. The game is phenomenal! The world is pretty large, with about 400 gates to smash (which lead you to backroads and alternate routes), and about 200 (I think, I'm not exactly sure) billboards to smash. Many of these billboards require you to do jumps on ramps to get to them, many of these jumps being at the end of the alternate routes that lie past those gates I told you about. I usually overlook elements like that in games, but in Paradise, I like going around and smashing them! Every intersection with a spotlight is a new race. You simply do a burnout (hold both triggers) to start one of these events; you have events where you must takedown other cars, races, events where you have to get somewhere without getting taken down, and more. There's plenty to do in Burnout Paradise!  There are over 75+ cars to choose from, as well as four bikes (which I think are more fun than the cars) added by the Burnout Bikes update included in The Ultimate Box. Allow me to note that TUB was a collection of all DLCs released up to that point; Criterion had no intention to keep making more expansions when they released TUB, but they did, The Burnout Store is down, so you can't buy the other DLCs if you don't go onto either Amazon or GreenManGaming and buy a code. The racing style is very arcadey, but you can also do barrel rolls and stuff when you do jumps, which feels very good and solid. On the cars (and cars ONLY, not bikes) you can boost your vehicle. You have different types of cars like Aggression (for takedowns and strength for when you crash) and Stunt (which are faster and more for doing stunts, but crash and are wrecked very easily). The driving in this game is great, and feels amazing.   The graphics in this game are pretty good, as well as the overall feel. My 650m cannot run it at maximum settings, but my buddy's dual Titans smoke it. It is a pretty good-looking game, especially when you crank it up. The visuals department is top-notch!  The soundtrack is amazing, although there's only one song I really pay attention to - 'Paradise City' by Guns 'n' Roses. That song alone makes the soundtrack AWESOME....!   Overall, Burnout Paradise is a great game. Bugs aside, I give it a 8.5 out of 10. However, with the bugs in the mix, I give it a 2.5 out of 10. I would not recommend it; it may or may not work for you. I don't think it's worth the risk unless you get it off Origin, so you can return it within 24 hours with their Great Game Guarantee.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful! This game is nothing like the Burnout I remember. It is really lame and I'll tell you why. Also, the game is called 'The Ultimate Box' but it features NO DLC! It was the same price on Origin, and it would have DLC.   The soundtrack of the game ain't bad at all, I actually picked up on quite a few songs.  The big problem is the racing. I wonder who came up with the bright idea of a race in the open world.  I don't know. The game is not amazing. Watch IGN's review, for the first time I geuss they are really credible.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really what i was expected.. Crash Physics is ok,but the car i rammed just crashes into a corner and not fly  it takes 3 presses of F1 to just quit and save the game Navigation sucks,i always get lost in a event. Does not let you ingame without login  but overrall 6/10 but i wouldn't recommend unless you want to..well,do the things above Burnout Legends is better",
            "review_score": "-1"
        },
        {
            "review_text": "0/5 wouldnt buy, basic EA ♥♥♥♥ = doesnt work",
            "review_score": "-1"
        },
        {
            "review_text": "Negative: - No options in singleplayer to configurate the keys/buttons for keyboard or controller. - You can not 'end the game', you have to tab out to the desktop and end the game through right click - &gt; close program if you want to quit playing. - Game has no own tracks, you just drive through the whole world where events will be started - Multiplayer partymode is a joke. 3 short quickmodes which are done in under 30 seconds.  Really, this is absolutely crap, developed without heart. Dont buy !",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, but no DLC",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible and brings great shame to the burnout franchise. Burnout 3 and revenge are much much better. This game is totally redundant and a waste of money. I'm sorry I bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "DON'T BUY IT!  Origin account got hacked. people tried to buy stuff on my card. my card is always empty. they failed miserably. I went to close my origin account.  EA say 'if you delete your origin account it will delete all of your games on origin.'  i dont care. i only had BF4. Without telling me they linked my starwars the old republic account to origin.  They deleted my account and £150 worth of in game items. Also deleted my burn out account and would not let me make a new one with my product key. GG. ♥♥♥♥ burnout. ♥♥♥♥ origin. ♥♥♥♥ EA Never again will i ever have anything to do with EA and I recommend anyone else reading this to take the same path. ♥♥♥♥♥est customer support EVER! not to mention their servers going down all the time.",
            "review_score": "-1"
        },
        {
            "review_text": "So this is a game.  A game that, if you forget your username in, it will never let you play.  Before you ask how I forgot my username, to make a long story short, I eventually just slammed my fist into the keyboard until I got something.  But yeah, when it's not slow as molasses, it's telling me to ♥♥♥♥ off. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This used to be a great series, fast chases, great maps, and simple fun! However after playing this game for about 20 minutes I was absolutely disapointed. Terrible nevigation system, bland city, silly unlock system, and no story at all. Sorry but this game was dead the minute EA got its big money grubing hands on another great game series.",
            "review_score": "-1"
        },
        {
            "review_text": "If you enjoy what a child thinks a car drives like combined with the steering level of a child you would have Burnout Paradise! A garbage game that boasts a huge world, which you will learn within five minutes and then immediately grow tired of it, because even in GTA we ♥♥♥♥ing hate driving to get to missions and races. You would figure GTA San Andreas had a huge map and tons of missions, so something like Burnout wouldnt even need guns or the insides of buildings or much dialogue, right? Well, they pretty much get the size of one GTA San Andreas sized town with the same missions over and over and over and over and over and over and over and over and over. Garbage.  Garbage. 3/10 Garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "1) Wouldn't let me skip the needlessly long intro cutscenes. 2) For the life of me I couldn't find a menu to configure graphics... 3) ...or the controls for that matter. I never got the car to move before I... 4) ...had to ALT-TAB out of the game as I couldn't figure out how to quit it either.",
            "review_score": "-1"
        },
        {
            "review_text": "Just awful.",
            "review_score": "-1"
        },
        {
            "review_text": "controls are terrible. try to find how to quit game without asking google. 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "this game sux... ♥♥♥♥ed up controls.... bad graphics... no options to change controls or graphics or sound (not that i know of)    this game is basicly try not to rage simulator   dont buy    UPDATE: to configure SOME of ur settings u have to go to library and right click on this ♥♥♥♥♥♥ game. than click configure settings or smthg like that.  although game is ♥♥♥♥ at start... slowly starting to get use to the conrtols.        still wouldnt recomend         unless u want to waste time money and patience.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get this. If you have aa ps3 of xbox 360 get it on there because it has one more major dlc that this doesn't, Big Surf Island. Othere than that it does have most dlc that consoles had.",
            "review_score": "-1"
        },
        {
            "review_text": "whatever i try to do i cant turn",
            "review_score": "-1"
        },
        {
            "review_text": "DJ Atomica is a ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I want to enjoy this game, I really do, but everything feels too clunky. Controls aren't exactly the greatest and getting into the settings menu was tedious. Settings are not easily accessible, nor are they easy to find. Not much for customization either.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this as part of the origin humble bundle. Firstly, on the driving game scale this is about 99% arcade and 1% sim. It's fun at first but overly easy, which rapidly makes the whole thing feel meaningless. Controls are okay (except for the menus, which are a pain to navigate) but it's obviously all designed with a game pad in mind. The whole 'one seamless world' thing is just annoying. It seems to me that they've essentially replaced a nice simple menu system for choosing your next event with a big map that you drive around randomly, trying to find something you want to do. It's not really a bad game, but it's very throw-away. I doubt I'll be spending any more time with it.",
            "review_score": "-1"
        },
        {
            "review_text": "A prime example of why the racing genre is dead. More inbred than Charles II of Spain.",
            "review_score": "-1"
        },
        {
            "review_text": "I fell asleep when I was driving. Gladly it was a game.",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't mind EA and their policies butt-♥♥♥♥ing you at any given chance they get, then sure, go ahead and pick this up.",
            "review_score": "-1"
        },
        {
            "review_text": "I fell asleep when I was driving. Gladly it was a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, shame it stopped working.",
            "review_score": "-1"
        },
        {
            "review_text": "Regret buying it, not like how I remember Burnout Takedown was on PS2.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend buying this. It's very buggy and no multiplayer. The controls are trash and it's very hard",
            "review_score": "-1"
        },
        {
            "review_text": "such a waste",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS ♥♥♥♥ GAME. Not even worth a single penny, first off online doesnt work, dlc doesnt work, making a online account doesnt work, and the damn game doesnt save your stuff I went through all the super jumps or whatever and got my carbon car and then bam the next time i launched it its gone, just dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "GAME IS BAD.",
            "review_score": "-1"
        },
        {
            "review_text": "TAEK ME DOWN TO THE PARADIS E SICTYU HATYRRRRRRRRRRRRRRR",
            "review_score": "-1"
        },
        {
            "review_text": "After sitting through the very long, unskippable intro video several times, the game crashes on me before actually getting to play. After the 3rd time I just unintalled it. Windows 10 Pro.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh boy, let me just start this 'review' (If we can call it that) by warning you to stay away from the PC version of Burnout Paradise! No, not because of its gameplay and/or visual quality (I owned this bad boy a few years ago on the X360 and it was indeed a fun ride), but because this game is the absolute definition of garbage on the PC!  ...and why is that you might ask?  Well, where do I start?  First off, I cannot for the life of me start this game up by conventional means without it crashing instantly, and trust me, I'm not the only one experiencing similar problems, browse it on the internet if you must.  ...but of course, such could be fixed easily, just give the game a try in 'compatibility mode', and you should be good to go right? Wrong!  Running this bastar♥ in compatibility mode for 'Windows XP Service Pack 3' (the recommended) or even going as far as adventuring your self in the ancient ruins of 'Windows 95' will in fact boot you up past the start up screen, but good luck playing the game for about 10 or so minutes without it freezing dead on its tracks! On top of it by running it in compatibility mode you can kiss your steam overlay tab good bye.  I didn't gave up though, upon some research, I discovered that many other things could cause the game to crash such as programs related to your Webcam, which you obviously shouldn't bother with if you don't have one, that is unless you happen to have 'Dxtory' (which is kindda like good old 'Fraps') installed, as for some odd reason 'Dxtory' appears as a Webcam, and yes even if it's turned off it'll affect the game (I heard 'XSplit' might cause the same symptoms as 'Dxtory', but I'm not sure), uninstall it and see if it does the trick.  ...but it could maybe even be related to your multi-core CPU, which if so, it could supposedly be fixed by doing as it follows...  - Right Click 'Burnout Paradise' &gt; Properties &gt; Set Launch Options &gt; (type in) -multithread (and press OK).  Of course, such didn't work for me either and sadly, as of now, I can only play the game 10 minutes at a time, on top of that, the game does not support classic 'Window Mode', which might not seem like a big deal, but sometimes you might need to do such because reasons...  As a final verdict, do NOT waste your greens on the PC version of this game (unless you're still rocking little old Windows XP, wich I think might play Burnout Paradise withouth any problems, but I'm not sure of it), it's simply not worth it, have a good one.",
            "review_score": "-1"
        },
        {
            "review_text": "  You won't be able to play the game if you forget your password or username and you can only make an account once since the product key will be bound to the first account you make which is really dumb",
            "review_score": "-1"
        },
        {
            "review_text": "I get most of my games for free. This is a really...obnoxious game. If you want crashes or whatever this game is famous for, play a Need For Speed game.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Burnout without the thing that made Burnout fun in the first place.",
            "review_score": "-1"
        },
        {
            "review_text": "I paid too much for this game....",
            "review_score": "-1"
        },
        {
            "review_text": "PLEASE DON'T! NONONO IT'S VICE CITY BUT YOU CAN'T GET OUT OF THE CAR IT'S BAD THERE'S NO FUN",
            "review_score": "-1"
        },
        {
            "review_text": "You only get to use the Steam Key once",
            "review_score": "-1"
        },
        {
            "review_text": "It's exactly like all the new 'open world' ea racing games. So if you like the classic EA formula with very few actual crash events....  This isn't even Burnout.  Added insult to injury, the 'ultimate Box' doesn't include all of the DLC's. It only includes 3 of 8 or so.  It's a perfectly lukewarm game, therefore, I can not recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this game, the race is confused because u don't know where u must go.",
            "review_score": "-1"
        },
        {
            "review_text": "This should not still be advertised on steam as a Multiplayer game as all the servers were switched off years ago. Single player is decent but gets very repetitive. Unless you see it 75% off, it's not worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "Open world car games are difficult to get right, in the case of Criterion's Burnout Paradise they unfortunately get it wrong.   Long gone are the fun car crash game types that have you destroy as much property as possible, instead replaced with a straightforward racing game that feels like a diluted version of past titles.   The cars drive just fine, although playing with a controller is almost a necessity. The gameplay falls short though, as takedowns feel limp and winning races doesn't feel satisfying.   If you're looking to just roam around and play a few races here or there this might be some fun, but it doesn't have lasting appeal like the older Burnout titles did.",
            "review_score": "-1"
        },
        {
            "review_text": "Why get a game called the 'ultimate' box if you cant have any or most of the DLC. I was dissapointed the fact that the DLC was almost a tease",
            "review_score": "-1"
        },
        {
            "review_text": "It's okay. A bit TOO open.. not much direction or inspiration. I miss the old Burnout formula. Still, crashes are nice, controls are decent. Not worth a purchase though, too shallow. It's saving grace is co-op madness with friends. But with no progression, it's just a sandbox. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Open world car games are difficult to get right, in the case of Criterion's Burnout Paradise they unfortunately get it wrong.   Long gone are the fun car crash game types that have you destroy as much property as possible, instead replaced with a straightforward racing game that feels like a diluted version of past titles.   The cars drive just fine, although playing with a controller is almost a necessity. The gameplay falls short though, as takedowns feel limp and winning races doesn't feel satisfying.   If you're looking to just roam around and play a few races here or there this might be some fun, but it doesn't have lasting appeal like the older Burnout titles did.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible, you dont even get the joy of watching your character smash into on coming traffic at 200mph... It's like the fire services coming before you manage to pour petrol over the sleeping children.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game itself, but the controls are confusing, hard to find what you are looking for ingame. and crashed a lot",
            "review_score": "-1"
        },
        {
            "review_text": "is not complete ",
            "review_score": "-1"
        },
        {
            "review_text": "Dumpster fire of a game. Starts with EA asking you to login to some nonsense system. Not web-based, so you can't use a password manager. Not Origin, for some reason because that would make sense. After each field you fill, you can't just click to the next, you have to click enter, then maybe you'll be allowed to click to move to the next field. Oh, and you already used that email address, so here, let's dump you back to start with no further direction.  Eventually you figure out that you can just skip the login if you aren't playing on line. Now you're treated to a few minute long, slow-moving pointless intro video. CAN YOU FEEL THE ADRENALINE YET?! Then you finally get to the game. Sweet! I remember playing that gamecube game in high school that looked like a racing game but was actually a crashing simulator. Except this isn't that game. This is an open world sandbox game, presumably because they don't understand what people like about that genre or what they liked about Burnout. So instead of getting in races where you can make rad bullet-time crashes, you get to drive around a mostly depopulated city looking for MacGuffins that allow you to start a street race. Oh, and there's no race course, just use your map to get around the city; you love commuting, right? Oh and no slow-mo crashes either, that would disrupt the flow of the open world gameplay. You can hit the other cars sure, but then they just sorta stop moving and you're mostly fine. Don't hit a wall head on though, then your car will be wrecked and you'll start over from down the street. No, the wreck won't look cool, haven't I explained yet how much this game hates Burnout?  Oh what's that? You want to quit playing? Just try it punk. Protip, to find the save and quit button, press ESC, then press F1 three times, then save &amp; quit. I am not kidding.   I don't remember when I got this, and it might have been free with a humble bundle, in which case I still paid too much for it. Not just bad, but actively desecrating a game I had fond memories of.",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine a mix between GTA and a racing simulator. Burnout doesn't do anything really great and I found myself either playing GTA V or GRID. The gameplay is ok, the car mechanics are decent but overall I found the game to be more blah than anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent car game and at the right price would be worth buying i could not justify spending more then $5 on a game like this. It is a fun game to mess around. I would give it a 6/10 because after awhile it gets very boring and tedious.",
            "review_score": "-1"
        },
        {
            "review_text": "terrible username/password system,",
            "review_score": "-1"
        },
        {
            "review_text": "Crushing, Smashing, Crashing. Destroy cars in slow-mo. But does get boring after a while.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought for the Delorean. Deleted because you can't acess it.",
            "review_score": "-1"
        },
        {
            "review_text": "Who Puts a mini map in the middle of the screen? game is completly ruined by it and If you know how to turn it off or change it let me know.",
            "review_score": "-1"
        },
        {
            "review_text": "Well...  A friend of mines last words were 'Once you go on, you never come back' while playing this game...  He never came back",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I managed to get to the Elite License, at which point all that's left to do is re-complete every event and unlock the remaining cars.  First thing right from the start that still bugs me is this new fasination with making racing games open world cities. It's a terrible Idea because it makes people preak the flow of the game to look at their map all the time! Even as far in as I got I STILL had to check my map several times! There's no way that's gonna work in online play.  Another issue I found was that certain Speed cars had issues. You'd hit the gas from a standstill and you'd lose control of the car. The tires would spin and force you into a drift. This was really frustrating.  Another was with the way you start races, by hitting Forward + Brake/Reverse at intersections. This is also how the game does Drifting, so you can see the conflict here when you just wanna roll around town practicing your Drifting.  Another, which if mostly and issue with DRM and EA's usual bullsh*t, is that you have to log in to a server with an EA account just to play the game, even in 1 player mode. That's bad business.  Ultimately, this isn't the same burnout people loved on the PS2. It's far too easy to take cars out, a few of the races feel impossible to win unless everything's perfect and you take every shortcut, and the color customization has it's limits.  The soundtrack is still garbage. The only songs worth listening to are My Curse by Killswitch Engage, and Collapse by Saosin.  I was plating Need For Speed: Undercover at the same time as this, and gameplay wise that is a better racing game. ONLY get Burnout Paradise if you're really that into smashing people into guard rails and taking sweet jumps just to fall into a river.",
            "review_score": "-1"
        },
        {
            "review_text": "Make yourself a favor, don't buy this game. I got it in a humble bundle so I didn't really mean't to buy it, but I was a bit excited to try though, as the last burnout I got the chance to try was the third, which was an awesome game for it's time. I have to warn you, the only thing this so called burnout inherited from the franchise is the name. It is ugly (even for a 2009 game), it's not enjoyable to play, and it is going to get off my hard drive as fast as it got in. The only thing that is good in this game ? The intro song, but don't bother install the game to hear it !",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game, EA thought it would be funny to just remove all of the DLC even thought I paid for it... This kindda crap is the reason why I've chosen to boycott games from EA.",
            "review_score": "-1"
        },
        {
            "review_text": "Great arcade driving ruined by an annoying 'open world' map-reading mechanic. The majority of the challenge comes from trying to avoid taking the wrong route.  also does not support  f.lux/windowed  mode",
            "review_score": "-1"
        },
        {
            "review_text": "After playing Burnout 1-3 on Playstation this part was a huge disappointment, especially after noticing that the main part of Burnout is missing.... the huge crossway crashes for points/money. Yes, the game looks nice and does have some beautifull cars etc. but it just isn´t the same game anymore... trying to copy a ♥♥♥♥♥♥ need for speed underground gaming style. Hope they go back to the roots in their next game.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing Dreadful",
            "review_score": "-1"
        },
        {
            "review_text": "The only reason why you should own this game is because you got it on a $1 humblebundle",
            "review_score": "-1"
        },
        {
            "review_text": "'It's not a bad game, it's just a game for dumb people!' - Drew Credico",
            "review_score": "-1"
        },
        {
            "review_text": " Pro's   Great at what it does.   Con's   What it does isn't great.    Arcade racing is dead...long live the arcade racer...   With sim driving games becoming ever more accurate, entry level driving games becoming more sim-like with every iteration, and the floaty arcade 'physics' of the truly arcade 'arcade racer' now almost completely a thing of the past, Burnout has basically...yep, you guessed it: burned out.  It's a shame since Burnout Paradise, save for a few muddy textures here and there (namely actually the mud textures) still looks great and has the overall structure of a really excellent arcade romp but what's aged most seriously and most detrimentally is specifically the car handling.  The cars are tuned to be able to corner more or less perfectly at ridiculous speeds (a requirement dictated by the earlier Burnout games) and as such have handling so far removed from real-world physics that even by today's standards, for the arcade-racer end of the driving game continuum, they feel counterintuitive, unwieldy and ultimately really just broken.  For instance if you tap the break it should give you more traction and better handling rather than destabalise the car, as it seems to do across the board without fail in Burnout Paradise.  If someone could get into the guts of the thing and just make the power, speed and handling of the cars actually just vaguely realistic, adjust the camera placement etc., I'd happily play through the entire game, but as it is, even paying only £4.99 for it I still feel like I paid too much, as ultimately, I feel like I bought something that looks great and has a huge amount of promise but which is simply just fundamentally broken at its core.  Burnout Paradise is to today's open world driving games what the Afterburner jet would be to the arcade flight combat games of the Burnout era: confusing, unwieldy and ultimately unsatisfying. Video game driving has moved on; Burnout has been left behind.",
            "review_score": "-1"
        },
        {
            "review_text": "If Burnout: Paradise were just about puttering around an open world and making your own fun it would be decent. The real problems lie with the missions. It has a few inspired elements, but each of the designers' good decisions seem to be matched by at least as many baffling oversights.  None of the cars are based on real-world vehicles and as such they're free to dial up the performance to ridiculous extremes. Cars can accelerate to incredible speeds and stop practically on a dime. Power-sliding with the e-brake is difficult and often results in spinning out. Drifting doesn't feel as satisfying as other racing games but is rarely necessary due to the incredible grip that most cars seem to have, even at blistering speeds. At least I assume they're blistering based solely on how fast the trees and buildings go by, because one of the most egregious of the oversights mentioned earlier is the lack of a speedometer.  The map is a good size and the roads are nicely varied. You can't set waypoints and there's no fast travel, but it only takes a couple of minutes to drive from one end of the map to the other in most cars. The east is mostly dense city, laid out in a neat grid with a highway wrapping around the perimeter. The west is more rural and mountainous in the north. Blasting through the mountain passes and around the hairpin turns is a good fun, but you can only do it so many times before it gets stale. Scattered all over the map are hidden paths marked by breakable yellow signs. Finding all of these is an okay diversion; mostly they lead to shortcuts and jumps, but occasionally reveal hidden play areas not seen on the overhead map full of ramps and race tracks free of any other traffic.   Everything mentioned so far is just noodling around on your own steam. The missions dotted liberally across Paradise City provide the intended meat of the gameplay, but they're lacking in variety with only four very similar mission types. You'll always find yourself going from point A to B as fast as possible while trying to smash the other cars and avoiding getting smashed yourself. Each car also has a unique mission to unlock a special alternate version of that same car, but that too is just a timed race. Lack of variety wouldn't be a problem on its own, as a small amount of challenging missions would still be engaging. The problem is that they're not challenging in the least.   Burnout: Paradise excretes leniency out of every pore of its body. AI opponents seem to always hover a short distance in front of you no matter how poorly you drive, though they're fairly happy to stay behind once you pass them. Races are easy to win with a good chunk of time to spare. Even wrecking your car goes virtually unpunished, even in the 'marked man' missions where the whole point is not to crash.  The idea of the game is great but the execution is lacking. It's fun to drive around for a little while on your own, and you could probably lengthen your enjoyment with a friend in co-op. Even then I can't recommend it unless you've exhausted your supply of otherwise superior racing games currently available.",
            "review_score": "-1"
        },
        {
            "review_text": "Did you like the Burnout games? Probably really liked the crash point counter and the strategy of getting the biggest pile ups and combo points right? Well they took all that out of the game and now its just a racing game. Its really bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Different type of racing game. Cars are cool though, as a money spending I bought the extra stuff just to make the game a but funnier when playing against my friends.",
            "review_score": "-1"
        },
        {
            "review_text": "Base game: Great. The 'Ultimate' Box: just the base game, with it having been advertised and priced as being a GOTY package.   This is why you're so high on the list of most hated companies, EA.",
            "review_score": "-1"
        },
        {
            "review_text": "So, I installed this on my new computer cuz i played it heaps on my old, and the Code isnt working, DO NOT BUY if you intend on installing it more than once.",
            "review_score": "-1"
        },
        {
            "review_text": "Plays like a version of GTA V without the beating people up on the streets and shooting ♥♥♥♥♥♥♥♥♥♥s that you've partaked in.",
            "review_score": "-1"
        },
        {
            "review_text": "It was way too arcadey of a game for me, but a lot of people hold the game in high regard. You may like it, but I did not.  I was never played any of the previous Burnout games either though, so that's probably why I didn't like it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun game.. on the xbox 360, where it actually has DLC working.... the steam version is a pure ripoff, claims it comes with all the dlc... at least I didn't pay full price.  EDIT: apparently multiplayer still works. also fixed the grammar a bit.",
            "review_score": "-1"
        }
    ]
}