{
    "app_id": 247660,
    "name": "Deadly Premonition: The Director's Cut",
    "release_date": "2013-10-29",
    "developer": [
        "Rising Star Games"
    ],
    "publisher": [
        "Rising Star Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Nudity",
        "Violent",
        "Gore",
        "Action",
        "Adventure"
    ],
    "tags": [
        "Story Rich",
        "Adventure",
        "Horror"
    ],
    "achievements": 60,
    "positive_ratings": 2038,
    "negative_ratings": 916,
    "price": 19.99,
    "description": "You wanted it, now you've got it – the award-winning cult sensation Deadly Premonition is arriving on PC in an enhanced Director’s Cut package! Playing as special agent Francis York Morgan (call him York – everyone else does), it’s your job to investigate the brutal murder of a young local beauty in the town of Greenvale.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/247660/header.jpg?t=1478086442",
    "minimum_requirements": "OS: Windows 7 / Vista (32/64 bit) Processor: Intel Dual Core 2.0Ghz or equivalent Memory: 2 GB RAM Graphics: Direct X 9.0c compliant video card with 512MB RAM DirectX: Version 9.0c Storage: 8 GB available space Sound Card: Direct X compatible sound card Additional Notes: A 16:9 monitor is required to play this game.",
    "recommended_requirements": "OS: Windows 7 / Vista (32/64 bit) Processor: Intel Quad Core 1.6Ghz / AMD Quad Core 1.6Ghz Memory: 4 GB RAM Graphics: DirectX 9.0c compatible NVIDIA or AMD ATI video card with 1GB of RAM; Nvidia GeForce GTX 260 or higher; ATI Radeon HD 4890 or higher DirectX: Version 9.0c Storage: 8 GB available space Sound Card: Direct X compatible sound card Additional Notes: A 16:9 monitor is required to play this game.",
    "reviews": [
        {
            "review_text": "This is the type of game that will only excite people who get into the characters and story. In concept the game itself is fantastic, but technical flaws narrows the overall appeal to an already niche title. I loved the game, but I feel it's only fair to recommend it with some caveats.  It's a murder mystery with quirky characters. They give the game a lot of heart and fans of the TV show Twin Peaks and 80s pop culture should find some things to love. The juxtaposition of horror and comedy is something special.  Basically this is an open world survival horror game where you drive around and look for clue to further the story. If I remember correctly there are 50 side quests as well. I really liked that many prizes for completing side quests were useful (unlike many open world games). You normally travel by car which is a jarring, experience. The car controls very poorly and has a blind spot where the frame of the windshield is. Opening the large map takes up half the screen and does not display all of the information that the menu map does. As bad as it all sounds, you do get used to it, and fast travel options open up with the right side quest completion. I would say the driving was my biggest peeve.  The combat is familiar to anyone who has played Resident Evil 4 or Dead Space. The controls are a stiffer than expected in the previously mentioned games and aiming is not as easy. There is some required melee combat and all weapons break after a few uses. I was ok with this considering that it's a survival horror game. I never was weaponless during my playthrough. there is not a lot of enemy variation though so be ready to hear 'noooo i dooon't want to dieeee!' about over 9000 times.  Though Deadly Premonition still contains a fair amount of jank, it only adds to the wealth of charm within. The end result is a ridiculously original masterpiece that hearkens back to an era where the gaming landscape had more room for wildly imaginative budget games, a far cry from the abundance of focus tested blockbusters that are prevalent today.   I love whistling this theme!         YouTube™ Video:  Deadly Premonition (Whistle Theme)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "There is three types of games: - The good ones - The bad ones - Deadly Premonition",
            "review_score": "1"
        },
        {
            "review_text": "Is the voice acting bad?  Yes. Is the gameplay bad? Yes (for the pc port). Are the graphics bad? Equal to a 2006 game. Does it have replay value? Yes. Is the story great? Yes. Will this leave lasting memories? Yes. Is this one of my favorite games? Definitely.   Verdict:  Best crime/survivor/horror ever/10  (Plays like the old Resident Evils or Silent Hills)",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to this game, every time I pour some coffee,  I look with interest. ",
            "review_score": "1"
        },
        {
            "review_text": "The game is absolutely amazing! The plot is fantastic, while the gameplay is quite obvious and buggy, but the latter doesn't change the emotions you get following the investigation. I recommend the game for all who are interested in creepy detective stories. If you want to enjoy the game truly, please don't pay attention on bugs and some annoying things like following the suspect for about five real minutes - the game is not about that.  I am thankful for all those who were involved into the Deadly Premonition's process.",
            "review_score": "1"
        },
        {
            "review_text": "Deadly Premonition is one of the most unusual and strangest games I've played for a long time. That is true, not only because of its progressively more mystic story and the many weird citizens of Greenvale but also because of the peculiar mix of gameplay and technical elements. Many parts of the game are great, others are so bad they're good again, some are truely (ragequit inducingly) bad. Deadly Premonition is a very rough gem; it's seriously flawed but the game has real character. While I had a lot of fun with the game, playing it was quite frustrating sometimes. After the ending credits rolled I was left unsure whether I should be sad it ended, or glad that I won't have to experience any more of it. All in all the positives outweigh the negatives for me but I only recommend the game to people with patience in combination with high tolerance for bugs and broken gameplay.  For a little bit more detailed impression of some aspects I start with the technical side as this is where the most frustrating flaws of the game lie: The PC version of Deadly Premonition is a terrible console port. From what I read on various websites the game was already quite buggy on consoles; on PC most if not all of these bugs are still there but others were introduced on top of that as well.  For starters I experienced a half a minute up to 5 minutes long blackscreen before any cutscene would play. Because an intro cutscene would play before the start screen everytime the game starts and another one - summarising what had happened in the game before - everytime a game is loaded, this issue already made just starting the game an annoyance. Now add periodic crashes into the mix and the annoyance level is upped to eleven. The game crashed about two dozen times in the course of the game, mostly in the worst situations possible ('Oh, you just beat a sidequest in which you have to refight stronger versions of all bosses in a row without being able to save inbetween and you're just two steps away from a savepoint? Why don't you do it again? TROLOLOLO!'). Deadly Premonitions allows you to replay already finished chapters in order to pick up missed collectables or do sidequests, however during such replays saving is disabled until the chapter is finished, making crashes even worse than in the regular playthrough where often enough a savepoint is closeby.  Usually the crashes appeared somewhat randomly but then the game crashed everytime on the transition from chapter 8 to 9. Setting the compability mode to Windows 98 eventually got me through that part, though.  Additionally to long loading times and crashes there are some bugs with quests: After replaying earlier chapters quest items (especially temporary ones like keys for locked doors) are sometimes deleted from the inventory and can not be retrieved in normal ways. This happened to me once with an item needed for a side quest before I could finish said quest; in the end I had to change my savefile with an hex editor to get it back. Before playing I got the recommendation to play the game with a gamepad because, like many console games, it's supposed to play better that way. Turns out my gamepad (an old BigBen pad) isn't supported and because of the way gamepad integration is done in this port programs like x360ce or xpadder don't work with it rendering it impossible to use my gamepad. Still I found that keyboard + mouse controls worked well enough most of the time, only the handling of additional cars that can be bought later in the game is horrible.  Gameplay: Deadly Premonition's gameplay comes pretty close to what I wished Alan Wake, another game inspired by Twin Peaks, would be like: Almost at any time the player can choose to ignore the mainquest for a while and freely roam around the town of Greenvale, learning more about its citizen by questioning people, starting sidequests and searching for collectables.  At some points the game throws a puzzle at the player. The puzzles are few and they're really easy but it's still more than Alan Wake had to offer, which was mostly composed of cutscenes and filler combat. Speaking of which, a flaw Deadly Premonition shares with AW is boring, repetitive and clunky combat. Reducing the amount of combat or even removing it completely would have been an improvement in my opinion. In order to make up for less/no combat I would have loved to see the 'Profiling' feature expanded. Profiling, for me, is the #1 area where the game left a lot of unused potential. From the role profiling plays in the story one could assume it's a core part of the game but in the end it's pretty dull: At a crime scene the player sees a couple of noisy pictures showing the circumstances of the crime recreated by Agent Francis York Morgan, the game's protagonist, and now has to search for clues. Each found clue makes some of the pictures now appear clearly visible. And that's all. Turning these profiling sessions into puzzles, maybe even letting the players make their own deductions, leading to a branched-out (to some degree at least) storyline, would have vastly improved the whole game and further increased the incentive to replay finished chapters. So I didn't really like combat and the lackluster profiling that much but still both is 'okay' and far from gamebreaking. The one thing I hated about the gameplay are Quick Time Events. I hate QTEs in general but Deadly Premonition has some of the worst QTEs I've ever seen. An especially annoying QTE in the game makes you press buttons, apparently randomly chosen from four possibilities, in rather short time; be too slow or press a wrong button first and it's instant 'gameover, try again!' (including going through several black screens). Fortunately QTEs aren't that abundant but they were closer to making me quit the game for good than any of the technical issues. Deadly Premonition plays a bit like a Japanes horror shooter (think Resident Evil or Silent Hill) combined with an adventure game and a little bit of open-world.  Story/characters/music: The thing I enjoyed the most about the game are the wonderfully eccentric characters. It's full of well written, funny dialogues that are made even funnier by the often completely inappropriate background music. Or rather 'foreground' music, sometimes and seemingly random the music gets louder than the speech (like in a couple of other cases, the overall oddness of the game makes me unsure whether this is a bug or if it was than on purpose). Deadly Premonition can be very surreal sometimes. Still there are many scenes with a more serious tone (it's all about a murder case after all) and those work very well, too. Setting, characters and story are heavily inspired by the TV series Twin Peaks, therefore the aforementioned absurd dialogues are not surprising. Twin Peaks is among my favourite TV shows, so I highly enjoyed Deadly Premonition's setting. However from time to time the game draws a bit too heavily from its inspiration: some details about characters' backstories that get revealed through side quests are no big surprise if you've seen Twin Peaks. The main story line is, several parallels aside, mostly original, though. For the most parts it's well written and interesting but, especially towards the end, it gets cheesy and loses some of its charme. Biggest problem I had with the story was that, without need, the game gives an extremely obvious clue regarding the solution of the case very early on and no character, not even the alleged super-profiler Agent York, considers it during the investigation. Of course, from a meta perspective the game can't just end before it even really started but why bring a thing like that up at all then? Again I can't rule out that it wasn't done on purpose, though; maybe in order to lampshade B-movies from the 80s which are a recurring theme throughout the game and plotholes like that are not exactly a rare occurence in those movies.  Tl;dr in comment section",
            "review_score": "1"
        },
        {
            "review_text": "Deadly premonition tries to mix elements of an open world action game with a survival horror game and it achieves this goal to an extent. It is a poor pc port (although this is somehow mitigated by DPfix) and the production values are subpar but for those who are willing to dig deeper there is a valuable treasure to be found. The direction of the script is exceptional, the characters are well fleshed out and memorable (at least, most of them) and the overall mood is a perfect blend of comedy relief moments and serious thriller sequences. Also, the soundtrack is among the finest I've heard in any game the last 6-7 years. So, give it a try and see for yourself if you can appreciate a one-of-a- kind flawed gem",
            "review_score": "1"
        },
        {
            "review_text": "Pro - Eccentric, creative storytelling with one of the most compelling and complex protagonists in recent years - budget-priced and enhanced from the original. Con - Game instability, stiff controls, limited soundtrack, repetitive sound samples, poor textures. Also gives me severe cravings for coffee.",
            "review_score": "1"
        },
        {
            "review_text": "Great mystery story paired with quite poor combat parts and alot of issues with crashing in certain areas but 100% worth it to play all the way.   I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "The Citizen Kane of video games.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, absolutely. There are technical problems, and crashes, but those can mostly be overcome, and if you persevere it's one of the best game story experiences I've had.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best worst game Ive ever played. Charming Japanese take on American Horrow. Wierd , bad graphics but also somehow as addictive as mainling a pound of heroin. Very light hearted yet very dark at the same time. WHY DO I LOVE THIS GAME?",
            "review_score": "1"
        },
        {
            "review_text": "'Do you feel it, Zach? My coffee warned me about it. Yesterday morning the milk I poured in my coffee made a sign. It said, ‘Tomorrow you’ll arrive in a place that will change your fate.’”  2 out of 2 peaks.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like David Lynch? Do you like comfy white America? Do you like Neo-Noir? Do you like Twin Peaks?  Then get it.",
            "review_score": "1"
        },
        {
            "review_text": " WARNING : This game is buggy as hell, and requires a lot of patience and/or workarounds to play.   Deadly Premonition  -- which may as well be called  Twin Peaks: The Game  -- is a great game idea poorly executed and even more poorly ported to the PC from consoles. Game-breaking bugs (such as disappearing keys) and random crashes (only avoided by playing problematic sections in Windows 98 compatibility mode) will bite you if you're not expecting them, so consulting a guide or walkthrough ahead of each section is practically compulsory.  So... why am I recommending it? Despite its faults,  Deadly Premonition  is so delightfully weird that I can't  not  recommend it. The story is fantastic, the characters are memorable, the murdery mystery is compelling, and the comic relief is hilariously bizarre.  Pick it up on sale (it's often about $2.50) and you'll definitely get your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "It's such a good game, unfortunatley a lazy effort on the developers part. At launch there was no controller support, however that has now been patched, but the game itself can still be borderline unplayable unless patched with DPfix (the same person who fixed the Dark Souls port). Even with that patch however the game still suffers from a range of glitches, bugs, crashes and audio/visual problems, still it's hard to not recommend this game. After all it's problems have been sorted out, this is easily one of the best games on Steam, with a good sense of humor and some nice references to certain things in pop culture (such as Twin Peaks), you might want to hold of purchasing it until ALL of the problems have been fixed.",
            "review_score": "1"
        },
        {
            "review_text": "Nice shot. Amazing. Bullseye. Nice sho- Nice shot. Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "York is the greatest video game protagonist of all time and Deadly Premonition's story, characters, humor, atmosphere, soundtrack and sheer personality are way above what you will find in most critically acclaimed titles. It's not without its flaws, like a subpar combat system and bad graphics (even for the time), but it's totally unique and isn't afraid to experiment, something sorely lacking in other games.  If you own a Xbox 360, play the regular version there instead of this one. The little improvements of the Director's Cut aren't worth it, since this port suffers from common crashing issues and some bugs.  However, a bad port is still better than not playing Deadly Premonition, so if this is your only option of experiencing the game, go for it. Just be aware of the following:  - Check  the PC Gaming Wiki  [pcgamingwiki.com]  and its tutorial on installing DP Fix, SweetFX, better textures and solutions for crashing;  - Always run the game directly through DP.exe instead of Steam or other methods;  - In order to get an item that will make navigating through the game much easier and more pleasant, do Side Missions No. 004 &amp; 005 (George's sidequests) as soon as possible;  - Do not read the description of the Trading Cards before finishing the game, since some of them contain spoilers.   F... K... In the coffee! It never fails. ",
            "review_score": "1"
        },
        {
            "review_text": "I finished the game but the final cutscenes were so unwatchable due to the fact they were each seperate pieces which took more than an hour to load. I had to just close the game and watch the ending on youtube. Wont bother with all the extra stuff because it's such a pain going through any loading screen. I am aware this is the main complaint for the PC version of this game but I didn't expect it to be as troublesome as it was...Yolo",
            "review_score": "1"
        },
        {
            "review_text": "Go to where Steam is installed -&gt; SteamApps -&gt; common -&gt; Deadly Premonition The Director's Cut -&gt; redist. Scroll all the way down until you find 'PhysX_SystemSoftware' right click it -&gt; Repair wait a few second and *BOOM* the game should lunch! ______  Putting that a side, I'm more than 9 hours into the game and had 0 crashes. The only crash that I ever got was when I installed the game and tried to lunch it. Read a guide that told me to do what I wrote above and.. that's it.  Now, I got this when it was on sale and my gosh the game is a mess! But not that bad kind of a mess! It's amazing! It's impossible to explain, but I'll try my best... Take a bowl, put open world into it, then a bloody and a very horrible crime, elements of some comedy, a mix of good/bad controls, a mix of good/bad graphics, a mix of good/bad soundtrack, a mix of good/bad voice acting, cars that slide on turns, the best coffee with milk. Take all that, mix it up really good. Cook it for at least 20 hours and serve it to an FBI agent!!  Everything I wrote above made little to no sense? Well that just what it is! If you can handle a literally bloody story, then you should try it. Otherwise.. I don't think you'll like it. You have to risk it to get the biscuit. At least that's what I saw in my coffee..",
            "review_score": "1"
        },
        {
            "review_text": "I spent a few hours trying to get the game to work. It's crashed dozens of times. The graphics are awful. The port is basically a mess.  But despite it all this is one of the best games I've ever played. The story is great, the characters are quite interesting and the silly quirks will just make you laugh till your sides hurt.   If you like a good story and enjoy well written characters then you won't want to put this cult classic down for a second. Don't forget to use DPFix!",
            "review_score": "1"
        },
        {
            "review_text": "God awful port of a great game.",
            "review_score": "1"
        },
        {
            "review_text": "'The balance of milk and butter you've achieved here... oh my...'",
            "review_score": "1"
        },
        {
            "review_text": "I don't think I've spent more time on the starting menu on any other game than this.  This is not a game, this is an art.",
            "review_score": "1"
        },
        {
            "review_text": "When I run the game for the first time (it was on XBOX360 back then) and saw the graphics, I was one step to ditching the best and most emotionally capturing games I've ever played! Nothing to say more. Get it and play it! But don't listen to other people, saying you have to play on hardest difficulty right from the start to get all the fun. Just don't, you'll hate the game. Finish the game on normal or easy and only then switch on Hard mode. Fun guaranteed!",
            "review_score": "1"
        },
        {
            "review_text": " Genre: Horror/Third-person shooter",
            "review_score": "1"
        },
        {
            "review_text": "Horey shet, this game is great.  First things first though, while 'directors cut' is slightly different from the original on the consoles, its a horrible PC port. Luckily theres a fix for most of the issues and if you disable steam overlay, you can play it, crash free prettymuch. Just dont alt+tab or do anything outside the game while playing.  I absolutely love this game, its very story/character focused and both of those two are just batshit insane in a very charming way. The characters are so much fun, the story is interesting and keeps you on the edge of your seat all the way. The gameplay however is clunky, weird and feels like some really old Japanese RPG's in many ways and shares the many gripes that Jap games in general have, which would be clumsy menus, unnecessary button prompts here and there ect, but oddly enough, it didnt bother me that much. Killing baddies is kind of funny, but the general atmosphere is great and quite spooky at times too.  All in all, I'd say that get this on some console if you want to play it without any issues from the start, or get this PC version and be prepared to fix its many issues. Its an amazing, crazy, weird, funny and extremely interesting.  I'd r8 it an 8/8 m8, no h8.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like weird games? Let me rephrase that. Do you like Resident Evil, Shenmue, Persona and Silent Hill? Do you want to play them at all once?  Deadly premonitions looks bad, controls bad and would overall be a bad game if it were not for the brilliant absudity it offers. Moments of tension and mystery are intersped between hilariously bad writing and super cheesy dilogue. Deadly Premonitions is the rare example of a horror-comedy in video games and is an absoloute must play for anyone. The PC port offers a better control scheme than the PS3 version, but it also comes with it's own limitations. Rising Star gave us one of the worst ports of all time. For some reason the game is locked into 720p and though it touts controller compatability it is entire incompatable with XInput controllers, meaning your 360 or logitech controllers will not work without third party programs. There are a coouple fixes from a clever modder to fix the display issues, but otherwise get the PS3 version instead.",
            "review_score": "1"
        },
        {
            "review_text": "Original story and gameplay. Fantastic soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a ♥♥♥♥ing art masterpiece!  So many feelings - it just puts you in right away with all the characters and atmosphere. Lots of laughter, drama, many wtf moments, challenging gameplay, beautiful cinematics and a decent dosage of a cry... One of a kind game, it will go down in the history as one of the most ♥♥♥♥'d up, dramatistic, humoristic and unique games of all time...  A great example that you don't need perfect graphics or gameplay to make a great game, it's all about the originality and creativity, all the bugs n ♥♥♥♥ made this game to what it is!  And yeah, animations &amp; dialogues are ♥♥♥♥ing golden, this ♥♥♥♥ should be nominated for an Oscar! Zach &amp; Francis York Morgan, Max Payne and Alan Wake - perfect combination! :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is quirky, unpolished and unfortunately very crash prone - but nonetheless a hidden gem in my opinion. Story, characters and atmosphere are simply great. It is an open world mystery thriller with a strong resemblance to the TV series Twin Peaks by David Lynch, which is quite unique as far as I know. Apart from the main storyline there are numerous side missions. Most of them are somewhat hidden, but they provide additional understanding of the world (a North-American small town) and the people within it. After many entertaining hours it was hard for me to say goodbye to Greenvale in the end.",
            "review_score": "1"
        },
        {
            "review_text": "Twin Peaks ripoff: The game Now with more zombies and stupid crap that doesnt make sense, LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "murder in the uncanny valley.",
            "review_score": "1"
        },
        {
            "review_text": "Despite having no right to be, this is one of my favourite games. It's utterly bizarre but I love it to bits. Please play it. It's a weird gem with some utterly horrible gameplay but it is somehow special.",
            "review_score": "1"
        },
        {
            "review_text": "You play as FBI agent Fancis York Morgan, a delusional man that gets crime clues from his coffee, and talks to his 'imaginary' friend Zach, more than he talks to real people, in front of real people. He's sent to Twin Peaks (can't remember the name of the town, and its twin peaks anyways) to investigate a murder case that seems relate to a killer he's been investigating for some time.  The game is a collision of genres and elements that tries to be so many things at the same times, but really doesnt have the budget or technical prowess to truly be the game it could be...That being said, I enjoyed this game a lot, from its strange characters, that by the end make York look like a normal guy, to the sandbox exploration elements in a nearly lifeless massive town that brings to the table, for no good reason, like everything else in this game, and still works.   This game is a...Sandbox Survival Horror Simulator Adventure Third Person Shooter Fishing Exploration Game with day and night cycles where all characters have their daily routine...What the hell did I just say? And the game totally half asses most of those genres.  A technical disaster that manages to be one of the most unique, funny, weird and all around insane games, Isn't that right, Zach?  I Love it",
            "review_score": "1"
        },
        {
            "review_text": "This game is like if Twin Peaks got roundhouse kicked in the face by Shinji Mikami and Suda51.   Weird.....but oh my how amusing.   Get this game     8 out of 10 axe murderers",
            "review_score": "1"
        },
        {
            "review_text": "This is, in my personal opinion, the best worst game ever. I highly reccomend it... Just make sure you reboot your computer when you first install it",
            "review_score": "1"
        },
        {
            "review_text": "This was... perhaps the best game i ever played so far in my 20 years of age. I might be overreacting but the ending was climatic enough that i liked it quite alot I recomand it either on full retail price or at rebate.",
            "review_score": "1"
        },
        {
            "review_text": "I would keep it short.  PC port is terrible, interface is a bit annoying at times, incredibly odd and strange driving, constant crashes and FPS drops.  But it still one of the best games I've played. Intriguing story, charismatic characters and dence atmosphere is what makes the game this great.  About technical part of the game. The following quotes says it all: 'I would drag my balls through 10 miles of broken glass just to play another 20 mins of this game's story. ' Steam user jerry.   If you are willing to fight the glitches and crashes, you would experience everything that makes this game so great.",
            "review_score": "1"
        },
        {
            "review_text": "Deadly premonition's port to PC is A real hot mess, even with the DPfix for 1080p and controller support is not enough. You still experience massive fps drops do to compatibility issues that can only be resolved by uninstalling most of your media players or changing the codex!  Well... Aside from all that it's really a great game, but only consider buying it on sale. Truly a flawed gem...",
            "review_score": "1"
        },
        {
            "review_text": "A game where your salary is based on how many monsters you kill, nice story, the best combat system since resident evil 3, totally underrated. Running smoothly on intel hd graphics without using any fixes while the pc masterracef@gs keep whining about crashes/bugs/stuttering.  10/10 would drink their tears. ",
            "review_score": "1"
        },
        {
            "review_text": "It's a little gift from far away times when gaming was big and grass was green. Firstly I have a really misunderstanding about what hell happend here, but step by step I started to see beyond ugly graphics and awful sound. So you might try to seen what I saw.",
            "review_score": "1"
        },
        {
            "review_text": "I hate almost every mechanic you will find here.  Quick Time Events - Terrible in general and horribly executed here Open World - With Mostly Empty Space is what I automatically read after I see this description and it absolutely appies here Survival Horror - Resource managment that amounts to making sure you have enough food to last the day, the timeless and endless searching for keys to open doors, and being forced to hide from an assailiant in a locker despite the fact that you have 160 rounds in your submachine gun ready to be unloaded.  The combat is TERRIBLE and I was not suprised at all to find out it was tacked on at the last minute to try and appeal to 'western gamers' at the publishers request.  To top it all the optimization is exceptionally poor and will likely require you to download some quickfixes via mods (check forums) to run.  Yet I love this game. It's strange beyond reason and the completely broken parts of the game (almost everything) somehow manage to accentuate the one thing that works with this game. The off-center, campy, almost familiar, touching, and beyond words oddball yet enchancting atmosphere.  Agent York is stranger still than the atmosphere and he's one of the most memorable characters in video games.   This might not be for you but on discount you really need to find out if it might be.  9/10 if it is....",
            "review_score": "1"
        },
        {
            "review_text": "The Room of video games",
            "review_score": "1"
        },
        {
            "review_text": "The Twin Peaks vision David Lynch was never able to truly realize",
            "review_score": "1"
        },
        {
            "review_text": "0/10, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "From the very start of the game (albeit after fixing the crash issues) I was hooked. A survival horror game with elements of comedy, with an open world environment and a charismatic protagonist makes it a cult favorite. The games story (for a brief summary you are an Special FBI Agent investigation an interesting murder case) gives you a lot of clues and expansive knowledge for the player to deduce and question who did it with so many suspects you'll be sure to doubt your prime suspects, but do not fret as the pieces will fall in place nicely and pave a wonderful intense and dramatic story.   This game deserves a 10/10, however due to the pc port issues, bugs, and numerous crashes it recieves a 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing Great Fantastic Nice Shot Good Amazing",
            "review_score": "1"
        },
        {
            "review_text": "Clunky combat, weird out of place humor, goofy main character, and self aware side characters. Mix this up with fairly bad performance, terrible terrible driving physics, hard crashes, and what do you get?  A game that ends up being good despite the flaws. Pick it up today!",
            "review_score": "1"
        },
        {
            "review_text": "Plays like crap, looks like crap... Probably would smell like crap.  Awesome game though.",
            "review_score": "1"
        },
        {
            "review_text": "Gets paid to shave, still bothers to investigate.  10/10  Would shave again.",
            "review_score": "1"
        },
        {
            "review_text": "Legendary game.  Twin Peaks, if interpreted by an unrestricted Japanese developer. It’s a mystery-adventure game, not exactly a horror title. I'd say it shares more with Shenmue than Silent Hill. The cast of the game and their interactions provide for some of the most memorable game moments. Unfortunately gameplay, in terms of combat, lacks polish and will be considered abysmal by some.  If you want something different, a game that provides something far from Ubisoft's triple-a game dispenser products, give this one a shot. (The definitive version is the Xbox 360 version)  My favorite game of all time. My comfy game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Crashing Simulator Ever",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I experienced such an awful, weird but utterly amazing game. This game really is so bad, it’s good.",
            "review_score": "1"
        },
        {
            "review_text": "I made this short because people should know about this game. The story is amazing... it is probably one of the best game I have ever played. The only problem is that the port is terrible but if you ok to deal with it. You will not regret it at all... the story will make you play all the way to the end.",
            "review_score": "1"
        },
        {
            "review_text": "Simply a masterpiece! The story keeps you playing this game, no matter how bad the controls and graphics are.",
            "review_score": "1"
        },
        {
            "review_text": "Deadly Premonition oscillates between brilliant and tedious. In terms of quality this game is hard to recommend, but if you give it a shot the game will surprise you with intriguing story, of wich you might fall in love with this game.",
            "review_score": "1"
        },
        {
            "review_text": "I seem to be one of the lucky few who has not experienced a crash or problem of any kind while playing this wonderfully strange game. The game itself is amazing in its unique way if you can get it to run. I highly recommend it as it's a game that exists in a class all its own. The characters are odd, different from one another, genuine, and full of quirk and personality. The story is intriguing and the music helps heighten the drama and mystery. It's like a really great, really strange TV show that you get to play through. Even the bad parts like the driving mechanics are enjoyable. It really feels like you're in a small town living the life of an eccentric FBI investigator. So, as long as you can get it to run properly, you're in for the weirdest treat available in gaming that I know of. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "You play as an autistic detective in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Spooky, funny, baffling... sometimes all at the same time. This game is fun to explore.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with extra staff . you should buy it .",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest achievement mankind has ever made. The pyramids of giza, the Collossus of Rhodes, the Empire State Building, and the whoopie pie combined cannot even begin to match the absolute perfection and impressiveness of this game. 10/10 would play with my dog.",
            "review_score": "1"
        },
        {
            "review_text": "If you love Twin Peaks, then you'd love this! This is basically Twin Peaks the game. Am I right, Zach?",
            "review_score": "1"
        },
        {
            "review_text": "Deadly Premonition is one of the strangest games I have played. It has terrible graphics, a story largely ripped straight from Twin Peaks, combat that is so easy it feels tacked on, bad driving controls, and terrible sound design among other things. In the end though I enjoyed it enough to finish the game with all the side missions completed and I even got the 65th trading card. It isn't by any means a good game, but something about it just makes it fun. This is very much a video game equivalent of a cult film. Anyone who enjoys the sound of that should give the game a try.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "You'll have the best worst time of your life trying to follow this game &lt;3 10/10 Best Game Of The Ever",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my personal favorites from the (360,PS3) generation. It might not look like much, but if you go beyond it's low end graphics and controls, there is a special thing about it and that special thing is what made it a cult hit.",
            "review_score": "1"
        },
        {
            "review_text": "I cried 20 minutes at the end. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I went open minded to this and i must say...I freaking love it so much! I rarely judge a game based on its bugs or crashes, I mostly care about the gameplay and the story, the gameplay is alright, reminds me of a mix between Resident Evil 4 and Silent Hill, and the story so far is amazing! The humor is awesome, the characters are original and really know how to make you love them, specially the main character...Ahhh York! &lt;3 The soundtrack altough repetitive is pretty cool sometimes, specially the whistling one, i whistled along everytime!  In general, if you ignore the sometimes annoying random crashes and the bugs, and you love a good mistery/horror/open world game, this game is perfect for you!  8.5/10 so far! :)",
            "review_score": "1"
        },
        {
            "review_text": "I thought I was getting a horror game. I got a driving game, a typing game, a fishing game, a dressup game, a shaving simulator, and Twin Peaks with the serial numbers ever so lightly filed off. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A rich, story driven action-horror game with decent, pseudo-RE4 controls and great commidic relief, Deadly Premonition is a MUST HAVE for ALL gamers.  10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "If you love Twin Peaks, then you'd love this! This is basically Twin Peaks the game. Am I right, Zach?",
            "review_score": "1"
        },
        {
            "review_text": "Before I begin, I owned this on Xbox and recently started playing through the PC version.  I'm not sure I can say Deadly Premonition is good, but at the same time it is. I've used 'disgustingly average' to describe it before. Yet, I can't recommend it enough. Its basically Twin Peaks the game, in a sense.   If you like horror, or action, or story, this is a game for you. The game has many flaws. The driving sucks, the combat could be a little better, the squirrels make MONKEY noises. But, those make Deadly Premonition what it is.   This game is basically the definition of 'So bad it's good'",
            "review_score": "1"
        },
        {
            "review_text": "Deadly Premonition is the vieo game verson of Twin Peaks but with a supernatual twist and a japanese charm. Recomended if you like small town murder mysteries with bizzar characters and if you like the odd obscure Japanese game.",
            "review_score": "1"
        },
        {
            "review_text": "This game. Holy ♥♥♥♥. It's just like one of my mystery Chinese visual novels, except in America.  i cant click the yes button enough",
            "review_score": "1"
        },
        {
            "review_text": "You play as an autistic detective in this game.",
            "review_score": "1"
        },
        {
            "review_text": "The coffee says: 'bring a raincoat'",
            "review_score": "1"
        },
        {
            "review_text": "Without spoiling the game and giving away what makes this so special, I will simply say that Deadly Premonition is one of the most underrated and brilliant video games ever created. Full applause and credit to the one and only Swery65 for making a game that despite it's major shortcomings (controls, graphics, PC optimization) is the most engrossing and intelligent games out there. And again without spoiling anything, has the best twist in a story that proves just how important the video game medium is.  If you're even remotely interested in this game, just pick it up. Especially at such a cheap price ($2.49 as of this review), you'll be getting a game that you can sink hours into playing and days upon days discussing with your friends. Just be sure to look up some of the user made patches like DPFix to get the most out of the game.",
            "review_score": "1"
        },
        {
            "review_text": "thid is a awesome game great graphics great controls great dl models great animations best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Bad game: the game. A good game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "If you’re going to measure Deadly Premonition using traditional gaming yardsticks like graphical fidelity, gameplay challenge, and overall polish, then this Director’s Cut still comes up short of modern standards even with the fixes. Yet despite any obvious technical shortcomings, it succeeds on the strength of its story, its characters, and its countless WTF moments. It doesn’t feature enough new content to interest existing fans, but if you want to find out which side of the love-it-or-hate-it divide you're on, now’s the perfect time to play one of the most memorable and utterly insane survival-horror games ever made in its most accessible form.",
            "review_score": "1"
        },
        {
            "review_text": "Words cannot describe how good this game is zach.",
            "review_score": "1"
        },
        {
            "review_text": "Zach, this game... it's amazing.",
            "review_score": "1"
        },
        {
            "review_text": "did you see that zach? clear as a crisp spring morning!  GOTYAY! IN the coffee!",
            "review_score": "1"
        },
        {
            "review_text": "Not the best port, but it's absolutely one of the best games ever made. Feels like a long-lost Dreamcast game with absolutely incredible characters, story, and world-building. Worth playing on whatever platform you can.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated games of history",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece. Honestly, in my book it wins best game of all time. The plot is just really awesome with twists and turns everywhere. The main character is hilarious. FK..in the coffee. I lost my ♥♥♥♥. If you want a really good storytelling single player experince, this game does the best job on it. However, it dwindles in the graphics aspect as the characters' audio isn't usually in sync with the character's lip when they are talking. But that's only a small minor problem. ",
            "review_score": "1"
        },
        {
            "review_text": "Introduce Simulator 'FBI Special Agent: Francis York Morgan. Please, just call me York. It's what everyone calls me.' 10/10 would introduce myself again.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know where to begin to describe this. This is probably the worst PC port in the history of ports (even worse than Dark Souls). It crashes constantly and has little glitches here and there. That's not even touching upon the absolutely horrendous combat and driving mechanics. But hell if this wasn't one of the most unique games I've ever played. And the story is one of the best I've ever had the pleasure of experiencing in a game, and for that alone I'd recommend this game over a hell of a lot of other titles. If it's on sale and you think you can stomach the little fixes and mods you'll need to actually run it, you might just love it. Otherwise, pick up the more stable PS3 or Xbox 360 versions.",
            "review_score": "1"
        },
        {
            "review_text": "Zach, could you recommend this?",
            "review_score": "1"
        },
        {
            "review_text": "CAUTIOUS RECOMMENDATION: In its current state, I can't recommend DP to anyone but the old school PC gamers that don't mind getting their hands dirty with tweaks and fixes to keep it stable, let alone looking adequate. If you don't know what an .ini file is, stay away. Even then, a quality experience is far from assured.  Aside from the abundant technical problems, everything that could be called gameplay is clunky and monotonous. It's absent for most of the game, but the ending ramps it up a lot, which quickly feels like a chore to complete.  That said, the characters and story are worth the trouble for those with the requisite patience.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best port, but it's absolutely one of the best games ever made. Feels like a long-lost Dreamcast game with absolutely incredible characters, story, and world-building. Worth playing on whatever platform you can.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good. I love the controls and Twin Peaksy feeling. Maybe filling the gas tank is not necessary.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine if Twin Peaks was made by a semi-♥♥♥♥♥♥♥♥ Japanese man named Swery and that's essentially what Deadly Premonition is.  I love it and you should too.",
            "review_score": "1"
        },
        {
            "review_text": "The best worst game ever",
            "review_score": "1"
        },
        {
            "review_text": "Not worth playing much of, but great when it's cheap, and one of the most ridiculous games you'll ever come across, go with the LP though.",
            "review_score": "1"
        },
        {
            "review_text": "This game legitimately manages to be both the best and the worst experience I've had playing a game.  By default it's locked at 30 FPS and 720p, while crashing constantly. Installing a fix for this doesn't actually fix the framerate issue causing it to change periodically AND change the game speed with it, as well as cause it to crash MORE. It's a knock off of Twin Peaks despite SWERY claiming to have never heard of it It's never getting an actual sequel due to the fact that SWERY has stopped making games to be a buddhist monk (Look it up I'm not ♥♥♥♥♥♥♥tting you) The gameplay itself is unbearably boring  That said the wack-♥♥♥ story and crazy characters/writing have elevated it to being one of the most memorable and fun experience I've had in a long time.  It's like $2.50 on sale the fact that only 2 people I know have it (One of which I gave it to) is a shame on all of you.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know how to properly describe this game or how it found its way deep into the cuckles of my black heart but my god is it a tour de force of pure WTF. If you have a pension for the weird and don't mind a terrible port, buy this ♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, the art is meh. The controls are bad, but not unbearable. Yet the story is incredible.  The story alone makes the game worth it to play.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite games. You have to play it to believe it. It'll bring you tears and it'll make you laugh. It's truly a game worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Atrocious port for an unique and fantastic game. Worth it only if you buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's a weird game. Play it only if you have the patience to absorb the bugs and a bad port. Aiming weapons is really limited. Driving is atrocious. I have an issue with side quests available during a particular weather. That doesn't make sense. But availability of side quests at certain timings in a day is realistic. But the game has a good story, keeps you guessing on who the killer is. All the characters are well written and there are many of them. Huge attention to detail.",
            "review_score": "1"
        },
        {
            "review_text": "Deadly Premonition is one of the weirdest games ever. To give you a good analogy. Imagine if David Lynch wrote a brilliant script and gave it to Tommy Wiseau or Ed Wood to direct, then you would have a movie that would resemble this game. If this sounds like the most awesome movie ever, then you will probably enjoy Deadly Premonition. Ed Wood movies may be terrible, but their entertaining as ****.   Deadly Premonition is the brainchild of Hidetaka 'SWERY' Suehiro. I've read some interviews featuring SWERY and decided that he is completely bat**** insane and yet a genius at the same. This game went through development hell for 6 years and was almost cancelled 4 times. It seems like nobody on the team really knew how to program well, and the game was perhaps too ambitious for it's own good. When the game came out it was a broken mess. The graphics would have been good on the Dreamcast, the controls are so bad it feels like it has to be intentional(seriously, the car controls are so bad you'll have to play it to believe it), the voice acting is usally passible but can be cringe-worthy at times, the animations on the characters are laugable, the repetive yet catchy musical scores come on at the worst possible times, and despite the terrible graphics the game has horrendous performance issues. Apparently SWERY was actually shocked when critics proceeded to rip the game apart.  Despite all the games shortcomings, there were some people who loved it. Some thought the technical issues only added 'so bad it's good' charm of the game. And of course, the plot and writing of this game is brilliant, if not completely insane. It was obviously heavily influenced by the David Lynch's Twin Peaks. Many of the characters, including the main one, are completely bonkers. The main character Francis York Morgan always introduces himself by saying 'I'm Francis York Morgan, but just call me York, that's what everyone always calls me.' He constantly talks to his imaginary friend Zach. He says not to ask him about Zach, that's a 'private matter.' He literally tells his fortune by looking at the milk swirls in his coffee. To give you an idea of how crazy the writing in this game is *tiny spoiler ahead*, there's one part where a guy in a wheelchair with a skull mask and a gask mask on, who talks by whispering rhyming sentences to a translator, orders a bizzare sandwich in a restaurant. This sandwhich happens to be white bread and turkey, with strawberry jam and cereal(which appears to be corn flakes) smeared on top. York comments that this is a sinner's sandwhich, a sandwhich ones makes to punish themselves for their sins. The guy in the wheelchair challenges York to try this sandwich. After York tries it he jumps out of his chair in surprise, saying it's delicious and orders one. The expression on the two women's faces next to him is one of the moments that makes this game a masterpiece. BTW, you need to actually try the sinner's sandwich. I used Publix Italian Bread, Smucker's strawberry jam, deli turkey meat, and cornflakes. Putting the jam and corn flakes on top is ludicrous, so I just flipped the bread over. Surprisingly, it's delicous. I even made a second one after finishing the first one. SWERY says one of his starving college student friends actually made this, because he didn't have any money and those were the only ingredients he had. Too be honest, Americans put cranberry sauce and potato chips on sandwiches, so it's not too much of a stretch.  Slowly, but surely, just like the game NiER, Deadly Premonition gained gained a cult following. It did so for it's amazing writing and 'so bad it's good' gameplay. If you get this game, be aware that it may not even run properly and you might have to finish it by watching a let's play on youTube. SWERY actually apologized for this horrible port. However, there are a ton of fan patches out there to fix the problems. SWERY was flattered that the game had so much support that people would go to these lengths to make it playable. He said he wished he could hire some of the people who fixed his game. It might remind people of another cult game that was broken on release and had to be fixed by fan patches, Vampire: The Masquerade - Bloodlines. That also featured terrible gameplay, but a brilliant plot.  Definitely give this game a chance if you're a fan of cult classics. At least watch a let's play on youTube to experience the plot and bizarre characters. SWERY has also created a new game, D4, which is a lot less broken and features characters that are even more insane. Sadly, SWERY's games have failed to make any money(he released D4 on the Xbone and not the PS4 I mean, come on, the only thing Xboners play is Call of Duty), and he has taken some time off to recover from an illness but insists he'll be back. We can only hope. This guy is up there with Eric Wolpaw(Portal, Psychonauts, and Old Man Murray) as one of the industry's best writers, and it would be a shame to lose him.",
            "review_score": "1"
        },
        {
            "review_text": "Here's what I recommend:  1. Buy the game; support the developer 2. Don't play it 3. Watch all the cutscenes on Youtube  While there's approximately 6 hours of cutscenes, you'll find this to be much more enjoyable. The game portion of it isn't that bad, but you're just playing it to see what happens next.   Or you could just watch Twin Peaks (Oh damn, betcha never heard that one before).  This gentleman/woman took the time to piece together everything. Youtube link:         YouTube™ Video:  Deadly Premonition: Director's Cut - The Movie / All Cutscenes in 1080p [1/3]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "If you can you should just go ahead and play the original or the PS3 version of this excellent terrible game, otherwise prepare to soldier through a lot of freezes and crashes, I did, but it took all my determination and autism to do it.   I'm proud of myself.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played this game I was blown away, not by it's graphics or it's gameplay but how strange everything was. All of the characters are memorable and 90% of the dialogue will have you saying 'what the ♥♥♥♥?' but it's got tons of charm. I can't recommend this game to just anyone though because it takes effort to look past it's shortcomings and really appreciate what it offers.  Did that sum it up pretty well Zach?",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty much Twin Peaks: the game. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "An obscure game known for being the most polarizing horror game ever, Deadly Premonition delivers a memorable experience. Despite bargain bin graphics and gameplay, the cast of bizzare characters make up for it, alongside the strange story. The PC port is unfortunately terrible, providing no graphics options, locked 720p resolution, locked 30fps, (According to Framerate Police) potential degrade in performance over time, failing to start on Windows 8, and frequent crashing. A mod called dpfix by the same dude that made the beautiful dsfix for Dark Souls' infamous PC port fixes issues and gives graphics options to the player. Now play this and make a Sinners' Sandwich.",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend this game enough! This is above all my favorite story ever. It's the cheezyest most hilarious best worst thing ever made!",
            "review_score": "1"
        },
        {
            "review_text": "Best worst game.  Like a Twin Peaks video game made by the characters of Twin Peaks.",
            "review_score": "1"
        },
        {
            "review_text": "This could be the best, worst game you'll ever play. I'd say a controller is required, instead of recommended, and look around for durante's fix, it's not a great port. From the moment you meet York and Zach, to the credits, this game is a roller coaster.  P.S. don't skip on the sidequests, they unlock things such as fast travel",
            "review_score": "1"
        },
        {
            "review_text": "F K in the coffee.",
            "review_score": "1"
        },
        {
            "review_text": "☛ Poor graphics ☛ Poor sounds ☛ Poor optimisation  ✌ The best game I've ever played ☕",
            "review_score": "1"
        },
        {
            "review_text": "There is so much to love here, the technical performance is not one of them (crashy) but hell it's worth it just for the whackiness, it's all the things you love about Japanese games turned up to 11. Cannot recommend it enough. bit of a tip, this game seemed to work better streamed than native, lol. And I challenge anyone who plays this to not whistle the them tune at least once a month.",
            "review_score": "1"
        },
        {
            "review_text": "Really wanted to play Deadly Premonition.  Everytime I launch the game it crashes immediately. Tons of problems with the port after that.  Very disappointed.  Edit: After installing DPfix, changing the compatibility to Windows XP, nearly ♥♥♥♥ing my OS, and uninstalling VLC and MPC-HC, I finally got the game to work. Still not recommending because I don't really want anyone else to go through all that bull ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "While I enjoy the story of this game I cannot overlook the constant crashes and bugs that abound in this poorly ported title, especially given the $25 USD price tag.   My game freezes about 5-10% of the time when checking side quests. Random freezing during loading screens. Performance issues on a beefy rig when running windowed. Unable to interact with required doors/objects during certian missions.  Issues while driving that cause my tires to sink into the road bringing my car to a sudden stop.   Also, this game is locked to 720p which can be fixed with the dpfix mod but installing that brought about an issue where the game freezes when I tab out.   If my friend did not want to watch me stream this game I would have already deleted it within the first hour of gameplay.   TL;DR : Great story, amusing characters in this Twin Peaks inspired game but bugs and crashes make the game nearly unplayable. Not worth the price. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "I've not played a pc game as crash prone or broken since the original unpatched s.t.a.l.k.e.r.  Even with all the fixes and remedies you're going to need some luck to get through it.  I suggest just getting the console version even though that version isn't exactly stable neither but it's at least playable in some respects.   Only because how poor the original console version does this game actually gets excused from being the worst pc port ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Full controller support is not accurate. Xbox 360 controller works fine for every other game with controller support, but can not even move when I try to use it for this game. I googled it and apparently this is a big problem that still has not been fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game simply doesn't work on PC. Only a few could play it through because of DPfix (or even DSfix), but nonetheless this is utter sh*t. Do yourself a favor and just go watch youtube if you wanna know the story but just DON't pay any penny for this. DOES. NOT. WORK. Crashes everywhere. DON't. Just don't.",
            "review_score": "-1"
        },
        {
            "review_text": "Deadly Premonition is a fantastic game that I would not recommend to anyone.   Many comparisons can be made about Deadly Premonition - I myself found the combat to play like RE4, the overworld to faintly remind me of Psychonauts, the time-based mission structure to resemble Dead Rising's own (although major difference being in Deadly Premonition you can just ignore the time restraints and be none the worse) and even the mechanically-driven story setpieces to remind me of Metal Gear Solid's storytelling methods. The near Frankenstein nature of this mish-mash of tones and mechanics will undoubtedly remind you of many products too.   It's not remotely a serious game, though it does have its serious moments and it benefits heavily from them. The much-touted awful combat becomes merely mediocre if you play it with a gamepad - and you should play it with one. The characters are interesting, the dialogue is brilliant, the story is exactly as mysterious as it tries to be (though in no small part due to its poorly-veiled source material) and even the art direction is consistent and visually appealing, graphical glitches and some aging NPC models aside.  The point is that many people have recommended Deadly Premonition on the basis that 'it's so bad it's good'. This isn't true. Deadly Premonition is a geuininely good game that has won a cult following despite its shortcomings - I fought tooth and nail to fully complete it simply because I enjoyed it.  But I wouldn't recommend that you play it, because I can't be sure you can.  It took me a good 45 minutes just to get it to start without crashing. Beyond that I was fighting through runtime errors, outright crashes, even the odd Blue Screen of Death - any moment in the game that had me go longer than 20 minutes without a save point was a nerve-wracking nightmare. These aren't some faintly annoying bugs and this game is infamous for its port for a good reason. Right up until the very end my playthrough was plagued by some unseen demon.  For the technologically savvy there is a unique and memorable gem here that has been sadly soiled by its monstrous technical issues. For everyone else, move on. Watch a playthrough on Youtube because it really is worth experiencing, even if second-hand.",
            "review_score": "-1"
        },
        {
            "review_text": "An utterly broken piece of software. It'll run for a little bit then either fail to load the save file, stop recognizing keyboard input or simply crash. How bad does a game have to be before Steam decides to stop selling it?",
            "review_score": "-1"
        },
        {
            "review_text": "I've heard a lot about this game. This is probably the most overhyped game I've ever played. I've read tons of reviews on different sites and in Steam and almost everyone claims DP to be an uncut diamond, an underestimated masterpiece, a unique experience and so on. After playing it for almost 25 hours and coming up to the end I felt kinda... frustrated.  I must say that I really enjoyed its atmosphere and the first half of the story. I had no problems with graphics, poor animations, sound, controls etc. Everything was absolutely fine for me. I don't understand people who say it is a bad port, cuz it looks and is being played MUCH BETTER than on PS3. I don't understand the ones who play it with gamepad either cuz aiming with mouse is 100 times better. Everything was great for the first half of the game, but then...  First of all, the game pretends to be open world. With side-quests from different civilians. Bla-bla-bla. All these 'quests' are like 'find an old lady's picture in HER ROOM' (probably she became absolutely blind in her years, I don't know), 'find dead daughter's dress (in her room ofc)', 'find sheriff's dumbbell', 'find sheriff's assistant's keys' and so on. You got my point, right? Of course, there were some interesting quests like searching for dead man's bones and a map with secret passage BUT SUDDENLY...  ...the game stops to be openworld! For nearly ~4 or 5 last hours it becomes a straight 3rd person corridor shooter. And developers don't even warn us about this like 'guys, soon you will be unable to complete your quests and other stuff' and just push you through till the end. Seriously, ♥♥♥♥ quests I didn't finish! ♥♥♥♥ exploring! Surprise, ♥♥♥♥♥♥♥♥♥♥♥♥!  Another thing, last, but not least.  ATTENTION! SPOILER ALERT! Don't read this if you still decided to buy and play this game!     Imagine that you are playing first Silent Hill, you enjoy every second of it and in the end of the game Alessa turns out to be a giant Godzilla with rocket launchers and a big pink ponytail. This is what I felt during the bossfights with George and Kaysen. I understand, that this is a Japanese game, it is supposed to be odd and weird, but Swery, seriously, is it some kind of trolling or were you just high? What the ♥♥♥♥, man?    Thank you for reading this if u did. I am not going to persuade you not to buy this game, I am just sharing my own opinion. For me this game is one of the biggest disappointments ever compared to other games I've played. It started so good and ended like absolute delirium.",
            "review_score": "-1"
        },
        {
            "review_text": "The Best Game I can never recommend, because of bugs and crashes. Play the console version if you can!",
            "review_score": "-1"
        },
        {
            "review_text": "Controller and keyboard control customization is horrible. If I use the controller, then the camera keeps on spinning fast around the character...which causes me to feel dizzy and makes me want to lose my lunch. and I can't even adjust for that sort of thing to prevent that from happening. Keyboard controls also suck hardcore for a lefthanded person like me... you see, I like using my mouse with my left hand... which means I usually use arrow keys to nagvative, not that WASD ♥♥♥♥. so there's usually a delayed reaction for my character when I have to switch between mouse and keys.... that ends up with my character dying a lot. it's actually much more work to play this game than it is fun to play..... I actually wish I hadn't brought this game in the first place.",
            "review_score": "-1"
        },
        {
            "review_text": "Trying to open a door : game crash. Trying to drive my car : game crash. Trying to talk to people : game crash. Trying to launch the game : game crash. Trying to crash the game : game crash. Not doing anything at all : game crash.  10/10  Would crash again. And again. And again.",
            "review_score": "-1"
        },
        {
            "review_text": "It's so scary my PC can hardly play it with out saying NOPE and crashing to desktop.  In all seriousness there is a decent interesting game here but theres just too many bugs and crashes to make it worth while. From what I have played I really like it but having to play from save point to save point constantly worried if the next cut scene or character conversation is going to cause a crash really distracts from the story and atmosphere of the game.  A few fixes or patches would shape this up into a good little game but as is its I can't suggest anyone else buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible combat system. Saving only at specific locations. Not fun at all when you have to repeat 5 or more minutes of your gameplay. I thought it will be more about story and puzzles. It's about shooting zombies in the head.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is very enjoyable and it's design is unique. It has flaws, but those flaws bring a type of charm to the game that is very addicting. But the port is so ♥♥♥♥ing bad that it's unplayable. The fps ♥♥♥♥♥ in it's pants in some areas. The controls are bad and have technical difficulties. But the nail in the coffin is the random and sometimes guaranteed crashing. The problem is that working around these crashes are boring and can take a long time. Since there are so many issues with the port it's never clear what causes your game to crash, so you spend a lot of time trying to find the solution on the internet, but I just got tired of it. It's a great game, but I don't think any game is worth this much. You're buying a pig in a poke with this, and I can't recommend that to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is broken.",
            "review_score": "-1"
        },
        {
            "review_text": "There's broken games, like Bioshock and dark souls 1, all fixable with tweaking and fixes  Then there's Deadly Premonition, a cancerous mass that even mods and tweaks can't save. They can only spruce it up, but now we just have a spruced up corpse on our hands. A zany, goofy, unique spruced up corpse on our hands.",
            "review_score": "-1"
        },
        {
            "review_text": "This product should not be sold on Steam. Granted, there are some people who successfully installed and ran and even played it, BUT there are many many others, myself included, who have tried and failed multiple times to play it.  Generally, I usually chuckle at people who have problems installing a game but this time the joke is on me. I tried three different PCs, nothing funky in the hardware and OS of any of them (all Win 7 64bit). Long story short, I did manage to run the game. My gameplay (after actually entering the game) consisted of one interaction before the game crashed. Repeated attempts came to the same conclusion: it seemed that any interaction caused the game to crash.  There are a number of so-called fixes, none of which worked. An amusing one requires you to run the PhysX driver over again, first to uninstall and then to reinstall. This actually works, sorta. It allowed me to get behind an instant crash and get the game running. But as noted above, the game would crash soon thereafter.   If you get DP as part of a cheap bundle, go for it and roll the dice, but don't pay even a Steam holiday sale price for this product.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite it's interesting Twin Peaks like premise and great atmosphere the bugs this game is plagued with (like random crashes back to the desktop causing you to lose progress) I cannot recommend this game to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "Broken Twin Peaks rip off.",
            "review_score": "-1"
        },
        {
            "review_text": "This is probably my favourite game ever.  This is also the worst port I have ever played.   For a few hours, I thought I was safe from the horrors of the port. I followed recommended fixes, ran it in compatability mode and the like, but it randomly - in full screen mode - being windowed with the rest of the screen black. Then it started crashing, randomly - in the middle of a cutscene, in the middle of a level, in the map screen.   I paid 2.49 for this and it isn't worth it.   It really is unplayable.   Treat yourself and get the XBOX360 version - that I have played through, and yeah, the controls are clunky, but they're clunky no matter what version you play. The XBOX360 version works. I'm planning (when PS3's come down in price) to get the director's cut for the PS3.  Anyway, in terms of the game, this is one of my favourite things ever. Having ran through the game the first playthrough, I'm doing all of the sidequests this time. It is a wonderful, quirky, interesting, strange game. Get it on console and enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "The game's not bad. I got it free on PS3. Can't run it on Win 8.1 though. So no recommendation from me.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start by saying that I like this game, but I cant say enough how much you shouldnt buy it here. This port is broken. You are lucky if it works at all on your computer. For me, with my brand new gaming computer, this game crashes every seven muinets at the most, Making this game unplayable, as many of the save points can be as far as fifteen muinets apart.  Buy the 360 or PS3 version. Theyre still bugy, but at least they work.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game on PC. Get it on PS3 if you can, or Xbox 360 if you have no other options if you really want to play it.  First and foremost, crashes when trying to run at full screen. Horrible lag when running in windowed mode. Durante's working on a fix, but at least Dark Souls was playable.  Do not get.",
            "review_score": "-1"
        },
        {
            "review_text": "The cheezy and dialogue, dated graphics, terrible voice acting and stale and uninteresting gameplay is over-comeable, as it does mold together to make something weirdly entertaining. However, the game is filled with so many bugs and glitches that it's hard to play more than an hour without stumbling on some glitch that requires you to restart the game to be fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "You can't really fully enjoy the game when the crashes keep you from progressing. Yes, there are a lot of them.",
            "review_score": "-1"
        },
        {
            "review_text": "It takes some serious psychic detective work just to get this game to launch.",
            "review_score": "-1"
        },
        {
            "review_text": "It takes some serious psychic detective work just to get this game to launch.",
            "review_score": "-1"
        },
        {
            "review_text": "Thumbs down mainly because horrendous port.  As a port, this is possibly one of the worst port ever in the video game history. Anyone even remotely, vaguely aware of Deadly Premonition should already know by now just how bad the PC port is. Even setting aside the lack of HD graphics, the game runs. like. ♥♥♥♥. It actually suffers from memory leak issue. My personal best time before Crash To Desktop is slightly under 2 hours. On the norm, anything just a bit over 1 hour the game will commit ritual suicide on the dot. Anything related to opening the map screen seems to really exacerbate the leak issue for me, this leads to some very annoying side quests run. Replaying a chapter for side quests sometimes will bug your game out. This is serious game breaking potential bug too. You damn well better make a save backup before you do anything foolish.  As a game, Deadly Premonitions starts out absolutely brilliant. Then it took a wrong turn and ends up on a railroad heading to DBZ town.   The Gold: Really quirky casts WTF is wrong with this music?! The amazing attention to details York's amazing knowledge of old movies   I can certainly see why this game became a cult classic. It has all the lovable and lovably hate-able characters. The flattest character in this game is   the dog  , but I bet even he has ulterior motives deep beneath that   fur coat  . (Actually confirmed by SWERY) The soundtracks have this dissonance to it that it'll play some cheery tunes at some very inopportune times. Too bad this sort of thing doesn't happen toward the end of the game where there are moments where I become very irritated. (More on end game later) A big notable mention is the attention to details of character interactions. Generally, character dialogues of when what where occurred won't be remembered. So in other games there'd be occasions of you've already met this character, even done a few side quests for said person, but the game will still treat you as you've never met him/her unless plot dictates so. Deadly Premonitions is the exact opposite of such syndrome. In fact, it has a near compulsion of keeping track of who/what/when/where. You can physically see NPCs moving from one location to another as they go about their daily business. If the weather changes, their behavior patterns will change as well. That's some impressive bits of details for none big budget games. You'll actually miss some impressive and hilarious nuggets of gold this way if you don't have a habit of exploring and wandering about. I do so enjoy York's car ramblings about old movies as well.   The Unnecessary: Your piddly map screen that can't even fix its orientation Clunky combat and driving controls End game railroading DBZ boss battles and worse dialogue   Time for the really ♥♥♥♥ parts. The controls for this game can be abysmal. The combat is laughably bad. This is PlayStation Resident Evil 1 clunky. The quick turn animation doesn't quick turn my camera as well. I still need to slowly adjust it with my mouse or pad. Aiming is clunky, but at least the game is generously forgiving (until end game bosses.) Driving a car around town proves to be a challenge. This is where the attention to detail bit on the town will drive some people nuts. Greenvile is treated as an actual town, not a crappy rundown composed of just 2 blocks of random shops, houses, and 1 Inn. No. Actual people with their own homes, places where they gather, the works. On paper this sounds like a wonderful thing. HOWEVER, this becomes an issue when your map is forever stuck showing just one tiny bit of the town. The place is HUGE, hardly helpful when you need to get to the far side of the map. The map is NOT fixated to North/South/West/East/Whoville either, it is related to where you are positioned. Thought you got the map figured out? Oops, you moved so it changed orientation. This is Google Map without the actual GPS telling you where to go. There's just a big fat arrow pointing vaguely on the horizon on where your next plot point is. You can argue they are trying to encourage exploration, but being stuck in a game with memory leak problem... Oh, your car also has this weird tendency to do some weird ragdoll physics; hit some invisible or tiny pixels in the road and spin off the road. Car controls itself is pretty damn clunky as well. If you are doing the sidequests that involve racing, this can get frustrating really quick especially in the downtown area.  This is a sad mention, but I actually have an issue with the plot execution. Not because it is ridiculous, but how it really spirals downwards near the end from poor execution. From the outset, the game encourages you to freely explore the town and do your own thing. You can jump on and off the investigation train at any time, no time limit is ever imposed on you. Shoot the breeze with the local crazies. Wow, there's a crazy killer on the loose. So what, I still have time to go fishing, sort boxes at your local store, eat a delicious sandwich made of sin at the diner. Hahaha. So what happens near the end? This is when the game takes itself too damn serious. You are being bound, gagged, and railroaded to the final boss bum rush mode. You want to stop and buy supplies? No dice. You want to redo some old dungeons for cards and infinite weapons? Too bad, so sad. My problem with this game is they've put the Point of No Return a few chapters too damn early. I'm in a game with big memory leak issue. I'm constantly worried about the game choking on itself in the middle of a dungeon, or the last bouts of bosses. Oh ye gods, the bosses. The freaking bosses also have the RPG syndrome of multiple forms, with a side order of crap dialogues. 'Bwahahaha, you thought you killed me? BEHOLD! My second and mightier form!' You kill the ♥♥♥♥♥♥♥. ':cough hack: You... You thought you beat me?! Foolish mortal! Now I'll reveal you my true self!!!1111' ♥♥♥♥. Me. This is padding. You are actually padding the damn game. Any boss battle with more than 2 forms is considered obnoxious. Your boss dialogue is contrived, half ♥♥♥♥♥, simply moustache twirling level evil. Where's that button for taunting or ♥♥♥♥♥ slapping my opponent!? Have you dealt with the final boss in Ace Attorney Investigator? Yeah, that really dragged on didn't it? Remember: time crunch, memory leak, game explode? Ugh. I've actually had to skip quite a few vital plot scenes before the boss battles for fear of the game crashing. (and I couldn’t stomach the big bad’s writing anymore) It turned out to be a smart move, because it DID drag on. Why why WHY? You had such a great start...     Actual plot spoiler tag, do not click unless you know what you are doing.   You know that bit where you become the Raincoat Killer? Looking back, I probably would've enjoyed the ♥♥♥♥ out of that if I wasn't in such a hurry to get to the next save point before the game crash.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sorry that I recommended this game about a year ago when it was on sale on the humble bundle store for about $1. I thought they had put more effort into the port than they did. But as it turns out it's just yet another bad port. Bad in a way that only japanese studios that regret their decision to take console exclusive deals can do.  Got it running by breaking physx for other games on my system that link to it. Only to see that the resolution is hardcoded to 1280x720. I was aware of dpfix. But even though it evidently loads the symbols just fine (as indicated by not segfaulting) it just sits forever eating my cycles. Likely caused by a recent update.  There are people on the forums trying to defend these incompetent developers. They shouldn't. They're only further ruining Steam. Having a quirky game that likes to have a bit of fun despite itself is one thing (and is why I came to want it in the first place) but having a buggy piece of ♥♥♥♥ maintained by incompetent developers is another, and believe me they are incompetent.  The fact that libs that override d3d9 symbols exist in the first place is evidence of that. As the complexity of the problem goes up so does the complexity of the override libs. But ones like these -though written by undoubtedly competent people- merely provide basic features that the game should have in the first place. Like adding a second step that adjusts resolution based on values given in a config file.    Edit:  I was able to fix the issue causing the game to just sit there eating cycles and have it running in my native resolution. I'm sure the game will be as fun as I figured it would be but my review above still applies. The short of it is: Don't bother if you're not comfortable having a game that isn't playable right after download from steam. It's going to take a bit to both get it to actually run without segfaulting and get it aesthetically reasonable (meaning native resolution of your monitor and properly saturated environments).  Had I known this port was as bad as it was I wouldn't have encouraged developers who do crap like this by giving them money. I suggest you don't make the same mistake.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible Graphics. Horrible, HORRIBLE Voice Acting, like they translated Japanese-English 1:1. Controls and interface are awkward at best. While I'm not far into the game I have to say the story makes absolutely NO SENSE AT ALL. Combat is.. well.. clunky and boring. Unless you're into this kind of games and don't mind playing in japanese you should really avoid this.",
            "review_score": "-1"
        },
        {
            "review_text": "Broken from the start. After downloading the game it would not launch at all. To fix that you have to run dplauncher as administrator. Then i calibrated my wireless 360 controller and launched the game after that and set my control config to joystick in the launcher. Buttons worked fine and the game is advertised with 'Full Controller Support'. RIght when i gained control of the character i could not move but the buttons worked. I downloaded and installed the dpfix and it didnt do anything. I really wanted to play this but i only paid $2.49 and i wouldnt recommend buying it at that price. I guess i'll just buy the ps3 version.",
            "review_score": "-1"
        },
        {
            "review_text": "i wouldnt recommend this game for now there is alot fps problems, controller problems, so just wait for fixes on game first",
            "review_score": "-1"
        },
        {
            "review_text": "if the developers are willing to release a port this poor and expect people to pay full price for it they simply do not deserve the money. avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I was really forward looking playing this little gem. But, was I in for a surprise. This little 'gem' is in fact just a little turd. First, it runs just in 720p, except you got the fix, and the in-game-mechanics aren't great either, driving physics from hell (and there are RACES, who would want to do that?). and it crashes so every often..my game is now broken to the extend that I can't play any further. It crashes after a cutscene, when it's loading...so, please, DO NOT BUY!! cheers, Sam",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately Zach, I just can't recommend this game. Sure, it has some of the goofiest writing I've ever seen, and the music seems to become inappropriately cheery in scenes where a murder has just taken place, but this port is awful. It crashed at least 15 times in my playthrough, sometimes well after my last save point, causing me to lose a lot of progress. The DPfix mod helps make the game look decent, but the game itself is just way too unstable. Get the XBOX 360 version if you just have to see what all the fuss is about.",
            "review_score": "-1"
        },
        {
            "review_text": "This is officially the worst game I've ever played. Avoid. Avoid. Avoid.  It's easy to imagine that the early design discussions went something like this:   'I have an idea for a game! And by idea, I mean let's copy something. How about we turn that weird 90s TV show by David Lynch into a game!'  'You mean Twin Peaks?'  'Yeah!'  'Twin Peaks is about an FBI agent investigating a murder in a small town in the Pacific Northwest. It's a mystery, but mostly a character drama. What would the player fight in this game? There's not much action in the show.'  'Zombies.'  'Ok...are we going to explain to the player why there are zombies?'  'No! I don't wanna! Let's just make it so the zombies are only visible to the main character. That way we don't have to explain why the rest of the world doesn't know there's a zombie apocalypse.'  'So every combat section of the game takes place inside the players head?'  'Yeah. Head zombies.'  'Got it. So how does the player get around?'  'It's open world.'  'Like GTA? You can drive?'  'Yes, except you can only drive from a first-person view, you can only drive certain cars, and they'll each go an incredibly slow speed and flip over all the time for no logical reason. Oh! And the cars will include an incredibly small gas tank that you have to use in-game money to fill up at the one and only gas station in town.'  'And you can go anywhere?'  'Sure! Except if you get out of the car in areas where we're too lazy to implement pathing or textures we'll fine you for being stranded and magically teleport you to a random location. And - I almost forgot - there are invisible walls everywhere.'  'Nice touch. Gotta have invisible walls. Will there be a fast travel system to avoid all the monotony?'  'Definitely. But we'll lock it for most of the game until the player completes an obscure side quest.'  'Why obscure?'  'Well the side quests will only be available depending on the weather conditions. We're implementing  dynamic weather .'  'Oooooooooo.'  'Yeah, buzzwords. But since it's weather and the player obviously has no control over it, they probably won't encounter any sidequests on their own. They'll be basically impossible to find without looking up. Did I mention there's a time system too? And the side quests are also dependent on that? It complements the weather.'  'That's so real. Just so real. Can the player control the time at all?'  'Well they can sleep, but only at pre-designated areas that we'll make sure are very inconveniently placed. And if the player doesn't want to sleep, we'll make them! If they stay up after midnight the zombies will come out and attack the town!'  'I thought they were just in his head? And you know vampires are the monsters that come out at night, not zombies.'  'Don't question my inconsistencies! We'll also make the player tired if he doesn't get enough sleep. It'll slow him down and eventually start draining his health. The same for food. You have to eat. If you literally do nothing and keep the game running you'll die in under an hour. Just like real life!'  'So the player has to manage food and sleep levels, with a limited inventory and only specific, far away places they can rest or buy food?'  'Exactly!'  'This game sounds truly awful. There's no way I'm going to play it.'  'Oh I'm not going to play it either. But we can still sell it: just call it  art .'   On a meta level, the PC version has all the problems Dark Souls did: terrible graphics, awful mouse support, and constant, ever-present crashing. You're going to need third-party hacks to even get it to run. In the process of getting my 100% playthrough the game crashed over 100 times (yes, I started counting). Developers: shame, shame on you.  At one point I had a save file that would crash exactly five seconds after I loaded it. I almost gave up at that point. Luckily I discovered that sprinting inside prevented the crash, and I happened to be only about four seconds from a door.  How I wish I could get the hours spent playing this back, but I wanted to give the game a chance and by the time I realized it was never going to explain anything or get any better I was so far in I figured I might as well finish it. That's a lesson in not trusting my own instincts early on.  The story and setting are so close to Twin Peaks that I think there might be a legitimate plagary case here. Additionally, it's like the creators of the game don't understand storytelling fundamentals, writing dialogue, or even how to make games fun. Your arsenal includes weapons with infinite ammo, and despite the bad controls that simple fact makes the combat trivial. It seems like such an odd choice to provide infinite ammo but then make the player have to manage food. It's tiresome and does not add to the believability or realism of this utterly unreal world. It's like this game was trying to combine every genre: third-person shooter, open world, adventure, survival horror. But in the end it did all of them poorly.  This isn't groundbreaking. It's not art. It's just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "I forget to save for 3 hours and a fence appeared a few feet infront of me and I exploded 10/10. Other than that the port is ♥♥♥♥ and it looks like an upscaled dreamcast game. The shooting is resident evil 4-esc. The story features your typical japanese wackyness that you find in a suda 51 or early Dead rising game. Is it worth 25 dollars? No.",
            "review_score": "-1"
        },
        {
            "review_text": "Screw that game.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is great, until it crashes and never works again",
            "review_score": "-1"
        },
        {
            "review_text": "In principle it is probably a 'thumbs up' game. Alas, it wont run on my PC, no matter the tweaks with PhysX, DPFix, etc. pp. Hence the thumbs down. Apparently it is a poor console port to the PC.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic story and characters with great music. Gameplay is completely busted at moments. I'd suggest watching a playthrough like the one from Video Games Awesome or Giant Bomb instead of actually playing the game. It's really not worth the hassle to slog through the gameplay.  I groaned everytime there was an action sequence (I counted around 6). The combat isn't really enjoyable, sometimes you needed to fight monsters before you could progress, sometimes they infinitely respawn. The levels could become mazelike and hard to navigate through. At some point you need to do a tailgating mission that takes way too long (5-10 minutes). The bossfights aren't enjoyable because of the combat. The map layout of the town is made by a madman. You will sometimes need to drive to the other end of the town and instead of having a straight line from point A to B, you have a gigantic swerving line (not exaggerated). At some point there is a new mob introduced that's very bulletspongy but you can easily take out with melee. The downside? Your melee grade degrade so fast it's not even funny. There is a sequence where you need to fight four of those monsters in a row and I pretty much ran out of usable weapons at that time. When your health is low, you'll start limping, have fun progressing through the levels like that!",
            "review_score": "-1"
        },
        {
            "review_text": "I started playing this and it crashed right away.  I followed the PhysX reinstall option (google search it) and it started working.  Found the game can only be played at 720p, forced resolution, no way around that using the vanilla game software.  Tried DPFix to change that. All ini file parameters were WELL within what my PC and vidcard can handle, which, for this game isn't a heck of a lot. Tried to play... game crashed right away.  Did the PhysX reinstall again. Tried to play... game crashed right away.  Decided I'd already used up $2.49 worth of my time and uninstalled this piece of crap game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a scam If you have NVIDIA card you will play with 12 FPS due to a memory leak No solution for this .Be warned",
            "review_score": "-1"
        },
        {
            "review_text": "Won´t run at all-a complete waste of time.No tips from the internet can solve this, this 'conversion' seems to have be programmed by badly trained cockroaches. What will the 'publisher' do next? Steal children´s lollipops? Shame on you, may your disgraceful coding hand rot away! ",
            "review_score": "-1"
        },
        {
            "review_text": "Can't even launch the game.What a piece of junk 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Gave up trying to get it to work.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd recommend you try and track down a copy of this just to experience it. Just not the PC port. It just started crashing on me and, from what I've heard, it's going to be downhill from here. Find a copy on the 360 or PS3/4 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this, it's just the right kinda weird to be interestging, but it is a bug riddled mess, and one of the worst PC ports I've seen in a while. Add to that all the unnecessary QTEs and rather annoying boss fights, and I just can't recommend it unless you're seriously out for an all around punishing experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Gave up trying to get it to work.",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not work for me. I was excited to play it and its never going to run properly on my computer. Disappointed. I can't really recommend/not recommend this game because I haven't played it. Just a word of warning though, if your computer struggles with SOME games (not necessarily all, I can play a lot of games on my laptop considering its not a gaming laptop per se) like mine does, it won't be able to run this. I wish I didn't waste my money.",
            "review_score": "-1"
        },
        {
            "review_text": "I spent more time trying to get DP to run than playing it, and what I did get to play was a mixed bag. In particular, the music, writing, and atmosphere are pretty good, insomuch as they are Twin Peaks: the game but the shooting segments are absolute garbage most of the town, and most of the spaces within the buildings in town are empty space and the cars turn like bricks",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes. Don't really want to sit through the tedious Nick/Diane mission just to have it crash again.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, probably one of the worst PC ports I've played. Why was this allowed to be sold to the public?",
            "review_score": "-1"
        },
        {
            "review_text": "DISCLAIMER: I recommend any version of this beautiful game other than the pc port.  Deadly Premonition might be the greatest game of all time. While this review shall be focusing on the abominable pc version, I'll say this about the game itself: the graphics might be terrible, the sound effects were probably pulled from a free sound website, and it doesn't make much sense storywise at several points. But if you believe that games are about being immersed in a truly unique world, if gaming is not about getting an arbitrary number of points but is about telling a story in an amazing way that makes you care for the characters you see, I'd highly recommend you get this game for PS3 or Xbox 360.  Now onto the pc port, it's garbage. The problems are so numerous I have to seperate them into multiple catagories.  Crashes: Crashed 4 times in about 3.5 hours...maybe I could get a fanmade fix, but it's NEVER the fans' job to make sure the game works.  Controls: Space bar is draw weapon and aim (You can only fire and reload if you are aiming) I got used to this, but my problem is, while you can rebind many of the controls, you can't rebind aim to something resonable (Such as right mouse button) Also, certain buttons on the controller won't work if you bind them, for instance, I wanted to put the lock on command to left trigger. After I bound it, it did not work. Same as when I tried to put shoot onto right trigger.  Framerate: First half hour runs at about 10-15 fps, it ran fine for about an hour, now runs at a steady 5 fps. Uninstalling and reinstalling did not work.  Driving controls: They work fine (If a bit wonky) with a keyboard. When you use a controller, the physics speeds up so the cars, which only go about 60 mps in the game, can easily hit 150 on the open road and it makes the steering hyper sensitive. I thought at first the car's physics might have been locked to the framerate on consoles, explaining why on pc the cars go faster, since the pc version has a higher framerate. But why does it only effect controller?  In conclusion, the pc port sucks it's certainly not worth the bucks buy the game on PS3 or xbox, It will truly, knock off your socks.  So says Mr. Stewart.  Thanks for reading my review! My friend and I also have a youtube channel called, 'CultGamerAlliance'. Check it out if you get a chance!",
            "review_score": "-1"
        }
    ]
}