{
    "app_id": 24780,
    "name": "SimCity™ 4 Deluxe Edition",
    "release_date": "2010-07-20",
    "developer": [
        "EA - Maxis",
        "Aspyr (Mac)"
    ],
    "publisher": [
        "Electronic Arts",
        "Aspyr (Mac)"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "City Builder",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 3110,
    "negative_ratings": 959,
    "price": 9.99,
    "description": "SimCity 4 Deluxe Edition includes the bestselling SimCity 4 and the all-new SimCity 4 Rush Hour Expansion Pack. Create the most massive region of cities ever, with a farming town, bedroom community, high-tech commercial center, and industrial backbone.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/24780/header.jpg?t=1551379837",
    "minimum_requirements": "OS: Windows XP Processor: PIII 500 or equivalent  Memory: 256MB  Graphics: 32MB supported Direct3D capable video card with DirectX 7.0 or greater compatible driver DirectX®: DirectX 8.1 Hard Drive: 1.6GB Supported 3D Accelerator Hardware: SimCity 4 Deluxe / Rush Hour requires a 32MB 3D Direct3D chipset, and a display that is at least 800x600 in size, and supports 16 or 32-bit color.  It is recommended to always install the latest certified drivers for all your hardware   Supported Graphics ChipsetsCards with these chipsets are officially supported by the SimCity 4 hardware graphics driver: nVidia: <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.nvidia.com\" target=\"_blank\" rel=\"noopener\"  >http://www.nvidia.com  nVidia TNT2, TNT2 M64, &amp; TNT2 Ultra nVidia GeForce SDR, GeForce DDR, GeForce Quadro, GeForce2 GTS, GeForce2 MX, GeForce2 GTS, GeForce3, GeForce4 MX, GeForce4 Ti 4200/4400/4600/4800 SE, and GeForceFX 5200/5600/5800/5900 ATI: <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.ati.com\" target=\"_blank\" rel=\"noopener\"  >http://www.ati.com  ATI Radeon 7000, 7200, 7500, 8500, 9000, 9200, 9500, 9600, 9700, 9800 Known Issues: Due to hardware limitations with the ATI Radeon series, some buildings and graphic effects will be temporarily turned off while scrolling. There is a known ATI driver defect that results in SimCity advisor animations dropping polygons. To fix this, please download ATI driver 7.79 or later (also referred to as CATALYST 02.4) from <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.ati.com\" target=\"_blank\" rel=\"noopener\"  >http://www.ati.com on the Internet. Matrox: <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.matrox.com\" target=\"_blank\" rel=\"noopener\"  >http://www.matrox.com   Matrox G400, G450, G550, Parhelia SiS: <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.sis.com\" target=\"_blank\" rel=\"noopener\"  >http://www.sis.com   SiS 315, Xabre 400 Software Mode: SimCity 4 also provides a software-based graphics driver which will work with most video cards. 32MB of video memory is recommended. The graphics mode driver can be selected from the Graphics Options panel in the game, or may be run from the command line using the switch -d:Software. The following video chipsets will run the game properly in software mode: PowerVR KYRO, KYRO II Trident Blade 64",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If modded this game even though its ten years old, in my opinion its much better than the new version. I bought this one again after finding out how bad the new one was. You should mod this game for sure though, with larger regions, the NAM and CAM and whatever else you want on the great modding sites for this game.   Currently im playing on a very detailed sat. map of the US with over 500 of the largest city tiles in one single region. Just one of my city tiles from what i heard is four times bigger than a city tile on the new version and i have over 500 of them, all are connected to and interact with each other. Building the entire country with things so spread out leaves tons of open land adding to the realism that the region system in this game creates.   HANDS DOWN THE BEST CITY SIM IN THE WORLD AND THIS GAME IS OVER 10 YEARS OLD!!!!! C,MON EA??? WHAT HAPPENED?!?!  Here are some videos showing my current region :) Its much higher quality on youtube itself though          YouTube™ Video:  SimCity 4 Biggest Region Ever?&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid part of the SimCity family. Probably my favorite SimCIty after the SNES version of the original. If you're after a good city simulator and your computer can't handle City Skylines (like mine, lol), I'd say go for this.  Sim City 4 Deluxe score 8 / 10",
            "review_score": "1"
        },
        {
            "review_text": "I was playing this when I was a kid, on a Windows 98 PC Now I'm 23 years old still playing on my Windows 7 PC  Life is short, try to enjoy every second of it. ",
            "review_score": "1"
        },
        {
            "review_text": "I've spent probably thousands of hours on this game before I even had a Steam account (big Sims fan in general). It wasn't until I got it a few months ago that I actually even had a clue on how to even properly play the game. But moving along from memory lane, this game is still amazing for being as old as it is.  Having been released in 2003 and made available on Steam in 2010, this game and even the game series itself can honestly be seen as revolutionary for the city-building and simulation games that have followed since the original simcity was released. This game was almost in a way ahead of its time and in my opinion STILL outshines many other city-building games (maybe I haven't played enough but who knows) that try to recreate in their own sense the management strategy that SimCity brought upon the world of gaming. The replay value of this game is beyond compare, for something different is always awaiting you, and the mods are endless to build off what the game originally provided.  The beauty about this particular game is that it can be both a 'place anything anywhere and watch what happens' sort of game but it also can be a complex square by square city builder where you perfect every detail and the style of your houses to the taxes each individual industry and residential type pays. Many modern city builders try to play off this but say unlike City Skylines where you have to work your way up to get more land to begin with, there are countless areas and regions of all sizes for you to use and connect and even create to eventually have the ultimate city or state or nation or whatever you wish. Plus the music is pretty damn great as well. The game just allows you to almost settle down and lose yourself. SimCity 4 has to honestly be my FAVORITE city-builder out there, as it still is for many. But that's just a personal opinion. For it's current price of $19.99 and replay value that is seemingly endless, i'd say it's worth it.  11/10 would obliterate city again and restart when things start to get out of hand",
            "review_score": "1"
        },
        {
            "review_text": "I have this strange feeling when I'm not playing this game that I'm wasting my life.  And when I do play it - there are people shouting at me and demanding more money.  But it is overall a really amazing simulator, I fully recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Best city simulator out there, hands down. With the capabilities of modding, game customisation and easy to use interfaces and game functions, this game is a must need for anyone. Plus the price is definitely a bargin when on sale. I love this game, it's like owning a vintage car or something, because you can just keep working at it and it'll get better with new technology and the better you understand how the whole thing works. 10/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "A quiet country town, a polluted industrial city or a modern and technological metropolis? The choice is yours. SimCity 4 is a city building strategy game that after 10 years (!) from its release remains one of the best in its category (personally the best). Your job is to be a major with the power to decide everything, from the terrain morphology to social politics of the city, it's urbanistic development, the transport ways and public services, from budget for education and health care to the one for police, etc... Very intuitive, you must provide jobs for the three social categories of inhabitants in the game (low wealth, medium wealth and high wealth), places to live and roads of communication to reach their job. Despite you are a sort of God or dictator, some council members will help you to administer the city, warning you of critical problems regarding specific categories such as traffic, education, pollution, public services' coverage and so on...  PROS:   A very good, intuitive simulation   Active modding community    Very detailed and great building variety   Enjoyable for a vast audience due its flexibility   Fantastic graphic and low requirements   Good sound and effects   CONS:  You can't play without mods   Sometimes could be frustrating    Occasional crashes and rendering problems on modern machines   VERY ADDICTIVE  Conclusion:  you will hate EA for the sequel of this fantastic game  :D  ",
            "review_score": "1"
        },
        {
            "review_text": "A decent game. Lots of tools, lots of scenarios to create and improve (and even destroy:D) your own city - from village to megalopolis.",
            "review_score": "1"
        },
        {
            "review_text": "i built a metropolis just to see it destroyed by nuclear explosions",
            "review_score": "1"
        },
        {
            "review_text": "Great game and still the best citybuilder there is!   Though you might need to do some trouble shooting with newer OS's than Win7 like I had to do with 8.1 issues weren't anything too serious. Just had to force right aspect ratio and few things I can't remember anymore so it couldn't have been anything serious. I've had no crashes or other issues with this.  Definitive 8/10 experience at the price even with bit of fiddling to get everything running properly.",
            "review_score": "1"
        },
        {
            "review_text": "In SimCity 4, you are the mayor of a city. You build streets and roads, zone zones for people to build houses, corporations to build offices and services and industries to build factories on and you build public services like police and healthcare and parks and publictransportation. The game is really really good in itself, but what really makes it so good that I'd call it my favorite game of all times is the wide range of mods the community made over the years, and I'd certainly call it the greatest citybuilder still.",
            "review_score": "1"
        },
        {
            "review_text": "I am mayor with best rating approval.  But my debt was over a million!!!  10/10 would greece again!!",
            "review_score": "1"
        },
        {
            "review_text": "If you wanted to play a good Maxis game, you've come to the right place mods make this game 100x better than it was. Trust me if you like modding, simulation, and good Maxis you've come to the right place.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best SimCities ever made. A good choice if you want a CityBuilding Simulation and your PC is not the latest one. Pretty cheap too.",
            "review_score": "1"
        },
        {
            "review_text": "i was having a normal city with my sims living a normal life then for no reason i ♥♥♥♥ed it up 11/10",
            "review_score": "1"
        },
        {
            "review_text": "The best city building game in existance. Bold statement? Yes. Has it ever been beaten by competitors or even sequels?  Nope.  This is the hands down most perfect city simulation game on the market. It's definately aged and it shows but the gameplay is unbeatable.  Best part is that this is everything the new SimCity tried to be without all the strict DRM requiring an internet connection to play a singleplayer game.  96/100",
            "review_score": "1"
        },
        {
            "review_text": "How does one go about writing a review for something like this? To some it feels like DLC for Simcity 3000, for others it's an amazing stand-alone title. So what about me, where do I stand? I reside in the latter category beliveing this is an amazing game on its own. But how amazing? Ladies, gentlemen, and others, my name is Mlobitz and welcome to this review. Today, Simcity 4. Let's jam! And yes I did just quote Arkada, DEAL WITH IT.   When I was still 11 and browsing the Steam Summer Sale of 2013 (roughly a year ago) and a game caught my attention. You see, at the time I was obsessed with what I called them 'Retro Games' and all the history they might hold. One of my favorite games from the NES/SNES era was Simcity. Rather simple but very rewarding and interesting, the original Simcity melted away countless hours of 5th Grade (when I was still 10). So when I saw Simcity 4 on Steam for $5.99 I hade to check it out.    Starting out, I had a hard time figuring out what to do, this is no simple game to learn. The in-game tutorials aren't very helpful except for teaching you the bare-basics of the game. I had to watch a large amount of YouTube videos to be remotely successful. Math is also required to make effective grids whether you use unit distace or cost to measure length of roads or avenues. To even get skyscapers in your city and make it look like a city, you need extensive knowledge and mastery of the game's concepts. One example of this was when my technology teacher let us play Simcity 4 on her computers every once in a while (she's an awesome teacher by the way), most of the students ended up skipping the tutorial and spamming disasters on barren terrain. One of my friends who played through the tutorials couldn't sustain a good income and generally didn't know what he was doing. Accessibility gets a below average 4.2 out of 10.   On to the good bits! When I finally got things up and running the game became challenging yet addicting and rewarding, I also felt proud when my city was filled with plenty of houses, shops and factories. The GUI can be hard to learn but once you get used to it it's efficient contains everyhting it needs to and more! It's cool when your perfectly laid-out grid is functioning perfectly while also being pretty.The journey to getting your city to this state is highly enjoyable and satisfying. One of the biggest things that makes this game so much fun to play is region gameplay. This lets you connect your cities and let them share resources such as power and water. This allows certain cities to provide certain things while being kept alive by other cities while keeping them alive. Maybe a city based around power getting water from a city based around water. Being as great as it is, gameplay gets a very good 8.6 out of 10.   In terms of visuals there's not much to cover, for a 2D game in 2003 it's pretty standard fare. Although some 3D models like cars planes, and helicopters are a nice addition. zooming in reveals a lot of little details maxis has included like a giant spinning pizza at the pizza restaurant and clotheslines in houses' backyards. skyscrapers have and other large builings have little details like a pool near the top floor. Visuals gets a strong 7.8 out of 10.   As for the music, I'm gonna come right out and say it, this my favorite video game soundtrack of all time. The music not only fits the game fantastically any track is amazing music to listen to while doing something like schoolwork or.... other schoolwork! Yeah.... Check out the whole soundtrack on YouTube, you owe it to yourself to do so. This soundtrack a masterpiece, so it gets a well deserved 10 out of 10.   After finding the mean of all my scores, SImcity 4 recieves a respectable 7.65 out of 10.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best soundtracks of any game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would cause riots again",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the whole series for now. Not perfect in many thing, but almost everythnig can be fixed with mods, especially Network Addon one.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. The Graphics are very detailed and realistic. You can build more than one city on the same map. Not to mention importing your own Sims from 'The Sims' into the game. Your city just doesn't sleep like that of SimCity 3000. You see your people walking about and running their daily lives, like walking their dogs, Driving to the supermarket, Driving their kids to school even going to church! The biggest improvement that I saw in SimCity 4 were the disasters. In SimCity 3000 you had like what? 4? In SimCity 4 you get over eight disasters. The best part is that you can control and decide where your Tornado goes. You also get Volcanoes that erupt, Erathquakes that bury houses and split open the earth, Meteor showers that leave everlasting craters and Lightning Bolts, Fires, Riots, Floods, Mudslides, Bank Robberies and even Car chases. You get to choose you terrian styles. You can ahve an African style with Rhino's and Giraffes. Sometimes they can even stampede into your city. The other great thing about SimCity 4 is the terrian tools. You can sculpt gorgeous, Lagoons, Cliffs, Craters, Valleys and even place galiciers. Then you have the time settings. A 1900's Chicago style, A 1950'S New York Style, And a 2000s Houston Style. Then there is the animations of the construction of buildings. When you build your buildings they just don't appear out of no where tou actually see your sims get into their work trucks and start to construct the building. And if the building is of no use anmore it decays and doesn't turn into a huge big purple borded up mess. Then if you want to destroy or knock down a building it just doesn't disappear, you can actually impload or expload your buildings from any side you wish. There are no old buildings from SimCity 3000, The're totally new realistic looking buildings in SimCity 4. To me all this extra stuff makes this game totally anew. You won't get board if you like Simulation games.",
            "review_score": "1"
        },
        {
            "review_text": "Relased in 2003, still better than simcity 5..",
            "review_score": "1"
        },
        {
            "review_text": "The best City Building game ever, nothing comes close. 10 years since launch and it still feels as fresh as when I first tried it back when I was a kid. Every year I go back a few hours to it, and with all the mods around, you're guaranteed to have a different experience every time.   10/10 would sacrifice my population to a Robot Attack again.",
            "review_score": "1"
        },
        {
            "review_text": "install the NAM mod so that you have better capacity and desire for the sims to use public transit, then it's all good,",
            "review_score": "1"
        },
        {
            "review_text": "You spend a lot of this game micromanaging your funding of various civic and municipal buildings. My favorite of the series is still 3000, for a bit more simplistic game, and amazing jazzy music.  This game gives you a ton of options. There's almost too much to do, and a lot to forget to do until you get complaints about it.  Very satisfying when it goes smoothly, and frustrating when you forget something, or miss something. Also, don't forget to check out the Plugin Pack if you are playing the Deluxe Edition that includes the Rush Hour expansion pack. You'll have to google for it. It's a helpful third party mod.",
            "review_score": "1"
        },
        {
            "review_text": "Personally i enjoy this game. It came out in 2003 but it is still one of the best city building simulators out there. i used to own the disc. unlike sim city 2013 you have full control over the region, you can do what you want to the terrain and everything. theres lots of things you can do in this game such as Build Giant beutiful cities , if you want to build a massive transit system that goes from one end of the region to the other end you can do that. if you want to just build a small town you can do that. if you want make your city get destroyed by a giant dinosaur make out of cars you can do that.",
            "review_score": "1"
        },
        {
            "review_text": "Sim City 4 is a amazing game and I'd recommend it to anyone who wants to play high quality city building simulations. Even tough Sim City 4 doesn't look that good, it is way better than newer games like Sim City 5. You have a lot of space to build, you can connect your cities which will influence a lot and you can discover many funny details.  Now at first I couldn't play the game for a long time because of graphic bugs but then I found a solution:  Settings -&gt; graphics settings -&gt; select software -&gt; restart  Be aware that as soon as you select software you can't open the Steam Overlay",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "To begin with this includes ALL of the DLC packs for Simcity 4 - No need to spend much more!  Simcity is a city building game (Duh!) Made by EA and Maxis in 2003. The Graphics are good for a game this old - In some places they look outdated (when you zoom in too far)  The resolution scale for this game is Amazing since it was made in 2003 (I can reach the native resolution of my Screen (1280 x 800))   Overall Get This Game! ",
            "review_score": "1"
        },
        {
            "review_text": "Challenging and tons of fun. If you like city building, this game offers all sorts of options- from rural communities to vast metropoli. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game.",
            "review_score": "1"
        },
        {
            "review_text": "You would not believe the hours I put into this timeless classic, I must of spent thousands of hours on this when I was young. SimCity 4 and Age of Mythology where the two games that got me into gaiming. I ♥♥♥♥♥♥ LOVE this game!. The graphics are dated but what do you excpect from a game made in 2003. The game has endless replay-ability. From constructing mega cities to making small towns piled beneath 120 tons worth of nappies and crisp packets, this game is the best simcity out there. In my opinion.  The game has the ability to do contract work like flying a helicopter to writing swear words in the sky or chasing down a bank robber in a police car like robocop. I can't even begin to try to comprehend how they coded this as it baffles my mind. This game brings me back to the days where people waitied for games to come out and didn't just demand a broken game.  All the time when I played this game I had no idea the amount of mods that are out there. The modding community is one of the most active modding community I have seen since a Bethesda game. Theres no need for city limit extensions either the game comes with a massive border even for litte plots. What I always do is make cities into parts like East and West and they look awesome from the region view. You can edit the land, have military bases next to rocket launches and, and, and... I could go on about this game for days on end it looks like I already have. So just buy it nomatter what price. £9.99 is still too little for this timeless classic.  ∞/10 Would put down 10 Tokyoo Towers again.",
            "review_score": "1"
        },
        {
            "review_text": "Had this game a long time ago, when I was in middle school. I could never really get the hang of it; lots of numbers and graphs and the like. I recently re-downloaded it. Not only was it a great flashback, it's been really rewarding. The interface is simple but the game is challenging. I highly recommend playing with a cheatcode for adding money; I tend to flounder without it, and it's plenty challenging even with it.  My only complaint: you cannot be good at this game if you play like a libertarian.",
            "review_score": "1"
        },
        {
            "review_text": "Who would have thought not going into debt would be so addictive !",
            "review_score": "1"
        },
        {
            "review_text": "I'm more of a fan of SimCity 2000 (I got fired so many times in that one!), but SimCity 4 is a great game in its own right, and it's still more in-depth, vast, and varied than the 2013 series reboot.",
            "review_score": "1"
        },
        {
            "review_text": "Because there's nothing better in city simulation genre.",
            "review_score": "1"
        },
        {
            "review_text": "1. Got into the game and quickly learnt how to play, tutorial very good.  2.Build a huge city and then had to go off  3. Instead of saving the game, I sent a UFO to attack it, a earthquake, a volcano, fire, a transformer thing..  10/10 would destroy again",
            "review_score": "1"
        },
        {
            "review_text": "The last good Sim City. :sigh: Damn you, EA!",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  How to make Sim City 4 compatible with Any Computer&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "MBHIS GABE IS FUNB :DDDDDDD U CAN DO A SUM THIG ADN ASLO ODER :D :DDD :DDD MAGE A SIDI NAME 'NSIBIDI SNIB SNAB' xD",
            "review_score": "1"
        },
        {
            "review_text": "best simcity game ever made",
            "review_score": "1"
        },
        {
            "review_text": "It crashes sometimes because its older and I lose a lot of progress but I end up rebooting it again soon after anyway, because I want to be the best mayor. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It's Sim City, on Steam. Forget the woes of the recent re-launch - Sim City 4 is just about all you need. While not as visually flashy as modern city-builders, it's got the most features and some would say the most fun. It can generally be purchased incredibly cheaply during Steam sales, definitely worth a buy to relive the Sim City nostalgia of old, or for totally new players.",
            "review_score": "1"
        },
        {
            "review_text": "Well i cannot forgive EA games for what it have done but i would this time because it created the first best nice game i've ever seen,F--k Grahpics this game is special to me and it is better then anything else,i would never leave this game   9.9/10 This game is nice,great,awesome but it has small bugs that should be fixed",
            "review_score": "1"
        },
        {
            "review_text": "Sim City is the all-time greatest version of the Sim City franchise, that holds up well in 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Best city simulator game I have encountered so far.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  How to make Sim City 4 compatible with Any Computer&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Game of my childhood. One of the best Sim City game, gameplay in on top, mods support is beautiful, community is live, every week you can get fresh mod with lots of new features.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend this game as it works just as it should and is a great sequel to the continuing Simcity series. The game is old but it still works fine on new computers &amp; doesnt have problems during playing up to now. Mods can be used with this Simcity game too which is still popular on the internet today.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun to play. Very addictive! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A all-time classic in my world and ten years later, still utterly playable. Recommended to all those with cravings to literally make a perfect world for us all to live. It's odd though, no matter what I 'tweak' this game runs choppy and seems only fit for CPU's under 2 cores and older school graphic cards (Nvidia 7 series and older), but still works OK-ish.  Somehow for me, it works better in software mode (which means my Gfx card isn't used at all) but doesn't look 100%, but a lot more playable. I guess a single core on my 8 core system works better than a my Gfx cards GPU's and cores.  Why have suddenly started playing this again? SimCity, the (2012) new release has officially been annouced by Maxis and EA... finally after ten years, it's getting it much deserve update. A game I truly and officially want, now... as well as GTA:5, HL:3 and L4D3 []^_^]",
            "review_score": "1"
        },
        {
            "review_text": "Great game for trying to make a real looking and functioning city or just to make a city to blow it up.",
            "review_score": "1"
        },
        {
            "review_text": "Best City Simulation game... period. Add some street mods, some more buildings and perfect.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute classic city building game never gets old!",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever. Mess with people's lives, make a HUGE city, do what you want,build it how you want it. Not much else I can say other then GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "SimCity 4 is a decent enough SimCity for the current Generation.  I say 'Decent' because It's really hard to recommend a god game that tends to Crash as often as SimCity 4 does, and it doesn't help that the Sims in the game can't seem to drive well. Then again, SimCity 4 doesn't require an Internet Connection to actually play the game or a separate Origin account (Elecronic Arts, be damned!), so I'll still say it's better than it's successor.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe next time you should think before getting windows 8 and expecting it to run a 10+ year old game. Seriously though this is a great game, a classic if you will. Pretty sure they have it on iPad's now as well so yeah... Go play it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you havent played a SimCity game by now you probably never will. I do enjoy them. They are games that aren't just for people who play video games. Its interesting to watch your city, you designed, grow. The only difference in the sequels is mainly the details. You get more land and has more detailed graphics. This one lets you connect citys on a much larger map. I think it even lets you connect to other peoples cities. I like these games but i dont think this is worth more than 10 bucks. I never pay much for my games.",
            "review_score": "1"
        },
        {
            "review_text": "Great classic game has a good feel takes a little learning to get the hang of it though But again overall fun and a god time if you need to just burn some time Must have!",
            "review_score": "1"
        },
        {
            "review_text": "SimCity will steal your life.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game, must be patient to play it and maybe not have OCD.",
            "review_score": "1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games of all time. still being played years after the origianl release. with a plethora of plug ins, it is the only sim city game available. feel free to try sim town (the latest incarnation) or cities xl (a close copy) but nothing comes close to this game",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly great! Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "This is still the best city simulator out there. 10 years in, no one took the necessary risk to top this game. Modding is hell, but once you get this running, so many hours will be lost creating your perfect region.",
            "review_score": "1"
        },
        {
            "review_text": "Crashes alot, graphics go wonky. Not good.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Will Always be one of my Favorites!",
            "review_score": "1"
        },
        {
            "review_text": "The best Sim City game there is, hands down. If you were dissapointed with the 'new' 'Simcity' (which... isnt hard), get this. You wont be dissapointed ever again. Awesome city sim.",
            "review_score": "1"
        },
        {
            "review_text": "Still excellent game after some many years! Cities Skylines is fine but Simcity is somehow little bit better. I recommend this game to all city builder fans. Newer Simcity I don't recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Painstakingly build a metropolis, then demolish it with GODZILLA!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed playing this game. But I found it insulting that no matter how big I built my city, dangerous minorities never came in to destroy it. It gave you the power to cause earthquakes and other natural disasters. You could even unleash a giant robot to destroy your city.. But not one single act of gang violence throughout the entire game. Get your act together EA. If I take the time to build an enormous city.. I want to be rewarded with realism. We want crips and bloods.",
            "review_score": "1"
        },
        {
            "review_text": "       SimCity 4 Deluxe&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I REALLY love this game! 2 thumbs up EA!",
            "review_score": "1"
        },
        {
            "review_text": "No Road Connections Simulator 2004",
            "review_score": "1"
        },
        {
            "review_text": "This games awful, i'd rather ride up a valcanoe on a post office bike.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest and most realistic city building game ever, Do NOT buy CitiesXL buy this instead because this game is simply ingenius.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it, played it for less then 30seconds, its so dated and old. Try Virtual City on ipad for £2.99 if you like sims.",
            "review_score": "1"
        },
        {
            "review_text": "11,000,000/69  Best city sim since Simcity 4 Deluxe Edition.  420/1 Wouldn't buy DLC again.",
            "review_score": "1"
        },
        {
            "review_text": "Everything people love about SimCity is in this game. And after 10 years SimCity 4 is still so much better then SimCity 2013.",
            "review_score": "1"
        },
        {
            "review_text": "I quite like this game, much better than the current installment. The game is fun to play and will have you enthralled for hours watching your citys grow. I have sure watched my custom little sims run about and live out there lives, I feel bad now since I destroyed my city by meteorite.",
            "review_score": "1"
        },
        {
            "review_text": "I have no words for how much I love this game. It was released over a decade ago and still have magnificent replay value. The complexity and degree of control you have over your city is phenomenal, and the only drawback of the game--the flawed transit system--has been prodigiously fixed by the developers of the Network Add-on Mod.  This, to me, is the ultimate SimCity game.",
            "review_score": "1"
        },
        {
            "review_text": "polluted the universe 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The best Sim City to date. Tons of modding options, big maps and the old school Sim cCty feeling. The 2013 version is not even close to this one.",
            "review_score": "1"
        },
        {
            "review_text": "Way better than SimCity 2013, and only made much better with mods!",
            "review_score": "1"
        },
        {
            "review_text": "Still so much fun building a thriving city, ♥♥♥♥♥♥ its economy, then sending aliens and robots to murder everything",
            "review_score": "1"
        },
        {
            "review_text": "SimCity 4 had a lot of great things going for it at the time. It still has that spark from the 2000's, but you can't help but ask yourself 8 hours in, 'What's the point?'. In the end, there is almost no point to any video game, but the point to SimCity is still kind of sharp.   I value it at 14.99$",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Its a game I've spent hundreds of hours on. You'll want to make sure you download a few mods, like the Network Addon Mod.   I had alot of fun with this game by using a rough multiplayer setup with a friend using a dropbox account.  There is no official support through this game. You'll have to get help from the community.  I really wish I could buy a Simcity 4.5 that would fix some of the lame issues the game has struggled with since its beginning. But ten years later and no sequel probably means this is the end for this city simulator. Enjoy it while you can.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games, better than the new SIM CITY, if you have a multiple CPU you need to disable infinity on the CPU's or else the game crashes on x64 systems..",
            "review_score": "1"
        },
        {
            "review_text": "SimCity 2000 was the gold standard for a long time, but I feel like SimCity 4 edges it out now. The controls unfortunately feel very dated and awkward to me now, which is a shame. But the game itself is as fun as I remember it. I probably put 50+ hours into this over the years, although almost all of that was before I had it on steam.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the new one. I LOVE IT OMG",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I have ever played. I started playing this when it was called SimCity. The question is how old am I? I still play the game today. :)",
            "review_score": "1"
        },
        {
            "review_text": "i Love this game!! really beautiful",
            "review_score": "1"
        },
        {
            "review_text": "This game is easily the best city building game I have ever played. By itself, it is a city builders paradise, with monuments, houses, and towers to spare. But with mods, it can turn into a gold mine. I cannot stress enough how awesome this game's modding community is. If anyone is thinking of picking up this game, I HIGHLY recommend getting some mods- the NAM transportation mod is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Great building simulation game. Played it before and it is a fabulous game. It's addicting. I love building my own city. You have all the tools you need to change the terrain or leave it flat, like me, and build a city your name. It's fun. I just hope there was infinite money or free mode so I can build without worrying about taxes, etc. Don't get me wrong, it's cool to manage the city but I want to play it my way too. :D   Awesome game, get it! 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game may seem childish or old, but SimCity is an excellent time-waster that flips a few switches in the old noggin. Everything is connected to everything else somehow, and once you get a few cities going, it's basically a sandbox. This is the best citybuilder in the modern era- definitely better than Societies.",
            "review_score": "1"
        },
        {
            "review_text": "this game has a perfect simulation of a working city",
            "review_score": "1"
        },
        {
            "review_text": "Favorite game out of the series, played it all night and day. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The last GREAT Sim City.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game compared to SimCity 5. Get it and enjoy SimCity the way it was meant to be played.",
            "review_score": "1"
        },
        {
            "review_text": "I checked out a lot of forums saying this is one of the best god-games/ city builders out there and I had played a different SimCity years ago and had a lot of fun. IMO this game wouldn't make my top 10. I got this game for 5$ so in that regard, yes I recommend rolling the dice.",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the best simulation / building game available. It is rich with detail, decent graphics even for today, and provides a wonderful sandbox environment. The cities are quite large, unlike Sim City 5 - and the incredible amount of options and detail will keep you entertained for hours. Definitely worth the investment.",
            "review_score": "1"
        },
        {
            "review_text": "SimCity 4 is a fun game. If you played simcity2000 this is the perfect successor to that game. Pipes are simplified, water is easy and plentiful. Power is generally easy to manage as are most the cities systems. I didn't HAVE to cheat to win this game or even to play it the way I wanted to. The cities seem to adapt better no matter how poorly you place zones.  I love this game.  However.... Numerous crash issues, memory leak issues, Huge cities seem to bog down the game in ways you wouldn't expect. (water being there then not there then there in pipes, leading to rallies about not having water then they do) My pc is far an away powerful enough to run this game, a beast machine when this game was made new. Still this game does not always work. I would say this game is worth playing, toying around with despite it's many bad programming faults. Just be aware and save often.",
            "review_score": "1"
        },
        {
            "review_text": "Sim City 4=Brilliant. Brilliant+Rush Hour= The God of all city builders This is the big daddy for all the games in that genre, this is the game they strive to be. It's getting a little old now but the gameplay is amazing. even when you get bored of that you have the rush hour DLC to fall back on and you can drive your cars around completeing missions in the city you built until something interesting happens that you can dive back into.  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "An all time classin in the city building game scene, a must get on a steam sale!",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best City builder of all time...until the Simcity reboot is released anyway.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, and I have played it when I was a 12 year-old. The interface is great, the content is good, and the customization is outstanding. The graphics aren't the best (of course because it came out in 2004), but that is about it. My biggest complaint is the constant crashing of the game, I have lost a few good hours of building to that.",
            "review_score": "1"
        },
        {
            "review_text": "Its hard even on easy but still fun",
            "review_score": "1"
        },
        {
            "review_text": "Works Great. Still one of the best city building games out there in my opinion. $20 seems a bit steep for a game this old but if you don't have it yet grab it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, one of the best city builder.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game... Frustratingly addictive but doesn't run well",
            "review_score": "1"
        },
        {
            "review_text": "I do like this game I think it is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Only real negative about the game is that it gets kinda 'grindy' if you want to make a good city. Otherwise, it's great.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the most relaxing and addictive games of all time. Always been a Sims fan and never really been let down by a single game yet.",
            "review_score": "1"
        },
        {
            "review_text": "TAX, TOLL AND CUT COSTS. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "I've always enjoyed Simuluation games like this, just don't know why. Is it the thrill of creation? Is it the thrill of achieving greatness or even status? Will never know. What I do know is that I highly recommend this game for anyone that's got the same passion about building worlds or cities. SimCity 4 brings all the elements from previous SimCities (notably SimCity 3000) and makes an improvement to this alreayd jam packed simulator.  New graphics and a far more efficent 'sim' engine behind this game, makes everything just that little more rewarding once you've broken even with your funding. Even today, I still keep coming back to this one game, simply because seeing that little village expand towards a bustling metropolis is just so much darn fun...  4 / 5",
            "review_score": "1"
        },
        {
            "review_text": "This is the definitive SimCity game! If you do not know, in SimCity 4, you build a city, while trying your best to not go into debt and lose! But this game is so much better than SimCity 2013! Because, no online DRM, this is cheaper than SC2013, and it is very moddable! Get this - not SC2013!",
            "review_score": "1"
        },
        {
            "review_text": "Built a city, it looked amazing, and it was all cool.   Then I ran out of money,   10/10",
            "review_score": "1"
        },
        {
            "review_text": "A timeless game from Maxis's prime. Infinitely better than EA's newest Sim City. ",
            "review_score": "1"
        },
        {
            "review_text": "Fun, immersive game. Takes me back to when I spent hours playing the original Sim City. It's still the same fun game at the core, with increased playability and more challenges.",
            "review_score": "1"
        },
        {
            "review_text": "the classic game is always worth playing and enjoyed! highly recommend",
            "review_score": "1"
        },
        {
            "review_text": "Still going strong 10 years after release thanks to a dedicated community. Not as casual as SimCity'13, but much more rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "i recommend not playing this game. Once u install boot up and start playing the game it self activates a time evaporator its wierd dont play!",
            "review_score": "1"
        },
        {
            "review_text": "Nice sim. Not as easy as it seems. :)",
            "review_score": "1"
        },
        {
            "review_text": "Great building simulation game. Played it before and it is a fabulous game. It's addicting. I love building my own city. You have all the tools you need to change the terrain or leave it flat, like me, and build a city your name. It's fun. I just hope there was infinite money or free mode so I can build without worrying about taxes, etc. Don't get me wrong, it's cool to manage the city but I want to play it my way too. :D   Awesome game, get it! 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "It's a classic",
            "review_score": "1"
        },
        {
            "review_text": "I'm really the only person I know plays this game, but it is awsome.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible (though it still lacks much of the vision of simcity 3000 in my opinion), Folks should definitly give this old classic a playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "11 years old but still by far the best sim city till this very day So good I actually bought it again on Steam cause I lost my disk after moving house.",
            "review_score": "1"
        },
        {
            "review_text": "As Mayor, the Ultimate Being who can command Legions of hostile robots and bring meteor's down from the sky like hailstones, why can I not set fire to that infuriating Utility Advisor every time he interrupts to tell me that there's not enough water to go around?",
            "review_score": "1"
        },
        {
            "review_text": "just cause it is 10 years old, it is still a more in depth simulator than many others.",
            "review_score": "1"
        },
        {
            "review_text": "Spent more than 100 sleepless hours literally builing 'a city that never sleep'! Fantastic simulator game to explore your creativity.",
            "review_score": "1"
        },
        {
            "review_text": "Margaret Thatcher Simulator",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game to kill time with. I've been having fun building various cities and small towns.",
            "review_score": "1"
        },
        {
            "review_text": "If you can bulid a city them destroy it with godzilla then what more do you want!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Simcity 4 is one of the best city-building simulators out there. However, it has a pretty steep learning curve and building a successful city will be a challenge. Compared to todays standards, it is a little bit lacking in the customization side, but otherwise it is a really solid experience.",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't have DLC or Origin. 10/10 Would buy for my friends.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty fun, but the tutorial is lengthly and boring. Such from that some of the aspects of the game is hard to understand besides the base idea of; get money, build a city and just play around a little to understand it more. I haven't played the game that much recently, but when I did, I remember it being pretty enjoyable. Though a few additions I would like to see isn't included, but nothing to big. Overall I would say I give it a 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Always been one of my favorite games since it's first release. Also wish they would make a SimEarth again! Pretty please!  For those who are disappointed with the graphics try this guide before deleting the game!         Widescreen &amp; High Res&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game compared to SimCity 5. Get it and enjoy SimCity the way it was meant to be played.",
            "review_score": "1"
        },
        {
            "review_text": "this game rokes",
            "review_score": "1"
        },
        {
            "review_text": "This has no place on steam, But GOD is it good",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Build then destroy",
            "review_score": "1"
        },
        {
            "review_text": "Over a decade old game and still beats all the modern counterparts hands down. Played this with cds a lot and Steam version made installing and playing much easier. I would recommend to check some of the more important mods the community has to offer.  At least NAM is a must for me. (I just love to design realistic traffic)",
            "review_score": "1"
        },
        {
            "review_text": "Although I love the game, the Mac version of this does not seem to contain the latest Maxis-released updates to the Rush Hour expansion. This version still has various bugs. Although, it's wonderful to have a game at all, and one that doesn't rely on the Mac App Store's restrictions.   Please update the game to the latest version and allow for the NAM!",
            "review_score": "1"
        },
        {
            "review_text": "Best city Simulator on the market!",
            "review_score": "1"
        },
        {
            "review_text": "Big disappointment and lacking in depth. Get Cities: Skyline instead. You will really enjoy that.",
            "review_score": "1"
        },
        {
            "review_text": "The epitome of all simulation games, even a decade later and plenty of attempts to match it (Cities XL, Simcity 2013), it still remains king. I've regularly played this game since it first came out. That's how good it is.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game to spend some time - BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "Just what the doctor ordered. I was very bored for about three or four days before I broke down and decided to buy a new game. Having played Sim City 2000 before, I found this game to be very easy to play and even excel at. You can build a city in almost no time.",
            "review_score": "1"
        },
        {
            "review_text": "It's definitely one of the greats. I did not plan to get the steam version till I lost my physical copy. The game holds up quite well after all these years. It's still one of the best city management sims out today.",
            "review_score": "1"
        },
        {
            "review_text": "Built a giant city. Messed up roads. Stops every three feet.   10/10 Would mess up roads again",
            "review_score": "1"
        },
        {
            "review_text": "Very nostalgic! I remember playing Sim City 2000 back in the day and how much fun it was. This is no different. I was a bit rusty when I started out and went bankrupt several times designing a couple of cities but after awhile things changed (hit a pop of 1M). The game is a complete time killer as you manage and grow your city from austere farmlands to sprawling megacities. The game has some bugs, I have had the game crash once before. All in all a great game. (B)",
            "review_score": "1"
        },
        {
            "review_text": "One does not simply cause a car crash on the highway",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best City builder of all time...until the Simcity reboot is released anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Build a nuclear waste plant in the middle of your town and drive nuclear waste trucks around town spilling ♥♥♥♥. nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Spend hundreds upon hundreds of hours making the perfect city. Then destroy it with UFO's, tornado's, floods and volcanos.",
            "review_score": "1"
        },
        {
            "review_text": "Despite this game being around over a decade ago, it is still probably the best city-building game I have played. This game plays well and allows for the user to make whatever city they dream of.   The plain game already offers many hours of gameplay, but the game's capabilities can also be expanded through various mods that are already out on the internet.   10/10 would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Still as good as I remembered from when I was a child!",
            "review_score": "1"
        },
        {
            "review_text": "Although by no means perfect, Simcity 4 is probably the best (read: most detailed) city building game ever made. It simply has all of the things that would make any particular city builder great all in one place. A  massive  area for each city, tools for laying out your city that can be either very quick and easy to use or super detailed, numerous ways to tackle different problems, interesting rewards for progress, ♥♥♥♥, this games  graphs  are great. The graphics and soundtrack show their age but are still great, and the absurd level of detail in every conceivable place is the icing on top. Almost everything about this game is a model example of fantastic game design. Still, if poor preformace is a deal breaker for you then you may want to take a pass; the game doesn't run terribly well on modern machines, especially with as large of cites as are possible.",
            "review_score": "1"
        },
        {
            "review_text": "Great game once you download NAM",
            "review_score": "1"
        },
        {
            "review_text": "My personal favourite city building game, as I played it quite a few years ago. Simple, fast, lightweight, a very good city building game, even though it is a bit old.",
            "review_score": "1"
        },
        {
            "review_text": "It's not as easy as throwing some buildings together and calling yourself Mayor. Monitoring crime, pollution, traffic, tax, health &amp; safety, land value, and public opinion are probably just the basics of this game. You'd better be ready to budget and react to changes if you want to have a chance to build your dream metropolis.  Welcome to the middle-of-nowhere, cowboy. Make something of it...",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, a definitive improvement over Simcity 3000, only issue I have is that I can't make bridges over water to other cities. I want my toxic sludge to spread everywhere damn it!",
            "review_score": "1"
        },
        {
            "review_text": "SimCity 4 is a city-building/urban planning simulation computer game developed by Maxis, a subsidiary of Electronic Arts. It was released on January 14, 2003. It is the fourth major installment in the SimCity series and I have to say its quite fun! Though graphics aren't the best and it needs to be slightly tweeked you can find yourselve having a blast in this 2003 city simulator game! 8/10! Give it a try",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lovely play, I clocked in a good amount of time and its a game you can easily find yourself addicted to. It ages well despite it's appearance and it's definitely something I would recommend if you're into City building type games.  The only issue is, I've come across quite a catastrophic problem, I don't know if it's because my drivers recently updated or something else but one day the game just completely stopped opening up, the game would show up in the processes but then immediately vanish as if it were closed out. That was an extreme disappointment to me considering how much I played this game.   I've looked into this issue and I can't find anything that could've caused this to suddenly happen. I won't say that this is an assured issue because very few people have ever had this problem, I feel like it may be an issue with carrying over to a more modern PC considering I run Windows 10 and the recommended OS is Windows XP.   Trust me that it is definitely a good buy ESPECIALLY on sale, like seriously nab that ♥♥♥♥. But be aware that you might run into some issues with such an old game on a modern PC just as a warning, besides that play away!",
            "review_score": "1"
        },
        {
            "review_text": "Lvoe it, but seems to crash on Windows 10. Not sure if this is normal but save often.",
            "review_score": "1"
        },
        {
            "review_text": "A great development of simcity original and 2000, nice graphics considering the game is now 13 years old. The quality gameplay is still there to suck you in for a few hours of engaging play.",
            "review_score": "1"
        },
        {
            "review_text": "The best city-managing simulation game that EA has ever created.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for the 'Test of Time' Steam Award...13 Years later and this is still one of my go to games when I want to just zone out and build citites 10/10 would destory the city with a volcano again!",
            "review_score": "1"
        },
        {
            "review_text": "Best city-simulator  Ever",
            "review_score": "1"
        },
        {
            "review_text": "Do you sometimes think about playing games from an era when Ea games was good?  Play this",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved this game as a kid. It was a great way to waste time; my grandma and I would play this for hours! But, for some reason playing through Steam is SUPER glitchy. You click on a mission notification, and you can't even read the mission. You can only look at the map at certain angles, or else a huge triagle of glitchy colors and textures cuts through a quarter of your view. The game itself isn't the problem, so if you know and love this game and can look past the issues, then be my guest.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks dogg nuts. The weed has been smoked in the bong for lost gay ♥♥♥ saves.",
            "review_score": "-1"
        },
        {
            "review_text": "My Game crashed!",
            "review_score": "-1"
        },
        {
            "review_text": "The game is really cool until you run out of space. This happens really quickly because they give you a small area to start and don't let you expand. The game wants you to build multiple interactive cities, but I'd much rather build a large city that has everything.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought SimCity 4 because I played so many hours of the original SimCity when I was younger and have so many positive memories of that experience. I guess nostalgia got the better of me because I'm just not into city building anymore. How my tastes have changed over time...",
            "review_score": "-1"
        },
        {
            "review_text": "So far I don't recommend because the window is too small. I use windows 10. Does anybody have a solution for this?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is worth about 4 bucks. Get anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "This games barely works. I'm running this on a fairly modern PC with decent specs and the game lags and crashes.  For all you city building needs, City Skylines is the game for you!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not what I thought it would be. It is absolutely impossible to do anything unless you have a Masters Degree in Management (which I do not). People will say 'Oh your just not doing it right' but contrary to their belief I am doing it correctly according to waht every guide ever written for this game has said. So if you have a Masters in Management go ahead buy this game and waste $20 you could spend elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not what I thought it would be. It is absolutely impossible to do anything unless you have a Masters Degree in Management (which I do not). People will say 'Oh your just not doing it right' but contrary to their belief I am doing it correctly according to waht every guide ever written for this game has said. So if you have a Masters in Management go ahead buy this game and waste $20 you could spend elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "I play this on a laptop with Windows 7, 64bit and can run games like Assassins Creed Black Flag, Battlefied series but this game gives me graphic glitches, please fix, I usually can't even see what I've built",
            "review_score": "-1"
        },
        {
            "review_text": "Why do I feel like this game slaps me silly for trying to build a city the way I want rather than their railroaded formula? What fun is it playing the same exact city over and over again? I want there to be a police station right off the bat... nope costs too much.... and the game literally tells you NOT to build a fire station until you have your first fire. By that logic, it makes sense build and raze them after each emergency.  The driving mini game is horrible. Cars vanish and appear while your driving making cars you were going to crash into vanish while the opening you did have is now magically occupied.  I have tried playing this game. I have forced myself to play it telling myself it'd get better but it hasn't. Honestly if I was offered my money back for it. I'd take it. The only reason why I bought this game was because I loved SimCity2000 as a child (which is no longer compatible with windows no matter how hard I try). I hoped to reclaim the joy of my childhood. Instead I listen to a bunch of sims all screaming about how badly I'm doing OR I finally get the balence right and make a meager $200.00 a month.",
            "review_score": "-1"
        },
        {
            "review_text": "My experience:- Glitchy and poor graphics. However, if these two issues didn't occur- it would be a decent game to pass the time. It can be fun when you're into building your own city.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it on sale: Crashes constantly. Downloaded torrent: No issues whatsoever.  Lesson? If you're gonna buy games legitimately, you're gonna have a bad time.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty Out-dated i thought this was a new one and i was wrong... but it hink there is a new one?... now i don't know... anyways not very easy to play even to slide across the map you can't click and pull the screen you have to move your mouse to the edge and wait for it to go.... also the zoom sucks... i love the idea of this game its just so old... needs a reboot",
            "review_score": "-1"
        },
        {
            "review_text": "It is genuinely impressive how terrible this game is. The problem is, this review isn't based on gameplay. This is because the game is so broken that I can't reach actual gameplay. The little that I managed to play before the game went completely ♥♥♥♥♥♥ was promising. It was actually kinda fun. When I created my first power plant, the graphics went completely wonky. The graphics system (I don't exactly know what, I don't completely understand graphics) essentially crashed. Funky shapes appeared all over the screen. I restarted the game, even reinstalled it, but it was still the same. If you want a city-builder, I recommend playing one that isn't complete ♥♥♥♥, like Cities: Skylines or Banished.",
            "review_score": "-1"
        },
        {
            "review_text": "Crap game I want my money back",
            "review_score": "-1"
        },
        {
            "review_text": "Horryfying the music and people are scary, dont buy this!",
            "review_score": "-1"
        },
        {
            "review_text": "This game crashes on start up!",
            "review_score": "-1"
        },
        {
            "review_text": "Didnt relize this game was over ten years old. Probably good for its time.  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "So buggy not worth wasting $20 on for windows 8.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ is so cash it's not even working on my new rig. ♥♥♥♥ u gaben",
            "review_score": "-1"
        },
        {
            "review_text": "Once a great game that I re-purchased for old time's sake. It's just too old now with very poor graphics and cumbersome controls. They say there are a lot of mods, but it's insanely hard to install them and even harder to find the ones that are really good. Unless you're a diehard or just run a slow machine, save yourself the few bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "The game quality suck and well its just not worth its price. The game quality shows its a very very Old game. Dont buy it. The progress in game is also slow and the quest sucks. Ill recommend Anno 2070 better then is a way better.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate it. Can I return it?",
            "review_score": "-1"
        },
        {
            "review_text": "Old, too much money for a game that could be found in a charity shop for pennys",
            "review_score": "-1"
        },
        {
            "review_text": "city skylines is easier and more friendly to use. UI are aweful",
            "review_score": "-1"
        },
        {
            "review_text": "AWFUL.... since when am I back in the 1990s of games quite a let down for something that isnt free",
            "review_score": "-1"
        },
        {
            "review_text": "Dam aufall gmae i want my money back ♥♥♥♥ing teribale",
            "review_score": "-1"
        },
        {
            "review_text": "It's ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "NEVER PLAY THIS GAME. IT IS THE DEFINITION OF BORING AND AGGRAVATING.",
            "review_score": "-1"
        },
        {
            "review_text": "To much to look at at once. Still can be fun. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Better than expected. I wish co-op Multiplayer worked. I'd look toward Skylines nowadays",
            "review_score": "-1"
        },
        {
            "review_text": "Plagued with graphic bugs even when using the launcher, and the launcher is bad too",
            "review_score": "-1"
        },
        {
            "review_text": "bad game it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "i bought this game thinking it was a sims game but it turned out to be a completley different game is there anyway i can return it?",
            "review_score": "-1"
        },
        {
            "review_text": "Highly do not reommend, took me 4 hours just to get the game to start and then the gameplay was extremly difficult to understand 1.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "i got the game and it was fine then it started to glitch out on me!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is a completely worthless horrible game",
            "review_score": "-1"
        },
        {
            "review_text": "Eh. 6/10. Only recommend if on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "God damn it EA, why don't you just buy my entire childhood?",
            "review_score": "-1"
        },
        {
            "review_text": "Gets boring after a couple of hours worth the price when its on sale not a pretty game but its a good game.  (EDIT)  I change my ♥♥♥♥en mind this game is boring trash do not buy it at all!",
            "review_score": "-1"
        },
        {
            "review_text": "i dont like this game cuz it wont let me play it",
            "review_score": "-1"
        },
        {
            "review_text": "didn't like it...tropico is better...funnier and harder..buy Tropico",
            "review_score": "-1"
        },
        {
            "review_text": "BAD, Do not buy this game no matter what you do!",
            "review_score": "-1"
        },
        {
            "review_text": "I think I'm done playing this game. I might like the genre, and the game itself would've been solid at the time of its release, but I've experienced so many crashes with SC4 that maybe only half my playtime amounted to anything besides lost progress. Many other users have reported the same issue and this kind of experience is not worth the price tag.",
            "review_score": "-1"
        }
    ]
}