{
    "app_id": 248190,
    "name": "Knytt Underground",
    "release_date": "2013-10-25",
    "developer": [
        "Nifflas' Games"
    ],
    "publisher": [
        "Ripstone"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Sexual Content",
        "Violent",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Adventure"
    ],
    "achievements": 20,
    "positive_ratings": 275,
    "negative_ratings": 41,
    "price": 4.99,
    "description": "The legendary Knytt series continues with Nifflas’ latest creation; Knytt Underground. In this Knytteration; humans have long since abandoned the planet after practically destroying it in a war, five hundred years ago.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/248190/header.jpg?t=1506939451",
    "minimum_requirements": "OS: Windows XP or later Processor: 2.0 GHz + Memory: 1 GB RAM Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've been a big fan of platformers since my family got a NES in the late 80s. I've played a sizeable number of them since, but the ones that made the biggest impression on me were the ones where it's not all about the platforming, but really exploring the game and trying to figure out every single secret hidden in it. And secrets have become such a de facto standard of the mainstream 2D platformers to the point where the secrets and locations of them have become rather formulaic. The wonder of finding them has all but disappeared.  That's one of the reasons I love Knytt Underground so much. The fact that the world is so huge makes just getting around it a great endeavour in itself, but there's also so much stuff hidden under the surface if you care to dig into it. And it's mostly not about finding an equivalent to a star coin or a 1-Up, but rather about getting intimate with a game world that's so carefully and lovingly crafted. It's about talking to an NPC that isn't a step towards beating the game, but piecing together another part of the lore of the people of the underground. And it's about exploring amazing locations just for the sake of exploration; not because there's a carrot dangling at the end of your journey.  In short, this is probably my game of the year.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle platformers rarely get as good as this. The storytelling is lovely, the soundtrack is immersive and the art is beautiful. Only negative point goes for the lack of native controller support, although I've played it first on a playstation and find the pc+keyboard version to be much more responsive. Some puzzles are quite frustrating, but what's the fun otherwise? I've recommended this to every single person I love.",
            "review_score": "1"
        },
        {
            "review_text": "Knytt is a good platform, with lots to explore in wonderful colours and some puzzles that require skills, some of them so rogue and challenging to stress out asking for a break, but overall ends up being a joyful experience; soundtrack is appealing to the game as well.",
            "review_score": "1"
        },
        {
            "review_text": "Played the freeware game released by the dev some time ago and liked the game style. So buying this one was no real brainer. This version is entirely different compared to the freeware games. Much more polished look.   The game itself is '2D hardcore platform parkour goes Super Meat Boy' -type of endurance fest sometimes - sometimes it's quite a casual stroll around nice enviroments. No really, no saw blades here but the platforming challenges can sometimes be very punishing - and the game map is huge - enormous - way way large in Chapter 3 (first two are basicaly tutorials). Also lots of hidden tunnels and lots of weird characters.   Recommended to people who want a real platforming challenge.",
            "review_score": "1"
        },
        {
            "review_text": "As a huge fan of Knytt Stories, I was looking forward to the release of this game. However, the result is not something which I can call worthwhile.  Graphics: Unfortunately, the transition to higher res graphics is not flattering at all. While Stories used simple sprites, the low res meant that this could pass for a purposeful aesthetic and it worked. Underground, by contrast, looks generally incoherent. The silhouette style works, but hides a lot of the character and variety in the areas. The character sprites and portraits feel like programmer art - they are impossible to take seriously.  Audio: The music and sound effects are consistently fitting, minimal and and atmospheric so a good job on this count.  Gameplay: The platforming mechanics here are fairly good, the level layouts are smart and there are a good number of save points along the way. The chaper two mechanics are pretty neat. However, progression through the game is not rewarding in the same way that a good Metroidvania should be. A lack of character upgrades and variety makes progression feel less like purposeful exploration and more like aimless stumbling around and backtracking. On a technical note, there is no controller support. The creator suggests using joy2key or xpadder but having tried this, it is clear that design choices in the keyboard conrtrols make this impractical.  Dialog: This is one of the more frustrating parts of the whole experience. It is clear that there was an attempt to be whimsical here but in reality, the dialog just serves to pull you right out of the game; creating a feeling that neither the characters or the writer are invested at all. Rather than being charming, it just kills the neat atmospheric mood that the game partway manages to establish.  Overall: Unfortunately, I can't recommend this game. Play Knytt Stories instead. It is free and feels much more complete and satisfying than Underground in every way. If you like Stories, then maybe consider buying this to support Nifflas almost as a donation for that game.",
            "review_score": "-1"
        },
        {
            "review_text": " Tldr: One of the best games I played of all time.  This game is really well made, you have awesome character development, an extremly fitting art style and background music which makes you feel comfortable and the map of Knytt Underground is  huge  and got  tons  of secrets. The gameplay mechanic is innovative and after you got a hang of the controls you can involve your surroundings in your gameplay. Completing the main story of the game will take you about 6 hours, but you really want to miss out all the sidequests, additional characters, secret challenges, several ending and and and.  If you want to have an atmospheric and relaxing experience, try out Knytt, you will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "The whole Knytt series is worth playing, but this one (as far as I know) is the only one on Steam. Luckily for you, it's also the best.   Knytt games are all about exploration, puzzles, and platforming, in that order. They're very engrossing and it's fun to run, jump, climb, and bounce over the strange and beautiful world. The movement in this game feels great - once you hear your little feet scamper up a wall as you climb it you'll fall in love.  This series of games proves that indie games don't have to hide behind quirky graphics and a 'message' (*cough* LIMBO *cough*) to be worth playing. Knytt Underground is fun, it's interesting, and it's definitely worth your time. Pick it up today.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game a lot, for a few reasons.  Gameplay consists of platforming, exploration, and item collection. The enjoyment of this game for me comes in with the characters, the atmosphere, and the setting. While there is no combat or complex puzzles and a lot of quests dead end and have no rewards, what you are left with is a game you play for the story. If the story isn't to your liking here then you probably wont like the game, but it worked out pretty well for me. I liked the interaction and development between the characters, and the game doesn't feel held back when it comes to discussing a few unpleasant topics or having characters act vulgar or make violent expressions when it fits (hence the game's Mature ESRB rating). The game's art-style for character portraits was initially a turn-off for me but I found myself not really minding it later into the game. The game also has good sound and art design for its environments, and can be very nicely ambient in atmosphere. The setting and lore of the game was very appealing to me too, and gives the player a few humorous moments thanks to meta-knowledge that the characters in the story dont posess.   Performance - No issues, runs fine, rebindable controls, graphics options are satisfactory. Controls are fairly tight and platforming is not very problematic. Some puzzles are hard, but not excessively so, and the game is very much non-punishing for failure-retry in its puzzles. There are optional parts with quite difficult puzzles, but those are presented completely aside from the main setting of the game.  Its a very good game, and quite long too for an indie game. I spent a lot of time enjoying myself and exploring things, and seeking out a few optional achievements, and put in about 20 hours into the game. I know this sort of enjoyment that is more story than gameplay driven is not for everyone, so a lot of people might find the game boring or lose interest, but I would definately reccommend it. ",
            "review_score": "1"
        },
        {
            "review_text": "Here's your low-stress platforming fix. Beautiful backgrounds. Potty-mouthed fairies. Lovely music. Exploration-heavy gameplay. Funny little quests. Rewards for looking close.  There are challenges when you want them -- it's up to you when you decide to tackle them.",
            "review_score": "1"
        },
        {
            "review_text": "For many years Nifflas has been developing games on the PC. The two most notable of these titles are Within a Deep Forest and Knytt. Within a Deep Forest had players taking control of a sentient bouncing ball that had to save the world from a bomb. The game focused on the bouncing physics of different types of balls of different weights and materials.  Knytt focused on a little hero of the same name needing to find parts to fix a crashed spaceship so that he could get back home. The mechanics here dealt with the notion of climbing and sticking to walls. Both of these games have now been combined to create Knytt Underground which marks Nifflas’ first move into the realm of console gaming.  Split into three chapters, Knytt Underground has players take on the role of the mute Mi Sprocket as she explores a huge environment. Her aim is to look for human artefacts and complete quests in a Metroidvania style. The first two chapters act as short tutorials to help players understand the mechanics of how Mi and then Bob the ball handle. By chapter three the two characters have magically been morphed together allowing players to change from Mi to Bob at will.  This allows for some situations requiring lightning reflexes as you change from Mi to the bouncing ball mid-air to cannon off the landscape at all sorts of weird and wonderful angles in order to reach new areas. As well as the bouncing and climbing there are different coloured plumes of smoke which give temporary abilities. These range from turning Mi invisible, making her jump higher or turning her into a set that can shoot horizontally or vertically.  Everything is designed as a means for you to get to another locations and this is where Knytt Underground really works well. Nifflas games before this have always focused on short bursts of quick reflexes and skill. When Knytt Underground asks players to do the same it comes to life in a flurry of ever changing physics and colourful plumes of smoke. (Note to developer – a colour-blind filter would really help with those plumes of smoke)  However, in Knytt Underground there are often long stretches of exploration through empty screens to reach these areas. Sometimes the beautiful graphics and sound create a haunting and ambient environment which you don’t mind trekking through. At other times it can all be a little dull as you wander through empty screen after empty screen. This was an issue on the PS3 version but strangely, seems to be much less of an issue on the PC. Maybe we’ve mellowed a bit, or maybe it just fits the system a bit better.  When Knytt Underground works it works well but when it doesn’t it can feel a bit empty. This isn’t helped by the seeming lack of progress you make. There are numerous quests and items to discover but on completing or collecting them it doesn’t seem to mean much. Of course it all adds up in the end but the game could do with tweaking its risk reward system to help players feel a greater sense of achievement after they have overcome some of the incredibly fiendish screens.  It is worth highlighting just how lovely the game looks and sounds. This game is beautiful and the music is of the highest standard. We expect no less from a Nifflas game and in that department Knytt Underground can never be faulted with a stunningly ambient atmosphere created throughout. The spaced out save points also seem less of an issue in the PC version, even though some of them are still some distance away from tricky sections of the game and back tracking is something that can begin to hinder the experience. We lost count of the amount of times we trekked along a tunnel for five or six screens only to reach a character telling us we needed to bring a certain item to them. This then meant trekking back through all the screens again. There really isn’t a need for this and you wonder if the game would have benefitted from a slightly smaller, more focused, map without many of the empty screens - or at least the ability to teleport between save points.  Overall, Knytt Underground is another promising game for Nifflas. The look and sound of the game is gorgeous and easily rivals the best 2D artwork out there. The game itself gives players a huge world to explore but many may well feel that it lacks focus and a real sense of rewards for the skill you need in order to progress. Those looking for an adventure set at a slower pace will love it, while others will be left wanting a bit more excitement.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome world,clever puzzle,huge map,many secret   11/10",
            "review_score": "1"
        },
        {
            "review_text": "My only hope is that this game will stand forevermore as a reminder of the evils of liberalism. 'Oh but it's lush.' 'Oh but Within a Deep Forest once brought me such joy as a young babby boy.' No... this can't happen here.",
            "review_score": "1"
        },
        {
            "review_text": "this post-apocolipstick mystical adventure, starring a young woman named 'Rubber Ball,' will have you on the edge of your seat, laying back in your seat and enjoying the atmosphere. if you like secrets, 'Knytt Subterrain' vidcon has the secrets that YOU want to SEE (pinky promise)",
            "review_score": "1"
        },
        {
            "review_text": "Although I have appreciated many of Nifflas' previous games, including the previous game in this series, Knytt Stories, I cannot recommend this game because it lacks one thing: heart. While retaining similar mechanics to previous games (running, jumping, exploration and fetch quests), the games adds in a lot more characters and dialogue making it a somewhat 'chatty' experience. But the dialogue is tacky. It feels like something I would think was cool in middle school, and if I was trying to write something in a second language. The scenery consists of photoshopped fruits and hardware that feels tacked on, like early 90's CG in action movies. The story is juvenile and plodding. The game forces is episodic, and each episode ends up with you retracing places you've been before, but rather than being part of the exploration or platforming it's just something that makes you run back and forth.  These games are all about the atmosphere and solid mechanics as you explore an otherwise featureless world for vaguely defined reasons. The formula didn't work so well in this incarnation. To sum up: cringe-worthy characters and dialogue, passionless art, less-interesting level design than previous fare. Only for hardcore Nifflas fans, or if you're really bored, I guess.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game thinking it'd be like a remaster of the original, but it's just an incredibly simplified and boring version, now with extra pandering.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game but I would prefer to use a controller, you'll probably like it more if you prefer a keyboard or have an app to emulate using a keyboard with your controller but since this game was also made for consoles there's no reason not to add controller functionality to this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is easily my favorite video game (I'm a casual gamer). I am most impressed by the unification of the narrative, graphic design, and soundtrack--it all meshes as a Gesammtkunstwerk. I highly recommend downloading the free soundtrack (approx. 4 hours of music) if you like glitchy, atmospheric electronica (this has become my go-to work soundtrack; I do a lot of writing, and it's a great, unobtrusive soundtrack). The Knytt world is pretty vast with tons of caverns to explore. Even though I've completed the game (by paying the gatekeepers before the bells--I'm working on doing it by circumventing them), I continue to play for a bit in the evening simply because I find the combination of the visuals and the music so relaxing. If you enjoy puzzle/platformers, and you appreciate artistry in your games, this is most highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "So, so much to see and do in the last chapter. Reminds me of some of the gigantic levels for pure exploration in Knytt Stories, only with more bouncing. And Cilia.",
            "review_score": "1"
        },
        {
            "review_text": "This game is gorgeous. The graphics remind me of Limbo, except where Limbo concentrates on darkness and negative space, Knytt uses colorful backgrounds that seem whimsically out of place in the underground setting. The actual gameplay is a bit on the casual side, though some of the jumping puzzles can be difficult to pull off on the first try. The game is mostly about exploration, and with imagry like this, I kept exploring just to see what the next screen would look like.   If you like your games a bit on the artsy side, this one's for you. ",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game makes me feel quite comfortable. Its art style tends to dark color but wouldn't let me feel dark. Its detail of texture is kind of vague beauty. Applicable to casual gamer. Oh! I play it on Desura, not on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic platform-action-adventure game, one of the best in its genre. Despite Knytt's apparent simplicity and narrow gameplay possibilities (well, you're bouncing ball or girl who is fantastic climber), game brings lots of fun. What is more, gameplay isn't the most amazing part of this game. Actually, I wasn't expecting such good plot in this game at the beginning, but Dora and Cillia talk about really important things in life of every one of us, also society of Knytt shows some real world problems. Another good thing is that there are TONS of hidden places, which contain items and sometimes Steam achievements. In fact, to unlock any achievement you have to be extremely lucky or find a good achievement guide, as I did.  Anyway, this game is really awesome and anyone who likes platform games will love this one too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a joy to play. Not particularly difficult, but it has a beautiful, large area to explore.  This builds off of the 'Within a deep forest' universe, so it might be a good idea to play that first, but it isn't necessary.",
            "review_score": "1"
        },
        {
            "review_text": "A great adventure/exploration game with beautiful graphics and music. All that is accompanied by a non-trivial story unfolding in the background of the plot. Also: be prepared for surprises!  I would not recommend this for children below, say, 10 yrs.",
            "review_score": "1"
        }
    ]
}