{
    "app_id": 248330,
    "name": "Dino Run DX",
    "release_date": "2015-09-29",
    "developer": [
        "Pixeljam"
    ],
    "publisher": [
        "Pixeljam"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Indie",
        "Racing",
        "Action"
    ],
    "achievements": 49,
    "positive_ratings": 590,
    "negative_ratings": 49,
    "price": 4.79,
    "description": "DINOSAURS. PIXELS. PYROCLASTIC DOOM WALLS. MULTIPLAYER RACING. MASSIVE INDIE CROSSOVERS. Dino Run DX has all of that and more. Come rediscover the original runner and escape extinction all over again.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/248330/header.jpg?t=1528943640",
    "minimum_requirements": "OS: Windows XP Processor: 1 Ghz CPU Memory: 500 MB RAM Storage: 45 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've known this game since I was 10 years old and I'm still playing it now even though I'm 18. Really the game that defined the running genre.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun and addictive game with a great community of people  and a magical adventure inside a T-rex's large intestine .  Yeah.  You'll be racing your friends for hours. And with a dedicated crowdfunding platform made by the creators of this game, more updates are sure to come in the future.  Game includes magical cat gods that will lead you to paradise and performance enhancing drug flowers.",
            "review_score": "1"
        },
        {
            "review_text": "One of those kind of games that are simple and easy to pick up for a few minutes of play in between being busy!  You pretty much just run from one side of the map to the other, all the while avoiding the impending meteor apocalypse. There are different games modes also that change this, one included that lets you go about casually without needing to worry about death, handy for multiplayer chatting.  I played the original often on browser, but I really love the new stuff included in this and the achievements are fun too.   You can also customize your dino, and I'm a sucker for customization so +10 points for that in itself.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for years and it's sad to see not that many people playing on multiplayer anymore. The game's still fun and challenging to play, but it's of course more fun to run from the wall of nightmares and doom with your friends. Also, hats.",
            "review_score": "1"
        },
        {
            "review_text": "I used to play the original all the time back in Middle School, and now not only can I enjoy it again, but I can also enjoy all the improvements that this version has to offer. Oh, sweet memories...",
            "review_score": "1"
        },
        {
            "review_text": "This is just VERY similar to the original flash game. I bought it for having achievements to unlock, and that I was willing to pay for a better experience. Unfortunately, very little meaningful gameplay has really been added. If you really like this game, and are willing to pay the $5, I would say go for it. Just know that you aren't getting the most of your money, and won't see a huge amount of improvements. As time progresses, more and more improvements have and will be made.",
            "review_score": "1"
        },
        {
            "review_text": "My dino...has a  hat . 10/10. (I've actually played this game a lot on Kongregate before it was on Steam, it's just a great game overall.) (...and... apparently I tried to post this review after a minute of playing it, so that tells you how good it is too.)",
            "review_score": "1"
        },
        {
            "review_text": "How much can I recommend this? I suppose it depends on how much you played the original. Dino Run DX, for all that 'Deluxe' implies, feels like an exact port of the old flash game. Glitches, visual bugs and all. These are things we were happy to put up with when it was free, but to pay money for an edition that doesn't really improve on it at all is disappointing. More notable is the failure of multiplayer- indeed, it's essentially dead now, and all the 'players' you'll see there appear to be kids using it as a chatroom. When I say dead, I mean DEAD, by the way. I haven't played a single online game yet, and doubt I will.  Another negative thing about the game is the bizarre controls. For some reason, your little dino doesn't control very predictably. Jump height varies seemingly randomly, and goes off in strange directions, so leaping for tantalizingly placed eggs can be an exercise in frustration. The result is that simply moving around isn't as fun as it should be. To be fair, this is a problem with the original game as well, but it's a surprisingly big issue, as it cuts down on the replay value immensely for me.  What can I say that's positive? Well, it's cute, it's charming, it's lovely to look at. It sounds pretty good, to boot. The pixel art is a blend of the old and new - the pixelation and limited colors we might associate with old Atari games, but without any of the limitations, like those on sprite count or scrolling. Dino Run is, well, a modern game in a cute pixel style, but it is important to note that as a 2007 release this game (and the studio that made it, Pixeljam) actually pioneered the style before most other indie titles. There's a ton of hats to collect, eggs and special eggs to find, and it can be fun. But it's hard to overlook its shortcomings when you're paying for it.  Look, I'm a longtime fan of Pixeljam. I love their art, music, and their games. I'd like to see their games come to other platforms (Gamma Bros. on 3DS would be sweet - just sayin'). But I'm not really happy with the state of this Steam release. I'm happy to have supported one of my favorite studios, but unfortunately this will be finding its way into my 'uninterested' game folder.",
            "review_score": "-1"
        },
        {
            "review_text": "I saw it, I bought it. ",
            "review_score": "1"
        },
        {
            "review_text": "The original runner! Still just as addicting as the days you competed with friends in the school computer lab. And now you can do it online! With hats!",
            "review_score": "1"
        },
        {
            "review_text": "The good ol' dino runner, It's a well polished arcade game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game that's aged perfectly. Glad to see it getting more content these many years later.",
            "review_score": "1"
        },
        {
            "review_text": "it is an instant classic buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game! Good way to relive your childhood.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this on miniclip. A very good game thats been updated very well. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Less than 5 minutes of fun for the whole family.  Talk to strangers online!!!  No really, talk to them.  That's at least 40% of the game.  Talk to absolute strangers and beg them to race you, because without them racing you, you can not level up, you can not develope your character further.  This game was better in like 2009 when it was just a free browser game with an entire communtiy that was built around vast friendships and acceptance.   Except that one pedophile that sexually harrassed like 15 users on Skype and took child pornography images of them via screenshot and forcing them to, 'Impress the head admin' after picking them up from the chatrooms of your game.  Hope you fixed that bug in the game.  There is a lot of room for improvement here. Stop beating the dead horse and trying to make money out of something you already destroyed years ago.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game. Used to be utterly addicted playing it years ago on Kongregate. It was really disappointing when the Kickstarter didn't work out so the latest crowdfunding was exciting! And now it's on Steam. Brilliant.  It's addictive, fun, pretty, and it has hats.",
            "review_score": "1"
        },
        {
            "review_text": "So many hats! heheh  Here's hoping they add local co-op :)  Fun game, makes you want to keep playing even though you keep missing that one jump!",
            "review_score": "1"
        },
        {
            "review_text": "Great racing game!",
            "review_score": "1"
        },
        {
            "review_text": "Really unique and fun game, you don't normally see a dinosaur game as good as this ( no offense haha ). Although the multiplayer lobbies can be a bit barren sometimes you can always pass the time in singleplayer. I really like how it looks in general, not just pixels but the landscapes are shaped realistically too. Freerun is great for me since I don't have to always chat in the lobbies anymore with my friends, good job Pixeljam, hope to see more updates soon!",
            "review_score": "1"
        },
        {
            "review_text": "This game is all sorts of fun. I only wish there were more multiplayer maps, or more maps in general, but other than that its just a good time all around. I remember playing it when I was a kid on Armor games, and somehow it's still just as charming and fun as ever.",
            "review_score": "1"
        },
        {
            "review_text": "Good, classic game.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a great little nugget of arcade-y fun I got as a gift last year. And of the smaller games in my library, this is the one that I keep coming back to. The mechanics are simple, quick to pick up, and hard to put down. The challenge level is mostly fair, and the ease of trying again immediately is an excellent touch. The visuals are appealing; the sounds and music really add to the feel of the game as well. Plus, friggin' dinosaurs! And not generic JP monster ones, either. Kudos!",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER!  10.0/10- IGN",
            "review_score": "1"
        },
        {
            "review_text": "The price is high (I got a free key since I own a DRM free subscription), but the game is very fun, simple, and straight forward. It's like playing a DOS game in your OS.",
            "review_score": "1"
        },
        {
            "review_text": "Dino Run is just a classic runner, very fun and amusing. I remember playing it as a child always wanting to go on the computer just for... Dino Run. I'm glad that it has came to Steam, It brings back lots of memories.   Very Recomended.......",
            "review_score": "1"
        },
        {
            "review_text": "It's not an ENDLESS runner- it's a runner with levels and attributes to level up. This game gives you the option to have a real life, yet I can't stop playing it. I played it when it was just a flash game, I bought it when they released a stand-alone, I contributed to the Kickstarter for a sequel, and I will get it again if they ever release it for Android. Fun for the whole family!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addicting   Have a life?Now you don't!",
            "review_score": "1"
        },
        {
            "review_text": "Played this game for years  It's still awesome",
            "review_score": "1"
        },
        {
            "review_text": "Rad as hell. Played this back in the day on Kongregate, absolutely happy to give this developer money.",
            "review_score": "1"
        },
        {
            "review_text": "Oh I remember playing this when I was young, I'm talking 6-7 years ago now, It's nice to see that the game is actually still getting attention and being slowly improved. While you can play it for free, I bought it, you know, to support the developers and all that... Every little helps! I see the vast majority of the people buying this game coming over from the flash game that was around before this. My only complaint is the hats and all the skins, they're pretty stupid in my opinion, but I do see the appeal, this doesn't make the game better or worse for me, just looks a little silly. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this game back in the day! I It opens quickly and doesn't freeze. I use it as break time during study.  sound track is amzing and the haloween level is a tricky sort of delight.  ",
            "review_score": "1"
        },
        {
            "review_text": "  I've been playing this since it first released back on Miniclip in '08 and it's been interesting to watch it evolve as the players grew up with it. Both the game and company have been through a lot of growing to reach where they are now and the latest iteration (DX) is the culmination of every lesson learned along that path. With some old bugs squashed, new features implemented, and hats crammed into every nook and cranny you can find, it's no wonder that the game provides hours of entertainment to players of all ages. What really puts it over the top, though, is the responsiveness and involvement in the community by the developers that you just don't see often enough.  Small disclaimer that I received the game for free due to doing mounds of beta testing over the years.",
            "review_score": "1"
        },
        {
            "review_text": "dino run was a good childhood game of mine, played when ever i could at schoolon my free time on the computers. Dino Run DX is more or less a polished version that gives a good amount of game play for such a short and stright forward game, fun to play with friends and can meet others as well",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this game on the internet, and when It came out on steam with more stuff, I had to get it. It's $2.20 right now so I would reccoment picking it up as a great time killer!",
            "review_score": "1"
        }
    ]
}