{
    "app_id": 248370,
    "name": "Bridge It +",
    "release_date": "2013-11-18",
    "developer": [
        "Chronic Logic"
    ],
    "publisher": [
        "Libredia Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Building",
        "Physics"
    ],
    "achievements": 0,
    "positive_ratings": 83,
    "negative_ratings": 39,
    "price": 4.99,
    "description": "A stunning, beautiful world awaits as you take on the challenge of bridging the chasm. Can you solve the puzzles and avert disaster?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/248370/header.jpg?t=1529672458",
    "minimum_requirements": "OS: Win XP/Vista/7/8 Processor: 1.0 GZh Memory: 512 MB RAM Graphics: Graphics card with Pixel and Vertex shader 2.0 support (Intel 915, Nvidia Geforce 4 ti, Ati Radeon 9500, or any newer card) DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Win XP/Vista/7/8 Processor: 2.0 GZh Memory: 1024 MB RAM Graphics: ATI or NVidia card w/ 1024 MB RAM DirectX: Version 9.0c Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "This game is initially quite interesting and fun to play. The easy mode is just that - easy. More like an extended tutorial really. Once you hit medium and hard the challange starts. Build a bridge with a limmited set of parts, on a budget. Have the bridge survive trains, or cars, or earthquakes. Some even have to open hydraulicly for steamboats to pass. Pretty cool to make a bridge on budget, and holds up the train, just to get torn down by the shipping. Where the game starts to fall short is that once played, there is no reset to start over once a bridge is built in a specific challenge, and there are only about 24 challenges in total. I played most in about 3 hours. Further, many of the hardest challenges are indeed not possible to complete as you are tasked to construct a bridge that does not connect to land on one or both sides, and the test vehicle, usually a train, just nose dives off the cliff and the simulation fails. I don't believe these were play tested in advance. Also, you can not build past the budget, and then reduce the design, once you are out of money, no further experiments can be made. Would be a really good $2 or $5 game, but for $19.99 I expected much more.",
            "review_score": "-1"
        },
        {
            "review_text": "Before getting into the actual review, I just want to say that this game is amazing! It's 10 years old (I think) but it still holds strong!  Now the actual review.  Bridge-it is a bridge building game with a really in-depth bridge editor I guess you could call... It has almost every material you normally see in bridges (no wood saddly) and more than enough levels!   Pro -Great graphics for the time -Awesome physics -Fun and challenging gameplay -Great replay value -Let you unleash your creativity  Cons -May get a bit repetitive after awhile.  -A bit buggy -A bit overpriced considering it's a pretty old game  Overall, this game is definively a buy! If you like building stuff, it's a must! You might want to wait for a sale though!",
            "review_score": "1"
        },
        {
            "review_text": "I don't regret building terrible bridges. I do regret that more people weren't on those bridges when they collapsed.   Simple to learn and yet hard to master. Quite good fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's not a *bad* game but you have likely played a game just like it on the Web for free.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not going to lie, I absolutely love this game. I bought this game a few years ago and it has been one of my best buys. You don't simply build a simple bridge. You can build draw bridges, suspension bridges, heck, you can build bridges that look like women doing yoga. Plus you dont have to just win the approval of measly little cars, you have trains that make your bridge look like it was made of toothpicks. or you can cause an earthquakes to shake it down. This is an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "its okay but it can get pretty boring and very hard. not at all worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like to build bridges??... well i don't... but this game is cool and gets a   WoW &lt; Bridge it o_O",
            "review_score": "1"
        },
        {
            "review_text": "The game gets ♥♥♥♥ing hard after awhile I luv it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Bridge it, this was my 1st bridge builder on steam.  Fun? A lot of fun, graphics still hold up and the sound is nice. Good physics.  Any tutorials? Good tutorials.  Verdict: Great casual game.  Recommend? Yes.",
            "review_score": "1"
        }
    ]
}