{
    "app_id": 24840,
    "name": "Medal of Honor: Airborne",
    "release_date": "2009-10-06",
    "developer": [
        "EA Los Angeles"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "World War II",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 1725,
    "negative_ratings": 461,
    "price": 9.99,
    "description": "Step into the boots of Boyd Travers, Private First Class of the “All-American” 82nd Airborne Division, and revolutionize the way the war is fought. From a rocky beginning in Sicily to war winning triumphs in the heart of Germany, fight the epic WWII battles that turned America’s first paratroopers into combat legends.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/24840/header.jpg?t=1447352551",
    "minimum_requirements": "OS: Windows XP or Vista (32-bit) (64-Bit versions of Windows not supported)Processor: Intel 2.8 GHz or faster (3.0 Ghz or faster for Vista) or AMD Athlon 2800+ for  Windows XP / AMD Athlon 3800+ for Windows VistaMemory: 1 GB or moreGraphics: Video card with 128 MB or more memory, Pixel Shader 3.0 support, and one of these chipsets is required: ATI Radeon X1300 Pro or greater, NVIDIA GeForce 6600 GT or greater. NOTE: NVIDIA 6800XT/LE, 7100GS, 7200GS/LE, 7300 GS/GT are not supported. NVIDIA SLI and ATI Crossfire modes are not supported.DirectX&reg;: DirectX 9.0c compatibleHard Drive: 9.0 GB or more free spaceSound: DirectX 9.0c compatible (For Creative Sound Blaster Audigy cards running under Windows Vista you should expect lower performance)Special Requirements: 2-12 players and 24 with dedicated server; Cable, DSL, or faster connection INTERNET CONNECTION, ONLINE AUTHENTICATION AND ACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO PLAY. TO ACCESS ONLINE FEATURES, YOU MUST REGISTER ONLINE. ONLY ONE REGISTRATION IS AVAILABLE PER GAME. EA ONLINE TERMS & CONDITIONS AND FEATURE UPDATES CAN BE FOUND AT WWW.EA.COM. YOU MUST BE 13+ TO REGISTER WITH EA ONLINE. EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON WWW.EA.COM.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Who does the Army trust the most? AIRBORNE!  Who do the ladies love the most? AIRBORNE!  Who do the Nazis fear the most? AIRBORNE!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game WW2 heroic stuff and kinda way to good graphics from being a game from 2007 impressive",
            "review_score": "1"
        },
        {
            "review_text": "I had this game on the ps3 and I loved every second of it. for a 2007 game the graphics are still pretty good. This game is notorious for gliches. In the campaigne the weapons that you collect you can upgrade them as you kill people and it makes the guns way better. But the campaigne is about 10 missions I think but they are kinda short and long depends on the difficulty. Suprisingly multiplayer is still pretty active i joined one and theres about 72 people playing online. The combat is pretty ♥♥♥♥ing dope I'll tell you. So that concludes my review I hope this helps you. and I give this game a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Single player is a good grind. Fun enough first time through... a good buy on sale. Haven't tried MP yet, but should be a hoot.",
            "review_score": "1"
        },
        {
            "review_text": "I've replayed this game on multiply consols so many times.  I don't think it will ever stop being so fun to me.",
            "review_score": "1"
        },
        {
            "review_text": "If you can get this on sale, go ahead and buy without any fear or remorse. I bought this game some time ago. and I fought with it to make it work on my PC. And after almost making WW3 with it, I finally got it to start. If you go to the guides you can find a way to make this work. I recommend this game to any WW fan. And I love its soundtrack... The memories from Medal of Honor: Allied Assault are are too strong... The game is short but it has long missions, but in the state as it is,  I will give it a 7/10 .",
            "review_score": "1"
        },
        {
            "review_text": "This is a very nice game about the American 82nd and 101st Airborne divisions of WWII. The spawning system involves jumping about of a plane and parachuting down on your enemies, which is rather exciting. Another thing worthy of note is that during the campaign, you face Tiger I tanks. You know, the killing machines that were feared by Sherman tanks everywhere. These monsters are not at all unwilling to lob their 88mm HE rounds directly at your face, which, quite fittingly, is an insta-kill. The only way to retaliate against them is with Gammon grenades or an AT Rifle.  The choice of weapons is also pleasing, and their roles in combat are well-shown. As in, machine guns are deadly to both you and your foe, and sniping with any old weapon simply won't work. Grenades also show their role both as a surpression weapon and a room-clearing device.  One of the better brand-name first-person shooters that has a surprisingly high amount of realism, definately look into this one.",
            "review_score": "1"
        },
        {
            "review_text": "This game can be infuriating. But it can also be a lot of fun. It took me 12 hours to beat the game and then go back and get all the weapon upgrades for every weapon and the grenades.    AI Issues",
            "review_score": "1"
        },
        {
            "review_text": "Fun and quick game! I remember this coming out years ago and was bummed that I missed it. Wait until it's on sale, I got mine for $2.49 and would definitely do it again.",
            "review_score": "1"
        },
        {
            "review_text": "Well it does need old physX that is in the folder, but it`s understandeble becouse it`s an old game. It takes alot of time to load maps and missions becouse its semi open world. Well here`s the good part. This game is really hard core and mostly hard. It has a great story line and the battles are pretty good apart from its lacks of AI and some graphics. But still this game is old and I do recomend playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing Call of Duty (2003) , United Offensive (2004), and Call of Duty 2 (2005). I recently bought the original Medal of Honor (1999), Allied Assault (2002), and this game (2007) to see what I was missing out on, and to compare them to Call of Duty's franchise, game-to-game based on release year. Medal of Honor has no comparison due to it's release year so I'll leave it be, but Allied Assault is ♥♥♥♥ compared to Call of Duty and United Offensive. However, I think Airborne beats Call of Duty 2 as far as the gameplay, controls, and story go. The medal awards like a strip clip for a Mauser are interesting and give the player something to strive for. The leaning is like Wolfenstein: The New Order (2014). While you're aiming down the sights (ADS), you can use WASD to lean left, right, up, and down. Hold Shift and you're able to walk around while ADS. The controls feel intuitive and the graphics hold up against Call of Duty 2.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best WWII MoH.",
            "review_score": "1"
        },
        {
            "review_text": "Easily completed within 4 hours. The game's overall good. A few bugs but still some fun 4 hours. Grab it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Who does the Army trust the most? AIRBORNE!  Who do the ladies love the most? AIRBORNE!  Who do the nazis fear the most? AIRBORNE!   One of my favorite WWII shooters. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "jumped out of a perfectly good plane right into a  gunfight....why????  cant wait for the dlc where i can be the pilot an fly home to sleep with all the guys girlfriends that i just droped off to die in france",
            "review_score": "1"
        },
        {
            "review_text": "German mutated so that his neck was two metres long. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun game .... but you cannot mod it at all... thanks EA!!!! &gt;:(  Regardless, a fun addition to the MOHA series... I have enjoyed playing it numerous times!",
            "review_score": "1"
        },
        {
            "review_text": "It is a good, simple game until the final few levels where, i'm guessing they thought it was a 'challenge' to just throw a million enemies at you while you are by your lonesome. Multi-player is dead (when I checked there were 5 people online) so do not bother buying this game for such reasons. For the price of $2.49 (sales FTW) It was a fun game for the 6 hours that it took the beat the campaign. I would only recommend this game if it goes on sale again. #crunky  ",
            "review_score": "1"
        },
        {
            "review_text": "An underrated gem,it's incredibly fun and well designed.Too bad the series died.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Medal of Honor games, if you ask me.  The weapon upgrades can be cool, but can be a little weird, seeing as if you use the Thompson a lot it just turns into a Tommy Gun, which some will like but I personally dont... BUT I did find a work around for that, and disabled the ones I didnt enjoy getting. My biggest gripe with the game by far though, is that its just not long enough. Only spanning 5 levels you can beat it in like... 5-7 hours, if you drag them out and such. Those levels are also designed pretty well, and when you're dropped into the fight you can take on any of the given objectives in any order you'd like, its just open-ended enough to be enjoyed for that. Its not a horrible looking game either, for being almost 10 years old.  Decently fun, picked it up for $5 to have some nostalgia from when I got it on 360, enjoyed it all over again. Worth the $10 if you're not picking it up on sale, but defintely worth the price whenever its on sale. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game, but I couldn’t find the stupid cake",
            "review_score": "1"
        },
        {
            "review_text": "This is second world war 2 game that I like  93/100 = Great game I've enjoy this game Graphic 20/25 Weapons 25/25 Maps 25/25 Sound effects 23/25 This game actually got a lots of graphic problem for me",
            "review_score": "1"
        },
        {
            "review_text": "Childhood game :D",
            "review_score": "1"
        },
        {
            "review_text": "one of the best action packed single players and with its multiplayer Open battlefields its one to go for 8\\10",
            "review_score": "1"
        },
        {
            "review_text": "Game looks nice if you could get past all the bugs glitches and the makeing of a EA game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game to ever exist.",
            "review_score": "1"
        },
        {
            "review_text": "a lot of glitches but still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Just doesn't quite live up to expectations. Cool idea, but feels boring by the end of the game. If the player had more control over the drop in that would have been great, but you'll always drop in pre-determined areas. It's hard to describe the combat because it's always in flux. Sometimes things will be too easy, other times too hard, and it sorta feels like there's no real consequences to running and gunning everything. For a AAA title such as MoH, this game is more of a B+.   If you're really hard up for something WWII flavored, then go ahead and get MoH:Airborne. Otherwise, buy something else.",
            "review_score": "-1"
        },
        {
            "review_text": "Like Mariana Cordoba attempting to anally penetrate you, but you being glad that only the tip fits.",
            "review_score": "1"
        },
        {
            "review_text": "CO forgets to tell men to hook up. Everybody dies. Everybody.",
            "review_score": "1"
        },
        {
            "review_text": "Good old fashion Medal of Honor :) Really glad that Medal of honor has done so many World at War bacics game's thats really cool. still story is too short but its not cost much so its still worth of money. loved it.",
            "review_score": "1"
        },
        {
            "review_text": "It's my favorite game but it would be fun if they made a remastered version with better graffics and better controls. otherwise i love it . very nice game and it's worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "WW2 in a nutshell:  RED LIGHT, RED LIGHT. GREEN LIGHT!. GO! GO! GO! GO!  PEW! PEW! PEW! BANG! BANG! BANG!  RATATATATATATATTA! RTATATATATATATATA'  AH I'M HIT!  TAKE THAT!  BOOM! BOOM! BLAHHHH!  WW2 is won.  Overall, lives up to the MoH franchise and offers awesome detailing, variable and dynamic objectives and environments, and a pretty cool weapon rank-up system.",
            "review_score": "1"
        },
        {
            "review_text": "I can not get the game to work. It keeps telling me I need to install PhysX,which I did, still nothing. Luckily, it was only $2.50",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the last best Medal of Honur title from EA. The reboot failed to achieve anything interesting or innovative and was very much a CoD4 clone. This however takes you back to the days of the WW FPS years, the graphics are still decent, if not 'wow' amazing. The missions are challenging if you crank up the difficulty, and it's a blast to play. Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Video Card not supported!? Seriously!? I paid money for this, I expect it to work! Game wont even open. I looked up solutions and they all only work for 2009 and before. Why is this game still on steam if it doesnt run on any modern machines?",
            "review_score": "-1"
        },
        {
            "review_text": "A very interesting mechanic poorly executed.  Being able to jump out of a plane to land anywhere on the field is a neat idea. You can land on a roof and shoot your way down, or land behind the enemy and flank them.  And that’s about where the good ends.  The weapons have a neat level-up mechanic. The more you use a certain weapon, you will earn attachments for it, and make it better. Unfortunately, at the beginning of the game when you don’t have any proficiencies, the weapons are incredibly difficult to use. I remember having a rifle, looking down the sights at an enemy’s chest, and emptying entire magazines without a single hit. The inaccuracy of the weapons in this game can make it very frustrating.  The enemies scale, and get more difficult as you progress. That’s good. The highest level enemies, though, are laughable and unrealistic. Also, after five legitimate missions, the sixth and final mission feels like a giant spoof of the entire game.  Lastly, the game’s big gimmick is parachuting to any place on the battlefield. I never once learned how to land correctly. The instructions were not very clear, and after failing all three times in the tutorial, I was approved and sent off to war. I played every mission, and made countless landings, and botched every single one. I was upset that I couldn’t do it, but even more upset that I couldn’t LEARN to do it.  This game was a novelty when I was looking for something I hadn’t played before, but it’s not something I’ll ever go back to with fond memories.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a pretty big fan of the good ol' Medal of Honor series, but as much as it hurts to say this, I can't really recommend this one. Yeah, I've played for mere minutes, but there's a reason for that. First off, upon my first start up of the game, I was waiting ever so patiently for it to install all the useless stuff, only for it to tell me that my graphics card is not supported. Now, because I have an Intel HD 4200, I can understand why this wouldn't work. Obviously, I wasn't gonna call it a day there. I looked around, searched the forums, the Googles, and found something called PhysX Legacy. Several places said installing this would make it work. Did that, no difference.  I then found someone saying to just rename the setup .exe in the games files, and upon doing that, the game actually started up.  And now, to the actual game itself.  Because the setup was renamed, the game kinda ignored all the graphical stuff, and does not allow me to mess with the graphics settings. When playing a cutscene, most, if not all the characters are simply black silhouettes. I was watching as one of them was showing me my objective in a town in Italy, which just turned out to be a blank wall. So, if you end up like I did where your card is not suppoted, you can't do much about the cutscenes.  Now, the gameplay. The first mission, and probably every single other mission, starts out with you jumping out of a plane. You parachute into the town, your objective to take out AA and artillery guns. Now, this is just my opinion, but I didn't like the fact that it didn't matter what order I completed my objectives. I found myself running through the empty streets, from one side of the town to the other, all of a sudden running into some firefight close to the objective. I've played Allied Assault, European Assault, Rising Sun, Vanguard, and the missions were all linear and not really picky. I think that's how it should have been with Airborne. The idea of choosing how to do the mission is cool, but something about the topic and the way it was executed just makes me think that it's not as good as it could be. In Vanguard, you did the same thing, jump, land, and one by one finish your job. In Airborne, you jump, and you can finish the mission as you please.  The shooting is a bit odd to me, but that's probably because I'm used to shooting without iron sights, like in the old MoHs. You can sprint, the health bar is different than just about every other MoH, giving you 4 bars that can regenerate with either health packs or just over time, so long as the bar is not empty. In Vanguard, it worked like CoD, get shot, wait a few, its like nothing happened. In the older ones, you had 100 health, and could only get more if you picked up bottles, medkits, etc.  I do not reccomend because the game is simply too much of a pain in the ♥♥♥ to get up and running, and if you have the problem I had, you will not be able to toy around with the graphic settings. Hell, there isn't even an option to do so, other than brightness and whatnot. The multiplayer is also a major disappointment, as there is only 10 or less people playing. Allied Assault has more players than this game, and that's a game from 2002. If you're concerned about the story of it, it's World War 2. Not your forte? Go back to your futuristic bolonga. Medal of Honor Airborne was probably amazing in its day, but in 2014, it only causes problems and disappointment.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is SUCH a pain in the *** to get started that in the end it isnt even worth it, I DO NOT RECOMEND THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "This game...by god is horrible. I strongely recommend u buy another piece of crap game other then this worthless junk. The glitches and spawn kill have really out done themselves in this game. This is not worth the 10 buckes.",
            "review_score": "-1"
        },
        {
            "review_text": "idk whats wrong the game doesnt work to me plz help!",
            "review_score": "-1"
        },
        {
            "review_text": "if you dont want to spend five hours installing a game dont buy it if you dont like spending another five hours getting the  darn thing to work dont even look at it the game isnt bad but it took me so long just to get to step 3 of getting it working  its pointless dont buy in less youre ready for this so save 10 dollars and buy a better game -9/10",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not a big fan of the FPS genre so I might just be wrong, but from what I've seen in this game, MOH:A isn't a very good game. There isn't much to the game in terms of story, and usually you'd expect more from the gameplay. But then the very clunky control scheme is what pretty much ruins the experience. You can't move at all while aiming, which can get really annoying and disadvantageous. I'm not saying you should be able to move as quickly and as freely as usual, but at least you should be able to inch around a bit to get a better position, angle, or whatever. And this probably wouldn't have been as frustrating if the muzzle-loading process of some of the rifles weren't so terribly long. And yes, I'm playing on Hard mode. Simply switching to a lower difficulty still doesn't cut it.  Another sort of nitpick I have with this game is that when you shoot at an enemy, there is very little if at all any realistic signs on the target if it's been hit. It could be anything, be it a moan, blood splatter or at least falling back a bit due to the impact of the bullet, or whatever. But here you only know you've hit an enemy when they die, apparently. This just makes no sense because ... seriously no human can endure getting shot without a wince and still keep shooting until they're down. That's just ridiculous.  Not a very good FPS overall to me personally. I don't know much about this genre, but certainly there are things that the Call of Duty series has been doing way better than this game even since its first installment.",
            "review_score": "-1"
        },
        {
            "review_text": "Broken, says I need 'PhysX'",
            "review_score": "-1"
        },
        {
            "review_text": "worst Mouse feeling i`ve ever seen. even after adjust sensitivity in config from 35 to 15 and disable the smooth. Aiming is not fun in this game!!! better get Wolfenstein",
            "review_score": "-1"
        },
        {
            "review_text": "game wasn't all that good to begin with and it won't work on most graphics cards",
            "review_score": "-1"
        },
        {
            "review_text": "  this game is not the best to play",
            "review_score": "-1"
        },
        {
            "review_text": "Step into the boots of Boyd Travers, Private First Class of the “All-American” 82nd Airborne Division, and revolutionize the way the war is fought. From a rocky beginning in Sicily to war winning triumphs in the heart of Germany, fight the epic WWII battles that turned America’s first paratroopers into combat legends. Begin each mission from the air and behind enemy lines, then jump immediately into the action. On the ground, tackle objectives in any order across an expansive, free-roaming environment, using a wide variety of upgradeable weapons to your strategic advantage.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game due the following facts,   - This game has a shotgun. Ka-boom! Chak-Chak! Repeat.  - A good weapon upgrade system with a nice slow-motion effect with every level-up.  - Great cinematic sequences with beutiful maps.  - As in all other Medal of Honor games, fantastic soundtrack.  - Low price, worth every penny.    The only negative thing about this game is that there is a clear feeling through out the game that this game is a typical game made to fit both a PC format but as well a console format (PS3, Xbox).   Still, a good and entertaining game!  ",
            "review_score": "1"
        },
        {
            "review_text": "Was about to uninstall this game and decided to play it one last time..this game is great. Its got some problems and does get old after a while but the concept of parachuting in and completing objectives however you want to is great. The game is a direct port with no graphics settings but it runs at a solid 70 fps for me and looks like the games that i can usually only run at 30 or so (it has bloom, DoF, motion blur, all that good stuff). The lighting is one of my favorite parts as well, on the night maps there are some really beautiful scenes.  Bottom line the game is a lot of fun and looks great but is very short. At $5 though its completely worth it. There's never anybody playing multiplayer anymore but when there was it was a lot of fun, in mission-based multiplayer matches players get to paradrop in to the match which was also awesome. I'd love to see multiplayer become active again..maybe some day..",
            "review_score": "1"
        },
        {
            "review_text": "It's not long as MoH AA, Spearhead or Breakthrough but with the same atmosphere. The graphics is of course way batter. The Gameplay itself is very interesting: if you are killed you drop as reinforcement and you have to push the enemies spawn point. I don't like it at first time but than find out it's brilliant.  Even if you just finish the game you can play it again and again and it will not bore you ...",
            "review_score": "1"
        },
        {
            "review_text": "I was unpleasantly dissatisfied by combat mechanics, aim and hitboxes in this game. Id recommend different FPS game from WW setting.",
            "review_score": "-1"
        },
        {
            "review_text": "Why must i download a Physx? And i can't find it. Can someone tell me what to look for?",
            "review_score": "1"
        },
        {
            "review_text": "it took me ~5 hours to finish the game on normal difficulity and it's shorter than medal of honor vanguard on PS2. i like this new concept, play as an airborne, drop anywhere you like, leveling your weapons, killing badass super soldier nazi carrying MG42. the soundtrack is awesome, if you play previous medal of honor games it would sound familiar. also the extras would keep you entertain like they did on previous medal of honor. too bad i couldn't found someone who play multiplayer. this is one of greatest medal of honor games but it's just too short.",
            "review_score": "1"
        },
        {
            "review_text": "This game is right for those who like world war games.",
            "review_score": "1"
        },
        {
            "review_text": "It's a little arcady for a Medal of Honor Game, but is fun to play. The control scheme is horribly awkward and takes plenty of getting used to. The weapon customization is nice, although it'd be nice if you could customize it yourself and pick attachements rather than level a weapon up and be stuck with it. It is fun to play and intense, though.  7/10 would get frustrated with the controls again.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best WWII shooters I have ever played! Smooth graphics, not a ton of gore and crap, admirable representation of WWII (especially the taking of the bridge at Nijmagen), and the story, better than most CoDs. Highly recommend!  ░░░░░░███████ ]▄▄▄▄▄▄▄▄▃  ▂▄▅█████████▅▄▃▂  I███████████████████].  ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤",
            "review_score": "1"
        },
        {
            "review_text": "You can upgrade your guns in this game and its not as linear as the other Medal of Honor games. The maps are really open and you can do a lot of objectives in your own order. Only downside to this game is that you need to install PhysX ro run it and its rly hard.",
            "review_score": "1"
        },
        {
            "review_text": "enough bugs to make you laugh  get for the comedy 6/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game! it seems to easy to run and I always know what to do. I like the way the game continues after you die and It takes me back to my ps2 I seriously recommend getting this game to anyone whos looking for a good WW2 first person shooter  'WAYYYY better than CoD Ghosts'",
            "review_score": "1"
        },
        {
            "review_text": "Great classic it has its ups and downs but it brings back memorys of the good ole days.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Pick it up if it's on sale for sure?",
            "review_score": "1"
        },
        {
            "review_text": "The most Fun and realistic FPS I have ever played.But I still wished it had a longer singleplayer but multiplayer IS FUN!!! MY PERSONAL FAVORITE GAME ON PC.A MUST GET GAME.",
            "review_score": "1"
        },
        {
            "review_text": "2014 and these graphics still stand up with 80% of the games out there, Gameplay is amazing. the 'Glitch' that was in MOH: Allied Assault is still present they just incorporated it into the game. Singleplayer isn't that long even on the hardest difficulty but man was it ever fun. As alot of other people stated, this game is VERY underrated. For $2.49 its a steal.",
            "review_score": "1"
        },
        {
            "review_text": "Hours and hours of gameplay that will knock your socks off, loads of WWII-era weapons, plays on poor hardware like mine, and is great playing at a loud volume, especially when shooting those guns!  Overall I give this game a 9/10, because there is some hassle with loading the game up, since it's a 32-bit only game, so here's a tutorial:  1. Go to launch options for this game in your Steam library and type in 'xadapterd10'. 2. Launch the game. 3. Ctrl+Alt+Delete to the desktop and you will see a message, in which you will click on 'OK'. 4. Go back into the game and it should load up!  Another solution for dedicated graphics users may be to install a certain legacy driver for PhysX, which you can find by looking at one of the many guides on the community hub.  Also keep in mind that the multiplayer is pretty much dead, but hey, the campaign is immersive and fun as hell, so like I said before, I give this game a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is right for those who like world war games.",
            "review_score": "1"
        },
        {
            "review_text": "Why must i download a Physx? And i can't find it. Can someone tell me what to look for?",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game .. gameplay FPs .. like real graphic ..  10/10 for me rate !! ..  so .. i like this game ..good gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Bleedin' yanks! Not one Tommy in this game. It's almost like we were doing the easy stuff.",
            "review_score": "1"
        },
        {
            "review_text": "What a Blast! I grew up with the Medal Of Honor games. After I played this game I have come to terms with myself,This is by far the best WW2 game I have ever played! The graphics are amazing. The sound and music are great.This game is fantastic. When I first bought this game on the 360 years ago I didn't get the chance to play it. Now that i have it on PC I am so happy I got to. I give this game a 10/10 It really feals like your at war. Excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "too many issues starting up frame rate issues,compatibility issues. Should have polished it up before releasing the pc version. Srsly.",
            "review_score": "-1"
        },
        {
            "review_text": "Bit Sized Review  The Good: -WWII levels are varied and have interesting design -'Droping in' Mechanic makes it so you start each level (and each respawn when you die) by parachuting into it where you want to -Level design allows you to take on objectives however you want -Aiming allows you to lean around corners and cover -There are quite a few weapons, and getting kills with them automatically unlocks upgrades -Price is pretty low  The Bad: -Aiming down the sights causes you to stop and aim, takes some getting used to  -Single Player is only 4 hours long -Not a lot of replayability -Multiplayer is almost completely dead -Story line is very boiler plate, not that interesting -Graphics and enemy AI do show their age here   The Verdict: If you want some more WWII shooter action, you can do a lot worst than this. It is not a bad game and on sale it's actually worth the price just to jump in and kill half a day on. I would recommend it when it's on sale since the MP is pretty much dead however.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game, not a great game either. It was a fun ride until finished however. It has a very different game mechanic and need time to get used to. The gameplay feels like an arcade game called Time Crisis where you can hide behind a wall and press a button to peek and shoot. You do have the freedom of movement and pick your own path on which objective to tackle first. I think it is still worth to buy when it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most enjoyable games i've played. rank up the m1911, do it, seriously.",
            "review_score": "1"
        }
    ]
}