{
    "app_id": 24870,
    "name": "Need for Speed: Shift",
    "release_date": "2009-10-06",
    "developer": [
        "Slightly Mad Studios"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Simulation",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 1101,
    "negative_ratings": 415,
    "price": 9.99,
    "description": "Need for Speed™ SHIFT is an award-winning authentic racing game that combines the true driver’s experience with real-world physics, pixel-perfect car models, and a wide range of authentic race tracks. Need for Speed SHIFT takes players in a different direction to create a simulation experience that replicates the true feeling of driving...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/24870/header.jpg?t=1447352537",
    "minimum_requirements": "OS: Windows XP (Service Pack 3) / Windows Vista (Service Pack 2) / Windows 7 Processor: 1.6GHz Intel Core2 or faster/AMD X2 3800+ or faster Memory: (Windows XP) 1 GB RAM; (Windows Vista/Windows 7) 1.5 GB RAM Graphics: 256 MB Video Card, with support for Pixel Shader 3.0* DirectX®: DirectX 9.0c compatible Hard Drive: 6 GB Sound: DirectX 9.0c compatible Controller Support: USB Steering Wheel/Dual Analog Gamepad Online Multiplayer: 512 Kbps or faster; 2-8 players INTERNET CONNECTION, ONLINE AUTHENTICATION AND ACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO PLAY. TO ACCESS ONLINE FEATURES, YOU MUST REGISTER ONLINE. ONLY ONE REGISTRATION IS AVAILABLE PER GAME. EA ONLINE TERMS &amp; CONDITIONS AND FEATURE UPDATES CAN BE FOUND AT <a href=\"https://steamcommunity.com/linkfilter/?url=http://WWW.EA.COM\" target=\"_blank\" rel=\"noopener\"  >WWW.EA.COM. YOU MUST BE 13+ TO REGISTER WITH EA ONLINE. EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON <a href=\"https://steamcommunity.com/linkfilter/?url=http://WWW.EA.COM\" target=\"_blank\" rel=\"noopener\"  >WWW.EA.COM.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " A Need for Speed game set on circuits rather than streets.   Need for Speed: Shift is a somewhat okay racing game, aimed mostly at the people who prefer sitting back with a controller just driving some fast cars around fast tracks with all assists turned on. I can imagine it does a pretty good job at that.  But if you jump into it expecting something more, you are in for a big disappointment. I would not even go as far as calling it a mix of an arcade and a simulator, simply because it is a pure arcade which stays true to the Need for Speed name. The game revolves around ramming into each other, the AI is bad and so are the physics, the controls are poor all the way from the menu to the game itself and the unnecessary blurry speed effects and the deep voice-over about how you are a 'totally cool driver now' do not really save this title - only make it feel more cringeworthy.  Now, I am not trying to make it look as bad as possible. The game is all good as an arcade, is nice to look at, there is a lot of cars to pick from and you can even customise them to a certain degree. And obviously, I would be stupid to expect realism from a Need for Speed title. I just do not think it deserves to be promoted as a simulation experience - and it is, as of now, being promoted as a simulation experience.",
            "review_score": "1"
        },
        {
            "review_text": "nice game. nice griphics, LOTS of cars, lots of tracks, nice effects... I like this game  there are some annoying UI things, annoying 'intros' but that is minor.  I have some problems with drifting (at G25 wheel) which was easier on keyboard.  thing is, dont believe people that this is simulation. it is not. it is not complete arcade, but hey, I can easily hoon McLaren F1 on nurburgring on PRO settings (no driving aids) without crashing and spinning in each corner. and that is why this is not simulation...",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite racing games",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why they call it shift, I can't figure out how to get a car with standard transmission.",
            "review_score": "1"
        },
        {
            "review_text": "Best Need for speed game out there, excluding of course the good old days of Hot Pursuit 2, Carbon etc. Great combination of sim and arcade, buy this over SHIFT 2 if you have the choice!",
            "review_score": "1"
        },
        {
            "review_text": "Better than GT 5.",
            "review_score": "1"
        },
        {
            "review_text": "Nice racing game",
            "review_score": "1"
        },
        {
            "review_text": "i have play 100's of racing games and most pale in comparison to NFS shift ",
            "review_score": "1"
        },
        {
            "review_text": "I've never been a fan of racing games in my earlier life, and NfS: Shift is probably the only game that I instantly liked when I first played it.  The only true way to 'fully play' this game is to put all of the difficulty sliders on the simulation dificulty. Only then, you'll find out how rewarding racing a car can be. Especially since it is really difficult to keep it stable at high speeds and in tight turns.  The graphics in this game are clean and sharp. Textures could be better, though car detail is ample and greatly refined. Interior cockpit view is also done admirably. The sound feels too fake at times. Especially when you have games like DiRT 2 and 3, that use a sound system that is near indistinguishable from the real thing.  A good game, excellent for drinking games and arcade race players. Drive one round, whenever you miss a turn and spin out, you ♥♥♥♥ing chug.",
            "review_score": "1"
        },
        {
            "review_text": "The race. the driving, Fun Fun Fun!  ...but the menu interface is very annoying, why couldn't they make it all mouse accessible?  ",
            "review_score": "1"
        },
        {
            "review_text": "Let me review this game while it's still fresh in my mind. After 29 hours, I finished the game. Granted - I'm missing about 10 stars out of 1125 or something, but the requirements for those stars are so arbitrary, I'm not even going to bother.  Graphics: 4/5 Sound: 5/5 AI: 2/5 Replayability: 2/5 Online: 0/5 Soundtrack: -20/5  This game has its highs and lows. I will say that the interior views for the cars are amazing - NFS: Shift is the only game I've played that featured a cockpit view of the AE86, which not even Polyphony Digital (makers of Gran Turismo) could not do. Aside from the cool interiors, decent HUD effects, and sound, the game is not really all that great.  The AI is absolute trash, and WILL ram you on turn one of any track. The thing that disgusted me the most was the gratuitous use of rubberbanding, which only activated once the AI realizes you have a good chance of passing them.  The in-race missions are okay, except for the ones that require you to spin out/tap out an opponent. As a racing game veteran, there is nothing that I hate more than dirty racing, and this game requires you to smash opponents for stars in certain races. To add insult to injury, when you DO attempt to smash the enemies, you might as well be crashing your car into a wall, because pit maneuvers and other various tactics do not work, and instead will spin you out.  Sometimes, races require you to perform clean laps as a mission. This is extremely do-able on tracks with more than one lap. This is NOT do-able on Nurburgring. Because of Nurb's narrow track, and the AI's awful racing line, you will either be hit, or you will hit someone. If you try to race clean, you will never make it into first. That was another mission I did not bother doing.  Online was non-existent. I selected quick match at peak online gaming hours (10pm EST - 2am EST) and did not find a single match. The game still gave me the option to create a match, and I could post my leaderboard stats online, so I arrived at the conclusion that the servers are up, but nobody plays this online.  I completed this game because I enjoyed NFS as a kid. If I had to rank it out of games that I've played out of the franchise, I'd rank it NFSU2 &gt; Pro Street &gt; Shift &gt; NFSU1.  I picked this game up for $5 because it was on sale, and I think that is the only circumstance that you as the reader should pick this up. This game is NOT worth $20.  The soundtrack is ridiculously ♥♥♥♥ too. I just played the game with my Eurobeat collection running in the background.",
            "review_score": "1"
        },
        {
            "review_text": "The best racing game ever",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good realistic track game. Although its becoming a bit outdated.",
            "review_score": "1"
        },
        {
            "review_text": "very good very fast but easy to get into it and play all the time good look who ever plays this",
            "review_score": "1"
        },
        {
            "review_text": "It's almost 5 years old and is still better than alot of modern titles.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Good balance with the custumizable options. Kids love it too.",
            "review_score": "1"
        },
        {
            "review_text": "great game cool with steering wheel",
            "review_score": "1"
        },
        {
            "review_text": "Great racing game. It takes some practice, but it seems anyone can get a hang of handling their vehicle quite quick. As well I like the control you have over your car visually and as well how it's tuned, unlike NFS Hot Persuit (2010).  However there are only two downsides. I've found that there were a few senarios that the menu was forcing me to either continue playing, or else force the game shut. Yet one problem that is game breaking is if the window is no longer in focus, it will crash.  It's a great game in general and a fun one to play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Great game good graphics need steeringwheel and shift pedals and i will play hundred of hours drifting my manual car around the track",
            "review_score": "1"
        },
        {
            "review_text": "Another good simulator from NFS series, this time its mostly track racing, but also drifts, time attacks etc. But, still good game. Experience system awards you with levels, new cars, money and events, along with different decorations for your cars. Also, levels give garage space. if you like simulation games, you won't regret buying this!",
            "review_score": "1"
        },
        {
            "review_text": "Good. I don't play many racing games but I like to have one just for every now and then.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome graphics, amazing preformance.",
            "review_score": "1"
        },
        {
            "review_text": "Great driving mechanics, the cars look great and the ai doesn't feel like it took 2 minutes to code!",
            "review_score": "1"
        },
        {
            "review_text": "The benchmark when it comes to racing games.",
            "review_score": "1"
        },
        {
            "review_text": "Some of the worst physics I have ever experienced in a racing game. The series turned to garbage as soon as EA turned it over to new developers. There are much better racing games available for the same price or less.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun to play. If you actually get to play it that is. Started crashing like a piece of ♥♥♥♥ in mid-July 2015. I don't know what it's related to but I can't load up any race.",
            "review_score": "-1"
        },
        {
            "review_text": "Hate it the cars drive like tanks on ice. Slow and you slide all over. The perception of speed it extremely off. The cars look like they are going 20mph when the speedometer says 150 you approach the corner at what you think is very slow and completely slide out of it with the feeling that the steering wheel is doing nothing at all. The only way to win a race is to go really slow and super careful. A racing game should be exhilarating, fun, and challenging. Not slow, boring, and challenging. DO NOT BUY!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This is the only Need For Speed game I've played that I didn't care for, and I've been following the franchise since the days it released on 3DO! 1994, was it? Anyway, this feels as far from NFS as it can possibly get. Sure, it's an ok game, but the NFS standard has been raised so high for it to be dropped on its head like this.  Maybe it was better back in the day, but it pales in comparison with other NFS titles, mainly NFS: Hot Pursuit (whether you're talking about the new one from 2010, or the older one, NFS3:HP from 1998). The handling of the cars is atrocious, and other reviewers have done a far better job of explaining its shortcomings than I ever could, but steering sucks, acceleration sucks (AI can always accelerate faster than you even when you're in the same cars, and they can always corner better than you can by supplanting the physics of the game and taking curves without sliding; you aren't allowed to do that though!). Touch the steering wheel at the wrong time and you spin out. Run off the track for more than a second, and you get a warning and your time doesn't count. Run off the track too many times, and it's race over for you! Come to a complete stop and then wait about 5 seconds for the game to register that you can drive again. Hate a particular trial? Too bad, you have to master it to continue. Forget overtaking your opponent on most of the time trials...unless you get in front of him somehow in the first turn, he's gone and you can never catch up; you have to get right in front of him and stay there, blocking him from passing the whole time. Not fun!!  The unacceptable cons of this game make it unenjoyable to me. Pair that with racetrack only driving and it's not enough to keep me interested.  Sorry to say this is my least favorite NFS game I've ever played, and I have played most of them with the exception of maybe Undercover, Rivals, World, and The Run. It never offers anything fun and exciting, just frustration and more frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "this game SUCKS!!",
            "review_score": "-1"
        },
        {
            "review_text": "this game reminds me off old crappy corn bread",
            "review_score": "-1"
        },
        {
            "review_text": "Unless you have a gaming pad, or a steering wheel you simply can't play this game. But even with, the game is insanely hard to control.  This game is completely unplayable. On a totally reasonable machine the frame rate is awful. The steering takes forever to respond so you fishtail off the track constantly. And the worst part is, you can't skip any cut scenes and you cant modify graphic settings or control settings in game, and there's only career mode when you start. so you have to watch all the cutscenes (which bug out and play 2 to 3 times in a row) at the begining of the career, find out the controls are still impossible, and then you can't even quit back to the menu, so you have to force quit and restart to change your settings. and being an EA game they make you watch their stupid logo every single time you turn the game on and warnings about driving. I've done the first and second race a bunch of times now and i can't find a way to even control the game.   I've owned hundreds of games in my life, dozens of racers, and Ive never been more ♥♥♥♥♥♥ that a company has the audacity to sell this.",
            "review_score": "-1"
        },
        {
            "review_text": "This is probrobly the.... WORST GAME I HAVE EVER PLAYED! 1.the game dose not run well. And I have a preatty powerful computer. 2.the loading video never ends. 3. set settings to lowest dose not run. I bought this game on sale for 4.99 USD it is not even worth that. much less 19.99 USD",
            "review_score": "-1"
        },
        {
            "review_text": "I never thought I can be such a badass........Driver...And by badass i mean terrible. I crash into walls every 5 seconds.",
            "review_score": "-1"
        },
        {
            "review_text": "Ea published it so nope",
            "review_score": "-1"
        },
        {
            "review_text": "I just deleted this game and I regret buying this. The driving mechanics sucks a lot. Like the other guy said, the car is like a tank and the road is pure ice. When you are 150KPH it seems like 40KPH... WTF. If you are thinking about buying this game, play some demo or take a better look to prevent frustration. Geez, this game suckssssss................",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother with this get Shift 2 or most wanted.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game if you have a Nvidia GT750M. The game does not work and crashes on start up. Even after clean intall of GPU drivers and re-installation of the game still no avai.",
            "review_score": "-1"
        }
    ]
}