{
    "app_id": 249130,
    "name": "LEGO® Marvel™ Super Heroes",
    "release_date": "2013-11-15",
    "developer": [
        "Traveller's Tales"
    ],
    "publisher": [
        "Warner Bros. Interactive Entertainment",
        "Feral Interactive (Mac)"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "LEGO",
        "Open World",
        "Superhero"
    ],
    "achievements": 45,
    "positive_ratings": 8797,
    "negative_ratings": 691,
    "price": 14.99,
    "description": "LEGO® Marvel™ Super Heroes features an original story crossing the entire Marvel Universe. Players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249130/header.jpg?t=1462222851",
    "minimum_requirements": "OS: Windows®XP SP3, Windows Vista/7/8 with latest service packs and updates installed Processor: AMD Athlon 64 X2 EE 3800+ (2*2000 Mhz) or similar Intel CPU, such as Intel Pentium Dual Core E2180 (2*2000 Mhz) Memory: 2 GB RAM Graphics: NVIDIA GeForce 7600 GS or ATI Radeon X1950 Pro or better DirectX: Version 10 Network: Broadband Internet connection Storage: 7 GB available space",
    "recommended_requirements": "OS: Windows XP/Vista/7/8 Processor: AMD or Intel Quad Core running at 4*2600 Mhz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 480 or ATI Radeon HD 5850 or better DirectX: Version 11 Network: Broadband Internet connection Storage: 8 GB available space",
    "reviews": [
        {
            "review_text": "It's a Lego game, not a kid's game. Legos are for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "LEGO games are simply amusing.   They always seem to turn a franchise into a complete LEGO themepark, and this game's no exception.  And as usual with the LEGO games, they add a little slapstick in the cutscenes to keep it fun.  Really made for the lighthearted entertainment.  They did quite a nice job on getting the whole Marvel thing in.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: Contains very minor spoilers. And chimichangas.  There's a reason LEGO Marvel Super Heroes is one of the highest-selling LEGO video games of all time; actually, three reasons.  First, the characters. The game features not only the existing Avengers, X-Men and Ultimate Spider-Man LEGOs on the market, but a legion of characters and vehicles either only recently released in 2014 or not even created yet. From the Fantastic Four to the Sinister Six, this game includes the majority of Marvel's well-known characters along with a handful of lesser-known ones. Plus they've included the legendary Stan Lee himself as a playable character possessing multiple superpowers. What more do you need from this game?  Speaking of characters, the next reason is what the minifigures take part in: the story. You can tell the writers and game designers had fun trying to combine a coherent Marvel storyline with the quirky humor found in every other LEGO game. And you know what? They did it. The story features the Avengers, Fantastic Four and X-Men teaming up against villains like Magneto, Doc Ock, Doctor Doom, Loki, Abomination and Sandman, in an epic quest filled with crazy left turns that only a LEGO video game could have. And it all leads up to a stunning twist you'll never expect (so I won't ruin it for those who haven't played yet).  Finally, the gameplay. I was very pleasantly surprised just from playing a free PC demo of the game which was released online early last year, featuring the game's very first level, Sand Central Station. This level features Iron Man (Mark 6), the Hulk and Spider-Man taking on Abomination and Sandman in New York's Grand Central Station. But what blew me away the most during the level was the sheer number of abilities each character had, from Hulk's famous Puny God move from The Avengers, to Spider-Man's ability to actually swing around on a web. When I finally bought the actual game, I was thrilled to discover that the rest of the characters in the game were just as incredible.  So, if you're skeptical about buying this game, I suggest you try out the demo featured on  marvelsuperheroes.lego.com  first, and if you still don't feel like buying the game, then at least you technically tried it for free. But based on my personal experience, I think all of your doubts will go away and you'll want to buy LEGO Marvel Super Heroes right away.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  + Awesome Storyline + Extremely Awesome Graphic + Lots of playable Heroes including Villians + Cut-scenes, lots of different Challenges only to be completed by certain Heroes + Inclusive of Side Missions + Able to Customize Heroes + DEADPOOL'S OWN ROOM  Cons: - Short Story (Can be completed in 10-12 hours) - Limited Customizations  Overall: A great combination of Marvel and Lego. Recommended for ALL.  Rate: 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Video games, comic books and LEGO bricks.  LEGO Marvel Super Heroes  is an incredible game for both LEGO- and comicfans.  The Good: · A fun story that stays true to the Marvel universe. · Countless characters like Spider-Man, the Hulk, Thor, Captain America... Basically any Marvel character you can or can't think of. (Even Stan Lee. Hell yes.) · An open world with tons of side activities, collectable Bricks and breakable LEGO constructions. · A wide variety of character types that offer for great replayability. Sometimes you will need to replay a level with heroes you have unlocked later on to reach secret areas and so on. For example: Captain America's shield to walk over flames, the Hulk's force to break weak walls, moving metal object with Magneto, and so on. · Plenty of fun references to the Marvel movies.  The Bad: · No online co-op, only a local split screen option (that doesn't always respond all to well, unfortunately). · The game basically requires a controller to play. You can play with the keyboard just fine but there are no mouse controls, which takes away some of the experience. It's not especially a downside, but I thought I'd list it so you know what you're up against if you don't have a controller.  The Ugly: · For a LEGO game it's absolutely stunning. Gorgeous lighting effects, fun animations, amazing voice-actors... It's a LEGO game to be proud of.  Final Verdict: An amazing game for both casual gamers, LEGO-lovers and comicbook fanatics like myself. A game every Marvel fan has to own. 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Don't see this as a kids game. It's much more and much better then that.",
            "review_score": "1"
        },
        {
            "review_text": "The most extensive and complete LEGO game I have ever played. 136 playable characters from the Marvel universe. Plus, Deadpool shows up in every level, and also has his own side missions. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The open world is a bit bland, but has secrets and things to do. The missions is a bit hard than other LEGO games. Overall I think this is a great title, because the exploration, carjacking and variety of heroes. Thump up! :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is Marvellous.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely delightful gem of a game, even among all the various LEGO games out and around. I would have to say that despite a lack of movie music and voices, the game is still brilliant. The one and only downside to this is the somewhat problematic flying controls, especially if you're in a race - then it can become a little frustrating.  That aside, this game is absolutely awesome. Incredibly fun abilities (super strength), attacks, powers, and travelling (especially web-slinging) and a reasonably interesting plot, with an extra dose of both comic and movie references make this something to be savored, especially by fan of Marvel comics - it's not just the Avengers that make an appearance here, there's also the X-Men, the Fantastic Four, and of course, a million cameos by Stan Lee, to name a few.  This game is also very funny, with SHIELD incompetence, bad puns, and amusing dialogue in the cut scenes, accompanied by a healthy dose of Deadpool breaking the 4th wall. 100%, anybody? However, probably the best thing about this game to me is the world map - you can freely roam the city of New York (AND THE HELICARRIER), completing extra quests and acquiring extra characters and vehicles.  Definitely worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "I kicked old people out of their car.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun, I didn't know anything about Marvel before playing this but I'm slowly learning. It's quite unique as well because it's an open world game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Everything that everyone wants the MCU to be, but never will.  For Marvel fans, for Lego game fans. Hours of Marvel Lego Shenanigans.",
            "review_score": "1"
        },
        {
            "review_text": "What i love about lego game series is local co-op, this game is fun to play with friends and family. Nice graphic+fun gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for any Marvel or Lego (or both!) fan. The story is interesting, it's full of humour, standard lego-game-mechanics etc. Aimed at children, I think, but adults can have a lot of fun with it as well.",
            "review_score": "1"
        },
        {
            "review_text": "VERY good game. Especially like the free roam. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun to the very core of the simple gameplay mechanics that make lego games LEGO games. It is all about exploring the surrounding areas , unlocking new characters and most importantly , SMASH ! The length of them game is decent and has quite a decent story too . Most of the time will actually be spent in exploring the places and unlocking stuffs . If you are a MARVEL fan , get it . If you are a LEGO fan , get it . If you simply like smashing things or exploring , GET IT !",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun to the very core of the simple gameplay mechanics that make lego games LEGO games. It is all about exploring the surrounding areas , unlocking new characters and most importantly , SMASH ! The length of them game is decent and has quite a decent story too . Most of the time will actually be spent in exploring the places and unlocking stuffs . If you are a MARVEL fan , get it . If you are a LEGO fan , get it . If you simply like smashing things or exploring , GET IT !",
            "review_score": "1"
        },
        {
            "review_text": "Aww.. yeah, this game are so much Fun and more Fun if you play with your friend (Girlfriend if you have) using Joystick But, If you play alone using Keyboard. This a Big disaster, the controller are so Awful and your AI Friend are just watching you   7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun. Absolutely love it. So much to do, a huge character selection. Puzzles are childish, but it is a childs game, light hearted blast over all",
            "review_score": "1"
        },
        {
            "review_text": "Marvel fan? [☑] LEGO fan? [☑] Own this game? ☐ ... &lt;-- Wait. Why in hell isn't this filled out if you're even thinking about this? Check this box off immediately. This game is absolutely epic. It's a Marvel fan's dream game and it's made even better by the creativity that LEGO brings. This is a _must_ own game. Extremely fun for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game its a must have",
            "review_score": "1"
        },
        {
            "review_text": "What an absolutely wonderful game. For anyone who has ever played the Lego games before, this is a giant step up, particularly if you haven't played since the early games like I have. They added voice acting, open world, more detail, just everything.  The amount of characters you can unlock is staggering, and they even group characters that are the same. So the variants of Iron Man are all in one rotating selection rather than separate characters themselves to pad out the character list that's already enormous. The open world of New York is amazingly fun to go through, and the game gives you many ways to go about it. The voice acting is top notch, they even managed to get Clark Gregg to reprise his role as Coulson, although having James Arnold Taylor as Spiderman was a bit offputting at first, kept seeing Ratchet instead of Spiderman.  New York has many side-quests for you to do to unlock new characters, vehicles, and Gold Bricks, many of which require you to get new powers to obtain them so you can't get them all in one go. The streets are littered with attention, constant amounts of Studs placed around for you to pick up, with each area having completely different patterns and placements so no two buildings are the same. Really appreciate the time the folks who placed those put into it. You can hijack cars, although they're much slower than any form of transportation you already have, and drive into other cars, drive like a maniac, etc. But since it's a Lego game the characters don't break apart, they mainly just fall down and yell at you to watch where you're going.  Side-quests by themselves are pretty standard, either you go pick something up, fight a wave of enemies, escort someone through the open streets, or race someone. The best part of them is honestly the starting and ending comments the characters make, and that makes up for the monotony of the whole thing.  The writing is great, tons of jokes for kids, tons of jokes for comic fans, tons of jokes for adults, tons of everything for everyone to enjoy. The writing is also really aided by the silly things characters do in the background, like The Hulk sweeping things, or Coulson making jumps to save things Fury threw away, etc. SDeadpool can get to be pretty annoying, but I understand that's his entire thing, so I can deal with it, while Spiderman can be annoying at the start but ends up being enjoyable. Iron Man/Tony Stark is by far my favorite character along with The Thing, they both were great.  The story levels are very enjoyable from a writing standpoint. It's really nice to hear the silly banter between characters and see them in the cutscenes. The levels feel alright, they're basically just 'Find a way to get this guy over here so you can get him to open something up for the other guy to open up' over and over without much change throughout the entire game.  Regarding gameplay, the fighting is the same as it always has been, mashing X to win, although the bosses seem to be way draw out this time. All bosses amount to spending ages waiting to hit them for one damage on their 3-6 heart health bar and then they fly away for a while and taunt you while sending a bunch of mooks your way. There's really no penalty at all for dying, you basically just lose 1,000 Studs which is absolutely nothing even from the start, and there's Extras to increase your four hearts to five as well. The actual use of the characters is fantastic though, any characters with flight, particularly Iron Man, are a joy to use pretty much anywhere and especially in the overworld. You get to go super fast and doing things like falling to the ground and boosting straight through the street never gets old.   Now, the game does have its own share of problems. The draw distance is very poor, you will see stuff in terribly low resolutions on anything pretty much two buildings away even on high. The top of the Empire State Building has its spire and the 'fins'(Pardon me, don't know the exact name of those things) in some horribly low quality even when you're standing right next to it. In certain Free Play levels(5 for me) you can get stuck in elevators during area transitions, so you can't progress anymore because one character gets stuck in an infinite death loop and you can't switch or get them out in any way. Save and Quit sometimes fixes it, but not guaranteed. Help messages are a constant if you put subtitles on. They will never go away, they will always show up, even when you've beaten the game unless you turn off the subtitles. Getting stuck in items is very common, I would get stuck in boxes, walls, or sink into the floor at times which would require to either switch to another character and then wait a few seconds for the AI to teleport to me, or save and quit to fix it. The driving is completely awful, you turn so sharply that it's hard to control things and get caught up on the slightest of ledges in certain vehicles which makes the racing missing just that much harder. The AI pathing is awful. If you don't give the character an Iron Man(Or sometimes, even when you do) they will end up running into a corner for eternity because they can't get out. This is especially bad when they're Spiderman-type characters because they will get in a 'Jump on wall --&gt; Fall down --&gt; Run at wall --&gt; Repeat' pattern.   All in all, this is a wonderful game. It's extremely charming, appeals to pretty much everyone, and even though it's quite easy and repetitive it knows how to hit all the sweet spots, whether you're a comic book fan or not. You also owe it to yourself to try out Iron Man at least once, flying as him is amazing and done perfectly.",
            "review_score": "1"
        },
        {
            "review_text": "I literally spent like $30AUD on this game like a week ago an now it's less than $10.. lol.   Pretty cool game though so definitely worth $5 USD! Geez... I wish I waited lol.",
            "review_score": "1"
        },
        {
            "review_text": "It's a hard on pc but it ok. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Do you like marvel??????? IF YES THEN BUY!  you dont have to be a little kid to enjoy! you dont have to like legos but... you do have to like marvel (kinda)  I've played this game a good bit and here is my conclusion:  PROS 1: great story AND voice acting (not all actors from movies) :( 2: ALOT OF HEROES AND VILLIANS!!! 3: Open world (yes, hijacking cars is here) 4: VEHICALS, Jets choppers, cars, trucks, bikes and more! 5: unique boss battles (it seems this game is not a button masher when it comes to bosses) 6: puzzles (not all original) 7: All characteers FEEL like THAT character (no bs characters, iron man flyes, hulk throws cars, ect.) 8:beutiful looking world (in my opinion) 9: easy studs  CONS 1: sometimes levels are repetitive (barely) 2: some puzzles can be frustrating ( &gt;:0 ) 3: cars are tooo freakin SLOW 4: characters cant climb buildings (unless you fly)  Other than that the game is 100 % GOOD! ",
            "review_score": "1"
        },
        {
            "review_text": "If you like the previous LEGO Franchise Tie-Ins, You'll like this one too! If you haven't then WTF have you been doing with your life!?  The LEGO games have easy gameplay (Great for kids) and some funny humor. Even though the gameplay is easy it's still super fun.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of my favorite Lego games. It doesn't follow any pre-existing story and that makes it a lot more interesting, plus the wide variety of characters available is great as well. I have yet to find anything disappointing or glitches within this game..",
            "review_score": "1"
        },
        {
            "review_text": "Very good game for one to two players",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! Of all the LEGO games, I have enjoyed this one the most. The ability to fly around the world helps stop things being too tedious, and there was a good amount of humour mixed in to keep things fun and interesting.",
            "review_score": "1"
        },
        {
            "review_text": "my love for lego marvel superheroes is almost as strong as my belief that george w bush did 9/11",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so much fun to play with all the superheros but iron mans voice annoys me",
            "review_score": "1"
        },
        {
            "review_text": "Pros:   - Open world - Wide range of characters with unique characteristics and skills. - Details like, Spider-Man suspending himself upside down with a web-sling when you stop moving. - After beating the main storyline there is still 20+ hours of exploration, unlocking new characters and challenges to do.Tip: avoid any challenge/mission/etc. that involves flying. - Playing with friends made the game even better.    Cons:  - My fav. mutant is not included: Nightcrawler also Quicksilver, X-23,Kitty Pryde and Rogue.That makes me sad :'( - Game crashed: 3-4 times during story mode, 5-6 times during the Dormammu mission and never crashed during free play. - Got stuck with Hulk and Thing a few times and had to restart the mission. - Flying controls are horrible.I tried a few of these flying challenges and everytime I wanted to throw my controller across the room.   I got frustrated a few times but in the end Lego Marvel Super Heroes is a great game and I've enjoyed almost every second (Frigging flying races/challenges/whatever) I've spent playing.I recommend buying it and if it's on sale I HIGHLY recommend buying it.  I'm sorry for my poor English.",
            "review_score": "1"
        },
        {
            "review_text": "This was a change of pace from the more recent games of the Lego franchise, it almost had that old nostalgic feel of being able to explore in story mode and find secrets and or minikits, if you were willing to spend the time to do that rather than being locked into the linear progression of the actual story. I must say I did enjoy it, I've always like the large hubs to explore this game is one of my favorites for that reason alone. The amount of characters is always growing for sure but the character customizer has lost the fun it used to have. Seems like Lego Star Wars the Complete Saga had way more customizing choices than this. But for the most part if you like Lego games you'll probably enjoy this one. I give it a (8 out of 10). I'm looking forward to playing Lego Age of Ultron for sure!",
            "review_score": "1"
        },
        {
            "review_text": "Best Marvel game I've ever played. There are so many characters and the game is so much fun. If you love Marvel Super Heroes you will NOT be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Best LEGO game by far. Massive hub world, tons to do, loads of characters. Fun for kids and adults. Plus, there are some references in there I particularly enjoyed that you will get if you watch a lot of movies. Definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't got to far in the game but I think it is tthe best lego game ever! The controls are different from other games and more difficult to master but it really doesn't take away from the gameplay.  Rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "One Word...Amazing!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, on par with the rest of the LEGO series. Good for kids, has the humor you'd expect.",
            "review_score": "1"
        },
        {
            "review_text": "fun game. if you liked lego star wars, you'll like this. a tiny bit buggy, but eh, still very good.",
            "review_score": "1"
        },
        {
            "review_text": "A ton of fun if you looking for just something thats fun, and not stressfull. Both myself, and my son have a copy of this game, and he has already racked up 37 hours playing it. Not sure how many hours Ive spent, but let me tell you... Its more fun that I though it would be. I hope they make another game like this.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly find this game fun. Sure its childish but the gameplay is fine. Its fine to play as iron man and stuff and although the story is childish its fun and thats all that matters",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "A decent, silly game that would only be better if the flying controls were usable.",
            "review_score": "1"
        },
        {
            "review_text": "Surprsingly good fun, been playing co-op with the nephew and it can be a blast but it's very simple. It is nice to see ALL of the Marvel Universe mingling as one.",
            "review_score": "1"
        },
        {
            "review_text": "amazing bu please add more dlc maybe like guardians of the galaxy,it would be great if the next open world lego game should be like lego gta",
            "review_score": "1"
        },
        {
            "review_text": "So far, the best LEGO game in the series. The open world is the best out of all the worlds. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "ABSOLUTELY LOVE THIS GAME!!!!! Combines two of my favourite things, and then makes it into a video game. Heaven. At times it can be frustatring when Cap. America shield wont go where you want it, and when Iron Man just blocks the camera, but all in all a great game:)",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed the game, as a lego and a marvel fan this game was perfect for me. There are problems with the flying being not very good and some of the map icons for stan lee being covered by other icons, appart from these tiny errors I found this game one of the most enjoyable lego game I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest Lego game around.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun. Recommend using a controller though as flying and driving can be a ♥♥♥♥♥ without one.",
            "review_score": "1"
        },
        {
            "review_text": "These LEGO games are actually pretty fun. They can be quite hilarious when playing co-op.",
            "review_score": "1"
        },
        {
            "review_text": "I!  AM BETA RAY BILL! ⚡️🔨⚡️",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most fun thing ever. You can make a superhero and call him Dickblast and have him save the world",
            "review_score": "1"
        },
        {
            "review_text": "The best LEGO game to come out of Traveller's Tales yet, the sandbox mechanic here works better here than in any of the previous LEGO games, with their version of New York City small enough to be engaging (unlike LEGO Lord of the Rings' unwieldy Middle-earth).  The inclusion of both famous and lesser-known Marvel characters (Howard the Duck, anyone?) always manages to bring a smile, and the attention to detail in the way the characters behave only adds to the enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "Not without its flaws, but still does a great job of selling the superhero power fantasy, and has plenty of stuff to collect and do. I was disappointed when I realized that its multiplayer is local only, since that's a strange thing to have on a PC game, but the single player experience was still well worth the price of admission. Combat can get a little samey and the special moves sometimes drag on, but it's still a fun beat 'em up puzzler, the same as I've come to expect from most Lego titles.",
            "review_score": "1"
        },
        {
            "review_text": "Free to explore the entire island of manhattan, which for a lego game is amazing. The gameplay is just what i remember from lego star wars when I played it on the playstation 2. Epic characters, and a much more in depth story than i remember the lego games having. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "For those who grew up with the Marvel Comics, this game will bring back some memories ",
            "review_score": "1"
        },
        {
            "review_text": "This game is just brilliant :D",
            "review_score": "1"
        },
        {
            "review_text": "great game &amp; funny too..!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I'm a fan of multiple Lego titles, but this is one of my favorites. It is very kid-friendly as it is more intuitive to them what characters to use to perform different tasks. If you want a great game, and one that is good for kids 3 years old and up, then this will not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to let little kids play, because LEGO.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, the best Lego videogame in the series. There's 136 Marvel characters in this game, many with alternate costumes. In-between the story chapters, you have a chance to play around in Manhattan. Here you can use the various heroes and abilities you've unlocked to explore the city, do side-missions, help citizens, and unlock even more heroes and villains. Despite being made out of Lego bricks, most of the environments are pretty impressive. The music is crazy epic for a game featuring Lego characters and would fit in any Marvel film. Finishing the game's story mode is only a tiny fraction of the game. There's a lot to explore and you'll need to collect everything to unlock Deadpool. Set aside some time for Lego Marvel.",
            "review_score": "1"
        },
        {
            "review_text": "GREATEST GAME YET, its like GTA but a lego version less violent, crafty, fun, can play as your favorite super heroes plus can drive, fly a plane or morph into a teapot. you can explore the new york city, get inside the helicarrier, search and unlock characters that you will have fun playing and searching. :) :) :)",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying this Lego game more than any other, except maybe the Star Wars games. I play with my kids and solo. Decent enough story and so many hereos and villans. It has many funny jokes and great game play. I only wish it had online or at least LAN multiplayer, but the same screen is still done well.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, dozens of hours of fun, but the flight system is kinda crappy and the races are almost impossible.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. For the 20 dollar price tag i got 35 hours of play time to complete the game 100%. The camera angles can get really annoying at times but other then that i had no problems with the game at all. If you like marvel then you will really enjoy the character list for this game. It has all the major heros and villans and alot of the lesser known guys like absorbing man and kraven. All in all i would give the game a 9.7 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best LEGO game i played, open world map is just a bonus to all the awesomeness.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I'd get all the achievements in a game. I did not expect that it would be LEGO Marvel Super Heroes. Don't know if proud or filthy casual.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a game I would reccomend, I have not played the whole thing yet but I would definitely reccomend it if you are a Marvel fan.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games since joining Steam, Lego Marvel Super Heros is one of the best lego games in terms of both, story, free play, and its overall design. That is not to say though, that it doesn't have its fair share of problems like every lego game does. While these problems do hinder the gamepaly a bit, they can be overcome with some simple adjustments that I will mention in an upcoming guide. But moving on from that, the story is both based upon the movie franchises continuety and its own, givign the impression that it could be a branch off from said films. It also does something that the films either cannot, or have yet to do, and that is bring in (almost) all of Marvels heros and villains together and no Sony, Fox, or Paramount to stop them from doing so. With that being said, the game mechanics are nice and simple, characters have a unique range of abilities and can speak very truely of their original comic book counterparts. But playing with a friend in two player mode can be a bit tricky if your using an xbox controller and they a keyboard or vice-versa, as whatever keys you've binded to your personal liking will sometimes reset themselves to their default state. A minor nitpick but one that can be fixed by buying another conrtoller or using the default keys. Now as for free play, I will say that there isn't much vaule in it, not like with older lego games such as Star Wars: The Complete Saga and Indian Jones: The Original Adventures, and I feel that this takes away some of the free roaming aspect that I expect in lego games, but at the same time, gives us something new and unique to see. With all that being said, I highly recommend this game to those who are both a fan of Marvel, Lego, and enjoy these games growing up on the Gameboy or who have little ones who've taken an intrest in video games. Despite crashing at times, a few bugs (or should I say ants) and some missing peices, this is a really great game.",
            "review_score": "1"
        },
        {
            "review_text": "this is one of the best lego games ever now let me be completly onest with you this game has its short comings but in all it will give you a fill of acomplish ment and that is hard to say about any game these days im happy for $20.00 its not a bad game at all i so mutch recomind it",
            "review_score": "1"
        },
        {
            "review_text": "It`s a LEGO game what you want of a LEGO game is inside it! And the love to details is briliant.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wondered what our world would look like if Disney owned the film rights to the Fantastic Four, The X-Men, the avengers and Spider-man, then made a film with all of them in it at once? that's what this game is, and it's everything you could possibly hope for, with a dash of deadpool thrown in for seasoning.",
            "review_score": "1"
        },
        {
            "review_text": "This is best game i have played",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun to play with your kids. You get a great deal of playtime for your purchase if you are interested in finding all the collectibles and replaying missions with new powers. My only real complaint is that the flying controls are a little clunky.",
            "review_score": "1"
        },
        {
            "review_text": "All lego games have their similarities, and they're all usually solid, fun and amusing. While this one doesn't have the impressive overworld map of LOTR, it does have solid gameplay, an original, funny and appropriately genre-fitting story and is one of the better lego games out there. For comic fans it's a must, as I have little hope for any other superhero games coming out as good as this, or with the sheer level of variety of characters, all of whom play with their full range of powers: the avengers, fantastic four, spiderman and x-men dominate the main story, with interesting team combinations throughout and a final level where you team up (and so play) Dr Doom and members of the mutant brotherhood and sinister six. In free play the variety is astounding, including a huge range of heroes and villains from the guardians of the galaxy to captain britain. Great fun with the sort of crazy, epic story you wish you could have in non-lego form. A few pet peeves, with slightly awkward flying controls, a rather unhelpful map and a few bugs when attempting side missions but otherwise a solidly built game",
            "review_score": "1"
        },
        {
            "review_text": "Why no on-line Co-op????????? Oh my god just bought two copies for nothing!!!!!!! Did not think to check, I thought that all modern games (especially big franchisees) would have online co-op!!! A massive disappointment! I hope a later update makes this available…. The game looks good…",
            "review_score": "1"
        },
        {
            "review_text": "A really good game I would say.",
            "review_score": "1"
        },
        {
            "review_text": "Great open world concept. Great list of characters all across the marvel universe.",
            "review_score": "1"
        },
        {
            "review_text": "Well this is one of the most amazing games me and my sister play we play it all the time with are friend 'Jimmy' A.K.A 'Black ♥♥♥♥' well he bascially striped for us just to make us play it. This game consist of a small bald man with a barcode on his head, I speculated that he was a male stripper gone rouge and killed his hooker friends, went to CVS and scaned his head. 21/38",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best Lego games I've played.  Pretty wide selection of character/abilities(I know every Lego game does this. It just seems to be a little more so in this case. Also I'm aware that   Iron Man 42 &amp; Beetle   are pretty much OP &amp; make the other characters almost obsolete.)  The vehicles are a welcome addition.   This entry into the Lego series is virtually bug free.(1 or 2 minor issuse, nothing game breaking or overtly annoying.  No suicide inducing jump sections(I'm glaring at you Lego LotR). There is a terribly frustrating RC race though. Traveller's Tales should apologize in advance to the completionists.  The story, visuals &amp; audio are all on par with the Lego games.  My only criticism is: WHY THE EFF HAVE THESE GAMES NOT INTEGRATED ONLINE MULTIPLAYER? This would have been a great one to play with a buddy.",
            "review_score": "1"
        },
        {
            "review_text": "This is the toughest lego game I have ever owned, not only do the levels have hard puzzles but It is quite difficult to collect characters and find in game secrets.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game..",
            "review_score": "1"
        },
        {
            "review_text": "Best Lego game since Lego StarWars outstanding!",
            "review_score": "1"
        },
        {
            "review_text": "Its good.",
            "review_score": "1"
        },
        {
            "review_text": "Good fun, keeps you entertained for quite a few hours, especially if you're a fan of the films",
            "review_score": "1"
        },
        {
            "review_text": "An open-world action-adventure with your favorite superheroes in LEGOLAND :D  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Best Lego game ever. Love that it's open world. If you like and know the Lego games, you should definitely buy this one. You will enjoy it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even like superheroes, much less the cheery Marvel variety and thoroughly enjoy this game. _Almost_ makes me wonder if the LEGO Harry Potter games are any good.  On a technical note, Super Sampling (e.g. Sparse Grid) is necessary to eliminate texture aliasing on shiny surfaces (there are A LOT of these) that may drive you nuts. This is par for the course in LEGO games and being that this is D3D9 it is simple to set this up (on NVIDIA GPUs).",
            "review_score": "1"
        },
        {
            "review_text": "Every time I start this game, my son grabbed the controller from my hand and start roaming New York in Iron Man Lego suit.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Marvel is better than D.C",
            "review_score": "1"
        },
        {
            "review_text": "I picked up this game while on sale and have to say I really enjoyed it. The amount of characters is amazing and while I would prefer more levels that are shorter you can split the levels up into 3 parts. In general this is a fairly good game despite some of the bugs it has.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game to bits, but damnit every single level i seem to find a spot to get my character stuck in!  definitely the best of the lego games i've ever played though. probably because i'm a huge comic nerd so to see all the marvel characters in game - along with stan lee making regular cameo appearances - it's just awesome.  you can play local co-op with 1 gamepad and the keyboard reasonably well, though you'll probably want to remap the keyboard controls.  recommended for all fans of the lego games, and especially all comic book fans who have a sense of humour :)",
            "review_score": "1"
        },
        {
            "review_text": "This is catastrophic, I can notget past the sand man at the Stark builidng level. I play form the pc and the sand man is not throwing sand on the tower to open the way for spiderman to set a web for bruce , as it does under xbox. this is a major bug. txs for your help",
            "review_score": "1"
        },
        {
            "review_text": "BOSS GAME GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "I jumped off the helicarrier as Hulk and Colossus and got caught by a flying robot arm. 10/10 Would glitch mini-Antman again.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever made for couples :) Looking for something to play with girlfriend - this is it :)",
            "review_score": "1"
        },
        {
            "review_text": "Has huge amounts of post game content. Loved it and really worth the time it takes to 100% it",
            "review_score": "1"
        },
        {
            "review_text": "great game , but you when play too long it little bit boring",
            "review_score": "1"
        },
        {
            "review_text": "This game is the exact same as the xbox game. And, it is way more cheeper. This game was on sale and i got this game for 5 bucks. Now that's a good deal.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun Pros+ :Lots of Characters :Comedy :Co-op :Good Set Story :TONS of After Game - Middle= :Reasonable Price, I bought it at $15 which I think is a more reasonable price, but an extra $5 is okay :The Camera Angle :Honestly, the controls arn't that hard to do, my 6 year old cousin can play this game without me telling him how. - Cons- :SO HARD TO GET ALL THE CHARACTERS AND GET ALL THE MONEY",
            "review_score": "1"
        },
        {
            "review_text": "make the game multiplayer, it would be a lot more fun",
            "review_score": "1"
        },
        {
            "review_text": "  It`s perfect GAME!",
            "review_score": "1"
        },
        {
            "review_text": "This game is Awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "Good game. One of the best games ever",
            "review_score": "1"
        },
        {
            "review_text": "Currently can't figure out how to permenantly change my controls when on a Mac. Please message me or comment on this if you know how to on an iMac.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Lego game to date. I love the open world and all of the different characters and abilities.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I've played apt for both casual adult gaming and kid gaming. My kids love this game and I like playing this game with them.   Among all the Lego games, this one is the best. Batman ones are not that good, Hobbit is ok, Lord of the Rings is a bit better.   But nothing really captures the fun and enjoyment as this game. Flying around as Iron Man or webslinging across NYC as Spiderman never gets old. Each char is unique and there's a lot of replayable value.   Great game",
            "review_score": "1"
        },
        {
            "review_text": "Exelsior? I don't know...",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game; way more fun on pc than on console 9.2/10",
            "review_score": "1"
        },
        {
            "review_text": "c'mon dude, it's Lego life without Lego, life not fun !!!",
            "review_score": "1"
        },
        {
            "review_text": "Both the Story mode and the Free Play mode are so much fun but I foumd quite a few bugs, Overall a really great buy at 5 bucks",
            "review_score": "1"
        },
        {
            "review_text": "Sibalant crackling Universe constructed from Fragile attachments.",
            "review_score": "1"
        },
        {
            "review_text": "The fantastic 4 in this game gave me autism 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i love it its relly fun i had fun playing the game i got all the dlc  i gat all of the minifigures got all th cars both boats all the air crafts i had fun doing it",
            "review_score": "1"
        },
        {
            "review_text": "The devs behind the Lego series of PC games clearly know they are on to a winning formula since their games play more or less identically, with only the characters and settings changing for the most part. This is by no means a bad thing since all Lego games contain great gameplay, are challenging without being frustratingly difficult, and have some great humour.  Lego Marvel Super Heroes plays almost identically to Lego Lord of the Rings, where you are constantly travelling from one area to another, completing missions in between each area. This is different to Lego Star Wars where you can choose which missions you do from within a main, central, location. Personally i prefer the Star Wars layout, especially as it can sometimes get confusing as to whether you are in a mission or just travelling to one. Don't for one moment think this is a criticism though, it's a sign that the game is so absorbing that you become lost in it. If i was to criticise this game, it would be that some of the missions are a bit TOO long and either need to be broken up into two, or just be shortened in general.  As with all other Lego games, once you have completed all of the missions in this game you'll find there is still an awful lot left to do, including unlocking more characters, collecting more power bricks, unlocking new features, etc etc. You certainly got a lot of game for your money. While i don't think this is quite as good as Lord of the Rings, and certainly not as good as Star Wars (possibly because i am not such a fan of super hero comics and films), it is still an excellent game and well worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Literally changed my life. Thanks santa claus!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and funny gameplay! Totally worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "Best Lego game I've ever played or owned; definetely worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "İ really like this game it is awesome and needs intellegent and mindstorm (and it is awesome fun to play this).İ really recomend this game!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Very 'LEGO'. Wide variety of Marvel characters to play as and a range of skills/powers to make use of. Totally fun and relaxing time killer. Squirrel Girl is my new guilty pleasure.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game, Loads and loads too do and alot of new and old characters; missing out nobody! Loved this game and can't wait for possible DLC?? The only problem I have is a slight audio glitch, and the controls on keyboard are quite bad! I highly recomend buying/Using a Gamepad. Best Lego game so far!",
            "review_score": "1"
        },
        {
            "review_text": "Well, First Things First, I bought this game purely for fun. I thought it was just gonna be some childish crap that i'd play through and completely forget about the next day. But. It wasn't. It really wasn't. Even though i don't play this game for the missions, i enjoy to free-roam the streets of New York and fly around punching people. It's a really good game if you just want to sit down, chill and beat up people made of plastic blocks.  Overall, quite a fun game but could use more details/things to do in the city.",
            "review_score": "1"
        },
        {
            "review_text": "Tons of super heroes, plenty of things to do, super fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, I love this game! My only problem is the fact that ya can't use a mouse.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Marvel then you owe it to yourself to play this game. While I found myself fighting the awkward camera angles and controls at times, the gameplay is very memorable and just plain fun. There also appear to be issues with Steam integration at this time (no achievements) but I'm more focused on getting all the characters unlocked so I can just wander around the city. Would be nice if the developers invested a bit more in the game engine as still plays like the old, old Lego Star Wars games, but it gets the job done. Great for kids as well, although some of the puzzles may be a bit challenging for kids that are low on patience.",
            "review_score": "1"
        },
        {
            "review_text": "Good one",
            "review_score": "1"
        },
        {
            "review_text": "it is awesome, totally worth the 5 bucks",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game to play with kids, or emerse in memories of being a kid yourself and playing with LEGO",
            "review_score": "1"
        },
        {
            "review_text": "one of the best lego games i've played, you can to an extend call it the ultimate superhero game since you've got a bunch of super heroes to mess about with in an open world. i recomend this to any who are a lego or marvel fan",
            "review_score": "1"
        },
        {
            "review_text": "This game is similar to most other open world LEGO games: it doesn't deviate too much from the formula, a lot of 'been there done that' moments, and trying to 100% can be a little tedious. But if you are a fan of Marvel comics you will really enjoy this game. There is a ton of content that the casual to the most hardcore Marvel comic book fan will appreciate. References range from the most recent Marvel movies to obscure and almost forgotten storylines or characters.  Visually it is one of the best looking LEGO games I've played. NYC is faithfully recreated in LEGO form, there are dozens of characters to unlock and they all have unique ways to play, the music is top notch, the jokes and physical gags are really funny, and there is a lot more missions to play beyond the story. Also, there's a lot of Stan Lee, and the more of him the better. It's a really fun game, don't let the LEGO bricks fool you.   If you are a little burned out by the LEGO series, then really there isn't a whole lot of new things here to entice you. But if you are a fan of Marvel, you should play this game as it's one of the best comic book games around. If you never played any LEGO games, I can't think of a better one to start with.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty great game, keeps in line with the style of LEGO games, but has a rather VAST assortment of Marvel characters.  Fun story line, but anything other than that is a basically grinding.",
            "review_score": "1"
        },
        {
            "review_text": "OPEN WORLD DESTRUCTION. Picture this- GTA, made of Legos. With Superheros. And not innapropriate.",
            "review_score": "1"
        },
        {
            "review_text": "A very short game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, me and my brother love playing this together. We can't wait till Jurassic World comes out.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, Gotham city is super fun to explore.",
            "review_score": "1"
        },
        {
            "review_text": "I love building ♥♥♥♥.   I love building ♥♥♥♥ as a Super Hero.   Therefore...  I love Lego Marvel Super Heroes.",
            "review_score": "1"
        },
        {
            "review_text": "Any Marvel fan should play this! Brilliant combo of humour and heroes and awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Considering I bought it since I had money left from the summer sale it's a nice little time waster but it's not worth 20$ Also triggers my nostalgia.. haa the memories of playing lego star wars when I was 5 years old  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, however tried to load a saved game and was overwritten which makes is so you have to restart the entire game. Also would love to be able to skip the Intro scenes.",
            "review_score": "1"
        },
        {
            "review_text": "fly around a miniature new york as any of your favourite marvel superheroes?! yes please  geek out at the hundreds of characters and costumes and vehicles sacrifices some of the physical comedy of previous lego games (the characters speak - so there's more verbal jokes) but the gameplay remains the standard smash everything/build new things / change characters for the different abilities of all the lego games it's a blast either ways with a huge amount to do and collect",
            "review_score": "1"
        },
        {
            "review_text": "For a child's game, these puzzles don't really give you much information to progress through the stage. ",
            "review_score": "1"
        },
        {
            "review_text": "Its not really fun when you play by yourself but it is extraordinarily fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Massive character roster, Good level designs and tons and tons of hidden secrets within a great over world. If you like marvel and lego this is an exelent game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best LEGO game I have ever played. From the characters to the open world envirorment, it is just the best way to have your Marvel without rewatching an old movie or waiting for a new one.",
            "review_score": "1"
        },
        {
            "review_text": "So much to do, will keep you occupied for hours! Good to dip into if you have a few spare minutes or to just play for hours.",
            "review_score": "1"
        },
        {
            "review_text": "A long time ago I played the Lego Star Wars 2 on the original x-box, those are some of my better gaming memories. Playing this game has brought back that feeling of completing puzzles during a boss fight, attempting to unlock every character and collect everything you possibly can. With all of New York in Lego form to explore in between missions and many references to others movies and comics (snakes on a plane) Lego Marvel Super Heros may seem like a quick cash grab but what it really is, is a wholesome game that's most likely going to take over 100 hours of your life.",
            "review_score": "1"
        },
        {
            "review_text": "In short, I would highly recommend this game, especially if you have played Lego games in the past and enjoyed them. I always was a Lego fan, and this is no exception.  There are so many characters to choose from, I'd say double than any other Lego game I've played. The open world in this game is amazing, and there is so much to do even after the story levels have been completed. The voice acting is decent, and the Lego humor is still there. The fact that there are so many different characters allows for a lot of unique types of interactions, whereas in previous games you might only have different items to carry (like Indiana Jones, where everybody is a mortal human).  There are a few flaws, most of which boil down to the game being pretty buggy compared to past Lego games and other games in general. It probably has to do with Lego/Traveler's Tales not being used to handling such expansive games, but I've gotten physically trapped in places, and other glitches and freezes that force me to have to repeat the level or find some way to kill myself and hope I respawn elsewhere. If you've played many Lego games in the past, I will add that minikits are not very complicated to find. They usually just involve using some character who wasn't originally available on the first play through to do something (coughmagnetocough). I remember that finding minikits in older games (the first and second Star Wars) actually was very difficult, or at least took multiple playthroughs, although there's a chance that was because I was just dumber back then. Just thought I'd mention that.   - Huge Open world +positive  - Large selection of characters, 100+, +positive  - Long levels, cool campaign +positive  - Pretty buggy -negative  Conclusion: If you liked past Lego games, this is a no brainer, especially when it's on sale. If you've never played a Lego game, this one is as good as any to try, although I might recommend a smaller scale game like the Star Wars ones or Indiana Jones ones. If you can't handle bugs in your game, then I guess I'd stay away. This is definitely not the best video game ever made, but I have had a lot of fun with it. Emphasis on fun. I'd also recommend the co-op, it's more fun with someone else.  Bonus: I bought both DLCs on the cheap (like &lt;=$1.50 for both), and they're not really essential to the game. Both DLCs give you like 15 characters total maybe, and while some of them are cool (Thanos, Rick Jones), most are redundant (Dark Phoenix, The Warriors four) and dumb (Jane Foster mostly/only). Get them when they're cheap, but it'll be more of a 'eh why not' purchase.",
            "review_score": "1"
        },
        {
            "review_text": "it was ok",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS TOTALLY COOL!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite LEGO game I hope they make A 2nd one",
            "review_score": "1"
        },
        {
            "review_text": "This game is great in that it has something for just about everyone who's ever so much as seen a trailer for a Marvel movie. This game really could have been limited to more popular characters from recent comics and movies, but no, just about everyone you could [realistically] ask for is here. Want to swing around Manhattan as Spiderman?  You can do that Want to play through every single level as Beta Ray Bill? You can do that Want to go on a killing spree as The Punisher? Sorry but this game is rated E10+  My only real gripe with this game revolves around it being a Lego game. Mainly in that all levels follow the basic [Kill bad guys&gt;Build thing&gt;Solve puzzle&gt;Fight boss] format that has gotten tired throughout the last decade. But hey, if you're willing to put up for that, then there's a lot for anyone to enjoy here.",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun game. There are tons of characters and a good amount of comedy. Its only downfall is the pc controls aren't the greatest but still bareable.",
            "review_score": "1"
        },
        {
            "review_text": "Excelsior! This is a small triumph for Traveller's Tales studio. Fun, and zesty Marvel goodness. 'Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "when i got this game, i played it non-stop..... ohgod i need help.....",
            "review_score": "1"
        },
        {
            "review_text": "Whether you're a fan of Marvel or not, you're bound to love this game.  Combining a quirky yet engaigng plot bringing all heroes (and villains!) of the Marvel Universe together with a vast array of playable characters and countless free-play missions, LEGO Marvel Super Heroes is a game that has everything to offer.  The only thing I found disappointing in this game was the lack of apparel options in character customisation. While it's awesome that you can customise your own hero having specific super powers, it kinda sucks when your he/she/it doesn't look as unique as you want him/her/it to be. (I don't know, maybe I've played too much Team Fortress 2.)  All in all, great game. I give it a 9/10. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "By far the funniest LEGO game of them all; I was not a great fan of it in the LotR games, but it works much better here when the devs had freedom to write their own script. Tons of nerd-ish fun to be had, though I have to call out the flying &amp; flying vehicles - the controls for those are simply dreadful, to the point that even as a LEGO completist I gave up trying to do the flying races in this one.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutly love this game, I always loved Lego and Marvel, and puting them together makes it an incredibaly enjoyable experince. However, that said, I cannot recommend this game to anyone how dosen't have a gamepad.  This incredible game suffers from a massive issue with not having mouse support. What I'm saying should not push you away from buying this game, just pick up a cheap 360 gamepad and you're good. I'll be honest, I had no idea about the lack of mouse support, due to my experience with lego games being on console previously.  So as far as the game goes, compared to other lego games it is amazing and I thoroughly recommend it, but as my first recommendation get a gamepad, or just get it on console.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game So many of the Marvel Super Heroes and Villians from all over the Marvel universe, My game of the year for sure. Which year you ask? EVERY YEAR!",
            "review_score": "1"
        },
        {
            "review_text": "It's good. If you like the lego series, you'll definitely enjoy this game",
            "review_score": "1"
        },
        {
            "review_text": "The definition of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, and great co-op experience. Funny and clever. Gameplay itself is pretty good, confusing at times (I've always been terrible at split screen) but never too frustrating. It got my girlfriend to buy herself a controller so we could play together. Luckily she doesn't feel compelled to 100%, because it seems like this game could keep you busy for a long time, and I'm not sure the mechanics would hold up to that kind of play. Still a solid B+.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game the storyline is a amazing idea! Im in love with all LEGO games but this one is definitely my favorite!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game was highly anticipated, and it was not a let down.  Lego marvel super heroes has a lot of different characters, some with alternate costumes, many challenges, vehicles, customizable characters, tons of replay value, and loads of content. The game only has a few glitches but plays pretty nicely, although they might not have every marvel character to play as, the ones put in the game are more than stellar.  8.5 / 10",
            "review_score": "1"
        },
        {
            "review_text": "lots of fun...buy it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for kids and adults!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. I do get bored of it, but its a great game. There are a lot of characters, Vehicles, and missions.  Why I like this game: - Many Characters - A lot of Vehicles - A big map - The Helicarrier/Tricarrier (I don't know which one it is.)  Parts I don't like: - A.I's Scripting (They won't follow me sometimes, or they get stuck and do nothing.) - Missions seem the same (Defeat a wave, hit the boss, and over again.)    8/10",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game. I've played it all co-op with my girlfriend who's not into video games at all, and she loved it! Besides being fun, the game can sometimes be challenging too, which is nice. You can pass the story mode within 8 hours calmly, but it has a lot of things to collect, since Im only around 15% game completed.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good game just like marvel...except more child friendly",
            "review_score": "1"
        },
        {
            "review_text": "LEGO games are the best!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best lego games  the free play is the best part   10/10",
            "review_score": "1"
        },
        {
            "review_text": "the best LEGO game and definitely the best MARVEL game in a few years. Huge number of available characters with their own specific attacks and behaviors. Definitely worth its price",
            "review_score": "1"
        },
        {
            "review_text": "i luv this game  ",
            "review_score": "1"
        },
        {
            "review_text": "You might think LEGO games are for kids, well that is not the case. It can be played be kids, but it can be really fun for adults too. If you want to fly around New York as Iron Man, Thor, Human Torch or sling around as Spider man this is the game for you. There are 115 playable characters, 15 main missions and 11 Deadpool side quests. Many hours of entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "a cute take on the Marvel multiverse",
            "review_score": "1"
        },
        {
            "review_text": "Love smashing everything with Thor's hammer.  Love how the designers wrote in a dumb/strong task ability on the characters (makes me laugh more often than it irritates, which is a fine line).  Love all the irrevelant written in levels - teapot Mr Fantastic and Stan Hulk!",
            "review_score": "1"
        },
        {
            "review_text": "Lego GTA* pretty damn hilarious though",
            "review_score": "1"
        },
        {
            "review_text": "tony stark causes more damage than the hulk cause he keeps fLYING INTO ♥♥♥♥ING BUILDINGS",
            "review_score": "1"
        },
        {
            "review_text": "how do i get to the open world part ",
            "review_score": "1"
        },
        {
            "review_text": "I've not played a LEGO game since the first two Star Wars releases but this was well worth picking up in the sale. Good light-hearted fun. Fun for kids and and big kids, especially if you have even a slight interest in the Marvel world. Personally, pretty much all I know about the Marvel universe is through the films but I didn't feel like I was being alienated. I even learnt some new things. I had no idea that Howard the Duck is actually a Marvel character! In fact, this game was a good (non-spoiler) introduction to GOTG before the movie. The game itself is typical LEGO game mechanics, some really annoying side missions and the odd didgy control moment but otherwise just a good laugh. Be warned, if you're the sort of person who wants to collect everything in a game then this one will take you a while to reach 100%.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. I highly Reccomend Buying It.",
            "review_score": "1"
        },
        {
            "review_text": "For sure the best Lego game out of them all, and I've played them all. There is so much to do in this game, it's free roaming and the graphics are great. Lego has come a long way graphics wise in their games. 9.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "It's good. If you like the lego series, you'll definitely enjoy this game",
            "review_score": "1"
        },
        {
            "review_text": "This will be a very in-depth review so be prepped to be reading for a few minuites.  Story:  First thing I will start on is the story, the story is fairly good bringing together many iconic heros and enemies in a way that makes sense, there are quite a few laugh of loud moments with the usual lego parody and the voice acting is not bad.  Also, there are a bunch of semi hidden missions called 'deadpool missions' that are given a bit of backstory by deadpool, each mission can be about things unrelated to story, from cleanup after a hero fight, to a kickass party at starks place, these extra missions are worth doing as they can unlock new characters, gold bricks and are the only way that I know of obtaining red bricks.  Note that to play these deadpool missions you will have to have the proper amount of gold bricks beforehand, you do not pay bricks, you simply must have your amount past a threshold. i.e A mission may require you to have gotten to 50/300 gold bricks before your allowed to play. Characters:  The Character roster is the most impressive to date! A crazy amount that is made even better by the fact that each characters different skins count as different costumes and not different characters, by thta I mean that in prev lego games all the different Iron man suits would have counted as 6 different characters, while in this he still jsut counts as 1 character but with 6 different versions. However I think the system for selecting alternate costumes is ineficent, the characters different costumes/look are constantly rotaiting every second so you may be required to wait a few seconds to select a certian costume.  Also, the BIGGEST reason I think lego marvels character roster is the most impressive to date is thta for the most part, all the different characters are ACTUALLY different. Ofc some heros abilites are more unquie and recognizable that others, like thors hammer, sandmans heavy changeing atatcks or spidermans web slinging. They have even included characters that are useless gameplay wise just for backstory like mary jane and others.  However, when you have a game liek this some heros are OBJECTIVLY going to be better than others, example in story missions if you have a big fig hero you will ALWAYS play them in fights because they just tear everything apart and other heros in that same mission will only be played for utility purposes. And some heros have REALLY contrived and dumb utilities that have cleary been put there so that they are useful in some way, in a few story missions your forced to play logan so they he can use 'claw switches' switches than need blades to use... wat.  Free Roam Hub:  Moving on, the free roam hub is extremely impressive and is one of the best free roam areas I have even played in a superhero game, not so much for detai lor things to do but just the general feel, when you fly you feel that you are going very fast, even more so that the superman returns game from a few years ago.  A HUGE improvement in lego marvel from the past games is that lego just works somuch better in this setting, lego against the dark dreary colours of middle earth of the dank city of gotham clashed heavily with the light hearted cherry vibe of lego, however within the bright artifical city of new york the natural fun feeling of lego is... kept intact?  Something strange is that even with the ability to fly at ???mph (fast) you still have a garage of cars and aircraft to collect to use... there is literally no reason to use these except for a few races to get gold bricks that require you to use a certian vehicle. I'm not saying this is bad though, while it is useless its a nice detail that adds more frills and another layer for us collectors.  An improvement upon past lego games is that you no longer need to beat the game to get access to all characters while in free roam, instead you can go to a vehicle call point and switch character from their, then past that point you can swtich characters by holding Y (if on controller) though one you beat game you don't need to use vehicle point once to get instant character select, you have it all the time. However, it still has the prob that there are sections in the free roam hub that require a certian character you won't unlock until near the end of the game, so bum rushing missions is still advised.  There are many side quests with some decent variety, some require you to fight off an ambush, chace a crook, find an item, escort someonem take control of someone etc. These usually reward you with gold bricks for unlocking special deadpool missions.  Gameplay:  The gameplay has changed a little in places, most notible is that the combat is way better than prev lego games, its still too simple I think but way better than before. If you defeat enemies quickly in sucsesion then it builds up combo to a max of 10, the higher the combo the more studs you get from beating enemies. (yes, eating enemies now give you studs :D a very good mechanic imo)  When attacking enemies with melee there is a chance that your character will pull of special finishers, quite a lot of characters seem to have a few, you will however get to a point where you will be liek 'meh, seen it before, jsut kill him already' however the first few times you see spiderman grab a guy with his web and slam him of the ground like a mallet will make you say 'thats pretty ♥♥♥♥in sweet'  The combat is split mainly into these attacks...  Ranged projectiles - explosive, energy, magic, bow, web, bullet (all pretty much act the same) Laser - eletric, magic, fire (hold down to aim a constant laser of dmg) melee - simple melee, some characters have different stances/fighting styles melee weaponry - most melee users also have the ability to thorw their weapon and have it come back like a bommerang and then there are a few special attacks that are hero specificm like hulk clap, ironman unibeam etc.  There are multiple instances where certina powers will be needed to progress in certian areas, I won't list them all as it would take too long, like I said earlier some are kinda contrived like claw switches and sheild switches, others make sense like grates and sneaking past cameras.  Though for once there are moments that you actually look forword too! There are points hwere sandman or mr fantastic will have to morph into a certian shape to get past a point and its always a different thing thta happens, or hacking a point with a smart character starts a (easy) minigame thats usually allways different.  There arestill many times where you will be required to build things to get things done, soemtimes this can be kinda dumb, where you have to build handles onto an object so a big fig can hold it, and some are really cool like ironman building a water cannon out of water tower that you jump into and use as a weapon.  Boss fights are... okay, better than normal lego games. There are still those that require you to do the same tihng multiple times and are more complicated than they need to be, but there are some decent ones liek the final boss, green goblin midway, sandman at start etc.  Controls: The controls are fine, controller support is nice and the character select has dropped that awful wheel LOTR had, also there is a way of quick changing to certian character using the front tirggers (on controller).  Flight controls are fine I found, though could be better as I sometimes found myself wanting to make a tight turn and would instead fly forword a little then turn around and cover way too much ground.  Rushed Verdict:  I must stop here so I will hurry, canisters arent worth collecting as all it gives is short crappy comics of story cutsenes, game needs bios to explain characters we might not know.  Though easily best lego game made, not perfect by any stretch, but shows huge improvements upon previous lego games with a large amount of content to keep you playing intesely for hours upon hours.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike Lego Batman: DC Super Heroes, the story wasn't complete crap but it still was not as great as some Lego games in the past. The city is diverse with activities to participate in and the vast character list is great. The levels are just as enjoyable.   There are only a few cons I have for Lego Marvel Super Heroes and they are that the collectibles spread out through the levels are easily sought after. They are not as hidden as I had hoped they would be, sure I did not end up getting frustrated towards the game but lost some interest. Another is the character customization is a place of confusion and frustration. Its way of having only certain weapons and apparel for each custom made character and not all the provided options for each customization is annoying; but the act of having to purchase/unlock each character to gain their weapon/apparel (if there is one) for the character customization.  Hub: 9.5 Characters: 9.5 Levels: 6.5 Activities: 8.5 Character Customization: 5 Story: 7  Rating: 7.7/10  Rate: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Great LEGO game that stick the Marvel universe with the Lego humor, a lot of characters with a good range of abilities, the animation is sweet too. I'd recommend this to any marvel fan.",
            "review_score": "1"
        },
        {
            "review_text": "fun game with lots of stuff to do. especially if you try to unlock every charcter. my kids loved playing it also. They where actually able to beat the entire main story on their own. AS you can see by the hours between the 3 of us we have put a lot of time into this game.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the most fun of the LEGO games I've played. Different powers and puzzles are suitably wide-ranging that you never run out of things to do.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game So many of the Marvel Super Heroes and Villians from all over the Marvel universe, My game of the year for sure. Which year you ask? EVERY YEAR!",
            "review_score": "1"
        },
        {
            "review_text": "one of the most fun games i've ever played, 14/5",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for the kids at first.... but I was bored the other day, so I decided to check it out. I was throughly impressed with the graphics and easy to pick up gameplay right off the bat. There is quite a few characters to unlock. (200, I think?) Each character has a different playstyle and moveset, so everyone is bound to find a character they will like. The stages are very well made and there is tons of hidden items etc. to find. Very enjoyable game and hella addictive. I say this because, as of this morning, I have restarted my own save game six times...SIX! I really gotta teach the kids how not to save over MY save slot accidently. 10/10 would lose saved data and restart again.",
            "review_score": "1"
        },
        {
            "review_text": "So far the Best Lego game i have played to date.",
            "review_score": "1"
        },
        {
            "review_text": "It's a Lego game. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "Do you like the all ages punny Lego humor? Do you like Marvel? (hint: if you dont you're probably a bad person)  Great game extra good if you catch it on sale",
            "review_score": "1"
        },
        {
            "review_text": "LEGO and Marvel, no need to say more",
            "review_score": "1"
        },
        {
            "review_text": "chock-full of humor. vastly open world. flying around the city with no particular goal in mind is surprisingly relaxing. levels are also fun and challenging. puzzles galore.",
            "review_score": "1"
        },
        {
            "review_text": "Whacking your base and get coins.. ez life...",
            "review_score": "1"
        },
        {
            "review_text": "Fun but disappoint at combat but sword have cool effect Deadpool is cool/10 ",
            "review_score": "1"
        },
        {
            "review_text": "this game is the best and it gets better menot going to spoil it ",
            "review_score": "1"
        },
        {
            "review_text": "Lego Marvel Superheroes is the best Lego game ever. It's the only Lego game that I've felt the need to play around in the open world for reasons other than getting 100%. There are so many character types I didn't expect, like Magnetos ability to do thing telecenetic characters can't. The only two problems are: 1. The controls for flying characters suck 2. Every character makes a fool out of there self, the only one that isn't different from there normal self is my favourite character, Deadpool 9/10",
            "review_score": "1"
        },
        {
            "review_text": "LEGO games never disappoint - the sole characters players are allowed to use worth all the money. Players can enjoy the game with various marvel hero such as Ironman, Thor, Hulk etc. Different heros has different skill sets which allows certain interactions for puzzles in the game. For example psychic heros can manipulate engineers to flip the switch and bulky heros get to smash their way out. The story is original, not what i expect as the stories in the comics. There are plenty of missions, unlockables, secrets await to be found and enjoy the hours of gameplay in marvel universe",
            "review_score": "1"
        },
        {
            "review_text": "If you're a Marvel fan (knowledge of the universe beyond movies helps a lot) and you don't hate fun, you are most likely gonna love this game. The amount of collectibles and unlockables might unleash your inner autist, but that's okay. It all feels really good. Seriously though, you can play as more than 150 characters, almost all of which feel different, thanks to unique animations, sound design and wide range of abilities. You can play as the ♥♥♥♥♥♥♥ Super Skrull, for christ's sake. 10 hour or so storyline, around 40 hours if you're gonna be 100%ing.",
            "review_score": "1"
        },
        {
            "review_text": "If you love the other Lego games, you'll love this one!",
            "review_score": "1"
        },
        {
            "review_text": "It's Very cool :)",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games. Also one of the better Lego games. It runs very well also.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Well worth the whatever $ I paid for it.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best Lego Games that has been made so far",
            "review_score": "1"
        },
        {
            "review_text": "Infinite Warfare has some major competition with this game",
            "review_score": "1"
        },
        {
            "review_text": "If we're being honest with each other, I mean just really honest about the whole thing: this game is basically GTA for children, and has a TON of your favorite Marvel characters. It's quite good.",
            "review_score": "1"
        },
        {
            "review_text": "the game controls are hard but you get use to theam ",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, it's got dodgy control system, but yet it's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "THE MOST FUN LEGO GAME 10/10 Deadpools",
            "review_score": "1"
        },
        {
            "review_text": "A nice looking game even for less capable computers, this game has only one flaw to me: the right hand controls. Although the controls are continuious throughout the LEGO series, I'm just not a fan of of H,J and K for control. To counter this, you can of course re-map the keys or use a PC controller. Overall a good game.",
            "review_score": "1"
        },
        {
            "review_text": " Overview  Pretty solid game - if you enjoy LEGO® games this is no different. Co-op is fun. Gold brick challenges felt more varied than previous games. Flying in freeroam is still awkward to get the hang of though and the game does have some fustrating elements tied into the gameplay / level design.   Like     Fun Co-op    Good variety of characters    Good amount of easily accessible gameplay    Dislike     Gameplay / Level design can be awkward    Some challenges are uninformative and therefore difficult to work out    Voice acting is pretty awful   Notes  Controller recommended",
            "review_score": "1"
        },
        {
            "review_text": "It's a Lego game. It's fun to smash stuff and it's pretty funny at times.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly fun, there is so much to do! You could spend hours on this game!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS TOTALLY COOL!",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is Amazing The Controls Are A Little Weird But You Get Used To It.",
            "review_score": "1"
        },
        {
            "review_text": "LEGO never ceases to amaze. I thought that the LEGO games from when I was little would never be topped, but obviously I was being naive. Do I recommend this game? Hmm...let me thin-YES!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favourite - classic lego smash it game yet now with a huge open world to explore!! so much fun and easy to play",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best in tghe Lego series. The sheer fun of running/flying/swinging around New York will keep kids and adults entertained for hours and hours, not to mention the incredible amount of collectibles this game has. If you're a fan of the rest of the series this is a must buy",
            "review_score": "1"
        },
        {
            "review_text": "So many unlocks! Finished the story and only have 12% of the game unlocked. As with all the Lego games, I really have enjoyed so far.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and the enviroments are very well done. Some graphical issues at times (mistly frame rates) but its a blast flying around as Lego Iron Man and defeating sentinels.",
            "review_score": "1"
        },
        {
            "review_text": "LEGO MARVEL SUPERHEROES is an awesome game but I have a glitch witch is quite anoying,I can't complete level 15,but if you get it I hope it dosen't do the same thing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. All the Lego games are good but this has a different story from the movies, a free roam option, like...100 charecters, lots of humor, great voice actors and if that wasnt enough it also has Deadpool. I mean, you should buy this game specifically becasue it has Deadpool voiced by Nolan North in it.",
            "review_score": "1"
        },
        {
            "review_text": "I know that this is a good game as i have played it before on a friends computer. BUT i can't get past the first mission. So i would recommend this game if you can get passed the first mission!",
            "review_score": "1"
        },
        {
            "review_text": "really fun and long lasting",
            "review_score": "1"
        },
        {
            "review_text": "I absolutly love this game, I always loved Lego and Marvel, and puting them together makes it an incredibaly enjoyable experince. However, that said, I cannot recommend this game to anyone how dosen't have a gamepad.  This incredible game suffers from a massive issue with not having mouse support. What I'm saying should not push you away from buying this game, just pick up a cheap 360 gamepad and you're good. I'll be honest, I had no idea about the lack of mouse support, due to my experience with lego games being on console previously.  So as far as the game goes, compared to other lego games it is amazing and I thoroughly recommend it, but as my first recommendation get a gamepad, or just get it on console.",
            "review_score": "1"
        },
        {
            "review_text": "Its ♥♥♥♥en great! so many heros and its funny ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "i was interested in this game for ages, but i thought it may be a little too kid focused and never actually bought it until now, well i really enjoyed the game, yeah its a little too easy and its not possible to die but its fun to play and quite funny in parts",
            "review_score": "1"
        },
        {
            "review_text": "This game is fine if you don't want to bother doing the open world stuff, which is kind of a shame since that's where you get a bunch of the collectables and I found that a little more interesting than the main game. The main storyline is pretty straightforward, there's nothing too notable to talk about. If you've never played a lego game before it may take you a mission or two to figure out the rules, but t's fun.  The open world collectathon is where you run into all the problems. Anyone who says the controls are perfect hasn't bothered doing this part. Flying characters can rocket out of control, it's easy to fall through a building, and in general (even in the main story) sometimes you'll get locked onto an AI ally and will proceed to beat the ♥♥♥♥ out of them instead of the actual enemies. Still, it's not plagued with these problems, and they're more like annoyances than major issues.",
            "review_score": "1"
        },
        {
            "review_text": "I preferred it when the Lego Character could not talk, the cut scenes where more humorous. I wish there was a way to turn the voice off prompting you that you need a specific super power to interact with the object that can only be manipulated with telekinesis or magnetism or electricity ect.   If you have played any of the other Lego games, you know what your getting. The camera can hamper what your doing the odd time.   It is a lot of fun, and the humor is well done. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything you'd expect from a normal Lego themed game ranging from the puzzling levels to the amount of collectables you can find in the game. I somewhat think some aspects of the game didn't need to be in this like flying vehicles as most of the heroes in the game could fly. This game is mostly a collect-a-thon so if this is your thing then this game is for you. This definitely was alot of fun playing none the less!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! A number of super heroes, plenty of things to play with.",
            "review_score": "1"
        },
        {
            "review_text": "best lego game there is BUY IT",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, great fun with the future wife. runs fantasticly on the PC as oppossed to the constant crashing on xbox when playing free play with any of the cheats on",
            "review_score": "1"
        },
        {
            "review_text": "BEST LEGO GAME EVER. 20 hour story and more hours of unlockables to find!",
            "review_score": "1"
        },
        {
            "review_text": "Its a kind of funny games that i've played. I would like to recommend to anyone who wants to relax at the spare time.",
            "review_score": "1"
        },
        {
            "review_text": "Really good fun:) Used to play the LEGO: Star Wars when I was much younger, and I loved that. Bought it recently in a sale, and was not disappointed. Interesting story, and fun free roaming to unlock new characters. Get's a bit boring occassionally, however it's great fun most of the time. Recommended:)",
            "review_score": "1"
        },
        {
            "review_text": "Yeah its pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Well this game is surprising to say at least! Probably the most largest game in existence!?!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Co-op LEGO game. Enjoyable for beginners and a guilty pleasure for the experienced.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun! It is still weird that the Lego characters talk, I think they were more funny when they didn't, but what are you going to do. The world is massive and incredibly fun to run around in. My only complaint is the obvious political bias. The Punisher has you run down the 'polluters' in the big vehicles, there are 'smart' cars galore, the american flag is on backwards, you can bust it up, and when you do it lands on the ground. So not cool! These characters protect America, and the Warner Brothers needs to keep it that way! I would recomend this game, but make sure if your kids play they know what is right, and what is wrong with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Love Lego = Love this game",
            "review_score": "1"
        },
        {
            "review_text": "All those ♥♥♥♥ing puns man.",
            "review_score": "1"
        },
        {
            "review_text": "what what?",
            "review_score": "1"
        },
        {
            "review_text": "It's a realy fun game , relaxing , and not boring kinda game . That's why i like all LEGO games .",
            "review_score": "1"
        },
        {
            "review_text": "seriously check this game out unreal ",
            "review_score": "1"
        },
        {
            "review_text": "LOVE this game got it for christmas its awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This game has many flaws (most can be avoided by changing resolution to 800x600) but it has a great story and good gameplay. One problem is the panels you have to push in a circle to lift something or open something, they don't always let you stay on. Also unless you don't change the resolution, the final boss won't work. The game has more good parts than bad so over all I'd recommend this game to those who can accept glitches and be patient enough to wait for the updates to fix some more bugs 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has many flaws (most can be avoided by changing resolution to 800x600) but it has a great story and good gameplay. One problem is the panels you have to push in a circle to lift something or open something, they don't always let you stay on. Also unless you don't change the resolution, the final boss won't work. The game has more good parts than bad so over all I'd recommend this game to those who can accept glitches and be patient enough to wait for the updates to fix some more bugs 8/10",
            "review_score": "1"
        },
        {
            "review_text": "One word: Fun. Also don't let the PG-ish rating fool you. It has free-roaming (with fun results, especially in co-op. Like GTA with LEGO), good dialog, and something which you won't believe for a LEGO game: A jumpscare.  Overall, I give it a 12/10. Way worth the sale earlier today.",
            "review_score": "1"
        },
        {
            "review_text": "If you like legos, the MARVEL universe, and action this game is for you. I love the story line and how funny the characters are. And if you want some extra characters i recommend the DLC super pack because it includes bata ray bill, falcon, original hawk eye,the winter soldier, and red phoenix.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, great fun with the future wife. runs fantasticly on the PC as oppossed to the constant crashing on xbox when playing free play with any of the cheats on",
            "review_score": "1"
        },
        {
            "review_text": "best lego game since lego star wars ",
            "review_score": "1"
        },
        {
            "review_text": "the best lego game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great wether your a marvel fan lego fsn or both soooooooo... ya BYE IT NOW there is one problem though, the controls are weird",
            "review_score": "1"
        },
        {
            "review_text": "The best Lego game ever if u like sandbox games or lego games you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Best LEGO game I own right now (LEGO Batman 3 seems cool and LEGO Marvel 2??). A few bugs/glitches for ex. two of my customs' left hands will dissapear and I all customs will go bald after having Magneto's helmet (helmet dissapears and custom no longer has magnetic powers) then sometimes there will be lag or something, but not all the time. Some of the best characters include: Deadpool,Ghost Rider,Silver Surfer, and Stan Lee. I also have around 89.7% (something like that) because I just don't want to do the races(not against characters/for charcters and vehicles [already did those]) for gold bricks...Overall, you should get this game! And get both DLC Packs!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun for all!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game for anyone who enjoys Marvel's recent works.  Controls can be a bit cludgey at times, but overall it never detracts from the experience.   Wonderful story line and even better post game items.",
            "review_score": "1"
        },
        {
            "review_text": "i CANT TURN THE TURN TILE SWITCH WITH MY KEY BOARD AND I DONT HAVE ANY CONTROLLERS!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "its a wickedy game with lego in it and marvel superheroes in it. and some not so super heroes in it",
            "review_score": "1"
        },
        {
            "review_text": "It's a Lego game. It's fun to smash stuff and it's pretty funny at times.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Worth $25.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game that is original to the marvel universe. The voice acting is excellent, especially Nolan North as Deadpool (Who else could do Deadpool?). Small open world but overall a good game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game I'm able to play with my 5 year old kid where we can both have a ton of fun.",
            "review_score": "1"
        },
        {
            "review_text": "me and my daughter played and played this epic lego game, truely brilliant, the free roam aspect fantastic.... a must buy",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Couple of glitches, but it's pretty good aside from that.",
            "review_score": "1"
        },
        {
            "review_text": "It was really fun to play this game but the thing that annoyed me was the flying races .....",
            "review_score": "1"
        },
        {
            "review_text": "This is possibly one of the best LEGO games to date! It's like the GTA of LEGO games, with zero hooker-ing or foul mouths! Haven't found any optimization settings though. Think it could look way better if you could tailor the settings to the kind of graphics card you're sporting.",
            "review_score": "1"
        },
        {
            "review_text": "My first lego game was Harry Potter Year 1 and I loved it soo much. Getting this game at 75% off made me so happy. Already started playing and love the humour plus getting to play all the superheroes. &lt;3 Lego + Superheroes = Win!",
            "review_score": "1"
        },
        {
            "review_text": "The best of the Lego games released so far. Free roaming New York is a blast and they put a lot of attention to detail on the powers for the 100 or so heroes and villians you can play as. Only negative about the game is the terrible flying races. Flight controls are fine cruising the city, but not precise enough for many of the races. Overall though that is a minor issue and those can just be skipped. Fun story and very long play time if you complete all the missions and side objectives.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play. Hate the split screen in mulitplayer but otherwise good game",
            "review_score": "1"
        },
        {
            "review_text": "A really great game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's the best pc Lego game i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "My favorite part of the LEGO games by Travellers Tales is the fact that there's so much to collect. I mean sure building is fun and all, and kicking plastic butt is great as well, but it was the collectaibility that kept me playing the majority of the time. With that being said, LEGO Marvel Super Heroes not only involves some of my favorite childhood heroes and villians, but it also acts as the largest LEGO game to date, with a large map of New York to explore in its blocky glory. You can play as classic characters like Iron Man, Spiderman, and the Hulk, but there's also characters I've honestly never heard of before, like the Wizard and Dormammuu. There are SO MANY THINGS TO COLLECT, from character tokens, to vehicles, to gold bricks, to deadpool bricks (oh yes, deadpool makes a large appearence in this game, and it's glorious) and more. It's quite the challenge. The story of the game is awesome and manages to tie in all of these heroes and villians pretty well. Different abilites are assigned to different characters based on their powers, and the way some heroes can attack are badass (Hulk even does the exact ragdoll throw he does to Loki in the Avengers if you do it right). It's the best LEGO game to date, and I hope Tt games manages to exceed this mark. At this point I don't know how they can make it better, 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The kids love the game, and you have a good selection of heros and villians to work with. The stories are more developed than earlier versions of previous lego games.",
            "review_score": "1"
        },
        {
            "review_text": "The best Lego game and the best Marvel game. Lego Marvel can be enjoyed by all ages. The characters are varied, the missions are enjoyable, and the collectables are numerous. If you are like me and enjoy 100%ing a game then the Lego games, and in particular Lego Marvel, allow for fast rewards as well as complex puzzles. It may seem like a childish game, but give it a go and I can guarantee that no matter your age you will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "LEGO Marvel is fun and quirky. The action is exciting and it keeps my 3 yr old busy, I always hear him laughing in the next room because hes always fighting the Red Hulk and running away or trying to get that first car drop on him. The overall story is solid and utilizes key heroes through the story, but you'll have to replay the scenes again; you'll know what I mean once you get it. In all, you will have fun playing and if you're a gaming dad with children 3 yrs+ then you both will have a lot more fun!",
            "review_score": "1"
        },
        {
            "review_text": "Who doesn't love Lego? And Marvel as well, what a combo! Fantastic addition to the Lego franchise, lots of tongue in cheek humour and fun for the whole family.",
            "review_score": "1"
        },
        {
            "review_text": "Love Lego = Love this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is really addicting and has a good story line to it!  Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's Lego and Marvel... what more needs to be said? This is the best of the Lego games to date.  If your looking for a fun game that doesn't take itself to seriously than this is the one to get, you won't regret it",
            "review_score": "1"
        },
        {
            "review_text": "It's one of the best lego game I've played. The story is amazing and you can play with every Marvel character in the Marvel universe.",
            "review_score": "1"
        },
        {
            "review_text": "Had a lot of fun with this one, funny and lots of comic and movie references. Lots of characters to find with diffent challenges.",
            "review_score": "1"
        },
        {
            "review_text": "Best LEGO game I own right now (LEGO Batman 3 seems cool and LEGO Marvel 2??). A few bugs/glitches for ex. two of my customs' left hands will dissapear and I all customs will go bald after having Magneto's helmet (helmet dissapears and custom no longer has magnetic powers) then sometimes there will be lag or something, but not all the time. Some of the best characters include: Deadpool,Ghost Rider,Silver Surfer, and Stan Lee. I also have around 89.7% (something like that) because I just don't want to do the races(not against characters/for charcters and vehicles [already did those]) for gold bricks...Overall, you should get this game! And get both DLC Packs!",
            "review_score": "1"
        },
        {
            "review_text": "This Game is an absolute must have for Marvel/LEGO/General Comic Book Fans, usually, I put down a lego game 5 minutes after playing it, this one was made by comic fans for comic fans, the gameplay(for an obvious console to pc translation) are great, the references to not only parts of the Marvel Universe but pop culture are funny (I.e. 'Director Fury told me to get these 'Gosh Darn Snakes off of this Gosh Darn Helicarrier!''), some of the speech is corny but in a surprisingly refreshign and humourous way, it uses quirky and ironic humour to an outstanding effect, and the map is vast, leaving you with plenty to do.  And on to the characters, This game will not only bring you characters you're familiar with(Spider-Man, Wolverine, Captain America, Iron Man, Thor, Fantastic 4 for example) but also some you're maybe unfamiliar with too(Power Man, Iron Fist, Howard The Duck etc) and also, our favourite Merc With a Mouth that is Deadpool, and Generalissimo himself Stan Lee. My only problem is that it didn't bring some of the more (in my opinion anyway) useful characters, for example, the game features Aunt May Gwen Stacy and Mary Jane Watson, really? as nice as havign these characters is, I'd sooner have only the one and then more useful Spidey characters like Harry Osborn, or hell even Rocket Racer, etc. and a few more locatiosn where you can go inside would've been nice too, like at the point of the game where I'm at, you can't even enter Stark Tower or the Baxter Building and it doesn't even look like you can at later levels either, whether this changes or not I'm not sure but it would've been nice.  Overall I'd give this game a firm 9 or 10 out of 10 considering the only problems with it I have are character/location based, I say check this one out, hours of fun!:)",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game for my 3yr old nephew and for myself of course, to get down on. There aren't to many local co-op games suitable for toddlers. Sonic, Renegade Ops, Pac-Man, Galaga, Mario's and this one. I let my nephew try his hand on some Serious Sam 3 (kiddie effects on) but as soon as he hears that melody he scrambles to the nearest structure and hides.  Out of all the Lego games I own this is by far the best. If your into Lego themed games get this one. StarWars, Potters, Batmans, and the Rings combined doesn't bring as much excitement and entertainment as this Lego Marvel Super Hereos.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing!!!  Amazing open world.  Faithful lego gameplay  Certain camera angles could use some work  150 playable characters, but some have the same moves and abilities.   8/10 - Great",
            "review_score": "1"
        },
        {
            "review_text": "So I may have gotten so invested in this game I 100%'d it",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun and plays very well",
            "review_score": "1"
        },
        {
            "review_text": "Huge arsenal of characters to choose from - awesome. Unlimited lives - good for stress-relief.",
            "review_score": "1"
        },
        {
            "review_text": "Again another LEGO game which the kids love to play with you!",
            "review_score": "1"
        },
        {
            "review_text": "When's Mahvel?",
            "review_score": "1"
        },
        {
            "review_text": "Not a big fan of lego sign off games. Wish Steam would put in the real movie/tv based show games like Lord of Rings and Harry Potter. But enjoy this game very much. Pretty much only good marvel game for Mac is out there for now",
            "review_score": "1"
        },
        {
            "review_text": "Pros: + Great game, a ton of fun.  + Grand Theft Auto style street freedom/havok (w/o the blood) + Humor for days--corny, puns, etc, but funny nonetheless. + A ridiculous amount of characters to play as, which you access very quickly. + Great two-player option available.  Cons: - No real challenge; I'd love it 10x more if there were difficulty levels. The way it is now, you get unlimited lives. I'd like there to be other options where you only get a certain number of lives (your AI partner would still get unlimited, cuz they're dumb as bricks--see what I did there) - Repetition; it got old sooner than I thought it would--partially due to the lack of challenge. - Not working with my controller. Although this may be user or controller error, I've used it with other games w/o an issue.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Completed 100%   Great game, solid gameplay, a few bugs here and there, but nothing game breaking. Lots of laughs playing through, TONNES of characters to collect.  9/10 Definitely worth picking up on sale like I did for £4",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game because to me its one of the best lego games. I've been waiting for this since LEGO BATMAN came out. it turned out much better than i thought I mean seriosly you get to explore manhattin. there my be some bugs but other than that it's an awesome game to play. it has over 100 characters and that alot. i definitly like how they worked hard on getting all the different characters power to work correctly.",
            "review_score": "1"
        },
        {
            "review_text": "This game has many flaws (most can be avoided by changing resolution to 800x600) but it has a great story and good gameplay. One problem is the panels you have to push in a circle to lift something or open something, they don't always let you stay on. Also unless you don't change the resolution, the final boss won't work. The game has more good parts than bad so over all I'd recommend this game to those who can accept glitches and be patient enough to wait for the updates to fix some more bugs 8/10",
            "review_score": "1"
        },
        {
            "review_text": "get it now bwfore the world ends good game easier to play on controller almost needed",
            "review_score": "1"
        },
        {
            "review_text": "Completely mastered this game on PS3 - worth every second.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome open world game allowing you to run around as super heroes... Lego style :)",
            "review_score": "1"
        },
        {
            "review_text": "So far the Best Lego game i have played to date.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, quite long but not enough characters (Nightcrawler or Quicksilver)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a nice funny alternative of marvel heroes except you only pay once (unless you want the DLC). pros- graphics are nice controls are easy to learn if you plug in a xbox controller it will automaticly turn into those controls cons- sometimes lags when exploring NYC ",
            "review_score": "1"
        },
        {
            "review_text": "My son and I have played this game for countless hours. It is by far, the best Lego game to date. They actualy voiced the characters this time. And its not pre recorded audio from a movie either. The puzzels in the game were easy enough for my 5 year old to figure out, but on occasion needed help. The humor from the previous lego games is there too. There is an incredible amount of characters to unlock. The ability for flying characters to go from the ground, fly around, and go into the sky up to the helicarrier is cool too. They built an entire city to explore and do things in. Many actual levels of pre scripted game play is avaible too. I highly recomend it for a 5 year old and up. Even as an adult I really enjoyed the game. If i had more than two thumbs, they would all be up!    My setup is a 4 year old pc with a geforce 460. Its an older video card and it handles the game on all the highest settings perfectly. I have a wireless Microsoft controller (is identical to the 360) that the hub it come with allows 4 controllers to connect to. I use an extra xbox 360 controller to play with it. From there, I have an HDMI cable running to my home theater system to play the game on a big tv.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, especially for Marvel fans, be they long-time comic followers, or new fans who just follow the movies. The story is mostly comic-friendly, and the roster includes over a hundred characters (more than any other Marvel game, I believe), including favorite icons like Spidey and Deadpool, and some lesser known classics like Moon Knight and Silver Samurai. And of course, the King of Cameos and Generalissimo of comic books, Stan Lee. :)  Gameplay is similar to just about every other Lego games. You go into various levels, collect studs, and defeat foes. And afterwards, return in Free Play to use other characters to earn minikits, red bricks, and new characters. Rather than having a central hub, like earlier Lego games, it follows the newer trend of having an open world, in which you can enter races, finish puzzles, and assist NPCs with tasks to earn Golden Bricks, which unlock bonus levels featuring new characters. And of course, it has the ever-popular custom character creators, which allow you to make your own character by mixing parts of other characters. It's very fun to see what combinations of superpowers you can create.  While Lego games tend to lose replayability upon hitting 100%, I'd definitely say this one, with a massive, diverse roster and many different extra tasks both during and after the story, is one of the most replayable. I would recommend this game to any Marvel fan, and to people who enjoyed other Lego games.",
            "review_score": "1"
        },
        {
            "review_text": "'But I'm Stan Lee'  10/10 would Stan Lee again.",
            "review_score": "1"
        },
        {
            "review_text": "woulnd't save file at 1.2%... attempting to reinstall. Otherwise pretty fun  Update: Seems like saving mid-game is buggy. Saves alright if you complete each level without a break",
            "review_score": "1"
        },
        {
            "review_text": "bad i unlokd stean lee but it only let me be him for a day",
            "review_score": "1"
        },
        {
            "review_text": "i just did this for the badge thing but the game is pretty nice",
            "review_score": "1"
        },
        {
            "review_text": "Great game but on the level where ur in the x-masnsion i have a glitch. At the very end of the mission when im about to defeat Jugannaut i cannot switch character to freeze him the beat him. It also stops me from changing characters in free roam and i cannot continue the story.PLS could i have some help.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Ive played nearly all the lego games and this is one of my favourites, its got an awesome Hub with loads to do. Only thing its missing is online co-op.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Really good game with a wide range of super powers, definetly more varied than previous LEGO games",
            "review_score": "1"
        },
        {
            "review_text": "does anone know how to get a mac patch for it 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, takes about 30-40 hours to 100% it.  The flight system takes a bit getting used to, but the huge roster and wide variety of playable characters makes up for it",
            "review_score": "1"
        },
        {
            "review_text": "==========================I Love this Game================================== - :D 9/10 very good game BUY it u will fin:D - can play in low-spec Computer in good FPS -much Marvel Hero - Have.....GHOST Raider I LOVE GHOST RAIDER With him motercycle -Epic Background  -Good Shader ,motion shadow and effect - Pls BUY IT!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I loved Lego Marvel the day I bought it because it doesn't follow any of the comics TV shows or movies. There are also a whole range of characters to choose from that I hadn't even heard of before. I also loved how you had to go through individual tasks to get each person. There are a whole heap of hidden areas to explore too. But the fun doesn't end there, even after you finish the levels there are a whole range of bonus levels that you can unlock with enough gold bricks! The one thing that could use a bit of thought though, is that you should actually be able to explore inside places like stark tower, the X-mansion and the raft. All in alll I think that it is a great game to play by yourself or with friends. I know my friend and I always love playing this game together. I would definitely recommend this game to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "A lego game that beats all the other Marvel games in recent memory.  ",
            "review_score": "1"
        },
        {
            "review_text": "I loved the concept of this Game, I never stopped playing this game, I was playing for hours. It's cool to see every Marvel Character out there, Including the ones that are super cool. Every second of this game I played, I enjoyed. I Hope more and more people can get their hands on the game, if they can, you're in for a real treat. And if some people can't get their hands on the game, You don't know what your missing, Game's super awesome!",
            "review_score": "1"
        },
        {
            "review_text": "yay controller support yay nice visuals yay runs great yay sale yay fun ",
            "review_score": "1"
        },
        {
            "review_text": "It is a very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Great characters. Great levels. But it needs more characters and more powers.",
            "review_score": "1"
        },
        {
            "review_text": "YOU CAN UNLOCK STAN THE MAN (STAN LEE) 10/10 F***ING AWESOME. story is good too..,",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to mess around with friends. Its too easy doe. Like I understand its for kids but even a 5 year baby can beat Street Fighter V so this would be a piece of cake.",
            "review_score": "1"
        },
        {
            "review_text": "much lego very marvel such awesome wow  11/10 would save the world again",
            "review_score": "1"
        },
        {
            "review_text": "All around a fun game, I loved that you weren't just replaying a story you'd already seen. The ability to truly fly through the overworld and levels added a lot of fun, as well as the many many Marvel heroes and their varied abilities.",
            "review_score": "1"
        },
        {
            "review_text": "First time i played a lego game.  -Playing with a friend makes this game 5 times better. -There are a lot of characters and a lot of different abilities. -Not serious as other games. There is no death. You revive every time you die, while losing a little credits.  ",
            "review_score": "1"
        },
        {
            "review_text": "I got this game because I wanted to play as different marvel characters, for example: Silver Surfer, Mysterio, Carnage, and etc. The game is very flawed in terms of logic (like why couldn't I just done that?}, but regardless still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year 2015 -Littledav  :P",
            "review_score": "1"
        },
        {
            "review_text": "Six-year-old child crack.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I've always loved Lego games, and this game really boosted that.",
            "review_score": "1"
        },
        {
            "review_text": "So lego marvel superheroes is that sort of game just like all of the other TT Lego games that is great fror the whole family easy to learn game mechanics so that anyone can play so mamy characters from the marvel universe that you dont know what to do with a great story that i wish could be turned into a live action movie or at least a animated film great side missions you can do allthough some of the gameplay does get repetitive at some points still fun to play lots of fun characters and even costumes for some of those characters good voice acting great way to blend x-men with fantastic 4 with avengers and so so many more differnt characters oh and what marvel property is complete without plenty of stan lee cameos as allways but to round this review off great game would advise anyone to buy if you love the pevious lego games and also if you love the marvel universe but yeah just go buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for fans of Lego or Marvel. There's so much to do in this game, not to mention it looks and plays great. I'm not a huge Marvel fan, but this is still one of my best purchases on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "Finished this over the weekend at about 22-25 hours, really good if you are a Marvel fan and just about every Marvel character is in the game. I enjoyed the humor and LEGO touch, even the story was decent. No mouse support for this which is no big deal because the controller is just fine, in fact I would recommend the controller over the KB controls. I enjoyed the open world and being able to choose any character available. I’m not into 100% completions that much anymore so after I beat the story mode I am pretty much done with the game. If you must have EVERYTHING the game has to offer then there will be plenty for you to do that’s for sure. Easily worth the $5 I paid for it.",
            "review_score": "1"
        },
        {
            "review_text": "The LEGOs pieces are cool and challenges are difficult to know",
            "review_score": "1"
        },
        {
            "review_text": "Got Howard the Duck. Nuff' said...",
            "review_score": "1"
        },
        {
            "review_text": "I like this game very much. it is fun to play with lego marvel characters and i am never bored while playing.  10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "its the best game ever",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Probably the greatest Lego game I have played, completed 100% and didn't want it to stop! If you're on the fence about buying this then I really think you should!",
            "review_score": "1"
        },
        {
            "review_text": "This game was so much fun to play through and i just loved being able to transform, fly, smash, and do everything else i could do in this game, the only con i could find was that buying one character could cost more than an arm and a leg.  I give it a 9/10 and i recommend buying during the xmas sale like i did",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to mess around with friends. Its too easy doe. Like I understand its for kids but even a 5 year baby can beat Street Fighter V so this would be a piece of cake.",
            "review_score": "1"
        },
        {
            "review_text": "this game rules theres nothing bad i can say ever its funs its adventerus and a bunch of rilly cool other words that i caint think of right now but anyways buy buy buy thanks lego for being so awsome",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Best Lego game to date. (Have played them all including Star Wars collection, Indy, Batman, and more...) Just another well put together game by TT and fun for the whole family. How many other games can an adult and a 4 year old play side by side and still enjoy it immensely and complete tasks? As always, puzzles are fun and not too challenging for little minds, great use of visuals, sounds, humour and well scripted. Good level design and the best open-world free-roam play option of all the Lego games I have seen. Ability to choose any unlocked character at any time, just makes sense! Completed 100% in around 18hrs of gameplay - with young kids. Many months of replay value in this for kids - the adults can move on to the next one! LEGO games rock! Fun. Safe. G-rated. Great value!",
            "review_score": "1"
        },
        {
            "review_text": "Fresh LEGO game",
            "review_score": "1"
        },
        {
            "review_text": "A high water mark for the LEGO games. A ridiculously large roster, simply character-based mechanics, and relatively simple puzzles. Play splitscreen with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "This game is exactly what it is supposed to. A fun challenging co-op game, that builds on the new LEGO tradition of creating LEGO counterparts to already established franchises, and doing it with the typical LEGO humor.   The character roster and diversity is HUGE, the missions are immense and with high replay value (using different characters to unlock new things), leaving you and your son with something to do at all times, with mini quests, and unlockables that will keep you busy for days. The game itself has great visuals and sound, the established standard LEGO playability on one of its best implementations. As usual, you have the option to customize your LEGO characters, and what is the best setting than a super hero game to do so?  The game can obviously be played on single player, but where it shines is on co-op (just be sure to adjust the split screen mode to what is less confusing to you, as the dynamic split screen is not perfect).   A must buy to parents that are looking for a fun, good action game packed with nice puzzles to play with their marvel fan sons.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game I got it onn sale for 5 dollars and it is so worth it the open world is amazing and it doesnt take much of a computer to run it , it is a must buy for all computers as wellas the new game lego avengers both are very fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. A must play for any fan of LEGO games or just Marvel in general.  On the LEGO side of things, this is by far the best LEGO game I have ever played. The fundamental gameplay mechanics are generally the same across LEGO titles, but this game expands on that by giving you an open world to play around in when you're not actively in missions (in contrast to the smaller hub-style areas from other games). This alone gives the game so much more replayability as you don't feel necessarily confined to repeating the same thing over and over again.  On the Marvel side of things, they nailed it. I've never played a game that so perfectly captures the greatness of Marvel's universe. There are so many characters to choose from, and it's been quite fun seeing who they decided to include in the game. There are a couple major characters that I think are missing (Quicksilver, for example), but there's loads that I was pleasantly surprised to see playable (Squirrel Girl, Moon Knight, Rescue, etc.). The game as a whole is very respectful to the source material, but does the typical LEGO thing where it pokes fun at the silliness of everything. It's tastefully done. If you like Marvel but don't like LEGO gameplay, you may still enjoy this for the fanservice alone.",
            "review_score": "1"
        },
        {
            "review_text": "I have finally 100% this game and boy was it fun. The open world aspect is cool and all the missions are memorable, the lego characters are great and some are really funny (Deadpool making a joke that the lego devs are lazy) I kinda like the voice acting but I do wish it was the actual voice actors from the movie.  The only problem that I had with this game is that at first the controls were a bit akward but after about 10 minutes I mastered them, and my only other complaint is a bug that haunts all lego games; where a character might get stuck and breaks the game. (Luckily this game has a checkpoint feature so you can use that and not restart a certain mission)  If you like Lego and Marvel you really do owe yourself to get this game, wait for the summer sale which starts soon ;)",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game 7/10 i would recommend playing open world while doing the missions again so once you beat freeplay you arent bored of doing missions over and over i dislike the fact that some redbrick's are (like multipilers) are only avalible once you have most of the characters  but all in all it is a good game   ohh and team cap fans you can beat up tony stark in his underwear  ohh and deadpool, nuff said",
            "review_score": "1"
        },
        {
            "review_text": "SO MUCH FUN. This is the only LEGO game I've ever bothered to 100%, and it was 500% worth it (aside from the Silver Surfer, who I am still a little bitter about the cost of $1mil gold studs when he does very little other than look cool :P )",
            "review_score": "1"
        },
        {
            "review_text": ":) :) :) :) :) :)",
            "review_score": "1"
        },
        {
            "review_text": "Good all round no pressure gaming. Some other users report bugs but i had a smooth experience throughout. Who doesn't like Marvel's Superheroes.",
            "review_score": "1"
        },
        {
            "review_text": "Simply a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Great game for kids, but its quite a lot for them to keep track of during the game so be prepared to help them out when they are stuck. Now saying that,this is one of the few games where I actually dont mind doing that at all. Massive sandbox game world where they can do whatever they like. Missions are not too hard and there is plenty of characters to be had. Only let down is flight controls wich is a bit hard. Recommended :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game I reccomend it to people who liked the other lego games My only complaint is that the gameplay is kind of repetitive It's a lot like the other lego games. But if you are new to the lego franchise then I definitly recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Game is like putting lego bricks together.",
            "review_score": "1"
        },
        {
            "review_text": "109 hours??? Must have left it on over night a couple of times but still.. best LEGO game to date! I HAD to finish it all, find everything, unlock every achievement! A very addicting game! But worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is similar to most Lego Games (mix of action and puzzle to go through the levels). The amount of unlockable characters is huge. Outside of story levels theres a really big open world city map with tons of secrets, challenges and extra levels, which is also fun to just generally fool around in. If you like Marvel and/or Lego this game really is a must-have.",
            "review_score": "1"
        },
        {
            "review_text": "Really loved this Lego marvel game. Has great open world and is really fun!",
            "review_score": "1"
        },
        {
            "review_text": "First off, I love LEGO games. Seriously. Lego Star Wars: The Video Game was my very first video game, and it still holds a fond place in my heart. That being said... I don't know if I'd necessarily recommend this game or not. Here are my opinions, and you can decide: PROS: -Free-roaming is one of the best aspects of gameplay in LMSH. -The sheer amount of characters included in the game (including people you never see in a Marvel game, like Psylocke or the Guardians of the Galaxy, or Phil Coulson, or Stan Lee himself!). -The team pair-ups in the levels themselves are very pleasantly unorthodox, such as Captain America, the Thing, and Storm teaming up. -The story in LMSH, while drawing elements from the Marvel films, is totally original and manages to connect to the comics fairly well. -The character creator allows you to make some very fun combinations (for example, I gave Thor's hammer to Mary Jane Watson). -There is a huge amount of attention to detail in the design of the levels, the overworld, and the characters in particular. -Every car you see is more than willing to let you just jump in and 'borrow' it for 'official superhero business.' -Everyone (and I mean EVERYONE) makes bad jokes or puns throughout the game.  CONS: -You NEED to play this with a controller. There's not really a good way not to. -There are a lot of small bugs and glitches in the game, such as characters taking too long to switch between, or someone's arms disappearing. -Some of the hitboxes or ranges on the different powers/abilities are not very clear or consistent (i.e., activating a power from right beside an NPC or several feet away from them sometimes doesn't work). -The character creator, while it has A LOT of combinations, is sometimes very goofy in the way that some of the combinations work together. For example, I paired Wolverine with the Human Torch, and the character got all of the shared powers except flight.  -If you are not playing with two people, the second player's AI is garbage. Often times they will get stuck in a location, or go off somewhere else just when you need their help. -The levels themselves...just aren't very fun. Numerous times throughout my playthrough I found myself completely confused about what I was supposed to do, particularly during the boss fights. The hint system for the Minikits and overworld locations is sometimes just as bad. -For me, there was not a lot of replayability in LMSH. By the time you unlock all of the characters, you've essentially done everything the game has to do several times over, so even though I had gotten some characters I love playing as, there was nothing left for them to do...besides run around and 'borrow' taxicabs.   While this game is fun, it feels a bit hollow. 7/10",
            "review_score": "-1"
        },
        {
            "review_text": "Cant get past time sqaure mission or fighting doc oc beacause i cant change my character in the mission so theres bnothing to do i got a refund but still want to play :(",
            "review_score": "-1"
        },
        {
            "review_text": "Play on the console and remember: you must perform everything in the order the developers set for it, so see that wall over there? no, you can't get past it flying with Iron Man, you have to do an intricate ♥♥♥♥♥♥♥♥ set of paths to break it so ........................................ Hulk can get past it (oh, was that him I saw leaping from skyscraper to skyscraper on all movies and comics? nah, my imagination).  Even kids will cringe.",
            "review_score": "-1"
        },
        {
            "review_text": "I have found a game breaking glitch that prevents me from moving on. while fighting Juggernaught in level 8, the game wants me to press U to switch characters...the game wont let me. i have tried to restart steam, restart the game, even reset the game but it will always prevent me from completing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for the easy fun found in the Star Wars or Indiana Jones LEGO games you won't find it here. The game has gotten clunkier with each edition. The open world Manhattan is confusing and makes going back to get characters and blocks a huge pain. It's still fun to collect coins, but overall getting 100% in this game is a real chore",
            "review_score": "-1"
        },
        {
            "review_text": "NEEDS MOUSE IMPLEMENTATION BADLY!Not everyone owns an XBox 360 controller.Great game...very poor port.Since this is supposed to be a PC game sales platform I cannot recommend it for PC gamers.What a shame!",
            "review_score": "-1"
        },
        {
            "review_text": "Open world isn't very impressive.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible, in every aspect. Don't buy it. The video cuts are long and can't be skipped even after you die. The controlls are awkward and make no logical sense. The game itself is frusterating and unfun as a result.",
            "review_score": "-1"
        },
        {
            "review_text": "Beware game plays smooth untill final boss battle a glitch in the game pervents player from getting rid of rubble on parts that needs to be destroyed that can't be removed so your stuck and can't finish the game, I read that changing the settings fixes this but game keeps reverting back to original settings.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible plot, flawed game design, bad charcters, bad systems for everything. I bought this during the Warner Bro.'s Publisher Sale for $5.00 USD. It was not even worth that. Huge waste of money, and time. Problems with so many things, I can't even list them all. Within the first level I had to reset 6 times because of players getting caught, poorly explained mechanics, and a broken engine. When I finally did beat the level, the game crashed! The entire theme of the plot and dialogue is heavily geared towards children. Do not buy this, even if it's own sale. Only ever play this if somebody is paying you to do it.",
            "review_score": "-1"
        },
        {
            "review_text": "I had no problems playing the demo version of this game, however when i bought this and started the game, it says my video card does not support Shader Model 3.  My CPU is Intel Core i5-3330S CPU together NVIDIA GeForce GT 620 with DirectX 11 installed.   I feel ripped off.   As i've found out ins some forums, the launcher probably used a terrible way of determining what's supported by the card. It probably checked the model against a known list of existing cards (for the time), rather than actually probe the capabilities of said card.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game mistakenly thinking that it had multi-player. There is zero option for on-line multi player in any way, including local network. It is only possible to have multiple people playing on one PC. I suppose that I should have researched it beforehand, but I find it very stupid that LEGO games, which are so geared towards co-operative play do not allow for on-line multiplayer. I now regret buying the game because I only bought it as a fun causal game to play with another person who lives far away.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed the early LEGO titles and played them to completion, but their games have been going steadily downhill. Including voice acting took away a lot of the cool creative aspects of their games. This one fails on sheer mechanics. Iron Man's explosives would target, but not blow up the items they were supposed to. Spider Man would hook on to a handle but the spastic mechanism (press K repeatedly until the progress bar fills) wouldn't work. Similarly the Hulk would let go in the middle of a progress bar. This game may work on a different platform, but I couldn't finish the first segment do to shoddy implementation.",
            "review_score": "-1"
        },
        {
            "review_text": "I wish I read the reviews for this game before purchasing. It's broken. Don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Like most LEGO games I played a few levels and got really bored. I think this will be the last one I ever purchase. It's a shame, because they could do so much more with this type of thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible Controls, Does not respond to game pad controllers, does not even recognize them. I have played the previous games and they worked fine, this is utter ♥♥♥♥ing crap",
            "review_score": "-1"
        },
        {
            "review_text": "While the game is fun and addictive, you will most likely expericance freezes and craches. Game feezes on random levels (more in the higher levels) despite what hardwhere you have.",
            "review_score": "-1"
        },
        {
            "review_text": "This game literally has no mouse support whatsoever. Do not buy it on PC.",
            "review_score": "-1"
        },
        {
            "review_text": "Beware! NO mouse support at all. You can't even use the mouse in the menu. Also graphic settings are very basic, you can't even play in windowed mode. Why is there no BIG BOLD text on the store page warning about needing a controller.",
            "review_score": "-1"
        },
        {
            "review_text": "People can be quick to deride a game as being a poor console port but in this case it is true and no attempt has been made to hide the fact.  I really wanted to like this game but stuggled with the controls and finaly gave up. I might have another go at a later date but its well down the list now. Can't see me buying any more Lego games based on this experience.",
            "review_score": "-1"
        },
        {
            "review_text": "I love all the Lego games but to always have Lego Marvel Super Heroes freeze every. single. time. I complete a level, then have to Cntr Alt Delete to quit the program and then restart if I want to continue playing the game gets very tiresome. Additionally, players sometimes get 'Stuck' mid walking.  My computer is up to date and everything is patched, I put the parts in the computer myself.   If it were not for all the glitches, I would reccomend.",
            "review_score": "-1"
        },
        {
            "review_text": "ok, so i love this game so much. its so fun and i think its great... on PS4. yeah, i paid money for it on the pc and i bought both of the DLC's for it. but oddly enough, i haven't actually legitly played it yet! the reason being is that ( and i dont know if anyone else has this problem ) when ever i go into any menu of some sort, whether it be to actually save the game, or even to PAUSE it, the controls seem to not work. what i mean by that is when i press any keys, i doesn't exactally do anything... at all. so i really hope that SOMEONE actaully reads this and can help me.    Sincerely,  Sicarius Scrolls",
            "review_score": "-1"
        },
        {
            "review_text": "Great for like 1 hour. I'll give it a try another time.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, and for windows it probably is great. However, if you have the mac you may experiance a game stopping bug. On 8th level boss fight, you will be unable to change characters at some point during the boss fight. if I was able to finish the game it would be great. As is, I will have to down vote it.",
            "review_score": "-1"
        },
        {
            "review_text": "crashes  ",
            "review_score": "-1"
        },
        {
            "review_text": "i love the game but after he fight with the juggernaut i cant switch characters to finish him off",
            "review_score": "-1"
        },
        {
            "review_text": "For a Lego game, I was slightly disappointed with it. The storyline is pretty weak overall and it's mostly just the bad guys stealing from the good guys and the good guys failing horribly at getting back at the bad guys.  The story also was quite bland and had the same tone all the way through. I can't say I was 'captivated' by it and kind of had to get myself to finish the rest of it. It did, however, get interesting when on the final chapter (Spoiler)   Galactus   appears and wants to try consume the earth. I wish they expanded on this more instead of leaving this to the very end, since you sort of get lost on what Dr Doom and everyone are actually trying to achieve. 4/10  The other thing that annoyed me in this game was the lack of guide for the navigation. All the missions are all around New York, which you have to roam around in to actually do the missions. There are also no Tooltips when you go over the map, so you kind of have to explore and find out on your own to figure out what anything meant. 5/10  Never the less, there are some great parts to this game. I felt characters were portrayed pretty good and a lot of them still had their amazing sense of humor. You even see deadpool between chapters, just casually watching on the side any not doing anything. You even see him steal a pizza from a pizza guy. Absolutely amazing. 8/10  The mechanics were also pretty neat. You can swing anywhere you like as Spiderman so easily with his webs, which looks amazing but also makes navigating New York so much more fun. He even sticks to walls when you hit something. They also put so much effort into other characters, like Venom and Sandman. I loved how you could roam around as them, still be able to do absolutely everything but still retain that awesome feeling when you do it. 9/10  Overall, I rate this game 6/10. Still fun, but quite disappointed in a lot areas of the game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This looks like a fun game, but it simply can't be played effectively without a controller. The key mapping is one of the worst I have ever experienced, and on top of that if you make the mistake of enabling split screen by pressing F2 you won't be able to disable it. Frankly I don't feel it is acceptable to not do a better job of porting such a important part of a game as a control scheme is, in the second decade of the two thousands.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the first lego game I tried, and I found it clever and entertaining at first, but quickly became repetitous. Endless button mashing, and basically repeating the same puzzles and fights over and over with different charters. Seems to be geared towards pre-teens, in that it requires zero instinct and zero problem solving skills. Way too much emphasis on gathering coins. Way too much button mashing. Unlocking the different Marvel characters is cool. In fact the highlight of the game is the way they gave the characters great personalities and gag lines. Too bad the gameplay was too lame to keep me instred for more than a few hours. A great idea that gets bogged down in unimaginative gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "There is no mouse support and the controls are awful. Stick to the console version.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start off by saying that it is not a bad game. This is my first LEGO game, and I thought that I should start with the one with the best reviews.  It is a very casual game that offers no challenge, unless you are trying to 100% the game, where you will find a challenge collecting 5 of the 250 items thet are needed. You literally cannot lose a level, as if you die, you respawn right away. It seems that this game is aimed at children, and in that case, I it´s ok. JUST ok. And I don´t mean it for the LEGO pieces, just the gameplay. Two other things: It is gltchy: the characters get stuck all the time, which is a little troubling, given that it is an AAA game. Movement sucks: Oh, man, i´ve never seen worst flying controls. They are downright frustrating. Say, you are speeding towards your target and need to go down a little, so you push the X button. Oh, that was not enough, so you push the X button a little more. Sorry, two X button presses means stop flying altogether, so now you are plummeting towards the ground mid-race. I´ve been making a mental list of all the things that were flat annoying, but I forgot the most of them and only the infuriating ones remained.",
            "review_score": "-1"
        },
        {
            "review_text": "never been able to play this game for some reason, when i click launch it just shows me a black screen then brings me back to my desktop... please can anyone help me, i spent money on this! and i really wanna play it!",
            "review_score": "-1"
        },
        {
            "review_text": "Slightly confusing storyline, not very fun in general compared to the other lego games.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is trash, played the lego starwars series and loved them. unnecessary open world, cheesy dialog and painful gameplay... if you want to have fun do not buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont get this game because it freezes all the time and it is really unresoponsive with the controlls and it crashes alot for me. I tried to play with my friend but co-op is so laggy it makes my game freeze about 20 times in 10 seconds.",
            "review_score": "-1"
        }
    ]
}