{
    "app_id": 249190,
    "name": "Ancient Space",
    "release_date": "2014-09-23",
    "developer": [
        "CreativeForge Games"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Space",
        "RTS"
    ],
    "achievements": 30,
    "positive_ratings": 136,
    "negative_ratings": 168,
    "price": 14.99,
    "description": "Ancient Space is a story driven single player real time strategy game where you take command of a fleet embarking on a scientific mission to chart undiscovered reaches of space called ‘The Black Zone’. Overcome overwhelming odds and fight for your life and the survival of your ship and its crew.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249190/header.jpg?t=1447358499",
    "minimum_requirements": "OS: Vista 64 bit/Win 7/Win 8 Processor: 3.10GHz Intel Core i3-2100 Memory: 4 GB RAM Graphics: Nvidia Geforce GTX 460 or AMD equivalent Storage: 20 GB available space",
    "recommended_requirements": "OS: Vista 64 bit/Win 7/Win 8 Processor: 3GHz Intel i5 quad core or equivalent Memory: 8 GB RAM Graphics: Nvidia Geforce GTX 660 or equivalent Storage: 20 GB available space",
    "reviews": [
        {
            "review_text": "I'll expand upon this review later as I play through more of the game. The time that I've spent on it so far is merely a review of my first impression of the first 5 missions.  Compared to other RTS games, this game doesn't really do anything that better games, such as Homeworld, haven't already brought to the table. The difficulty is pretty damn hard due to the way the AI are unfairly given so many units that are all thrown upon you. The game is not difficult because of an intelligent AI, but more because you have to face overwhelming numbers most of the time which sometimes leaves you feeling cheated when you're beaten.  Example: In mission 2, you have to face roughly 50 units with your 12. The enemy are given battleships and frigates and many fighter squadrons. You only have a carrier, a battleship and 9 squadrons of fighters/bombers. You cannot build frigates yet, and frigates are good against fighters, so your fighters get mowed down while they try to hit the enemy fighter squadrons which counter your bombers. Even then, frigates are fairly decent against bombers, which doesn't make much sense. To win, you have to have your fleet at the center of the map where your turret's angle of fire (if you haven't built many turrets, you are screwed and have to restart; the trigger which spawns all of these units is unexpected and you won't have enough time to build the turrets to counter the threat) can deal the most damage on the incoming enemy units and allow you pick off the early incoming units one by one until the battleships arrive, rather than having a massive wall of enemy units focusing on your mission critical capital ships (if you lose either the carrier or battleship, you fail).  To each mission, there is a specific formula to how you should beat each mission (e.g. you have to build/upgrade these units, attack these units at this time, use this special ability etc all in this order to win the mission, you will find it extremely hard to do it any other way). This then becomes a gruelling trial and error affair where you have to figure out the formula and win, which sometimes frustrates you to no end and limits your tactical options to win the mission. Some tactical choices you make earlier in the mission render the later part of the mission next to impossible to win, resulting in you having to go back and restart.   This game looks pretty much your typical RTS game, but not what you'd entirely expect. It may not introduce many new things to the genre, but it does keep you on your toes and is unforgiving. This can be interesting, especially for people who want a challenge.  I do not wish to give this a negative recommendation, I'd rather give it a neutral rating (some will hate it, some will love it, some will think it's just okay). But, since there is no such option, and I'd rather lean a little to the negative side, I have given it a negative recommendation. I'd suggest you wait for the eventual sale to come around if you wish to get this game, just incase you get disappointed with it.",
            "review_score": "-1"
        },
        {
            "review_text": "You can move verticaly but there's not really any reason to. The maps have obstacles that you can't go over or under so it might as well be a two dimensional map. Its actually about controling teritory by capturing key points and is not really a fleet combat game. It has more in common with Company Of Heros than any 3D space game. Having said that, its not a terrible game for 20 bucks. Its just not quite as advertised. I played a few missions and had a bit of fun but mostly it just made me want to play Homeworld again.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the real Zen Fish Simulator we deserve!  Command your fish in the inky black and beautiful fish tank to attack the enemy fish, protect the important fish, escort valuable fish from one part of the tank to another etc.  (Seriously I have never seen a spaceship game with ships that are more like fish: the ships bob up and down while changing course and leave trails as if it's a disturbance in the water. It's a good thing in case you couldn't tell. Very relaxing).  (Also if you wonder if it's like homeworld, yes it's pretty like homeworld at least as far as I remember).",
            "review_score": "1"
        },
        {
            "review_text": "I like what this game is trying to do. Single-player story-driven RTS? Hell yes. Beautiful space environments? More please. Three dimensional space combat? I want it! Sadly, as much as it pains me to say this, there are just too many flaws in the execution for the game to be as enjoyable as it should be.  Let's start with the worst - there are some serious technical issues going on here. I've had the game hang permanently once, and I've had a save file corrupted, which I'm honestly not used to seeing in games these days. I also had a gamebreaking bug in the mission Psychonauts (I think that's Mission 7?) where the object tied to a mission objective simply never appeared, forcing me to enable cheats through a config file and auto-win the mission. This kind of stuff is a real shame, doubly so because the game seems to have been abandoned fairly quickly after launch, with no hope of patches.  Less utterly broken, but still really bad, is unit pathfinding. It can be incredibly difficult to get your units to do what you want, especially if you're trying to make use of 3D movement. I've repeatedly tried to navigate my fleet above or below objects in 3D only to have them move back down to the basic plane of movement, putting them in the way of enemy fire or getting stuck behind obstacles. Units also seem to sometimes just forget their move orders, and some abilities seem to break sometimes. The Dreadnought, for example, has a triple-blast cannon ability that obliterates buildings and does heavy damage to units, but sometimes it just doesn't seem to fire all or any of its shots despite triggering the cooldown. All of this means that half the time unit command is smooth, and the other half of the time it's infuriating.  Even when it works, the gameplay design isn't flawless. Issuing targeted commands on units that are closed together is tricky, requiring you to pause and angle the camera to select what you actually want rather than all the icons beside it. A lot of combat must be either really difficult or finnicky, because I spent a lot of time waiting around to build up my forces before tackling tougher points of resistence, as going in full-force is often your only hope.  The game does indeed look great, but unfortunately it's best to play at a distance a lot of the time, so you see the unit icons much more than you see the detailed units. The sound design and music are well-done, the cutscenes look cool, and the story overall is fairly interesting, though there are a few predictable beats (sudden but inevitable betrayal!), and a few threads left hanging that, I fear, will never get resolved in a sequel.  Ultimately, it boils down to that - Ancient Space has some good ideas that are marred by poor execution in a few key areas, and it's really begging for a sequel, or a massive patch, that fixes these things. Sadly I doubt it will get either, and as such I can't really recommend this unless you're willing to deal with a fair amount of technical frustrations while playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy this on sale. $5 would be a great deal.  Pros: Homeworld-style space game with 3-dimensional movement. Campaign is decently long. Looks pretty good. Fun enough while it lasts.  Cons: Lack of story development. Not immersive. Viable tactical choices seem limited. Fleet and Flagship customization options are severely limited. ",
            "review_score": "1"
        },
        {
            "review_text": "I do enjoy this game. Its not another Homeworld but definitely has some of its aspects. There is a lot of depth to the strategy in this game and is decently challenging. The story is told through an interesting string of voice messages and communications between officers. The voice acting, music, and overall ambiance is very well done. It really immerses you in the game and gets you completely involved. The art is beautiful and I could stare at a map for hours. I definitely appreciate the effort of the artists as even the spacecraft have rich detail. The environment itself is amazing to look at.  My only complaint would be its rather slow pace. I tend to like faster-paced RTS games.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting RTS, in fact I would believe it would be safe to say this is the only interesting RTS I've played in a very long time. It makes a good effort to bring a lot of stuff to the table but can't help feeling that if they focused more on certain aspects it could have been a lot better. Seems like they threw ideas at it and saw what stuck. It is a game that is frankly screaming out for multiplayer and modding. Onto the bad parts.  The unit cap is frankly ridiculously low and you have to micromanage quite a few units. For a game that is supposed to be emulating parts of Homeworld it tends to throw you into the storyline and universe rather than introduce you to it (yeah sue me, but can't deny Homeworld series did actually have a good story). You'll spend more time paused and zoomed out than anything else which means you aren't really wow'd by the scale, combat or environement.  Worth it for a couple of quid but nothing more. The praise really comes from the effort they put in to make it interesting. There really hasn't been an RTS that has tried to be this interesting since Company of Heroes, perhaps Men of War (though that's more RTT).",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game. A little too easy once you understand it and exploit certain abilities, but a lot of fun. Hope they make a sequel, but I have a feeling it won't happen.",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly good! Feels like Homeworld. But Homeworld is much more better but this is just another good game on the same genre. Just get it when on sale!  Sorry I have no in-depth review at this point.   7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game had really good bones, gorgeous artwork, interesting units that did interesting things, it just didn't come together. It felt like a too many cooks situation. And then the waiter came in and just grabbed all the half done dishes and tried to convince you it was a proper meal.  After finishing the game I was left with the same feeling I had after watching the movie Prometheus so, if you're the guy who likes to pretend that wasn't a train wreck, you'll be the guy who likes to pretend this is a great game and everyone else just doesn't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "Cons: This game is terrible. Skills that should be autocast are many. Doesn't feel like a space RTS at all. More like submarines or something. Odd controls for a 3d environment and the Z axis adds no depth to the game. Game mechanics are incredibly simplistic and uninspired.  Pros:  Everything is incredibly smooth and refined. Definitely top tier quality polishing.   Paradox Interactive has some amazing/legendary games but this is just a dissapointment. Maybe it it just wasn't the game I wanted that I thought I purchased.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game Wish Multi Player! ",
            "review_score": "1"
        },
        {
            "review_text": "Crap. Tutorial tells me on step 2 to pan horizontally. Mouse moves camera, WASD moves camera view...nothing triggers to move on to the next step. Its not that I cannot understand how to do it, it doesn't tell me other then  WASD/Mouse...What?  What exactly triggers the next step and am I supposed to move what...camera view? The lone drone sitting in front of me, selected the view just pans again....lost interest. Gaming companies need to dumb down their games on the UI front or make the tutorials more friendly by explaining exactly what it is your are doing, not following back on standard WASD keys to explain it all (example, WASD makes some units in games move left/right/forward/backward but other games also use WASD to look up on flat planes and yet other games use finer controller of a seperate component to spin faster then Ancient space...which does nothing but spin point of view while facing in one direction - step forward, step back, step forward right, step forward left...and my complaint about this game was nothing changes)",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing RTS games since C&amp;C. The Homeworld series has, since I first played it, been one of my all time favourite RTS series. The gameplay was simple, intuitive and elegant. The ships had interesting designs and looked, for the time and even now, beautiful. The Avatar looked like a brawler. It oozed a kind of raw power. It was a moving chunk of armour that was armed to the teeth. The Qwar'Jet, it's Taiidani counter part was equally as daunting. The units were varied, several different kinds of fighters (of which the Taiidani were the more visually interesting in my opinion). The fighter furballs raging around formations of assault frigates and walls of Ion Cannon Frigates to the destroyers and cruisers duking it out in battles of attrition were spectacular. Following trails of your fighters as they jinked, dodged and spun through enemy formations, firing pot shots at what they could or covering each other. It was and still is visually stunning.   Even though there were only two or three characters, Homeworld had ambience to spare. Certainly the gameplay of the second trumped the first at the cost of the ambience and much of the heart and soul. It's gameplay was superior, even if the number of usable fighters and ship classes were halved, the changing of individual fighters to squads cleaned up a lot of the flotsam of maintaining your fighter's numbers. It was, in my opinion of gameplay, superior. I was seriously disappointed that there was no Homeworld 3 and I'm hoping against hope that Gearbox don't ♥♥♥♥ each and everything up with the remake and possible sequel.   Why these two paragraphs about Homeworld in a review for a completely different game? I just want people to understand where I'm coming from when I say that Ancient Space is a mess. It's gameplay is overly convoluted and needlessly complex. The camera controls are utterly awkward and I wouldn't wish them on anyone. This game would have been far better if it had simply stolen a page from Homeworld in terms of it's controls. It would have been better for it. Graphics, ship designs (which are hideous) aren't aren't worth considering in my opinion as important. It's all gameplay. This game fails miserably in it. I just can't get over how bad it is. I'm going to give this game another try later, I have a week off in a few weeks and I'll make sure to try it then where I can dedicate proper time to playing it. Till then, I would strongly recommend avoiding this.",
            "review_score": "-1"
        },
        {
            "review_text": "Its poor homeworld clone, with a lack polish.  Its also very 'checkpoint' based, the enemy will spawn XX numbers infitite number of times untill you do pass a checkpoint. And then you do the same thing again.",
            "review_score": "-1"
        },
        {
            "review_text": "Cashes very poor pathing with units getting stuck back visuals  not recommended",
            "review_score": "-1"
        },
        {
            "review_text": "Well to be honest worst stuff I have seen in years.  Did Crash 2 times by try to start the game.  After I was In, its just 3 random missions for singleplayer you can choose to play ? And some kind of really boring story. Extreme, extreme slow game speed. Without any ability to speed it up.  The AI or Bots are so stupid and easy to kill of.  i like RTS games, its one , but not even worth the time I did spend.  You just look at ships move to target in a big group and kill of turrets and small enemy units. Well you command here around a group of 10 Ships , the fly slowly to target , there are just location they move and shoot small fighters or turrets down.  No Strategy or Challenge or what ever.    The Entire Battle is just select you group of ships, move them from A to B and shoot down turrets and weak fighters , repeat.         To fix this game must be done a lot of stuff, really lot.   1 Game Speed Controls. 2 Why did they make this game so lame ? Its even slower than Homeworld. 3 Generally increase the speed of the game like at least double it. 4 Fix the Camera movement and icons here. 5 Fix the starting of the game, 2 times to crash isn't really inviting to keep it. 6 Fix description of Missions, like show the map you will be play. Well in each RTS if you selcet a map you see , how it will be lloking like and where you will start and so on, not here. 7 AddReal Skirmish, not Random move and kill of Turrets, vs Bots Army. 8 You can't change here resource gathering speed. 9 Different Factions. Not Just random red colour enemy.    And much more......  This one just doesn't feel like a video. It feels more like we put stuff together and hope its alright.     So Again. Its just not playable.    Here is no Skirmish. 3 Mission maps you can play and Story isn't enough. Even for 1 Euro. The Game must really be redesigned by its speed. Bigger Icons for unit you buy and bigger Text so you can read it. Its extreme small Text lines over small squares of units.  Make a Side bar and double the Size of these 'unit Icon' Squares and triple the Size of the Text Description for the Units, you can't just see it.",
            "review_score": "-1"
        },
        {
            "review_text": "performance is crap ; dont even expect to get 60 fps with GTX970 in Sli and a i5@4690K@4,5 HZ !  This game is a big joke if it has performance problems and devs are stating that 30 fps is the best performance a PC gamer should have..   yeah i wonder which consoles the devs got this year...",
            "review_score": "-1"
        },
        {
            "review_text": "I did have some graphic's issue's at first but,  after getting help from some other steam user's they figured out the they game defaults to the on board graphics thats why the game was running slow. if any of you who bought this game are having the same issue check out the comments on this post, they even tell you how to do it the fix.  in light of the fix i have to say the game is pretty awsome.. hope this helps",
            "review_score": "1"
        },
        {
            "review_text": "Sorry, I really wanted to like it but just couldn't. Nothing overly wrong with the game, just nothing overly right either.",
            "review_score": "-1"
        },
        {
            "review_text": "I was drawn into trying this game on basis of the idea it was about discovery and exploration in the face of a hostile, unknown force... but all the mystery was quickly swept to one side in favor of near-immediate conflict. My stats say only 20 minutes, but given that I fought several battles during the tutorials without LEARNING much of anything about this 'Black Sector', I quickly lost interest.  I'm okay with RTSes, but without a good story hook they just tend to bleed into one another for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This game isnt bad but involves alot of micro-managing unit movements, not something i really enjoy. if its on sale and your looking for something to kill a few hours grab it.",
            "review_score": "1"
        },
        {
            "review_text": "i love the score music and i also love that it involves arculogical space exploration kind of a prometheus setting i think the game is pretty neet , they should make more games about arculogical space travel , mabye next time do a space exploration version of uncharted or smethng but i loved the game im still in tutoring mode but i have gotten the hang of it its a great game ,  ",
            "review_score": "1"
        }
    ]
}