{
    "app_id": 249330,
    "name": "Unholy Heights",
    "release_date": "2013-10-04",
    "developer": [
        "Petit Depotto"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Tower Defense",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 1120,
    "negative_ratings": 126,
    "price": 2.79,
    "description": "Welcome to Unholy Heights, a mashup of Tower Defense and Apartment Management Simulation! The Devil has converted a tenement building into monsters-only housing, and has big plans for the future. Sucker monsters into moving into your building, charge them rent and keep them happy by buying them furniture.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249330/header.jpg?t=1555566426",
    "minimum_requirements": "OS: Windows XP (SP3 or newer) / Vista (SP1 or newer) / 7 Processor: Pentium III 1.0GHz or faster Memory: 1 GB RAM Graphics: Shader Model 2.0 or better Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Let me tell you about Popan.  Popan was the first baby ever born in my apartments. She was a Cheepy so I didn't have high expectations. Popan was probably 3 days old when her parents died in an unfortunate ambush on my complex. I had a ton of other tenants, so I didn't see the harm in waiting for her to grow up. Somehow, she never became in debt. This ♥♥♥♥ing baby was paying the rent. She grew up to be a total badass. She would single-handedly wipe out entire waves of enemies without breaking a sweat.  Popan is obviously popular and well-known throughout the land, she easily finds herself a guy to shack up with. He's weak and dim-witted; a farmer named Peecone that watches tv 90% of the time that he's home. It doesn't slow Popan down though, she easily slays the first main quest adventurer all by herself while all the other tenants are at work. She returns immediately and has victory 'pillow-talking' and immediately has the child they have been trying so hard to have. A girl named Chaan, that is impossibly strong as well. Popan and Chaan were ♥♥♥♥ing ruthless, the perfect mother-daughter duo. Then Peecone stops paying rent, or so I assume, as I thought the world of those two divas but not so highly of farmer Peecone. I keep lowering the rent hoping they'll stay, I evict Peecone hoping it will fix the problem. It helps! They are back in the green in no time and happily tending their garden and watching tv together. Then it all goes down hill again. Popan robs the cradle with her next man, the neighbor boy, Pyo, not much older than her daughter moves in. Things get tense. Chaan was the one that wanted the damn Love Balloon and yet her mother was the one to snatch up a mate. Chaan is unemployed but barely comes home. Popan and Pyo are having pillowtalk near constantly. Twice I found Chaan begrudgingly lifting weights while the two love birds pillowtalk all night, draining the life out of her having to deal with it.  Then tragedy struck. Being the only one home at the time of the ambush, Pyo the live-in boyfriend was struck down. Despite her envy, Chaan became increasingly more withdrawn, very rarely going out for fun or even job interviews. Popan also began getting increasingly more gloomy and soon they were once again behind on rent, once again because of a guy. In fear of losing my glorious lady warriors, I lowered the rent as much as I could stand but their grief had drained not only their livelihood, but also apparently their bank accounts because the two ♥♥♥♥♥es ran out on me in the middle of the night.  11/10 would collect rent from orphan babies again",
            "review_score": "1"
        },
        {
            "review_text": "I don't have much to say, I had an army of water people, they were 'Pillow talking' in my apartments, made some babies, babies grew up and helped fight off evil humans. Then I found out that most of these ♥♥♥♥s were unemployed, so I evicted each and every one.  More monsters came, and more people behind on rent, so I sent them to their deaths. I now run an apartment complex that houses demons.  They pay, they kill, ♥♥♥♥ all else. Being Satan the landlord is kind of fun.   Standard Game Rating",
            "review_score": "1"
        },
        {
            "review_text": " An apartment management tower-defense game about your resident monsters against humans.   While the idea of being a landlord is enticing the tower-defense part can get incredibly tedious &amp; repetitious since there's not a whole lot of strategy to use here from beginning to end.  The idea of the tower-defense is just to stop humans from stealing your money and if they get away with it you only lose your highly expendable tenant should they have died defending the money taken so there's no real fail state. You try and stop the humans by knocking on the room doors of the monsters of your choosing and IF they're home (which most usually are) they'll do their tower-defense thing and help kill the intruders.  As you get further into the game you're able to invite specific higher tier monsters depending on what monster race you've been appealing to or otherwise. To get further into the game &amp; earn faster money though you've got to go do quests from a quest board. While every quest grants you money there are quests that unlock new monsters for you to be able to have in your apartment, quests that unlock a new piece of furniture you can buy for your tenants, and main quests that finally allow you to expand your apartment one floor at a time. The downside to this though is that every quest from side to important are essentially all the same 'stop the humans' only with varying wave numbers and a few human types with soon to be higher stats. Whatever strategy you had against weaker humans you can do the exact same thing against the stronger humans with stronger monsters in somewhat bigger numbers because the monsters you get aren't entirely different either aside from the stats when it comes to being useful in defending.  The landlord simulator part is at least more intriguing. The job is primarily housing interested monsters of your choosing and appealing to their tastes by adding or improving things in their apartment, sometimes specifically when needed as some monsters prefer having certain items in the room depending on their race and/or job.  It's a bit more taxing to house monsters when you have a certain race that's disliked by another race living in the same structure. You can still appeal to both but getting them to all be satisfied in their living quarters would take much longer. There's a maximum of 3 vacancies per room where each vacancy specifically houses one tenant, that tenant's lover, and those two's child. So long as one tenant in a room is satisfied and alive they'll eventually find a lover and conceive a child who will also grow up for you to take money from. If the child dies another child will be conceived by the parents. If a parent dies the other parent will find another lover. If both parents die then the grown-up spawn will eventually find a lover of their own and eventually conceive their own child. I'm not sure what happens if both parents die while the child remains a child. As all the tenants in one room are old enough they usually find jobs of their own which is supposed to be a good incentive for raising their rent. The room upgrading is incredibly bare &amp; simple which leads to a few questionable things. For example upgrading a two-door fridge apparently grants the room a BBQ set and upgrading that gets it a built-in kitchen. You can buy a tenant a game console and/or a PC tower for their room but I find it a bit odd that you're not exactly buying it for  them  but for the room itself, and you don't even have to buy them a television for the consoles as far as I've seen. Depending on how fancy a room is and what the current tenant's job is you can adjust rent to their's and your pleasing. Certain monsters though are less likely to even want to pay rent even if you set it to an incredible low. You can evict them for being deadbeats, wait a bit longer to see if they come up with the money, or wait for them to run away from paying you.  The game itself sounds better off as an idle-game somewhat but unfortunately alt + tabbing even when the game's a small window pauses the entire thing. It was pretty nice trying to be a landlord for monsters but with how tediously bland progress is I can't entirely like the game even for its cheap price.",
            "review_score": "-1"
        },
        {
            "review_text": "I lost two families to a single boss. It left me in tears 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I can't really describe why I don't like this game. At first I was intrigued and was having a small amount of fun but as the game progressed I just lost more and more interest.   I felt like you have to maintain the monster's wants to much and they're still never happy no matter how much you spend and how low you make their rent. Not to mention if one dies then you have a room full of stuff that the next monster could not even need or like so you're trying to figure out if you need to sell it or what. What. It was very frustrating, but if you can overlook that unlike me then that should irrelevant. Also it seemed like you had to evict monsters or get them killed so you could start making money and room for the stronger monsters, which I don't like because eviction is a ♥♥♥♥ move and killing them is more of a ♥♥♥♥ move. That's just my personal opinion though.  Oh, and you'll have to grind a bit to get more money from rent but it's not to bad since the game has an increase speed option. Figured I'd throw that in for people who just hate grinding.  Lastly, I could see some people liking this game but I don't think it's good other than it's adorable monsters.",
            "review_score": "-1"
        },
        {
            "review_text": "Unholy Heights is a cute little management sim, coupled with defending your building from attackers.  Keeping residents happy is simple enough, give them what they want and don't charge them too much for the room. Getting the residents to actually pay you is tougher, you have to balance not doing quests to give them time for work with doing quests for the big rewards. Sometimes even that won't lead them to pay you as particular monsters are just bad with money.   Residents find partners and can have babies with increased stats, making balancing the items in the room a bit more challenging, but still simple enough.  The combat is simple too, enemies come, you knock on the doors to call residents to fight. But they can't pass each other in the halls, so the order and timing of the door knocks is important.   A good time waster that will eat away the day.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game!  Addictive and a little challenging, this unique spin on a tower defense game/apartment management game will keep you entertained for hours. The tenants are all very quirky and quite endearing; getting to hear them ‘pillow-talk’ is also hilarious.   The game itself is pretty straightforward (the how-to-play section is very helpful if you get stuck), but in mid-late gameplay it can start getting a little muddled when it comes to choosing tenants. For example, if you choose to have demi-humans in your apartment, it would not be wise to put demons in there as well (they hate each other). Though this doesn’t deeply affect your game, it does kind of suck if you like having a variety of monsters living in your apartment.   Compared to some more traditional tower defense games, your tenants are the ones on the battle field and are likely to die. It’s important to keep an eye on them if there is a battle going on and get them to retreat if the opponent is too strong. One strategy I found helpful when fighting enemy casters was to turtle: attack (ranged), retreat into room (before unit gets hit), and attack again, etc. You do develop a bit of a play-style the more you play. Don’t forget to raise the satisfaction of your tenants as well, the bonuses are super helpful.",
            "review_score": "1"
        },
        {
            "review_text": "A deceptively fun and laid back casual game. Decent value given the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little time waster to play, pretty cute and charming and not overly intense enough for anyone to really go ♥♥♥♥♥♥♥ over it.   My favorite feature is not having to care if tenants die because if this was some XCOM ♥♥♥♥♥♥♥t then I would be over it pretty quickly. But no, it's sometimes good to let them die if you want a new lineup.",
            "review_score": "1"
        },
        {
            "review_text": "Not as simple as it looks. Cute and fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Of all the games in which you play Satan maintaining an apartment block for monsters, this is probably the best.",
            "review_score": "1"
        },
        {
            "review_text": "New Favorite!",
            "review_score": "1"
        },
        {
            "review_text": "Has potential. Fun little ditty, needs some polish. I look forward to seeing what else the developer publishes.",
            "review_score": "1"
        },
        {
            "review_text": "Now when I say, 'I'm the devil!' I don't have to joke about it!",
            "review_score": "1"
        },
        {
            "review_text": "After playing Unholy Heights numerous times since I've purchased it, I've decided to edit my original review to make it clearer as to why I love this game so much.   Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "If you are really into cute tower defense games this is definitely for you! It's more of a casual time killer sort of game so don't expect too much fanfare with it. Overall, a light hearted game for casual/tower defense gamers.",
            "review_score": "1"
        },
        {
            "review_text": "In this game, you run an apartment complex for monsters. Sometimes they default on their rent, other times they marry and have a kid. But regardless, humans don't like monsters and they're all like 'rawr kill dem monsters hurrr' and that's sad. So you knock on the monster-tenants' doors to let them know that humans are invading and therefore must die. Also, the tenants are pretty demanding sometimes and want various things. Unholy Heights is a light-hearted affair and it costs next to nothing! So buy it RIGHT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Chickens are chavs that skip rent.  Being racist the game.",
            "review_score": "1"
        },
        {
            "review_text": "This initially seemed like an interesting concept, but it got old quickly. Even at max speed, too much of play time is spent just sitting around waiting for things to happen, and it soon becomes clear that the best way to increase your fighting strength is to spend even more time sitting around waiting for things to happen. In short, it's grindy in the most boring way imaginable, without even a story to redeem it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's nice for a game as cheap as 5 dollars, but it has -no- replay value with the exception of people looking for achievements.",
            "review_score": "1"
        },
        {
            "review_text": "I love the idea of running an apartment for monsters, and this game executes the concept very well. It is simple to play but has surprising depth. Each type of monster have different when it comes to combat, daily life, preferences and how much they're willing to pay for their room. The artwork and music is incredably cute as well.   You probably won't be sinking over 100 hours into this game, but it is absoloutely worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little game! A bit short but for the price I have gotten over 30 hrs of game play just going after the achievements. I would love to see some updates devs;)",
            "review_score": "1"
        },
        {
            "review_text": "Reading erotic fanfiction",
            "review_score": "1"
        },
        {
            "review_text": "A strange way to do Tower Defense and Management Sim combined.  Strange how they work well together.",
            "review_score": "1"
        },
        {
            "review_text": "A game that seems more at home on a phone than something to sit down and play for a long period. Gameplay is mostly luck based and only partially predictable, with your time being wasted as punishment for failure.",
            "review_score": "-1"
        },
        {
            "review_text": "my god-- this game is so good words cannot describe what I want to say. I did not think this game would be any good when i first played it but holy crap it is amazing. Its simple yet unique, difficult yet addicting, and somewhat emotional yet unforgiving. Its a management simulation mixed with combat mechanics, this game is literally about how you manage AND fight off enemies, which means its real time combat that you have to control. if all of this isn't enuf ._.",
            "review_score": "1"
        },
        {
            "review_text": "good way to waste time....enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "While quite basic, i found myself playing this for hours upon hours. I love the fact it's more than just a hotel builder.   You really find yourself loving your tenents and get excited when they get a job ( if unemployed ) or the fact they got a promotion.   While this is quite a simple idea for a game, it'll keep you wanting to play as you slowly get more items for your tenents, attract new and stronger monsters, and the brainstorming for figuring out problems like why one of your people got sick or the different strategies to keep the monsters fighting and defeating the guys that attack the hotel while keeping them all alive.  This was well worth the money. :D",
            "review_score": "1"
        },
        {
            "review_text": "Deepmouth and Q'hayakkes fourth daughter had a baby with their great great great grandson HuikoOnes, but its okay because the baby was swole af.",
            "review_score": "1"
        },
        {
            "review_text": "Tenants copulate multiple times per day in front of their grown children.",
            "review_score": "1"
        },
        {
            "review_text": "It's like SimCity but with grinding.",
            "review_score": "-1"
        },
        {
            "review_text": "A cutesy building management sim with some tower defense play mixed in. Definietly worth picking up if you like sim games and don't mind wasting an afternoon. Even more so if it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "by far one of the best short cool games I have ever played 9 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "An unholy time consuming game that offers an evil balance between traditional tower defence and apartment management simulation.  Be the Devil landlord you deserve and rid the world of heroes.",
            "review_score": "1"
        },
        {
            "review_text": "this is a awesome game for 4 bucks I bought it and spent most of the day playing it ",
            "review_score": "1"
        },
        {
            "review_text": "This is the absolute greastest game of all time. Anyone who disagrees can fight my monster army that live in my apartment complex. Thats right. This game brings together an apartment simulator and a tower defence game and makes it so insanely fun that other games can only see its glory. GET THIS NOWWWWW",
            "review_score": "1"
        },
        {
            "review_text": "it's so worth the 4 dollars, it's very fun 8/8 m8",
            "review_score": "1"
        },
        {
            "review_text": "This is so addicting and original, I love it. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Fun and easy to play.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very cute form of tower defence mixed in with elements of management.  Very addicting to be honest, has left me lost in my own world. A very good buy, especially at its asking price :)",
            "review_score": "1"
        },
        {
            "review_text": "12/10 would rent to cute monsters again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant, wonderfully complex, and infinitely fun to play. If you're a fan of strategy, do yourself a favor and buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like any of the tags then don't play this game.  Otherwise, this game is great. Instead of just watching your tenants 'grow' each day, you get the satisfaction of actually seeing that growth first hand.  This game is pretty casual, as any competant gamer would not lose from a random invasion, and harder invasions are self-triggered through quests. But has enough 'challenges' to keep the hardcores busy.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and easy to play.",
            "review_score": "1"
        },
        {
            "review_text": "So far, I'm really enjoying myself. The music has an Animal Crossing-like quality to it and the graphics are pretty cute. It's surprisingly heavy on the feels, too. Even though I read another review about it, I really wasn't expecting it.  The only real problem I have with the game is the sound that plays when a lover arrives or pillow talk happens. It's really obnoxious.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun blend of the defense and management genres. Great variety of cute creatures and characters too. You can progress the game at your own pace, as the quests are activated by the player, so you don't have to worry about not being prepared should you fall behind on satisfying your tenants. They actually could have gotten away with charging a little bit more for this title, in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Dislaimer: review copy submitted by the developer.  It's a combo apartment management sim and tower defense game. There's a lot of hilarious flavor text (sometimes I catch my monsters doing things like reading erotic fanfiction), and you can get really attached to your monsters. The battle is an active thing -- choosing how far to let the invaders get before starting to unleash monsters on them is a tactical choice, as is retreat. It may not be the best tower defense game you will ever play, but at $4 it's worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "To be fair, not much happens in this game. You manage an apartment building full of different monsters, try to keep them happy, and then send them off to battle. Again and again and again. Yet, somehow I was hooked and racked up 15 hours playing this. The combo of strategy and management was a lot of fun. For $4, at full price, you really can't complain too much.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this games so cute and fun  it becomes challange at times which i love",
            "review_score": "1"
        },
        {
            "review_text": "I am a hoe for mimalistic sim addictive games, I wish they were more of them considering it seems so easy to make them, this one in precise is a lovely perfection of it's kind as it excels in everything it has to present, from a lovely cute art style that is clear and very high definition and a naughty sense of humor with it's funny monsters or incredible flavor text to actually making it's tower defence elements actually fun and engaging. Also I love it's soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Lets see how I can put it.  You're the devil. You own a rundown apartment complex. Your tennants are cute 'monsters' and your goal is to fight off waves of human marauders. You buy stuff for your monsters apartments to make them happier, and allow more types of monsters to make their homes in your complex. I've got 1.4 hours in this game, and I think that's more than enough.   The music is addicting though, which is something.",
            "review_score": "1"
        },
        {
            "review_text": "Mildly addictive, worth every penny. If you enjoy mindless games that have a tiny bit of strategy (think CK2 or Civ5 for ten year olds) then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, quirky, semi-casual game that combines a sort of tower defense mechanic with a simple apartment management simulation. What really sells it are the adorable character designs and watercolor environments. It's not a very complex or deep game but the price is very low so you're easily getting your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "I adore this game. ♥",
            "review_score": "1"
        },
        {
            "review_text": "This is nice.  It's a 2-d tower-defence/apartment management game, where you're renting out apartments to fantasy monsters. The gameplay consists of waves coming after you and trying to take your stuff, to which you respond by knocking on the doors of your tenants to get them to fight for you. As you do.   The Art is nice and cute, the music keeps you in the moment without being grating, and the gameplay loop is so satisfying it's hard to put the game down once you start. The variety of monsters is another high point. There are your basic elementals, monsters and skeletons, but also Succubi, furries, antropomorphic animals and even the Great Old Ones themselves. Also chicks (of the chiken variety). You'll have to play through the game multiple times to see all of the monsters though, which raises the replay value.   The game is just chock full of charm, from the quirky music to your tenant's various jobs and relationships. Your tenants can even fall in love and have kids! (d'aww)  It's not the longest game in the world, with a regular playthrough clocking in at well under 10 hours, but as I mentioned there's a fair bit of replay value.   It's not an unforgettable experience, but it's a nice, relaxing bit of fun that also scratches a certain kind of itch for cute, but also surprisingly difficult. Recommended for casual and hardcore gamers alike.",
            "review_score": "1"
        },
        {
            "review_text": "Simple. Cute. Kinda funny.  10/10 would pillowtalk.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun indie game. Easy to learn and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little game that does have a good amount of replay-ability to it. Definitely worth the couple bucks it cost.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant, wonderfully complex, and infinitely fun to play. If you're a fan of strategy, do yourself a favor and buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like any of the tags then don't play this game.  Otherwise, this game is great. Instead of just watching your tenants 'grow' each day, you get the satisfaction of actually seeing that growth first hand.  This game is pretty casual, as any competant gamer would not lose from a random invasion, and harder invasions are self-triggered through quests. But has enough 'challenges' to keep the hardcores busy.",
            "review_score": "1"
        },
        {
            "review_text": "Strangely addictive hotel simulator with bare bones combat kind of deal. I enjoyed it a lot for what it is, but it's fairly uninvolving and feels like a chore at points. It still has a decent amount of charm that takes a while to wear thin, so there's that. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "When I first got it and looked at the preview I was like, meh. But then after I gave it a try it was so addicting it was the 1st game I got all achievements on steam! Goes to show don't judge a game till you have played it yourself!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good managment/tower defense game, the graphics would lead you to believe that this was aimed more to younger audiences, but the names of some of the monsters that will live in your apartment complex are for more mature audiences.",
            "review_score": "1"
        },
        {
            "review_text": "Literally GOTY.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. It's great to play casually and worth it :)",
            "review_score": "1"
        },
        {
            "review_text": "This game, THIS ♥♥♥♥♥♥♥ GAME. &gt;Be me, basically a sex demon known as Satan &gt;First tennant be Gamnyon &gt;Beautiful man &gt;I think, 'This gon be good' &gt;Years pass &gt;Tennants move in, tennants move out &gt;Still no girlfriend for Gamnyon &gt;Then ONE DAY &gt;Girlfriend walks into Gamnyon's life &gt;Lived for few more years &gt;Then all of a sudden fire mages &gt;Gamnyon fights viciously with girlfriend behind &gt;They low health so house &gt;Gamnyon make in, but no GF &gt;She was deed, stuck in doorway &gt;He holds her, he cri evry tiem &gt;Few more years pass &gt;Gamnyon still in &gt;All of a sudden, Malzy grow up, longtime neighbor  &gt;Almost like daughter to him &gt;Becomes gf anyway &gt;Gamnyon happy again, but sad agin because not want to deed her &gt;All of a sudden, Malzy kicked through chest by holy monk &gt;Gamnyonthousandmilestare.jpeg  7.8/10 Ign - Too much water coming from eyes",
            "review_score": "1"
        },
        {
            "review_text": "Really disappointing.... This is a tower defense game where you have to 'defend' your 'tower' with characters that are always 'working' or 'in the mall'... Of course they come back only when the bad guys stole all your money with that 'did I miss something' stoopid look on their faces,,, Again, disappointing. Definitely filing a refund request.",
            "review_score": "-1"
        },
        {
            "review_text": "addictive and fun. A nice landlord simulation game with some battles thrown in. :)",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to try out Unholy Heights, I said. Just for a little while, I said. I'll play a few minutes, get familiar with the game. Then I'll go do adult things like make dinner and pay bills. Just a few minutes.  FIVE HOURS LATER.  This game will swallow your soul. Do not play this alone. Have friends or family nearby to drag out kicking and screaming out of the depths of Hell's apartment complex. It's the only way.",
            "review_score": "1"
        },
        {
            "review_text": "My girlfriend and I played this at the same time. Its an interesting little sim type game with kind of a tower defense type twist. It doesnt have a large amount of depth to it but the character and execution more than makes up for that.  I can recommend this game to just about anyone especially since it is so cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Unholy Heights is a Tower defense and hotel managment game. You rent rooms to monsters. The monsters protect the hotel.   Positiv    Character drawings    Room upgrades (bedroom, bath... )    Negativ     Combination tower defense and hotel managment    Fights    Quests  ",
            "review_score": "-1"
        },
        {
            "review_text": "Another flash game. Baby's first micromanagement game.  6/10  Some of the things the residents do are kind of funny.",
            "review_score": "-1"
        },
        {
            "review_text": "Original idea, but very poor execution and game design. Can't recommend this.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt; Oh, my first quest for a new monster. Let me try it out! &gt; QUEST FAILED &gt; Maybe I did something wrong, I'll try agian &gt; QUEST FAILED &gt; Maybe I need all my apartments to be full? &gt; (45 minutes later, only 1 full apartment) &gt; All right, now I can do this quest and get my new monster! &gt; QUEST FAILED  This is yet another game that requires you to have a wiki open in your browser to look up answers to questions that shouldn't exist.",
            "review_score": "-1"
        },
        {
            "review_text": "Just no.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing this game for hours I begin to develop 'feelings' and consider all of them as my 'babies'  However that is not the point. What I am trying to say is that this game is quite fun but it can get quite dull due to its repeatitive-ness.   I will recommend this game if you have a lot of free time in your hands if you don't you better fly off to another game because this is not the game that you would like",
            "review_score": "1"
        },
        {
            "review_text": "Adorable and cute game, must play at least once in your life.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, I like casual ones and this was right up my alley.",
            "review_score": "1"
        },
        {
            "review_text": "Love this!",
            "review_score": "1"
        },
        {
            "review_text": "Chill as heck game about watching monsters sleep  Best main menu music 20XX",
            "review_score": "1"
        },
        {
            "review_text": "This game is strange..Difficult and strange. I wouldn't say it's bad, just harder than your normal tower defense. I wouldn't reccomend this game as it's quite tedious for a tower defense, but it has charm and is quite good if you can manage it.  5/10",
            "review_score": "1"
        },
        {
            "review_text": "  Unholy Heights   is a very casual game, but then I've come to realize how serious it was when my baby Pip was born... Everything changed from there and I've done my best to protect him and his Cheepy family. I am proud to say that my boy Pip is well grown and now stronger than his parents.   Aside from that, this game is a very interactive 'tower defense' kind of game.   Tower   as in tenants, meaning the monsters living within the rooms. Every monster is different in its own way including their attack, defense, satisfaction, as well as emotions. They all have different names, but sometimes you'll stumble upon a few with same names.   From my own experience,    once you build the second floor, it becomes pretty hard. So think about what preperations are needed to be made before moving on to the next quest to expand your building.   ",
            "review_score": "1"
        },
        {
            "review_text": "How this could to be a good game?  1) user friendly interface 2) better balance on Random and Control component  3) more information on those monster  ",
            "review_score": "-1"
        },
        {
            "review_text": "I originally got this game a few years ago and never really understood the mechanics of it. After picking it up again in the last couple of weeks I have to say that it's a super enjoyable tower defense with some cool apartment sim elements. Keeping monsters happy is a lot less difficult than keeping them alive, though.   The only major problem I have with the game is the music, as it can get annoying very quickly. This is easily fixed, though, by just turning it off and listening to something else in another window.  Definitely worth the money if you're into either sims OR tower defense.",
            "review_score": "1"
        },
        {
            "review_text": "A nice casual game that can be played on the side of doing smth else. Finished it pretty quickly but can't say I didn't enjoy it.",
            "review_score": "1"
        }
    ]
}