{
    "app_id": 249550,
    "name": "NEStalgia",
    "release_date": "2014-04-15",
    "developer": [
        "Silk Games"
    ],
    "publisher": [
        "Silk Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO",
        "Co-op",
        "Online Co-op"
    ],
    "genres": [
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Massively Multiplayer",
        "Retro"
    ],
    "achievements": 0,
    "positive_ratings": 226,
    "negative_ratings": 98,
    "price": 6.99,
    "description": "NEStalgia is an original MORPG inspired by the glory days of traditional console RPGs. Essentially &quot;Dragon Warrior 3 meets World of Warcraft&quot;, NEStalgia is an amalgam of the best generations of RPG gaming. You can play solo, in private games with friends, or online with hundreds of other players!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249550/header.jpg?t=1478229593",
    "minimum_requirements": "OS: Windows XP Memory: 500 MB RAM Graphics: Integrated graphics DirectX: Version 9.0 Storage: 40 MB available space Additional Notes: Internet Explorer 8 or higher required to render the NEStalgia Launcher",
    "recommended_requirements": "OS: Windows 7 Memory: 2 GB RAM Network: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "So Nestalgia is everything i could have asked for and more. I was emulating dragon warrior nes and snes games when i came accross this on steam. This is Dragon Warrior meets steroids. The community is awesome, always helpful and kind. 1893 hours of play time @ review and i still have lots of classes to build differently and complete. Just pay Silk his money, cya on midgard server. ",
            "review_score": "1"
        },
        {
            "review_text": "I also tried hard to like this game. Coming from the position of someone who is trying to make my own games, I am often left scratching my head at the design choices. It's almost like this game is intentionally bad.  -This game advertises itself as a mesh between Dragon Warrior and World of Warcraft. It seems to assume the latter mantle based on it's use of a talent system. While these talents seem interesting at first blush as you attempt to create a build, etc.; In funtionality they change little about the repetitve game play, and there is one clear way to go which will yield the 'strongest' character.  -Instead of this game being a love-letter to games of old with modern improvements that enhance the experience, it is a reminder of the frustration that comes from unrefined gaming experiences.  -The art just is. It works. Same with the sound. The feedback the player craves is glossed over. I can get behind this type of game if the game-play substitutes it(a la Dwarf Fortress), but here it does not.  -Ultimately this game is aptly titled. If you are desperate for nostlagia, go for it, but as another reviewer has mentioned, you will probably feel more rewarded using an old console or an emulator.  -The $15 price tag is to maintain the empty server, this is a $5 game hiding behind MMO buzzwords.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow... Just wow... This game really is Dragon Warrior + MORPG... Skill trees, events, companions (pets), online multiplayer, STRONG end game... The list goes on and on! Expect to see everything you would see in a MMORPG on a Nintendo Cartridge... Did I mention A NO TROLL COMMUNITY???  It is grindy (being Dragon Warrior and all) so fair warning! Then again grinding and MORPGs go hand in hand...  12/10 just for that NES feel... ***hit it perfect***",
            "review_score": "1"
        },
        {
            "review_text": "Pros: What May Attract You -  Multiplayer turn based fighting RPG! How many retro turn based games can boast have this? Grab two friends and get gaming.  Two skill trees for each of the many classes creating custom play style. Join the debate on which build you think is best.  Pets you can capture and level up; so many even Ash would feel at home.  Refined play style is not realized until you match gear, skills, ability seeds, and pets for a unique experience.  Many hidden secrets/paths!!! This game rewards exploration!  Great community - Amazing and friendly community. I have never had a hard time finding at least one person with a char my level and looking for fun. This community is committed and strong.  PvP for the competitive players.  Still actively, albeit slowly, being worked on by the devs. This game is far from being cast aside. Thank you devs for loving this game as much as I do!    Cons: The Full Disclosure -  Very repetitive game play in early game. I promise you it gets better. If you like old turn based games, it is worth sticking it out.  Farming is a must. For some, this alone is a deal breaker. However I find that this mechanic keeps the game true to the RPG genre and enjoy.  Solo play on this game can be rough going as built-in game features give noticeable bonuses encouraging grouping.  Limited combat animation. Lack of animation attacks can at times leave combat feeling bland. Again, this is meant to mirror older games and can easily be overlooked. This is especially true when you come across a never before seen monster whose sole attack is to slowly tic down for some unknown attack. (Play to find out what it does)  Server size - This truth hurts. Servers hold about 30 people and usually only one of the two servers is actively used. With that said, I want to point out that it is exceedingly rare for that sever to be filled with less than 18 people.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game, It's like dragon warrior and dragon warrior monsters were put together in an MMORPG setting with some quality puzzles put into it so it's not all just grinding. Majority of community is good, character selection is great and still more to be added, there is definitely replayability in this game as you can have a ton of slots for new characters to go through story with and with different people or monsters if you choose. And if you like gambling theres a casino in 2nd half of game :P  Some downsides are when it's really busy there can be a few lag spikes, nothing too serious. After a certain point in game you need to start working with others cause monsters will have difficulty with strong bosses so it becomes really difficult to solo.   Overall i'd give this game a 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Dev fixed my account i like people who care about their players.",
            "review_score": "1"
        },
        {
            "review_text": "I am not too far in this Game right now but what i already can say is:  -friendly community -nice graphics (if you like the 8-bit style) -good gameplay (like the Dragon Quest games -nice companion system  You can group up with 2 or 3 people and if you don't have people to play with they will be replaced with companions (kinda like Pokemon)  All in all...great game and highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Changing my old review (updating on 7/12/16). The developers were so helpful in getting me up and running with this game after my initial connection (to Steam) issue. I had someone communicating with me over the weekend to help. Very impressed, plus the game is big fun!",
            "review_score": "1"
        },
        {
            "review_text": "I want to really like this game since it has a lot of great mechanics, fun co-op play, and my friends and I are really enjoying it... when it works. Recently, the game has had continuous connection problems and the dev can never be reached. It's like he doesn't care. Constant disconnects mid-dungeon will have you shrieking with rage, especially when you respawn IN TOWN, half your gold is gone, you have only 1 MP for some reason, and you have to start the entire bloody dungeon over again. Especially when you're really far in and trying to recruit a rare monster. And that's if the game doesn't freeze in the middle of battle with said monster or, worse, freezing when you're about to recruit said monster. So you respawn in town WITHOUT THE RECRUIT. This is unacceptable!  If it's server issues, they need to be fixed. If the dev is doing this on purpose, he's only ruining the good name his game has.  I want to give this game a positive review, but with the most recent issues, I cannot recommend this game to anyone.  EDIT: Thanks to the dev for getting back to me and informing me of what was going on. When my friends are around, we'll give the game another shot. Should the server issues be fixed so we can play and enjoy the game, I will write a new review.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun and hard at first but once u get some levels the game becomes very fun.. also note the mouse you find is hard i walk in with my brother and we think oh its a basic quest level 3 and still lose come back at level 6 and finally beat him&gt;.&gt; but all in all 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Good ol' NESsy feeling with a cherry on top. Hope it gets more extensions.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a solid 8/10. I like how you can host your own server if you feel that you don't want to play with the world abroad and it has that good ol' solid 8-bit RPG feel to it. Some of the things I didn't care for though were the choppy scrolling through the world *which I later found was because of the use of Byond for the creation* and also the wonky controls. You can never fully use the keyboard or use the mouse but are stuck at using both which is wierd for a Byond game. Also, its a Byond game... if you can't stand those, certain things about this will ♥♥♥♥ you off. If you haven't already been scarred by BYOND and like games like Dragon Warrior alot, then give this a try when it goes on sale or you have $15 to throw to the wind...",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, its fun and it takes me back to yester years. The sound track is even amazing!",
            "review_score": "1"
        },
        {
            "review_text": "This game, is really good so far. I just need to make it work with a controller and it will be even better!  Seriously though, if you like the old Dragon Quest/Warrior games, you will more than likely enjoy this as well!",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't for everybody but being a DQ fan I love this game to bits. Well so far I'm not too far into the game but the customization options are pretty large. Just within a class there are builds that you can do which adds lots of replayability. Not to mention there are many classes which each play very differently. Also the community is really nice and fun. I haven't had much trouble picking up a person around my level and working with them for a bit. If you can get a friend to play it with you then you are even better. Is rly gud get it if you think you would like it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun and addictive, I definitly reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "co-op required for full enjoyment, otherwise it's pretty sub-par",
            "review_score": "1"
        },
        {
            "review_text": "If you like Oldschool RPGs with a mmo experiance, I recomend this. Use to play dragon warrior as a kid so I find this very fun on the PvP server :) Trying to get some beast armor to be unstoppable!",
            "review_score": "1"
        },
        {
            "review_text": "Holy Dingus. Buy dis game it is a lot like Mario Bros. 3",
            "review_score": "1"
        },
        {
            "review_text": "If you do play it DO NOT play it alone. Play it with friends since the community is basically dead. I like super grindy games and this is a SUPER grindy game so if you are into that you are set! So basically if you are planing to play with friends enjoy grindy rpgs then i recommend it otherwise dont buy.",
            "review_score": "1"
        },
        {
            "review_text": "It's purty neat!",
            "review_score": "1"
        },
        {
            "review_text": "I was gifted this game a few days ago, but I can't refund it so I'm giving my friend his 15 dollars back, and at first I was hooked. 'The Old Days' like most people who see this game. First of all, the name is a predatory tactic for oldschoolers, don't believe the hype.  Pros : Nostalgia, interesting classes, different power systems, questing, and interesting mechanics  Cons : Some classes are borked, mechanics not utilized well, RNG is 'fun', railroaded into playing the game a specific way.  Started out fun, but you quickly realize skill/grinding doesn't get you far. There are gear and 'party' checks with the companion system where you need x class with x companions to complete x area or you die. I used the wiki after hitting a wall, I understand how to play, but its not fun anymore. No freedom despite the class choice. So if you are down for an old school experience without the modern day balance, fun, or competence to make and keep a game fun and engaging beyond 'Hey remember the 80s/90s?!' then buy it!  P.S. I play tactical/turn-based games such as X-com, Wakfu, Final Fantasy Tactics, Ogre Battle tactics, Xenogears, FF7, Suikoden, Front Mission, FF3/6, ULTIMA, etc etc.... Lets just say I have about 10k+ nerd hours of turn-based gaming under my strained, fat belt. ♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh I hate that I have to give this a negative review since I loved dragon quest as a kid and this appeals to me, but that massive difficulty spike after the first boss just turned me off forever. And since its a JRPG at heart difficulty is from the enemies suddenly being 5 times as strong and coming in large groups, requiring tons of grinding if I could even make it back to the earlier zone without being ripped apart. Oh well.",
            "review_score": "-1"
        },
        {
            "review_text": "I dueled my friend. When my friend won he took 31 Gold from me. GG AFK NO RE. Uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun RPG with the good old 8 bit feel to it. This sadly means that it too has the repetitive aspect of old rpg's... gets old after making it to the next town.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game to anyone that loves old school jrpgs and would like to wonder if there was an MMO in the 80s. It stays true to the old formula and feels like Dungeons &amp; Dragons in an 8-bit world.",
            "review_score": "1"
        },
        {
            "review_text": "NEStalgia was released in 2012. In October of 2014 the level cap is only 32. If you want to play the game solo you can not get to all the content. Maybe in 5 years this game will be updated to the point where it is playable.",
            "review_score": "-1"
        },
        {
            "review_text": "umm... opened a door, found a toilet 11/10 game would buy -ign   LOL Ha ha   Rate funny if you liked if you thiought it was funny what i said earlier lol",
            "review_score": "1"
        }
    ]
}