{
    "app_id": 249610,
    "name": "Galactic Arms Race",
    "release_date": "2014-06-05",
    "developer": [
        "Evolutionary Games"
    ],
    "publisher": [
        "Evolutionary Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 50,
    "positive_ratings": 41,
    "negative_ratings": 33,
    "price": 1.99,
    "description": "Top-down 2.5D action that combines old-school shooters like Star Control, action-RPGs like Diablo, with a system that evolves unique weapons to player preferences. Single-player and 32-player online coop and PVP.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249610/header.jpg?t=1478572206",
    "minimum_requirements": "OS: Windows XP Processor: Core 2 Duo Memory: 256 MB RAM Graphics: Direct X 9 compatible graphics card DirectX: Version 9.0c Network: Broadband Internet connection Storage: 160 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "   Galactic Arms Race - Rating: 6.9/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game that has a lot going for it already and a bunch of future potential. Not only does it implement procedural generation, it utilizes evolving content generation that is influenced by the players preferences. This game is as much for the computer art connoisseur as it is for those looking for a unique, evolving game to play.   Anyone who enjoys games like borderlands and minecraft for their content generation would enjoy this game.  Overall, I have bought it for multiple friends already, and would recommend it to art lovers and hipsters in addition to gamers who love finding new novel things on a regular basis.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "i got this game from a giveaway so obviously i didnt spend any money on this game  but still, at the state this game is currently on, it kinda sucks. i know the game is only for like 3$ but it seems like the devs dont really spend much time on this game anymore. would be pretty nice if theres weekly updates to make the game better. the game looks like itll be good if only they would put more time into it.  graphics isnt really all that great if anything this game looks like its from ps1. im not sure if its just me, but the game runs in a jittery below 30ish fps which is a bit unpleasant for the eyes, makes it feels 'laggy'. there is multiplayer for this game although its barren. its pretty neat that you can change your weapons by getting loot drops from enemies but some of the guns have this wavy pattern which is sometimes annoying since they tend to dodge the enemies gameplay wise its not very compelling and you will get bored in a few minutes. the missions early on also feels like a chore. might fix this if you play with a friend though.  not really recommended, even for $3 . i feel they might as well make this a free to play game since there are f2p games out there thats way more fun than this. if it goes f2p , you could give it a shot, maybe its your cup of tea.",
            "review_score": "1"
        },
        {
            "review_text": "Yesterday, I purchased this game on a whim; I have not been disappointed since.   Upon installing Galactic Arms Race, I wasn't exactly sure what to expect; the streamlined menu and 'options' were convincing enough, but I've been fooled before. A few seconds into viewing my future crush, I thought to myself, 'This game is gorgeous and intelligent. If I was considerably younger, I would date this game.'  While I've only known Galactic Arms Race for a few hours, I feel it necessary to opine:   -Responsive controls -Smooth graphics when turning and strafing (even my old machine doesn't 'clip') -Cost-effective -Gorgeous colors  -Low/undedicated playerbase at 1AM/during my vacation/non-working days   Tl;dr......BEAUTIFUL AND EXCELLENT GAME",
            "review_score": "1"
        },
        {
            "review_text": "This is a crap game.",
            "review_score": "-1"
        }
    ]
}