{
    "app_id": 249680,
    "name": "Marlow Briggs and the Mask of Death",
    "release_date": "2013-09-20",
    "developer": [
        "Zootfly"
    ],
    "publisher": [
        "505 Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Spectacle fighter",
        "Hack and Slash"
    ],
    "achievements": 29,
    "positive_ratings": 1685,
    "negative_ratings": 138,
    "price": 3.99,
    "description": "A new breed of WARRIOR returns, committed to destroying the enemies of FREEDOM When ONE angry man, has a world to protect - There is only ONE future – HIS OWN No-nonsense hero Marlow never shied away from danger or trouble. But now he faces his ULTIMATE challenge.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249680/header.jpg?t=1447358520",
    "minimum_requirements": "OS: Win 7 Processor: 2ghz dual core CPU Memory: 2 GB RAM Graphics: AMD Radeon HD 4000 Series and up / NVIDIA GeForce 8 Series and up - excluding mobile variants DirectX: Version 9.0c Storage: 3 GB available space",
    "recommended_requirements": "OS: Win 7 Processor: 2.5ghz quad core CPU Memory: 4 GB RAM Graphics: AMD Radeon HD 4850+/5750+/6750+ or NVIDIA GeForce GTS 250+/450+/650+ DirectX: Version 9.0c Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "Marlow Briggs and the Mask of Death is a fast-paced third person hack'n'slash game by Slovenian developer ZootFly which didn't catch a lot of attention among PC gamers at its release. Making use of pretty much all of the popular clichés, the game is filled with mindless over-the-top action, tons of explosions and hilarious puns without ever taking itself seriously at any point.  The story proves this instantly: Your girlfriend translates ancient scripts for a rich company mogul somewhere in Central America. You visit her and she explains to you how her boss is up to no good because he wants to perform a ritual that would make him a powerful god and ruler of the world. So you try to take here with you back home, which her boss obviously doesn't like, so he gets you killed with an ancient scythe, not knowing that it is imbued with power that resurrects you and summons the Mask of Death, your new companion on your path to rescue your girlfriend and stop the bad boss.  The game is based on ZootFly's own proprietary, multi-platform engine called ZEN, which doesn't really provide any PC graphics options other than resolution, fullscreen and brightness. That's a shame because the game could've definitely used some AA, which would make the colorful and detailed enviroments look even better than they already do.  While the level design as such is pretty linear, which tends to get boring after a while in a lot of games, ZootFly actually managed to add quite a lot of variety to it. Throughout the game you will encounter combat arenas, puzzles, deadly death traps, quick-reaction minigames, turret sequences and even some top-down shoot-em-up action. This sounds like a weird mix of gameplay elements but is incorporated extremely well into the game, so you never have the feeling that it is out of place.  Combat and controls are exactly like what you would expect from a game like this. Throughout the story, you get access to 4 different and upgradable weapons, each of them with a variety of combos to deliver maximum damage. Additionally, by defeating the ancient gods of fire, earth, water and wind, you unlock their devastating ground attacks, which can help you out of tricky situations or simply cause widespread carnage when facing many of the varying enemies at once.  The puzzle elements in the game mostly consist of moving blocks on trigger platforms or flipping switches to open doors and while they never are overly challenging they actually provide a welcome change to the otherwise extremely fast-paced gameplay, so you can take a short break from all the action.  Usually, with a low-budget title like this, the soundtrack and voice acting are two of the things where the developer tries to save money. Surprisingly enough, the soundtrack is actually pretty decent and, paired with the level design, builds up a really good atmosphere. While the dialogues are a bit cheesy at times, the voice acting itself is good and fits perfectly to the game characters, especially to Marlow and the Mask, who are constantly teasing each other verbally. That makes for some hilarious puns even in the weirdest situations. For example, while you are climbing a stone wall that is about to collapse and kill you, you are arguing with the Mask about who is whose sidekick in this game.  With around 8 hours of playtime for the story, the game provides an extremely decent bang for the buck and if you want to test your skills further, you can give the Challenge mode a shot where you replay the minigames from the story to achieve better scores and times to rank up in the online leaderboards.  Marlow Briggs and the Mask of Death is cheesy. It's mindless. It's over-the-top action. But that is exactly what makes the game so enjoyable and so much fun and it's great to see some developers going bonkers with their games without trying to be serious, dramatic or mature. If something like this is right up your alley, make sure to check the game out!  Oh, did I mention that you can ride giant scorpions in the game? Because you can! FRIGGIN' GIANT SCORPIONS!",
            "review_score": "1"
        },
        {
            "review_text": "Love God of War, gratuitous explosions, fire, mayan ruins and sidekicks/villains with ridiculous dialogue? Have an Xbox controller? Marlow Briggs is the game for you, especially now that it can be cheaper than a coffee at Timmies. I enjoyed it enough to finish it twice.",
            "review_score": "1"
        },
        {
            "review_text": " Short version: 88%",
            "review_score": "1"
        },
        {
            "review_text": "Marlow Briggs brings a short funny game experience that may remind those movies you watch on a lazy Sunday. You have everything you can expect from an action movie/game so you just need to sit back and relax while having to face many dangerous creatures and soldiers in order to save the one you love. Marlow never wanted to be a hero, he just want to end all this madness and get his girlfriend back.  You will have a small variety of weapons and magic tricks that you will learn or get as you progress the game. With simple combos reminding the God of Wars series (without the gory aspect or the budget) you can expect a couples of puzzles as well but they may not represent a challenge if you are a fan of such things. The goal in this game is nothing new or refreshing. Marlow Briggs never taking things too seriously and the plot is really obvious about this. From explosive red barrels that are very well placed to being made fun when you fail a single jump, everything feels like a lot of things you have seen before and there’s nothing wrong with that.  The game played great without no issues and the visuals are actually quite nice. The colors are bright and vibrant and there’s a decent balance between those levels around the forest and the industrial area. I finished the game in around 6 hours and I had a decent amount of fun. It was a game that made right from the start that did not wanted to being taken seriously and they achieved that goal without flinching. If you like to play more than one game at the time and you are playing something horror related or very story heavy, Marlow Briggs is just the right thing to play between such titles.   Silliness is guaranteed as well mindless fun. ",
            "review_score": "1"
        },
        {
            "review_text": "As somebody who is very much a fan of B-movies, I couldn't help but smile at the title of this game. It invokes feelings of just sitting down with good friends, and riffing on some random off-brand movie that we found at a local video store. And, much like those movies, you will get a lot of the same thrills from Marlow Briggs. The game itself is so over-the-top at some points that it's just comical, and I easily found myself smiling through my entire playthrough of it. Like most good B-movies, it takes what people want, in this case a God of War style combat system, and it just pushes it over the top while being aware that it's so rediclous. The writing on some of the lines is just absolutely amazing, and the voice acting is suprisingly good, given how cheap this game is. If there was ever a game that brings the B-move experience, this is the one.",
            "review_score": "1"
        },
        {
            "review_text": "a shameless god of war clone with no pretensions of being anything else. pretty good at it, though -- smooth combat, well-optimised engine, story that doesn't waste your time.",
            "review_score": "1"
        },
        {
            "review_text": "Marlow Briggs and the Mask of Death is a third person, hack and slash fest. It is perfect for the player who wants to experience a game that brings to life the feel of a classic action blockbuster film, over-the-top action and cinematic gameplay with a focus on relentless high-octane combat and danger filled exotic environments. As combo-driven adventure brawlers go, there's no earthly reason this should have gone under the charts like it did. I have no idea, but this game absolutely deserves a place with its AAA genre-cousins.  Marlow Briggs is also played the most known actor from the hilarious series Saints Row. I'm sure many of you know him from there as pierce washington, Dex and so on. But enough of me talking lets get down to the pro and cons.   Pro:    -Pretty much nonstop action with very little noticeable loading -Great voice acting -Looks nicely polished -Great Combos -Tons o' Explosions -Interesting Soundtrack that doesnt get dull - The mask calls you chu-chu and insults you if you die and while playing xD.      Cons:    -Very little graphic customization so if you can't run it there's really nothing you can do to make it happen (Top tier pcs) -Lack of enemy diversity -Lot o' Insects ",
            "review_score": "1"
        },
        {
            "review_text": "For 99 cents you can't go wrong. You just run around chimping out and blowing things up. 7 ♥♥♥♥♥♥s out of 10, would ♥♥♥♥♥♥ again.",
            "review_score": "1"
        },
        {
            "review_text": "Let us compare this to Call of Duty : Ghosts  This : ✔ 2,09€ ✔ 7-8 hours long (hard) ✔ better graphics ✔ better gameplay ✔ better ai (aka presence of ai) ✔ more fun ✔ you kill more people ✔ bad guy is asian ☓ no fish ai  CoD : Ghosts ☓ 60€ ☓ 4-5 hours long (veteran) ☓ ♥♥♥♥♥♥ graphics ☓ ♥♥♥♥♥♥ gameplay ☓ no ai ☓ boring ☓ you kill less people ☓ bad guy is south american ✔ advanced fish ai  Buy this game for your own good, if you don't like it it's only 2€ thrown by the windows, and you'll help Zootfly make the next one better.",
            "review_score": "1"
        },
        {
            "review_text": "-God of War clone -Spectacle on an indie budget -Cost me 1 (one) US American Dollar and it was easily worth ten times that -Low system requirements -Would look good at 1440p or 4K -Funny writing -A mask that makes constant fun of you -A ridiculous big boss villian in the likes of GlaDOS -Good voice work -Bloody carnage -Goofy silly minigames -No fat -Cool freeze frame cutscenes -Doesn't need audio (good podcast game) -Sweet protagonist -Death in the first cutscene -Are you bad enough to save your girlfriend? -Get ready ♥♥♥♥♥♥♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Marlow Briggs and the Mask of Death is a shining example of story and emotional conveyance within a video game's narrative, and you're missing out if you haven't already experienced it.  In this gripping tale, Marlow Briggs is abducted from a 3v3 basketball pickup match by gray aliens from the planet Xernov. With their language comprised mainly of 'ayy's and obscene laughter, Marlow manages to understand that the aliens wish for nothing more than peace with mankind, and require Marlow to be their middle man.  In one of the most masterful combinations of interactive cutscenes and interactions with dialogue trees, Marlow suddenly and quickly is fallen by an ancient evil awakening. This Summer, Marlow Briggs must team up with the Xernovians in order to defeat these elder gods once and for all. With some of the most fast-paced and intense rhythm sequences since Beatmania XVIII and iDOLM@STER, Marlow must jam and slam his way up the corporate ladder in order to become CEO of Time Warner Cable and provide a stable internet service that reaches across America that doesn't tug ♥♥♥♥♥♥♥s in its spare time.  Myst? Forget about it. Dear Esther? You'd be DEARly mistaken. The Last of Us? That takes last place. Gone Home? Check this, not your privilege. Marlow Briggs and the Mask of Death provides one of the most cinematic and moving moments in the entire history of video games that I won't dare spoil. Here's a hint, though: Marlow is forced to choose between his love of futbol and the security of the Patriots project. Which will he choose?  Citizen Kane? More like Citizen Lame. Buy Marlow Briggs.",
            "review_score": "1"
        },
        {
            "review_text": "Is the story original? No. Is the gameplay original? No. Is the game optimized well? No. Is the game free from camera or control problems? No.  So why play this?  It's fun as hell, the voice acting is fantastic, and the game does a lot of little things right. It's a classic action movie that you play, provides a good challenge, and doesn't overstay its welcome.  I'd say $15 isn't a bad price, but it often goes on sale for $5 (and once went as low as $2.25) so pick it up and have a blast.",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually give games a 10. In fact, there are only 2 other games that I would consider to be perfect 10s: the original  portal  Daikatana and  pacman ce dx  Shrek Treasure Hunt. Those aren't necessarily the best games I've played, but they are the most perfect, if that makes sense. And that is a word that I would use to describe  Gone Home  Marlow Briggs: perfect. It is a game purely comprised of exploration and discovery, with virtually no other gameplay components with the exception of some very simplistic puzzles. And yet,  Gone Home  Marlow Briggs manages to make seemingly mundane exploration into some of the most engaging and emotional storytelling I have ever seen.    Gone Home  Marlow Briggs will be remembered for its brilliant design and execution, but also as a game that bravely led the charge in addressing contemporary social issues that have not as of yet found much representation in the medium.  This game is not for everyone. If all you play are shooters and fast paced action games, then  Gone Home  Marlow Briggs will bore you. However, if you like slower games or games with interesting ways of telling stories, such as  Journey, Heavy Rain, Dear Esther, or even mods like The Stanley Parable  Call Of Duty: World At War, Call of Duty Modern Warfare 2, Call of Duty 2: Big Red One or even James Ponds, than  Gone Home  Marlow Briggs is certain to grab you and not let go for its  3  7 hour duration. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Marlow Briggs is an underated, overlooked gem of a game! Good graphics, responsive controls, and good story. Gotta love the humor of the the mask dude, lol! Buy it! You will not be disappointed! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Despite looking like a Playstation 2 game, plus the added fact that there a lot more games out there that does everything Marlow Briggs does, but better . (The platforming is good, not great. The fighting is good, not great. The shooting parts are good, not great) it does have one giant thing going for it.  It is a hell of a lot of fun to play.  The game is not too hard, it definetely does not take itself seriously, and it is (as I said) a blast to play. About 8 hours long and the game varies itself just enough to keep things from getting too stale (you fight, but then you will platform for a bit, before doing more fighting and then maybe a little shooting) you could do a lot worse than to give Marlow Briggs a whirl.",
            "review_score": "1"
        },
        {
            "review_text": "What a great game this is, I was very surprised that I had never heard of this game before, it's fast and furious, but I like it a lot, not a 100% satisfied with the camera positioning around the character at times, and directional control for keyboards could be improved, but I think this game really does work best with a 360 controller or similar pad control, I have one of these but I prefer keyboard and mouse, but all the same I recommend this game, it's a lot of fun, you get to blow lots of things up, and shoot things down out of the sky, some areas require you to solve your way through the level, but nothing too taxing of the old brainbox, nimble fingers sometimes required, for the price it is a must have, plenty of Steam Achievements to acquire, go on treat yourself, you won't regret it",
            "review_score": "1"
        },
        {
            "review_text": "Good game, I even dont know how good :). Something betwen Darksiders, action game and God of War. Not so briliant but good without bugs, good movements and action, action, action! thoes who dont get it from PayWUW bundle for 1 dolar... shame!!! 7/10. Only graphic is not so briiant and storyline but god damn it... this action, is what I need for a months in games this type.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, good price, if you like this type of game :)",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up for $0.99 during one of the seaonal sales. Less than a buck for a game that's pretty much a action comedy meets God of War. Some of the puzzles are annoying but not impossible. The cut scenes are unique 'evolving' freeze frames which is a nice touch. Yes there are glitches, just a week ago I tried to jump up onto something I thought was a reachable ledge to maybe a hidden item. Instead, I jumped up and went into the mountain side and Marlow just kept up this long horizontal jump into the void. But who cares! This game is dirt cheap, has great voice acting, great graphics, and is extremely fun. A must have for any fan of the God of War style action games!",
            "review_score": "1"
        },
        {
            "review_text": "First things first I honestly wasn't expecting much going to Marlow Briggs but a cheap God of War clone. I was immediately blown away and got an amazing game instead.  To get the negatives out of the way the game doesn't have any graphics options at all besides the ability to change your resolution. Textures are not the best and the game has a lot of glitches. Having said that what Marlow Briggs and the Mask of Death excels at is the combat, if you have played spectacle fighters such as Dantes Inferno, Castlevania: Lords of Shadow or even God of War you will find a familiar control scheme here with fluid moves to match. The over the top campy nature of the game just adds to the awesome. The dialogue between Marlow and Tep (aka the Mask) is just hilarious.   4 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "Over the top Action, check Crazy protagonists, check Fun weapons, check Tons of enemys, check  Great God of War clone, now it's on sale for 99 cent, you have to get it.  Dont mind the sometimes repetive gameplay, it's not that bad.",
            "review_score": "1"
        },
        {
            "review_text": "Marlow Briggs is actually a good game to have fun with for 5-6 hours. It makes you feel like you are watching a low budget brainless action movie with a lot of explosions. The dialogs between the characters are funny and fits the style of the game. Bosses are a little bit boring, but hell it is an indie game and it deserves the money it is asking.",
            "review_score": "1"
        },
        {
            "review_text": "Just.. wow.  This game delivers on promises you didn't hold it to, and it does it with relentless aggression.  You know you just want to beat some dudes up with vaguely mystical weapons, this game has both dudes to beat up and vaguely mystical weapons in spades. You know you just want to shoot down some helicopters, this game has ALL the helicopters to shoot down.   You didn't know you wanted an upside down helicopter level, thankfully this game knows you did. And it came prepared.",
            "review_score": "1"
        },
        {
            "review_text": "God of War meets Rambo: First Blood. Swords, chains, guns, literally DOZENS of exploding helicopters. Dirt cheap, for unemployed as myself it is MUST HAVE!",
            "review_score": "1"
        },
        {
            "review_text": "For those like myself who love cheesy and entertaining action B-movies and Action video games needs to play this. it was like a roller coaster ride of action the whole experience and i loved every minute of it. An absolute must play game. 5 out of 5 stars and 9.5 out of 10 points. Marlow Briggs rules!",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever, you should totally buy it.",
            "review_score": "1"
        },
        {
            "review_text": "So far soo good. This game is actually really entertaining me.... killer graphics, too easy must play on hard.... worth a few bucks for sure. Look like it will be short... buy it 8/10 sofar for what it is. This is a horrible review for a great action game. Also the cut scenes are done in a very unique way, its a simple concept but very cool, check it out. Smooth button mashing gameplay. So check it before you wreck it... idk",
            "review_score": "1"
        },
        {
            "review_text": "ITS CHEAP, FUN AND FUNNY. NUFF SAID",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best $0.99 I've ever spent. It is a very well done God of War Clone, with a likeable main character and fun story. Graphically the game looks great, and the controls are smooth. The voice acting is well done and performed by accomplished voice-actors. The game doesn't take itself seriously and it shows in the funny story. The banter between Marlow and the Mask is great. The Mask cracks jokes when Marlow is killing enemies and makes fun of him when he dies.    I only had one problem, sometimes when trying to grab a rope or ladder you would miss. Some locations you had to stand in a specific spot to grab on, or you would just grab air. Other than that the gameplay was great.",
            "review_score": "1"
        },
        {
            "review_text": "So much better than you might expect. Decent brawling, with a combo-leveling system and a handful of QTEs, some massive (but not difficult) bosses, but where it really shines is the humor. Clever writing, great voice work, 4th-wall-breaking jokes. Sadly, it's on the short side, but the price is right.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun God of War clone.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game.",
            "review_score": "1"
        },
        {
            "review_text": "Better than God of War.",
            "review_score": "1"
        },
        {
            "review_text": "A game with a robust and very enjoyable combat system which has a very well-implemented combo system that doesn't require you to wait to press the right button for combo: you can 'dial' the combo in the beginning and let it execute (block and dodge will interrupt it), which lets you use the combos more tactically than in other spectacle fighters. Enemies are varied as are locations. Boss battles are quite lame, but brief.   The game makes no premises about what it is and is filled with self-parody and stupidity all the way through it's 'story'. Cutscenes and characters are laughably plastic and the game even has an achievement for skipping all cutscenes, which I thoroughly recommend on 'achieving'. 5-6 hours of fun and enjoyable combat and great colourful levels, supplemented by dumb and hilarious commentary of a talking Mayan mask are definitely worth this game's asking price.  'If only there was a conveniently-placed AA gun for me to deal with all these helicopters...'",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun and well-made game. Extremely fast paced right from the start, with frequent check points so you never have to replay more than a few minutes of the game when you die. Graphics look good, with colorful and diverse environments.   The only major downfall is the frequency of MAJOR FPS SLOWDOWN, especially when you enter a new area or segment of one.The slowdown is particularly noticable during the 'avoid things as you go quickly forward on rails' levels. I did some googling and this seems to be a hit-or-miss problem, some players have no FPS problems at all, while others describe having the exact same issues.  PROS + FUN! Extremely Action-Packed and Fast Paced right from the first few seconds. + Controls are accurate and feel great (with 360 controller) + Block puzzles are intuitive and don't require a guide. + Very frequent check points. + Short Shooting segments and on-rail events help mix things up. + Nothing feels repetitive or grindy. The game hurls you forward and never looks back.  CONS - Annoyingly frequent frame-rate drops for some players, even on high-end PCs. - 'Freeze-Frame' cut scenes don't impress and it seems like the devs ran out of money to properly animate them. - The 'mini-game' during the end game credits is horrendously frustrating. I'd rather just sit through the credits.  OVERALL: 8.5/10. Get it on sale and be thoroughly entertained for the next 5-6 hours.",
            "review_score": "1"
        },
        {
            "review_text": "This is a tough one - I like the OTT nature of the game, the hammy dialog and the way it really feels like some sort of exploding rollercoaster  BUT  The locked camera, the shonky platforming, the damage-sponge enemies - they kinda get to you after a while.  This feels like an undiscovered PS2 gem - it's prettier than a PS2 game but also crashier - the mechanics are clearly of that era tho.  You may enjoy it - it's kinda a B-rate God-of-War with more cheese - but I just found it kinda frustrating",
            "review_score": "-1"
        },
        {
            "review_text": "Marlow Briggs is the truest ♥♥♥♥♥ of them all. He's the only true G in history of video games. Respect homie. Word up. Holla to my players. PEACE.",
            "review_score": "1"
        },
        {
            "review_text": "It's god of war but you play as 50 cent, at the cost of 2x 50 cents.",
            "review_score": "1"
        },
        {
            "review_text": "You know what, Marlow Briggs may be a low budgeter, but it truly was an entertaining game. Sure it copies a decent amount of its tricks from the God of War formula, but in all honestly, that's not really a bad template to borrow from. Throw in a little bit of Indiana Jones, 70s blaxploitation film-making, B action movies, nonsensical comedy and you've got the vibe for this game down pat. I actually enjoyed this game more than alot of big budget games from the same genre.   Briggs isn't a perfect game, yet it does so much right that I couldn't stop playing until I completed the hardcore mode today, FINALLY. In Marlow Briggs you are killed by an evil Chinese magnate who wants to rule the world with a frightening, sort of terraforming magical power. He kills you and kidnaps your girlfriend, though thankfully Marlow is brought back by a wise-cracking mask that guides him through his journey to save the girl, the day and the world. The entire premise is ridiculous. Once you're having fun with the game, the plot hardly even matters.   At its core, Briggs is a hack n' slashers delight. You arm yourself with several types of melee weapons, magic, long range attacks and acrobatic abilities. As you fight and explore, you earn experience to upgrade your powers, making you a killing machine on a machine. You'll explore crazy industrial complexes, temples, caves, jungles and much more. While graphically, Marlow and the gang aren't the best game in town; he surely isn't the worst looking either. Levels are solidly detailed with lots to peer at in the distance and the enviroments look good while alternately being a blast to travel. There's hidden secrets to find and numerous achievements to unlock. There is also a hardcore mode on hand that will test your skills for certain. It's not as impossible as Deadlight, but it will put up a stiff challenge and make you sing for your supper.   You upgrade with new equipment at key points of the game while fighting legions of foes that include all sorts of armed guards, giant insects, mythical looking boss creatures, teleporting evil priests, giants, a wolf like Hellbeast and other assorted demons. The boss fights are a blast, and require quicks hands, strategic use of attacks/abilities and old fashioned pattern memorization. That's really all there is to it! The campagin is a decent length with alot of areas to explore and frequent differences in scenery so that you'll rarely be bored and when you're not fighting like a champ there are all sorts of gameplay variations to keep things exciting. You'll man gun turrets, fly choppers and fighter planes while shooting down everything in sight, use your nimble abilities to platform your way to victory, etc. The controls were mostly tight and responsive, so it's easy to get yourself in the action and stay there. While I expected minimal of this game, I got way more than I bargained for and put in 28.7 hrs to beat it twice and get most of the achievements (97%). Hell, once weakening certain monsters like the club wielding giants and monster scorpions, you can even ride and use them to fight Golden Axe style!   On the downside, sometimes the controls do tend to get a little wacky and combo stringing won't feel entirely accurate, making for a cheap death or two. The QT buttom presses to hammer down on certain bosses and deal decisive blows don't always register, which also got me slaughtered a couple of times as well. While not with the frequency of a survival horror game, the camera has potential to get a little rickety and you'll end up taking a beating from some foes you can't even see. All of the problems with the game were rather minor and I actually thought this game was HIGHLY addicting and entertaining to play. To be honest...I like it more than some of the God of War sequels. You can scream blasphemy all you want, but that's how I felt. Another downside is that the slow-motion cut scenes could have been better executed and the voice acting isn't top-notch (although its rampant cheesiness is rather endearing as this game is straight out of one of those B movie action 4 packs). Overall, anyone into the hack n' slash genre would do well to check this out for the cheap price. I hope they make a sequel with co-op! Good lord, that'd be a blast.   Now for some quick pros and cons:   Pros  -Solid graphics and sound -Excellent set of weapons, abilities and magic -90% of the time the fighting is fluid and fun -Superb enemy variety with tough fights and killer battles with monstrous bosses -Campy storyline and voice-acting adds to the appeal -Combos are easy to execute and satisfying - 90% of the time the controls are response and fun -Great gameplay variety with everything listed above and even a few puzzles  Cons  -10% of the time the fighting can be a little clunky -10% of the time some button presses won't register, especially the QT sequences (fortunately they are few) -Platforming is a beotch when the controls stutter  Overall: 8.2/10",
            "review_score": "1"
        },
        {
            "review_text": "The epitome of CUHRAYZEE",
            "review_score": "1"
        },
        {
            "review_text": "It has its fair share of problems - lack of advanced video options, camera bugs, knocking enemies through walls bugs, health-sponge enemies every so often, QTEs wherein keyboard buttons' mouse equivalents won't apply - but 'Marlow Briggs and the Mask of Death' brings plenty to balance itself into a worthwhile ride. Of particular note is its inclusion of Steve Blum as the Mask Guardian and James Hong as the villain, combat that evokes happy memories of God of War, and a big-dumb-action-movie approach with many, many explosions (in the industrial environments, at any rate). Definitely something to enjoy over a weekend, or perhaps over a single day in a weekend while nursing a delicious cup of hot cocoa or what-have-you.",
            "review_score": "1"
        },
        {
            "review_text": "Like God of War but less gay.",
            "review_score": "1"
        },
        {
            "review_text": "In this slighty above average in every aspect game you play as a black man with a doubleheaded scythe and you kill bugs and dumb soldiers with machetes. 9/9.999 Best £0.99 I ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "Best thing in life.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Character-Action/Action-Adventure game. The combat feels good, and can get decently challenging at times. And the non-combat bits are actually pretty good as well (some of the platforming can be a bit hard to judge because of the camera, but overall it's prety decent, and there are some good puzzles as well). The game also has some really spectacular environment design. Also there are some interesting mechanics like the ability to convert fodder enemies to your side in combat. Some of the fights can drag a bit because of high-health enemies, but overall I'd recommend this for fans of action games.",
            "review_score": "1"
        },
        {
            "review_text": "When I first looked at the trailer for the game, I thought, 'Hey, this kinda seems like Far Cry 3: Blood Dragon; it's cheesy and a little over the top, seems to incorporate humor, and doesn’t seem to take itself too seriously; this should be great!' However, upon actually playing the game, I realized how wrong I was.  Firstly, it is an incredible drag to play; the combat is astoundingly dull, which is says a lot, considering that the game does try to change the weapons you're using and enemies being thrown at you somewhat frequently. The gameplay outside of combat is no better; there are numerous puzzle and platforming sections, but I found these areas just a hassle; I ran into numerous glitches, (character unable to climb up walls, character glitching through walls, etc.) which was only made worse by the fact that the puzzles, I felt, lacked any real challenge.  (I will now discuss the issue of the game taking itself seriously, this is a personal preference when it comes to cheesy games, so you can disregard this section if you'd like, [skip to next paragraph] but I feel it's worth saying) Secondly, and by far one of my biggest complaints, the game takes itself way too seriously. What I mean by this is, the game, or I suppose the creators, really, could not see how ridiculous and cheesy the plot, characters, cut-scenes, and overall feel of the game is; they want us to look at the game as a serious work meant to inspire powerful emotion, instead of a tongue-in-cheek ride meant to entertain. Aside from the fact that this is a serious missed opportunity, as it shows an incredible amount of potential to be a wonderful parody game. it completely broke the immersion; I was never able to get fully involved and feel the emotions the game was trying to invoke, because all the situations were too ridiculous for me to be able to take seriously. It left me feeling disinterested; further worsening how much of a chore playing the game felt.  Thirdly, the plot in this game is heavily bogged down by the fact that I was completely unable to sympathize with the protagonist, and worse yet, I actually sympathized with the antagonists, as technically, they did nothing wrong and it was actually the hero who started the conflict, (I won't go further into this, as I would spoil what little there is to be spoiled). This left me actually rooting for the villains to win, and gave me no drive to push forward through the campaign; why go through the effort if I can't sympathize with the hero or his plight?   All in all, I simply cannot recommend this game. I found it completely unenjoyable, and would hate to see another person buy this game only to have the same conclusion. I only hope that if the developers do decide to come out with another game, they can learn from the mistakes made in Marlow Briggs, and produce a high-quality product for us all to enjoy. ",
            "review_score": "-1"
        },
        {
            "review_text": "Tries to be too much like God of War, but just doesn't have the huge monolithic bosses or enjoyable puzzles that GoW has, The story isn't great and the gameplay gets repetitive rather quickly; it is just using the same button combos over and over again.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "This is the most average game I've ever played. For everything good there's something bad, for everything bad there's something good. Everything just cancels itself out, and the result is a game that I forgot about within hours after playing it. It's not bad, it's not good... it just... exists.",
            "review_score": "-1"
        },
        {
            "review_text": "I was really enjoying this game until I came accross the type of 'puzzle' I hate in games like these in a level called 'The Antechamber of the God'. It's one of those puzzles that is illogically difficult just for the sake of being difficult. I couldn't be bothered to spend hours battling to complete the 'puzzle' in the unreasonable allotted time, so have simply uninstalled the game and moved on. What you're supposed to do is activiate a series of triggers within a room, but the control system and the mechanics of the game make it near-impossible to do so in the small amount of time given. This puzzle really p___ed me off because up until then I thought the game was great. But because it fell flat on it's face I am giving it a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "Porting performance issues and DRM turn this from a mediocre hack-and-slasher into a Do Not Buy. This is a $5 game and a pretty solid example of getting what you pay for.  The gameplay is decent, pretty good actually, but the story is slow and the platforming sections often feature really frustrating and stupid pixel-perfect jumps. Graphics are... decent.  The combat is pretty solid though, with a variety of weapons and spells. Unfortunately you might have a hard time executing your combos when your framerate suddenly drops into the single digits for no identifiable reason. On top of that, the controls are pretty... weird. with dual mapping between mouse buttons and i, o and p, for one example. This leads to some confusion when QTEs reference one set of these controls when you're using the other. On top of that, the game refuses to accept any controller that isn't an XBox 360 controller, so if you have a logitech gamepad or something else, sorry, but you're screwed. Lern2Joy2Key.  Overall, I would recommend this to someone who likes this kind of game, if not for the porting issues and DRM. The DRM is of the '♥♥♥♥ your progress the connection dropped so I'm kicking you back to main menu' variety. If you don't have a stable internet connection, I would strongly advise you stay far away from this game entirely.",
            "review_score": "-1"
        },
        {
            "review_text": "The label does not have a unique game. It was a bad! They try to copy another game and forget themselves.",
            "review_score": "-1"
        },
        {
            "review_text": "It plays well, but it's very bland. It's like God of War without awesome art direction.",
            "review_score": "-1"
        },
        {
            "review_text": "Just for the lulz.",
            "review_score": "1"
        },
        {
            "review_text": "The soul of Kratos is reborn as a modern day Black Dynamite, resurrected from the dead by the tiki mask from Crash Bandicoot. Using Death's scythe, you rampage through Micheal Bay's exploding African safari hell to get your girl back.  Best .99 cents I spent, surprisingly fun.",
            "review_score": "1"
        },
        {
            "review_text": "I had fun with my 3.6 hours of this game, until I ran into a game-ending bug where the camera wouldn't follow me.  I liked this game, but not enough to play through it again knowing it could happen a second time.  I got this for $.99 so it's ok, I guess.   Buy it, but beware this could happen to you.",
            "review_score": "1"
        },
        {
            "review_text": "Had never heard of this game, until a saw a curator I follow recommend it. A little outdated, but fun game. Deathstalker series-like. Third person brawler with platforming action, plus a bunch of cool ideas thrown in. Not GOTY material for the year it was released, by any means, but a fully serviceable fun game, with plenty of challenge, and off beat moments. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Not finished this yet but wow for the price, fantastically put together b-movie like action game, everything has been said better in other peoples reviews - HIGHLY recommend this for a bit of fun.",
            "review_score": "1"
        },
        {
            "review_text": "A decent game for 69p certainly. But really it is a poor mans DmC or GoW. Nothing really original here but its a solid fun ride for the 6 or so hours it takes to complete. If you can get it cheap and need something to fill some time you can do a lot worse than this!",
            "review_score": "1"
        },
        {
            "review_text": "God of War with a Hiphop Protag",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up for sale for 0.99 cents. I have to say for 99 cents this is a damn good game! Even for its original price of $5 bucks you get a decent amount of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "A hidden gem among PC games. Marlow Briggs and the Mask of Death plays very similar to God of war, but manages to feel fun like God of war. The story is okay, and the voice acting is good. Controls feel tight and responsive, enviroments look awesome and varited. At one point your on a snowy mountain top and the next you deep in the central american jungle. This game is underrated and is worth way more than the steam price tag. I recommend this to God of war fans because it feels similar but has a style all on its own.   And Marlow Briggs is a badass! Gets awesome Mayan powers and nothing can stand in his way! Get it if you have a few bucks to spare. You won't regreat it!",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly fun budget beat 'em up that doesn't take itself seriously, infact one battle at the start of the game takes place on a helicopter pad that is flying through the air after a HUGE explosion sends it off. And the protagonist, Marlow Briggs, even questions the design of some of the levels at some parts, which is meant to be a joke on how some third person action games have really REALLY weirdly designed levels you must go through.",
            "review_score": "1"
        },
        {
            "review_text": "Think God of War with a likeable protaganist instead of Kratos the Psychopathic Jerkface.  Now think Devil May Cry with a slightly less likeable protaganist than Dante and no guns. Just big swingy swords, scythes, and brass knuckles. It also rains fire on your command. All in all, a pretty decent title. Worth your time if you've got some extra money.",
            "review_score": "1"
        },
        {
            "review_text": "This is an under rated game for sure, surprisingly fun and so cheap too!  It has a levelling up system, different combos, abilities, grabs, executions and more! can't go wrong even when it's at full price it's definitely worth picking up!",
            "review_score": "1"
        },
        {
            "review_text": "I HAVE NO IDEA WHAT IS GOING ON 90% OF THE TIME BUT IT'S AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun hack and slash game with decent graphics and gameplay. I booted it up expecting a buggy piece of mess but was pleasantly surprised by how well the game ran. Not a single glitch throughout my playthrough.   The gameplay is alright. The combat mechanics aren't too complicated. It's an easy to pick up and play game. The story much like the gameplay is ok. The banter between the Mask and Briggs is nicely done and as one would expect, James Hong's voice-work is excellent.   It's an all around solid game worth more than the 0.99$ I paid for it.   I give it a 7/10.   ",
            "review_score": "1"
        },
        {
            "review_text": "It's the 'Commando' (1985) of the hack and slash genre.",
            "review_score": "1"
        },
        {
            "review_text": "It is one of the most underrated, fun games you could miss. This was dirt cheap and it is more fun and play that most AAA titles. Plays superb with Xbox Controller. I strongly recommend this title.",
            "review_score": "1"
        },
        {
            "review_text": "Marlow is my hero!",
            "review_score": "1"
        },
        {
            "review_text": "while the game is fun it is a bad port to pc. The movemeant keys to do coincide with the way you face but your orientation in the game. If they worked right would be good but way difficult to do the puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "An amazingly fun game, served in bite-sized set pieces and minigames in Michael Bay style of explode everything.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best uses of $1 on steam, everybody should get and play this because it's fun and not pretentious",
            "review_score": "1"
        },
        {
            "review_text": "Imagine God of War with ♥♥♥♥♥♥ animations, mediocre graphics, boring puzzles and level desings, bland story and characters, unfair combat and cutscenes that 95% of the time are 3D slideshows. If this game has any redeeming features it's the decent voice acting. All in all, only buy this game if it's 80% off or more and it would still barely be worth its price.",
            "review_score": "-1"
        },
        {
            "review_text": "Video game equivalent of a cheap so-bad-it's-good B-movie.",
            "review_score": "1"
        },
        {
            "review_text": "It's no good, because it's a medicore game. It is not a bad game, there are many worse games out there. *Fix Camera angle in a 3D enviroment, which is very very very annoying. *A number of puzzles did not have the right physics and it led to solutions that are not apparent *This game is a god of war clone, but the different weapons have little differences except for the whip-blade. *The magics serve the same purpose, but consume too much manner and that renders them optional in gameplay. There is no fun in using magic attacks *I hate it when developers combine enemies that are spawn non-stop, WITH puzzle. It sucks big time, I can do something better than playing this game with my time. *A good game has you practice trial and error of any with a gameplay that is fun and engaging, this medicore gameplay have you killed because the control is not best designed for it. For instance, the whipblade's strong attack can easily miss the enemy you want to hit, there are four different fight styles but most moves in each style lead to loss of health, and the air attacks are useless to most enemies. *I don't care what happen that fictional dimsel in the plot. (A black protagonist get killed over a white woman and then resurrected, just to die many times again through out the game for that same white woman -- this game is one to be hidden from the single sisters and single mom sister hehe)",
            "review_score": "-1"
        },
        {
            "review_text": "When I first saw some trailer of the game, I thought it wouldnt be so good. Luckly this game proven me wrong in a way. I played couple of levels now and the story is intrestering, its just like watching Indiana Jones. The gameplay is easy to adapt to, and you get good hints if you get stuck too long in the game by the mysterious 'Mask of Death'. I also found the mask to be having a very dark sense of humor. While many consider Marlow Briggs and the Mask of Death to be a bad game, what makes it stand out is that it was designed to be a bad game: which suddenly elevates it into so-bad-it-is-actually-great game.  Technical: So here are a few downsides. For all the great aspects of the game the limited budget does show through in some of the animations. Collision errors occur sometimes where characters are holding things and I did encounter one fall-through-the-world glitch. Those are the only major bad points. On the good side, the enemies are programmed with AI that acknowledges more than just yourself as an enemy. So for instance, if the human enemies encounter the giant bug enemies they will fight amongst themselves while also fighting you. None of that, 'Why are the human soldiers working in perfect tandem with the giant ♥♥♥♥♥ monsters from Mars?' problems a lot of games have. Other than that everything if perfectly functional if a little raw in some places.   Marlow Briggs and the Mask of the Death is an action game inspired by blockbuster films, comic book heroes, and other action games and is filled with exciting combat and gameplay. I played the game using a X-Box controller, so the gameplay wasn't as bad when I tried it just using the keyboard.   Marlow Briggs is a mix of Shadowman, Soul Reaver and God of War. Its not as well scripted, the acting is cery clichê, while the mask of death repetetive lines, can at times become very annoying. Overall the game gives you a decent amount of fun. The quest are overall very easy and not very challenging, even on hard difficulty. You may complete the game in 11 hours play.",
            "review_score": "1"
        },
        {
            "review_text": "Like a B rated 90s action movie flick except it's a B rated game. Average as hell.",
            "review_score": "1"
        },
        {
            "review_text": "Good, low-priced Hack N Slash goodness. If you enjoyed games like Darksiders, God of War, you might give this game a chance. Extremely fun to play and gives you some giggles with its cheesiness every now and then.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game today because I had some left over money from a paysafe card. But this game is absolutly amazing, the gameplay has lots of variation,cool hack 'n slash mechanics,over the top action and micheal bay explosion scenes xD. The game has some humor in it and you won't get bored of this game theres some kind of puzzle solving (i guess you could call it) aspect of it that is pretty cool. You have to jump over fires and machines while doging rockets or jungle insects. I am pretty mad that this game din't got too big because it's such a good game with decent graphics (even thou i thought they were sometimes amazing) cool mechanics , really awesome gameplay , original cutscenes etc etc. The beginning is kind of weird in my opinion. I only picked up the game today so I can't really judge the campaign even thou 'till now it's good. I would recommend it to everybody who likes slashing pyromaniacs/warriors/ninjas and much more xD . Now for the bad comment : The game is a lil overpriced just a little lets say take 5 eu/dollars off and it's fine (I bought it in sales wich whas the best 2,09 EU I ever spend on something haha.) The first level I hated for some reason xD bur if you go a little further it becomes awesome! Anyway I had to make this revieuw because alot of negative comments saying ' Marlow Briggs and the Mask of Boredom' but thats just stupid. Add me on steam if we have games incommen so we could play or if you want to have a chat ;-) -Slash *out*",
            "review_score": "1"
        },
        {
            "review_text": "If you play this you'll be ♥♥♥♥♥in explosions and burping fire, extremely fun and EXTREMELY over the top but in a good way. Worth 8$ Just don't take this game seriously.",
            "review_score": "1"
        },
        {
            "review_text": "For a small team, the game is fantastic! My wholehartedly congratulations to the guys that made this! The action is packed, there are explosions everywhere, you can ride and use freaking scorpions to kill your enemies aaaand... where the animations and interactions lack frames, it's funny as hell. :)",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing QTE's. This game is awesome but dammit why do I have to have a giant icon of an 'a button' or a giant picture of the 'backspace key' show up on my screen with the words 'MASH!' or 'PRESS!' flashing over n over. It really really really takes away from the game and reminds me that this is nothing more than a game and not some sort of cool new age multimedia EXPERIENCE. QTE's in game's are like if you went to a movie theatre and every 10-12 minutes, the movie cast would just stop and stare into the camera until the entire audience claps, then they would progress with their lines and the scene. Ugh. Or maybe force the audience to clap for the previews/trailers..♥♥♥♥ QTE's.",
            "review_score": "1"
        },
        {
            "review_text": "Marlow Briggs is a good game, at some times it looks a bit like God Of War. Nice gameplay !",
            "review_score": "1"
        },
        {
            "review_text": "Marlow Briggs and the Mask of Death is a surprisingly fun God of War clone. It has lots of over-the-top action, enormous bosses, flashy fights, colorful graphics, and a great sense of scale. And it's legitimately funny too.  Marlow Briggs and the Mask of Death doesn't do anything new; it's essentially a God of War knockoff in a modern-day setting. But it succeeds at what it sets out to do, and the action and absurd setpieces never let up. Other God of War clones like Dante's Inferno started strong, only to peak early. Marlow Briggs avoids this pitfall by constantly throwing bigger and bigger stuff at the player. This game can be ridiculous at times, but in way that will put a smile on your face.  Marlow Briggs and the Mask of Death is a blatant copy. But it's a highly entertaining one. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "A playable B-Action movie.",
            "review_score": "1"
        },
        {
            "review_text": "Its a semi fun god of war esque game it is fun and has a few funny moments but theres many irritating platforming moments that i wish weren't in the game if you've got 5 bucks and you don't have anything you're gonna use it on i recommend this to you 7/10",
            "review_score": "1"
        },
        {
            "review_text": "YO THIS GAME IS SICK BRUH  NAH FOR REAL ITS MAD CHEAP AND GIVES YOU A SOLID 6-8 HOURS OF PLAYTIME, BUY IT WHEN IT'S ON SALE OF COURSE BUT EVEN IF NOT, ITS SO WORTH THE $10 THO ",
            "review_score": "1"
        },
        {
            "review_text": "It's a beautiful shameless ripoff of God of War and I don't even care. The game is currently 70 odd pence on the steam sale and I cannot believe it isn't being talked about. The devs wanted to make their own god of war game, they didn't have the multimillion pound budget that you find with AAA game titles but they worked with what they had and what they made is a surprisingly fun, action packed beat em up where practically everything is exploding all of the time.  Word of warning though, this game has NO graphics options, if you have a lower end machine, don't bother. This game is shadered up to the eyeballs.  Marlow Briggs has the veiniest arms.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun. Surprisingly good.",
            "review_score": "1"
        },
        {
            "review_text": "high density button mash action - perfect for braindead evenings. tons of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Very strange action game. A combination of Devil may cry + monster hunter tri + Soul Calibur and that scene in star wars: phantom menace where anakin tames the wild beast in the arena. You also get a really annoying mask that talks to you, gives you meaningful advice, but at most times a bit too talkative for a ceremonial deathmask. It even makes fun of you when you fall off and die in the platforming parts of the game. But there's a lot of work done for just $5. If you like Jax from Mortal Kombat series or a luke cage fan, and want to play as an overpowered, black american sacred warrior, you might want to pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "this game plays out like a real cheesy b adventure movie. don't pay more than a dollar for it.",
            "review_score": "1"
        },
        {
            "review_text": "I have no IDEA how this game has been so far under the radar like it has.... deserves WAY more props than it has... like some have already said, it is a mix of old school, with over the top action movie and God of War feel all in one... though it has a slight bit of low budget feel but no more than a typical action movie would if you ask me... great game so far",
            "review_score": "1"
        },
        {
            "review_text": "This is like a poor mans GOW, but in a good way! A lot of explosions for no good reason and corny comedy. It's a pretty entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "It's one word - amazing.  EDIT: it does randomly quit sometimes without an actual error though.",
            "review_score": "1"
        },
        {
            "review_text": "If you like God of War-type games, but don't want to get bogged down with all of the story, this is the way to go. Seriously, this game is so focused on stupid fun murder-mode that the intro and tutorial are about 2 minutes long altogether.",
            "review_score": "1"
        },
        {
            "review_text": "A very good indie God of War Clone. It's clearly, clearly a budget title, but for the price you get a surprisingly Hype game with plenty of combo-mashing action, explosions, surprisingly good scenery, etc. It has the same faults any God of War-esque game has, but it's fun and you'll root for Marlow Briggs far more than a certain guy who screams ARREEES a lot. You also get a just-shy of annoying Aztec mask spirit-guide thing and some fun dialogue here and there, though don't expect anything mind-blowing. The stop-motion fly-by changeovers is actually a nice touch when you realize they probably had no budget for multiple cut-scenes, and looks stylistic(though not everyone will like it. I find them to run a bit longer than they should be but ehhh).  It won't be the best game you play this year, but it's worth the money you pay to get it and play through.  Also, the main villain is voiced by Lo-Pan. Which is worth the few bucks Marlow Briggs cost alone in my humble opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Surprising solid and well made game. Story is mediocre at best, but the action and platforming are excellent. It isnt the deepest of action games, and it fairly button mashy(its no Devil May Cry). But provides alot of entertainment for a cheap price.  I brought this in the 2014 Summer Sale for 69p. At that price you are crazy not to pick this up and play through it.",
            "review_score": "1"
        },
        {
            "review_text": "It's one of the very few God of War clones still around since the Batman combat came out and it's fantastic. You will learn everything there is to know about Mayan mythology.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for a few hours now and I find it amazing it is alot of fun with rich comedy and gameplay even though the graphics arnt top notch you will soon forget because of the mass amount of crap blowing up will make you have a michael bay wet dream. I can recommend it to anyone who likes comedy and hack and slash games it is a blast, and I got this game for a buck so I got my moneys worth. But I do recomend getting it on sale because it is litteraly a doller on sale. ",
            "review_score": "1"
        },
        {
            "review_text": "It's like God of War and Crash Bandicoot put together. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Steal at 5$. Blew me away. Pure fun, great color palette, great enemies, high octane fighting, great set pieces, and did I say FUN?",
            "review_score": "1"
        },
        {
            "review_text": "Controls get a little wonky. Other than that, I am enjoying the mindless 'sword' swinging in this game. Catch it on sale!!",
            "review_score": "1"
        },
        {
            "review_text": "There are reviews out there saying that this game is one of those that is so bad that it's good. I don't know what they are smoking. Sure, given it's low price i can understand that many start the game with low expectations about it. But i found this game amazing, deserving well more than 5 bucks. As soon as you get to the main menu, you are greeted to one of the best epic main menu songs out there. Everytime i started the game, i couldn't help but listening to the music for at least 2 minutes. The rest of the music are ok, but this song makes up for all of them. Now speaking of the game, it's a ripoff of God of War, but a pretty good one. The story surely sucks, but there's plenty of funny dialog. The graphics are decent and the game is surprisingly well optimized for PC. Now speaking of the gameplay, it's mostly an Hack and Slash. There's a light and a heavy attack that you can combo, and a grab, block and jump buttons. There's 4 weapons and 5 magic powers that you collect, and they all play differently. You can also upgrade them. The combat is good, with a solid variety of enemy types and bosses, but blocking fells a bit off because you can't block in the middle of an attack, so you'll be evading most of the time. Besides combat, there are also sections of platforming (those could be better), puzzle solving, evading obstacles, 3D shooting and top down shooting. Together, it'll last about 6 hours, and if you are like me, you'll play right again on the hardcore difficulty, which isn't really that hard except for some encounters later in the game. For it's price, it has a good lenght. And you can also replay some challenges from the story in the menu with leaderboards, but for me only the first time was added. Probably a bug, but didn't care much about it. And there's also a minigame in the credits, which sucks but lets you skip the credits the faster you complete it. It was a nice addition to finish the game. In the end, the game isn't brilliant, but surprisingly good given it's price, and you should definitely get it if you're a fan of Hack and Slash games. And one sale, it's a steal.",
            "review_score": "1"
        },
        {
            "review_text": "This game is underrated.",
            "review_score": "1"
        },
        {
            "review_text": "The game is just a button masher with 4 super powers 4 melee weaopons and a variety of combos that change nothing really. However the thing is it varies sequences very well - platformer, shooting big guns, slides, little challenges, controlling big enemies, new enemies and etc. You always think it gets repetitve and bam it changes. Not so much in the beggning though. Hard not to recommed for the current price. Too bad the banter tween the mask and the protagnoist and the antagonist are far and few in between. The camera can be rather annoying.   The credit scene game. Do they have to make an annoying one? hahaha",
            "review_score": "1"
        },
        {
            "review_text": "Well executed enough god of war clone with a good sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": " 'I've never seen so many horrible tentacles.'  'If we live through this, remind me to show you some stuff on the internet.'   10/10",
            "review_score": "1"
        },
        {
            "review_text": "There is literally no better game about a firefighter and Mayan death mask on steam.",
            "review_score": "1"
        }
    ]
}