{
    "app_id": 249650,
    "name": "Blackguards",
    "release_date": "2014-01-22",
    "developer": [
        "Daedalic Entertainment"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Turn-Based",
        "Strategy"
    ],
    "achievements": 45,
    "positive_ratings": 1669,
    "negative_ratings": 1050,
    "price": 26.99,
    "description": "What happens when the only hope of a threatened world lies not with heroes in shining armor, but in the hands of a band of misfits and criminals? Blackguards, a new turn-based strategy RPG, explores this very question. You will discover over 180 unique hex-based battlegrounds within a dark and mature story of crime, drugs, and murder.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249650/header.jpg?t=1524646862",
    "minimum_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 (32/64 bits versions) Processor: 2 GHz Dual Core Memory: 4 GB RAM Graphics: nVidia GeForce 8600 GT, ATI Radeon HD 2600 XT DirectX: Version 9.0c Storage: 20 GB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "recommended_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 (32/64 bits versions) Processor: 2.4 GHz Quad Core CPU Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 275, ATI Radeon 4770 Series or higher DirectX: Version 9.0c Storage: 20 GB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "reviews": [
        {
            "review_text": "I mentioned that I would edit my review once I had played more of the game, and I've finished most of Chapter 3 at this point, and wanted to weigh in again, now that there is more content available. Once again, I really enjoy the gameplay. X-Com fans will appreciate the turn based strategy. My earlier concerns regarding the limitations of the trainer system which inhibited true freedom in character development have been lessened however. I still would prefer true freedom to spend my experience points, but the additional content gives you plenty of fights and quests with which to expand your characters, as well as more trainers with the important abilities available to train for. If you are looking for cool loots though, prepare to be disappointed. The emphasis is really more on the characters themselves. As you progress through the story, upgrades of weapons that are marginally better are available, but using merchants to upgrade your characters gear doesn't really feel as fun as beating some monsters or bad guys and finding a cool weapon or magic item.  Overall, I feel the additional content pushes this game from 'not recommended' to 'recommended'. I am particularly excited for when they add more depth to character creation, as this will allow me to pick some starting skills that will more coincide with how I want to build my character. For example, warriors start with the skill that improves your attack when using a shield. If you want to build a 2-Hand sword wielding warrior, this skill is just a waste. But with the new system, hopefully you can skip that in favor of another cool skill.",
            "review_score": "1"
        },
        {
            "review_text": "I reserve words for certain games. Words which define the game itself and help encapsulate what I'm trying to get across. This game merits one such word, and that word is :  'Chewy'  Here's the deal. Blackguards is a strategy game which has been dipped, liberally, in the world of The Dark Eye, think Dungeons and Dragons germanic cousin and you'll be in the right area. It's got a wonderful, thick, rich backstory, with a lot of history, gods, cults, personalities, politics and intrigue. This is a world that over the course of several games (Check out Drakensang when you get the chance if you find yourself a fan of Blackguards, it's worth the time invested) has become every bit as nuanced and subtle as the more accessible DnD counterpart. The operative word though is accessible.  The Dark Eye is to Pen and Paper roleplay what Dark Souls is to videogames. A stern, rock faced, cold hearted, unyielding dominatrix who seems impenetrable and who demands your complete and total servitude, and at the slightest folly will beat you bloody and raw and tell you to start over again. You will, multiple times, due to a flaw in your build that down the line results in your character ending up stunted and a fight proving a little beyond your reach or poor choices when you level your character.   But each time, you will learn, through the beatings and the whippings, much like Dark Souls, you will learn, and you will improve. Eventually once you get past the gatekeeper and once you've survived the rite of passage that is the near vertical learning curve of the games mechanics, you'll find a world that richly rewards, and deserves every minute you spend within it.  The graphics finally have shaken off a lot of the shoddiness and rough edges that have pervaded a lot of the TDE games, Blackguards is slick, smooth, and carries a glossy sheen with it, it's not QUITE melt your eyes gorgeous, but it's certainly pleasing to look at, and the spell effects certainly carry with them a definite sense of satisfaction as they connect and fly about the battlefield. So too has the voice acting and musical score improved, as presentation goes, Blackguards has matured TDE into a strong, and at last truly sellable product.  But it's not for novices. Noooooooo sir. This is not a new player friendly game. So far to date no actual 'Roleplaying game' set in the TDE universe has managed to be even -remotely- new player friendly, this is not about to buck that trend, not when your character sheet runs to five seperate tabbed pages with more numbers to make sense of than the US Federal Budget. Not when the wheel that surrounds your character can offer dozens of possible options as to what action you might wish to take during a turn. Not when a conversation option can turn a story down a route that results in a fight you may not have been prepared for. This game does not go lenient on people who are not careful, not methodical, or not thoughtful.  The main story arc I'm going to leave spoiler free and focus on the mechanical side, the game follows a two-beat system, the world map, being a parchment map overworld that you zip around and visit static settlements to partake in various pleasantly rendered towns and villages, which offer side quests, conversation dialogs, healing and merchants. Then there's the meat of the game, a mix of single encounter and multi-encounter dungeons.  These take place on hex based maps which are closer to things like Kings Bounty : The Legend, however in this case, we're dealing with -single units-, and in this case the strategic rendering is done with TDE levels of detail. Characters are solid, so you can't shoot or cast spells through them, ditto for static objects and moveable objects. This means positioning becomes a factor, you can't just layer your melee in front of your casters, you need to play smart and ensure people are in the right place. Equipment too has significant impacts overall on the fight, with bows having minimum and maximum ranges before major penalties are applied. Spells have granular levels of 'to hit' based on the casters skill... you get the idea. We're talking pen and paper levels of detail, rendered lovingly in the game.  Once you set up hotbars for your most frequently used abilities, fights run pretty smooth and fast, and the strategy element is as the word I used to begin with implies - 'Chewy' - you'll be constantly thinking and rethinking your moves, and the AI puts up a respectable fight even at default difficulty. Environmental hazards too present a real and significant problem, and throw in an extra layer, thankfully there's no time constraint, so feel free to get a coffee as you ponder each move.  Do I recommend it? Yes. With the caveat. This is not a game that will appeal to everyone. It's a niche game. I celebrate it's existence. It's a strategy game for strategy gamers. If hexes, math, and stats excite you, get stuck in.",
            "review_score": "1"
        },
        {
            "review_text": "How would you feel when you are unable to proceed because you do not have the required abilities to deal with the enemy? You could say, tough luck, it is your own fault, because you made the wrong choices.  And I grant you that.   But how can I make the right choices when I do not know the strengths and weaknesses of these abilities? And how can I foresee that the story seriously impacts the functioning of my party? At two moments in the game you will be inflicted with a setback that unhinges your party's fighting power. Once, one of the party members gets killed because the story is written that way. And at another time her replacement, a magic user, gets robbed of her ability to do magic and so thousands of points sunk in developing her magic powers becomes nullified with one stroke.  So you might expect that the game takes this into account, but not at all: you cannot undo your choices nor does the game allow you to make up for the loss of a valuable party member.  This then, in a nutshell, is the problem with Blackguards..   This game is very much like searching for keys to doors, while you do not know which key opens which door, you do not know if a door leads to anything useful, you do not know when or if you will find the key or the door to which it belongs and you might find that the keys and doors disappeared before you actually could make use of them.  So what is left is to go back to an earlier point in the game and find the right keys to the right doors: make the right choices. And unfortunately you might have to go a long way back: perhaps all the way to the beginning.  And then another issue pops up.  Blackguards is basically a tactical battle simulator in which the battles are linked together by a thin storyline that gives the battles context. You will find that many of the common characteristics of a roleplay game are underdeveloped. For one, your party members are a given and so are their classes. Do not expect that you can build your own party.  Furthermore there are few choices in equipment so your party will be running around with the same armor and weapons for long stretches. And while many places have shops, you will only visit them to restock your supplies.  But the crucial issue is that the story is simply too linear. While at some point you can select what to do first, you will be unable to change the storyline in any significant way. And because the story isn't really special at all, redoing this game just so you can change your characters is not enough of an incentive to go through the game again..  Even as a tactical battle simulator the game leaves much to be desired. For instance you are unable to determine the setup of your party members. More often than not the game gleefully shoves your more vulnerable members, your magic users, in the front line. Hilarious is the ability to set traps. You have almost no time to set traps, let alone set the traps that actually make difference. The traps are expensive, the relevant skill requires a massive amount of points and you have only a very limited amount of traps.  In addition some battles confront you with a special setup that is pivotal to the battle, often without explaining to you the specifics. In one battle, for instance, you will be able to make use of automated flamethrowers. But the game doesn't explain this to you, nor do you know what the impact is until you have seen their effect and you figured out how to operate them. It therefore requires you to redo the battle at least once. Some battles are practically unwinnable until you achieve a certain level, or develop a certain ability to a certain level.  Is it all bad then?  Actually no. When I went through the game the first time I actually was entertained. The game uses what I call the fall out principle. The fall out principle is that you start out as a nobody and then gradually start to make a difference when the story unfolds. This is the reverse of what you might call the dragon age effect in which it is clear from the start that you are a special person destined to make a difference. Personally I prefer the first angle to the last.  Also the characters are amusing, even though, or perhaps because, they are so cliche. The remarks of the Naurim, the grumpy dwarf, are pretty funny and in line of what you might expect from a dwarf: a fighter who distrusts magic users and elves.  The story, although linear, has a few twists and also there is some emotional connection as it involves a friend and later on a family member. It isn't also clearcut that the enemy is actually bad and it leaves things fuzzy for a long time. So it seems to me that if you go once through the game(using a game guide to form your party) then you might probably be entertained.    Verdict: Blackguard is a nice filler when you are in between better games. Pick it up when it is in the bargain bin and around five dollars or euros or less.  (Note: steam doesn't allow for a meh score at the time of writing this review. This game most certainly belongs to this category. I gave it a thumbs up just because, when choosing between the negative and the positive, i prefer the latter).",
            "review_score": "1"
        },
        {
            "review_text": "**Not worth the full asking price, still bugged after 2 years, achievements that are impossible to get and various game breaking flaws even in the main campaign**  -  This game is like... Being stuck with a Dungeon Master that won't adapt to anything you do, and force you to continue on the path it set for you- even if you don't like it.  Usually, when I play a T-RPG, I'll find something that work, blast through the story once to get the pacing right, and then play it again in a harder mode and take my time. Well... it is not possible in this game, and to tell the truth, the story isn't good enough to justify that I ever finish it.   Let me tell you : You'll not get it right on your first try.  The game will take away things you put a lot of effort into without you having a say in it. You'll have to start the game over, or read a guide to make sure you plan your characters correctly.  You'll have to use these damn consumable I hate to use, put your points in these damn debuff I hate to use.  In short, if you like to play your own way or feel strong, this game is not for you. If your the kind that like to find the optimal builds, and don't mind a few bugs, buy it for under $10.  =&gt; 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I'm really surprised at some of the negative reviews that this game has received.   I personally found the story to be interesting and engaging, it's dark in places and you need to get your hands dirty, but that's how Dark Eye fantasy generally is. One moment in particular seems to have turned some players off, I thought it was a brave decision by the developers, and I thought it worked well, a story should generate emotion, and this one did. It's not all grim and dark however, and the humour is very finely tuned in places.   Turn based tactical games are a genre that I'm very much into, I play a lot of Chaos Reborn on a daily basis for the PvP side of it. Consequentially I often find that with story driven turn based tactical games that the PvE battles are a let-down, I don't think an AI can generally replicate the engagement that comes from playing against a human opponent. But I tell you what, Blackguards comes as close to it as I've ever found. There's a real wealth of variation in the battles that occur from; small skirmishes, arena fights, fighting withdraws, chase downs, there's all sorts. The developers of Blackguards have really gone out of their way to keep the fighting fresh. As a result this is one story driven turn based tactical game that I can see myself replaying. Just taken on their own the fights are a lot of fun.  I think the one caveat that I'd give is that this is a game where it's worth checking out what happens to certain characters in advance. I’m not going to give anyway any spoilers here, but making your party build based on that knowledge does make a difference to the overall effectiveness of your party by the end of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game in a bundle and was just curious to try it, so I first cheked the store page to see if there were good reviews. There weren\\'t, and people was talking about it as too hard. I agree, the character sheet is very complex and you end up wasting a lot of experience points, but it\\'s not too bad. I really enjoyed the story and I find that the voice acting is superb, there\\'s a point in the game where you have more than 10 side quests and you really want to go on, but then there\\'s a slow down and it gets quite heavy in the end. I don\\'t think it\\'s too hard, but I don\\'t recommend playing this game at max difficulty, it\\'s balanced enough at normal. Overall it was a fun game, far from perfection but still enjoyable, I definitely won\\'t play it a second time, but I will play Blackguards 2, which is said to be even better polished. Hope you found my review useful!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice ideas, even if it lacks in graphics, something oldschool soaring through gameplay. The battles are well balanced and P&amp;P* smoothly combined with turn based initiative system, like in jRPG or Kings Bounty. Nothing more nothing less, the towns are just interactive scenes with available hot spots, side quest, healer, tavern, shop. And this lets you concentrate on pure turn based combat. Mostly I enjoyed the tactic spots on the battlefield, like slippery mud, burning wood and bushes, shooting chandelier and so on. And the voice over is great, such racy accents!  * Updated thanks to the [onkelkarlie] firstly I thought that this game uses D&amp;D ruleset, but it uses the P&amp;P rules from german 'The Dark Eye'",
            "review_score": "1"
        },
        {
            "review_text": "So having finally finished the game, time for a quick review.    Is it worth buying?   Eh, just about. It's regularly on sale for £2 or £3, and I got 70hrs out of it, so on that basis you'd be a whiny little ♥♥♥♥♥ to complain.    Is it any good?   Eh, just about. It's a classic TBS affair. The storyline's OK, but gets kinda convoluted throughout the game so by the end, you've pretty much lost the plot and stopped caring. Something to do with a Whisper...? Anyway.   One big plus is the characters and writing. They're generally a likeable bunch and have good banter between them, and often their conversations raise a chuckle.  Progress is extremely limited - you won't be working your way up through half a dozen better and better sets of gear as you progress: in fact, once you've got a complete set by around chapter 2, you can pretty much forget about upgrading any more. So if you're a loot junky and love waiting for the loot windows at the end of every fight to see what shiny new gear your heroes are getting, you'll be disappointed.  Having said that, if you simply enjoy the basics of TBS combat and love moving your guys around a hexboard and using your new skills/spells to smash zombies in the face, you'll enjoy yourself.   Overall   It's not the best TBS out there, but it's not awful. The thrill fades throughout the game so towards the end finishing it off becomes as much a chore as a pleasure, but at 90% off there's no reason TBS fans shouldn't have it in their library.",
            "review_score": "1"
        },
        {
            "review_text": "Blackguards 'can be described as a great success for Daedalic Entertainment, an excellent achievement not only for the remarkable and outstanding gameplay shift setting, but also and above all as the first role-playing game software house and the first Hanseatic turn based title developed by the team known for graphic adventure games. Although improved technically, the title shows a deep gameplay and satisfying, nuanced and full of variables. The story is told through exciting and lines of dialogue between the epic and the easygoing, although losing some stain areas due to some 'narrative solutions' lackluster. Great longevity, for a title that can take you to dozens and dozens of hours: the longevity of the campaign came on 40 hours, but the player pays attention to the quests will have far more to play",
            "review_score": "1"
        },
        {
            "review_text": " Blackguards Review",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty fun game. There are a lot of looading pages, and even though the game auto saves before and after a battle, it is best to make your own save file. If you loose a battle, and the game reloads, it will autosave again, and unless you have your own save file, you'll be stuck in an endless loop until you succeed, and sometimes those battles weren't ment to be entered yet.   The voiceacting is actually pretty welldone. I was suprised. The art is decent, the story thus far is very predictable, but still enjoyable. There's lots of side quests you can complete. It seems to be a good idea to do them, just to get the experience and the points to spend on spells, and abilities. Makes the game a little easier, and allows for more battle options.   I'm not a fan of the buying system. There's seems to be a limited number of arrows. After buying all of them in a shop, it seems they don't restock. I've come back to shops after many battles to see if they resupply, but it doesn't seem they do. The potion prices are rediculous. Though you shouldn't need them very often.   There is a little bit of a freedom aspect. At a certain point you can choose where you want to go, and dialog options give you different results. You can choose which side to be on in some battles.   I give the game a 6/10. It's nothing special, but I do enjoy playing the game.",
            "review_score": "1"
        },
        {
            "review_text": "Blackguards is a turn-based strategy game with deep RPG elements based on the popular German pen and paper RPG The Dark Eye. You assume the role of your own custom character who is accused of killing the princess in the opening cinematic. Your only choice is to run away, assemble a cast of shady characters such as the suave mage Zurbaran, the feisty dwarf Naurim and the tribal warrior Takate. The storytelling and the characters are solid, but they really don’t stand out in any significant way, for the most part it really feels like a poor man’s BioWare story.  What makes Blackguards truly shine are its great combat system and wonderful game world. The combat system is hex based and may at first remind you of fantasy turn-based strategy games such as Heroes of Might and Magic or King’s Bounty. In reality, it’s more like a combination of Disciples III and Neverwinter Nights, a heavy mixture of classic turn-based strategy and role-playing philosophy. The fantastic thing about the combat system is that every single battlefield is completely unique. Not only are they all different from a visual standpoint, but they are all set up differently as well. Sometimes you’re surrounded, sometimes you have multiple goals, sometimes you have to defend something. You can also use the environment to your advantage. Cut the rope to make the heavy wooden chandelier fall on your foes or burn down the walkway spiderwebs causing deadly poisonous spiders fall to their doom.  Another big thing different from usual turn-based strategy games is that you’re not building an army, you have a party of up to five characters. As you progress through the game, you acquire adventure points which you can use to upgrade your characters in a wide variety of attributes, abilities, spells, talents and weapon talents. It’s a really robust system that allows for truly deep customization and experimentation. The only negative thing is that the game assumes that you’re familiar with The Dark Eye ruleset when in reality you will need some time to really figure it out.  The other problem stemming from the use of The Dark Eye ruleset is that almost any attack can be a hit or miss. Because the game is really tough and the opening battles are rather grueling, it can be really frustrating missing a 95% attack. There are ways to upgrade your characters to offset this, but again, this will take some time to figure out as the game doesn’t really explain much of anything. This can cause some really ugly bouts of frustration and anger, but it’s not a deal breaker.  The vast majority of the gameplay is in the battles. Apart from that, you’ll be using a lovely 2D map to travel from location to location. Towns are represented with a single screen depicting various points of interest such as shops, healers, blacksmiths and quests. The graphics are absolutely beautiful, the wonderful art style is sort of a mixture between fantasy, medieval Spain and 16th century Caribbean which is actually seldom seen in games. The accompanying soundtrack reflects that as well and fits the game very well. However, the animations aren’t that great and the voice work, while mostly solid, can be a bit cringe-worthy at times.  Blackguards is a hardcore game for hardcore gamers and it is completely unapologetic about it. So be prepared for some truly grueling stuff and a steep learning curve. The great thing is, it’s absolutely worth playing thanks to the great combat system, deep RPG elements and a wonderful game world.  8 OUT OF 10 (GREAT)",
            "review_score": "1"
        },
        {
            "review_text": "Some stats and other aspects were a bit confusing at first. But once figured out, Blackguards is pretty solid. There are a few minor bugs, like overlapping text, here and there. But nothing too terrible, IMO. Overall, I really enjoyed Blackguards, and I'm sure I'll play it again in the future.",
            "review_score": "1"
        },
        {
            "review_text": "First: Blackguards isn't bad or good. It's just extremely mediocre. If you're into D&amp;D alternatives and dig X-Com, it probably won't waste your time. But I can't recommend it for most people.  The character customization is surprisingly lacking, despite the illusion of choice. There are twice as many attributes as a D&amp;D system, but they all just sum together to increase your attack, dodge chance, initiative, etc. There are only a handful of combat abilities to use, so there's not a lot of choice as far stabbing/shooting. The magic users are more nuanced; there are a ton of spells, each with 4 tiers, so you're constantly weighing the cost/benefit of those.  Combat itself is very similar to X-Com or D&amp;D 4.0: you get either a move and an action, or a double move. This all occurs on a hex-grid, and most maps have some sort of interactable element to spice it up. They do an admirable attempt to differentiate the levels, but you will take place in about a billion combat scenarios, so a lot of them inevitably feel repetitive. You'll probably be skipping side quests by the end out of boredom.  The plot is pretty linear. There are batches of side quests that open up at various points, but none of them augment the main plot line at all. It's your typical RPG 'save my daughter' or 'escort my caravan' kind of stuff. You become enslaved and forced to fight in a gladiatorial arena at one point, so that's pretty neat.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent turn based strategy game with an ok plot and delivery....  Installed and ran fine no issues, not one crash, just completed first play through. I enjoyed socialising with the denizens. Those that couldn't be killed were quite relieved.... good day had by all! Some decent fun to be had at sale price :) Will play again at some point after I've gotten over decieving myself that I was a good dude but still made lots of ummm poor ethical decisions :D",
            "review_score": "1"
        },
        {
            "review_text": "Not a particular amazing game, but enjoyable enough and some cleverly designed scenes here and there prevent you from tackling each and every battle with exactly the same old strategy. Comparing the number of pros and cons, it's a really impressive game; but one of the cons just happens to be super important to me, bringing the game down to just decent instead.  CONS The game can basically be broken down into four parts: cutscenes; inventory/ability screens; towns/shops; and battle scenarios. Each of these is actually very well done. But it leaves the game feeling a bit hollow simply because you don't get much of a feeling of exploring. You move around the map by clicking on dots. You move around submaps by clicking on dots. Even the towns/shops just feel like clicking on dots. They shouldn't, because they're much more visual, but the game just builds that feeling of dot-clicking into it, and you can't shake it.   The inventories get messy. Weapons and armour can be seen separately, but everything else is all piled up in one section with no sorting options. So when you're looking for healing or mana potions, be prepared to go through page after page of poisons, traps, buffing potions, throwing weapons, and EVEN all the 'quest items' - new and old, jumbled up with them.  PROS The cutscenes are well done, the plot's interesting enough, and you really feel like you get to know the characters.  There's a good number of abilities, categorised in some interesting ways. Most importantly, the spells have enough variety that you can really explore a range of different strategies. Even within typical categories like direct damage or buffing, there's still variety. (Potential SPOILER examples:    Direct damage has single target, area of effect, enemy hunting single target, cloud spawning enemy hunting single target, and whole map blasts; and some of those stun, or knock down, or curse/debuff. And that's just within direct damage. My favourite quickly turned out to be a shadow duplicate spell - which for me meant creating a second archer-mage for 3-5 turns, whose arrows are shadow too, so it was like getting double the mileage out of each arrow).    The variety might take a little while to sink in, because at first it looks like 24 spells with 4 levels of power each. But within the 4 levels for each, most have at least one significant change, so it's actually more like 48 spells.  The options for non-spellcasters are more limited, but still allow for some good variety - especially since you can have up to three weapon sets; and/or make use of traps and throwing weapons. It's hard to do early on, but each route you take eats up experience points, but this ultimately allows you to do things like: (a) Carry a giant two-handed bashing weapon for massive damage and quick battles, but be ready to switch into sword and shield if you need more defense and accuracy. (b) Run around with a two-handed pike-style spear, but pitch javelins and poison bombs at your enemies before they get into melee range. (c) Mix up archery and fencing. (d) Go all archery, but set traps - especially stunning or slowing traps - around you when melee fighters look like they're going to get too close. (e) etc, etc.  The weapons and armour are pretty bog-standard for an RPG overall, but are just varied enough. The expense might seem frustrating at first, but I enjoyed the way it made me mix and match parts more often, and set different characters up with different equipment sets. And when there are all kinds of traps and poisons and buff potions, etc, as well, it feels like you've always got something new to pick up.  The combat! At first it looks like each map is going to be a matter of big vs small, wide vs narrow, and empty or covered with traps or blocking environment. That'd lead to a bit of variety, but eventually you'd work out a couple of strategies that you'd just use over and over again. But soon enough, you start seeing unique twists (some are repeated a couple of times; some are just used once). There are plenty of them, and they are what really make the game worth it in the end. (Potential SPOILER examples:    A super long get to the end before the poisonous mist catches up to you map. Skeletons keep coming back to life unless you smash the crystal maps. Sneak through the dark and you won't have to fight at all maps. Maps with cages to open to let out support. Maps with cages to close to trap beasts. Maps with buildings you can knock down to crush some enemies. Maps with spider webs hidden like traps and as bridges you can knock out from under the spiders. And more and more.      ",
            "review_score": "1"
        },
        {
            "review_text": "Decent turn based tactical game. Tends to get somewhat repetitive over time, and suffers somewhat from the inherent weaknesses inherited from the Dark Eye game system and background. It also lacks somewhat a real feeling of character advancement - after playing a decent amount of matches you feel barely much 'better' than in the bginning: the character have little more HP, the weapons do little more damage, etc.   Full price I'd say it's not worth it, but on a sale it's a nice game to sink some hours into - if you like turn based fantasy tacticals, that is.  I still prefer the 'old' stuff like Icewind Dale or Baldurs Gate for turn based combat, though, or the non-fantasy new ones like Shadowrun - which has both better system, and better plot. One thing I didn't really like was the chained battles - in the later part of the game you can have two or three battles chained after one another, without any opportunity to rest &amp; recover, or even to reload bolts &amp; arrows or potions &amp; poisons.   6/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game so far, I'm enjoying it... Scratch that....  Combat which you will be doing alot of is bland and repetative. Be prepared to be posioned in alot of battles, also prepare for your spells to fail regardless if you are maxed out in them, For example I had 1 spell called Cold Shock (Level 18) Maxed in the description I have a 99% chance to cast, in one battle this % drops to 8% with no explaination. This game is not not very forth coming in telling you the negatives that effect you well unless is poison :).   Magic, What the game does not tell you is with spells that effect all enemies your chances of casting these spells drops to stupid odds... For example in the last few fights in Chapter 5 I was trying to cast a few spells the chance was 1%, please understand I had all my skills maxed regarding spell casting, even reliable spells like the Fireball one was reduced to 48% from 99%. As a whole being a magic user you are punished. Does the enemy get punished in the same way? No they are able to case level 4 spells at 99%.  Storyline, seems non exsistant at the moment and I am on chapter 5 the last chapter, you arent made to care for your choices or characters sorry I like to feel my choices in RPGs actually make a difference.  Skill Trees, again like combat it is bland, if you go melee you want to go for Hammer Blow which forces you to take Two Handed Bashing or Axes and Maces. I did start the game of as dual wielding swords how wrong I was :(. There is very little choices in skills say unlike games like Path of Exile.  The equipment you get is standard and boring. You would expect from a Fantasy RPG to get some magic items well dont hold your breath, there are a few items that will give you the odd boost but they are few and far between.  Overall as a fan of Turn-Based games and RPGs Blackguards comes up short in so many ways.  I am glad I paid less than what its on sale for.",
            "review_score": "-1"
        },
        {
            "review_text": "This is probably the most fun turn based RPG i've played since Baldur's Gate 2/Icewind Dale. Not very far into it yet, but I'm enjoying the ♥♥♥♥ out of it. The events are challenging, but there is a 'retry' button for when you wipe and need to go at it from another angle.  Can't wait to see more.  Update: Ok...best RPG I've played in 10 years. It's unbelievably fun. I wish there was more with gear upgrades, but I guess I'm still pretty early on in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Blackguards is a RPG with a decent number of dialogue choices. The story has its ups and downs and early it is a bit confusing because they throw alot of unknown terms at you and and most of them you will only learn halfway through the game. And the end is kinda lackluster in my opinion.  The combat is turn based and the battles are mostly diversed since some can have puzzle elemnts others can have a few stages and so on. And your choices along the game influences some of the battles you have.  One of the biggest problem in the game is the amount of stats and character builds you can do makes the game way to difficult and players that dont understand how the game works in that regards can completely screw their games and be forced to start from scratch. The game does a really poor job of explaining how the overall stats work and the only way to learn about them is looking at help menu and read it or go to the manual.   On the positive side when you learn to make a proper build your mid-late game characters can have quite impressive abilities and power, the high level spell effects are rather impressive.  Also it is worth mentioning some of the achievements don't work properly or don't work at all.  Overall I liked the game however the high learning curve that can really punish you is something that only some people can tolerate. And the game only really offers a couple of playthroughs in terms of story and in regards to builds I dont think that people will play purely on the interest of seeing builds with diferent weapons, the spells are nice but they will not make the players play the game again just to see their high level form.",
            "review_score": "1"
        },
        {
            "review_text": "Start the game with two-handed sword fighter, realise everything except one-handed bashing is literally useless because that's all the game is scripted to give you.  Struggle and get to the mission where you have to rescue the Baroness, realise it's literally impossible and just try to finish by killing the enemies.  First few rounds are spent trial and error restarting to figure out there's invisible traps, and you need to start the round with a spell that has a 45% chance to destroy the boxes and set enemies on fire.  First try: Slowly skip through cutscene, wait for enemies to move, fail 45% chance spell, restart.  Second try: Slowly skip through cutscene, wait for enemies to move, fail 45% chance spell, restart.  Third try: Slowly skip through cutscene, wait for enemies to move, fail 45% chance spell, restart.  Fourth try: Slowly skip through cutscene, wait for enemies to move, fail 45% chance spell, restart.  Fifth try: Slowly skip through cutscene, wait for enemies to move, fail 45% chance spell, restart.  Sixth try: Slowly skip through cutscene, wait for enemies to move, 45% chance spell works, dwarf decides to move through 2 hexes of fire rather than one losing 20 health, take two critical hits from archer, in the end only dwarf left with 2hp and archer enemy with 22hp. Dwarf power attacks archer, deals 18 damage, archer attacks dwarf, deals 4 damage.  Stop playing. Look at achivement stats, only a quarter of people finished Chapter 1. I wonder why.",
            "review_score": "-1"
        },
        {
            "review_text": "Ive had a great time with this game so far. Its one of the better turned-based RPGs that I have played in a long while. If you like this sort of game, I definitely suggest getting it.",
            "review_score": "1"
        },
        {
            "review_text": "Battles are challenging enough to keep thinking till the end of the game, intriguing story, hard decisions... Serious risk of drowning in. Be warned. :)",
            "review_score": "1"
        },
        {
            "review_text": "A terrific return to Turn-Based Combat, with a slightly darker, fantasy story. It at once feels like a renaissance of the turn-based genre, but with some newer, unique ideas. Character customization looks outrageous and daunting at first, but with a single type of Adventure Point and clear class-goals, linear guidance eases the pain, while still allowing anyone to experiment with wild combinations. It's a classic tale of old-school meets new-school, all in a really tightly-produced package. Graphics, story and gameplay are all great.",
            "review_score": "1"
        },
        {
            "review_text": "Tough but rewarding. This is (luckily in my eyes) a typical The Dark Eye game. If you do not know this RPG system: it's Germany's biggest and probably oldest Pen &amp; Paper RPG system that is still maintained. And as many things from Germany it is deep and complex, but needs a certain degree of dedication.   You will not be able to simply start this game, kill some enemies and have fun. You really need to have a look at the rule system and how all the character values influence your fighting, casting and other skills. The same goes for spending your experience points, if you simply raise a stat here and there you will find the game very hard and probably quit. If you decide what role a character will have and raise the necessary stats and skills for this you will have a much easier time and will be able to enjoy the very complex fight options.  One definitive pro from my point of view are the really varied battle maps. Most maps have unique interactive features that you can use in the battle, like alchimistic tables that will poison bystanders when smashed. Or drawbridges that can be raised or lowered. Or cranes with crates that might smash your heroes from the docks - or the enemies if you position yourself smart enough.  Alltogether it is a clear recommendation for me if you like complex strategy games with RPG-like character development. Do not buy if you look for Diabloesque casual RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "A horrible turn based RPG.   The A.I. makes no sense at all and seems to just roll of RNG. For instance, you could be in combat with an insect, a large dumb version of 'lice' that would waltz right by your entire team to go secure an objective that you should be holding that the insect doesn't even KNOW about, story wise.   There is no way to view your armor as a whole, to compare it to other armor sets. This also doesn't let you save in combat, and the combats are slow and tedious. Matter of fact, I had the FINAL gladiator fight I was in crash on the next to final turn as a waited out the final baddy to blow up (was on a timer in an arena and covered in oil and lit.)  This game will make you rage, not because of the difficulty, but because the horrible interface, no real enemy A.I. (I swear they go full retard half the time. 'Oh hey, spikes. I should jump up and down on this space over and over again until I keel over!)  Overall, go with something more polished that you can get your hands on. Only 5 characters to play as in this one too, so I suggest you roll an archer, considering you don't get to keep one, forcing you to roll an archer (or gimp someone else into an archer) if you want a balanced team.   Also, no explanation of half the games mechanics makes this a very annoying venture.   Really don't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I am glad I only got this as part of the HumbleBundle (Side note, support Humble). This is a turn based, hexgrid, dungeon crawler, rpg based on a not unheard of tabletop system. It plays like a fan created mod to another game, in every way this game screams its lack of polish, it's terrible design and its aweful assets. This game makes NWN 1+2 look cutting edge  *FLAWS*  1) Inconsistant Mechanics; in short, they're half baked. An early mechanic is terrain tiles (water is slippery, bushes are flammable etc) and in theory these could make for some more complex tactical play, but sometimes thats not the case, water may just be a watery looking tile, or it may cause you to fall on your ♥♥♥ and be prone for a turn. Enemies never use them either, they just move to attack range throw fire, ice and poison.  2) Incorrect RNG; this is a tabletop system adapted for the PC, so of course its simmulating (with a pretty bad generator I might add) die rolls under the hood. You get told a percentage chance to hit (and can level up enough to see other stats) but the percentage shown is WRONG. That's right, the game actively lies to you because its number generation system isn't implemented right. 100% chance is actualy 90%, 65% is actualy 40%. You will also see the same resualt consistantly for mid range %, every time I fire an arrow at a humanoid enemy with a 65% chance to hit I would miss without fail. same goes for 50% with melee, this makes me think the random generator isn't so random after all.  3) Atrocious Voice acting; Dear gods is it terrible, it's not even laughably bad, the actors are often re-used but its like no-one told them they were doing different characters so everyone they voice sounds identicle. They were also clearly recorded completly seperatly without any lead in or practice because they're all delivered with the same dry detatchment of people with a full frontal lobotomy.  4) Poor story telling; The plot may improve as time goes on, but from what I've experienced so far I can already tell you my version 'And so it was that the brave ranger stabbed the annoying sidekicks while they slept and went to live away from the continent full of madmen'. Honestly it started out bad enough with the giant wolf having killed (or having been eating) a random damsel, you kill the wolf and then get arrested for her murder. The wolf was right there, you kill it, its body is lying on the ground next to the corpse, yet they arrest you for her murder. The rest of the story was following a bread crumb story into a veriaty of linier dungeons, speaking of which.  5) Dull Dungeon Design; if you're making a dungeon crawler then you need decent dungeons, so far everything has been a straight line with preset encounters, no element of maze, mystery or surprise. You know you will need to enter each point on the dungeon map, you know that each point is going to have an encounter, and you know that you will want to save scum the hell out of it just to preserve your precious resources.  6) Cheap assets; It's ugly. Very Ugly. There is no sense of unifying aesthetic. Everything is the same blocky 3d models with dodgy shadowing, terrain detailing can actualy conflict with mechanics 'is that shoreline tile a water tile or a land tile? You won't know till you step on it' the models are barely detailed, only slightly more complex than the 3d models used for CIV V (the ones designed to render quickly at distance and not be looked at too closely). Combine this with a lack luster muZak score and it just doesn't feel good to experience.  7) Poor Performance; for a PC game, its not offering much in the way of performance options. You can set nebulous graphics quality but get no fine choice, you can pick a resolution but theres no windowed mode. In game I've seen multiple graphics glitches caused by lighting effects, flickering textures and even the Hex Grid breaking and flashing at the bottom of the screen. ",
            "review_score": "-1"
        },
        {
            "review_text": "A frustrating design nightmare. Suffers from classic Euro-dev 'difficulty' design flaws. Everytime you lull yourself into a state of enjoying this game, the devs ♥♥♥♥ up. You can almost smell the body odour of the geek who thought taking away all your loot for an entire climactic segment of the game was a good idea.  Don't bother getting attached to characters or strategically saving points to spend on a worthwhile skill. You can lose them without any notice, having wasted opportunities to use those points to get you through certain battles. Cardinal error.  Some fights are designed to be artificially punishing. I haven't used the word 'cheap' since I played Nintendo in the 90s.",
            "review_score": "-1"
        },
        {
            "review_text": "It's the best looking tactics, turn-based, strategy game yet. It has a deep storyline like most RPGs of old. It brings back memories and a chill out game without you getting mad or mashing buttons to get a kill. A good rest from all the games that requires lots of keys to win. Let your mind do the playing! Can't wait for its release.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting RPG game with some strategy that was initially sold to me by referring to it as being in a similar vein as Shining Force (still one of my all time favourite games). It does have to be said that the premise and characters aren't as dark as you would initially expect, given that this game promises something close to flawed dark 'heroes', but does make a nice change to the usual knight in shining armor. Am only in the 2nd chapter so am not sure how the slighly repetative layouts and fights will play out as I progress, as do feel that it may grow stale after anothter 10 or so hours. Also the inability to grind to gain AP (like EXP) does irritate in a game where every point counts and you feel as though you have never levelled up the right stat/skill/spell. Bug-wise tha game has been fine thus far. One gripe I do have is that I expected the bonus from equiping a set of armour to be more obvious and worthwhile than it currently is.",
            "review_score": "1"
        },
        {
            "review_text": "Very very nice gameplay and visual part.",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn based Rpgs like Final Fantasy Tactics, this game is for you. The story is fantastic. There is a ton of depth, and a ton of content. Please do yourself a favor and pick it up",
            "review_score": "1"
        },
        {
            "review_text": "game of teh season. no dubts. like old good Gorky-17 with imroved skilltree and medieval crap",
            "review_score": "1"
        },
        {
            "review_text": "This game has strange difficulty spikes - don't be ashamed to turn the difficulty to 'easy' for one or two engagements. Great game, though! I definitely enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "Would I recommend this game to everybody? No, not at all. Would I recommend this game to people who I know love Dungeons and Dragons? Yep! (Only when the game is on sale)  This game, as you know, is based on the Darkeye D20 ruleset and is only for those who like stategy turn-based RPGs. Darkeye is pretty big in Europe from what I understand but I personally never ran a game with it and I wanted to experience the system in an easier to digest way and I felt I got that from this game. Package that with the honestly funny writing and interesting characters and I enjoyed myself. Note, however, that this game is entirely about the combat system and RPG progression. The story is there, but weak, and there is no exploration. The retail price is too steep for what you get but if you see this game for $15.00 USD or less then I'd suggest picking it up for fans of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Underrated game: after a rocky start it offers plenty of challenge, character customization and a fairly good story. The tactical fights are fantastic and some spells have many interactions with the objects of the map and other spells. Just read a character creation guide and you're good to go: if you like fantasy, strategical rpg and humorous banter, this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Blackgaurds is one of the most addicting games I have played and has been a great game to start out 2014 for me. This game has some of the best voice acting and music I've heard and its gameplay feels like it actually melds with the story. Quite a few times you'll be presented with interesting alternatives in combat most wouldn’t think of in a turn based RPG. You could go the classic route and just beat the baddies in a one on one fight, or if you’re feeling creative lure them into hazards that you normally wouldn't think of. For instance lure them into a bush then set it on fire or release a group of prisoners to fight for you. Even some battles have great story elements. Need to collect some mushrooms while a giant troll is guarding them. Distract the troll and gather the mushrooms, then run. It’s these types of options that make you feel like you’re having an impact and cause you to think outside the box. The few problems I do have with the game mostly revolve around a few graphical glitches and sometimes the enemy AI can be a little too slow. Graphical glitches like people suddenly having mouths that stretch way too far when they speak or the amount of a silver currency you earned being blocked has happened to me. While the biggest flaw is probably the AI, I like how you can set traps for them but when an enemy chooses to continually get burned in a bush and not leave it that’s when I call stupid on the AI. These bugs can be annoying but they don't break the game and I recommend this game to any RPG or Turn-Based Strategy fan.",
            "review_score": "1"
        },
        {
            "review_text": "I am still in Chapter one of this game and so far I like it. I picked it up for 75% off during the winter sale. It defiently feeds part of turned based tacitcal RPG itch you might have. For been an early access it seems very well polished, and I have not had any issues with playing the game.",
            "review_score": "1"
        },
        {
            "review_text": "A great turn-based RPG without all of the random wandering fluff. Being based on The Dark Eye gives the rules a sense of deep development that you don't see in games that have invented their own ruleset. Pure classic tactical combat with enough character development and such to keep you playing well past when you should.",
            "review_score": "1"
        },
        {
            "review_text": "Old school RPG with turn-based combat system, nice graphic and pretty fun dialogues. Quite an hard game with some harder difficulty-spike in some point but nothing exceeding. It's about 60 hours game . Here i put some advice that i would have needed .  General advice: - Let Naurim tank,he will tank everything on the earth.  -Buffs,debuffs and almost all spell at level 4 hit the entire map. (for exemple u can buff your entire team or debuff their ) -check all spell teacher to get passives,mage are dumb cows without accuracy passive. -at the beginning seems that all mage spell has low chance to hit,when you up em and get accuracy passive almost all abilities have 99% chance. -heals are very important,get em at least al lvl 3 ,pretty nice to heal your wounds. -CHECK THE ENVIRONMENT,it will always semplify battles.  Starter Class Advices:  first 50% of the game:  -Normal attack damage class ,specifically 2 Handed weapon or archer are insanely strong . -Mages are nice but you've not lvl 4 spells and suffer cause of low mana.  -hybrid is overpowered: get for example an archer + increased ranged damage buffs.( same for melee)  Other 50% -Normal attack damage class are still strong,lot of hp,dodge,and damage. (melee weapons with poison are pretty nice) -Mages now can annihilate an entire battle alone. Just with lvl4 flame spear ,evel 4 shield and level 3 thunder globe. -Archers with buffs are still overpowered.  Good luck and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Get ready to get frustrated by missing 90% plus hit chance constantly. That being said its still fun combat and when you finally win a match after 5 tries it feels amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, but it has issues.  1. Character modeling is overly limited. Common oh about 6 years back, but nowadays.. 2. Inventory acsess is problematic. Too many other games out there had this fixed 15 years back. It's unexsuseable passed 2010. 3. It's not open world. Which wouldn't be a problem except in this system it's so tightly plotted and linear that it almost kills the fun. Not to mention the plot is soo sooo easy to figure out that well....  However I like this game's world. I just wish they let me play in it outside of their story.",
            "review_score": "1"
        },
        {
            "review_text": "Even though its in an early stage, it has alot of potential. I have enjoyed it so far, and probably will enjoy it even more with the coming patches.",
            "review_score": "1"
        },
        {
            "review_text": "Blackguards is a hexagonal turn based strategy game with some fun elements to it.  The story line is fairly interesting, with many offshoots in the plot to keep you entertained.The graphics are nice and clean and the voice acting surprisingly good, with many humorous lines from the characters as they play off of one another during your adventures together.  The learning curve isn't too harsh and the tutorial helps a lot during the start. However it can at times be a little punishing and you will find yourself hitting the restart button on quite a few occasions, especially any levels involving poison, to which there seems to be many. In my opinion the mechanic is used maybe a little too much throughout the game and the effects can start to become a little irritating, so spec to counter this when you get a chance. There are a few bugs, but nothing I would consider to be game breaking, so all in all Blackguards is worth the buy, but I would recommend waiting for it to be on sale and avoid the full price. I picked this up discounted and am more than satisfied with what I got for the money.",
            "review_score": "1"
        },
        {
            "review_text": "8/10, one of the most enjoyable turn-based titles of the past year. Reasons? A lot of innovation: combat and level-up system, plot twists. Most annoying thing I remember weeks after playing it - no way to cancel or speed up animation. The bottom line is: close to a must for the lovers of genre, but I could hardly recommend it to newcomers.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisngly good fun. A ton of quests, a hefty amount of character customization, fairly solid voice acting, and most importantly, good turn based strategy combat. The game does very little to ease you into it, but once you pick up the mechanics and understand the stat system behind the scenes, it really comes into its own.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game overall with some decent stratergy in the battles. The animation and voice acting were pretty teriible and the story was pretty average. Good character development and skill selection make it addictive though and there are heaps of different maps which keep the battles interesting.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best squad turnbased rpg's i've played, you can customize the weapons and armor on all your squad members, level up and distribute points. Blackgaurds is very fun and very challenging, great graphics, backgrounds, animations and story, and it is a long game with alot of sidequests. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Not doing a lengthy review, just want to give this game a thumbs up. Awesome turn-based RPG, troubled only by a handful of frustrating fights (frustrating for all the wrong reasons). I wholeheartedly recommend it, though!",
            "review_score": "1"
        },
        {
            "review_text": "Very decent turn based combat, and screen based towns and rooms is done nicely. The problem here is that it is seriously difficult even in Normal. It makes XCOM Classic Mode look easy. I also prefer easy-to-understand games, so its fairly complicated stat and skill system isn't quite my cup of tea either. I do recommend this game if you're very good in RPG and turn based games, since besides the absurd difficulty it plays nicely, but be warned.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game, I was able to beat it at last, it can get a little odd with the random crashing for windows 10 but that by no means would be a indication that this game is not 100% worth it. Fantastic RPG and a must have for RPG gamers!! A+",
            "review_score": "1"
        },
        {
            "review_text": "High rate on this MMO RPG Tactic Game..",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it, though without a background in this particular DnD set (TDE) I'd suggest the balance is a little out of whack. You'll likely need some internet research (and there isn't too much out there) to make any progress. It's more about tactical combat than a 'proper' RPG, so know what you are getting into.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "When I first started this game I was like: 'Oh it's gettind difficult' a sensation, we gamers long for in a tactical, strategy game like this. As I played it and encountered many quests, I realized that some of them, not all, are basically the same: *Go kill this, collect this, bring back* after this grind fest there is a few moments of joy when you become a gladiator and fight for your life but even that gets simply taken from you with just a few kills. The problem rises with Lysander, the guy who enprisons you, acuses you of murder and tortures you and than later on  _________________SPOILER_____________________________________ You find out he is your friend and he never trusted you and he is actually against the Nameless one and Urias. ____________________________________________________________ The game than ends shortly, I mean seriously! I finished the game in less than 22 hours of playing! Short game, and this is with the DLC (which I never felt as a unique experience). But the game provides some good experiences in controlling the battlefield with your unique spells, skills and etc. Btw Takate is useless as a Spear user, as you soon realize: Zombies, Golems, Humans with armor and mostly everything including those annoying healing crystals which you need to kill are immune to Piercing damage! Switch him to Bash damage. Do I recommend this game!? For 50 bucks, No! Than why am I in the helpful notes? Because when it is on sale for 20 bucks or less, is worth the 22 hrs of fun they provide.",
            "review_score": "1"
        },
        {
            "review_text": "There might be a good game buried somewhere in here, but the initial few levels have bored the bejezus out of me so hard, it's tough to imagine how I would get to it. I like the hex based system that was implemented, but so many menus and tutorials are thrown at the player first off, this game comes across more as 'player-character manager' more than 'turn-based strategy RPG.' The combat from what I played after the first prison level went downhill fast and continued to turn me off from ever playing this game again.",
            "review_score": "-1"
        },
        {
            "review_text": "My review was going to be positive, it's a fun game and has nice combat play. The issue is that the combat is just truely unbalanced and the hit odds are not correct. Either the battles are fine or they are incredibly lopsided nearly impossible (just turn it to easy and grind it out).   The issue with the hit odds is gamebreaking. I've missed 3 100% hit shots. I routinely miss 80% shots. 'But bwag, 80 shot chance still has 20% of missing!' Yes thank you mother ♥♥♥♥ing genius. Help me explain how on two mission tries I missed a chain of 8 60% shots all in a row and then restarted to miss 11 60% shots in a row. ♥♥♥♥ this odd system piece of ♥♥♥♥.   Odds of 8 misses 1.7% Odds of 11 misses .36% Odds of 19 misses .0061% (in a row)  Odds of missing on a 100% of the time shot (Apparently not 0%)",
            "review_score": "-1"
        },
        {
            "review_text": "Most linear, scripted CRPG I've ever been compelled to spend way more time in than I should have. The game forces these ham fisted limitations in fights that severely hamper you from using your party members the way you want, which is the whole point of a CRPG.     'lol druggie archer party member got eaten by a giant louse xDD'        Niam's death was the last straw           ",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game so far! Alot of 'luck' involved with combat but from what ive read it stays true to something it was based on (not something i know about). The game its self is great though,interesting story,love the look of the game,really enjoying the abilty to customise my characters my way in almost every detail. Very much recommend you play this if the genre is your kind of thing!",
            "review_score": "1"
        },
        {
            "review_text": "A quite fun turn based game, its very challenging and -very- hard even on normal. Though when it become too challenging it does have a easy setting you can put on ingame. incase its too hard for some people, but sweet game, and nice story.",
            "review_score": "1"
        },
        {
            "review_text": "Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Blackguards is an tactical turn-based RPG game that brings some new soultions and points of view to the table, that are not always good.  (New feature - Simple city interface.) If you remember Drakensang, Dragon Age or most other RPGs cities, large, vast, many NPCs, a lot of chests to look and barrels to smash for loot. Nothing like that in Blackguards. City is a simple one screen view with most important NPCs, merchant, healer, trainer, quest giver, tavern, the end. If you have business in the city it takes you about a minute to get it done and leave to get back to action. Some might like it, some might not. I like it, as it saves time, no more need to remember where was that cool merchant or a hidden pass etc.  So you may wonder how does this tactical turn base combat looks like. (Character summary) Before we get there you must know that Blackguards are based on The Dark Eye RPG pen and paper system. And character development is very much like in the pen and paper game. If you played Drakensangs before you will be very familiar with the system.  In most RPG games you have classes to select. There are no classes in this game. When creating character you select if you wanna be spell-casting able or not and then you build character on skills/spells you chose. In that this system is similar to Elder Scrolls. If you wanna be a warrior you can be a warrior, if you wanna be a warrior-priest you can be warrior-priest it's all based on how to chose your skills, not limited by class. So characters have attribiutes that calculate their base stats like vitality, astral points (manna), base attack, dodge and parry. Attriubutes cost a lot of adventure points to raise. By chosing how to spend attribiutes you craft base for your character, if you invest heavy into strength, agility, courage and constitiution you will end up with a fighter with almost no chance to cast any spell. If you go for intuition, cleverness and charisma you will end up with solid base for mage with poor fighting abilities. You can also walk the path of average, but you must be careful and just select few spells and weapons to invest in those heavy. Keep in mind that mages are limited by metalic armor - they will not regenerate astral points while wearing even a single piece of it and will have negative casting modifier, so a melee mage is a hard to play, but possible with correct spell investment. Then are the skills. Skills are divided into weapons, talents (perception, traps etc) and spells. And in that game every weapon is another skills, so if your character is an expert swordsman (18 swordsmanship skill), when he will be forced to use an axe, he will be very poor with ti because he has no skill in axe, he will have very small chance to hit and large to be hit by enemies. Skills make your characters use stuff. Skills are rated from 0-18. Spells and talents unlock bonusses at 8,13,18 levels. Here you choce which spells your character can cast and weapons to use. At the end are special abilities - special attacks for melees, ranged and boosts for mages. The better the special attack the harder it is to hit with it. Original pen and paper game used three 20 side dices for skill tests, to make it computer game, devs changed that into % chance. So unlike dragon age it is not enough to unlock a spell to cast it, you must unlock the spell and invest points into it. (Note on spells) For me spells in this game are net design to be used mainly at blunt offensive magic. Spells play a support role in this game. You can cast offensive spells and they will do a lot of damage, however doing so will deplete your astral points in two shots so after your mage will not be able to do anything else than bash stuff with his staff. (Note on weapons) I really love games which make using axe different than using a sword for example. Blackguards is such a game.Every weapon type has it damage type (piercing for spears and fancing weapons, slashing for swords and blunt for maces). Every weapon type also uses a different skill. So if you wanna use few different weapons you must spend points on different skills. Different weapons also have different special attacks, you cannot make armor ignoring attack with maces, but you can make attack that tripples the damage with them.  (Combat) Having explained the above. Combat is turn based in which your heros and enemies take their turns in order of initiative. On their turn everyone can move a little and make action (attack, cast spell, place trap, disarm trap, spot for traps, use item etc) or move further. You can hide behind objects or other heros to break line of sights of enemy archers to your mages as well, there is no other cover system. Combat map is divided into small hexes for movement and there can be varius hazard spaces on the map like oil set on fire will deal you fire damage when you cross it, while mud can make your character fall down unless he passes bosy control test. (Tactical combat) By using combination on magic and physical attacks you must cripple and defeat enemies. Enemies will usually outnumber you as well and some of them will also cast spells, use healing potions and have special attacks. So this is where tactic comes into place.  Use your melees to block enemies before they reach your mages, or run to enemy mage to bash on him. Use obejects on the map and magic walls to block enemy movement and shoot them directly. You have options. Cast damage spells to finish fight quickly, or same astral points for buffing and healing magic.  (Plot - Story) Unfortunately game story is quite linear and not really involving. Characters are a bit shallow and the only one who really feels realistic is the dwarf who is fun and really combat oriented. At few points in the game you will be stripped of your gear and forced to make through with given equipment untill you can regain your stuff. So it is goot to invest a little into maces(as you will usually end up fighting with a torch or a club) and offensive magic.  (Flaws) There are some flaws to the game: -Horrible mouth work. Unlike other modern games, the speaking animations here are just horrible, you will see heros open mouth like fish trying to catch a breath, it has no connectiong with what is being spoken. -Very bad equipment comparison system. There is no way to compare one set of armor with another other than noting down the stats, changing set and seeing new stats. -I have really no idea what in this game make it be 20gb large. -Game does little to introduce players who are new to the difficult character creating and developemtn system. [there is good help&amp;tips in the menu if you can spend a moment to read and understand it] -Not involving plot and shallow characters. -Not intuitive UI. -No crafting system.  (Merits) +Realistic when it comes to weapons and armors. Armors comes in sets, so it is no longer find best pieces, but you need to wear a complete set of armor to have best benefits. And I like it that way. +Deep and difficult tactical combat. I like the games that are not easy. +Quick cities exploration. +You are not limited when crafting your heros, you have a lot of freedom in systems without classes.  Overall I would give this game 7/10. I hope most of the flaws will be corrected in the upcomming Blackguards 2.",
            "review_score": "1"
        },
        {
            "review_text": "only just got this game but so far love it. Different and the same !!!",
            "review_score": "1"
        },
        {
            "review_text": "Nice adaption of the TBE fighting system. It has been a bit changed and simplyfied, but feels pretty good. Better than in the TBE Drakensang games.  Though I don't like parts of the looks, seems like they don't even really cared about making it look like real TBE stuff that is mostly inspired by real historic armor and weapons instead of D&amp;D fantasy stuff. On this I prefer the Drakensang stuff.  But I wouldn't buy it for full price, because thats way to much, I bought it in the Daedalic bundle on a Steam sale. Wait till it costs about 10 €, I think that would be a fair price.",
            "review_score": "1"
        },
        {
            "review_text": "I have really been enjoying Blackguards. I love turn based combat but most of the other similar games I've found have you manage squads. Here you manage a band of adventures with your main focus on a single party member. The combat is challenging and the graphics are beautiful. Between combat it feels like more like a point and click adventure which is a novel concept I really enjoy. The story isn't particularly complex but feels well told and engaging.  There are a few small bugs in the UI I've come across but nothing that impedes game play. I'm hard pressed to think of any other game like it and I'm looking forward to future DLC's in the series.",
            "review_score": "1"
        },
        {
            "review_text": "I wish there was a middle choice like, 'If it's your cup of tea,' or; 'If it's on sale.' Anyways, I can't openly recommend this game though I will continue playing it and do enjoy aspects of it. It's a start over too many times kind of game. Sometimes the CTH (chance to hit) can frustrate you more than anything else. Because it's played tactical turn style this makes some battles painfully long, and some easy battles unneccsarily hard. I truly had a fight where luck jsut spit on my and I failed every spell, before writing this review actually, and I was killed by two wolves...eh.  It does get better, obviously as I said I will keep playing it. Nice feel, voice acting is ok, story is fine so far though nothing pushing the limits I feel it could move forward readily. I'm interested to see how strong I can make my characters and well I can customize them. Still, I can't recommend it. Why? It falls into a category of games where there are many options for you that are easier to pickup and just as customizable. If you've already played through a plethora of these titles you will then enjoy this as you're out of new stuff to do. But get a coffee, or whatever relaxes you, because it will frustrate you to ****.",
            "review_score": "-1"
        },
        {
            "review_text": "really, really good game! Fantastic Skill system, Good difficulty, story is ok, battle system could be ...faster... but it's ok. This game is really worth it's money!",
            "review_score": "1"
        },
        {
            "review_text": "I am thoroughly enjoying this game. Cool story, strategic gameplay, and nice depth of experience. I think it is possibly a niche game, so try the very generous Demo (~1/5th of the game or Chapter 1 of 5) and see for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "I was not certain whether I will like it or not due to some negative reviews on the board complaining  1. random battle results and  2. the difficulty of the game.   However, it turns out that this is one of the top 5 games I played in 2014 (including Last of Us, Distant Worlds, Dominions 3, and Tomb Raiders). If you like turn based combat in a fantasy world, this is a must. I enjoyed this game far much more than I did for UFO Enemy unknown.   I do not have any experience with the dark eye world so I browsed steam community guides (class guide was most helpful) and some forum posts. Concentration (on certain skills or spells for a character) was advised and it is really important. I tried to max weapon talent, base stat and skill which are matched (refer community guide). Chapter 1 was a bit difficult since the system was new to me but the remaining chapters became more comfortable as I learn combinations of spells and base stats (for example, one of the spells that I specialized requires cleverness and constitution). All the information is well presented in game. Carefully building your character not wasting points here and there is crucial. (Dont be afraid if it sounds complicated. If you play 3-4 hours, every thing becomes clearer).   Certainly, randomness is there but every RPG has that element. So it wasnt a big deal for me.  I am looking forward to Blackguards 2. Congrats Dev for a quality game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a TBS junkie especially adding in RPG and medieval settings. This one is a classic. Yes, there are a few bugs, but what game doesn't have them nowadays?   At $4 now it's a can't miss even if you've never played this genre before. Enjoy the hell out of it.",
            "review_score": "1"
        },
        {
            "review_text": "I've only played about an hour but so far I'm enjoying the turn based action. The voice acting isn't fantastic but I really enjoy the strategy concept of battling by turns. Of course, I haven't even delved into the full meat of the game yet but so far, so good.",
            "review_score": "1"
        },
        {
            "review_text": "I thouroughly enjoyed this game, even if my hopes were low. Great character customization, great battle mechanics, and most importantly this 'just one more battle feeling' made for a wonderful time sink.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that was recommended by my games magazine. Still after reading the reviews here on steam I was not convinced so it ended up on my wish list, I gave it at a try when it was for sale at 75%.  This is a game of tactical rpg combat but for me it gets old very fast, I want more from my rpg:s than only combat. Also since this is combat only they should at least have let you build all characters but no you can only build one, you are stuck with the rest of the team.  The layout is also in my opinion clunky and you can't rotate the map to get a better view, sometimes characters can be hard to see hidden behind objects on the map.  I cannot recommend this game but if you are really in to the tactical combat part of roleplaying games and want a challenge give it a try.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely addictive and fun to play. In addition to that, the combination of western RPG and turn-based battles (featuring a party of heroes as opposed to one hero and an army) is quite unique. I wish there were more games like that!  It does have a few bugs, but they are minor and no showstoppers at all.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this awesome game on the Xbox called Gladius... I've never played a tactical RPG as good as that was before or since. I wished Blackguards could be more but it's a pale shadow of everything. Taking a band of misfits and leading them to be the heroes of the land... squandered. Moral dilemmas? nope. Relentless brain numbing combat, buckets and buckets.",
            "review_score": "-1"
        },
        {
            "review_text": "Definetly worth a shot if your a fan of tactics rpg's or tabletop games 4/5 star",
            "review_score": "1"
        },
        {
            "review_text": "If you can take the time to get into, its a pretty cool game. Only thing that holds it back is the character development, i never feel 100% certian I understand what is affecting my characters. Interface could be a little clearer.",
            "review_score": "1"
        },
        {
            "review_text": "This game is smooth. The tactics envolved keeps the game fresh. The characters fit perfectly into the story telling and the odd quests you find yourself in at time in no way shape or form feel out of place. This game is awesome soo far and I can't get enough. I recommend it if you love tactic RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Simply lovin' it!",
            "review_score": "1"
        },
        {
            "review_text": "For a game stripping down RPGs down to the basics - combat encounters - it sure does a tremendously bad job. The combat UI is clunky as hell. You cannot turn map apparently, so every obstacle on the map is also an annoying obstacle for your mouse and eyes. The game loads a lot and I have no idea why, because the graphics are not anywhere near current single player games standard, but rather low on the MMORPG scale even. Inventory management really sucks a lot, not too mention quirky little fun things like characters using bandages to cure lasting injuries only on themselves - means you cannot reliably heal with a character you build for such stuff. This game is a big disappointment, if you want DSA nostalgia, buy the very old Nordland-Triology, still better and technically more adapt than this here. Certainly not worth the price of a AAA-game, which sadly it features.",
            "review_score": "-1"
        },
        {
            "review_text": "Good storyline - easy to follow but not linear Good variation in missions Nice blend of characters - cool interaction in dialogue Lovely turn-based action with a lot of choices Good music - gives the game a good adventuring wibe Great way to build and level up your party  Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Quite a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "The game was great, the QA for the game was not. Ran into a number of issues that got me stuck because of glitches.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This game is 3.99 right now. If you like turn based combat it's definitely worth a shot. The character progression and how to build your character properly is a bit different from the norm, but half way through the game I was at the point where I was seriously considering restarting just to focus my builds a bit more. Aside from that though, the game can be quite challenging and will take up a good chunk of time, so you will surely get your monies worth.",
            "review_score": "1"
        },
        {
            "review_text": "Everything that can be wrong about this game is wrong.  The mechanics are broken (IE you get 1 parry a turn except for when you dont, that guy who has parried 3 attacks already, well your 100% to hit which you should never even have got because a 20 is a crit fail, he parried it because he also rolled a 20 on his parry roll, 4th parry out of the 1 he has per round), They are also counter intuitive (fairly normal for a D&amp;D clone), And outright stupid (Why do shields give no bonus at all? Why can you only switch your melee skill between offensive and defensive outside of battle, why does changing it make no difference? Why can I get 100%s to hit when 19-20/20 is always a crit fail? etc.), Random to an excessive level (Nothing you do means anything. Your completely non melee focused mage can work better as a tank than your completely tank focused sword and board char. Your spell which does 8-18 dmg (firebolt 2) actually rolls for between 3 and 27, before factoring in resists/weaknesses) On top of that, the AI cheats (They get 100%s to hit fairly regularly, they can parry a seemingly infinite amount of times, they parry your 95%s to hit about 95% of the time, they still maintain accuracy despite having every possible debuff put on them, they get access to things like potions in fights where it is explicitly stated no one has them, they succeed/fail skill checks in a completely disproportionate amount to thier displayed chances of success (etc)), The story is both unoriginal and bland, The world is completely nonsensical, you can walk across what is described as a 'Vast empire' and back in less than a day, Apart from your PC, Naurim and the fat mage, all of the voice actors are phoning it in, especially Neera (or whatever she is called), The game is ugly as all hell, yet still has horrendous loadtimes and FPS drops (I am on a 4GHz 3770, a GTX680, 16 GIGs of DDR3, and a high speed SSD, yet it still drops to below 10 frames per second at times, seemingly randomly), The UI is ♥♥♥♥ (IE every spell has 4 levels, each needs to be put onto your hotbar at a set level). The progression is ♥♥♥♥ (no matter how difficult the fight is, you get 23 or 45 exp),   Probably more, but this game is so painful to play through. I wish my kindly friend hadnt bought the humble bundle for me, as then I would have bought it myself and could have just never played this game, but since someone bought it for me I HAVE to finish it so as to not waste thier money.  Heres hoping it stops being ♥♥♥♥ at some point... Here is hoping it isnt 40 hours in...  *Edit, I didnt quite force myself to 40 hours, close enough though, and I did give up in the end. It never got good. Its entirely possible the story gets good later on (though from comments I have seen it doesnt, BG2 supposedly has a good story if still unoriginal, and it having a good story is always mentioned as a positive comparison to BG 1), but if the gameplay is tantamount to pulling your own teeth out through your ♥♥♥♥, why would you even bother getting that far?",
            "review_score": "-1"
        },
        {
            "review_text": "Not an amazing game but quite interesting to play if you are looking for an all combat tun-Based RPG",
            "review_score": "1"
        },
        {
            "review_text": "Sooooo.......... i spent a few hours in this lv n progressing once i got in a part in the game i find myself having to lose a party member n no way to save them n i spent a good time on what to skill em out i was so mad at how they died with good gear and most of the items needed to have a attck chain and healing skills........so it made me have to run with my head off in fight while i cling to life while i try to fight off a boss -_- makes no sense how there no way to save that person with their story non-finished",
            "review_score": "-1"
        },
        {
            "review_text": "Altough I love RPG games I am really dissapointed in this one. Ok this is rather a strategy game than an RPG, but it even fails at that. There are virtually no strategy options on the battlefield. Attack or cast spell. If you are a fighter you stuck with the first option, and hope for some decent damage. Most damage I did was around 9. Enemies constantly do damage over 10+. And spellcasters fizzle their spells 50% of the time. Combine this with the fact that you can't even cast spell out of combat (eg: no healing). And you get this complicated luck based game, with 0 fun factor.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked turn based strategy, this had decent productions values... somehow didn't find myself getting into it.  Seemed a little bland. Still a worthy effort. Maybe I'll try it again someday.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. XCOM: Enemy Unknown meets Baldur's Gate.  Pro: - Flexible character build - Great story  Con: - Some Steam achievements are broken - To hit % is only that: to hit. After this come some additional defence rolls, which can negate your hit or nullify damage. A lot of people get frustrated after missing a lot of 90% to hit rolls.",
            "review_score": "1"
        },
        {
            "review_text": "Too linear for me. No exploration. I regret this purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is mechanically satisfying, with a fairly advanced hex-based tactical combat and a broad range of tools.  Storywise its a mess. On top of being a fairly flat story filled with shallow characters and bad dialogue the story is a piece of misogynistic crap. Female victimization, female alienation and the male sidekicks being posterboys for hypermasculinity (no exceptions! We have the three stereotypes of Gruff Homicidal Dwarf, the Latin Lover and the Exotic Tribal Warrior).",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game, the graphics and animations are tight, very fluid, the engine behind the battles is great, very roll of the dice feel. The game is hard and challenging but at the same time very relaxing and good for a quiet night of gaming. The only problem i would have with it is that the inventory weight is shared between all the heroes and the fact u cant equip items mid battle, i get why you cant but its still bothersome when i need a certain item and cannot get it, or am thrown into an unknown battle without prep time, otherwise this game is sick. The way you level and gain skills/spells for each character is very neat too! I realy enjoy the story, you feel for the characters and when u get hit hard you cringe and rethink all your stratagies for that fight. This game is fantastic i recommend that everyone try this at least once.",
            "review_score": "1"
        },
        {
            "review_text": "not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "i strongly reccomend this to anyone that likes turn based RPG's... one of the better ones that i've seen in years... love the story line and game play",
            "review_score": "1"
        },
        {
            "review_text": "I've just finished this game!!! That's awesone!!! I really can't find the words: the plot, the atmosphere, the gameplay, the music, the characters. All things are on the highest level!!! After I finished the game I wanted to try to make my own character. The only dissapointent is very often bug, especially in Meghbilla city. I really can recommend this game... even if the man doesn't like turn-based games!  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I too was excited about this game. It had a great intro video, and looked crisp. I have enjoyed rpg's since I tried Might &amp; Magic 7. That game had a pretty long learning curve with no proper introduction and my younger self had no idea of the concept of doing quests for xp. But slowly I got stronger and stronger, and I learned my way trough the game.  Every time I encounter games without tutorials or hints to character building, I think of myself learning to play M&amp;M7, thinking I just need to invest a few hours and things will clear up.  So me and a friend bought Blackguards, and played it both. He is older than me and I got a lot of grief from him, when I complained about the learning curve and difficulty. He said I am from a time when games are easy and I am a spoiled gamer.  That seems to be the issue here. People throw grief at the people not willing to spend 13 replays of a fight. Probably because they did 13 replays and want the rest of us to suffer the same. I play games to have fun, and Blackguards gives me no pleasure.  Am I a spoiled gamer? Maybe I am! Maybe I just dont want to sit and redo the same battle 13 times in a row. That gives me no pleasure! It does trigger a lot of screaming at the computer, cursing and pulling out hair. Maybe I am a spoiled gamer, but I would much rather chop off my arms than play any more than 8 hours of Blackguards.",
            "review_score": "-1"
        },
        {
            "review_text": "If you played the old Fallout series, Divinity and all these round based RPGs and loved them - you will love this game as well. You have a good story and you can literally play for hours without getting bored. Since the game is out since quite a while and it is not that expensive anymore, definitly buy it. For that money you can go watch a movie in the cinema or have endless fun.",
            "review_score": "1"
        },
        {
            "review_text": "I was really excited to play this hoping it'd be XCOM in a fantasy world. While the combat and graphics are similar, this game just lacks a lot of the depth of XCOM. There's almost no point to the skill trees because each character will just use the same attack skills for the whole game, most skills are passives anyway, and the others are so situational it's not worth it. There's really no role-playing choices outside of your character 'build' which is pretty shallow and one decision at the end. The few characters that you get to play with have some personality which is cool but there's too few of them and one of them is taken away almost immediately. The combat is pretty simplified with basic line of sight rules and dice rolls which almost never go in your favor if 60% or less. Also, as a completionist, it was really annoying that some of the quests / achievements are bugged. The only reason I recommend this is if you are like me and itching for a Tactical Turn Based Strategy RPG-lite game this will hold you over but don't expect to get blown away.",
            "review_score": "1"
        },
        {
            "review_text": "If you like spending hours trying to get a game to run, and love the feeling of rage that starts to consume your soul after it still doesn't work, this is a game for you. I recommend buying it at full price, because why not? It will ♥♥♥♥ you off even more, and if you're the type of person that loves it when you're angry, that's exactly what this game will deliver.   11/10, broke my knuckles as well as my record for the amount of holes 1 game made me punch into my walls",
            "review_score": "-1"
        },
        {
            "review_text": "One of best and hardest turn-based games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: *Interesting system mechanics, with a LOT of depth to advancement.  Cons: *Tutorial and Tips are useless. I had been playing for over 2 hours (8+ combat missions) before I got a couple of the tips on how to do basic things. *Horrible camera system. Unable to rotate the camera, forcing you to revert to top down view in many areas just to be able to see the hex map behind objects/allies/enemies. *No resource regeneration out of combat. You can camp to restore Health and Astral points, which isn't bad, but when you hit one of the first major fight areas, you are prevented from camping. You are forced to use town healers to restore HP out of combat, even if you have 2 mages with healing in your party. No Astral Point (mana) regeneration outside of combat, even with talents that grant passive Astral Regen per turn, forcing you to use your very expensive Astral Potions to be able to actually use a mage character. *Treating injuries with bandages has a chance to fail (very high chance) outside of combat, and almost useless to try in combat (6% chance of success at first rank). *You are forced to buy belts to be able to carry many items into combat with you, but you are encumbered in combat by ALL the equipment in your bags, even you quest items and camping resources. *Almost no income, with horribly high priced item. At one point, you are given a large amount of money and told to go to the armorer to get equiped to help defend a town. The armorer has 1 type of armor, 2 sets of it, and you are given enough to buy 1 piece of equipment. Not a set, 1 piece. You have to choose between upgrading a single piece of heavy armor, or to buy Astral and Health potions. *Horrible UI. Almost no explanations as to what means what, or as to how anything is calculated. When comparing armor pieces, it does not compare piece to piece, only how it will change your whole, and armor/encumbrance always shows a penalty, even if it is an upgrade. *Horrible combat encounter design. In many of the fights, all of the mobs will sit back throwing poisoned javelines at you, each of which hits your heavily armored character for 15-30% of his total HP, and also poisons him. Was forced to use the fighter as a tank, both of my mages as pure healers, while slowly grinding down the mobs hp with my archer (arrows cost a lot, and have weight. I overmaxed my encumbrance just from provisions, which you need to camp, and arrows alone). *Buff, healing and utility spells have default fail chance, which until you pick of a very very expensive talent, are almost impossible to cast (22% fail chance to heal an ally, 68% chance to fail to dispel a poison with a spell that only dispels poisons, 48% chance to fail to cast a 'wall' spell, etc). Combined with no innate astral regen, very low astral point pool and high astral point cost to cast makes playing a mage character feel like your being penalized for playing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those games that looks kinda cool on the store page, but you end up with buyers remorse when you realise it is actually pretty dull. With needlessly infuriating RNG, and a combat system that just feels really bland, this is one of those games you may want to buy at at least a 75% discount, if at all.  Oh, the spell effects are fairly pretty though, i guess.",
            "review_score": "-1"
        },
        {
            "review_text": "Not very good. No exploration and nowhere to grind up for extra gold or items. The only side quests are few in between main quests. Hit percentage might as well be non-existant as enemies hit you on anything over 0% and you will miss on 95%.",
            "review_score": "-1"
        },
        {
            "review_text": "Difficult game which is reminiscent of tabletop rpgs. The stats and talents are merciless. Keep some saves close, don't expect to do the whole game without dying a few times. There's quite a few surprises.   I enjoyed it. I can't really find any analogs to this game. It's too rpgesque to be akin to tactical combat, but it's not rpg enough in terms of deciding the fate of your characters to be considered a regular rpg.  Biggest cons: -loading screens -Attack/Miss -Harsh to beginners",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome. Great story line great game play if you like turn-based games!",
            "review_score": "1"
        },
        {
            "review_text": "This is not a bad game, and i'd recommend it.  ...BUT... You will enjoy the game if you like the mechanics of Tabletop RPGs, if you are willing to pay attention to everything on the battleground, and if you like games where you have to think before every move.  You won't enjoy the game if you are looking for a simple rpg.  Or if you don't like complicated skills and traits system.  The game is not perfect, but it's a good game if you like the genre.  The main flaw is the equipment is really weak and almost pointless to change",
            "review_score": "1"
        },
        {
            "review_text": "i cant say anything about this game bcoz its not working LOL . İ BOUGHT AND DOWNLADED AND WHEN İ CLİCK '' NEW GAME '' NOTHİNG HAPPENİNG ! JUST A JOKE !",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good SRPG, decent graphics,gameplay and leveling mechanics in terms of many choices to level up in and really create characters you want for your tactics. Some of the fights, or rather mechanics in the games are kind of broken. You can miss like 10-15 times on a row, even with maxed skills and thus lose fights on it, and other times you might hit and crit on bosses constantly and wipe them extremly fast... A quick examples are bosses that has 40% dodge on any attacks you do. Now imagien that they also poison you, and spawning mobs that are basically impossible to kill. Now, you can lose this fight, like I did 10+ times because you keep missing everytime. And yes, then another time, you might hit basically every swing and boss is down before you know it. Thats not balanced, its just random and in a SRPG based on tactics luck should never play a big part into it. I can understand some luck mechanics for the rpg-elements, but 40% miss on a boss that hit hard back? and he is a tank? Come on...  I would give this game maybe a 7.5 or 8.0 of 10. When this game is at its best its actually really good, but when its at its worst its horrible. Probably need better beta test for the sequal in terms of balancing out battles, be more open about what to level up in, lots of trial and errors if you dont know what your supposed to level up or not. Also, the story and sidequest need to be better... basically as it is now, side-quest are kind of neccessary to finish for that vital AP which you level up in. So its not even a choice to do them or not.  I finished the game in 40 hours on normal difficulty, so this is a pretty lenghty game I guess 35 to 45+ hours. Would I buy the sequal? Probably, yes, especially when its on some kind of a cheap discount, because I love srpg's and wanna support them (Final Fantasy Tactics need a sequal...) - but if the sequal for Blackguards, which is in development at this moment, get good reviews from the critics, I would probably buy it at launch.  As I said this game could be great, it isnt however atm in this state in terms of balancing and storywise.",
            "review_score": "1"
        },
        {
            "review_text": "I want to start off by saying that despite its many apparent flaws there is something that I find deeply compelling about this game. The battle system is pretty good, you have quite a few options during combat and the interactive battlefields add a layer of fun and somewhat fresh gameplay.   My primary gripe with Blackguards is the difficulty. To say that Blackguards is a challenging game is an understatement, but I feel that the way that Blackguards challenges you is a bit contrived and ultimately kind of cheap. I've played difficult games in which I've lost or barely won a battle and have walked away thinking 'wow that was a good fight'. In Black Guards if I lose I usually feel like I've been robbed. You constantly miss spells and attacks and the enemy constantly connects whether you're fighting a semi-♥♥♥♥♥♥♥♥ goblin, a backstabbing rogue or a giant tree. And the dire situations that you are placed in again and again suggest to me that you're not so much a group of badasses so much as you are really gullible and kind of incompetent. The main character feels really generic. Pretty much everyone or everything that you encounter seems better suited for combat than the protaganist. And so far I don't feel like the four playable characters that I have encountered live up to the name Blackguards. They actually seem like relatively nice guys. When I saw the name Blackguards I got excited because I had assumed that I would be taking on the roles of the Lannisters from GOT. Instead it feels more like I've signed on with the Partridge family. I've only played a few hours so far and I'm not giving up on the game entirely just yet, but that's mostly because of the price tag. This is not a 40 dollar game and I would not recommend that anyone pay that much to play this.   I work as a merchant sailor and I am literally stuck on a boat for the next month so I will be playing on. If I get to a point in the gameplay in which I feel that my assesment was premature or unfair I will return to humbly apologize and I sincerely hope that, that happens.",
            "review_score": "-1"
        },
        {
            "review_text": "kinda like a bad balders gate, unreasonably difficult because of the lack of information about WTF is going on, I tried and tried to like this but I just end up yelling at the game for being so unreasonable.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is fun but combat leaves much to be desired. The damage of the characters are never consistant and good items are just too expensive. But overall a pretty awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "I tried, really I did. But after the 7th time it randomly crashed, I gave up. Maybe I'll give it another go if it gets patched again.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried, really I did. But after the 7th time it randomly crashed, I gave up. Maybe I'll give it another go if it gets patched again.",
            "review_score": "-1"
        },
        {
            "review_text": "Wall of text help system. Bad camera positioning ruins combat. Even simple battles take so long making this one really boring game. As for the story.. its Skyrim. 3 out of 10.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice graphics and sounds. A bit boring though.",
            "review_score": "-1"
        },
        {
            "review_text": "Really old linear storyline style play. Only one direction for the story. Really boring old technology. If you pay more than 15 dollars for this game you have overpaid.",
            "review_score": "-1"
        },
        {
            "review_text": "i regret buying the game at 50% off . I enjoyed the first chapter then it got a bit tedious , it seemed a game designed to make sure you had no fun. I love turn based tactical games and i dont think i've ever played one i didnt enjoy before.  character develpoment and advancemet is dreadful , worst of any RPG or CRPG i've ever played , It's so boring and mundane. There's an illusion of freedom but really you just stick to a few skills and spells that are clearly miles better , if you dont you end up with useless underpowered skills and characters.  I think i am still using the same 1 skill with my melee and archer characters 10 hours into the game and the same 2 spells on my casters. There's just not enough variety to the game. In another 10 hours i probably be using the same 2 skills. Thats not enough depth for a tactical game or an RPG.  As an RPG it is without doubt poor but i expected that and assumed the tactical combat would make up for it , it didnt , the combat was worse than i expected and that is the reason i eventually got bored of clicking the same 2 buttons and stopped playing",
            "review_score": "-1"
        },
        {
            "review_text": "Well, there are games you like to play, just games, and not games at all Blackguards is the last one kind for me  Neither Heroes, nor Dragon Age, and nor Diablo/Dungeon Siege/Torchlight Something more closely to mix of Heroes (turn-based) and Assasing Creed/Dishonored/Thief (In logic, mainly - Agh, I should use water arrow here to turn off light and hide in the dark)  All you do in Blackguards is running on the battlefield with only one though - 'Hell, hell, hell! Where is this magic lever that kills all my enemies? Faster, I have only one XP. Agh, already zero' As mentined, first time playing is blind - there is no understanding or planning how to develop character even after tutorial. Due to reason above, character page seems to be useless for the game at all. Playing as mage is awful. You have 2 places on belt, already used these mana potions and out of mana again. What next? Go to close combat (for mage!) or wait for 50 turns to recover your mana. Ridiculous.  So don't even try if you want to relax a bit with your favourite game. This one is not of this kind.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is way too repetitive and slow. I usually like the turn-based games, but this one is simply boring...",
            "review_score": "-1"
        },
        {
            "review_text": "intalled game looked at main menu uninstalled game reinstalled because you need 5 mins playtime to write a reviws uninstalled again 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine looking your children in the eye and having to admit that you were responsible for this mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Highly recommended for fans of turn-based fantasy and role-playing games in general.  Pros: The adventure system is a welcome relief from wandering around huge towns of useless NPCs. It's similar to point-and-click adventures of old. Let's you get to the story and/or combat quickly.  Cool level-up system. Characters really start to feel powerful at later levels.  Attractive graphics and runs smoothly.  Neat battle set-ups. Battles have traps, special objectives, secrets, and ambushes. There are a good number of straight up fights, but the set piece battles really spice things up.  Interesting (but not completely original) story with an compelling (but really not original) cast. It keeps you interested enough to follow along rather than just clicking through the dialogs, and the cut-scenes are simple but well done.  Cons: I strongly recommend starting on 'Easy' difficultly. This really feels like it should be the default and is best for first-time players. The mechanics of the game are a little obscure, and having one play-through under your belt is best. Easy offers a good challenge without being frustrating, and gives you freedom to explore the game.  Again, obscure mechanics and no way to respec makes the game progression rather unforgiving.  Sparse loot. Don't get me wrong, I think it is a nice chance of pace to have magic items actually be rare and not drop 11 times each battle, but it feels like the game is really stingy with the rewards. It does make the few items you get feel more special but, unfortunately, they're not even that much better than the standard ones you can buy.  The characters you get aren't very customizable in their roles. But they do what they do well.   Low replayability. You could replay the game on a harder difficulty, but why? It's a long game and nothing is really randomized. It's not really much of a con though since the game is so long with lots of optional quests.",
            "review_score": "1"
        },
        {
            "review_text": "Play the demo. Unless you hate it the game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I was so lost in wtf I was meant to do in this game",
            "review_score": "-1"
        },
        {
            "review_text": "Really nice game for all people already knowing the fighting system from the rpg. It can be quite hard till you get used to the traps but then you start to enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "In a nut-shell, you'' definetely like Blackguards if you are into turn-based, hex-based linear tactical RPGs. For one, i do! The combat is nicely done and obviously the strong point of the game - it works, and keeps you challenged (at least, up to now). The graphics are nice, but a little too cartoon-ish for my taste (and for the atmosphere the game tries to create). The story is good enough to carry you from chapter to chapter, although it's a little obvious in its twists.  There are obviously a few cons as well: - The biggest minus for me it's the inventory, and the way it works. You don't get a clear comparison between your equipped item and another one, in your pack or at a vendor - this alone makes choosing weapons a nuisance at later stages. The inventory also becomes cluttered extremely easy.  - Also a minus is the auto saving system. The game makes it that, quite a few times, you have to fight battle after battle, without possibility of resting&amp;healing. And the autosave saves as you enter a new battle. This means that, if you don't take extra care, you'll end up (it happened to me once) in a position i hate most in RPGs - making some bad decisions in a 3rd-in-a-row battle, i had no chance of winning the 4th. And the autosave was only for the 4th. So i had to restart not only the 3 battles before, but the whole branch of the chapter (a lot of dialogue and cinematics included) - and i hate remaking choices i already made, listening to the same lines over and over again etc. They should have made an auto save for each battle, and an autosave for entering a chain of events/battles - this way, you can restart the fights without restarting the story itself.  Anyway, all in all, is a nice game (and i bought it during a sale) - so i give it 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! I think Blackguards defines a template for what a perfect RPG should be. The only thing that annoyed me was lack of lighting in many areas. Everything else is just perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Skill progression was awesome with quite a bit of freedom (Its even better on the second game). Story wasnt bad, even though you dont have any real choices to make. Game mechanics pretty straightforward without any bugs (that I could tell). 8/10 would recommend :D",
            "review_score": "1"
        },
        {
            "review_text": "Great tactical RPG. The sequel is better in some ways, but they're both great, so I recommend you start here. There are a few ugly little graphical issues here &amp; there, but they're not common, so it's not a big deal. I love the relatively low-magic fantasy setting &amp; the fact that just casting a spell successfully, not to mention hitting the target, is genuinely difficult at first. The ending is the weakest part, unfortunately. One issue I have before that is the way the game handles damage types. It seems a bit odd &amp; nonsensical to me. For instance, if you get an enchanted mace that does fire damage, (&amp; don't expect to find any such wonders easily,) it does pure fire damage &amp; no physical damage, &amp; this is just one example. Skeletons are completely immune to piercing damage, etc., etc.. Still a good game, though. Battles are pretty difficult at times. A lot of people seem to think this game is too hard, but I disagree. I enjoy the challenge, &amp; I hope you do too.",
            "review_score": "1"
        },
        {
            "review_text": "Blackguards is a very interesting game with complex dynamics of the Dark Eye.  IMHO this game deserves a 8.5/10 and definitely worth hours of gameplay and to some extent re-playability. I found myself planing for hours what spells to get and how to develop some characters.   Pros: - Detailed characters that come to life - Good roles mixture (I played as a mage but my real emphasis was a fighter with usage of the shadow spell) - Detailed scenarios - Fantastic spells and animations. - Hard difficulty requires strategic previous character planning to be able to beat some encounters.  Cons: - No 360 camera support - Sometimes win or lose a battle feels more luck than strategy (Fail all the hits and all the magic, bad luck meaning lose). - Mechanics such as Buy/Sell kind of feels incomplete and Weight system feels off - End of the story is incomplete and leaves you wondering (Blackguards 2 continues this?)  Overall I must say I did really enjoy the game, and the story development might is interesting although not among the most interesting from the Daedalic games or Baldur's gates games storylines.",
            "review_score": "1"
        }
    ]
}