{
    "app_id": 24960,
    "name": "Battlefield: Bad Company™ 2",
    "release_date": "2010-03-02",
    "developer": [
        "DICE"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Multiplayer",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 23093,
    "negative_ratings": 3877,
    "price": 14.99,
    "description": "Battlefield: Bad Company 2™ brings the award-winning Battlefield gameplay to the forefront of PC gaming with best-in-class vehicular combat and unexpected &quot;Battlefield moments.&quot; New vehicles like the ATV and a transport helicopter allow for all-new multiplayer tactics on the Battlefield. With the Frostbite-enabled Destruction 2.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/24960/header.jpg?t=1447352806",
    "minimum_requirements": "OS: Windows XP Processor: Core 2 Duo @ 2.0GHz Memory: 2GB Graphics: 256 MB Video Card (GeForce 7800 GT  / ATI X1900) DirectX®: DirectX 9, 10, and 11 support Hard Drive: 15 GB",
    "recommended_requirements": "OS: Windows Vista or Windows 7 Processor: Intel Core 2 Quad or higher Memory: 2GB Graphics: 512 MB Video Card (GeForce GTX 260/ ATI Radeon 4870) Controller Support: Support for Logitech G15 and G19 keyboard LCDs in multiplayer",
    "reviews": [
        {
            "review_text": "It doesn't require Origin.",
            "review_score": "1"
        },
        {
            "review_text": " Battlefield: Bad Company 2",
            "review_score": "1"
        },
        {
            "review_text": " Feel the battlefield with Battlefield™",
            "review_score": "1"
        },
        {
            "review_text": "Bad Company 2 still the best Battlefield game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Many people are just stupid... you have to click on the 'search' button to get the serverlist loaded.... Those reviews who say 'Multiplayer is dead' just makes me so angry...",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid game. The first thousand hours I played were pretty fun. Same for the second thousand.",
            "review_score": "1"
        },
        {
            "review_text": "You're a gamer, so GAMEplay is the most important factor, visual representation is always second, Your brain and imagination can interpolate graphics into something more real than any next gen graphics. The game play is what keeps you playing, not the textures and eyecandy.   This game had it. It went downhill after bad company 2 was killed by the 'new' battlefields that stole its playerbase, just for the fact that it was the 'new' and everyone wants to try the 'new' but it doesn't always mean it's better.   There are still people playing this, but not in huge numbers which is a shame. It just goes to show that having a saturated market isn't always a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so important to me, I have atleast 1,000 hours on 360 I'm the max level, and this game after joining the PC master race the DLC give me that 'feeling' again.    Certain games just you have a soft spot for in your heart.    This is one of those games, I'm not even going to touch on the fact that The DLC for this game is remarkable. The game is extremely active. You can run around with a M1 Garand and scream ♥♥♥♥ you Kami's and How does that ♥♥♥♥ feel!!? This game gives me a disturbing feeling of war, The large maps, the snipers, the vehicles. Like I said before, this game has a 'feeling' that can't be recreated. It's not a game where you pay for skins or pay for weapons. EA had the right idea when they let the Sweedish DICE make the game. Not forcing DLC and actually making a good game that requires skill and hours of learning. Other Battlefields focus on you as a player, with no prone or TDM this game requires teamwork. Even in 2016 I try and pick up BF3 which I love to death and I'm just not impressed. The graphics and smoothness of the game really is the best out there and all of the thousands that still play understand this. I feel as a player I can jump right in alone and have fun, even though it requires more team than anything. 6 years later it still has some of the best mechanics I have seen in a Multiplayer game. Ever. This is by FAR the most legimate down to earth game, with a action packed campaign to the loaded lobbies of active multiplayer years later. Plus this game is on Flash sale this summer with the game and DLC adding up to around $7.30    You're crazy not to pick this up. Go nab on your moms leg for those Steam wallet funds!",
            "review_score": "1"
        },
        {
            "review_text": "After Quake and Unreal Tournament 2004 my most fav FPS  Verry active community Many servers (they are hostet by the community, not EA) Many players that dont know how to use search Many players using dx11 to play a dx9 game Easy to learn hard to master the game isnt only sold on steam, there also cd version and origin version and we all meet on the same servers  if u get black screen flickering and lag, change settings.ini to dx9 (mydocuments-&gt;BFBC2) if u only have lag, Alt+Enter twice to change fast windowed mode and back to fullscreen will solve it Sign ur vietnam dlc code in the vietnam game not the main game (in main menue on the left where it say vietnam)",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield I've played.",
            "review_score": "1"
        },
        {
            "review_text": "campaign 10/10, after many years multi still alive 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best battlefied games ever mad.",
            "review_score": "1"
        },
        {
            "review_text": "Randomly throw a grenade at the wall infront of me and killed someone sneaking behind me  10/10 -ign",
            "review_score": "1"
        },
        {
            "review_text": "Is and always will be one of the best battlefields out there ",
            "review_score": "1"
        },
        {
            "review_text": "This game is hours of fun if you have friends to play it with or just on your own. It did especially after the first Bad Company.   Lot of the servers have been shut down, though there are still plenty around with a lot of interesting plugins or just straight vanilla if you look well enough, make sure to use the server browser function!",
            "review_score": "1"
        },
        {
            "review_text": "Best rush maps there are",
            "review_score": "1"
        },
        {
            "review_text": " TL;DR at bottom   If you enjoyed this review,consider giving it a thumbs up!    8/10",
            "review_score": "1"
        },
        {
            "review_text": "Old game but still kicking.",
            "review_score": "1"
        },
        {
            "review_text": "DICE CEO: 'What is it that you people really liked about Bad Company?'  *Doesn't read any of the clear and concise Steam reviews*  Some things I didn't immediately find in the reviews:  -Controls handle incredibly smooth. -Everything sounds loud and big and real  And some personal opinions -More unique maps in comparison to newer titles (a lot less cities) -Better gunplay -I can actually see clearly 100ft in-game and tell you if that guy way over there is friendly or not -Better class setup (Assault class having a rifle and ammo boxes, while medic with LMG and other medic things) -'Battlefield moments' not requiring you to jump out of a jet and doing some crazy bs with an RPG and killing the entire enemy team",
            "review_score": "1"
        },
        {
            "review_text": "I've at least dabbled in all the Battlefield games from Battlefield 2 upwards, but I have to say that this is the best one for a fair number of reasons. To find out why follow me... I'll be reporting from inside the fight! (Races off towards distant towering explosions erupting over the war-shattered horizon, stubs toe, cries.)  If you're after single player Bad Company 2 brings some fairly smart level design with a sharp, fairly witty script that approaches like a Shane Black movie. It's not screen-writing brilliance or anything, but it has a far greater sense of fun and playfulness than its increasingly tedious sequels and the latter Call of Duty games. No dark and gritty moping about here, purporting to show the 'horrors' of war whilst quivering with lust over the latest sniper scope attachment, nope. Just four Bro-Force men (or rather three and a mandatory smart-aleck quipping Shane Black staple) taking down the bad guys like out of some Kelly's Heroes meets Commando movie. So yeah, not genius, but fun. Battlefield 3's snooze-inducing 'arty' debriefing scenes framework nearly made me break my nose on the computer desk, so lethargic they made me. I cannot really recall Battlefield 4's at all. Plus the game is a lot less linear than subsequent outings, where you get to use the completely destructible scenery to its fullest advantage to forge new paths in completing a level.  ('The stretched twig of peace is at melting point...')   Graphics! Well, they're very nice. Sure, Battlefield 3 &amp; 4 have slightly shinier, more detailed graphics with slightly more convincing character animations and lens flare coo-worthy prettiness. But really, these graphics more than do the job. Dust clouds from descending helicopters, litter blowing in the streets, shockwaves rippling, shrapnel flying through the air... it's all here. And it won't tax your modern day computer too much neither. And there isn't too much going on to distract from the gunplay and everything runs smooth, so you won't be visually overwhelmed whilst trying to pick off the bad guys so much.  And this game has the joint best audio of any game ever. The co-achiever of this award goes to The Long Dark, and its tremendously atmospheric sparse soundtrack and wonderful environmental sound. But Bad Company 2 has something magical called 'The War Tapes', activate it and feel like 1990's CNN war correspondent Peter Arnett fired by the NEWS CANNON of an Abraham Tank into the SOUNDS OF A WAR MIXED BY THE DERANGED PHIL SPECTOR HIMSELF. Ahem. Basically it's just a rather fantastic mix of panicky crackling intercom messages, wonderful bass-rumbling cannon fire and the sound of bullets zipping past your ears. You need headphones to really do it justice.   ('...people here are very much bursting with war...')  So, you all know the basics of how it plays, no doubt. But how's the multiplayer? Well, it's the best in the series. This is beautifully balanced shooter created before kill-streak bonuses and landfill-stuffing +0.2% shotgun-accuracy unlocks smothered fun like a big statty-based tidal wave of squinty misery. There's four classes performing the roles of assault, medic, anti-tank and recon sniper. The recon sniper is the smartest tweak of the set, as the game encourages snipers to move closer to the action with such toys as C4 and movement sensors. The game gives them fun close quarter pistols and ways to support the team from the front lines. You can also snipe too, and have fun doing it, but you can no longer prone. This encourages movement, and forces snipers to quit camping and instead rove the buildings of a battlefield, picking off hapless players and then fleeing the area as enraged victims bring the upper floors crashing down upon their noggin.   Yes, crashing floors. Practically all the buildings in Bad Company 2 can be blown apart piece by piece until the entire edifice comes a-tumbling down in a avalance of masonry-mayhem. It makes for great tactical play too. Using a grenade launcher to create a new entrance point never gets old, especially if Johnny-Foe is caught on the other side of the impromptu door opening. Yup, by the end of the battle few structures remain unscathed.   ('...this very much is a country about to blow up in it's own face.'   The maps are very good, with shout-outs going to Panama Canal, Arica Harbour and Oasis as to my mind the best three. I also have a fondness for the atmospheric snowy levels. The only maps I don't like are Harvest Day and Heavy Metal, which are vehicle dominated. I find it very hard to get a good footing on either of them, and the lack of cover makes trying to get around an abject misery. Not much room for tactical play either. Predictably, they seem to be the most popular on the servers. Gngh and argh.  What else? Well, it all seems a bit more fluid and smoother than the latter Battlefields. Wiser and more knowledgable heads might nod knowingly and mutter the words, 'netcode', or something, but I've got no real idea why. All I know is it feels more fun to me. And I guess that's the important thing. SO. If you're itching to buy a military-themed multiplayer shooter with lots of vehicles and explosions and scenes unfolding like the best bits of Apocalypse Now, then get this one. It's pretty much the only one you'll need and is far less depressing than the 'mature' ponderous tosh forced on us nowadays.   In Summary:   COMPLETELY BANG! BAD COMPANY 2 IS SO ENTHUSIASTICALLY WAR IT'S BRINGING YOU ANOTHER TEAR ON THE FACE OF THE WORLD'S MOTHER. 9 / 10  P.S: Apologies for the excess of The Day Today references.",
            "review_score": "1"
        },
        {
            "review_text": "────────────────────────▄▀▄  ─────────────────────────█─█  ─────────────────────────█─█  ─────────────────────────█─█  ─────────────────────────█─█  ─────────────────────────█─█  ─────────────────────────█─▀█▀█▄  ─────────────────────────█──█──█  ─────────────────────────█▄▄█──▀█  ────────────────────────▄█──▄█▄─▀█  ────────────────────────█─▄█─█─█─█  ────────────────────────█──█─█─█─█  ────────────────────────█──█─█─█─█  ────▄█▄──▄█▄────────────█──▀▀█─█─█  ──▄█████████────────────▀█───█─█▄▀  ─▄███████████────────────██──▀▀─█  ▄█████████████────────────█─────█  ██████████───▀▀█▄─────────▀█────█  ████████───▀▀▀──█──────────█────█  ██████───────██─▀█─────────█────█  ████──▄──────────▀█────────█────█ Look son ███──█──────▀▀█───▀█───────█────█ a good Game ███─▀─██──────█────▀█──────█────█  ███─────────────────▀█─────█────█  ███──────────────────█─────█────█  ███─────────────▄▀───█─────█────█  ████─────────▄▄██────█▄────█────█  ████────────██████────█────█────█  █████────█──███████▀──█───▄█▄▄▄▄█  ██▀▀██────▀─██▄──▄█───█───█─────█  ██▄──────────██████───█───█─────█  ─██▄────────────▄▄────█───█─────█  ─███████─────────────▄█───█─────█  ──██████─────────────█───█▀─────█  ──▄███████▄─────────▄█──█▀──────█  ─▄█─────▄▀▀▀█───────█───█───────█  ▄█────────█──█────▄███▀▀▀▀──────█  █──▄▀▀────────█──▄▀──█──────────█  █────█─────────█─────█──────────█  █────────▀█────█─────█─────────██  █───────────────█──▄█▀─────────█  █──────────██───█▀▀▀───────────█  █───────────────█──────────────█  █▄─────────────██──────────────█  ─█▄────────────█───────────────█  ──██▄────────▄███▀▀▀▀▀▄────────█  ─█▀─▀█▄────────▀█──────▀▄──────█  ─█────▀▀▀▀▄─────█────────▀─────█  ─█─────────▀▄──▀───────────",
            "review_score": "1"
        },
        {
            "review_text": "I have close to 300 hrs play time on file, and I stopped playhing this game some time ago. This was one of my favorite FPS of all time. great memories playing the game and playing clan matches as well. Well rounded game, with great features, weapons, maps and more. A +",
            "review_score": "1"
        },
        {
            "review_text": "More reality than CS:GO Less ♥♥♥♥ blijat",
            "review_score": "1"
        },
        {
            "review_text": "The Only game which contains Bonds with EA and Steam. May the best Platform wins. Althought the game itself is Very Very Good. Thats why it is  RECOMMENDED ",
            "review_score": "1"
        },
        {
            "review_text": "aim for orange triangles",
            "review_score": "1"
        },
        {
            "review_text": "Favorite game, hands down",
            "review_score": "1"
        },
        {
            "review_text": "The best Battlefield. The map design is excellent; it prioritizes fun engagements above all else. Maps are largely built around prefab, destructible, 2-3 floor buildings, which buffer the flow of combat and compartmentalize individual encounters. This means that you can actually breathe and make meaningful decisions in between all of the twitch-based watch-every-corner assaults. You know that segment in every battlefield scene where two soldiers duck behind cover and banter, using the moment of calm to rest and survey their surroundings before leaping back out guns blazing? This game is all about that moment. Front lines move back and forth in a perceivable way, you can get caught in epic holdouts with your squad, and buildings take a LOT of damage before they collapse, with each blown-out wall potentially changing your tactics. And despite how dynamic things get, you never burn out. Because you can breathe.  Oh, and there are NO JETS, which means that A) Infantry can meaningfully engage every vehicle, B) no player has to dedicate themself exclusively to countering air units, C) air units are easy to keep track of, and D) air combat remains cover-based and low-flying. The whole 'battlefield' experience is much more tightly woven together as a result.",
            "review_score": "1"
        },
        {
            "review_text": "I joined a server through the browser, threw down some healing packs, and instantly got lvl 50 again.  All of this was happening helicopters were flying out of the sky  A fantastic game still",
            "review_score": "1"
        },
        {
            "review_text": "I joined a server through the browser, threw down some healing packs, and instantly got lvl 50 again.  All of this was happening helicopters were flying out of the sky  A fantastic game still",
            "review_score": "1"
        },
        {
            "review_text": "  Best game i ever played btw is better than cod",
            "review_score": "1"
        },
        {
            "review_text": "Back in my days EA launch theyre games in Steam",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best multiplayer fps of all time",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt, the best Battlefield game made by EA yet. Game play is simple and it's a very easy game to play Graphics are awesome And its awesome, what more can I say?",
            "review_score": "1"
        },
        {
            "review_text": "So... I have written very few reviews on Steam and am not the greatest at them, but here goes.    Battlefield Bad Company Two: I myself have been playing Battlefield since 1942. I own a copy of every battlefield there is. I own physical copies of Battlefied 1942, Vietnam and Modern WArfare (Not the greatest of the series but the first to hit concoles) I also own a copy of Battlefield 3 on Origin ( 4 was a complete joke due to EA forcing Dice to rush the production in under a year, thus I speak not of it).  Battlefield Bad Company 2 comes with a high reccomendation from myself as a veteran of the series. Coupled with graphics that have aged extremely well over the past 6 years, solid gameplay and amazing destruction for its time. This game offers an experience no other Battlefield has yet to do. With a sound engine that supports 7.1 Surround, graphics that look and still feel real, and large maps with balanced classes and vehicles. This game is still to date my favourite of the series.   Now for the sad part... Battlefield Bad Company 2 is slowly dieing out. Servers are become ghost towns as players are drawn to the c**p that EA forces its development teams to pump out. I beg this of thee, please purchase this game, come experience it with me, bring back the life that was one so bright, join us in keeping this game aloft in our quest for giant and beyond fun battles. Show EA that a great game does not come from its amount of DLC. But from the love of a lasting community that is will to pay for a single product, and continue to play it even decades after its release. Help us keep this game going, come join us... The Battlefield awaits you.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best competitive FPS games I have ever played, if not the best. Trumps BF3, and hey BF3 isn't on Steam, you have to install that disgusting programs origin (I refuse to install it on my PC) to get is anyway.  10/10- Honestly the balance is perfect, the graphics are amazing, the optimization is good, and it is a hell of a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "WE WANT BAD COMPANY 3 VIETNAM !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter... period",
            "review_score": "1"
        },
        {
            "review_text": "People still playing both BFBC2 and Vietnam DLC. Worth buying and playing.",
            "review_score": "1"
        },
        {
            "review_text": "Barally have touched this PC version since I just got it but I've logged many hours and enjoyed the hell outta this game on PS3.",
            "review_score": "1"
        },
        {
            "review_text": "nice memes, talks about liberal hippies 10/10",
            "review_score": "1"
        },
        {
            "review_text": "With Battlefield 4 already out, Bad Company 2 is really only worth playing for the single-player. But it's a witty, twisting campaign that stands with the best of the military shooter crowd.  SCORE: 8.75/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a real piece of work, not necessarily in a bad way though.   The Singleplayer experience is okay, its got a pretty decent story spanning ww2 and modern day war scenarios, even has you crash a satellite and recover its black box.  It's version of the Battlefield Frostbite engine allows for completly destroying buildings with c4, instead of the more modern one seen in battlefield 3 and even battlefield 4 where only bits and pieces of buildings can be destroyed(not counting the specific scripted events in battlefield 4 where you can demolish a skyscraper or blow up a dam).  It's Multiplayer aspect is a bit lacking, there is no proning, there is a very bad latency problem which only seems to clear up if you run this game with a medium to top tier computer and wookies (ghillie suit snipers) dominate most maps.  Its business model is a bit bad, as it has 2 DLC, one adds a new map and weapons and thats fine, but the other unlocks all the top tier weapons for each class, or rather provides you with exact replicas.  Note that the weapons which are unlocked are top tier but aren't necessarily the best weapons in the game.  Overall even though this game like all games has its flaws and some are worse than others, it's still worth looking into and playing with friends.  Personally find the 'have your friend take the uav and put a ♥♥♥♥ton of c4 on it and slam it into the  M-COM' to be quite enjoyable.  As this is as always a personal opinion i'd give this game a 7/10, its a pretty decent game without game breaking bugs worth referencing, just slight inconviniences.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, arguably the best in the Battlefield Franchise and miles ahead of the current installement. 4.99$ right now on sale, well worth the buy for the campaign alone. Best destruction of the Battlefield games arguably as well. I played this years ago on console when it first came out and poured days into it, re-visiting it is a lot of fun and still has very active servers.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS REALLY NICE...",
            "review_score": "1"
        },
        {
            "review_text": "The game is fine, but EA screwed me over with the serial key to play online and their solution for people with this issue is to buy it again off of origin.... No thanks EA",
            "review_score": "1"
        },
        {
            "review_text": "This might be the best game of all the fps games (other than csgo tho) i mean ive never enjoyed a game like battlefield this much it is actually pretty hard tho",
            "review_score": "1"
        },
        {
            "review_text": "- Loved the campaign. - Awesome multiplayer. - Variaty of weapons to choose. - Plenty of servers   Great game. ",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield Bad Company 2 is the best battlefield. Betting out the piece of crap called BF4. With its great graphics and low loading times, it made all the other battlefields go in the back room and cry. BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best Battlefield",
            "review_score": "1"
        },
        {
            "review_text": "10/10, but the multiplayer servers arent populars :(",
            "review_score": "1"
        },
        {
            "review_text": "Good fun still holds up can reccomend it, definitely worth picking up when on sale, still active",
            "review_score": "1"
        },
        {
            "review_text": "An epic modern warfare game.",
            "review_score": "1"
        },
        {
            "review_text": "This has been said many times on the review of this game and I agree fully. This is the best Battlefield game ever made by dice. And its quite sad to see them fall from the top with there other 2 sad sad games. This game nailed it. Graphics are still great. Game play. NO BUGS, Game play is great. Cheats? Well its not Counter-Strike so no real hackers or far few from the popular games.  Dice do us a HUGE favor, Please dont ♥♥♥♥♥ up the new Battlefront Star Wars game, and give up Battlefield Bad Company 3. That is all we ask. We say please with sugar on top. Now just do those 2 things for us.",
            "review_score": "1"
        },
        {
            "review_text": "I felt obligated to write a review for this game since people were buying it during the summer sale. Some people are complaining that there are no servers but that is untrue. There are plenty of servers and a lot of players. All you have to do to find servers is go to multiplayer after signing it and pressing search on the right side of the menu. Over all this is one of the best battlefield games and I remember the characters and their comedy characteristics from the BFBC2 campaign where as I couldn't tell you anything about the BF4 campaign I just played.",
            "review_score": "1"
        },
        {
            "review_text": "The last good Battlefield, everything after this one just went straight downhill.",
            "review_score": "1"
        },
        {
            "review_text": "Everything in this game is great, the multiplayer couldn't get any better. Superb game.",
            "review_score": "1"
        },
        {
            "review_text": "Old but Gold !",
            "review_score": "1"
        },
        {
            "review_text": "What does this game has to offer  -Huge maps with beautiful sceneries -Loads of weapons and customization -Massive variety of vehicles from helicopters to tanks and boats -Still massive playerbase with active servers  AND the best part is, it comes without origin, battlelog and premium.   This is the definition of Battlefield.",
            "review_score": "1"
        },
        {
            "review_text": "The game is freaking awesome, graphic's are 11/10, gameplay is 20/10, just you should get teh game and see it by yourself!",
            "review_score": "1"
        },
        {
            "review_text": "So far the last realy GOOD Battlefield. Anything after BC2 has been 'Meh..' And the fact that it's the last game to not require Origin makes it the last game worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "This might be the best game of all the fps games (other than csgo tho) i mean ive never enjoyed a game like battlefield this much it is actually pretty hard tho",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter I ever played",
            "review_score": "1"
        },
        {
            "review_text": "Still a great game   I've finally tried all the others 3, 4, HardLine and StarWars   BC2 still feels like the best version    It just feels right, the gameplay is rock solid, maps just the right size, vehicles useful but not over powered, every player on the server can feel significant   I'm done with rest i'm gonna keep playing BC2 till BC3 comes out",
            "review_score": "1"
        },
        {
            "review_text": "SUPER GAME!!! Best game ever! Super graphics, no lag!",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter I ever played",
            "review_score": "1"
        },
        {
            "review_text": "SUPER GAME!!! Best game ever! Super graphics, no lag!",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun. Multiplayers amazing! Totally worth 10-20$",
            "review_score": "1"
        },
        {
            "review_text": "You're missing out on the best online shooter so far :)",
            "review_score": "1"
        },
        {
            "review_text": "Freaking AWESOME GAME , Beats BF3 and BF4 hands down. Problem is it uses gamespy (or early release did) , but it did have a proper server browser and PROPER destruction , you could destory walls and every building. I really wished BF3 and BF4 could match the run action FUN of this game, not without its issues , which I can assure you is WAY LESS THEN BF4. 5 bucks , why not, cant go wrong. Cant remeber if its got coop , but honestly we got this game for MP not SP/COOP.......",
            "review_score": "1"
        },
        {
            "review_text": "Not bad shooter. I can't say that is game is really nice but it's not bad too.  I was playing only in mp. I can't say anything about single.",
            "review_score": "1"
        },
        {
            "review_text": "     Battlefield: Bad Company™ 2",
            "review_score": "1"
        },
        {
            "review_text": "'The Last Battlefield' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "OBJECTIVES? NO IDEA WHAT YOU'RE TALKING ABOUT",
            "review_score": "1"
        },
        {
            "review_text": "Totally Great except for the starting multiplayer its hard to gut up quick but when u do its freaking amazing. landing your helecopters on windmils nuff said ",
            "review_score": "1"
        },
        {
            "review_text": "My favorite battlefield game, probably due to the fact that you can pretty much completely destory every building on a map and take out objectives by dropping the buildings on them. Also I don't know why people are complaining about not being able to find populated servers, my friend I just played online recently and we had no problem finding a match with people in it.",
            "review_score": "1"
        },
        {
            "review_text": "GoodGoodGood, nothing wrong, but a great game! It made the Bad Company Sequal on fire, I would wish to see Bad Company 3!!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I feel that it is the best Battlefield out of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Much better than Battlefield 3 and especially Battlefield 4. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I never liked the Battlefield series but this one is very fun. It's an older game but give they you more features than the newer Battlefield games don't have. Being able to blow up buildings until nothing is left is a great experiance. I don't care too much for modern shooters but this one is actually quiet decent. It has multiple game modes that are all very fun and balanced classes. This game does have a handful of guns which you earn through different classes that unlock through points. They have a Vietnam DLC that I highly recommend buying it's very fun and vintage feeling. There aren't so many maps or guns but the DLC is very fun if your into the whole WW2 aspect. As for servers the modern side has hundreds of servers and most of them are full. On the other hand the WW2 is a different story there are dozens of servers but only two or three are being used. There are High-XP servers you can join if your looking to speed through the game otherwise most are normal.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play the best Battlefield game, you've come to the right place. Let's just get to it:  PROS:  It's Steam, not Origin Fun single-player campaign Fun and balanced Multiplayer  CONS  None  ",
            "review_score": "1"
        },
        {
            "review_text": "Killed seven teammates by blowing up a house when they were all inside.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best multiplayer experiences out there, and at such a small price. Totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game before, bought this game again on steam. Best game ever",
            "review_score": "1"
        },
        {
            "review_text": "The BEST Battlefield in my opinion, especially if coupled with the Vietnam expansion.  The community is still active which is a huge plus for a game so far back in the series. Tons of unlockable weapons. Memorable single player.",
            "review_score": "1"
        },
        {
            "review_text": "Unload half an LMG clip into someone, and you'll be killed with a single shotgun shell from 30 meters away. Run into a field, and you'll get shot by a sniper. Spawn, blown up by an Apache. Spawn again, sniped by someone behind your base. Join the wrong team, and they'll all be snipers and hide in the bushes while the other team caps everything with ease. Try sniping on the attacking team, hide in a bush, get sniped from across the map by someone spamming Q until the red marker shows up above your head. Fly a helicopter, you'll get blown up with rockets before you even leave the ground. Drive a tank, and you'll get C4'd within the minute. Ride in the passenger of a tank, and your driver will drive over a mine. Blow someone to smithereens with an RPG, and their friend will defibrilate them before shooting you down. Run into cover while being shot at, only to have the lag catch up and kill you while you're in a safe spot. 60+fps at all times, but never have a ping below 250.  And that's just on a good day. A regular day, in Battlefield. If you can look past all that and play with a large group of close friends that won't trash talk you after killing you with a tank, then it's a very enjoyable multiplayer game.",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS out there.",
            "review_score": "1"
        },
        {
            "review_text": "Got to be one of my Best Battlefield Games I have played! Love every aspect of this game :D",
            "review_score": "1"
        },
        {
            "review_text": "Absoultley amazing game even after all these years, recently rebought the game because i lost my disk. This will also give you a feel for what battlefield 1 may be like",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥z",
            "review_score": "1"
        },
        {
            "review_text": "No Origin Required. 10/10  PROS. -Does not require use of the EA Origin game launcher -The last Battlefield where I can actually remember the characters from the story -Looks very good and runs very well on Frostbite game engine -Very fun and destructive multiplayer (Blowing things up, knocking down buildings, vehicle combat, etc.) -Smooth gunplay -Mod support -People in this game actually work together compared to more recent Battlefield titles -Well-written storyline, with the returning characters from the original Bad Company -Very intense unscripted multiplayer battles with some epic destruction mechanics  CONS. -Uses way too outdated (in my opinion) Punkbuster anticheat, which is also somewhat buggy sometimes and can get you randomly kicked from multiplayer games for no reason. VAC would be much nicer. -When playing it for the first time, expect some FPS drops for some reason, as this happens to many people when first launching the game -Missing some essential elements from video/interface settings (such as FOV slider, HUD customization, etc.)",
            "review_score": "1"
        },
        {
            "review_text": "Bought a laptop that can only just play BF4 at 30fps on low. Redownloaded BC2 and rememberd why battlefield is so much fun. Great graphics, most buildings destructible, still very active player base.",
            "review_score": "1"
        },
        {
            "review_text": "Game of my childhood - no Origin - no cancer browser Battlelog - actual ingame main menu unlike bf4 - fun gameplay - cheap  10/10 would buy for 10€ ",
            "review_score": "1"
        },
        {
            "review_text": "Campaign is alright, gameplay is fun. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A realistic shooter with high quality graphics and game play. The single player story line is okay but only lasts about 6 too 8 hours the first time through. Multiplayer is where this game really shines with huge battles consisting of over 30 players you can blow the crap out of each other in four different game modes on a slurry of maps. Hardly anyone uses a mic so don't expect much co-operation from your team-mates though unless you're part of a clan or guild. I've logged far more hours on this game then any other and paid the full price of 60 dollars when it came out, completely worth it. Since then I've bought five additional copies ranging in price from 6.80 to 60.00 dollars for friends and family. It now retails for about 20.00 dollars and is completely worth it. Battlefield 3 will be coming out soon though so keep that in mind (if it's not already that is).",
            "review_score": "1"
        },
        {
            "review_text": "good game, i looked at the world and i went i like this! i like this alot",
            "review_score": "1"
        },
        {
            "review_text": "Back when times were simpler...i really hope this gets more popular as time goes or Dice makes Bad Company 3",
            "review_score": "1"
        },
        {
            "review_text": "best of all the battlefeild games",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! The Destruction, the squads, everything. One of the best parts about this game is that one map one time can be compleatly different the next time you play it due to the destruction. This is a great game but my only complaint is punkbuster. The issue with punkbuster is it kicking me for loosing packets via the 9005/9003 error. This error makes the game a pain and i have to fix it almost every time i want to play.  For those of you that have this error a way that i have found to fix it is by setting the priority of punkbuster to high in the task manager but punkbuster b changes back automatically if your not careful so you kinda have to watch it and it takes a few tries. If this doesnt work i uninstall and re-install punkbuster and re-attempt to play with the priority still on high.  Over all this is a fabulous game in which i would highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Reliving the good old times with Battlefield Bad Company 2 has never been better. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best of the whole Battlefield series. Apart from a little bit outdated graphics and smaller maps could easily beat BF3/BF4 in meanings of gameplay. You don't need Origin to play it!  8 HE teamkills out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Returning to this BC2 every now and then even after 6 years.  For me the definite version of battlefield infantry combat, with great maps and excellent class balance. The battlefield franchise didn't have destructive environments until the Bad Company series, and BC2 still has some of the best, totally destructible environments.  Top notch audio and visuals that in my opinion have kept up surprisingly well over the 6 past years.  FUN and INTERESTING single-player campaign, arguably the best still of all Battlefield SP experiences.  AMAZING, FUN and ADDICTIVE multi-player with great maps, iconic weapons and a compact progression system for each class.  Don't know why I haven't written a review for BC2 before, at less than 10€ (currently 2,49€) this classic is an absolute bargain.  BUY IT AND ENJOY, I BEG OF YOU!",
            "review_score": "1"
        },
        {
            "review_text": "Great FPS game, much more tactical and more focused on team play. The maps are large and a game of rush could last 30+ mins.  The vehicles are great to fly and master, which include choppers and tanks, aswell as transports. Lots of upgrades and tactical loadout choices. Snipers a pleasure to play.  Still very active online, which is what this game is about.",
            "review_score": "1"
        },
        {
            "review_text": "The game seems ok but why in the lords naame cant I connect to any servers?HELLP ME PLZ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games Ive ever played. To make this amazing game more fun buy the dlc.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Just reliving old xbox 360 memories.  Too bad there are not that many Vietnam servers.",
            "review_score": "1"
        },
        {
            "review_text": "GoodGoodGood, nothing wrong, but a great game! It made the Bad Company Sequal on fire, I would wish to see Bad Company 3!!",
            "review_score": "1"
        },
        {
            "review_text": "Because it's always fun to blow ♥♥♥♥ up.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best battlefields you can play next to BF2 and 2142.   The campaign is pretty good and the multiplayer is amazing.   Multiplayer is pretty well balanced and plays out smoothly. Lots of people still play with dozens if not more full servers all day and everyday. The game runs pretty decent even on a crap PC, and the ping is alright on the majority of servers. I recommend playing this with a friend(s) on MP so it's 10x better.   The MP has tons of stuff like attack (and transport) helis, tanks, cars, jetskis, ATV's you name it, it's there. Game also lacks hackers even for it being 4 years old, rarely see hackers ever.   For 20 dollars this game is definitely worth it, and buying it will certainly bring in a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "The best FPS game in that era.",
            "review_score": "1"
        },
        {
            "review_text": "I have played Battlefield 3 and 4, but somehow i keep coming back to BC2. BC2 marks a transition point in the Battlefield series where Team game-play and non-over the top action are precisely intertwined to give breath taking experience. Also the other transition is this was the last Battlefield game to be distributed on Steam, and the service has been great. Don't want to bot down Origin, its great as well when it works and integrates well with web browsers but still not as robust as steam ",
            "review_score": "1"
        },
        {
            "review_text": "Man this is awsome!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I feel that it is the best Battlefield out of the series.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. I like battlefield 2 because there are a lot of blood and guns. Its good anger release tool to supress my IRL fury. Without I may kill lol.",
            "review_score": "1"
        },
        {
            "review_text": "Compared to the BF games that came after BFBC2: 10/10 - works.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best first person shooting game i ever played in my life. ( i am talking about multiplayer, i never play campaign in shooting games)",
            "review_score": "1"
        },
        {
            "review_text": "still a good game for its age",
            "review_score": "1"
        },
        {
            "review_text": "I can't hate it, It's a Battlefield, a very good Battlefield. This game is so good!",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game that isn't gonna take up a whole lot of room? To save all the hapless text that bores the stuff out of you, yes, I DO recommend this game if you're interested in an FPS game. I'm not gonna say this game is flawless in every conceivable angle, because obviously this is not the case. From my experiences of playing this, I should point out a few things that you should know going in:  1: This is a game that plays by its own twisted sense of reality. This is a rule you can pretty much apply to every game ever. While Battlefield: Bad Company 2 acts generally like any old FPS game, there are many things that seem to more or less break the fourth wall. For example, the spotting system has flaws with which you can see the enemy behind cover for a few seconds in the form of a red triangle above their head. This can lead to exploits involving players getting shot just as they leap from cover if not outright getting killed through smoke, garage doors, or rubble. Also worth mentioning is that many weapons function awkwardly from a more common-sense means of use which may seem suspicious. For example, the bolt-action rifles have uncanny hipfire accuracy that is almost reliable. That's not to say there isn't an extreme, though, if someone has 'overdosed on Ritalin.'  2: This is a TEAM game. It is highly important you keep this in mind, because I've been through countless matches where my teammates/enemies do little more than camp in the deployment zones without playing the objective and snipe, attempting vainfully to pad their K/D. K/D is only half the battle in this game. It's good to balance trying to get kills/assists, playing the objective, and scoring points by helping your teammates do the same. The four classes each have their own support gadget (Ammo Boxes, Medkits, Repair Tools, and Motion Sensors) - use them wherever it is most advantageous. While you can get an ace pin going 0/98 by playing total support (*cough* medic *cough*), someone on your team still has to bear the burden.   3: This game is nearly, if not, five years old right now at the time I originally typed this. As a result of EA and DICE having released  Battlefield 3  Battlefield 4, the game feels less populated than it once was, which is a damn shame. The game released after BC2 is billed as a sequel to the 2005 original Battlefield 2, but it just feels like a watered down BC2 in retrospect. I wanted to like the game, but it just didn't feel the same, and I kept looking back to Bad Company 2 because EA and DICE just seemed to... get it more on the mark, in my opinion at least. True, it does have quite a few flaws, and some rigs may not be totally optimized for the game even if they are technically able to run the game itself, but it has a charm, and I guess I have a soft spot for this game myself. Maybe that's just my ability to adjust to its crap factor, though. I dunno.  If there ever is a sequel to Bad Company 2, I'd be interested to at least look at it. But I'd be praying it's not gonna look like   Battlefield 3 OR   Battlefield 4. BC2's own sequel should look like the other Bad Company games; maybe touch up the graphics a little if they feel they should, but besides the point. It should also play like those games as well; maybe nerf a few weapons or snap that bolt hipfire anomaly. That is just my opinion, though, and obviously I have to see it for myself to believe it can hold true. But the route EA DICE went   after releasing Battlefield 3   makes me doubt if they could make a game that is nearly as good anymore.  That being said, I like this game. Will you find enjoyment in this game, too? Probably. Probably not. Obviously it depends on your taste or if you even like FPS games at all. But check it out when you see a sale pop up sometime.  EDIT: Don't get me wrong. BF4 is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun you'll have with a Battlefield game",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore Rush = Hardcore rage, buy this game now.",
            "review_score": "1"
        },
        {
            "review_text": "Unbalanced and inconsistent. To start off, I'm not great at shooters but I enjoy them for the competiton. This game though, the multiplayer makes me upset. Most servers advertise 'No spawn camping' and 'Don't use X weapon if team size less than Y'. Sure it may sound good but when you spend a total of 3.5 seconds alive and the remainder waiting to respawn, you tend to get salty. Another thing that I don't like, but I understand why it's in place, is limits of how many of each class be in a match. It makes it really unfair when the defenders can camp buildings all as snipers but attackers aren't allowed to have any snipers at all! It feels like everyones weapon is stronger than yours when it takes a clip an a half of consistent hits to kill them but they just need 2. The cover system is aesthetic considering most covers can be shot through and the ones that can't can either be destroyed or are too short to actually serve as cover. The only populated servers are repatative. You gain better equipment as you rank up, so higher ranking players will be more accurate, deal and take more damage and have, overall, a better chance at being sucessful.  Overall, this game can be fun, provided you get into a good server and the other players are a somewhat similar rank to you and you learn every nook of each map. If you like shooters for campers and dying, you'll like this. If you like shooters for gameplay that's based mostly on skill, maybe not so much.",
            "review_score": "1"
        },
        {
            "review_text": "BEST. GAME. EVER. Have it on PS3 and PC. My boyfriend and I has it, too, and we play online together. Our computers are next to each other, so we can talk to each other about what we're doing in the game without head sets! No other game compares, this is the most engaging, never gets boring, easy and fun to play game we have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Having only ever played the SP before (which is short,but good),I had to pick this up whilst it was on special for $6 AUD when I found out the MP was still alive (why didn't I know this sooner?). Grab it whilst it's dirt cheap,and let's keep this thriving,at the very least until BF 1 Oceania.",
            "review_score": "1"
        },
        {
            "review_text": "'Russian simulator.' 11/10  (+)Pros: -This game can running on low/med-spec PC, recommended for you that doesn't have a high spec PC! -FUN. -Russian!. -This game is not Pay2Win game, well you need a high level to get some ♥♥♥♥ing stuff. -and once again RUSSIAN!  (-)Cons: -I think this game doesn't have some balancing for level. So if you new at the multiplayer, sometimes your enemy level is high. So I think that's imbalance. (this is just my opinion, I don't know. Maybe there's a server that can do balancing)  AND WHAT IS THE BEST THING AT THIS GAME? IT DOESN'T REQUIRE ORIGIN! so ♥♥♥♥ you all Origin fans-//stabbed  OVERALL NICE GAME!",
            "review_score": "1"
        },
        {
            "review_text": "This is really amazing game which have really amaing: -singleplayer -multiplayer -even after 6 years it still have very active multiplayer -it's and EA game which doesn't require Origin (which means you can play singleplayer while offline) Some problems: -PunkBuster has a really bad service and if you get some problems with it, it could take a while to fix them But otherwise this is my 2nd best battlefield game i have played (battlefield 2 was just too good) and really remond it to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting. Very squad-based, and very fun. Be careful if you have a poor rig, though.",
            "review_score": "1"
        },
        {
            "review_text": "Very excellantly crafted game. The simplicity and small class oriented style makes for a fun multiplayer. The Campaign was awesome, and in my opinion does not need an explanation as to why. The sheer plot and style of execution speaks for itself. Going back to the multiplayer, if you look at games like Battlefield 3 &amp; 4 the sheer amount of customization is new compared to Bad Company 2, but at the same time Bad Company 2 provides for a simipler but still fun [competitive] experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I was going to write a jokeful review because I ended up refunding this game, but I might as well give a real one because why not.   In my opinion, the graphics in this game is on par with the newest titles in the series. The buildings look great, the trees and landscapes look amazing, and the water looks real. The gun flashes are perfect and the physics are perfect aside from a few execptions.  Audio wise, and again in my opinion, this game is the best in the series and based on the 'progression' shown by the devs in BF3 and BF4, this game may have the best audio for many titles to come. I don't really know how to describe why it's so great, it just sounds more realistic to me.  As for how active the game is at this date, there were a few active servers, most of them having people in a que to get in. I didn't check for the core servers, but what I said is true for the hardcore servers. The reason I refunded this game is in this area. I researched this game a lot online before buying it, and it seemed like there weren't too many hackers in the game. Maybe I just had bad luck but I came across quite a few in the first hour of playing. I decided not to test my luck any further since the cut off for the refund is 2 hours of play time.   I definetly reccommend this game to anyone who loves Battlefield, especially those who don't have the greatest computers, as it is not very strenuous to run this game. This is by far my favorite in the series, but I just dont want to have to deal with the hackers in this game when for the same price I can get BF4.",
            "review_score": "1"
        },
        {
            "review_text": "best game i ever bought ",
            "review_score": "1"
        },
        {
            "review_text": "It's battlefield, need I say more? Best FPS genre in the world. If you haven't played it, then what are you doing reading this?!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game that has withstood the test of time. I always defer to this game over pretty much any other shooter currently out there.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield... What else I can say, it speaks for itself. There are still many servers online and they are crowded with people. Fun to play, no disappointment.",
            "review_score": "1"
        },
        {
            "review_text": "I am bad at this game, so it must be good",
            "review_score": "1"
        },
        {
            "review_text": "I already had a copy of BFBC2 on my Origin account where I played 200-some hours of multiplayer. Because I never did the campaign (and didn't want to reinstall Origin), I bought a copy for my Steam account for only $5. After playing Battlefield 3 for about 100 hours, I can say that BFBC2 is the best in the Battlefield franchise. The best part is that around 1.3k people still play this daily (according to Steam).",
            "review_score": "1"
        },
        {
            "review_text": "This is a awesome game which incorporates team values and teamwork into the gameplay. If you don't have a good team and they don't know how to back each other up then don't plan on winning alot of games. Its a great game with awesome special effects. The downfall to the game is that it has a swearing problem and drops the F- Word alot. If that kind of stuff doesn't bother you, then you might find it kind of humorous to play with other American teammates in game. The achievements in game are fun to get and sometimes a real challenge. The secret to ranking up fast is getting stars for weapons. To get stars fast you can find a pistol only server or just play each weapon till you get a gold star for each. Its a great game and a hard game to put down when starting. If you are wondering weather or not to get this game then don't hesitate and just get it because its a really must have for any war loving First Person Shooter Fan!",
            "review_score": "1"
        },
        {
            "review_text": "It's like any other battlefield game except this one is one of the best in the whole series.",
            "review_score": "1"
        },
        {
            "review_text": "well...finish download it...rush to multiplayer mode xD  it's just awesome can see explotions,building destroys,tank also ..so yeah 100/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best made multiplayer shooters ever created.",
            "review_score": "1"
        },
        {
            "review_text": "Fan of multiplayer first person shooters? It would be the greatest tragedy since the burning of the Library of Alexandria if you didn't play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is possibly the best Battlefield in the series. Don't be fooled by my hours, I played this a ton on 360 back in the day. Full matches are still joinable even in late 2016 and still just as fun as I remember.",
            "review_score": "1"
        },
        {
            "review_text": "Okay lets be serious here...  I love Battlefield, and when I saw this game on sale, I had to get it.  The Story is amazing and the mulitplayer still works but I have a problem with the multiplayer, It says I need have something installed for it to work. if you could please comment telling me how to fix this that would be great!   10/10 Flawless - IGN  ",
            "review_score": "1"
        },
        {
            "review_text": "A must have !",
            "review_score": "1"
        },
        {
            "review_text": "In Battlefield Bad Company 2 ... rocket launchers act like a sniper rifles ... 10/10 would Carl Gustav again",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield game, Its worth the full price and the game gets better with Vietnam. Also has no origin and has a in-game menu 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Best Multiplayer FPS stands test of time.",
            "review_score": "1"
        },
        {
            "review_text": "I have almost 3,000 hours in this game! Nuff said! :)",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite FPS games. Others I like would be Battlefield 3 (BF4 also looks really good but have not played it), Battlefield 1942, Counter Strike: GO, and maybe a couple of COD games...not the newest ones. I don't play FPS games as much as I used to, but when I do, I generally play this one.   I have played the single player, I do not remember it that well because it was ages ago but it wasn't anything special. The multiplayer is where I really enjoy the game. Very fun multiplayer, I typically play as a sniper which is a lot of fun. A pretty solid shooter in my opinion. Still has a pretty good sized player base, and it's quite a bit cheaper now.",
            "review_score": "1"
        },
        {
            "review_text": "Its good but all the online servers are dead. I wonder why?",
            "review_score": "1"
        },
        {
            "review_text": "overall its a good game but one thing i lag a bit ingame and it takes so much memory but still a good game for people who want to try battlefield on steam",
            "review_score": "1"
        },
        {
            "review_text": "I'm most impressed by this FPS, EA definetly got the shooter genre right with this game. The sounds, weapons and enviroments are all very realistically modelled. The Single player campaign is among one of the best i've ever played and the multiplayer combat excells. The Vietnam expansion is a must buy DLC experience as well. A true pinnacle in the first person shooter genre and worlds better than either Battlefield 3 or 4 and I'd say even better than 2 because of the realism. Beats the ♥♥♥♥ out of any modern warfare Call of Duty ever made. Every class in multiplayer is balanced and so are the weapons. The atmosphere is just spot-on with the radio chatter in the background when the game loads up makes everything come together. A top notch shooter experience. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Loved the story, loved the graphics , done the main line in all difficulties and unlocked every single thing, i thought i was done with this game when i noticed that there was multiplayer, and that got me in , the multiplayer is amazing, you don't need to buy weapons and abilities, you play to unlock them",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥. This game brings back a lot of good memories. )':",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game that has been published by EA so far. it gives a strong story with characters that you'll actually create a significant bond with, but enough with story blabber.   gameplay wise the game gets as close as I've ever felt to being an actuall soldier. this game straight out takes a number two on BF4. in BF 3-4 you can destroy some houses or buildings, oh how scary. in bad company 2 you can completely destroy small villages, only leaving the metall frames of the bouldings as a reminder that HOLY ♥♥♥♥ YOU DESTROYED A 4 LEVEL BUILDING! THAT WAS SO PRO.   I rate this a 9/10. it would be a 10/10 if not DX9 was default and you had to go file digging to change it to 10. and please do that. the graphics really can't be stopped in this one.",
            "review_score": "1"
        },
        {
            "review_text": "Best in the series. Good albeit too short a single player campaign and excellent multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "even now its still very fun",
            "review_score": "1"
        },
        {
            "review_text": "easy to learn, hard to master",
            "review_score": "1"
        },
        {
            "review_text": "Only play one game during 2010/10",
            "review_score": "1"
        },
        {
            "review_text": "dont buy if you wanna play multiplayer, the servers are down",
            "review_score": "1"
        },
        {
            "review_text": "YEAH BOIII!! BEST GAEM EVUR.",
            "review_score": "1"
        },
        {
            "review_text": "Great FPS game, much more tactical and more focused on team play. The maps are large and a game of rush could last 30+ mins.  The vehicles are great to fly and master, which include choppers and tanks, aswell as transports. Lots of upgrades and tactical loadout choices. Snipers a pleasure to play.  Still very active online, which is what this game is about.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice worth boys",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Campaign is standard 'bad people are trying to conquer the world' fare, but some funny quips and fairly good gameplay make it an enjoyable experience overall. I'd give campaign a 7/10. However, you should not buy this just game for the singleplayer.  Multiplayer is where BFBC2 really shines. I used to play on console (hence low playtime). I was delighted to see that there are still a few servers running. The upgrade system is very straightforward and the difference between guns is actually noticeable. Ranks go from 1 to 50, but it takes a good amount of time to progress through them. Vehicles are also cool and mostly balanced. The map design is very good and each plays differently, aside from a few recycled assets. Some things I don't like are a few overpowered upgrades only available to high ranking players (Magnum Ammo and Vehicle Alternate Warhead, specifically). Also, games are almost always won/lost by a landslide. In addition to this, there is no mechanism to prevent base camping. Some games your team literally cannot move from spawn. I'd give multiplayer a 9/10.  Bottom line: If you like multiplayer and can put up with some annoying tactics, this game is great. However, if you're a singleplayer person, you probably should not buy.",
            "review_score": "1"
        },
        {
            "review_text": "6 years later this game still fresh as ♥♥♥♥, lot of players on server, graphic are nice, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Russia America",
            "review_score": "1"
        },
        {
            "review_text": "Bad Company 2 provides a decent hold-over until the eagerly awaited Battlefield 3. Taking the Battlefield 2 approach, but scaling it down to smaller, more linear maps with a heavy emphasis on target destruction. While hit detection is much better, it still lacks the open-ness of it's predecessors.  It's 'more of the same' but with the heavy influence from the console-only release and while not bad, it doesn't absolutely delight like Battleifeld 2 did. This is a fair game to grab to hold you over till the release of Battlefield 3.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game!!  So fun to play, great graphics but low specs.  Get it!!  TACTICS ARE EVERYTHING!! GREAT COMMUNITY, SO FUN!!!",
            "review_score": "1"
        },
        {
            "review_text": "Russia America",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Battlefield game in my opinion. The Single campaign is amazing, but little hard. The graphics are really good too, thanks to the Frostbite engine. I strongly recomend buying this. You wont sorry. ",
            "review_score": "1"
        },
        {
            "review_text": "battlefield is and always be my favorite war game ",
            "review_score": "1"
        },
        {
            "review_text": "Best BF game I've played :)",
            "review_score": "1"
        },
        {
            "review_text": "Still worth every penny. However, the field of view on this game is incredibly low. Consequently, I am struggling to play the game as it is like looking into a zoomed-in camera all the time. I couldn't find any in-game setting for this issue, so I reverted to tweaking the option manually. Unfortunately, this never seemed to work.   The very low FOV may not be an issue to most people, however it can make me feel slightly ill and it makes it more difficult to play the game.",
            "review_score": "1"
        },
        {
            "review_text": "Its alright",
            "review_score": "1"
        },
        {
            "review_text": "+Destroyable enviroments +Responsible controls both on foot and on vehicles +Impresive visuals +Great humor that makes every character unique and memorable +Multiplayer that has set fundament for Battlefield series and is still played by a lot of poeple after 6 years of its release +Big variety of weapons  -Short singleplayer campaign (4-5hrs) -Sometimes there is too much dust/snow or other particles that make things hard to see -Occasional freezes and bugs.",
            "review_score": "1"
        },
        {
            "review_text": "'TELINI STORZINA' 'SPAGHEEETIIIII'  'BLYAAAA'",
            "review_score": "1"
        },
        {
            "review_text": "The last good battlefield and it dosent require Origin   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, with amazing DLC, and very active community.",
            "review_score": "1"
        },
        {
            "review_text": "6 years later this game still fresh as ♥♥♥♥, lot of players on server, graphic are nice, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Best battlefield so far... There are still lots of people playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Paid 2,49€ for this game and its DEFINETELY worth that!  ♥♥♥♥ ton fun and runs on potato PC's",
            "review_score": "1"
        },
        {
            "review_text": "I had sell my old origin account with BFBC2 before many years ago counting many hours in this fantastic game with gold star in many weapons. Found it in sales for 2.50euros bought it without second thought... this f king game is awesome, this f king game is the best Battlefield by far. If you are a fun of BF series this is a must!!",
            "review_score": "1"
        },
        {
            "review_text": "ive always wanted this game and now i finally have it but i got something i didnt expect. what i got was when i played on the campagin and on the multiplayer was ablack screen and i couldnt see anything so i need some help on that",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, i've always been a fan of Battlefield, the multiplayer is still very alive.  and of course, the singleplayer is awesome as always, I would recommend this, greatly :3",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Amaxing gameplay better than bf3 and bf4 gun sounds are realistic i will just say i dont like it i love it",
            "review_score": "1"
        },
        {
            "review_text": "tha Best BF ever.",
            "review_score": "1"
        },
        {
            "review_text": "Ew, hardline, Im sticking to this",
            "review_score": "1"
        },
        {
            "review_text": "One hand holds the gun, the other hand holds the fire.",
            "review_score": "1"
        },
        {
            "review_text": "Very strange campaign, kinda unfinished and beta version Bugs. BC campaign was better. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game I play this one Xbox360 also it is great!",
            "review_score": "1"
        },
        {
            "review_text": "Remember when Battlefield series was good, not CoD-esque and not dependant on Day 1 DLCs?  Pepperidge Farm remembers...",
            "review_score": "1"
        },
        {
            "review_text": "it is for battlefield what cod 4 is for cod nuff said this game is a blast to play 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Battlefields i've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "this game has changed my life. i used to always think that call of duty was the best first person shooter out ther. and then i played this. and i was right",
            "review_score": "1"
        },
        {
            "review_text": "Very brief mention - this is a REVIEW. I hope people get the common ♥♥♥♥ing sense to write REVIEWS on these pages instead of little stories or cooking recipes. It and anybody who does that are completely pathetic.  Now, moving on...  I was a veteran of this game on the Xbox 360 - when I say veteran, I mean I recognize the sounds of each gun being shot from afar, even the suppressed weapons. I got lots of enjoyment out of it, and I couldn't help but 'upgrade' to the PC version. I upgraded for several reasons:  1) I felt that more people played the PC version, since that's the target console of the series. 2) I was sure that the graphics would be improved on the PC. 3) I would be able to browse servers instead of just doing a mandatory quick match on the 360.  Within about half an hour I got all three of those points addressed.  1) There are FAR more people on the PC version as opposed to the Xbox 360. There aren't tons of full servers, but there are still a rather stunning number of people with taste in terms of Battlefield games. 2) The graphics. Holy CRAP. 60 fps without tweaking a single setting. Overwhelming lighting effects. Much larger and more detailed levels. 3) Server browsing is just as useful as I suspected it would be. There is a glitch, however, where when you start up the game and go under server browsing, there's an empty list - don't fret; the fix is to simply press 'Search', and they all load in.  Now, in terms of gameplay; it's perfectly balanced and hectic gameplay that rewards players of all playstyles, both infantry and vehicular. It stays basic without falling to the crap that Battlefield 3 and Battlefield 4 brought to the table; there's none of that 'lengthy reload on an empty magazine' BS; there's no suppression; you don't wake up from a nap after getting revived, only to get shot again; there's no vehicle healing or crippling; no crazy weapon attachments...  None of that crap is present here. If you want more of that, don't buy this game.  The singleplayer took a shot to the head in comparison to its predecessor (an Xbox 360/PS3 exclusive; I wish it were on the PC, too :,C), in the regard to how boring it was, and how fast you'll shoot through it. There's a video on YouTube (it should still be up) of somebody beating the campaign in just slightly over THREE HOURS. Enemies die in one or two shots, which renders all challenge moot, everything is scripted and hideously linear, and there's little to no point playing it. The four main characters just become dreadfully unlikable in the campaign; again, in stark opposition to the first game. With the sole exception of Battlefield: Bad Company (1), all BF games' strengths are in their multiplayer.  So do I recommend this game? YES. ABSOLUTELY. It was phenomonal on the Xbox 360, and it's equally as nice on the PC. It has better ease-of-access when it comes to finding matches, better graphics, and is just completely mindblowing.  And, of course, it has a massive Vietnam War expansion/conversion...",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield of all time.A really good game.I recommend highly. :)",
            "review_score": "1"
        },
        {
            "review_text": "I was about to give this a cold thumbs down due to it 'having no more players.'    BUT I DIDN'T.    BECAUSE THERE IS ONE SOLUTION TO ALL OF THIS    ARE      YOU      READY?    Just click the reset button, if that doesn't work, click the search button and then press reset. ezpz",
            "review_score": "1"
        },
        {
            "review_text": "Just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game and it plays well but not many people are playing online when i was browsing severs only 4 came up and only 2 other people were playing and apperintly multiplayer kicks you if your ping is over a certain amount. still a very good game though.",
            "review_score": "1"
        },
        {
            "review_text": "If you buy this game for the single player GO FOR IT. The single player is amazing and immersive.   If you are buying this for the muliplayer. Go outside and play your great grandmother for free, becasue the muliplayer is dead.  ",
            "review_score": "1"
        },
        {
            "review_text": "  The game is not dead, people. The community is still active, but only european servers now. I'm south east asian and playing with 300-400 ping is fine for me as long as it's playable and yes it is. Nothing to worry about.",
            "review_score": "1"
        },
        {
            "review_text": "Lets get back into this!!!!!!!!!!!!!!!!!!!!! Best multiplayer ever :D",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game!",
            "review_score": "1"
        },
        {
            "review_text": "Bad Company 2 has provided many hours of entertainment with fun viceral carnage, dedicated servers as well as great sound. This game looks great and sounds amazing. This game has the BEST sound I have ever heard in a game. It is simply stunning. If you have a 5.1 sound system and like FPS you owe it to yourself to pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best mp shooter.",
            "review_score": "1"
        },
        {
            "review_text": "Bad Company 2 has provided many hours of entertainment with fun viceral carnage, dedicated servers as well as great sound. This game looks great and sounds amazing. This game has the BEST sound I have ever heard in a game. It is simply stunning. If you have a 5.1 sound system and like FPS you owe it to yourself to pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "The single player campain was pretty meh but i can tell that the online is alot of fun after playing it for a few hours but im too addicted to csgo to get into it.  8/10 (Great)",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun Battlefield games",
            "review_score": "1"
        },
        {
            "review_text": "Still better than battlefield 3 and 4",
            "review_score": "1"
        },
        {
            "review_text": "Great mix between arson and squadwork. ",
            "review_score": "1"
        },
        {
            "review_text": "I don't even have the game and I can write a review lolol",
            "review_score": "1"
        },
        {
            "review_text": "A Great Game, Simply Put",
            "review_score": "1"
        },
        {
            "review_text": "I have played the entire Battlefield series so far, and although I have only played a few of those on Steam. I feel I can still say that the Bad Company games are some of, if not the best battlefield has to offer. Overall I think my favorite is the first Bad Company game, Though the second is still up there in my favorite battlefields of all time. Not only do the Bad Company games bring the Battlefield gameplay and combat all fans know. In my opinion they provide some of the most compelling storys in the battlefield games. I just feel I could relate to the character more, and the darn sure are more memorable then all the others!    I recommend playing the Bad Company games, it really does not matter where, whether you go for the Xbox or Steam, or even Origin. Anywhere you can play the games is good enough (within reason). If you find yourself wanting a battlefield game, and have not played the Bad Company games, I think you definitely need to try them.",
            "review_score": "1"
        },
        {
            "review_text": "There are servers, but you have to press the search button in the server browser. No idea why. Great game otherwise, straight outta my childhood  Edit: Changed the review once I found a fix for the bug.",
            "review_score": "1"
        },
        {
            "review_text": "nice game but i miss the jets :) &gt; BFplay4free&lt;",
            "review_score": "1"
        },
        {
            "review_text": "war never changes  or does it  war has changed.",
            "review_score": "1"
        },
        {
            "review_text": "Hell yeah!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good game but it's a lot better if your girlfriend lets you spit on her while you play it.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best!",
            "review_score": "1"
        },
        {
            "review_text": "is it me or is everyone seeing just one server wtf",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Beautiful multiplayer.  Doesn't lag on old computers.  Cons: Limited Servers Not a lot of players Storyline isn't very good.  Rating: 7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game twice: several years ago on xbox360 and today on steam. Still a lot of fun after 3 years. Better than BF3&amp;BF4 IMHO.",
            "review_score": "1"
        },
        {
            "review_text": "The best Battlefield ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game !!!  Cheap as hell and the comunity is still live ! TONS of servers  10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Kinda old game but people are still playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Best battlefield game since BF2, love the ♥♥♥♥ outta it",
            "review_score": "1"
        },
        {
            "review_text": "First time I joined a game , I get in the mid-air , flying like nothing then get hit by a truck. Respawned and get hit by a motorbike in an empty room.  12/10",
            "review_score": "1"
        },
        {
            "review_text": "beast game. ",
            "review_score": "1"
        },
        {
            "review_text": "just buy it...  easy to run   servers still full of people   pure fun",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "The battlefield game named after EA",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite game in the Battlefield series, and an improvement to the original Bad Company. The game's Frostbite engine allows you to destroy building walls, which changes first-person shooter game-play in such interesting ways. In Bad Company 2, less is more when it comes to guns. There is a basic arsenal, with some gadgets. The more defined character classes seem to lead to more strategic game-play and teamwork. The character design is goofy, but this adds to the game and turned out to be somewhat iconic of the Bad Company spin-offs. The 'War Tapes' audio opinion makes for great over-the-top gun fire and explosions. The maps on Bad Company 2 are some of the best (if not the best) in the series. The maps are more tailored for rush or conquest mode and were geographically diverse. There is a very fast turnover time between rounds and a simple load-out customization screen. The Singleplayer campaign is actually worth playing, just to listen to crap that comes out of Haggard's mouth.",
            "review_score": "1"
        },
        {
            "review_text": "[Update at bottom] Just picked this up (again) for the amazing, and current (as of today 3/5/13), sale price of near nil (under $5) along with the Bad Company 2 Vietnam expansion for under $4. The two games cost about $9 right now!! Not only is the game dynamite but the price cant be beat right now. Just go get it. This is DICE at their best. If you have never played Bad Company 2 (or its been a while) you have to pick it up. It helps give me faith that DICE will eventually get BF4 up to this quality level.  9.9/10 - the .1 deduction comes from DICE's menu layouts and poor mouse sensitivity settings. RE: mouse sensitivity there is virtually no difference between .30 and .50 (default). My settings for BF4 are .30 (or 30%) with my mouse at 900 DPI and if I set it to .5 the difference is worlds apart. Here it isnt but the default setting is playable.  **Windows 8.1** had a couple scenes so far in the campaign that did glitch slightly but did not disturb gameplay. In the opening chapter (WW2) while running through the sub-base the screen went black but snapped right back. And then in an earlier scene the game went into winowed mode, skipped slightly, and then went right back to full screen.  [Update 7/2016] - Do not play this during the Summer sales or when its on sale at all. People tend to buy this game when its cheap and they ruin the whole atmosphere. Constant uncap rapes and no admins are on these servers (game is just too old to care). In addition you get the spawn hacks and modded damage profiles from these non-serious players. So it really becomes a terrible experience during sales. During the Summer sale there was only one day where I had a few matches that were decent. Even tonight, the pre-teens who were only allowed $10 by their parents for their Steam account are still playing this. They will get it out of their system in a few days.    Game balance is totally shot. Most people use their extremely high ping intentionally to their advantage  Im about to change my review to a big thumsb down. One of the best game sin history has been overrun by 12yr old trolls. Its a shame because you'll think its as bad as Battlefield 4 when its really not. Some servers will kick you for a high ping. Played with a friend in Germany today and server kicked me. Thats fine. I didnt realize my ping was that high and I hate when people are in a good game using it to their advantage. Ive been in 4-5 games today. Each one was a team of insanely high ping players with the rest of us, with normal pings, on the toher team. They were invincible. Point blank unloading clips into their faces doesnt even produce a hit marker on them. When server balanced the teams the next round they all left, rejoined, and got onto the same team. So whats the point? If I cant escape that then there is no reason to play the game or even recommend it. If I change my reccomendation it really wont be because of the game itself. It will be because the environment has been ruined. I almost wish a really good co-op and multiplayer shooter was $500. Because then it would keep out the losers, cheaters, hacks, and trolls. They eventually infiltrate every game. And they ruin it. They ruined Rising Storm RO2. They ruined this. I wish they would just buy a pen is pump so they could feel better about themselves instead of ruining everyone else's good time.",
            "review_score": "1"
        },
        {
            "review_text": "420/420 ",
            "review_score": "1"
        },
        {
            "review_text": "I prayed to loord chin chin that this game still had people on multiplayer... I was wrong",
            "review_score": "1"
        },
        {
            "review_text": "i played the ♥♥♥♥ out of this on my PS3, thought i could hop backin with the same skill 5 years later... nope. still enjoy the game, still active servers.  Best battlefield IMHO.",
            "review_score": "1"
        },
        {
            "review_text": "check this ♥♥♥♥ out yo!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun when you start unlocking new weapons, otherwise, pretty difficult to get kills in multiplayer games",
            "review_score": "1"
        },
        {
            "review_text": "help me igot problem please fix it",
            "review_score": "1"
        },
        {
            "review_text": "The best BF for destruction. You can reduce the levels to rubble!",
            "review_score": "1"
        },
        {
            "review_text": "Im not a BF fan but i like this game :D",
            "review_score": "1"
        },
        {
            "review_text": "there needs to be something that brings back players, the servers are pretty dead. I've played with three different people. it vwas a 2v1, then a 1v1, then just me. getting objectives. woohoo. PLEASE COME BACK",
            "review_score": "1"
        },
        {
            "review_text": "It's fun but it's kinda hard to find good servers, 7/10",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING GAME!!!!!!!!!!!! but for some reson im geting kicked from online saying PunkBuster? What the Fu*k?????????",
            "review_score": "1"
        },
        {
            "review_text": "By far my favorite Battlefield game, and quite possibly favorite action shooter ever. Both SP and MP are amazing, with over the top fun and pretty awesome gun and the best destruction of any BF game. Still plenty of servers and players up and going. Honestly this game never gets old and probably never will. This will forever have my favorite fun in a game. (SAW M249).",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Why the hell are you even reading the reviews?!Just buy the f*cking game,it's the best battlefield there is today,with the best DLC ever.",
            "review_score": "1"
        },
        {
            "review_text": "bought it on sale, fun SP campaign. as one would expect from an old game no real Online players anymore ( im sure you could find some diehards somewhere still playing) but my OP is to NOT buy the dlcs, since they are only MP add ons  if its on sale for $10 or less buy for the SP play..  no bugs or crashes",
            "review_score": "1"
        },
        {
            "review_text": "ALL THESE",
            "review_score": "1"
        },
        {
            "review_text": "I just wondered why I didn't owned this before. This is one of the most funniest and exciting online experiences I've ever got in a long while. 11/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Place C4 on ATV &gt;Drive toward a Armored Car &gt;Bail out from ATV, Trigger C4 &gt;Get 4 kill  'Best. Weapon. Ever.' 'ATV = Anti Tank Vehicle'~10/10",
            "review_score": "1"
        },
        {
            "review_text": "For those of you who are buying BF BC 2 for its Multiplayer. I bring bad news. The Multiplayer is nearly empty it is absolutely impossible to get into a server and when you do. There are very few players online 1-3 It gets very boring, However the Single player is still something to try out, it is fast fluid and fun my final Verdict 9/11 No good multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent game to be honest. It has a good singleplayer and an awesome multiplayer. Really realistic, the sounds are incredible although im experiencing some graphical issues as alot of people. Everything is great about the game, although its not perfect. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "It's Battlefield. If you like Battlefield (and aren't one of those idiots that thinks photorealistic graphics are the only thing that matters in a game) then here you go. I haven't played the single player campaign, but the multiplayer is about what you'd expect from Battlefield.",
            "review_score": "1"
        },
        {
            "review_text": "This game is getting pretty old, but it is still to this day, the best damn Battlefield game I have ever played, BF3 was pretty good too, and BF4 kinda sucked, but this one definetely tops off my list of Battlefield games, for multiple reasons. One; because this game has a great singleplayer unlike the other BF campaigns, this game has a unique likeable cast of main characters, and your character is actually somewhat likeable as well but not as much as the AI characters you play with in the campaign. They all have a different and unique personalitys, and it really spices up the gameplay for me. Along with the fantastic singleplayer mode, the multiplayer is probably the smoothest gameplay from any online FPS that I know of, and I've played quite a few First Person Shooters in my time on this Earth, it doesn't have the super in-depth weapon customisation like BF3 or BF4, but it also doesn't have those moments when you run behind cover and still die because, on the enemies screen, you were still out of cover when he killed you, which is an extreme plus considering that almost ruined BF3 multiplayer for me. Finally, the DLC in this game is  the  best DLC that I have ever purchased for any other game. It's super cheap and it includes an entirely new setting for the multiplayer (I kinda wish that they would have added a mini-campaign to go along with it because that would be pretty cool, but I still love it)...The Vietnam DLC is the best DLC for any game that has ever existed ever, no doubt about it. It sets the whole game in a different battlefield, and an entirely different era (If it wasn't obvious enough; it changes the setting of the game to a Vietnam War era battlefield). It feels like I'm  playing  an old 80's action film. It's got all the little cliche Vietnam war things in it,  they even play 60's rock in the helicopters when you get in them.  The first time I got in a helicopter in the Vietnam DLC I pretty much ♥♥♥♥ myself because I was not expecting such badassery to occur, and I preceeded to be expertly flown, by my pilot, into a straight path towards the enemy's last base, he flew to the side a little bit so that I could aim with the side-mounted turret on the helicopter, and I mowwed down maybe around, 9 or 10 enemies without even breaking a sweat...  WHILE 60's ROCK WAS PLAYING . If that doesn't make you say 'I need this game right now, what have I been doing with these past 5 years, I should have totally pre-ordered this game when it first came out.' then I don't know what will.  My final verdict would come out to a good 9/10 for the base game, and a straight 10/10 for the Vietnam DLC. If you buy this game (which you should be in the process of doing right now) then you definetely need to buy the Vietnam DLC along with it. It's a must have if you own this game. (BUY IT NOW BEFORE THE SUMMER SALE ENDS BECAUSE YOU WILL SAVE 20$ OR SO DOLLARS!)",
            "review_score": "1"
        },
        {
            "review_text": "Vintage sniping experience",
            "review_score": "1"
        },
        {
            "review_text": "buy it now some parts are like rocket laucher hmmmmmmmmmmmm why is th TANKSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS ",
            "review_score": "1"
        },
        {
            "review_text": "Oh the joy I've had in this. Dead game now though.",
            "review_score": "1"
        },
        {
            "review_text": "The Bad Company series have been my favorite battlefield games for a long time, Bad Company 1 on the 360 was one of my first modern military shooters I had ever played, loved it so much, loved the MP, the Single player, when I bought Bad Company 2 I still loved both SP and MP, though I personally liked the sillier less serious style of BC1, and thought BC2 was a bit more serious, I still enjoy it, I enjoyed the singleplayer of bf3 and bf4 but neither of those can compare to the single player of Bad Company. MP is a lot of fun, the animations are good except for a very few animation spazes but mostly on the pistols it looks slightly choppy. graphics are still great and the overall style is perfect imo, and one thing this game has that bf3 and bf4 doesnt have is the ability to sneak up behind wookies and stalk them through the jungle! so fun! EA, what were you thinking when you killed off all the wookies?!?!?   I would recommend this game for any military lover, battlefield lover, or just maybe a first person lover in general. I give it a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Srsly it's battlefield.",
            "review_score": "1"
        },
        {
            "review_text": "Preety DANK to Me, just feels like a 2010 game but it is preety DANK cause of the 420 BLAZE IT with the ability to drive DANK vehicles that can 360 NOSCOPE MONTAGE players. Buy it, Play it, DEAL WITH IT.",
            "review_score": "1"
        },
        {
            "review_text": "Great multiplayer but boring campaign",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS game on PC",
            "review_score": "1"
        },
        {
            "review_text": "The single player is somewhat fun, but it's definitely no Call Of Duty. It's slow paced thanks to the large, open levels. So I experienced quite a few boring moments. The story also didn't really keep me interested. I finished it but if you asked me what is was all about I wouldn't be able to answer that question. Then again, Battlefield never was about the story, but more about the multiplayer. The multiplayer definately is better, since they're more action packed. Levels are big, there are multiple objectives and teamwork is of the essence. Headshots need to be calculated since there is gravity which makes it very satisfying when you kill someone (or frustrating when you miss). Only downside for me is the fact that you unlock everything quite early. So there's no real incentive to keep playing after you earned anything. Let's just hope BF3 manages to do things a bit differently. If you like (team-based) multiplayer games, make sure to give this one a go.  [Rating: 77/100]",
            "review_score": "1"
        },
        {
            "review_text": "Probably the only game they din't ♥♥♥♥ up with sun flares.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;spawn &gt;rush cap &gt;get hit by rocket launcher &gt;repeat  'oh man, this blows, lets try the vietnam one'  &gt;spawn &gt;rush cap &gt;get burned to death by superior american firepower because i am just an asian man wearing pajamas &gt;repeat  '♥♥♥♥'  ",
            "review_score": "1"
        },
        {
            "review_text": "Only buy this game for the campaign, because nobody plays the multiplayer anymore. I would recommend buying this while Bad Company 2 is on sale",
            "review_score": "1"
        },
        {
            "review_text": "Its good because it dosen't use Origin.",
            "review_score": "1"
        },
        {
            "review_text": " The best 'sequel' to Battlefield 2!  More demolition, classic FPS Multiplayer, I remember playing this great game 5+ years ago.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I might ♥♥♥♥ off a lot of people by this review:  I got this game after I got Battlefield 3 when everyone bashed Battlefield 3 and said bad company was better. And I can confirm that isn't the case.  -The gunplay is worse -Map design is much more linear or smaller, I deffinetly dislike this map design. -The maps are not limited depending on game mode, so if you are playing squad deathmatch to have some -quick close quarter match, you can have players leaving map zones and sniping you from a mile away where you can not spawn in any way. -Balance is a bit off.  But don't get me wrong. These are my toughes compared to battlefield 3 which is a game I quite like that I've poured over 400 hours on. Is it good in it's own merrit? Yes.  + Graphics still hold up (good) after 6 years. + Destruction is amaizing. + Servers are quite solid compared to newer titles of battlefield.  So by some odd reason, you decide to buy this as opposed to battlefield 3 yes, It is quite a good game. But my point stands as I can't see any other reason than nostalgia to get this over newer titles.",
            "review_score": "1"
        },
        {
            "review_text": "The game doesnt launch for some reason help! ",
            "review_score": "1"
        },
        {
            "review_text": "It is ok.",
            "review_score": "1"
        },
        {
            "review_text": "Spawn into match captured bravo found building placed c4 made server yell allau akbar.   10/10 would allahu akbar again",
            "review_score": "1"
        },
        {
            "review_text": ":(((( out of servers",
            "review_score": "1"
        },
        {
            "review_text": "Amazing graphics, excellent sound effects, humor and puns at the Call Of Duty franchise make this game a must play if you like FPS. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "It sucks",
            "review_score": "1"
        },
        {
            "review_text": "it's like skyrim with shut up haggard",
            "review_score": "1"
        },
        {
            "review_text": "Man I bet this game is super dead by now. Shoutout to 2010!",
            "review_score": "1"
        },
        {
            "review_text": "worth",
            "review_score": "1"
        },
        {
            "review_text": "The Battlefield series is one of the best strategy-based shooting games that the industry has to offer. However, not recommended if you play Cod.",
            "review_score": "1"
        },
        {
            "review_text": "This was the first Battefield game I have ever played, but it became one of my favorite games to play online. The singleplayer campaign is great and has some humor in it. I liked that it forces you to play several different play styles throughout just to introduce them for multiplayer.   I enjoyed the multiplayer because of how immense it felt. The battlefields were huge and very hectic. Different smaller skirmishes turned into buildings crumbling and exploding as the different teams brought tanks to the area. The destructable environment lead to many different 'HOLY SH**' moments as areas that were once safe were no longer areas at all.   I know battlefield 3 is out, but this remains the best battlefield game on steam.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: A four-year old title just spanked the pants off BF3 and BF4; No ORIGIN!  Why is it that a game released four years ago managed to score my money over the fresh, expensive title BF4?  Simple: it's a well-made game. You don't need to buy into upgrade packs to defeat higher-level players, there's servers that are still packed with players, and you can run this on practically any decent computer bought in the last four years.  And since I really enjoyed the Battlefield:Vietnam title ten years ago, I jumped all over the BFBC2 expansion.  Like other players have said, NO ORIGIN! (Seriously, this was the final point that made me throw money at it) Also, if you have an EA account with previous BF titles, you can still log in with it here.  While I enjoy ARMA III for it's striving to provide more of a simulation environment on a large-scale map, sometimes it's nice to just throw down in an arcade enviromnent where you're back in the fight seconds after being fragged.",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield: Bad Company 2. Somehow DICE manage to nail the single player storyline ala Modern Warfare (COD4). And despite the initial multiplayer hickups on launch (which by the way have been fixed) this game still offers a very definitive and enjoyable multiplayer first person shooter experience. I especially love the ingame destruction (in the Frostbite 1.5 engine) which is turned up a notch and way more destructive than say Battlefield 3. Battlefield: Bad Company 2 as it stands, proudly sits as a jewel in my own gaming library. Eight and a Half out of Ten Kiwifruit.",
            "review_score": "1"
        },
        {
            "review_text": "First got playing this when I joined GenerationKill since this was their main game, enjoyed it alot and still play it today. Most people compare it to Call of Duty (complete toss) and it is no where near, expect traditional BattleField gameplay and mechanics with extra moderness.  My rating: 10/10 - Bloody good.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay - 95 , Graphics - 90 , Playing time - 20+ hours. One of the best multiplayer experience I have ever had. The singleplayer is not good, but it's not the main focus of the game, anyway. Also, this game is 50% cheaper than it's competitor COD while the quality is superior.",
            "review_score": "1"
        },
        {
            "review_text": "Still arguably the best in the battlefield series. Gameplay feels open but the maps drive you toward battle. The weapons maintain a level of realism without being too overly compicated making for fun and rewarding firefights. This isn't the XP grinder that the new battlefield games are today and while it's not as pretty it holds up at a bargin bin price.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game that has a great replay value. Most destructive of all the Battlefields, but not as large of maps or users. Despite this, tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome FPS shooter that brings in elements of most newer games. It's a nice balance between the gritty realism of Arma and the fast paced action of Call of Duty or the newer Battlefield games. Plenty of people still play this on multiplayer, so definitely worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this to play with some friends and revive a bit of lan houses here in Brazil. Still haven't played with them, but for a 2010 game, we can get a LOT of servers to play, the base game or the DLC Vietnam (which is awesome). I'm enjoying very much of it, will play a lot more (maybe more than my BF3).",
            "review_score": "1"
        },
        {
            "review_text": "just down right fun",
            "review_score": "1"
        },
        {
            "review_text": "Sucky Singleplayer, however... the multiplayer is fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "It's Battlefield, Whats not to like?! How ever if you were to buy Bad Company 2 solely for the single-player campaign, you might come away a bit disappointed. That's not to say it's particularly bad in any way, but it doesn't feel impressive enough to stand on its own as a great experience. Once again, the multiplayer game is the star of the Battlefield show.",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter game ever. Ots a huge fun with really fast maps. But still got tanks, helicopters and all the ♥♥♥♥ you need to blow the enemys up. There is a big difference between the guns and you will somehow connect to one. Squad System works perfectly.  ",
            "review_score": "1"
        },
        {
            "review_text": "That game made a big step back then. And it's still a great game, with many players online. I really like the Vietnam DLC as well.",
            "review_score": "1"
        },
        {
            "review_text": "The only game that has managed to pull me away from Left 4 Dead....considering the amount of time I've spent playing L4D thats saying something :) No ridiculous physics like I've experienced in Call of Duty: Black Ops. Just high quality Russian vs USA fun.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended. Now give me my damn ticket!",
            "review_score": "1"
        },
        {
            "review_text": "A must-have brilliant game for the players who interesting in action gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly explosive, so much fun :D",
            "review_score": "1"
        },
        {
            "review_text": "The best Battlefield so far.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded it for nostalgia purposes... I had it on PS3 at release and loved it. Bought it on PC a year or 2 later because I missed it, and now I just got back in. Hours reported by steam aren't accurate.  In case you don't know, this is what Battlefield should be. It makes frostbite engine look pretty and do what it's supposed to do very well and in some cases better than BF3/BF4. I can't compare to Hardline as I haven't played it...  The good news is, there are still plenty active servers as of 5-13-15 so if you are considering purchase or redownload you wont be dissapointed.  No ability to go prone and still scores 10/10",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "wow still a great game !!",
            "review_score": "1"
        },
        {
            "review_text": "Not much into FPSs, but this is pretty damn fun.",
            "review_score": "1"
        },
        {
            "review_text": "its like battlefield   but good",
            "review_score": "1"
        },
        {
            "review_text": "EA will never let it be this good again.",
            "review_score": "1"
        },
        {
            "review_text": "stupid single player campaign. Great Multiplayer. A richer experience than call of duty mp, but lacking the character detail and uniforms that I love from COD. Vehicles and building destruction can't be beat.  Now Battlefield 3 sounds like the best of both worlds.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Fun Game with Barely any Cheaters for Multiplayer. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer perfection. The multiplayer rips most of the best bits from Battlefield 2 and condenses them into a much more accessible game. You lose jets but you gain much better gunplay. Singleplayer is worth a go too, although it doesn't stand up to Battlefield 3 (I think). Forget the spam playground that is COD and get yourself the most satisfying shooter of last year!",
            "review_score": "1"
        },
        {
            "review_text": "Maybe the best Battlefield from the series...better than BF3 &amp; 4",
            "review_score": "1"
        },
        {
            "review_text": "Nothing better than blowing people up with the AT rockets!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Game but thay could have made the game last longer.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty good modern military shooter. Snipers are ♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Really good Game. Short story but really good multiplayer and amazing new game modes. Cons: dosent have figther planes like bf2.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite Battlefield game, over 3 and 4, wish they would make a sequel already",
            "review_score": "1"
        },
        {
            "review_text": "Still the best game in the entire Battlefield series.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty god damn amazing game",
            "review_score": "1"
        },
        {
            "review_text": "Although not as epic as previous Battlefields (such as Battlefield 1942 and Battlefield 2, which had aircraft carriers, true naval warfare, airplanes, jets + 64 players + ton of quality Mods) this is still pretty fun. Amazing sound effects, graphics, destructible environment and a true modern battlefield feeling, which you can't get from CoD games.",
            "review_score": "1"
        },
        {
            "review_text": "I keep getting disconnected. I've always had video card issues with this game. I remember loving it, between hiccups. I wouldn't buy it if you don't already have it.",
            "review_score": "1"
        },
        {
            "review_text": "i've play it on Ps3 its Awesome !",
            "review_score": "1"
        },
        {
            "review_text": "I've always loved the Battlefield series better than the other two franchises in this category (Call of Duty and Medal of Honor) and though this was the first of this iteration to come out, it competes well with the others.",
            "review_score": "1"
        },
        {
            "review_text": "Great MP game.",
            "review_score": "1"
        },
        {
            "review_text": "You don't have this already?",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Battlefields ever. If not the best. Game is balanced, multiplayer still active, graphics still amazing and just all around perfect. I really miss when this game was the latest and greatest. If you have never played it, you will probably love it.",
            "review_score": "1"
        },
        {
            "review_text": "Before Battlefield 3, there was Bad Company 2, and it gave the gaming world a taste of what would eventually become one of the best multiplayer FPS experiences of the decade. The single player campaign was forgettable, but that was never what the game was about anyway. It's too late to enjoy the game now as most people have moved on to the newer titles, but just know this was the pivotal game in the series that got people to start abandoning COD's old, boring formula.",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield bad company 2 does a good job of simulating a real war battlefield for players. The game is well balanced and goes to some lengths for realism, from bullets effected by gravity to destruction. Squad up with three other friends and come join the Battlefield.",
            "review_score": "1"
        },
        {
            "review_text": "Nice addition to the battlefield fanchise. Multiplayer is where the game shines, good buy.",
            "review_score": "1"
        },
        {
            "review_text": "Nice addition to the battlefield fanchise. Multiplayer is where the game shines, good buy.",
            "review_score": "1"
        },
        {
            "review_text": "ths game was so col I used to ply this wen i was 5, so nostalgic",
            "review_score": "1"
        },
        {
            "review_text": "Forget Modern Warfare!  Get a real mans game! and play Battlefield Bad Company 2...  ",
            "review_score": "1"
        },
        {
            "review_text": "She sure is a good game. And for 9 bucks too.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best from the franchise! Sucks you in.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best cooperative FPSs ever.",
            "review_score": "1"
        },
        {
            "review_text": "Love it favourite of all of the Battlefields so far!!",
            "review_score": "1"
        },
        {
            "review_text": "Kicks ace!",
            "review_score": "1"
        },
        {
            "review_text": "Love it xD",
            "review_score": "1"
        },
        {
            "review_text": "This is a review on: Battlefield: Bad Company™ 2.  This is an amazing game and for 5 euro's you can't go wrong with this one. I have spend over 9 hours with this game and I have too tell you this is a very good and well built game. The multiplayer is like no other game, and it's a real battlefield. The singleplayer is fun too play and you keep playing it. If you get bored of playing the SP, you can go play the MP. You keep playing and you don't want to stop playing ones you have spend some time playing the game. I recommend this game too anyone who want's to have a game too play in the vacation and for everyone who wan't a really fun and cool game.  Greets,  MicroZevin",
            "review_score": "1"
        },
        {
            "review_text": "Great Multiplayer! Nice Visuals! Would Recommend you getting this!",
            "review_score": "1"
        },
        {
            "review_text": "this would have to be one of my fav shooters had so much fun playing rush back to back when this game 1st came out on the 360 and now playing it today i would still rate it higher then most games out there today",
            "review_score": "1"
        },
        {
            "review_text": "I'm writing this from a singleplayer point of view since the multiplayer is pretty much dead. As you can see it took me under 5 hours to complete the game. The singleplayer offered me a great expierience however. The story tags you in with 4 misfit soldiers who bite off more than they can chew after an operation doesnt end up as they would'ev wanted. From there you go on a great ride as Preston Marlow. The story is pretty basic, Russians have a super weapon, hate America, blah blah blah. But the best part is your squad. Its you, Sweetwater, Sarge, and Haggard(Haggard is my favorite), and they make the story worth while. From their personality mix between each other, to the dialogue they speak. I found myself laughing and chuckling to them as I fought off waves of enemies. I highly recommend this game for under $10 dollars due to the fact that multiplayer is dead...shame.",
            "review_score": "1"
        },
        {
            "review_text": "The best Battlefield Ever looks amazing, dude the gameplay the destruction ver balanced and hard to level up   when i was thinking that they have everithing... VIETNAM !!!",
            "review_score": "1"
        },
        {
            "review_text": "This was the game that got me into the Battlefield series.  It is in my opinion still one of the best battlefield's.  It just sucks that there arent any servers or people playing it anymore,",
            "review_score": "1"
        },
        {
            "review_text": "Great Game Same Trigger Happy Feelings As BF3 Great Gripping Story. Fast 2nd To Bf3.",
            "review_score": "1"
        },
        {
            "review_text": "The only Battlefield game where you enjoy all the maps.",
            "review_score": "1"
        },
        {
            "review_text": "That's a great game! Bad thing the newest Battlefield games are at Origin. They did so much bad things to earn money with Battlefield 3",
            "review_score": "1"
        },
        {
            "review_text": "Best Multiplayer Modern Warefare First Person Shooter!",
            "review_score": "1"
        },
        {
            "review_text": "If you are interested in hearing what war sounds like, buy this. Can't wait for BC3!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a little laggy for me, but I've gotten used to it. Now, I'm a rank 17 and I bought the 'SPECTACT' kit... the game is better for me. I hope you guys play this game because it has epic battles I would say. Also, the reason I got this game is because it is now the only Battlefield on Steam. I reccomend you guys this game and I'll see you, on the battlefield.",
            "review_score": "1"
        },
        {
            "review_text": "severs are up and running",
            "review_score": "1"
        },
        {
            "review_text": "I got killed by tanks so many times I pretty sure I made Left 4 Dead 2 feel incompetent.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "My favourite Battlefield game, and one of my favourite multiplayer FPS games. People still play it!",
            "review_score": "1"
        },
        {
            "review_text": "Can't say enough about battlefield.. been playing it since the original 1942 came out. BF has always topped the genre, better than CoD, but I might be a little biased seeing as how I've been a hardcore fan since the begginng. It has the most realistic sniping I've experienced. The fact that you can pilot all types of ground, air, and water vehicles really adds to the feel. Games great, though I prefer to play BC2 Vietnam.",
            "review_score": "1"
        },
        {
            "review_text": "best battlefield game by far.",
            "review_score": "1"
        },
        {
            "review_text": "I love the game but I have been having problems with the connection for MP... must be a set up... I hope I can solved soon.",
            "review_score": "1"
        },
        {
            "review_text": "BF: BC2 is one of the best for me. Even after playing BF3 for more than 300 hours I know I enjoyed BC2 way more!!! I wish they released BC1 on PC.",
            "review_score": "1"
        },
        {
            "review_text": "I got killed by tanks so many times I pretty sure I made Left 4 Dead 2 feel incompetent.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield game they've made. Probably the best FPS out there as well. Has a pretty good story mode but the multiplayer is the real gem of this game. You must buy it. Simple as that.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "best battlefield out there",
            "review_score": "1"
        },
        {
            "review_text": "Destroyed a helicopter with a sniper  10/10  BF3/4 are ♥♥♥♥. This game will go down as THE BEST BF ever made!",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield Bad Company 2 - It's the last remnant of the good old Battlefield games. Highly recommend!!!",
            "review_score": "1"
        },
        {
            "review_text": "Some of the best fun you can have with you and 3 of your friends.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥load better than cod",
            "review_score": "1"
        },
        {
            "review_text": "There are no servers for Multiplayer. Just a heads up",
            "review_score": "1"
        },
        {
            "review_text": "this is a Excellent multiplayer expreince its definentley worth 20 bucks",
            "review_score": "1"
        },
        {
            "review_text": "Feel like sniping someone in the head from across the map with shotgun slug rounds?! Get this.",
            "review_score": "1"
        },
        {
            "review_text": "For a shooter This game is outstanding. Stable multiplayer servers and a great solo storyline. Best part is you don't need a maxed out system to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Singeplayer - Honestly I dont play battlefield games for its singleplayer but i tried it out on this game and its pretty generic.  Multiplayer - One of the best I have ever played. It does take time to learn the guns and the maps but once you get past that its smooth sailing. The only thing that i dont like about the multiplayer is it take awhile to actually level up.  Graphics &amp; Destruction 2.0 - The graphics are refreshing to me because i usually play call of duty and tf2. Destruction 2.0 allows you to destroy everything literally everything if you have a camper in that building send a mortar strike in ands it gone.  Overall this game is amazing for 19.99 and I would recommend it to anyone who loves FPS and realism.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game was worth the 10 bucka i payed for the whole pack just brushing up till BF3",
            "review_score": "1"
        },
        {
            "review_text": "My favorite shooter of all time, to date. Great to play with a few friends, or just go rambo it up on your own.",
            "review_score": "1"
        },
        {
            "review_text": "Best shooting mechanics in a game so far.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game , best gameplay , best maps /",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the series hands down. Great story and great multiplayer (even though the population has gotten a little scarse.)",
            "review_score": "1"
        },
        {
            "review_text": "Eons better than any cod you'll find, this tactical shooter is the best in the last few years and bf3's the only thing that's gonna top it.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game, but I couldn’t find the stupid cake.",
            "review_score": "1"
        },
        {
            "review_text": "Screw battlefield 4 when you can play Battlefield: Bad Company , bros!",
            "review_score": "1"
        },
        {
            "review_text": "game is fun but,it keeps crashing to desktop when i start the game.i've tried everything and none seems to work plz help",
            "review_score": "1"
        },
        {
            "review_text": "3 yrs Old , And Still a GREAT Game :-)",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, but I lack people to battle with! the multiplayer is dead...",
            "review_score": "1"
        },
        {
            "review_text": "Tired of running around on the ground in small maps? Get BC2 and take to the sky, fly around in an apache or blackhawk or even a UAV. Prefer the ground still? Roll some people over with a tank, quad, or an APC. Parachute into the enemies base taking people out on the way down. if you like Black Ops then BC2 will blow you away. But be warned, you wont go back.",
            "review_score": "1"
        },
        {
            "review_text": "Hide in a house so i can blow it down",
            "review_score": "1"
        },
        {
            "review_text": "this game, just look how many time i spent playing this great game for me its a excelent shooter but more than a shooter its the only fps that i feel the sentation of cooperation i fully recomend it",
            "review_score": "1"
        },
        {
            "review_text": " The last worthwhile title in the series. And no, Origin isn't the reason.",
            "review_score": "1"
        },
        {
            "review_text": "This game is much better than Black-ops and cheaper, you should get it for the holidays!",
            "review_score": "1"
        },
        {
            "review_text": "If you played back in the day you would know this was the best BF hope they do Bad Company 3 :D!!!  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Community is still active. I have previously played BF3, on the playstation. It was good, but this game seems much better. The destruction that can happen in the levels is great.",
            "review_score": "1"
        },
        {
            "review_text": "The title 'Bad Company' pretty much refers to the fact that your teammates are a bunch of teamkilling, camping, good-for-nothing ♥♥♥♥♥♥♥♥s that will not do anything to cooperate with you in order to achieve your mutual goal, i.e., winning.  10/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever , but why i cant play multiplayer ? .",
            "review_score": "1"
        },
        {
            "review_text": "Great game!! action, strategy, adrenaline, a lot of bullets... and the best battle experience in a game. Totally awesome.",
            "review_score": "1"
        },
        {
            "review_text": "  lit, but not enough players",
            "review_score": "1"
        },
        {
            "review_text": "Really great game",
            "review_score": "1"
        },
        {
            "review_text": "I was begging my friend to buy it and then when he got it. I didn't not play it ain't no more. Solid 4/6.7",
            "review_score": "1"
        },
        {
            "review_text": "Fun! Shame about all the spawn killing ( :shakeshark: @ bloody snipers &amp; their wookie suits ) &amp; s( lag ) deaths (I blame my internet connection for that one mind).  Pros:     fun single player campaign     even more fun multi-player (when you're not dying every 2 seconds)     nice selection of classes, weapons &amp; perks     rewarding level up system (unlock better weapons &amp; perks based on selected class)     sneaking up &amp; stabbing snipers in the back -  you know they deserve it!      no pay to win nonsense   Cons:     s(lag) &gt; it's like lag albeit dirtier! (game seems to continue playing then x time later you either jump back to a previous position, are dead or have martyred yourself with your own bloody grenade). :D     unfair to new players (have a hard time killing people until you get magnum ammo perk)     snipers! spawn killing &gt; in certain maps snipers will position themselves so they can see spawn spots. It gets old really fast. However it's rewarding when you spawn in a better position &amp; then sneak up &amp; stab them in the back.     noobtubers - I learned what that word meant the other day. There's lots &amp; lots &amp; lots of bloody noobtubers everywhere!     snipers (again) - because I hate them.   Conclusion #1: Using blu-tack isn't cheating if no one can prove it! ( shhh! ) ;)  Conclusion #2: Well worth the price - especially if you buy it in a sale.",
            "review_score": "1"
        },
        {
            "review_text": "i love getting base camped 9/11",
            "review_score": "1"
        },
        {
            "review_text": "The Bad Company 2 is the best Battlefield so far.  Great gameplay and there are still many active servers. BC2 Vietnam is awesome too.",
            "review_score": "1"
        },
        {
            "review_text": "Much better than MW2, it's a great game, and continues the awesome BF series.",
            "review_score": "1"
        },
        {
            "review_text": "I shot at things and they shot at me. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "The only battlefield on steam, worth every dollars of the 5$ sales. Fun, intressting and cant wait for bf1",
            "review_score": "1"
        },
        {
            "review_text": "If I had to use my $20 to either buy this or get a cure for a zombie virus, I would have started the Apocalypse.",
            "review_score": "1"
        },
        {
            "review_text": "Worth buying at sales. Even tough the multiplayer is dead. The campaign is priceless.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, highly suggest to anyone that enjoys FPS multiplayer. the lack of Jets and abundance of vehicle infantry warfare + destrucable enviroments has made this a must have over battlefield 2 anyday. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have really been enjoying this game. The team play aspect of it is what sets it apart from other realistic military shooters out there.",
            "review_score": "1"
        },
        {
            "review_text": "If you are tired of running and gunning of call of duty but also want a new shooter, this is for you. I love it",
            "review_score": "1"
        },
        {
            "review_text": "Buy Bad Company 2  Buy Vietnam DLC  Equip the flamethrower   hungry anyone? 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield to date.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, still the best Battlefield in the franchise :)",
            "review_score": "1"
        },
        {
            "review_text": "For me, this is the Battlefield game that Defined the franchise. Everything fit together, bugs were not too prominent and the game flowed well. The maps all ahd a certian flow for each gametype that kept each side balanced and together. There were no serious flaws. I still play this game 5 years after its release because I keep coming back to how well it kept a solid feel. The newer games all feel rushed and poorly put together. This was when DICE coud do what they wanted to do and make a good game. BFBC2 is a brick compared to the sheet of glass named BF4.",
            "review_score": "1"
        },
        {
            "review_text": "I played Battle field 1942 with all the expansions, this newer one fails in comparision. Seriously in the old one you could set up your battle field with ai with any scenerio available, Now i have to actually work with people and try not to get my ♥♥♥ whooped.  Seriously this game is cool, better graphics, cool story mode, destructable buildings. But come on EA we want options. This game is fun but the first one will always be the best, just give it a graphical reboot thats all you need. Do it you ♥♥♥♥♥♥♥ EA mutherfookurs.",
            "review_score": "1"
        },
        {
            "review_text": "Great destruction, simple mechanics. Would like more customization, but that's what BF3/4 is for. Great for those who don't want to put too much time and effort, but want a great time in a shooter. Awesome sound too.",
            "review_score": "1"
        },
        {
            "review_text": "realistic game with great squad plaly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the far best FPS game I've ever played. Totally different then CoD where CoD you can just have one person do all the work and the team will win. In BFBC2, team cooperation is very important. If you don't work with your team, you will LOSE. For example in the multiplayer mode 'Rush' in BFBC2 requires you to rush as a team to take out an objective. If you don't work with your team, you WILL LOSE. The whole part of this game is to work well with your squad that you are in. Give them ammo, heal, revive, watch their backs and so on. Unlike CoD, one person can just kill everyone and get the highest score and win the match. BFBC2, points don't matter. Teamwork matters. Also bullets do not fly straight in this game. Gravity applies. Bullets do attend to drop just like real life. Also you get to use vehicles in the battlefield. You can use a tank, helicopter, ATV, UAV, and boats to travel/kill people depending on the map that you are playing on. BFBC2 FTW &amp; Vietnam. :D",
            "review_score": "1"
        },
        {
            "review_text": "A unbelievably entertaining multiplayer and surprisingly even singleplayer experience.",
            "review_score": "1"
        },
        {
            "review_text": "So. I got this game from my friend.  The Positives: -Good Campaign -Realistic sounds and physics -ETC  Negatives: - R.I.P. Multiplayer - Enemies alwas focus fire on me",
            "review_score": "1"
        },
        {
            "review_text": "Good Game servers need too ban snipers less! :)",
            "review_score": "1"
        },
        {
            "review_text": "The last of the good BF games. perhaps they will return to thier roots one day.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Call of Duty, can't complain much about this.",
            "review_score": "1"
        },
        {
            "review_text": "The multiplayer is chaotic, and I love it!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Went from level 5 to 32 in less than half an hour due to X15 XP servers. GG BFBC2 GG",
            "review_score": "1"
        },
        {
            "review_text": "Eliminating the prone key is the greatest Idea ever.   Some people do not realize this, but that is what makes this rather 'low' 16v16 matchups rather appealing. Not that that matters anyway, sometimes having too many players in a match can get rather... hectic.   What has eliminating the prone key have done? Almost completely removed camping. You see most Battlefield games have that certain someone that likes to hide on the ground. You see it also means that Sniping is more double edged that you think. The game has one of the best bullet ballistics for sniping and other weapons. The sniper can not prone. Which also means, the Assaultman can not prone when he is waiting for you around the corner. There is vitually no hiding in the open, because you can almost not hide without cover or building occupation. Which is good because realistically in fast paced and smooth gameplay, using the prone just completely ruins the emmersion of 'This is a battlefield, why are you even stopping?'.   But why should I dig deeper into the gameplay when there is still a rather strong commune of full population game servers? It's not that hard to play.",
            "review_score": "1"
        },
        {
            "review_text": "Good game! Short Campaing but awesome Multi Player!",
            "review_score": "1"
        },
        {
            "review_text": "great game more chatting would be nice",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Get it! best multiplayer around. Buy it and we'll have fun.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Sad that they are shutting down the servers. Definatly liked the game play and how the maps evolved and changed. Good back and forth generally left you on the edge of the seat. Definate 7.5 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "B:BC2 Vietnam is a fantastic expansion. If you were to buy Bad company 2, do it just for Vietnam. It brings a whole different game to this game.",
            "review_score": "1"
        },
        {
            "review_text": "you can have really fun with ur friends even in this game. So if ur like a crew of 4-5 people. Go play this :D",
            "review_score": "1"
        },
        {
            "review_text": "Must have for any fan of the Battlefield series, let alone Dice. Great gameplay, great tactics, GREAT GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. 5$ and I am given a lifetime's worth of euphoria. Feels like a 2014 game for a 2010 release. All the generic shooters being produced right now is crushed by this thing.",
            "review_score": "1"
        },
        {
            "review_text": "sucks cant find my seril key",
            "review_score": "1"
        },
        {
            "review_text": "Overall a great game.   The graphics are very good looking and run suprisingly well. Maxing the game out still gives a solid framerate (70+fps) with no stutters or lighting glitches. Its one of those games where the gameplay makes the cutscenes look bad.  The campaign has a very nice variety of terrains and isn't too repetative. I love how you can just blow a hole through a building that you don't feel like walking around. The fully destructable terrain adds a different playing style to the game, especially in choke points.  The multiplayer runs very smoothly and games are always intense. The only problem is how tanks can sit on one side of the map and farm kills.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best Battlefield game I've experienced as far as Multiplayer goes. The Singleplayer campaign is great as well.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game though hard to find an online match now 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite BF game, second only to 1942.",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter ever made, buy this!",
            "review_score": "1"
        },
        {
            "review_text": "Its hard at the beginning but i believe after maybe 20 hours your pretty good at it. DLC is good. Still quite a lot of people playing it. Try it.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing to say apart from buy it. Epic Muliplayer!",
            "review_score": "1"
        },
        {
            "review_text": "A million times better than call of gayness. Got for cheap in the sale cant wait for number 3",
            "review_score": "1"
        },
        {
            "review_text": "There simply has not been a better balanced Battlefield game than Bad Company 2. Camping has never been a such a big deal in most modern Battlefield games, but with BF3 and 4 i felt that i got frustrated more often than in Bad Company simply because there was a ♥♥♥♥♥♥♥♥♥♥♥♥ in prone who lit me up from the other side of the map. Also the guns felt better, there was less air combat, and there was more of an emphasis on getting ♥♥♥♥ blown up. I would love to see a Bad Company 3 with the larger weapon selection BF4 offered, the same level of destruction, less emphasis on air combat (for ♥♥♥♥s's sake even 1943 did a better job), and no ♥♥♥♥ing prone.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, almost as good as battlefield 3.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game becuase it was on sale for five bucks. The gameplay is great and graphics are fine. It is very populated and brings much fun. My only problem is, I couldn't hear one bit! The only thing I could hear was the ads in the begining when you launch the game, And thats it. If you know how to fix it please help cause I don't want to let this go.",
            "review_score": "1"
        },
        {
            "review_text": "Until BF3 comes out this is as good as it gets for FPS MP.",
            "review_score": "1"
        },
        {
            "review_text": "It's a awesome game.  Singleplayer mode is good and all that, but it's the multiplayer mode where the milk and cookies are at! For me atleast :D",
            "review_score": "1"
        },
        {
            "review_text": "This is definitely one of my favourites among the entire Battlefield franchise. The Vietnam DLC is a must-have for any Vietnam-era fanboys",
            "review_score": "1"
        },
        {
            "review_text": "Good game, I enjoyed the result from frosbite engine.",
            "review_score": "1"
        },
        {
            "review_text": "still the best game evah!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Fun combat if you like playing with some friends. Its like a mix between left 4 dead's 4 man squad teamplay with the gameplay of a call of duty. Great pick for a shooter.",
            "review_score": "1"
        },
        {
            "review_text": "BETER THEN BT3 BUT ILOVE IT LIKE ME OWN SON THET I DONT HAVE 1000000000/10",
            "review_score": "1"
        },
        {
            "review_text": "Better than Battlefield 4",
            "review_score": "1"
        },
        {
            "review_text": "THIS GEME IS INCREBLE",
            "review_score": "1"
        },
        {
            "review_text": "One of the last BF games I've played and really liked. To me it felt like it most of the good elements from BF2 with the newer engine and destructible physics adding a new element missing from a lot modern online shooters. Not a huge fan newer BF3/4 but overall this game works well but Hardcore mode really the only true way to play this game. ***8/10***",
            "review_score": "1"
        },
        {
            "review_text": "Best Multiplayer Modern Warefare First Person Shooter!",
            "review_score": "1"
        },
        {
            "review_text": "Definetly the best game in the Battlefield franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield of all time.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games! and best of all parts Battlefield",
            "review_score": "1"
        },
        {
            "review_text": "everyone is nood as everyone has aids",
            "review_score": "1"
        },
        {
            "review_text": "i'm here to arrest terrorists and save america",
            "review_score": "1"
        },
        {
            "review_text": "BEST BATTLEFIELD GAME OF ALL TIME",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome, you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I had way too much fun playing this game in the day. I wish that the community were still active, but regardless of its current state, the game has won a special place in my heart. There's still enough players to support a ton of servers, but all my frequented servers have since been shut down, and my friends moving on to other games. In short, the campaign is fun, and would be worth playing through at least once. The multiplayer is a lot of fun as well. It's a little more focused on close quarters, so if you're looking for the epic 64 player vehicle battles that BF3 offers, you may want to look elsewhere. However, it's relatively well balanced, each weapon has its merits and drawbacks, and once you find your niche with a class, you'll have a blast.  Destruction is the real selling point of this game in my opinion, as you can level an entire map with patience and a grenade launcher. Makes for interesting gameplay, and an interesting sense of suspense, since the map can change at any time. Definitely recommend for any multiplayer FPS fan.  ",
            "review_score": "1"
        },
        {
            "review_text": "I never played this game when it came out, I just bought it the other day just to play some other maps after playing Battlefield 4 for over 400 hrs and I must say I'm glad I did. BC2 is in many aspects better than BF4 in my opinion. The maps are great, especially for rush. Ther is still alot of people playing aswell. The singleplayer is okay too, atleast better than the sp in BF3 and BF4. All in all it's well worth the price.  +Good graphics +Nice maps +Very satisfying kills +Great sound  -The movement can feel a bit clunky -Lacks customization if your used to the newer battlefields",
            "review_score": "1"
        },
        {
            "review_text": "If people still played this it would be fun, the destructable buildings were great.",
            "review_score": "1"
        },
        {
            "review_text": "What can be said about Battlefield Bad Company 2 that hasn't already been said. It's an enjoyable game, even past it's prime, it's highly team work oriented. I saw it get better as time went on through Battlefield 3 and 4, but to be honest, given everything I know about the time by which this game was made and how it can still hold it's own as a game even now, i'd give it a solid 6.5/10. It's enjoyable, can get and got better, but grapics, gameplay, and handling wise.... it's not a terrible choice if you have to chose between this and Cod 4. I'd go with this.",
            "review_score": "1"
        },
        {
            "review_text": "The best war-type game i have ever played. This game is perfect, the story is just amazing &amp; very memorable. Unlike the modern warfare, forgettable, cookie-cutter terrorist plots, this game has a fantastic storyline. It has some of the best graphics i have ever seen in a video game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best from the franchise! Sucks you in.",
            "review_score": "1"
        },
        {
            "review_text": "After the last update , you can't change the resoultion in the config file , and that's a bummer :( But other than that , it's a masterpiece and probaly the best in the Battlefield seriers . Good old times when EA was legit . 9.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Class customization, weapon broadness, variety of vehicles, squad teamplay, tactical creativity, map design, sound effects and last but not least, an almost full destructible environment.  This game has everything to fulfill an awesome FPS experience.",
            "review_score": "1"
        },
        {
            "review_text": "There is no reason to not buy this game. Even if you already have it.",
            "review_score": "1"
        },
        {
            "review_text": "Its so much better than COD ... It has strategy ...",
            "review_score": "1"
        },
        {
            "review_text": "Good looking, good gameplay if you can find a good squad, and nice guns.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a battlefield fan, this is a must get. 8/8 gr8 b8 m8",
            "review_score": "1"
        },
        {
            "review_text": "Awesome stuff. When i first played this, it graphically blew me away - and still in 2014 it impresses. Mostly though, its the fast gameplay. Sure enough, if you're new to the game, there's a learning curve, and others will get you more than you get them; stick with it though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so amazing :) Its really good also if you buy the dlc's i bought it during a summer deal with all dlc's for 5 bucks Ha!",
            "review_score": "1"
        },
        {
            "review_text": "The bes game ever created better than battelfield 3 and 4",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "one of the best online shooters still out there, still better than bf3/4 and that hardline crap.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and plenty of active servers, make sure you check the server options or no servers will be visible when you first run the game.",
            "review_score": "1"
        },
        {
            "review_text": "Had a lot of fun with it, 100% Recomendable",
            "review_score": "1"
        },
        {
            "review_text": "Started from the bottom now we here. I seriously got my ♥♥♥♥ wrecked so got damn hard in this game. 20/13 would uninstall just to play again",
            "review_score": "1"
        },
        {
            "review_text": "An EXTREMELY entertaining game, online is super fun if you know what your doing. A definite must play for shooter heads.",
            "review_score": "1"
        },
        {
            "review_text": "EA's last game they had on Steam before putting all their games to Origin. Battlefield: Bad Company 2 is a game that I fell in love with in 2010 on my Playstation 3 and am still in love with on my PC.   In multiplayer, you're forced to actually play as part of a team, with one of the four available classes: Assault, Engineer, Medic or Recon. This game has a particular charm that just keeps bringing me back for more, with easy-to-learn controls and solid gameplay, BFBC2 is better than Battlefield 4 in every aspect. Even the destruction of buildings is better.   Dice knew what they were doing when they pumped out this gem, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "EA finally realized that they make 15 maps for a BF game, and the community only really plays 2-3 of them- so they only made 3 of them this time around.  Good show EA.",
            "review_score": "1"
        },
        {
            "review_text": "Better than BF3",
            "review_score": "1"
        },
        {
            "review_text": "A classic one!",
            "review_score": "1"
        },
        {
            "review_text": "Join the burly heroes of Bad Company as they take arms against the invading russkie army in a NO HOLDS BARRED, man on man, cage match of intense WAR, VIOLENCE, AND GUNFIRE. As one of these heroic hunks, you’ll earn every cent of your GI Bill scholarship pushing back the reds with a HIGH OCTANE MIX of machine guns, pistols, rocket launchers, and tanks. Learn the true meaning of teamwork and camaraderie as you and your squad of strapping, vigorous warriors fight across deserts, jungles, and snow covered towns. When any battle could be your last, live life like the muscular, virile soldiers of Bad Company do--without any regrets.",
            "review_score": "1"
        },
        {
            "review_text": "A game which takes you into war , has realistic graphics and alot of weapons , fun time to play with friends , i recomend it! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hey, this game's great. Glad I bought it. The end.",
            "review_score": "1"
        },
        {
            "review_text": "words cannot describe it",
            "review_score": "1"
        },
        {
            "review_text": "Everything you'd want and expect from a Battlefield game without the hassle of downloading Origin",
            "review_score": "1"
        },
        {
            "review_text": "This is still one of the best pc games I've ever played. When you get a team of your friends together and decimate the opposing team it just gives you a sense of satisfaction I can't describe.",
            "review_score": "1"
        },
        {
            "review_text": "Iz pretty gewds game, has gunz and asplosions",
            "review_score": "1"
        },
        {
            "review_text": "True fun experiences that I had playing this game. I hope they make a third one.",
            "review_score": "1"
        },
        {
            "review_text": "Once again, I didn't paly the Campaign, but I did play the multiplayer - Tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "this is better than origin bf3 you dont drop out of games randomly..... like origin...... but first battlefield i play and it doesn't matter how old this game is i love it.",
            "review_score": "1"
        },
        {
            "review_text": "The moderately destructible environment is a fun gimmick in both singleplayer and multiplayer, making BC2 a noteworthy experience. The singleplayer campaign is good enough for multiple playthroughs, multiplayer can draw you in with the relationship between infantry and ground vehicle combat. Chopper maps are quite messy, as you're either being shot at by, waiting in line for, or hiding from one. I forgive the chopper mess thanks to the weaponized UAV.",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield, without the BS. The only aircraft are helicopters, which with a little skill can be fairly easily tagged with tracer darts and brought down. Even the single player is worth playing, though I play it predominantly for the multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best Battlefield multiplayer experience out there.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game just like part 1...fps with a sense of humor and good destruction.",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS shooter ever!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good FPS game. One might even consider it a great game, given that it offers an extremely rewarding multiplayer experience on top of the easily enjoyable single player experience. The game initially released with many bugs, but several patches later you now have a solid FPS experience waiting to be had. I thoroughly enjoyed the single player experience, and even found some of the voice scripting to be comical (in a good way) at times. The multiplayer still has some very minor balancing issues, but this game is easily worth the purchase just for the multiplayer portion--especially if you have a friend to join in on the experience. Purchasing this game is a no brainer. The only games that rival it are Battlefield 2 and other EA releases. It is very difficult to compare a game like this to games like Left 4 Dead, Call of Duty, or Medal of Honor as the multiplayer experience is on a much larger scale, focusing more on the chaos and unpredictability of realistic battlefields.",
            "review_score": "1"
        },
        {
            "review_text": "This was my first i guess real updated battlefield ive ever played if you can find a server that dosent have high ping youll have alot of fun this is most fun ive had in awhile",
            "review_score": "1"
        },
        {
            "review_text": "best shooter currently in existence 01.07.2011",
            "review_score": "1"
        },
        {
            "review_text": "Great Game If you like All Out Wars! Its MADNESS!",
            "review_score": "1"
        },
        {
            "review_text": "Dear Reader,  If you are reading this I need help. I need people to buy this wonderful game and i need you to fly helecopters with me, ride tanks with me, run-n-gun with me or I'm writing a good review. In this case it's both. Ahem. GET THIS GAME FOR YOURSELF. I need someone PLEASE.   Sincerely,  {OBHS} Vintage Fliqpy1223 ",
            "review_score": "1"
        },
        {
            "review_text": "I had a blast in BC2. It's the best BF game I've played in the series (I didn't play BF2). Sort of like the CoD4 of CoD. Sad what has happened to the BF series. It's ALL gone downhill since this game. EA and lame Origin have destroyed it with the failures of BF3 &amp; BF4. This is the only BF game worth playing still. At least you can buy this on Steam still and avoid Origin. It's well worth the $20 and even better if you catch a deal.",
            "review_score": "1"
        },
        {
            "review_text": "Good ol' Bad Company 2, really nostalgic at this point in the Battlefield series. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty cool. The single-player campaign can be frustrating from time to time, but that is all made up by the amazing story and camera-scenery works. It's almost like a movie. For the multiplayer counts pretty much every other Battlefield game review. This game has no matches with 64 players tho, so it's a lot more peacefull. That does take it to a higher level of realism. The snipers are a litle too common and strong, so mind your head!",
            "review_score": "1"
        },
        {
            "review_text": "LEGENDARY, have hundreds of hours on console and the PC version is just that much better. First Person Shooters don't get much better than this.",
            "review_score": "1"
        },
        {
            "review_text": "This is game really good!",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield game (In my own sexy opinion).  Story - 10/10 !",
            "review_score": "1"
        },
        {
            "review_text": "i played gthis for 40 hours online and im pretty sure most of that time i wasnt having fun but i kept doing it. buy this if you like to keep doing things.",
            "review_score": "1"
        },
        {
            "review_text": "Impressive shooter that incorporates awesome visuals, variable and well implemented game mechanics and tactical elements. The online stats and server availability give this game extra points. My only grudges are the steep hardware requirements and the moderate imo sound implementation - software sound rendering sucks...More content updates wouldn't hurt either.  Verdict : An overall good game but it could have been better. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "The multiplayer shooter of 2010",
            "review_score": "1"
        },
        {
            "review_text": "Great game, been playing since day one. One of the best FPS out there, no jets but still better than BF3.  Run through the lucious jungles or snipe from a far distance. At least there are helicopters!  10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome multiplayer experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, although for a shooter you may sometimes get frustrated at being killed without understanding WTF happened. Nice graphics, and Unlocking Progression in multiplayer to keep some motivation, while keeping the Battlefield style. Got it at a 75% off sale =).",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield: Bad Company 2. Somehow DICE manage to nail the single player storyline ala Modern Warfare (COD4). And despite the initial multiplayer hickups on launch (which by the way have been fixed) this game still offers a very definitive and enjoyable multiplayer first person shooter experience. I especially love the ingame destruction (in the Frostbite 1.5 engine) which is turned up a notch and way more destructive than say Battlefield 3. Battlefield: Bad Company 2 as it stands, proudly sits as a jewel in my own gaming library. Eight and a Half out of Ten Kiwifruit.",
            "review_score": "1"
        },
        {
            "review_text": "well worth the money even tho theres alot of cheaters",
            "review_score": "1"
        },
        {
            "review_text": "One of the best cooperative FPSs ever.",
            "review_score": "1"
        },
        {
            "review_text": "Hi, Bad Company 2. If you played MW2 or other war games you might find them very fast paced and weird, BUT! This here will blow your mind. Ranking up is the hardest thing to do in the game. And the weapons you unlock can be worse than the first one you started off with. But hey, this game is epic. There are no actual killstreaks like in example COD4. But you can control UAVs that pew and you can call in mortar fire with funny bye-knock-you-lars (wat). The game just like the older one in the series (Battlefield 2) you can drive/steer/control/fly different kinds of vehicles, example: Black Hawks and quad bikes. All of these have different purposes, quad bikes are mainly used for flanking and Black Hawks can be used to drop off soldiers or just circling around the map lookin' cool. I can't write much more as Steam just added this feature so there isn't much space to type. But yeah look up the game, I'm tellin' ya. It's worth it!",
            "review_score": "1"
        },
        {
            "review_text": "The sound engine of this game is brilliant! The single player is pretty boring, but who cares about what they ask you to do, when a game sounds like this.",
            "review_score": "1"
        },
        {
            "review_text": "Fun single-player adventure, and a multiplayer mode that knows the meaning of the word 'Balance'. Fun 2 play for months.",
            "review_score": "1"
        },
        {
            "review_text": "I just can't believe this game. I've played BF3 and BF4, and I've had this game sitting in my Steam library for quite a long time. I've played the SP game which is just great, but I haven't really jumped into MP until tonight. HOLY CRAP. This game is from 2009? and seems to handily beat down both BF3 and BF4 in terms of enjoyability. I just loved this game online, and there are still people playing! The graphics are surprisingly close to BF3 and the maps are great. I have the Vietnam DLC but I'm not sure how much of that I've experienced yet. I had such a great time online tonight that I think it will take the place of BF3 and BF4, which were both slightly disappointing. I love this game so far. May it never die!!!",
            "review_score": "1"
        },
        {
            "review_text": "Good co-op game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with some great dedicated severs! Would recogmend to anyone!",
            "review_score": "1"
        },
        {
            "review_text": "this game is wicked sick!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, can't wait for Bad Company 3",
            "review_score": "1"
        },
        {
            "review_text": "One of the best BFs.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great FPS game to play with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "I'm writing this from a singleplayer point of view since the multiplayer is pretty much dead. As you can see it took me under 5 hours to complete the game. The singleplayer offered me a great expierience however. The story tags you in with 4 misfit soldiers who bite off more than they can chew after an operation doesnt end up as they would'ev wanted. From there you go on a great ride as Preston Marlow. The story is pretty basic, Russians have a super weapon, hate America, blah blah blah. But the best part is your squad. Its you, Sweetwater, Sarge, and Haggard(Haggard is my favorite), and they make the story worth while. From their personality mix between each other, to the dialogue they speak. I found myself laughing and chuckling to them as I fought off waves of enemies. I highly recommend this game for under $10 dollars due to the fact that multiplayer is dead...shame.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game :]",
            "review_score": "1"
        },
        {
            "review_text": "Ive already played 100hrs+ on bad co 2 on the 360. The camapaign is phenominal! the personality of your squadmates is awesome, the commentary is some of the best ive heard (and full of laughs), the weapons are ALL fun to use..  the multiplayer (in my opinion) is the best i have ever played! the maps feel like the right size, the different classes each have their strengths and weaknesses... i could go on for days about how awesome this game is!  the one thing i will mention that takes this game has BULLET DROP (gravity effects your bullets trajectory).It does take some getting used to, but it makes the game that much more in depth once you get it down.   so... if you want an online that is team focused, squad based FPS thats a LOT of fun and a well crafted camapaign, this is the game for you! what're you waiting for? buy it!! now!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game in every way, the graphics are awesome the gameplay is outta this world. Plus its really reliastic, Call of duty is nothing compared to this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the far best FPS game I've ever played. Totally different then CoD where CoD you can just have one person do all the work and the team will win. In BFBC2, team cooperation is very important. If you don't work with your team, you will LOSE. For example in the multiplayer mode 'Rush' in BFBC2 requires you to rush as a team to take out an objective. If you don't work with your team, you WILL LOSE. The whole part of this game is to work well with your squad that you are in. Give them ammo, heal, revive, watch their backs and so on. Unlike CoD, one person can just kill everyone and get the highest score and win the match. BFBC2, points don't matter. Teamwork matters. Also bullets do not fly straight in this game. Gravity applies. Bullets do attend to drop just like real life. Also you get to use vehicles in the battlefield. You can use a tank, helicopter, ATV, UAV, and boats to travel/kill people depending on the map that you are playing on. BFBC2 FTW &amp; Vietnam. :D",
            "review_score": "1"
        },
        {
            "review_text": "my favourite battlefield game  still has a community and even some servers to play on in AUS,",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield.  Don't buy Vietnam DLC, no one plays those maps.",
            "review_score": "1"
        },
        {
            "review_text": "Rocks your socks off!",
            "review_score": "1"
        },
        {
            "review_text": "Its a battlefield game, what more is there to say... Its a great team play game..",
            "review_score": "1"
        },
        {
            "review_text": "'What the ♥♥♥♥ you shooting for?! We're friendlies' BFBC2 Multiplayer player talk :D",
            "review_score": "1"
        },
        {
            "review_text": "This is my experience of the single player campaign.  I'm a bit jaded when it comes to most games; I get bored fairly quickly and rarely finish a single player campaign.  Not so with BC2. One of the best FPS I've played. Certainly better than any of the competition, as well as BF3 and 4 single player campaigns.  Get a solid single shot on a enemy and they are down - no cheap bullet sponge tatics here.  The story line is satisfying, the characters likeable, and the game does not take itself too seriously.  I cant think of another game that gets environmental destruction so right!, nothing like hunkering down behind cover with it being whittled away. At times it looks awesome.  In my opinion the pinicle of modern FPS shooters. I cant remember being so disapointed that I had got to the end of a game.  Time for another playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Thsi game is still good.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best Battlefield game ever.",
            "review_score": "1"
        },
        {
            "review_text": "A great game! almost like Arma and OFP series. The guns kinda suck and it takes like 10 shots to kill some one a times but other than that its fun to play in a squad with your friends on MP!!! ",
            "review_score": "1"
        },
        {
            "review_text": "BETER THEN BT3 BUT ILOVE IT LIKE ME OWN SON THET I DONT HAVE 1000000000/10",
            "review_score": "1"
        },
        {
            "review_text": "Simply The Best Fps Game Ever Made In My Opinion Sad That The Rest Of The Battlefield Series Isnt Close To This Want Proof This Game From 2010 Has A Larger Online Comunity Than BF3 Or Even BF4  Note : Veitnam DLC Offers Very Little In Wepons But It In Its Self Should Of Been A Game Of The Year If You Have Not Played Veitnam You Have No Idea What Your Missing And Had Better Do It Soon Becuase Tho The Base Game Of Battlefield Bad Company 2 Has Untold Servers Veitnam Often Only Has 1   10/10  X_Sarge____   demonknightgameing.com   Hackers Are Almost Non Existent In This Game Even Today",
            "review_score": "1"
        },
        {
            "review_text": "Tuff game:D",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game, probably the best Battlefield ever! Brings back memories from the first Bad Company and gives Battlefield a whole new multiplayer name! I highly recommend this game, especialy for pc/steam since it is cheapest and the Multiplayer servers are much more populated than on console servers! Of course there are some minor bugs, but that shows that the game is getting older, as you can see in some of the textures failing to load properly, but otherwise graphics are surprisingly impresive even for today! Except for some graphical issues, it is not enough to take away the amazing Battlefield: Bad Company 2 experience! 10/10! 5 Stars!",
            "review_score": "1"
        },
        {
            "review_text": "'Go out and buy it. purchase it. exchange your money for this game. What else do you need?'",
            "review_score": "1"
        },
        {
            "review_text": "Better than COD: GHOST multiplayer -_-",
            "review_score": "1"
        },
        {
            "review_text": "Fun up until you unlock all the weapons; then you get tired of doing the same-old same-old.  BF2142 lasted longer for me, as you can have a lot more players in a game, and you've got the Titan gametype, which was extremely fun!",
            "review_score": "1"
        },
        {
            "review_text": "The game series that made envirornment destruction popular. And it's got the Battlefield name and style to go with it it. A must have for any FPS fan. This game is even great offline in single player mode.",
            "review_score": "1"
        },
        {
            "review_text": "This has always been a favorite of mine. It is arguably the best installment in the Batlefield series. For this copy you only need a steam login, and to create a new 'profile' ingame. The destruction is the most robust in this one. Pick it up when Its on sale with the Vietnam expansion pack. The expansion completely changes the game when you want it.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best Battlefield in 2015 and it still has populated servers",
            "review_score": "1"
        },
        {
            "review_text": "Its battlefield, whats not fun about it. Tanks helicopters and grenades everywhere. play it",
            "review_score": "1"
        },
        {
            "review_text": "Generic recommendation to earn an achievment",
            "review_score": "1"
        },
        {
            "review_text": "Beware, there is no Onslaught (horde) mode for the PC version! (The very reason that I bought it for... UGHH!)  Went online and owned a bunch of noobs. Was fun. Still people playing.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for when you want to go to war without actually dying.  10 deaths out of 10 kills",
            "review_score": "1"
        },
        {
            "review_text": "The Best Squad Based Multiplayer FPS, Solid game. Buggy knife. 4.9/5",
            "review_score": "1"
        },
        {
            "review_text": "The best game",
            "review_score": "1"
        },
        {
            "review_text": "Bad Company 2 is an awesome game and in my eyes by far the best multiplayer shooter I've ever played. I played this game for 600hrs on PS3, and I missed it so much after being disappointed by BF3 and especially BF4 that I've purchased it again for the PC.   Unlike the recent Battlefields from BF3 onwards, Bad Company 2 is less complicated and overloaded - and that's what makes it brilliant. I have to admit, I'm a huge vehicle freak and I only play Battlefield to fly helicopters and jets online (although there are no jets in BC2). I never got used to the new Battlefields with all the auto-lock weapons spamming at you and never really enjoyed it much when even jet pilots barely used their guns and relied solely on their auto-lock weapons. In Bad Company 2, there is no such thing as auto-lock. It's all about skill. If someone is better than you, he will get you - not because you run out of flares but because he was faster or smarter. Likewise, if you are better, nobody will shoot you down. That's how competitive multiplayer gameplay is supposed to be, not what the new Battlefields are like. While I concentrate on air vehicles, the same can be said about everything in this game. Every weapon (system) has a certain feel to it and can be mastered in a way that makes you seem overpowered compared to other players. But, since only very few people truly master a class or a vehicle, the game is generally more balanced and predictable, which makes it easier for new players to get a hang of it. You don't just die out of nowhere because someone with a higher rank used a weapon system only unlocked later in the game - the unlocks generally don't make a class better, they just offer you more weapons to chose of and that makes it fun to try out different sets or classes because you don't have to worry being 'underarmed' compared to others.  No matter what your style of playing is, wether you're a sniper seeking out your kills from a distance or a tanker supporting your infantry when taking a base - the series rises up to its full potential only when you play as a team. Bad Company 2 encourages teamplay in a way I've never seen in the more recent Battlefield. I can't really put a finger on why that exactly is, I can only assume it is because classes are more limited and vehicles don't heal themselves that players rely more on each other and work together.  Another thing great about this game are the maps. Not only do they work well with Rush and Conquest, they each have strategies to them and depending on which path to an objective you take you will experience very different gameplay. It's not a random arena in that people run around in circles seeking for the next kill, it's a real Battlefield in which you can flank enemies or directly assault them.   Bad Company 2 is what Battlefield really is about. There are less weapons, less vehicles, less gadgets and the maps are smaller - but when everything works out, when two good teams meet each other and you sit in your attack helicopter being shot at from all sides, evading infantry launched rockets, tanks, enemy helicopters, having to stay back because every player is a threat - even for a helicopter - and you support your team overhead keeping a base clean for the tanks and infantry to take a flag, when you are truly concentrated and the atmosphere so dense you need a break after the match, that's when you will play your best and most exciting multiplayer matches you have ever played.   As this is the PC version, I have to say though that especially the vehicle controls are quite insensitive and everything moves a bit slower than on console. Nevertheless, go buy it and experience the Battlefield feeling for yourself. You wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥in'",
            "review_score": "1"
        },
        {
            "review_text": "Great game but full of 500 ping brazilian snipers.",
            "review_score": "1"
        },
        {
            "review_text": "if you don't have it, then you should",
            "review_score": "1"
        },
        {
            "review_text": "If you are bored and want to do something casual, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Probibly the best game out there right now for people that like realistic bullet flight and large 'camper maps'. I love the storyline too!",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best multiplayer First Person Shooter out there. It's gameplay is almost flawless. I also loved the Vietnam dlc",
            "review_score": "1"
        },
        {
            "review_text": "its very good. The best of what was, back then.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best battlefield games ever made, also the Vietnam expansion is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "If you are interested in hearing what war sounds like, buy this. Can't wait for BC3!",
            "review_score": "1"
        },
        {
            "review_text": "Get this game, you will never regret it =)",
            "review_score": "1"
        },
        {
            "review_text": "worth buying",
            "review_score": "1"
        },
        {
            "review_text": "Still the best Battlefield. Full servers and servers with free vietnam mod. Buy it - just 10 bugs!",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for balance in anFPS this is it. Huge maps, lots of guns and great gamemodes. Its your cheaper Modern Warfare 2 without all the suck.",
            "review_score": "1"
        },
        {
            "review_text": "great game you can fly helicopters and styf",
            "review_score": "1"
        },
        {
            "review_text": "There are a lot of First-Person Shooters out there, but this one is by far my current favorite. The squad-based play, the team-oriented game modes, the level design, sound design, vehicles and weapons; even the way you move through the environment, hurdling low obstacles and crouching for cover just feels right and better than the rest. For $20, you can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game. You know how people say COD 4 made CoD cuz it was so good? This made battlefield. And I would call this better than CoD 4 any day of the week. And the good feeling multiplayer was soo good even after having played Hardline's Beta, BF4, and BF3 I still came back. In addition there is a great single player. Albeit not as good as the first bad company's campaign as this one is a bit more linear, less funny and without a fun boss battle it has an even better story so it is still good.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really good as long as you don't run into any punkbuster issues....for me it was a nightmare. First not compatible with windows 10, so not even single player would work, then when they fixed that, (months after buying) Single player would work but not multiplayer. Reinstall punkbuster again. Add game to list. Finally, 5 months after buying it works.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with amazing sound design, great graphics and gameplay to easily surpass MW2, MW:BO, MoH, or any similar game for that matter. more focused on teamwork and communication, it created amazing experiences, dubbed 'battlefield moments' when played with a group of likeminded people. the only downside being you tend to loose interest once you unlock all weapons, but with the new Vietnam update that should be remedied for at least a few more months. I wholly reccomend this game for top-end computers, especially right now as it is on sale :)",
            "review_score": "1"
        },
        {
            "review_text": "tis a good time... ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Awesome graphics, and good simulation.  ",
            "review_score": "1"
        },
        {
            "review_text": "A classic Battlefield title, with a quite active online community and an amazing campaign. I have been a fan of the Bad Company series since its release and I still find the plot and gameplay much more interesting than newer AAA endeavors. The characters all have unique and interesting personalities and there are enough twists and turns in the plot to keep you intrigued. The gunplay and class customization is some of the best in the Battlefield series and the graphics, environment design, and audio holds up against much newer titles. This is a great game to pick up on sale and one can definitely expect to enjoy the campaign, as well as the multiplayer if they can find an active server with low enough ping (which I didn't find too difficult).",
            "review_score": "1"
        },
        {
            "review_text": "Really good single player.  And you can play 200+ hours of multiplayer without it getting boring. Also got good ladders to play professionaly.  A must get game",
            "review_score": "1"
        },
        {
            "review_text": "The multiplayer is what your here for, although the compaign is pretty killer for a modern shooter. Great game, just make sure you can run it.",
            "review_score": "1"
        },
        {
            "review_text": "The game everyone is playing and with good reason. Epic fun but only for high end rigs per the fully destructible environment. BF lives on!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. So much better than BF3 and BF4! This game is just plain fun and not a chore to play. Best Rush mode experience of any BF game. To me, BF died with this one.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Battlefield 2 but for a fiver it was a bargain ! Get it when its cheap",
            "review_score": "1"
        },
        {
            "review_text": "When I first booted this game up, I had low expectations. Having played other battlefield games such as battlefield 4 and battlefield hardline through origin (logging 783 hours in battlefield 4 and 234 hours in battlefield hardline) I was expecting that I would log no more than 1 or 2 hours in multiplayer, and than go back to battlefield 4 mulitplayer which I absoloutley love. But instead, this game hooked me, I was presented with very well designed maps, excelllent game modes (rush is the best!) and a fully destructable atmosphere. There has not been one tree, or building standing tall that I have not been able to bring to the ground with my trusted c4. Things sometimes got so intense that the guided artillery and mortar strikes would sometimes leave a map with nothing more to look at than a pile of rubble and dead bodies. Then there are the weapons, sooooo many weapons I could barely choose, being a sniper at heart, I equipped the most powerful m95 sniper with x12 zoom and started taking down enemies without hesitation, sometimes ending the round with a 21:3 KD. And I had a whole lot of fun doing it, No engineer, utilizing a turrent, driving a tank, directing mortar fire, or repairing a vehicle, was safe from me. I remember very well enemies in the chat ordering their team to find me, for not one of them could escape me. And now, everday I come to play this game I cant help but be filled with a smile",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic and still keeps me entertained. Would be more fun if I could find people to group with cause I never can get the chat to work.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Battlefield games in the franchise.  The destruction in this game is MASSIVE!  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Bad Company 2 is the best single player Battlefield on PC period. The ragtag squad and dialogue is simply hilarious and worth playing on it's own. Of course the multiplayer is still to this day, one of it's best features also, being Battlefield and unfortunately the last one you can get on Steam before it was moved to Origin.",
            "review_score": "1"
        },
        {
            "review_text": "My all time favorite online mutiplayer shooter. Hands down the best balancing and mechanical design I have seen. The only issue is its age. If only more people played...",
            "review_score": "1"
        },
        {
            "review_text": "Nuff said!!         YouTube™ Video:  Top 10 Reasons Bad Company 2 Was the Best Battlefield&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Straight up the best shooter available in my opinion. The destructable environment adds so much to the game, you have to try it to know. I won't play the 'competing' titles because they lack the destruction. This simply has to become the standard now. I won't settle for less. Very addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Hey look, a shooter that doesn't begin with Call of Duty. That in itself is enough to try it out.",
            "review_score": "1"
        },
        {
            "review_text": "Four words: Great Game, Very Adictive.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! all you need in an epic shooter game :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game brought down by scores of hackers. nearly every server you go to has people hacking taking alot of the fun out of it",
            "review_score": "1"
        },
        {
            "review_text": "May be old... But still Gold. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This was really awesome for it's day.  As time progresses with BF3/4 out do this engine.",
            "review_score": "1"
        },
        {
            "review_text": "There are no open servers for me on multiplayer. Single player is ok though.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good and really cheap battlefield!",
            "review_score": "1"
        },
        {
            "review_text": "Can be played just for campaign, although average story. For multiplayer try Battlefield 4 instead.",
            "review_score": "1"
        },
        {
            "review_text": "Best Battlefield game I've played.  Multiplayer sucks if you live in the US. But campaign was awesome, multiplayer is great (just needs to be repopulated), overall, one of if not the best battlefield game.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Squad Based Multiplayer FPS, Solid game. Buggy knife. 4.9/5",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. I later upgraded to bf4. More realistic than any call of duty.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. I later upgraded to bf4. More realistic than any call of duty.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down, the absolute best multiplayer experience I've had in any game of it's time. Battlefield: Bad Company 2 set a shining example for what online multiplayer should be. Realistic, balanced, classful, 32 player matches in multiple game modes where, in highly competitive play, teamwork and cleverness are necessities, are played on a highly polished, (relatively) bug-free framework that is easy for new players to pick up and play. The class system is well balanced and complex enough to allow customizability without becoming over-complicated. It's no wonder people still play today more than 5 years later.",
            "review_score": "1"
        },
        {
            "review_text": "When it comes to Battlefield games, the best series of all is BC2 + Vietnam. After 5 years of the release, this game still the best. The Gameplay, the teamwork, the map, the weapon, almost everything in BF:BC2 are great! This is the only Battlefield game that survive the EA's Origin Demon attack. Totally Recommend this  9.2/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I bought a new graphics card for this game!",
            "review_score": "1"
        },
        {
            "review_text": "I Bought this game Purly out of nistogia, i thought the game would be neat, cool even like in 2011 on the consoles so i enter the single player campaign good as i remember it, so i tried the multiplayer, WHAT?! 0 servers found as i read previous Reviews bought on the same day as me that states active comunity tons of servers no idea where the multyplayer is at b/c its clearly not on BFBC2 so as far as my knowledge goes its worth the 5$ on autumn sales it has a really Good Campaign but a Really bad multyplayer unless you have 6 friends willing to play on a dime the sprinting is wonky and little bugs like getting caught on nothing the game as it is (5$) is worth getting just for the campaign  i hope there are no active servers just b/c it is Thanks Giving day and every one is home w/ there familys  -Happy Turkey Day Friends  ------------------------------EDIT------------------------------------ There are infact Servers and B/c of that I Upvote this game",
            "review_score": "1"
        },
        {
            "review_text": "guaranteed mouse replacement due to it`s difficulty and experience",
            "review_score": "1"
        },
        {
            "review_text": "Nice! No Origin.",
            "review_score": "1"
        },
        {
            "review_text": "full of camping kids",
            "review_score": "1"
        },
        {
            "review_text": "Hard to play after Battlefield 3, but a good starter to get your feet wet. Still am enjoying it 2 1/2 years later!",
            "review_score": "1"
        },
        {
            "review_text": "beast game but cods better",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game, but there are not much people play it, therefore, we should let more people play it again!!!!and it is really fun!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game for those who are tired and want to blow off the steam. Enjoy it so much.",
            "review_score": "1"
        },
        {
            "review_text": "Glad I decided to wait until it was 6.99, an awesome and great game to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "No origin=Good for me",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield Bad Company 2 still holds up to my expectations. Though todays Battlefield tiltes are packed with all sorts of customization options, this game keeps it simple. A great doesn't take a super computer to play 32 combat. However, there are still issues, the grenade spam is awful and 99% of the players in a server are top rank. My advice is to wait for the next sale where it is only $5. Overall, it's a great game and puts other modern tiltles to shame.",
            "review_score": "1"
        },
        {
            "review_text": "A unbelievably entertaining multiplayer and surprisingly even singleplayer experience.",
            "review_score": "1"
        },
        {
            "review_text": "Still playing in 2016. Best battlefield game so far IMHO  WARNING - the online servers can be few and far between. Usually there are only a handful of conquest servers, but there are always a good bit of TDM and Rush maps running.",
            "review_score": "1"
        },
        {
            "review_text": "MAN UP! BATTTLEFIELD IS NOT COD. STAY AWAY COD PLAYERS! UAHUAHAUHAU!",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game and still one of my favorites!",
            "review_score": "1"
        },
        {
            "review_text": "Battlefield: BC2 is probably one of my favourite Battlefield games of all time. Even though the campaign is quite boring and holds nothing special to it, the reason I bought the game is the multiplayer.   However, because it is so old, the multiplayer is completely abandoned...   So if you want to pay 10€ for a pretty ♥♥♥♥♥♥ campaign, I strongly recommend this game! Otherwise, stick to the newer Battlefield games.  EDIT: Battlefield Multiplayer is still alive. Just couldn't find it",
            "review_score": "1"
        },
        {
            "review_text": "yo yo yo its ya boi me here i think dis game i svery many good cuz here is hgus and better than world at war you know",
            "review_score": "1"
        },
        {
            "review_text": "GG, I've played this for years! Nobody really dies and they just pew - teleport back on the grid. awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Still by far my favourite installment of the Battlefield Series, (most of my gameplay was shoved into consoles in my younger days). Having plugged a couple thousand hours into both Battlefield 3 and Battlefield 4, I still find myself enjoying this game. Graphics still look beautiful and perfectly balanced gameplay in my eyes.  The introduction of level destruction to my child self was sheer brilliance, and is still explosively fun today. While blowing up a house may not be as pleasing to Micheal Bay than bringing down a skyscraper, Bad Company's levolution is centrted more to its tactical use, and makes it a valuable gameplay tactic.  The newer games try to choke us by shoving a stupid amount of weapons, attachments, and gadgets. This game has one tool for any given job, not seven (and the Carl Gustav can do them all). Sometimes less IS more.  Unlike BF3 and 4, where all maps suit all game types in some way, Bad Company 2 harbours iconic Battlefield maps that lend themselves perfectly to game modes like Rush and Conquest, such as Valparaiso.   Before I finish this review, I have to mention the best Battlefield DLC... Ever. Piloting a huey with Flight of the Valkyries blaring behind you, dropping flame weilding troops into thier operation zone is unmatchable. 'So bad ♥♥♥, it even had its own menu.' The different time zone felt like an entirely new game, and I think that's what made this DLC so much better than the rest.  A superb game, untouched by the cruel hand of time, and definitely worth the buy.  11/10 would get cross-map Carl Gustav'ed/Heavy Metal helo spawntrapped again.",
            "review_score": "1"
        },
        {
            "review_text": "'You can shoot people with various weapons'  'You can also perform actions such as jumping and crouching'",
            "review_score": "1"
        },
        {
            "review_text": "Wow, when I bought this I had no idea I'd get World of Tanks in the same package when playing rush xDD",
            "review_score": "1"
        },
        {
            "review_text": "'This is what really happened that day.'",
            "review_score": "1"
        },
        {
            "review_text": "BATTLEFIELD RULEZ! (AG IVEN) I'm impressed with the graphics and love the way the guns shoot,",
            "review_score": "1"
        },
        {
            "review_text": "i love this game but i have problems connecting to the ea server ...",
            "review_score": "1"
        },
        {
            "review_text": "no cover included",
            "review_score": "1"
        },
        {
            "review_text": "I played this game back when it came out on Xbox 360, and loved it ever since. It has great graphics, great combat performance. Everything in this game is what I am looking for in a FPS game. I would totally recommend this to anyone who wanted to play a game where the shooting is like real life, with the bullet drop.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent battlefield game and still better than most of todays Battlefield and Call of Duty titles. Many active servers, including for Vietnam DLC, so finding people to play with is not a problem. Singleplayer campaign brings back many memories and has a good storyline. It is a must have for every FPS fan, and paying 2.50 is worth it 10x over.",
            "review_score": "1"
        },
        {
            "review_text": "Don't like BF3 but like other games? Then this is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Tbh best BF game I have ever played I would Highly Recommend! buying this game.  Yea the Quality is not all good...",
            "review_score": "1"
        },
        {
            "review_text": "Only Good Battlefield 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, very dynamic, lots of weapons, entertaing multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "No Origin! People still play it! Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "The x15 server is alot of fun and it still has a active community.",
            "review_score": "1"
        },
        {
            "review_text": "the best online FPS game made in the past 4 years",
            "review_score": "1"
        },
        {
            "review_text": "Best battlefield game. Has the best maps, expansion packs, balancing and encouragement to play as a squad.",
            "review_score": "1"
        },
        {
            "review_text": "You'll ether die like a noob or live long enough to get called a hacker.",
            "review_score": "1"
        },
        {
            "review_text": "The AI is useless ! 3 other guys to tag along and talk smack to you and pat you on the back You still have to do EVERYTHING by yourself.  The squad AI in Medal of Honor warfighter is so much better !  but it's still a good game ,clunky mostly but still good. I would rather recommend MOH warfighter, Battlefield 3 or any Call of Duty game.",
            "review_score": "1"
        },
        {
            "review_text": "The Bad Company 2 is the best Battlefield so far.  Great gameplay and there are still many active servers. BC2 Vietnam is awesome too.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best battlefield games! and it still holds up for today!",
            "review_score": "1"
        },
        {
            "review_text": "Wish bad company 2 was still played today !",
            "review_score": "1"
        },
        {
            "review_text": "This game was my go to for multiplayer FPS for a long time going back into it after many years it has little to no replay value as a game i enjoyed it very much and sunk many hours into it if you like Military Style FPS and would suggest a playthough its worth a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic (even on my potato) i bought this game only because it was on sale now that i have played it i love it it is very intense and fun ",
            "review_score": "1"
        },
        {
            "review_text": "The last truely great Battlefield game before EA decided to do their own thing with Origin and the disaster that is Battlelog. Simple gameplay and weapon customization, no need to memorize stats about the different grip types or which sight to use, it all is there with no extra unnecessary complications. Sure, the netcode isn't always the most reliable, but I still find a way to genuinely have fun with the goofy elements of this game that never existed in any other Frostbite based Battlefield games. Also has probably the best single player campaign out of all of them too, if that's more your thing.  If you want some more content never released for PC, getting a used copy for XBox 360 or PS3 is relatively easy and pretty cheap. I got a disc copy for PS3 for about $4 from a local game shop.",
            "review_score": "1"
        },
        {
            "review_text": "a nice change from the bf norm",
            "review_score": "1"
        },
        {
            "review_text": "Connected to server. Took AH-64. I kill 2 guys in heli. Gunner kills 15 people. I destroy 2 tanks while he destroyes another heli. Anti Air got my armor to 15%. Gunner still shooting at people. Gunner says 'let's do jihad on that AA'. I land in front of it and both we and AA guy get destroyed.  9/11 would play 'Jihad airlines' simulator again.  Vietnam DLC is not DLC its a whole new game that includes most awesome vehicle of all time-UH 1.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 i have had so much fun with this game. it is a very good game",
            "review_score": "1"
        },
        {
            "review_text": "played 1.1h and got lvl50",
            "review_score": "1"
        },
        {
            "review_text": "I used to play Battlefield 2 as a kid alot, then i didn't play for a while and came back to Battlefield 2-3 years ago, playing first Battlefield 3 and then Battlefield 4.  As i play many games Battlefield 4 became boring after some time, it's a Steam Sale and i decided to buy the game cause it's really cheap and i saw that multiplayer community is still active.  I'm not sure if it's because i played the old versions, but this one feels like best Battlefield game i ever played. Not like it has best graphics, in newer Battlefield games you have more guns to use, vehicles, but simply gameplay, shooting mechanics and everything fits perfectly.   I also think that Bad Company 2 have more maps than Battlefield 4 does.  Anyways, absolutely worth 2.5 euros",
            "review_score": "1"
        },
        {
            "review_text": "Best battlefield entry, one of the first games I used to benchmark my graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Wasted a ton of hours on it but still more fun than BF3. If only there weren't hackers :\\",
            "review_score": "1"
        },
        {
            "review_text": "I Miss you :/",
            "review_score": "1"
        },
        {
            "review_text": "The best battlefield game I have played. Single player campaign is okay, but multiplayer is where this game shines. Good balance on weapons. Doesnt take too long to get all unlocks.  Update 2016: STILL one of the best multiplayer FPS. Bring back Bad Company!",
            "review_score": "1"
        },
        {
            "review_text": "Things were simple then and fun, enough said!",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Battlefield 2 but for a fiver it was a bargain ! Get it when its cheap",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "This game is still one of (if not the) best fps's out there. There is still a decently large player base after 6 years. Get this game!",
            "review_score": "1"
        },
        {
            "review_text": "a nice change from the bf norm",
            "review_score": "1"
        },
        {
            "review_text": "One of the best battlefield games! and it still holds up for today!",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful addition to the Battlefield, it has a few of the aspects that the popular console games have (without the cheapness) but has a lot that makes it a PC game. The environment is my favorite part. Everything is capable of being turned into nothing. Which means that you'll never play one map the same way.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game even if it is a little out dated plenty of servers still up(some people say there are none just go to search and all the servers pop up) get the game its cheap and very much worth the small charge",
            "review_score": "1"
        },
        {
            "review_text": "Get together with another 3 friends, form a 'squad' and go boom the enemy Panasonics. Or you can play as and engineer and shoot Gustavs all over the map. No, rly. Awesome squad-based action with fully destructible maps and lots of veichles. The players camouflage in each skin adapt to the well-built maps. A must-buy. El mejor battlefield de todos chupala COD XD",
            "review_score": "1"
        },
        {
            "review_text": "This is by far my favorite battlefield game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. 'This award is for the game that is just as good today as the day you first played it. Newer games may come out, but it doesn’t matter… you’ll always come back to play this one.'",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "The last modern military shooter that wasnt complete and utter trash",
            "review_score": "1"
        },
        {
            "review_text": "most amazing battlefield !!!",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game because iz the bess",
            "review_score": "1"
        },
        {
            "review_text": "This is Best FPS Game ever",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game i like to play it very naked",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FPS!",
            "review_score": "1"
        },
        {
            "review_text": "IMO, the best Battlefield game DICE has ever made!  Still plenty of active servers for both Rush and Conquest.  The sad thing is, I dont think we will ever have a game like this again. :'(",
            "review_score": "1"
        },
        {
            "review_text": "Haven't had this much fun in years.",
            "review_score": "1"
        },
        {
            "review_text": "OLD BUT GOLD ^_^  (Only punkbuster can be a btch!)",
            "review_score": "1"
        },
        {
            "review_text": "cool game!   ",
            "review_score": "1"
        },
        {
            "review_text": "Amaing story/campaign Characters that you will remember forever Variety of misssions Amazing graphics for its time",
            "review_score": "1"
        },
        {
            "review_text": "Forgot my password and can't do a $hit about it. Well done origin,well done.",
            "review_score": "-1"
        },
        {
            "review_text": "Theres a reason im putting negative, not becuase the gameplay, but the fact after only two hours of total gameplay i can`t log in due to 'This is already in use.' Whenever I have to retry my CD keys. EA has really gone to ♥♥♥♥ and its making me mad, ive spent at least 100 dollars for BFBC2 with Vietnam, Battlefield 3 and Battlefield 4 with ALL DLCs, yet I cant play them due to 'USED' Keys. Im done with EA FPS games.",
            "review_score": "-1"
        },
        {
            "review_text": "For 4.99,I think the story is amazing but when it comes to multiplayer it just went downhill for me so if your getiing it on sale dont get upset for what you have.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game i really like it, until you get a new pc and try to login. that goes fine until it wants a serial key you type it in and it says already in use!!! So basiclly you can only have this game on one pc",
            "review_score": "-1"
        },
        {
            "review_text": "forthe best game ever made you cant find ny wervers with people ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy dlc if you don't know your EA password",
            "review_score": "-1"
        },
        {
            "review_text": "No one is playing multiplayer! i wasted money...",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this ♥♥♥♥♥♥♥t game just ♥♥♥♥ it!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "AWFUL AWFUL AWFUL.  The entire game is grenade spamming. The maps are about 40 yards x 100 yards. You spawn within grenade range of the enemy and there is a class that shoots grenades and also gives infinite grenades to themselves and their team.  Guess what the fights are like!",
            "review_score": "-1"
        },
        {
            "review_text": "Its a really good game but no one plays it :(",
            "review_score": "-1"
        },
        {
            "review_text": "Got a new computer redownloaded couldn't accept my original KEY so you know FU EA  Was fun before but I would play it now but you know I cant get my key :/",
            "review_score": "-1"
        },
        {
            "review_text": "*DONT BUY THIS GAME*  All the servers are dead if you found a server you will get kicked for no reason The servers you find are like max 5people in it  If you want a nice shooter buy BF4 or Hardline",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute ♥♥♥♥ game and not worth $20 at all. Bought the game and Vietnam, they only refunded the game itself and not the expensive-♥♥♥ DLC that doesn't ♥♥♥♥ing work.",
            "review_score": "-1"
        },
        {
            "review_text": "I give the game a 6 out of 10. The storyline is only ok, and does not give you a basic introduction to parts of the game that become integral to the multiplayer side, that you then have to learn by trial and error in the multiplayer pvp games. On the multiplayer side, the specific role and load restrictions mean that you have less ability to tailor your character to your specific desires than other games of this type. However, it is still fairly enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Slipped off a rock, fell into water and died, then my screen went black.   69/911 would reuninstall again.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Servers are all gone wish id never bought it i never got to play ;(",
            "review_score": "-1"
        },
        {
            "review_text": "Disappointed in the lack of singleplayer mode. It's just a long video with short sections to play in. As far as the multiplayer, just the same as other games. It's too bad that graphics weren't as good as the singleplayer mode.",
            "review_score": "-1"
        },
        {
            "review_text": "Lol the Engine is op ! :)  1time when i join the game - 80 fps 2 - 30 fps 3 - 5 max 10 fps 4 - 5 fps  5 - 5 fps 6 - 2-3 fps  Btw im with nvidia geforce gtx 660 (asus) :)",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game today for myself and a friend....only 2 people online. Is that even possible? Feeling pretty cheated...lonely.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, great fun but multiplayer was cut.  Do not buy this game unless you really want to play the singleplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "you can play this game only in 1 pc. if you change your computer you cant enter the cd key, dont reccomend...",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ EA and there ♥♥♥♥♥♥ games",
            "review_score": "-1"
        },
        {
            "review_text": "Can't aim here anym0",
            "review_score": "-1"
        },
        {
            "review_text": "don't buy it on steam",
            "review_score": "-1"
        },
        {
            "review_text": "I dont know whats happening i bought the game and tryed to sing in for the multiplayer it asked for a serial number i inserted the number in to the box and it sayd 'The serial number is allready in use' is this a connection problem or what?",
            "review_score": "-1"
        },
        {
            "review_text": "Perfect example of neglecting a platform",
            "review_score": "-1"
        },
        {
            "review_text": "how can i recomend if my serial key do NOT WORK anymore here at steam i had 123h of gameplay and after OP changed i cant play anymore coz someone still my account and serial numbers",
            "review_score": "-1"
        },
        {
            "review_text": "bought it didnt get cd key so i could not play multiplayer or use the dlc,",
            "review_score": "-1"
        },
        {
            "review_text": "Ive spent the past half hour trying to get this to work and so far no luck. The game does not display visuals and all i can do is listen to audio. No guide on how to fix and completely horrible. *Update* ive now tried updating my graphics driver, it still hasnt worked. I check and my system is fully supported the game is simply unfunctional. Spend your money on something better that actually works when you install it.",
            "review_score": "-1"
        },
        {
            "review_text": "completely dead",
            "review_score": "-1"
        },
        {
            "review_text": "it a good game but it crashes every half hour",
            "review_score": "-1"
        },
        {
            "review_text": "its worse than bf4 and hardline combined",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so bad",
            "review_score": "-1"
        },
        {
            "review_text": "hey just bought bad company 2. played for one hour. then next time i wanted to play i needed the cd key again and it says cd key already in use. can someone help me out?",
            "review_score": "-1"
        },
        {
            "review_text": "I think that the game itself is great the best battlefield game without a doubt however I am not recommending due to a lot of issues with the multiplayer as whenever I try to get into a server it disconnects instantly and I don't think the campaign is worth buying at the price it costs although it is pretty good.",
            "review_score": "-1"
        },
        {
            "review_text": "So the actual game isn't bad, every review will tell you about the graphics, gameplay and how active the multiplayer is and all. All the stellar reviews are why I got this game. Unfortunately they won't tell you what has become of the community and what it's like going into this game now...  In my time playing I'm killed almost exclusively by level 50 snipers.  I think I view the respawn screen more than anything. Because I can't even really play the game because of this I can't recommend it. It seems like the game would be really fun but I couldn't honestly tell you because you're either a level 50 sniper or you're dead.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the BEST FPS ever, BUT probably, you wont be able to play multi here..... Connection issues",
            "review_score": "-1"
        },
        {
            "review_text": "bought this game for the multiplayer, been playing on ps3 for years. game runs like ♥♥♥♥ on my i7 4700.",
            "review_score": "-1"
        },
        {
            "review_text": "I am reviewing this having twice tried to play the game. I find it thoroughly unenjoyable, yet I keep coming back to try it again to remind myself why I dislike it. My only theory as to why I do this is that EA Games has mastered the use of Stockholm Syndrome as a marketing device.  Of the myriad faults I find in this game, the worst offender is the gameplay. You control a soldier who appears to suffer from an impairment of the inner ear. He bobs and weaves in a manner which falls quite short of what I can only assume is intended to be 'realistic'. This bobbing and swaying, in conjunction with the wild bucking of any firearm you so much as point at an enemy, resulted in my experiencing a wave of nausea much akin to that one might experience during a screening of ‘The Blair Witch Project’ or ‘Cloverfield’ ( these being two films I also don't recommend). This sensation encouraged me to try and take cover and move around as little as required, however as you walk at a speed rivalled by the still life paintings of Norman Rockwell (which is to say, very, very slowly) you will likely find yourself holding down the movement buttons out of necessity to keep up with your better balanced compatriots.  Speaking of your teammates, I would like it noted that I find the decision to send a group of people stricken with acute cognitive delay into combat to be highly questionable both in efficacy and ethic. While at first I found their penchant for calling out enemy locations only after being struck by several bullets to be endearingly inept, but I soon realized there were more tragic circumstances as to why my teammates were performing so poorly. This epiphany came to me when I witnessed the entire team hunkering down, unable to progress due to a sole enemy soldier, blocking their way as he stood amidst his fallen comrades. The enemy soldier refused to retreat, presumably due either to his being left in a fugue state after having his peers gunned down before his eyes, or to outright confusion at the sudden cowardice offered by this pack of bloodthirsty operatives he had singlehandedly pinned down behind some barrels nearby. I winced and sported a sympathetic if pained expression when I hear my team speak up,  'Help us out here… I think there's one left!'  I would like to take this opportunity to commend the American military for its equal opportunity hiring practices. It was very clear that these developmentally impaired patriots were doing the best they could muster in the battlefield. It wasn’t their lack of fire support or situational awareness, rather it was their heart and indomitable spirit in the face of adversity that won me over and brought a tear to my eye.   Finally, I would steer people away from this game because of the 'story', told by means of a cut scene every other firefight/10 minutes of gameplay. It would be offering undue charity to pose that the plot 'makes no sense'. Indeed, I suspect it may have been created using a computer program developed in the passing of Tom Clancy in an attempt to generate ridiculous politically charged plotlines for retail media (I have also theorized that Tom Clancy himself may well have been this computer program all along). At any rate, the plot is childishly non sequitur, having the player span the globe fighting Russian troops (!?) to secure a mysterious weapon developed by the Japanese during WWII. All of which renders what are earlier presumed to be attempts at realism thoroughly obsolete.  If you're interested in a different take on the standard FPS, by all means give this a shot, but be warned: The plot, in all probability, was the result of a mad lib, you move about like an inebriated penguin with the gout, and your team offers new meaning to 'special' forces.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS! This game is broken, You literally cannot connect to any games. Everything is completely up to date and it's telling me I have network issues. I looked up the issue and apparently ALOT of people got ripped off by buying this and not being able to play. Hope I saved you $20...",
            "review_score": "-1"
        },
        {
            "review_text": "If you plan on getting this for the single player like I did then don't bother. It seems much worse than the first bad company. The plot is interesting, but the voice acting is terrible. The game doesn't hold up well at all and it isn't fun to go back and play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent shooter, better than BF3 and BF4, even looks nicer because of the colours  Reason why i rate it down: No FoV Slider",
            "review_score": "-1"
        },
        {
            "review_text": "It's just not fast paced enough for me to enjoy compared to other first person shooters.",
            "review_score": "-1"
        },
        {
            "review_text": "bought it and no one is playing it rip",
            "review_score": "-1"
        },
        {
            "review_text": "This is a piece of ♥♥♥♥.... i logged in with the CD key once then i restarted my pc for updates and it asked me for the CD Key again i wrote it and it says 'Serial Key already in use' WTF STEAM?",
            "review_score": "-1"
        },
        {
            "review_text": "Not a very good game. Clunky, for lack of a better word, I've never been a fan of any Battlefield's, but I really don't like this one.",
            "review_score": "-1"
        },
        {
            "review_text": "ok i start it up  i have to put in a huge code  get on vietnam put in another code go in multiplayer join game kicked and didnt even load in ok join a diffrent one i get kicked look at server browser only 2 servers and they are not ea",
            "review_score": "-1"
        },
        {
            "review_text": "MY BATTLEFIELD BAD CAMPONY 2 CAN NOT REGISTER THE ID BECAUSE SYSTEM SAY THE SERIAL KEY REGISTER CODE IS ALREADY IN USE",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe this was a good title at some point in history, but that point has passed us by. Even though I bought this during the summer sale I still feel I wasted my money. The controls are clunky, the graphics lack luster, the multiplayer completely dead, and single player was a campain in my ♥♥♥ to sit through.   If you have $5 to spend on this game, take your money into the bathroom and give yourself a thorough wipe.",
            "review_score": "-1"
        },
        {
            "review_text": "This game used to be the best out there on console. I recently came to PC Gaming to play with my friend and his friends. This was one of the first games I bought, and my friend bought it too. We immediately refunded it because there were ZERO players online. ---If you're buying Battlefield BC2, you're buying it for the campaign; unless you have 10+ friends that want to drop the money to fill up your own server and play pvp.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing Punkbuster anti hacking system is BROKEN! HAppened with my Battle Field 3 Copy and i was hoping the same thing wouldnt happen here. Sadly it did and i couldnt play the multiplayer. Now would i reccomend this game? YES! Its amazing from what i played! But it didnt let me play much of it........",
            "review_score": "-1"
        },
        {
            "review_text": "Huge maps, absolutely beautiful textures, amazing sound and the amount of modes and maps are descent. The only problem is that noone plays this anymore so it would be a waste of money unless you can get a few of your friends to buy it and get online and start a game. Luckily I got it on sale for less than $5 but I dont know anyone who likes Battlefield so I guess Im SOL. Unless you enjoy running around a map by yourself shooting trees or know a few people willing to buy the game then this would sadly be a waste of your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Battlefield: Bad Company 2 is probably the weakest of BF games I've played over the years. The Single-Player is still unfixed, there are too many glitches and bugs that I faced while playing the game that I don't know what's going on. It's a typical play from EA. If they don't bother fixing it, they just create a new game.  Multiplayer is also broke, without mentioning the servers time out all the time.  Worst 5 euros I spent.  0/5",
            "review_score": "-1"
        },
        {
            "review_text": "This is game is dead , go get battle field 4 or some ♥♥♥♥ ",
            "review_score": "-1"
        },
        {
            "review_text": "hate it",
            "review_score": "-1"
        },
        {
            "review_text": "WTF IS UP WITH PAD SUPPORT! want my 3.74 back. not happy",
            "review_score": "-1"
        },
        {
            "review_text": "This game is rubbish, the fact i was able to do the first 3 levels without shooting anyone, Makes the whole point of this game being a fps hilarious.",
            "review_score": "-1"
        },
        {
            "review_text": "everything",
            "review_score": "-1"
        },
        {
            "review_text": "it logged me out and when i logged back in and put in my serial code it was alrdy in use rip",
            "review_score": "-1"
        },
        {
            "review_text": "Cant stand hit detection!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Game's great. but.. Multiplayer can suck my Custard.  got killed by a level 6 over 7 times. ok.",
            "review_score": "-1"
        },
        {
            "review_text": "What a shame, it's just terrble. Completely overrun with Cheaters/Hacls. AIMBOT Hell.",
            "review_score": "-1"
        },
        {
            "review_text": "battlefield is the best. but alot of people have problems with EA accounts, black screen and the game craching. the black screen is easy just put down the details in the setting, if you played a battlefield game befor use your old EA accounts. i dont know what to do with the game crasing to desktop.  Don't buy the game without vetnam. and all in all 8.23€ is no big loss  look at the community befor buying",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this game its a scam No one plays it its ♥♥♥♥ Dont buy it Waste off £15.00",
            "review_score": "-1"
        },
        {
            "review_text": "The worst game I have ever played.Now heres why; first off,the game is only good for those who are high-leveled and are pros at battlefield.If you are someone like me who plays battlefield 4 and 3 then I highly recommend that you keep playing those before you come to this game.Second,everyone runs arround with a OP as ♥♥♥♥ sniper rifle or a type 88 lmg...don't expect any other weapon to kill you.Third,almost everyone doesn't throw down med-kits or ammo-kits or the just don't even play the objective...they just run arround lone-wolfing everything,thinking they are some pro when they don't play the objective.fourth,if you expect 'heavy gameplay' or 'big battles' you better know that NONE of that happens...the 'Big battles' are people hidding in a building with a sniper-rifle and calling in motor strikes on you and your squad-mates...♥♥♥♥♥♥♥t if you ask me.The final reason is that if you SOMEHOW make it through the low levels you get weapons that are OP ♥♥♥♥♥♥♥♥♥♥♥♥s that do so much damage you could kill a elephant,you will rank up so fast that it will be unreal.  I give this game a 3/10,the multiplayer is so ♥♥♥♥in broken that its unplayable... the singleplayer is the only thing to look up to...  IF you buy this game all i can say is.....GOOD ♥♥♥♥ING LUCK MATE!",
            "review_score": "-1"
        },
        {
            "review_text": "Game is ♥♥♥♥ing terrible. Once you spawn you get shot. The weapons have no recoil at all its bassicly just a quick shoot em up games like call of duty. If your looking for a tactical shooter this one is not a good one! I regret spending 5 euros on this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "meant to buy stock market simlater 2016 but got this company instead.. stupid.... &gt;.&gt;",
            "review_score": "-1"
        },
        {
            "review_text": "This game has the most screwed up multiplayer ever. I consider it the worst game I have in my 600+ library for now. And I even wasn't able to launch some games.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of problems, glitches, and bugs, overall not very good :/ imo",
            "review_score": "-1"
        },
        {
            "review_text": "the one good battlefield game. still not good",
            "review_score": "-1"
        },
        {
            "review_text": "I dont see more players in multiplayer",
            "review_score": "-1"
        },
        {
            "review_text": "no one ever plays this game and its massively multiplayer refund please",
            "review_score": "-1"
        },
        {
            "review_text": "  Don't get the game, its dead",
            "review_score": "-1"
        },
        {
            "review_text": "is fun and awsome but no servers ",
            "review_score": "-1"
        },
        {
            "review_text": "cant plai this pice of sht fuks you ea dice",
            "review_score": "-1"
        },
        {
            "review_text": "no players",
            "review_score": "-1"
        },
        {
            "review_text": "It can possibly be fun with friends, but that's the only thing this game has going for it.  If you're down with one-sided maps, unbalanced teams, very situational weapons and equipment and very low weapon damage, give it a shot.  Netcode is very poorly optimized as well, so if your speeds aren't top notch, expect rubber banding and connection issues. That's the dealbreaker for me here.  I can safely say I am not going to touch this game anymore. Keep these things in mind before buying.",
            "review_score": "-1"
        },
        {
            "review_text": "i love this game very much but one day out of the blue i am no longer able to play the game becase punkbuster the games anti-cheat kickes me from a server every time i try to join a game. i have never cheated or anything. i bought the dlc and i think that that dlc was the best ever in any game, also better than the main game. becuase of the anti-cheat kicking me for no reason i have to give this game a negative review",
            "review_score": "-1"
        },
        {
            "review_text": "You'll waste your money on Vietnam pack (nobody plays it as far as I can tell). BUT the basic Battlefield: Bad Company 2 in itself is pretty good for its genre (if you are able to mentally blockout the litter of embarrasingly crass, dumb@ss, redneck comments made throughout).",
            "review_score": "-1"
        },
        {
            "review_text": "If I had a button for 'Meh.' I would spam that button. There's 2 kinds of ♥♥♥♥♥♥♥s in this game. The 'I am level 50 and I have 5 other friends is this game who are also lvl 50' and just griefs. and the hackers. But I can't seem to not play it. I just keep playing it for it's realistic gameplay. Play with friends, or just refund your money. Don't even waste time.",
            "review_score": "-1"
        },
        {
            "review_text": "Punkbuster causes freezing every time I log on, about 5min into the game. There seems to be no solution or patch to this problem. They dont seem to care to fix it, this happens to many others.",
            "review_score": "-1"
        },
        {
            "review_text": "i cant evan play it",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this ♥♥♥♥ing game on Steam. I had reinstall my windows and install this game it say my key is alreay in use.",
            "review_score": "-1"
        },
        {
            "review_text": "Just dont ok, its better on console.",
            "review_score": "-1"
        },
        {
            "review_text": "Took my time and finished campaign in 6 hours. Dense fog nearly ruins the entire game. Didn't dabble in MP, as the game is four years old now, I'm sure it would not have been met with much success. Pick up for $5 or less if you like shooters.",
            "review_score": "-1"
        },
        {
            "review_text": "Getting killed by the ♥♥♥♥ing HAVOC that's in the air 24/7. I decide to pull out my rocket launcher, but OH YEAH THAT'S RIGHT, THE SKY TURNS BRIGHT WHITE SO IT'S IMPOSSIBLE TO SEE THE ♥♥♥♥ING THING. ALL THIS HAPPENS WHILE I OF COURSE GET SNIPED BY THAT LVL 50 ♥♥♥♥♥♥♥ WHO HAS GOT ALL THE UPGRADES AND ALL THE WEAPONS WHO CAN KEEP SITTING IN THE EXACT SAME SPOT KILLING ME OVER AND OVER WITHOUT ME BEING ABLE TO REACH HIM BECAUSE OF THE ♥♥♥♥ING HAVOC STILL BEING IN THE AIR, KILLING ME AND MY TEAM MATES MAKING MY LIFE A LIVING HELL.  I really don't recommend this game if youlike good games. It's not that fun being shot in the face over and over again by the same couple of lvl 50 dudes, already having all the cool equipment.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the best Battlefield Series for me. The maps are just awesome the gameplay is just awesome.  Reason why I downvoted because, there are no more asian servers. However other region like oceanic , europe and NA are still up and running.  If you are not from Asia I recommend this game, if you are.. just get Battlefield 4.",
            "review_score": "-1"
        },
        {
            "review_text": "Well the last level on the story was inpossible then i go to multi player and get 1 shot by 50.cal Veteran player behind our spawn.A+ game.",
            "review_score": "-1"
        },
        {
            "review_text": "had to log again one day and i need to type in my serial key, well THATS ALREADY IN USE EA  SMH",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a huge Battlefield fan, been around since the very first, played every single piece and enjoyed them. (even Heroes, EVEN Play for Free) So I really wanted to love this game and spend 100s of hours with it having fun the same way I did with the others. But it turned out I sadly just won't, because on all servers the ping is just unbearably high, thus ****ing up the enjoyment. My internet is great, like &lt;30ms constantly, the game also says that the majority of the servers are around 30, but when you enter you got like between 200-999ms! Not just you, everyone! I've been searching for solution but I have not found anything. If you'd buy it for the singleplayer, I'd say go ahead, it's great, btw the game IS great, mechanics, gameplay, sounds, it's ***ing marvelous. But if you want to experience the online battlefield I suggest you to buy Bf3 instead. (assuming you have not a poweful pc if you consider buy BC2)",
            "review_score": "-1"
        }
    ]
}