{
    "app_id": 24980,
    "name": "Mass Effect 2",
    "release_date": "2010-01-28",
    "developer": [
        "BioWare"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Sci-fi",
        "Story Rich"
    ],
    "achievements": 0,
    "positive_ratings": 10675,
    "negative_ratings": 542,
    "price": 19.99,
    "description": "Recruit. Explore. Control.Two years after Commander Shepard repelled invading Reapers bent on the destruction of organic life, a mysterious new enemy has emerged. On the fringes of known space, something is silently abducting entire human colonies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/24980/header.jpg?t=1447352739",
    "minimum_requirements": "OS: Windows XP SP3 / Windows Vista SP1 / Windows 7 Processor: 1.8GHz Intel Core 2 Duo or equivalent AMD CPU Memory: 1 GB RAM for Windows XP / 2 GB RAM for Windows Vista and Windows 7 Graphics: 256 MB (with Pixel Shader 3.0 support) DirectX®: DirectX 9.0c August 2008 (included) Hard Drive: 15 GB Sound: DirectX 9.0c compatible Supported Chipsets: NVIDIA GeForce 6800 or greater; ATI Radeon X1600 Pro or greater. Please note that NVIDIA GeForce 7300, 8100, 8200, 8300, 8400, and 9300; ATI Radeon HD3200, and HD4350 are below minimum system requirements. Updates to your video and sound card drivers may be required.",
    "recommended_requirements": "OS: Windows XP SP3 / Windows Vista SP1 / Windows 7 Processor: 2.6+ GHz Core 2 Duo Intel or equivalent AMD CPU Memory: 2 GB RAM Graphics: ATI Radeon HD 2900 XT, NVIDIA GeForce 8800 GT, or better recommended DirectX®: DirectX 9.0c August 2008 (included) Hard Drive: 15 GB Sound: DirectX 9.0c compatible",
    "reviews": [
        {
            "review_text": "I am Commander Shepard and this is my favorite game on steam",
            "review_score": "1"
        },
        {
            "review_text": "In this game you can: - punch a journalist - headbutt a Krogan - friendzone a sociopath - fight and risk your life for the loyalty of your ungratef... erm, best friends - party hard with Asari in da club - buy a fish and a space hamster - use extremely valuable and ancient artifacts as paperweight in your office with the space hamster  Ah, you can also epically save the galaxy in your free time",
            "review_score": "1"
        },
        {
            "review_text": "Compared to Mass Effect 1, Mass Effect 2 is equally as amazing. It lost a little bit of the RPG feeling, however, with the combat improvements, it makes up for it greatly. The cover system is a lot better and the skills are just a lot easier to use, especially when it comes to the squadmates. The player would just have to press Q or E to make that specific squatmate use a power. The music is stunning, as always. If you like Star Wars KOTOR or anything made by BioWare, you will love Mass Effect. 10/10 'Report to the ship ASAP. We'll bang, okay?'",
            "review_score": "1"
        },
        {
            "review_text": "i played this game for 15 hours straight and i do not fear death",
            "review_score": "1"
        },
        {
            "review_text": "I'm Commander Shepard, and this is my Favorite game on Steam",
            "review_score": "1"
        },
        {
            "review_text": "Cannot romance the Geth.  Still cannot romance Rachni Queen.  -9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "We have to give everything, even if that means our lives. We will stop at nothing, we will fight for the lost.    (If you haven't played ME 1 do it, everything has so much more meaning if you played ME 1 first. The combat is a chore but the story is SOOOO worth it.)  PS: Drinks are on me Garrus",
            "review_score": "1"
        },
        {
            "review_text": "The Mass Effect series is one of the best (If not, then it is the best) series that I have ever played. With phenomenal music, gameplay and a magnificent storyline. If you have not played this game, I highly recommend it. If you have not played it and have no disire to play it, you're dead to me. Though the third installation of the Mass Effect series felt like it was lacking something, I enjoyed it. All in all, buy the games. It will be worth your money! :)",
            "review_score": "1"
        },
        {
            "review_text": "A vast improvement over Mass Effect 1, combat flows well, music is excellent, gameplay is great, story is decent.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an interesting approach to a dating sim.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's",
            "review_score": "1"
        },
        {
            "review_text": "Easily my favorite Mass Effect (I love them all)  It's an amazing trilogy and a must play for anyone who hasn't yet.",
            "review_score": "1"
        },
        {
            "review_text": "whatever your opinions of EA are, this is still arguably the best ♥♥♥♥ing game series ever. Purists might say that they changed too much going from ME1-&gt;ME2 and i'd say for the better. Gameplay isn't as clunky as in ME1. Story flows better. Better Charecters etc. This doesn't mean that me1 is a bad game at all! ME2 is just a tad bit better.",
            "review_score": "1"
        },
        {
            "review_text": "For me Mass Effect 2 (as well as Mass Effect 1) is worth playing because of the characters. Getting to know everyone and then learn everyone's background is such a great idea. Most players can find a connection with each character. You really care for them and it's devastating if any one them dies. The story itself wasn't really good, but it's these characters that made the story work. Mass Effect 2 is set in a richly detailed world on the brink of destruction. It's a must-own for science fiction fans!        My Shepard 2&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "'I can't hear you, I'm getting a lot of bulls**t on this line.'  10/10 would renegade again.",
            "review_score": "1"
        },
        {
            "review_text": "romanced garrus. he was a nerd. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic. Feels like Star Wars and Star Trek had a baby and called Battlestar Galactica for the christening.  Would be better if Bioware and EA made the DLC available instead of hiding it on hard to reach pages, with stupidly high prices and never ever putting them on sale.",
            "review_score": "1"
        },
        {
            "review_text": "one of the greatest games ever",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite game ever. The mass effect saga knows how to make you feel, I can tell you that. ME2 is probably the best of the trilogy, with an amazing gameplay, lot of content, and a few cool DLCs (but expensive). If you buy it during steam sales, it's totally worth the prize.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, definitely a personal favorite. Only complaint is how BioWare/EA decided to sell and price the DLC.     ",
            "review_score": "1"
        },
        {
            "review_text": "Play this ♥♥♥♥, its better than school.",
            "review_score": "1"
        },
        {
            "review_text": "Sir Isaac Newton is the deadliest son of a ♥♥♥♥♥ in space!",
            "review_score": "1"
        },
        {
            "review_text": "the mass effect trilology is a masterpiece. its one of those games/series that simply cant be copied, its perfect in every way. theres so much to do, so many choices to make, so many planets to explore, and its one of those games that will give you a true experience that many games fail to do.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I would get immersed into the game world so much. And that I will care about game characters that much. In short - my best sf RPG experience so far - I just love the characters and I already have multiple playthroughs after me. I dont think I will ever get bored with this game.",
            "review_score": "1"
        },
        {
            "review_text": "The essential link between Mass Effect and Mass Effect 3.   Mass Effect 2 is less focused on the general story background, but puts building a team and relationships into the focus of its story line. Apart from the introduction of the 'Collectors', there's isn't much added to what has been learned about the reapers in Mass Effect 1.  Mass Effect 2 is best enjoyed with an imported save game, giving away bits and pieces about what happened to all the colorful persons the payer met in the first game.   Combat has been drastically simplified, giving way less emphasize on building the character and outfitting them with gear. With speed of the encounters picking up, the tactical impact of squad utilization has been dropped seomwhat in favor of putting the player's reaction time more into focus. It's not necessarily a bad thing, but won't appeal to those who wish for a less hectic approach to combat.  While enjoying ME 2 greatly at the first time, I personally didn't find the second playthrough of ME 2 as rewarding as it felt for ME 1, because of the rather thin story development. While building relationships with the NPCs feels rewarding, it comes somewhat short in terms of depths. Less squad mates with more character development would have been preferable.  Bottom line: Essential to (re)live the trilogy, but feels slightly like a stretch for those who already know about the dramatic developments of ME 3.  PS: Don't miss updating the game with a HD texture modification! Due to technical limitations the developers did include low res textures only! The screenshots I have taken showcase HD textures for all squadmates.    IMPORTANT:      Despite being published by EA, Mass Effect 2 DOES NOT require Origin to play. BUT: You are able to register your Steam copy of ME 2 at Origin as well, which enables you to download the DLC you're already eligible for by purchasing the special edition of the game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever relived a digital dream before. Well this is one of them. Yes This is one of them.  Defenedly worth playing and worth the time enjoying.",
            "review_score": "1"
        },
        {
            "review_text": "The combination of story/choice elements with the RPG and team-battle systems easily makes this one of my favorite games and game series. Buy it, play it, you will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2, I can't describe how much i love this game. It's the second chapter of the epic Mass Effect series. It's the best sequel and one of the greatest games made of all time, which continues the epicness that Mass Effect 1 had. BioWare did a really great job, everything is done well! Fantastic unique characters, awesome atmosphere, great story, beautiful well-made world that you will get into, improved gameplay and combat system.   I highly recommend Mass Effect 2 and the whole Mass Effect series for every gamer and fan of RPGs. If you liked the first game, then you should play this one. I have finished the game many times, and I will gladly play and finish it many times again!  One of the greatest games ever made and A MUST-HAVE FOR EVERYONE!",
            "review_score": "1"
        },
        {
            "review_text": "Well, clearly one of the best games i've ever played. I'm a huge Mass Effect fan. So much to do in this game. Awesome characters, story, dlcs, gameplay, soundtrack and voice acting. Ending is just cherry on the cake. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If theres any commander out there, shepard will be my favorite.",
            "review_score": "1"
        },
        {
            "review_text": "This game will ruin your life as a gamer. Nothing will ever live up to the excellence of Mass Effect, and you can only play it for the first time, once. Play it, enjoy it. Nothing can compare.",
            "review_score": "1"
        },
        {
            "review_text": " rating: worth buying at full price",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game got more and more into it as I played. A fine balance of game story/ lore with fast paced action scenes and superb Characterisation.   I love the feeling of uniqueness in the game too where you can make personal decisions which alter the game path and pass onto the next game, really stunning, so happy these games exist and I finally decided to play them. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Never in my life have I been as immersed in such a solid and breath-taking gaming experience. Mass Effect truly brings something new to the table. From dialogue with character, to romancing Miranda ( omg &lt;3 &lt;3 ), to the cyberpunk dirty streets and the wild club of Omega, the beauty of the Citadel and planets, I felt like I was there and I was immersed the whole way.  12/10: A must play.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played the Mass Effect trilogy you owe it to yourself to get it and play it. Mass Effect is my favorite game series of all time, and ME2 is the greatest game of the trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "I should go / 10",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 was the first game I ever played where I really felt like the hero. Being able to choose your own dialog during gameplay gives this game a very personal experience for everyone who plays it. I can't get enough of this game. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "MaleShep is BestShep",
            "review_score": "1"
        },
        {
            "review_text": "Although I'm late to the party, the whole ME trilogy kept me glued to my screen, challenged me and made me go through an emotional rollercoaster. It catapulted itself from 'a game I've heard of' to 'top favorite/best game I've played so far'.  It's the only game that made me want to restart from scratch the minute I've finished it.  I give it a 100/10.",
            "review_score": "1"
        },
        {
            "review_text": "I've always wanted to ♥♥♥♥ an alien.",
            "review_score": "1"
        },
        {
            "review_text": "What i can say about that game?That game is Perfect and Amaizing! Everytime i worried about heroes in cut scenes at final mission.(Cuz i wanted safe my team) In this game you can have Quarian girlfriend! and now time for stats: Graphic 10\\10 Story line 10\\10 Romance....10\\10 I recomended this game.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, great story just hated how i couldnt unlock or buy everything without painfully grinding so i modified content so it was more enjoyable. Also how you need to check thew area before pushing forward in a mission for items because most areas you cant go back and only certain ones ask if youre ready to leave. Another thing is that combat movement and cover abilities like most are annoying and buggy. Ill get lifted and stuck on a box or have enemies shooot me through walls. also 3rd person aiming covers critical vision sometimes. (all these problems before mods) but overall really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Literally the best game ever. Its like every good thing about every scifi series ever in a fantastic gaming experience. If you want to go on your own greatest space adventure, look no further.  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing characters, voice acting and great story make the Mass Effect series a must play.",
            "review_score": "1"
        },
        {
            "review_text": "The great continuation of the Commander Shepard's story, the great continuation of the Mass Effect game. In this game BioWare improwed their battle system, continued storylines from the first game and created new ones, and made storyline more developed. The only thing became worse - now there are not so much ways you can develop your Commander. Most of times I played this game it was not license copy, but after all playthrows even I bought this game. If you played the first Mass Effect game, you must have and play Mass Effect 2. If you didn't - you still will be pleased playing this game. But for better experience - play them both. All RPG- (and not just RPG-) players must try this story - it becomes legacy of our era.  Amazing game series. 9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "More powerful and refined than the first. Every gamer in the galaxy should own and complete the Mass Effect trilogy several times. It's by far the best game series ever made.",
            "review_score": "1"
        },
        {
            "review_text": "The only game that managed to beat the Half-Life 2 as my favorate game of all time spot.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of my favourite games yet",
            "review_score": "1"
        },
        {
            "review_text": "I was really not very impressed by this game but I had to keep playing more and more of it. I never got to a real challenge that made me scream and laugh and smile while playing so I just stopped when something better came out. It was more of the slouched in the chair at 3 in the morning staring and drooling type of game. If you like this type of team power cue point game you should play The Bureau X-Com, it's exactly the same mechanic but in a different world and not as hot looking.",
            "review_score": "1"
        },
        {
            "review_text": "Almost a flawless game. Great story. Great characters. Great interaction. Great gameplay. Great graphics. Great style. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game you should play it has a great story great combat system and great characters one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME ",
            "review_score": "1"
        },
        {
            "review_text": "Legendary, just take my word for it.",
            "review_score": "1"
        },
        {
            "review_text": " My personal review for Mass Effect 2.",
            "review_score": "1"
        },
        {
            "review_text": "The second installment of the ME franchise, and another all-time favorite of mine.  The gameplay, which was the flaw of the previous ME, has been massively (hue hue) revamped, making it a more enjoyable shooter, although (and is mostly the case in higher difficulty settings), you'll find yourself digging through the multiple layers of protection your enemies have (Biotic barrier, armor and shield, some enemies combine two if not 3 of them), but this is where powers shine. Much like the first installment, the game has both tech powers (hacking, burning, things like that) and biotic powers ('super-powers' if you want), you MUST make use of these powers in a smarter way.  The inventory management part has been for the most part removed, all that is left for you to do is simply chose your squadmates' weapons and yours, and customize your own armor (you can only change how your squadmates' armor looks like now, and there ain't much choice). The whole weapon modding mechanics has been scraped as well, ammunition mods are now powers inherent to your class (if it has any), and weapons can be upgraded through research. Same goes for the skill trees, their size has been greatly reduced which allows for a greater understanding of what is what and what does what. With that, the game is a lot more simplified, perhaps for the best.  The storyline and storytelling remains awesome, and the fact that choices made in the previous game get carried over is just great.  In conclusion another hit by Bioware. Do keep in mind that you'll have to count at least 30 hours + (if playing on Insanity, and if you give enough of a damn about the storyline) in order to complete this other epic journey. Also, it is best to have played the first game, not just because you can shape up the world of the games to come, but because you get a greater understanding of what's going on, who's on and of course... What is what.  Hell, it's a must! Why play this game in the first place if you don't give two ♥♥♥♥♥ about the story.  ",
            "review_score": "1"
        },
        {
            "review_text": "The  Mass Effect  series is Bioware's greatest masterpiece, in my humble opinion. Its writing and cinematic narrative are unparalleled in gaming. The combat improved as the series went on, and the story consistently maintained its level of quality. Player choice has never been the same since the  Mass Effect  games. No two players' Shepards are the same, and it is worth playing the series multiple times to see how different situations would play out with different choices.  My biggest complaint has little to do with the game itself, but how DLCs are distributed. If you get the Steam version, you have to make an account on Bioware's social site, buy them, download and install them manually, and hope that you never have to have Steam check the integrity of local files. I recommend getting all three games in the trilogy pack; you know where I am talking about.  Reasonable price: $20.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game when it was cheaper than $20. It is a fun game none the less!",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game. I played through it twice, easily could have played through it 10 more times (just didn't because there are so many games to play). 10/10.  This is Commander Shepard, and this is my favorite shop on the Citadel.",
            "review_score": "1"
        },
        {
            "review_text": "I played all three games, and words cannot describe the experience I had with the Mass Effect games. I don't think any other game will live up to the expectations I now have because of Mass Effect. If I could relive any part of my life, it would be playing this series again.  Cannot reccomend these games enough. If you like sci-fi, RPGs, a fantastic story, unforgettable characters, or an overall amazing experience: give these games a try. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. Incredible storyline, amazing graphics (especially with HD mods), believable characters, great dialogue (for the most part), enjoyable gameplay, and the perfect musical score make this game into a deeply emotional experience. And that, my friends, does not happen very often.",
            "review_score": "1"
        },
        {
            "review_text": "The second, and in my opinion, the best game in the Mass Effect trilogy.   Improving upon the first game in every way, but NOT dumbing down many gameplay elements, it introduces a new, dramatic, exciting story full of unpredictable twists and turns, making it look like a spectacular, highly interactive space opera movie.  The driving sections around barren planets from ME1 are gone (and replaced with planet scanning, and new driving sections if you own the appropriate DLC), even trivial sidequests have great direction, and seem important even though they do not tie in directly to the main story line.   I loved the introduction of clearly Lovecraftian horror elements in the story, something that the third game completely ignored. The Reapers, ancient enemies of all sentient life, are basically intergalactic gods, dangerous even when destroyed, their huge spaceship-like bodies able to brainwash would-be explorers millenia after their 'death'. It feels you're fighting truly unknown and horrifying adversaries, which gives the game a very unique atmosphere.  The characters are unique and believable, dialogue is well-written and interesting, and it's hard to leave the game once you've started playing.  Playing ME1 is pretty much a requirement prior to playing ME2, though- after all, it is a continuation of a great storyline.  The end is well-rounded, and even though it implies a sequel, it doesn't leave you hanging from a cliff, so to say :)  Recommended!   P.S. Getting the DLC for this game is a relatively hard process nowadays, thanks to EA's greedy, unoptimized and ham-handed decisions. Basically, you'll have to activate your ME2 copy on Origin, buy DLC on Origin, download them through Bioware Social website, and install them manually after installing (and running) ME2.   Why would you do all that?  Some DLCs (such as the Arrival and Lair of the Shadow Broker) have story-critical content, along with additional quality gameplay, which adds a lot of new content to the game. If you turn out to be a real fan of the game and hooked on the story of Commander Shepard, you WILL need to play through these additional stories, as they cover some moments heavily referenced in the sequel, Mass Effect 3.  EA's way of selling DLC means they NEVER go on a sale, so be prepared to dish out some serious cash for them (individual DLC prices can be several times higher than the price of the base game!!!) and only purchase them if you're REALLY interested in the story.   Also, you can safely ignore the 'equipment' DLC, as they are really only a money grab, selling you variations of weapons or cosmetic 'upgrades' to your team for real money.",
            "review_score": "1"
        },
        {
            "review_text": "If you like shooting things and following missions/side missions exploring space and on your missions. Amazing graphics even for low. Great story. I got this when it was on sale for five bucks. It is worth every penny. For 20 bucks. Worth. Every. Penny.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, don't forget to feed the fish.",
            "review_score": "1"
        },
        {
            "review_text": "do you hate yourself? wasn't clannad and stuff enough for your poor heart? then look no more!!",
            "review_score": "1"
        },
        {
            "review_text": "I want to kiss a salarian and this game didn't deliver that but its still good i cried a lot  10/10",
            "review_score": "1"
        },
        {
            "review_text": "potentially the best plot, gameplay and story i have ever experienced in a game. Ah and the characters, the soundtrack... A masterpiece in short",
            "review_score": "1"
        },
        {
            "review_text": "There was a point where I hated what was happening in this game. Not loathed, because then I would've stopped playing. But I *hated* it. Not long after, I loved what was going on in the game so much I weirded myself out a little. (What Bethesda does with locations, Bioware does with characters.) So play the first game. Import your save file. Brave EA/Bioware's site for 'the arrival' and 'the shadowbroker' DLC/expansions. And prepare for an amazing emotional ride.",
            "review_score": "1"
        },
        {
            "review_text": "mass effect 3 requires installation of origin lol gg series i hope they paid you enough",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favourite of the three, Great characters, good story, and nice combat mechanics. Just don't get too attached to anyone if you dont read strategy guides (spoilers!)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best story/shooter games out there 10/10 must be played in your lifetime",
            "review_score": "1"
        },
        {
            "review_text": "If you like shooting things and following missions/side missions exploring space and on your missions. Amazing graphics even for low. Great story. I got this when it was on sale for five bucks. It is worth every penny. For 20 bucks. Worth. Every. Penny.",
            "review_score": "1"
        },
        {
            "review_text": "More than 6 hours looking for resources in the planets. For lately discover that I will not spent half of them.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "My favourite game together with Mass Effect 1. Would buy 10/10 anyday",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is my first entry to the Mass Effect trilogy, but i got to admit, that it has an amazing atmosphere! Moreover, this game does a good job in story telling, which helps the player to keep up easily with the events in the first Mass Effect. Gunplay is amazing with the combination of both RPG-element with third-person cover-based shooter!",
            "review_score": "1"
        },
        {
            "review_text": "I feel that comparisions to the original game is necessary when writing a review for Mass Effect 2, so here it goes:  1. Like Mass Effect, Mass Effect 2 is a story-rich 3rd-person FPS where you play as Commander Sheperd. However, the story was not as captivating as ME1 and it seemed that I spent more time assembling and gaining the loyalty of my crew than on the main campaign, which in retrospect was pretty short and straightforward.  2. The combat system was an improvement from ME1, where it was much easier to utilise abilities (both yours and your squad's) by binding them to the numerical keys. However, combat got really repetitive after a while. The hacking/ bypassing system was also an improvement, although mostly unnecessary and also repetitive.   3. Anyone who played the original game would remember the dreadfully long elevator rides. Thankfully, ME2 had smoother transitioning and also higher quality cut-scenes which were very enjoyable.  4. Like in ME1, it was possible to flirt/ develop relationships with a number of crewmates, although you would have to complete your target's loyalty quest before you could express interest. However, I was disappointed when Liara (ME1 character) could not be recruited into my squad, even though she did make an appearance in the game.  I gave ME1 a rating of 9.5/10 only because of the elevator rides. While ME2 was a good game, it seemed to be lacking in story and also its descent into repetitiveness.   8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Now I may be putting myself in the way of a lot of insult when I say Mass Effect 0ne didn't appeal to me, but then I played two, and that changed everything. Immediately you are thrown into a dramtic beginning and within the first ten minutes are shocked, and from there it only gets better. Every character in the game feels deep, every area has a purpose and the combat is much better than the original. Well, not much else to say I guess, get the game. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "do you hate yourself? wasn't clannad and stuff enough for your poor heart? then look no more!!",
            "review_score": "1"
        },
        {
            "review_text": "I cant stress how good this game is it is my favorite franchis of games its so good its hard to comprend i would reccomend buying the series and playing it through. The mass effect universe is so complex and beautiful with its many species, planets, options and choices, speaking about choices it allows you to put yourself in the game which develops how do you say a actual friendship with the characters in the game which is something i will never get over.   I have logged about 50-75 hours into the series because i am shepard a commander in the alliance because i have made the choices that define me and my actions.  So please do yourself a favor and play the series because this is the best series there shal be in the gaming franchise. P.S You could think this is overhype but this is truley how i see and im writing this because my head is still stuck in the mass effect universe.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, truly one of the best the pc can offer. Sprawling location, very fun gameplay and one of the best lore/story i ever experienced. In my top five, easily. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Main plot makes no sense at all, right up to the final boss fight, but the suicide mission and the NPC side quests are some of the best mini-stories in a computer game ever. Snappy combat and better character models make for a fun game, so long as you eschew the planet scanning.",
            "review_score": "1"
        },
        {
            "review_text": "Great experience on XBOX 360. Probably 5 full playthroughs. The story and characters are immersive and believable. This game feels weighty with great attention to details.   I have not played it on PC yet due to a lack of controller support, and the overpriced DLC which much be purchased externally. Gosh, at least there should be a discount for having already owned all of the DLC on XBOX. Still hoping...",
            "review_score": "1"
        },
        {
            "review_text": "love it great game good graphics for its time love it i cryed when i played this and 3",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you ejaculate all over your keyboard... Twice... At the same time... Every 5 minutes...",
            "review_score": "1"
        },
        {
            "review_text": "no game franchise has ever come this close to striking the perfect balance between rich storylines, interesting characters and core RPG elements.  this game has also aged far better than its predecessor",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay, combat, story, characters, dialogues... Everything about this game is pure art. A masterpiece.  11/10  'I had reach, but she had flexibility.' G. Vakarian",
            "review_score": "1"
        },
        {
            "review_text": "Incrediable. Epic. And amazingly made. Mass Effect 2 is an excellent-well written story taking place right after the first Mass Effect. This game gave me the feeling that I am leading a team of professional soldiers, scientist, and assassins on mission so dangerous that chances of survivale are slim. This game among the Mass Effect trilogy shall not be forgotten, And I hope to see the Mass Effect Universe expand further in the future. 10/10  ___________________________________________________________ /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\ ---------------------------------------------------------------------------------------- &lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;THE PROTECTORS BLADES OF APPROVAL&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt;&lt;&gt; ---------------------------------------------------------------------------------------- \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\ ____________________________________________________________",
            "review_score": "1"
        },
        {
            "review_text": "I don't like being Super Errand Boy. Mass Effect 2 did away with this tedious sniffing the ground and picking up thing stuff - for which I am grateful.",
            "review_score": "1"
        },
        {
            "review_text": "Epic. One of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Even better than mass effect 1. Gorgeous, deep character interaction (with dating possible of course), and plays perfect with wine.",
            "review_score": "1"
        },
        {
            "review_text": "I like the feeling of going against the impossible odds... Maybe the best game in the trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't already played the Mass Effect franchise, i'll say right away go out and play through all 3 of the series. You won't regret it. The IP has an amazing universe thriving with interesting lore and an outstanding sci-fi storyline with amazing voice acting, combat, exploration and visuals. Mass Effect 2 is the best out of the three so it's a must-play. The DLC is some of the best addons in videogames.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest role playing games I have ever play. - Gripping story - Lovable characters  - Expansive world to explore  Also, would recommend playing the first game and carrying you character over for the best experience. ",
            "review_score": "1"
        },
        {
            "review_text": "Best of the best Sci-fi RPG, great gameplay, many DLCs and perfect story.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with great ending.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game just too easy. Hardest thing about game is the ♥♥♥♥ing Jack &amp; Miranda fight....",
            "review_score": "1"
        },
        {
            "review_text": "Can it wait for a bit? I'm in the middle of suicide mission.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game series so far!  I'd recommend this to anyone who likes games with great story , voices , music and of course awesome gameplay! I played out Mass Effect one 4 times, Mass Effect 2 7 times and Mass Effect 3 8 times (2015.10.08 - will edit if anything will change EDIT: 2016.11.23 - +1 trilogy playthrough) I'd spent around 250-300 hours in the series so far (more on Origin) and still love to come back and play the game again and again!",
            "review_score": "1"
        },
        {
            "review_text": "The game has its drawbacks to be sure, and I wouldn't say it breaks any new ground in our generation. And yet, I find myself drawn back to this game over and over. It may simply be my innate need to play as every single class, but it's hard to argue with my 170+ hours of gameplay. If you like sci-fi and space marines, this game is worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "If you thought the mass effect games coudnt get better YOU WERE WRONG. This game improves sooo much of the original game and even makes mass effect better. Amazing graphics, spectacular story, loveable characters, much better gameplay. So much to do. 10/10 would rate this their favorite game on the citidel again.",
            "review_score": "1"
        },
        {
            "review_text": "A much much better game than ME1, the combat is improved, the dialog options and character development is smoother, the weapon system and upgrade is hugely simplified. It's massive, fun, and a little emotional, depending on who you develop relationships with.",
            "review_score": "1"
        },
        {
            "review_text": "To put it simply, this is one of the best games ever made. The memorable characters, great story, and interactivity of this game really made it memorable. The combat is much better than in the original game, that getting into fights was less of a chore and more fun. Every single mission felt like it had a purpose, and the lack of the cut and paste mission design was much appreciated. I did every character's loyalty mission so they wouldn't die because I was invested in the characters. This game also had some of the greatest DLC I have ever played. Lair of the Shadow Broker was incredible, and the other DLC was fun too. Overall this game is the complete package, and a good sequel always surpasses the original. Mass Effect 2 does just that.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've ever played. Amazing story, characters,graphic, voice acting, soundtrack. I recommened this game for everyone because Mass Effect 2 is best combination action and RPG with awesome story.",
            "review_score": "1"
        },
        {
            "review_text": "probably the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Another fantastic game from Bioware. Every bit as good as Mass Effect 1, if not better. The RPG system isn't quite as flexible/complex as the first one, but shooting elements are more fluid.   UPDATE: Just finished playing Mass Effect 3. You can't get it here on Steam due to a tiff between EA and Valve. If you haven't picked up any of the games, find the Mass Effect Trilogy on any of the other game stores. As far as the game, it was fantastic as expected. Some people complained about the ending, but I though it was great and a fitting end to Shepard's story. Just be sure to download the free extended edition DLC with the expanded ending, which I think is already included if you buy the trilogy.   My only gripe is the cost of the DLC. This is one of a few game series where I actually bought all the DLC, because the game is so good, but also because they never release a 'Game of the Year' edition that includes all the DLC. For ME3, it feels like they doubled the price of DLC, but it is not as good as the ME2 DLC. One of the DLCs costs more than I paid for the entire game, so I passed on it. Not happy about that, but I'll just watch them on YouTube.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2, the game which makes you want to keep replaying until you get the right ending. Indeed, this game is about choices, and the wrong choice can lead to some of your members dying. ME2 has an amazing storyline, which is 10 times better than what the first was, with lots of replayibility even after you have completed it. Just everything about this game is amazing! Even though the first Mass Effect was in my top 10, it has now been replaced by this. It made me feel really bad with some of the choices I made so I had to go back and replay it to change what I had done. I would recommend this game and would give it a score of 9/10  P.S: Just be warned, if you have played the first and then go onto ME2 straight after, it takes a long, long time to be able to get used to the new controls.",
            "review_score": "1"
        },
        {
            "review_text": "Very nearly the full kilo  I enjoyed Mass Effect 1 but was only able to give it 3/5 due to some pretty annoying flaws. I’m glad to say that most of those flaws have been eradicated in ME2. Gone are the endless slow elevator rides. Gone are the tedious, bouncy buggy rides on dull, lifeless planets. And gone is the ridiculously complex HUD. What hasn’t changed are its strong points, which remain in the storyline and RPG elements. Once again there is a detailed and compelling story along with many side plots and missions, which are more diverse and creative than those in ME1. The voice acting is excellent throughout as are the character models and animations, which are fluid and naturalistic. Graphically it’s very good for a four-year-old game, although there’s little in the way of physics, which is a shame. The combat has also improved, although it remains rather clunky and lacklustre compared to other games. The Mass Effect franchise is clearly about providing a rich and developed universe in which to place the player and to give that player a full-bodied RPG experience peppered with combat and action along the way. And in this respect ME2 really delivers. If not for the so-so combat I would have given it 5/5, but as it is I give it 4/5.",
            "review_score": "1"
        },
        {
            "review_text": "Best game so far always will find time to play it",
            "review_score": "1"
        },
        {
            "review_text": "better than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME GAME! Don't miss it!",
            "review_score": "1"
        },
        {
            "review_text": "Mass effect 2 is a game about space Jesus who saves entire human kind, but can´t keep his pet fish alive.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the series if you ask me.  + Good story + Exciting missions + Lovely characters + Good graphics + A world that you're invested in  - Limited customization. - Few choices in talent point placement. - Almost no open world elements; very little exploration. - Not many choices in weapons or tactics. Throw, lift, shockwave and singularity are also very weak since all kinds of protection block the effects. You have to push through the shields/barriers/armor to use those abilities effectively, and by then you can just keep firing until the enemy's health bar is gone.",
            "review_score": "1"
        },
        {
            "review_text": "So far we can tell that Tali would not smell nearly as bad as those filthy humans; her sweat's a drug and a natural performance enhancer. As for additional odors, that would be determined by MHC's and pheromones, which are too large and complex to even consider estimating with the limited knowledge we have at this time. Though the production of MHC's is also a key component of our immune system, they might be considerably less common for quarians. Remember, this is largely speculation, and I am by no means an expert; I'm merely an enthusiastic amateur. So if you think there's anything you would change or debunk in my theory, be my guest. I'd be eager to learn.  But if you do agree, here's a question for you: licking Tali or licking Thane?",
            "review_score": "1"
        },
        {
            "review_text": "Play it. Now.",
            "review_score": "1"
        },
        {
            "review_text": "I'm Commander Shepard and this is my favourite game on the citadel.",
            "review_score": "1"
        },
        {
            "review_text": "Belated review. Refer to my previous recommendation for Mass Effect 1 for general thoughts on the series (short version: get it). Continuing on that, Mass Effect 2 takes everything that was great about ME1 and makes it better, and at the same time completely fixes everything that was wrong. It's the perfect sequel. The only slight misstep in ME2 is the tedious planet mining mechanic. But aside from that, I really have no complaints about this game at all. It's an absolute must-play if you have any interest in the upcoming ME3. One of the coolest aspects of the series is that all of the choices you made in ME1 carry through to ME2, and will further carry through to ME3... and there are many choices to be made. It becomes a very personalized game. I should also mention that there are a number of DLC missions available as well, which are worth checking out (especially the last one). And with that, I shall say no more, as this is a game that must be played, not written about.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME EVER MADE.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is akin to the awkward middle-child in a family where its older sibling is more creative &amp; intelligent and its younger sibling is more athletic, excelling in anything action-oriented.  ME2 is quite fun and its story engrossing, but it doesn't stand out in the context of the Mass Effect trilogy.  In ME2 you can see and feel the unfortunate 'EA-ification' of the series. There is a copious amount of DLC that ranges in quality from the Horse Armor-esque 'Alternate Appearance Packs' to the stellar 'Lair of the Shadow Broker'.  Overall, a solid game that suffers from being the weakest in an incredible series.",
            "review_score": "1"
        },
        {
            "review_text": "A flawless game that incoporates a tight narrative story to keep the player constantly wanting to play more.",
            "review_score": "1"
        },
        {
            "review_text": "In almost every way, an improvement on the original. The updated combat system was a little hard to get used to, but ultimately, it was probably also an improvement.",
            "review_score": "1"
        },
        {
            "review_text": "Truly Amazing 2: Truly Harder.",
            "review_score": "1"
        },
        {
            "review_text": "God. Damn. This game is ♥♥♥♥ing good. Buy it you ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game to any and all players who like games with a good story.Even if you dont like how its futuristic.I own mass effect 2 and 3 and bolth are fantastic games with exciting battles,hard choices and a killer story.",
            "review_score": "1"
        },
        {
            "review_text": "Does it get better then this?",
            "review_score": "1"
        },
        {
            "review_text": "I played this game a lot when I was younger (like, A LOT), so I returned to see if it's still is like the old times, and boy if it isn't. This is one of the few games I have next to no complaints about.   - The graphics are beautiful, possibly better than some games that come out today  - The combat is exciting with the big arsenal and variety of powers - All characters are interesting, especially your squad members; they are not just hollow shells that follow you around, they are actually people you begin to care about, and your decisions decide whether or not they will remain loyal to your cause - Dialogue is simple, but effective, and actually feels like you're talking to people, not just some NPC - The space travel aspect is awesome - There are so many alien races to interact with - THE ♥♥♥♥ING CODEX  I can't say anything about the story, since I haven't really completed it yet, but I am definitely liking it so far.  So yeah, buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "The second instalment in a legendary game series. There is no way for this game to be better. None. It took everything from the first game and took it to the next level. While playable without the first game it does strongly affect story depth. The detail that comes out due to past actions is truely impressive. Play this game. And its precursor. And its sequel. (the third game)  As with the first game I have only one real con with this game: Mass Effect 3 is not available on Steam. Not cool EA.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games I've ever played; the different experience of both genders and different classes gives this game great replayability! Just make sure you've played the first one, a near equal in experience, to create your own unique Shepard!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. I enjoyed this one the best of of the 3.",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece is the best way to describe this game. I could talk forever about how this game hits every mark, but I will just leave it at this game is a masterpiece.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Very good must buy with Mass Effect 1. Thank.",
            "review_score": "1"
        },
        {
            "review_text": "This may have been the best purchase ive ever made in my life",
            "review_score": "1"
        },
        {
            "review_text": "My favorite of the Mass Effect Trilogy. With interesting game play elements that separates itself from most shooters and an AMAZING story, this game is a must play and is part of one of the most innovative game series of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Guns, explosions, giant robots, space monsters, alien sex, psychic powers, dance clubs, alcoholism, animal cruelty, skintight clothes, comedy, drama, this game does it all.  Seriously though, this game is beautiful and dark. You will feel feelings.",
            "review_score": "1"
        },
        {
            "review_text": "First Review in my career. I have more like 60 hours as the internet went out for a while as oppossed to the 40+ that is shown. I have played through the game 2 times once (and most recently) as a male Shepard and another as a female Shepard. Copnstructive critism is wlcome as well as advice because I plan to review some of the other games I have. So please, enjoy.   Disputably, this is the superior game in the Mass Effect Series. Personally I hold this opinion, but do NOT just buy this game. In order to get totally immersed in the story and develop connections to the characters, purchase the original Mass Effect and possibly Mass Effect 3 (but use Origin at your own peril).   The story itself is extremely engaging. Traveling the galaxy and assembling a suicide squad is interesting as each character is found in different places and missions associated with the character's loyalty to you are also unique. I never once came across a moment when I thought 'I've seen this before'. While enemies are mild repeats (you will be fighting armored aliens, sheilded ones, boss ones, and various types of mechs), the NPCs are always very interesting even if they are flat.   The role-playing aspects of the game are handled well. When starting the game, you can choose between 6 different types of combat styles which range from being a pure biotic (using magic), an infiltrator (turning invisible), and being a soldier (regular combat grunt/bad***). Each of those classes have 5 upgradable abilities that either give you interesting ammo mods or special attacks like slamming a person to the ground or turning invisible for a short time. On top of that once you chose your character class, you can select another special ability from a list. Every time you level up, you recieve one point for spending it on abilities. Initially, all of them cost 1 point and once they are upgraded, they incriment (go up) by 1. At the end of the skill bar for each skill you can chose a significant bonus ability. For an ammo mod, this could be giving yourself an upgraded form of it or allowing your entire squad to partake in it. The latter thing I find most useful because I tend to hang back and pick off enemies from range and let my squand soak up most of the enemy fire.   Speaking of combat, I love this 3rd-person style. It leans heavily on cover and utilizing the abilities of your allies. You can direct your 2 squad members simply pressing a key (one per member). To use your abilities and your squad member's, you hold down a button and select the ones you wish to use. Your team can deploy at most 3 separate abilities (one per person). Aside from that, regular combat with guns is point, aim, shoot. You can hold a maximum of 6 guns, however this depends on which class you pick in the beginning. The adept class doesn't even carry weapons while the soldier can hold all 6. You can have a sniper rifle, assult rifle, shotgun, speical weapon (missile launcher,mini-nuke launcher, etc), pistol, and submachine gun. Acquring of these weapons range from finding them in levels, recieving them, and making them. There is melee combat, but it is rather sloppy. If you were to use it (which I don't) you leave yourself open to enemy fire which will destory you if you aren't in cover even on the easiest difficulty. The enemy A.I. is capable of flanking, putting down suppressive fire, and charging indescriminantly, so it always keeps you on your toes. Sometimes the enemies get stuck behind obstacles, but the pathing for them are solid. They use cover and can go through your suad members quickly.   The graphics are exceptional even for a game from 2010. The textures are good, but in combat it really shines. The laser beams, mass-effect bullets, and ammo mods are a sight to behold when they are flying everywhere. The sounds are also good. The soundtrack is also pretty good.   The place where this game falls short is the map system. Like from the previous game, you travel across the galaxy using Mass Relays. That is carrried over, but the actual physical exploration of planets and moons from the previous installment is scraped in favor of a mining minigame which is tedious to do for an extended period of time. It is also worthwhile though as the resources you get from mining is used for upgrades which are found in the course of missions and from purchashing them.   The upgrades are rather significant improvements which range from increased damage to reduced cooldowns to even additional equipment for the ship. I highly recommend consulting your team for ship upgrades because they will make the difference between life and death in the late game. Some do cost a lot of stuff, so you will get aquainted with the mining monstrosity.   However, this is overshadowed by the characters you interact with. While I briefly went over this in the beginning, I feel I must describe how great it is. Every character on your ship have a story, opinions, and remarks about your progress. And yes, the infamous romance options are back and 'better' than ever. I will let you explore them to see for yourself because I have not explored them yet.   The lore is wonderfully explained to you through the codex, accessable via the pause menu. As you interact with more things, the condex articles explain everything.   Overall, I give this game a 9 out of 10. The strong character customization/upgrading system teamed with the strong graphics, good teamwork elements, and the immaculate NPC collection are what make this game a must-own for Sci-Fi fans. If you are bored by generic first-person shooters and want a more engaging combat system, this is a good game to look into.   I know that there is a multiplayer to the game as well, but I have not exlpored it. I would suggest skipping it. To me, this is a single-player experience through and through.   So long and good luck.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. The fight system is slightly improved from the previous fight, but still felt as a mini-game to me, to increase the game time a bit. The story is great though and it feels as if your decisions have a real impact on the story.",
            "review_score": "1"
        },
        {
            "review_text": "bought this game thinking it included all DLC. i was mistaken. all in all, i've spent money on worse.",
            "review_score": "1"
        },
        {
            "review_text": "great game spent hours on it and am still finding more to do on it",
            "review_score": "1"
        },
        {
            "review_text": "great love this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games ever made. Probably the greatest sequel as well. This game has it all. Solid gameplay. Graphics are wonderful. Audio is superb. The characters are interesting and engaging. The story is freaking amazing. A very cinematic game. Replayability is insane, too. I would definitely play the first game before playing this one, despite how the original Mass Effect hasn't aged well. AT LEAST use the Genesis DLC to understand the story form the first game if you choose to miss out on the original. (if you do, you are wrong.) BUY THIS GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is the biggest and most well made of the Mass Effect games. It is massive. Unlike in ME3, where you can only freeroam a couple of tiny spots around the Citadel, in ME2, you can free roam around massive spaces in the Citadel, Illium and Omega. I was incredibly surprised! In ME3, you have like 3 choices of where to go in the Citadel, such as Earth Embassies, Presidium Omertia hospital and some other crap like that. In ME2, there is a massive space. Why did they leave out places like Illium?? Anyway, this review is about Mass Effect 2.   THIS GAME IS HUGE! I cannot stress that enough. Following up to Mass Effect, Bioware dramatically improved the character relationship system. Your squadmates now offer loyalty missions which you can complete and they begin to trust and respect you more. I found this quite awesome. To be honest, the ME series is the only series that made me feel any sort of emotion that wasn't sadness and frustration. I enjoyed making friends with virtual aliens. I enjoyed traveling halfway around the universe to get ♥♥♥♥♥♥ on by Collectors and their fancy ♥♥♥ indoctrinated swarms of zombies.  At times, the gameplay can be very repetitive. Kill some enemies, move forward, loot bodies, hack systems ,move forward, one of your squadmates says something, move forward, kill enemies, interact with an enemy, gain paragon or renegade. kill them.  That is the basic formula to most missions. I am also pleased to see that they improved on the Normandy piloting system. In ME1, the Normandy was shown as a icon. Now you can see it, you can fly around using the mouse and you can scan planets with an awesome scanner that shows you mineral readings.  The storyline advances forward, introducing new friends, enemies and continuing the story of the Reapers and you stopping them.  Great game, best game in the series, what more can I say?",
            "review_score": "1"
        },
        {
            "review_text": "10/10 sex w/ weird insect bro",
            "review_score": "1"
        },
        {
            "review_text": "Your team will have to be strong, their resolve unquestionable.",
            "review_score": "1"
        },
        {
            "review_text": "ME2 / ME3 possibly my favorite series I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "The best Sci-Fi game that i've just played, deep and non-linear story, i reccomend it if you played the first game. and must play the third one too.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect and Mass Effect 2 are excellent games and well worth the purchase. The games have a wonderfully crafted story which is very well presented. The characters are memorable for their stories and are very well acted.",
            "review_score": "1"
        },
        {
            "review_text": "This game was gifted to me, but I would've definitely bought it myself. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best sci fi series to come out of gameing ever is mass effect. and Mass effect two in my opnion is the best one in the 3 games.",
            "review_score": "1"
        },
        {
            "review_text": "Tali Zora is my waifu and that's it.   Also, the best sci fi action RPG on the market with interesting characters and gorgeous graphics. Don't miss this one unless your idea of gaming is P2Win shooters.",
            "review_score": "1"
        },
        {
            "review_text": "I can't even begin to describe how much I love this series. If you like a good story, amazing visuals, dynamic characters, and overall just good RPG sci-fi games...yeah this is the game to get. Especially if you've played Bioware's previous games and enjoyed those. This game is so worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has turians in it.  Best game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay: 8/10 Sounds: 9/10 Multiplayer: N/A Graphics: 8/10  Additional Comments: + Import ME1 characters + Final mission crew selection + Interesting plot/missions + General improvement over ME1 - Clunky cover system - Regenerating health - Less weapons and armor compared to ME1  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this to die hard Mass Effect fans.  But...BUT...coming from a console background and switching to the 'master race'. I cannot fathom how much I hate mouse/keyboard for 3rd person games. Most if not all PC games have controller support (Microsoft controller drivers, not xpad) but for whatever reason Bioware DOES NOT want you to play the PC version of this amazing game with a controller.  Bioware bring controller support to ME &amp; ME2  We'll bang okay?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best action (RPG) in the game world history. 25 hours of fun with open hide n shoot action and dialogues in universum and its colonies full of races with their own motivations. Be guardian or renegade. Make decision which changes future.",
            "review_score": "1"
        },
        {
            "review_text": "I`m commander Shepard and this is my favorite game in the galaxy.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Sci-Fi RPG it's a shame that right after this was made BioWare just suddenly vanished and we were left without ever getting a sequel",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best game of the series. One of the very best Sci-fi RPG sagas to date.",
            "review_score": "1"
        },
        {
            "review_text": "You can punch news reporters and get away with it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Characters and their interactions with each other. As you build your team, you stumble upon some very interesting people. The best aspect of the game was getting to know everybody between missions, hearing their stories, and delving deeper into the Mass Effect universe. Especially Garrus with all of his calibrations, which is everything he wants to talk about. Then there’s the fact that you’re able to romance some of the crew members. I really felt like I was invested in and torn between some of them. Whether it was flirty Kelly, shy Tali, or (insert your description of) Miranda.  -Loyalty and crew missions. One of the reasons why you do care about the crew is permadeath. In order to get all of the crew out alive, you have to go on some loyalty missions. As you get to know everybody, crewmembers will tell you that there’s some personal problem they would like solved. Loyalty missions were the best kind of side mission because they weren’t random things to do. There was a sense of purpose—gaining a more meaningful understanding of the crew. All of them played out like a good movie should, with everybody gaining some type of character growth and a solid resolution.  -Combat is decent and can be challenging. While it reinvented the wheel, I wasn’t bored senseless. In fact, there were a few parts that I had a difficult challenge. This one part of saving Garrus took me at least ten or so tries. Mostly due to the fact that enemies will use cover effectively, (generally) work as a group, and at times actually attempt to flank you.  Mixed Bag: -Dumbing down of rpg elements. It really seemed like there was much less of a focus on weapon diversity and putting together your gear. While it doesn’t kill the game, it certainly does make it more confusing when you buy upgrades. The upgrades tell you that it will do XYZ% more damage, but there’s no indication of how much that would be.  -Interiors seem a lot smaller. The Citadel is pathetically tiny compared to the original. And the same could be said of a lot of the places you visit. They felt small and often very linear. I really wanted to explore some of these places, but to no avail.  -No Mako, scanning only. The Mako is totally gone, which also felt like exploration was severely curtailed, and has been replaced with scanning planets. While this may on paper sound like getting resources has been streamlined—it isn’t. I did have this Minecraft mentality of collecting everything everywhere, but It’s downright boring a tedious after the fifth or so planet that you’ve scanned in the same system. By the time that you’re done with scanning every planet you’ll have an astronomically huge collection of resources. Overall: Mass Effect 2 is a masterpiece. There was not a lot of time that I felt like I was disengaged from the story or that I was bored doing ho-hum quests. The mythos of the universe, the strength of the characters, and the story is what elevates this game into what I consider to be near legendary. 9.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic, easily one of my top 10 favorite games of all time, but ♥♥♥♥ if it's DLC packaging isnt confusing as hell.  My recommendation: But through steam when its at a steep discount, but only buy the basic version. Then buy the DLC through Origin, where it gets discounted from time to time. Otherwise you'll have a rough time getting a good deal on a 'GOTY' edition of ME2",
            "review_score": "1"
        },
        {
            "review_text": "You know, sometimes I wish I did a little more with my life instead of hanging out in front of places selling weed and ♥♥♥♥. Like, maybe be an animal doctor. Why not me? I like seals and ♥♥♥♥.  Maybe an astronaut.. yeah. I'd be the first ♥♥♥♥♥♥♥♥♥♥♥♥ to see a new galaxy.. or find a new alien life form...   and ♥♥♥♥ it  ppl'd be like, 'there he goes. homeboy ♥♥♥♥ed a martian once..'   Well you can do that in mass effect buy it",
            "review_score": "1"
        },
        {
            "review_text": "Hell,One of my most beloved games ever,played it like some 200hrs in pirate version,its like drug,you want more and more. You Want to hear Garrus saying 'Calibrations' You Will Want to stare at Miranda`s ♥♥♥ and ♥♥♥♥ You Will Want to be Renegade/Paragon You Will Want To Play this Game Over and Over again.",
            "review_score": "1"
        },
        {
            "review_text": "Really Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I'm honestly shocked that so few of my Friends own Mass Effect 2. It's a crime.  My first impression of this game came about 10 minutes after I'd completed the original Mass Effect, as a sequel, this does almost everything right. The classes are much more specialised, so you'll get much more enjoyment out of multiple play-throughs, but the real gem is the people. From interesting one-off characters to familiar squad-mates, every one of them is well designed. Each of your squadmates has unique details that the game explores.  I really don't want to say any more. If you haven't played this series already, do - if you like video games at all, especially RPGs or shooters - you will love the Mass Effect series. Honestly the best game series I've played, ever. Stop reading this, play Mass Effect.  Sure, the game has a few flaws - what games don't? In the long run, you won't really care - you'll be immersed in the game's world, and that's exactly what's so good.  P.S. Jennifer Hale's voice acting is miles better than Mark Meer's - if you've only ever played this through once as DudeShep, you owe it to yourself to have a second run as FemShep - there's enough different choices to make it totally worth your while.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me poop uncontrollably. ",
            "review_score": "1"
        },
        {
            "review_text": "Three words.  1) Get 2) It 3) Now",
            "review_score": "1"
        },
        {
            "review_text": "I just finished my first playthrough of ME2. I could immediately see why it's such a classic trilogy in the gaming world. It added a lot of dynamics to the game which were and still are somewhat uncommon in shooters. It's very similar to a Gears of War combat system, except with the ability to pause, review your surroundings, and command your allies to execute attacks or movements. That alone added an element of strategy with an excellent and unique cover system.  The character development was also a treat. I was always running to my allies, wanting to talk to them and uncover their individual opinions and pasts. Each character was likeable in their own way, having a bit of complexity that never fit into a stereotypical mold, and a visual appearance that was distinctly original.  The dialogue options and the lasting effects of choices, especially if you've played through the first game, made the dialogue more interesting. It's funny because the actual gameplay is seldom affected by your choices, much to the regret of many ME3 players. Without the expectation of some grandiose conclusion based on my actions, I was able to see the game for what it was. It's a present experience, not a build-up, and it does it extremely well. Like a good book when you're done, you wish that you have that anticipation back that you had as you read it. It just proves that the story was very compelling.  My only complaint was the research gathering system, which took several hours of my time for a very uninteresting mechanic added ot the game. I'll admit that it adds a reward for exploration in that sense, and it gives a way to interact with things in space, but the very limited scope of it is more of a time sink to justify the upgrades. I'd rather that the more you used certain characters, the more experience it added to the upgrade. It would've given incentive to change up your party members and have them use different weapons.  I'd personally give this game a 8.5 / 10. I really enjoyed the story and gameplay, which were captivating enough for me to actually finish a game for once, I felt like the experiences were linear, although very original and interesting, full of background information on each character and always relevant to some immediate concern. I never wanted to get something 'over with.' Every part of the game was enjoyable (except a certain Hacking mission in a city). I think that if the game incorporated some of the last mission choices into other areas of the game, it would've made things feel a lot more dynamic and weighty. Excellent game, looking forward to ME4!",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best game's I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best game's I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "CUTE ROBOTS CUTE ALIENS NOT SO CUTE ETHICALLY GREY PRO HUMAN ORGANISATIONS",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my all time favorites! Great story and great character developement and personalitites. The gunplay is okay but it is cool with upgrades. Do yourself a favor and pick this game up! :D",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! That's all I can say",
            "review_score": "1"
        },
        {
            "review_text": "this game is great they improved so much from the first one its got a good story with interesting lore",
            "review_score": "1"
        },
        {
            "review_text": "I have heard of the mass effect trilogy but i never played it untill now and i have to say this is actually really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Arguably one of the best RPGs of all time? Bioware really revitalized the story/character heavy RPG genre.",
            "review_score": "1"
        },
        {
            "review_text": "Conviced an ugly alien to date an even uglier alien...  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 takes what makes the first game epic and expands upon it. More characters to love, and an epic story that despite being the 2nd part of a trilogy is a great standalone as well.   Simply put this game is excellent.  Definitely the Empire Strikes back to Mass Effects New Hope.   Once again, play it. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "The Mass Effect Trilogy is far too addicting. Gameplay is pretty boring, but the plot will capture you. And Bioware's ability to let you choose the plot and consequences throughout is amazing as always.",
            "review_score": "1"
        },
        {
            "review_text": "I'm Commander Shephard, and this is my favorite store in the Citadel.",
            "review_score": "1"
        },
        {
            "review_text": "This game was totally worth the money. The characters, the world, the combat - all these aspects are awesome! 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Your life is not complete without playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "An Awesome game and for 20 bucks definitly worth a try if you arent well known about the mass effect franchise",
            "review_score": "1"
        },
        {
            "review_text": "This is on bad ♥♥♥ game. The best part of this game isn't the combat which is awsome by the way (plenty of alien guts to spill) but its in the character development. No game I can think of lets you develop your character I mean beyond looks and classes but their actual attitude to situations and people you encounter. Like its an extention of you in the game. This game makes you want to try out all the classes and mix it up to create distinctive versions of Shepherd. If that wasn't good enough they added the ability to continue developing your character into the next version. Decisions you make in game one affect you in game three changing the sequence and outcome of the game. A really mature frachise with highly developed gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games you'll ever play.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I am struggling to decide which is a better series... Mass Effect or Half Life, Yes it is that good",
            "review_score": "1"
        },
        {
            "review_text": "Star Trek eat your heart out. Fairwell to Star Wars. It was great knowing you Dune, but there's a new space opera on the block, and it's name is Mass Effect. Interesting characters, brilliant storylines, amazing locations and more than enough action. There's something for everyone in Mass Effect 2. If ME 1 left you tingling, ME 2 will leave you breathless, it is that good. It's a game that you can never get tired of thanks to the sheer number of choices involved, and as such you will find yourself playing the game through over and over again for one reason or another.  Now if you'll excuse me, I have a suicide mission to play through again.  Let's get back to it! ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Lots of replay value, and an extremely large cast of companion characters, including a couple returning favourites.",
            "review_score": "1"
        },
        {
            "review_text": "I have two ME1-3 playthrough, the reason that I'm writing this is not to praise ME1 and 2, there are enough of these type review, and I agree with them. I want to redress the review of ME3, many people's review for ME3 are either saying the game is entirely bad, or saying the story and gaming experience are good but the ending are bad. Note that a lot of these review were write before Bioware released the Extended Cut DLC. This is a free DLC that Bioware made up for their original crappy work, with this, the ending is at least in an acceptable level. Moreover, the game has a Non-free DLC Citadel, which in my opinion is the best one ever. When majority of people say one thing is bad, it's easy for other to simply follow. I recommand people who already finished game 1, 2 and love this series to continue on ME3, and put a closure on the story of Commander Shepard. Remeber, ME4 will be a new story line. FYI, ME3 is not on steam, it's on EA's Origin.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game for somebody looking for emersion into a universe. Certainly looking forward to picking up ME3. 9/10 Only flaw was the story ended ubruptly and I didnt really expect it to be over. Careful with your decisions you make, because they could haunt you later.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most amazing storylines ive ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game builds up on everything from the previous title and thus makes it awesome! The ending is freaking EPIC - had goosebumps all over me!",
            "review_score": "1"
        },
        {
            "review_text": "It's better than life! :D",
            "review_score": "1"
        },
        {
            "review_text": "one of my old favorite games that i still play today .. thank you bioware and thank you steam.",
            "review_score": "1"
        },
        {
            "review_text": "This was a great game, but minor spoilers ahead.   I was kind of disappointed when I lost my origional party, but the remnants I scraped together, along with the new people I found compensated. I cannot recommend this game highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "Basically, you've read all the great things about this game. Sure it's got some issues, but what game doesn't? Basically, if you've never played any of the Mass Effect games, and only ever intend to play one, make it this one. It has the best overall balance in terms of combat, story, and graphics, and is decent to play even if you haven't played the first game (as was the case for me). So you should definitely play this (and then play the first and third because I'm pretty sure you will).",
            "review_score": "1"
        },
        {
            "review_text": "Although it should have been launched as a spin-off, Mass Effect 2 is easily the best in the series. Combining masterfully written dialogue, an engaging story, and a very fluid combat system, Mass Effect 2 will not disappoint. Be as nice or a**holeish as you'd like, the dialogue and characters around you will respong uniquely.   10/10 it's bretty gud",
            "review_score": "1"
        },
        {
            "review_text": "Magnificent. Perfect. So well designed I can't think of a way to improve it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my all time favorites! Great story and great character developement and personalitites. The gunplay is okay but it is cool with upgrades. Do yourself a favor and pick this game up! :D",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best RPG games of all time. If you have not played this trilogy, DO IT NOW!!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but it crashes every time on my computer. I would recommend getting this one on console if you have the same issues.",
            "review_score": "1"
        },
        {
            "review_text": "Got at  {LINK REMOVED}  ♥♥♥.com  for $1.00 USC",
            "review_score": "1"
        },
        {
            "review_text": "Mass effect 2 is a great game, it has good graphics, a great story, a giant world with deepful characters and meaningfull encounters. I highly suggest getting this game.",
            "review_score": "1"
        },
        {
            "review_text": "I can only say I LOVE this game. It is, in my opinion, absolutely glorious in story and design. Admittedly, there are a few bad decisions on the design-side there... but nothing serious.   The combatsystem is rather simple, and I really like the rpg/shooter hybrid type of this game. To be honest, there are quite a few places where it is of absolutely no importance witch dialoge option you choose, but in other places, especialy during the finale, every action has consequences. Even NO action has consequences.  Pro:  +Overall design +story +character design +in some places really great leveldesigns (many different types too). +lots of things to discover +the voiceacting is pretty neat  con:  -hardcore shooter fans will probably think it too easy (I didn´t) -a bug called 'floating shepard' that randomly makes you stuck in mid air or ceilings (had it three times in one playthrough) -facial expressions are sometimes pretty ugly, just put a helmet on shepard, and it´s fine^^ -there are some cities in which I had no clue whatsoever of where I was and where I needed to go.  I strongly recommend it ",
            "review_score": "1"
        },
        {
            "review_text": "great game get mass effect 1 as well play them in order to get the full effect. wish steam had mass effect 3 even tho its my least fav of the 3.",
            "review_score": "1"
        },
        {
            "review_text": "The Mass Effect Trilogy is far too addicting. Gameplay is pretty boring, but the plot will capture you. And Bioware's ability to let you choose the plot and consequences throughout is amazing as always.",
            "review_score": "1"
        },
        {
            "review_text": "'Can it wait for a bit? I'm in the middle of playing through Mass Effect 2 for the 7th time and counting.'",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. played it on the XBox and bought it for PC. Just wish it had controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, great story and characters. Everything you would expect from Bioware. The gameplay from ME1 is expanded and the system for leveling improved. Much recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect! Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Good action game with RPG elements 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "By far my favorite game series of all time. Immersive gameplay, memorable story and characters, and an ending that just makes you want more. Complete character creativity, you can make him (or her) your own. Many different classes to choose from.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I am struggling to decide which is a better series... Mass Effect or Half Life, Yes it is that good",
            "review_score": "1"
        },
        {
            "review_text": "The one game where choices truly count, and determine if all of the characters that you have come to know and love die! It's like virtual Sci Fi Game Of Thrones!   *Go Renegade*",
            "review_score": "1"
        },
        {
            "review_text": "i havent played much of it but its good so far",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the first but still pretty decent",
            "review_score": "1"
        },
        {
            "review_text": "this is a pretty good game i would play it if you like games where you shoot aliens thank you for reading my review of mass effect 2",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the greatest storyline and a very comfortable gameplay !",
            "review_score": "1"
        },
        {
            "review_text": "I played this game on the PS3 and never got to finish it. With the game being on sale, I decided to buy it again. Let me tell you, it is fantastic and I love every moment! Graphics are superb, somehow ME3 looks hideous by comparison! Gunplay is absolutely excellent, the sense of thrill is definitely there and my God, this game just does so much right. Get it and don't bother thinking about it because this game is worth every single penny.",
            "review_score": "1"
        },
        {
            "review_text": "Stripped of RPG elements, this is a disappointing sequel given the premise that was built in the original. It seems the popular thing to do nowadays is turn every franchise into Gears of War or Call of Duty because that's what Bioware did with this game; Mass Effect 2 is effectively Gears of War with a chat wheel. On it's own it would've been an excellent spin-off but calling this an RPG shows what a sad state of affairs the game industry is in. If you played the first you can import your character and your actions from the previous game do have some weight but this also presents the problem of killing the replay value. This is a good squad-based third person shooter but it's no RPG.",
            "review_score": "1"
        },
        {
            "review_text": "What can i say over what hundreds of other internet reviews have said. It's one of the best games and series ever made, and in my personal top 5 games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty excellent. Just stop here and don't bother with the third one",
            "review_score": "1"
        },
        {
            "review_text": "Favourite game series of all time, out of the 3 this would be my top.",
            "review_score": "1"
        },
        {
            "review_text": "This game is epic in every proportion. A must recommendation for a space RPG fan. Very diverse and very engaging.",
            "review_score": "1"
        },
        {
            "review_text": "★★★★★",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. Not sure if the first game was as wonderful, but this is a great game to start your adventure in the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Best mass effect game ever!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the series.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic! For the full experience, I highly suggest the first Mass effet, then import a character into Mass Effect 2.",
            "review_score": "1"
        },
        {
            "review_text": "Immersive story, interesting characters. Over 24 Hours of gameplay. Improved combat, transit, and exploration mechanics  A major improvement over the first.  Again, a great game for players who like complex stories, morality systems, role playing, and so on.",
            "review_score": "1"
        },
        {
            "review_text": "Fun 3rd Person Shooter hard but easy at the same time great game for 3rd person gamers! i recommend playing the first game though before this so youll understand what happened!!!! but other than that its fun to run around being a playuh and all that but you can also be a bad person and kill all your apprenticies!",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that did everything right for a sequal. From the explosive opening, to the surprise ending, this is a must have of the series. Even if you didn't play hte first game to be capable of carrying over important plot choices, it is still a worthy buy, and probably my favorite in terms of storyline, thoguh I do think the third game has better gameplay (Especially their Co-Op mode). Only downfall is the lack of controller support for the PC.",
            "review_score": "1"
        },
        {
            "review_text": "A great game...wish they would sell MA3 on steam....someday.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game of all times! ",
            "review_score": "1"
        },
        {
            "review_text": "An Awesome game and for 20 bucks definitly worth a try if you arent well known about the mass effect franchise",
            "review_score": "1"
        },
        {
            "review_text": "WHY ISNT ME3 ON STEAM!!! :( but awesome game! loved it on xbox, better on PC!",
            "review_score": "1"
        },
        {
            "review_text": "WHY AM I ATTRACTED TO ALIENS",
            "review_score": "1"
        },
        {
            "review_text": "If you're evergoing to buy something from Bioware that isn't Dragon's Age, this is the game. It takse the best elements of ME1 and makes a whole new game out of them. Better in some ways to ME3, even though it lacks some features in the next installment, this game has and will continue, to age very well.",
            "review_score": "1"
        },
        {
            "review_text": "If you have Mass Effect 1 becomes much easier to play because of the imported points. This game is more likely about on making up your own team and having their loyalty points high which require immense amount of time but all is worth it at the end.   Game has better graphics than Mass Effect 1 and as usual a well-developed plot and interesting events + the side quests. :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the most immersive and well designed game I have ever played. 10/10 would bang.",
            "review_score": "1"
        },
        {
            "review_text": "honestly who doesnt love part 2? WHO!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "mass effect 2 is the best out of the mass effect trilogy in my honest opinion",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game to achieve the best ending of Mass Effect3 with importing a character from ME2, but found both the story-, and the graphics to be good -well playable @4k with 780Ti sli-, so it is well worth the promo price.",
            "review_score": "1"
        },
        {
            "review_text": "The Mass Effect games are by far my favorite game of all time. They are incredibly immersive, with just the right balance of cutaways, action, and roleplaying. When I am done with a chapter, I feel like I was a participant in a science fiction movie.",
            "review_score": "1"
        },
        {
            "review_text": "I love playing this game. For mass effect 4 I've rebooted the series. I'm really enjoying the combat elements and how it feels to work as a solid unit by achieving different tasks to accomplish one goal. every moment I'm Commander Shepard I just feel like a bad-♥♥♥.  I definitely recommend this game to anyone who enjoys a gripping story and team based work.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I'm commander Shepard and this is an awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "So please note that there will be spoilers in this review.  Mass Effect 2 is one of those games you can see yourself grow up with. I first played this game on the Xbox 360 in 2010 when first released. It was new to me and wasnt a generic shooter. But I never fully comprehended the decisions aspect of this game, and resulted in me not caring about the consequences. Consider it being that I just wanted to skip the decisions and get to the combat. Now being that its 2014, and I have matured much since then, I wanted to give the game another chance and give it my best shot.  I purchased 1 and 2 on PC (The bundle) and launched 2 because I already beat 1. After playing it for a while, I was deeply involved in the decisions and actually disliked the combat. I wanted to make those high priority decisions, and wanted to strip combat out of the game. But then I noticed that combat was a catalyst to keep you playing. Without the combat, or without decisions, it would have been a generic game. Combat influenced what skills deserved the points from my leveling, what materials I should go hunting for next, what missions I decided to do. Some missions didnt even involve combat, you had to rely on either your diplomacy or force of words. Combat was indeed repetitive at times, but made the game what it was. It was the perfect mix of Action and RPG moments. Hense the phrase Action RPG.  Playing 2 again was a complete shock to me. I have never played a game that made me feel decisions had consequences down the road. Hell (SPOILER) The first quarian you find in the game that hit from the collectors at the human colony, shows up when you are doing the loyality mission for Tali and reacts based on what you did to him. If you gave him to Cerberus he will literally say you are the devil. And that was a good amount of time that passed from the first mission to Tali's loyalty mission. Every decision has a consequence, being good or bad.   Now I dont want to make this extremely long, but please if you have time, and you love RPG's, purchase this game. Just purchase it. Dont forget about the Space Hampster or fishees, feed them or you die.   Rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Game is just awesome. Good storyline and all. Controls might be tricky at the beginning cuz are bit different from ME1 but thats just small detail. Game's totally worth of money",
            "review_score": "1"
        },
        {
            "review_text": "Romance aliens while you rage about how no one will believe you about the reapers despite the overwhelming ♥♥♥♥ing evidence they exist and kill a terrifying amount of husks (ZOMBIES) that run around through out the game.  Also, happy thoughts will fix your facial scars.",
            "review_score": "1"
        },
        {
            "review_text": "this being the first of the installment that i have played I have to say despite some of its more console esc aspects this game it was quite entertaining and enjoyable they story progressed at a decent rate but you can still do the side missions before you get later on in the story all in all it was a fun game and if you like rpg's or a storyline in your games you will like this game so pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "Mostly more of the same as Mass Effect. For some inexplicable reason, some of the basic mechanics were redone, so you have to relearn the interface a bit. Other than that, great fun if you liked Mass Effect 1.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Definitely not overrated, It's been on my to do list for a while and I binged it. Fantastic, dont ♥♥♥♥ up with Miranda though.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is already not fresh enough in my mind to give it the review it deserves.  What I want to say now, is that this game is pretty much top 3 in this decade's games.  The only con i see to it, is how unrewarding space exploration is: I spent a LONG time probing planets, and had over a million resources. And there's nothing to show for it. Doesn't even influence the ending.  As for the characters, they're all really engaging. Characters like Mordin and the reptilian assassin are some of the best-written personalities I've seen in videogames : As flat as they are on the board, as linear as their evolution is, almost cliché, you can identify with them precisely because they don't have polar shifts in personality. Their linearity comes from their own personal life journeys. When you have such a baggage, to make you out to be this personality shape-shifter for the sake of plot evolution is lazier than sticking to the meat and bones of the character.  The only problem I had with this game was that they took the 'let's have ammo in a shooter game' route. I prefered letting my weapons cool-off to having to carry around 'heat sinks'.   Anyways, solid 9/10 game for me.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best mass effects i have played this game series time and time again and will keep coming back this game series is beautfully made where if you lose a squadmate you will actually get emotional because you get attached to these people   A MUST Buy!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of the entire series, but where Mass Effect 2 really shines is the diverse group of people you set out to gather for your cause. Almost all of them are intriguing and likeable in their own way, and the game offers plenty of opportunity to get to know them.  Mass Effect 2's storyline is intense from the very first minutes, and manages to still pick up the pace as you go along. A few of the loyalty missions can drag on a bit, but overall the story is extremely well done. By the time you're getting ready for the final mission, you'll be on the edge of your seat, wondering whether you are capable of pulling off what you've decided to do.  If you haven't played the original game, I would suggest doing so first. Mass Effect 2 offers the option to import your Mass Effect 1 savegame, and you miss out if you decide not to do this. But by all means, play ME2, and then continue on with ME3. This trilogy will always have a place in my heart.",
            "review_score": "1"
        },
        {
            "review_text": "better then the first one and third",
            "review_score": "1"
        },
        {
            "review_text": "ALSO SUPERB GAME. All of the things that you wished ME1 had ME2 HAS! XD I have also played this game twice, cant get anough of my Garrus XD. It makes me excited to play the third installment.",
            "review_score": "1"
        },
        {
            "review_text": "A++ it's literally a perfect game",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game that provides a surprisingly in-depth atmosphere, believable and interesting characters, and enough dialogue options and tough choices to make it incredibly immersive. My only problem with this game is that there isn't enough Garrus. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is a great single player game it can give the player hundreds of hours to play over holidays after works (or after school). It has lots of missions some may be hard or easy but they all fit together to make a awesome story. This game is good for skilled war game players and it has lots of stragity parts so what are you waiting for get Mass Effect 2!!",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever created. Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "huge improvement over first game. Story is really great.",
            "review_score": "1"
        },
        {
            "review_text": "It's a classic and one the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Love it, one of the best, still entertains despite all the playthroughs.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best in the Mass Effect series, I have played many many hours and still enjoy this game greatly, I have played every class both Paragon and Renegade, tried to accomplish every possible combination of actions and I likely am still missing a few possible things but not many.  The voice acting especially for female shep and the rest of the crew is great. The party chatter is entertaining and the combat great.  Highly recomended.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay 9/10 Graphics 9/10 Controls 8/10 Storyline 10/10 Bug-Free 7/10 Replayability 5/10 Level of Challenge 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2:  You are commander Shepard. You die while your space ship (The Normandy) is under attack You revive due to the advanced techonology there is and also because someone wants your help. After reviving you have no idea what's going on, you don't know where your old crew is so you need a new crew.  That's all I'll explain about the story behind Mass Effect 2  Now, let's talk about what you can do In-Game  **Note: When I say people I actually refer to Humans and Alien Races**   The game has a variety of moral options, depending on how you treat people the story changes While you recruit members this moral options appear. Also, your crew might have some issues and things that bother them. You can choose between helping them or just ignoring them. This will affect the loyalty of your crew. You can end up being ignored or being saved from death  Don't judge so quickly, you'll probably encounter people you basically hate because of how they treat you. It's up to you how you react, but I'd sugest to take your time and know them more  You can travel through galaxies, most with unknown planets. Search those planets for resources and maybe you can find even more, things that hide in that planet...  You can't access directly (land with your ship) in all the planets, just in a few but they are very unique depending on the sun  For example, you land in a planet really close to a Red Giant that will probably explode in a couple of years, since the planet is very close to the Red Giant you get radiation damage from the sunlight and your armor gets destroyed quickly (Armor regenerate after a couple of seconds)  I almost forget...Your crew have special abilities, such as fire bullets, ice bullets, controlling robots, pushing people, a shield, being in invisible, etc. Your character has all this abilities too, depending on what class you choose You can bring 2 companions to each mision/city The weapons have an average variety  I think this explains why I'm giving this game a 10/10. There are a lot of things going on while playing. Even emotions, and if you decide to try this game, you are going find out why.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "If this game was a delicous and mouth-watering sandwich, I would eat it. As it stands, I can't so...  0/10 sandwich emulator 9/10 science fiction roleplaying game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rpg's ive ever played playing as mark meer was cool(shepherd) but playing as jennifer hale is a way better experience being a badass. but again this game is a must play",
            "review_score": "1"
        },
        {
            "review_text": "This is the best entry in the series and is a comprehensive fully featured western RPG. The only things that get irritating after a while are mining for planets but if you know what you're doing you can cut the time spent mining down a lot (thank ♥♥♥♥!).",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. A combination of all things good in gaming. You will be hooked in the first 10 minutes. As far as the original Mass Effect, I'm not sure if it necessary to play. You would probably be fine reading the plot online.",
            "review_score": "1"
        },
        {
            "review_text": "I am editing my review after playing the whole game, for reference my first review was a thumbs down.  OK so I started playing this right after playing Mass Effect 1. Getting used to the new controls was difficult at first. It felt the game was less sand box and more scripted. And I kept getting snagged on graphics, to the point I would have to reload. (Happened a total of 4 times)  It took me a while to come around, but at the end of the day - this is a solid game. If I have one (silly) gripe to add, I decided to make Tali my 'love interest' - I really just wanted to see her face ... spoiler alert - they never show it ...",
            "review_score": "1"
        },
        {
            "review_text": "I JUST HAD ...  AND I FELT GREAT!",
            "review_score": "1"
        },
        {
            "review_text": "I loved playing this one SO much! Im a huge ME fan. I wish the third would have been as good.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games that I ever played. Loved the story, the fact that your actions can change the flow of the story and the outcome. I strongly recommend this game especially if you are a Sci-Fi fan like myself.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best god damn games out there",
            "review_score": "1"
        },
        {
            "review_text": "Was a huge fan of the first game. Mass Effect offers so much more in this game than its predecessor, and it fleshes out more of the lore we come to love in the first game. This is undoubtedly the best sci-fi game (series) there is. I also strongly recommend the DLC, as I've played through them and found the experience to be 100% worth it. Beautiful game, and an amazing story and experience. Easily one of the best games I've ever played in my many years as a gamer.",
            "review_score": "1"
        },
        {
            "review_text": "It's Mass Effect 2, everyone knows this game is great.  The gameplay is real solid, and you can crank up the difficulty if you happen to be MLG like me or just have rediculous dexterity, or even if you have an extra hour or three and can afford to die multiple times a minute, again just like me.  So play this game, if you havent already.",
            "review_score": "1"
        },
        {
            "review_text": "Good Interactive Movie.  Would cutscene again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm commander wilhelm and this is my favorite RPG on steam. In all seriousness, get this game! (prferably in a bundle with the first)",
            "review_score": "1"
        },
        {
            "review_text": "The one game where choices truly count, and determine if all of the characters that you have come to know and love die! It's like virtual Sci Fi Game Of Thrones!   *Go Renegade*",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Good graphics, combat, customization, and story. I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "For me Mass Effect 2 was definitely one of the best games I played. The story was great, and the gameplay is incredibly fun. Firing the widow sniper rifle is always something to enjoy.  Also the fries launcher aka the M-920 McCain is just awesome to use.  It's just an effin' shame that Mass Effect 3 has been restricted to the sorry excuse of a privacy invading shithouse origin.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 devilers you another epic story brimming with great dialogue, tough decisions and amazing characters. The combat system has been greatly improved making Mass Effect 2 a game very close to perfection.  The game's aesthetic is superb and the soundtrack is amazing, it trully is a science fiction masterpiece and one of the best games of its generation.  If you love Role-play games and Sci-fi, you'll never forget Mass Effect and you will find yourself revisiting its universe very often.  Its a must own!",
            "review_score": "1"
        },
        {
            "review_text": "The game speaks for itself once it starts,A masterpiece in the gorgeous RPG titles.Controller support would have been appreciated but you'll get through it assuming you are a PC gamer.You can replay it and choose different reactions/decisions,and see what happens next.A Multiplayer mode would have been icing on the cake or even a Co-op mode.But trust me you'll soon forget these things once you're in the game",
            "review_score": "1"
        },
        {
            "review_text": "Better gunplay, AI, sidequests and level design this time around. However, everything else has been greatly simplified or downright made worse. The game also suffers from occasional game-breaking bugs that are simply unforgivable for an AAA game.  Good game regardless, but not as memorable as its predecessors. Lair of the Shadow Broker DLC is a must while the rest is decent but ultimately forgettable.",
            "review_score": "1"
        },
        {
            "review_text": "This game is .............. I don't have any word to describe how ......... I loooooovvvvvveeeee this game i Played ME 3 also and it's .............. aweeeeeessssssoome .........cooooooolllll......amaziiiinmnnggggg.I Love It. I recommend it soooooooooooo much.",
            "review_score": "1"
        },
        {
            "review_text": "You can be a huge ♥♥♥♥♥♥♥ in this game, I can't recommend it enough.  Be sure to pirate Mass Effect 3 due the Origin only ♥♥♥♥♥♥♥t.",
            "review_score": "1"
        },
        {
            "review_text": "Would pick Jack over Miranda again.",
            "review_score": "1"
        },
        {
            "review_text": "Man i ♥♥♥♥in' love this game, i remember pre-ordering this and spending almost a year playing just this game, god damn its aged pretty well 420/69 would bang jacob again",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. Great story line.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games! Play ME1 first though!",
            "review_score": "1"
        },
        {
            "review_text": "In many ways, a significantly improved game than ME1.  Controls were much simpler, albeit, not in a bad way. Some may argue that the weapon customizing feature was watered down in ME2. But to be honest, it was much more concise and sensible.  Graphics also took a wide turn. It may be because I didn't mod it but in default, the aesthetics and visual quality provided eyegasm. Next, the storyline, once again, proved immersing. The fact that your decisions count could make it as if you're in control of a story, a feeling that you don't usually get in today's games other than TWD and most of Bioware's games.  There's also huge replay value since you can embark on the paragon/renegade course with either a male or female character. Take for consideration also the plethora of choices that you can decide throughout the whole game. If you loved ME1, KOTOR, Dragon Age, and the like, this game is a must.  I would also suggest those who adored TWD 1 and 2. ME2 may be more FPS-oriented, but the story is always the game-changer for me, no matter what the game genre is.",
            "review_score": "1"
        },
        {
            "review_text": "Guns Guns &amp; Guns, More fun with in the battles.the storylines got faster than ME1, but not so developed as it. and hate for there's no all DLCs",
            "review_score": "1"
        },
        {
            "review_text": "'ah yes, reapers' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, Another Bioware classic. A great mix of storyline, gameplay, voice acting, graphics and that music... everything comes together so well.. I especially also liked the sound effects, quite improved over the original Mass Effect.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect is a beautiful game, I've spent countless hours playing (both on PS3 and PC) and it has total replay value (I'm on my third run through). It is challenging, harrowing, moving and all-round good fun. The character's are lovable and heart-breaking. Not only do you feel like your choices completely change your path, but they affect the other character's (and possibly risks their liveS) as you go through, making you consider your choices carefully (you sometimes need to decide whether or not to go with your morals or with what will benefit the most people).  It's wonderful, exciting and I highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2. A great game with one of the best storylines out there.  Pros: * Improved combat * Great story * See your choices from the first game * Characters are even more alive then before * The best ending to a game I've ever seen.  Cons: * You don't get DLCs from this version * Less RPG elements   Overall: As perfect as a game can get 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic RPG. Lots of elements missing from the first game, but plenty of new things to love. The Lair of the Shadow Broker DLC is worthwhile, the vehicle-based one isn't.",
            "review_score": "1"
        },
        {
            "review_text": "I'm Commander Shepard and this is my favourite game on the store.",
            "review_score": "1"
        },
        {
            "review_text": "I survived a suicide mission and banged an alien, but not in that order. Oh, and you can talk to Garrus about weapon calibrations, if you're into that sort of thing. Possibly the best game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game and Series. Didn't think I would like it but the endless amount of impact you can have on the story kept me coming back for more.",
            "review_score": "1"
        },
        {
            "review_text": "I'm speechless. this series man, this series.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "Guys, seriously, just ♥♥♥♥ing get this game. It's absolutely brilliant and the fandom is amazing! :D",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is a great game in many respects.  It boasts memorable locations. Be it the crime hub of Omega, Asari corporate haven of Illium or the Citadel Wards, all of them feature meticulous attention to detail, making all of them believable, lively and interesting to explore.  It boasts great characters, each with their unique custom-tailored missions. No longer it feels like tedious shoot 'em up of ME1 in the same three-template outposts (underground base, two-story warehouse or a cave). Surroundings, goals and flow of those missions will make almost all of them stand out as much as Noveria or Feros did. While custom (!) tense brooding music (and rightly so - a lot of plots are about something very messed up and troubling) only sharpens the experience.  The combat itself was greatly improved too. The highlight is probably the sniper rifle wielding Infiltrator experiencing a massive positive change compared to ME1.  Some notable gameplay changes worth mentioning include weapon heat, bullets, weapon and armor customization. ME2 introduces bullets (you have to worry about picking clips up, particularly if you rely on a sniper rifle or a pistol in the scenario involving fighting waves or simply a large host of enemies) and removes all customization and overheating. I can understand the reasons well enough - let's admit it, 99% of the people were using the same mods and bullets anyways, the console interface of ME1 was extremely uncomfortable to navigate while outfitting each of your companions, and having to worry about bullets does change the combat somewhat. Yet still it feels too streamlined and sterile.  Exploration in Mako was completely removed, replaced with planet scanning. Personally, I've always found Mako roaming tedious and needlessly time-consuming, but a lot of people seem to miss it.  ME2 also features a new system of gaining experience. You are now rewarded for completing missions, which means that you don't have to worry about doing something gamey to milk maximum experience.  I have only two personal gripes with new features. The first one is about purchasing new abilities. Each ability has only 4 levels, each subsequent one costing more. By the end of the game you get to spend your points to purchase new levels very rarely - once every 2-3 missions. And no, they don't feel rewarding enough to justify the wait. The second one is that the number of available weapons is reduced to 2-3 per slot (which could be augmented with DLCs, but DLC weapons usually suffer from being OP, so no joy anyways).  (What's interesting is that ME3 managed to find a great middleground between streamlining of ME2 and overabundance of ME1. Weapon mods and weapon variety are back, missions consist of subobjectives, each rewarding you with xp, and you have more abilities with more levels in each. All of it smoothes out the gameflow.)  Mass Effect 2 isn't without its flaws of course. And the biggest one in my opinion demolishes the idea that Drew Karpyshyn would've definitely made a huge difference for writing ME3. The main plot of the second game is shambles. Worse yet, it was made even more pointless by the Arrival DLC and ME3. Fortunately it is comprised of only a handful of missions, and the last one at least gives you tense rewarding action and cinematics. But as long as you can turn off your brain (fortunately Shepard displays this capacity all too often already :p ) and just blindly do whatever the Illusive Man wants you to - you'll be fine. The rest of the game is totally worth it. So much so I'm currently riding ME1 one more time to get a lvl 60 import just because I enjoyed ME2 immensely and want more of it.",
            "review_score": "1"
        },
        {
            "review_text": "Mass effect is one of the best RPG series I've ever played. The second game veers away from some of the core RPG elements, and replaces them with more streamlined shooter aspects instead. Even as a die-hard RPG fan, it was a good move for the series. It may not be as deep as the first in technical gameplay stats, but it makes up for it in easier to get right into fun.  The story, characters, and beautiful writing continue in Mass Effect 2 and by the end of this series, you will have encountered some of the most lovable and memerable characters in any video game. Do youself a favour, and play this if you haven't already. But start with the first game, and bring your Shepard through each game via your save files. No trilogy is as personal as this one, with your choices making an impact, and being remembered in future games.",
            "review_score": "1"
        },
        {
            "review_text": "Eh what to say about this ... First time i played it i was like ... Meh ... Did not even finish it. Then replayed it. And again, and again. And playing it again so that i can chase Jack so that i have Jack in 3rd part .... crazy stuff. Excellent game through and through.",
            "review_score": "1"
        },
        {
            "review_text": "If this game were a potato it would be a very good potato.",
            "review_score": "1"
        },
        {
            "review_text": "Hours upon hours of gameplay, amazing story, and great weapons. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend this game, thank you for asking.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of my favourite games. If you always wanted to hang out with aliens, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "And the story of captain Shepard goes on, taking a bit different course from original first part of the game. Game is more focused on action, rather that dialogue RPG-ish side, but if it's okay with you, go on and buy it... You are up to a quite an adventure, son.",
            "review_score": "1"
        },
        {
            "review_text": "This one has, by far most, been my favorite Mass Effect so far. Who know's the fourth one might be it, when it comes out. But hands down this is the best one yet. I loved everything about this one, the side missions, the story, customization, plus so many other things, this by hands down is the best out of the three. But this doesn't mean I say you shouldn't play the first one, which by all means you should, if you haven't played the first one and was thinking of either getting this one or that one, get the first one. This series is like reading a book, you can't just start from the middle and expect to enjoy ( you might, but will miss out on ALOT) you have to start from the begining and play through to the end. Now I'm bored of writing a review so I end it here, on a note that I have played this both on Sexbox and Pointy Square 3",
            "review_score": "1"
        },
        {
            "review_text": "Never had a single game I finish in 4 days non stop playing day and night. Instead of thinking about game designers were thinking, choices I made in this game seemed like I am actually making the decision and I was really merged.  Amazing game. Top 3 single player game list along with Dragon Age Origin.",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game this is! It's got wonderful graphics and an in-depth storyline, it's like playing a movie but you get to choose what happens. I loved the fighting &amp; music! But, most of all what I liked, was how it makes me (The Player) feel guilty for some of the actions that I chose that got some of my teammates killed. I just wish they had Mass Effect 3 on steam. 10/10 A Must Have!",
            "review_score": "1"
        },
        {
            "review_text": "Where is Mass 3??",
            "review_score": "1"
        },
        {
            "review_text": "There are very few games which can be described as having truly perfected their formula. One could say that Mario and Sonic perfected the platformer, that mario galaxy perfected the 3D platformer, perhaps even that games like GTA: San Andreas perfected the open-world formula. Mass Effect 2 is a game that has created its own formula by delicately fusing RPG elements with third-person shooter gameplay, and the result is simply pure perfection.  The game picks up a few years after the first Mass Effect game and revolves around the protagonist from the first game, John (or Jane) Shepard, who after waking up from a coma and being essentially brought back from the dead by a shadowy organisation named Cerberus must stop an invasion of deadly aliens known as the Collectors, who are abducting entire colonies of humans for some unknown purpose. To do this, he must assemble a team and travel beyond the Omega 4 Relay, from which no ship has ever returned. As he recruits new allies and old friends for his suicide mission, Shepard makes new discoveries which reveal more and more of the mysterious Collectors' nature and goals.  The story in this game is absolutely amazing. How the plot progresses depends partly on the actions that Shepard took in the first Mass Effect, so I highly reccommend playing that first before this. The rest is decided through the game's morality system - 'Paragon' choices make Shepard a much more noble, just character, whereas 'Renegade' choices make him bolder, harsher and colder. This allows for a different experience and different character developments for Shepard depending on what choices the player makes throughout the game and its predecessor - anything that you do could change the course of the whole game. And when you reach the ending, I absolutely guarantee that you will be on the edge of your computer chair with tension. Also returning from Mass Effect 1 is the ability to start a romantic relationship with one of the characters on board the ship. This has little effect on the storyline itself but it's kind of cute to see Shepard finding love.  As for the gameplay, Mass Effect 2 builds upon the starndard third person shooter formula with some innovative features, for instance Shepard and his team can use various abilities in battle, including various technological abilities, different weapon ammo types and 'biotics' - psychic-like abilities which can be used for both offence and defence. This seems to make battles flow much more as you swictn betwnn shooting and using your powers to find the best way of dispatching your enemy.  The game has a 'loyalty mission' system, wherein you can gain special missions from particular characters, and if you complete these missions you will unlock an extra outfitm and extra power and that character's 'loyalty' - in the endgame thhis will become very important, so after you start receiving these missions, try to avoid other missions until you have recruited everyone and completed all of their loyalty missions. Shepard can also purchase upgrades for his allies and for his ship, the Normandy - these will also be much needed in the endgame.  All in all, Mass Effect 2 is hard to describe with any other word other than its own title. With an awe-inspiring story, action-packed gameplay and endless replay value, no self-respecting gamer should pass it up.",
            "review_score": "1"
        },
        {
            "review_text": "Mass effect 1 features + Mass effect 3 graphics and gameplay, add those together and add a great story line full of great twists and plots, This is mass effect 2",
            "review_score": "1"
        },
        {
            "review_text": "Recommendation for Mass Effect 1,2 and 3: One of the best games i've ever played.  There are not much other games with so many choices which can totally change the story.  Tons of sidemissions and stuff you can do. I have played almost everytime as Paragon cause i think its just better.  You can choose a custom face for your char, you can choose gender which will also give you many different dialogues and more.  You can import your saves from ME1 to ME2 and so on which can give you some advantages and with all your choices you've made in the previous one. Epic Cut scenes and some great jokes in dialogues. The game experience gets better and better with every part of ME like cover and shoot stuff. You need to like RPG-Games. For me it has 10/10 (played ME3 on Origin)",
            "review_score": "1"
        },
        {
            "review_text": "If you have played The first Mass Effect a fair warning if your looking to buy this game. This game was dumbed down and made for mass market it lost almost all of its RPG elements in favor for a shooter like approach. Still a great game none the less.   Pros: although alot of RPG elements were taken out most of them were tedious anyway  - 12 Different Squad members each with there own stories and what not - Romance (if you like that kind of stuff &gt;_&gt; - You can import your mass effect 1 character decision you made in the first game will take effect here  Cons  -While taking out certain RPG elements were good not al almost no equipment (you just find weapons theres only like 2-3 for each weapon class) -weak story (no spilers) -main story is far to short (more than half the game is just building up your team)  -tedious resource gathering   overall 8/10   December 30th 2014  That was roughly 3 years ago as of this wiriting and I've changed since then   Dumbing down would not be the term I would use.... Streamlined and smoothed out would be be more appropriate.  Has the game lost alot of what makes a typical RPG? Yes and I still stand by that however not neccesarrily in bad ways.   -The combat is much smoother and fluid now compared to ME1 which always had a somewhat clunky and strange feel to it.  -All storyline related criticisms still stand though far too short and leads into an issue with the third game   -Resource system is tedious then again what resource gathering mechanics arent in some kind of way?   My main gripe with the game was removing loot/equipment without anything to really compensate, while heavilly streamlining the level up abilities menu. Dont get me wrong the old had issues I just feel as though the direction they took wasnt the correct one and they couldnt done better.   8/10 rating still stands however I redact most of my comments from years earlier",
            "review_score": "1"
        },
        {
            "review_text": "Although lacking RPG elements from the first game, this second installment of Mass Effect was a huge improvement of the of the first one. Smoother combat and improved inventory management make this game a lot better than the first. The story was lacking compared to the first, but it is still better than 90% of all the games even out now in 2012. Definitely worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying this game. One thing I would suggest is playing Mass Effect 1 first. It's assumed in this story that I did all the things in the previous game, and since I didn't, I feel a little lost at times. It stands on it's own ok, but I'd be enjoying the experience more if I had started with Mass Effect 1.",
            "review_score": "1"
        },
        {
            "review_text": "The best Sci-Fi RPG I have ever seen. I could annoy you for hours about why I love this. GOTY for a reason!",
            "review_score": "1"
        },
        {
            "review_text": "Best. Scifi. Related. Anything. Ever. ",
            "review_score": "1"
        },
        {
            "review_text": "Alot of fun great story line doe get boring at times when trying to do upgrades on stuff and having to mine planets for there resources cant wait for the 3rd one to come out",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Still lacking in the combat department, ME2 is nonetheless a vast improvement over the first game in every way. This game handles choice and consqeuence more effectively than any other game I've played. And while you may not have the freedom of some other games, the tangible effects of your choices results in one of the most immersive game experiences of your life. Which (almost) makes up for ME1 taking a dump on 40 hrs of my life.",
            "review_score": "1"
        },
        {
            "review_text": "I'll Take It!",
            "review_score": "1"
        },
        {
            "review_text": "The story and gameplay are fantastic. Expertly voice acted with a wealth of character customizations and moral choices to make. The mining mini game sucks and unfortunately you have to slog through it. Still it's one the best games of all time. If you like action games or rpgs there is no reason not to buy this. Impossible to go wrong for thirty dollars.",
            "review_score": "1"
        },
        {
            "review_text": "9.8 / 10  Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "Even better than the first. The gameplay is a lot of fun, and there are many possible outcomes. The mass effect series is innovative in that actions in game one can affect things in game 2 which cann effect 3. No multiplayer.  Points are removed for 2 things. EA: You suck, put Mass Effect 3/DLC's, and the Mass Effect 2 DLC's on Steam. Seriously downloading the DLC's for this game was a major pain in the ♥♥♥, plus logging into the cerberus (origin) server.  Bugs, I got stuck in a wall on a supposedly inaccessible ledge, etc like once every 2 hours. That's just annoying.  Overall B+",
            "review_score": "1"
        },
        {
            "review_text": "FUN FUN FUN! Just make sure you are getting all the DLCs included in any bundle you buy of this game (key dlc content would be Cerberus Network / Arrival / Zaeed / Shadow Broker / Kasumi).",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome. Seriously. If you have or have played the first one, you have no excuse.  SCORE: 9.75/10",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game ever made, you will ♥♥♥♥ your pants!!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely loved this game, one of my all time favorite RPGs. The first one was excellent but had some not-so-fun bits, this one has all the crap cut out. One of the few RPGs where I was engrossed enough to do every last side quest.",
            "review_score": "1"
        },
        {
            "review_text": "An improvement on the first in every way. Without a doubt the greatest RPG yet.",
            "review_score": "1"
        },
        {
            "review_text": "Its an awesome game, probably the best game I've played in all my gaming years, its fun its engaging, its filled with Interesting characters, and it has continuity, from the first game to this and from this to the 3rd. But most of all, it makes me feel like I'm reading/watching a great book/movie. This is an amazing game, be it by its story, engaging characters or fun gameplay... it has all and all of it preformed masterfuly, a master piece.",
            "review_score": "1"
        },
        {
            "review_text": "Simply awesome!!! A MUST have game 150%!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, and is made even better if you've finished number 1.",
            "review_score": "1"
        },
        {
            "review_text": "Shepard. ಠ_ಠ",
            "review_score": "1"
        },
        {
            "review_text": "awesome rpg really good story i would recommend this game to people who like action and third person rpgs",
            "review_score": "1"
        },
        {
            "review_text": "The ME series represents the best third-person story-telling currently in production. Not as immersive as its 'first person' narrative cousin, Dragon Age, ME2 makes up for it with impressive characters, story, visuals and a great 'good cop, bad cop' moral system.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a wonderful storyline.",
            "review_score": "1"
        },
        {
            "review_text": "search G**gle key word 'Miranda Lawson' with or without '' doesn't matter definitely buy this game 13/10  NOTE : this game is Visual Novel with some shooting mini games",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion the best game in the trilogy. Most DLC for this game is good, so you might as well get it all. Since Mass Effect 3 is not available on Steam, i'd recommend that here as well, to close off the trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "Has easy game play that makes the experience more enjoyable. The story line is good. Halfway through the linear style becomes repetitious.",
            "review_score": "1"
        },
        {
            "review_text": "extraodinary series",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic sequel with improvements on all aspects of the first Mass Effect, while also providing fresh content and innovation. One of the best games of its time on which other genre titles will/should be measured with.  [+] Excellent graphics, very good animations [+] Fantastic and high-detailed level design with high variety of enviroments [+] Great sound fx, awesome soundtrack in quality and quantity, excellent voice acting [+] Excellent redesign of firefight-action [+] Many new and also familiar characters [+] Smaller and more reasonable amount items than before, no more inventory-micromanagement, many upgrades [+] Improved basic character system [+] Various gameplay elements with different paces (shooting, talking, exploring) [+] Importable and exportable savegame which inherits and extends all decisions [+] Long gameplay time [+] Genuine and subtle humor at the right moments  [-] No comeback for all characters (small cameos) [-] Repetitive gathering of resources  Score: 5.0 / 5.0",
            "review_score": "1"
        },
        {
            "review_text": "Not much to say about the sequel to one of the best Action RPGs out there.  There game takes places soem time after the first game. You are brought back to life to save the universe from an army of Reapers. After you managed to kill the one reaper ship in the first game, very little has changed and most people thought the threat was over. The damage done is being rebuilt in this game so chaos has taken hold of certain areas. You form a new crew and pick up some of the old cast and try to save the future.   If you have the save file from the prior game you can import your old character and the choices you made in it. This will dramatically change certain aspects of this game. If you do not have a save fro mthe first game, no worries as it will not affect your gameplay.  Graphics are outstanding, the voice acting is superb. The fight scenes take a little getting used to as the weapons are powered differently this time. The planet probing has changed. You now send beacons to planets instead of driving that horrible Rover around. Some planets will let you land but most are just for probes.   Definitely buy if you want a very compelling story .  Note: part 3 is not on STEAM and requires you to get EA's Origin account if you want to finish the main trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. If you loved the first one, you'll love this one. If you loved KOTOR, you'll love this game. If you enjoy Skyrim or Oblivion, odds are you'll enjoy this one too. Great RPG elements mixed in with a somewhat free to explore environment.   Beautiful graphics, great attention to detail regarding environments. Even little details in your codex are FUN to read and explore.  This ones a winner.",
            "review_score": "1"
        },
        {
            "review_text": "excelent game very good game is a must play",
            "review_score": "1"
        },
        {
            "review_text": "REally enjoyed the sequel and the DLC apart from the damn probing/mining missions and not being able to revisit worlds and do anything entertaining after you complete the game. Can;t wait for part 3!",
            "review_score": "1"
        },
        {
            "review_text": "Got to play it fully, but yes, great so far :)",
            "review_score": "1"
        },
        {
            "review_text": "This was the first Mass Effect, game I played of course that was on the 360 I got this game Christmas of 2010, this game is one of the best RPG story rich games I have ever played. In itself I miss the lore of this game and the advertisements promoting it the story is so rich since this time around. You will work with Cerberus, because they believe the Reapers are real the Alliance refuses to believe it following along with the ignorant councils. Dismisal of the Reapers as Myths hint at why I sacrifice them on most of my play throughs Cerberus is the only hope Shepard has to build the team and defeat the new enemy that has emerged. Frankly more games need to be written like this very story driven and you get attached to your squad mates so what if this is an older game this is one of the history books. Espeically since a certain character is based off of Martin Shean.",
            "review_score": "1"
        },
        {
            "review_text": "I'll Take It!",
            "review_score": "1"
        },
        {
            "review_text": "People either love or hate this game for the same reason: It's not what it's predicesor was. If story and immersion are the things you look for in a game, Mass Effect 2 will probably not impress you, but if decent shooter mechanics and graphics are the only things you care about, this game is what you are looking for.",
            "review_score": "1"
        },
        {
            "review_text": "IM COMMANDER GINGERBEARD AND THIS IS MY FAVORITE GAME ON THE STEAM :D",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so the game is great, you most likely know about it by now, been out a while. I will say that it kind of disappointed me that I had to download a mod, and a save editor to play the game with my 360 controller. Then I had to do some EA (surprise surprise) sign up stuff to get the DLC I got with the deluxe edition.   So overall, buy this game. Do you like story, action, lesbian sex, straight sex, killing aliens, not killing aliens, questioning the future implications of killing or not killing aliens, telling every store in the Citadel that it is your favorite, stripping planets of all of their useful resources, working with criminal organizations, and getting drunk with doctors? Then you need this game. If you don't like these things, then I don't like you.   BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, needs controller support.",
            "review_score": "1"
        },
        {
            "review_text": "WE'LL BANG, OK?         YouTube™ Video:  Gamer Poop - Mass Effect 3&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "BLoody great game!",
            "review_score": "1"
        },
        {
            "review_text": "A pretty fun game, not terribly deep, but a good overall experience. 8/10 not bad",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so I had really mixed feelings about this game about 1/4 of the way through it. The story seemed to be dragging and I just didn't care about what was happening. And then I started to pay attention to how cleverly they weaved the story of this game and it's prequel. It really took me by surprise, cause I never thought I would make it through the game, but alas, I finished it, and it was well worth every minute. Just like the first game of this series, Mass Effect 2 truly requires the gamer to be someone who won't mind spending hours just listening to people and engaging themselves in the universe that is, Mass Effect. I love this game, and can't wait to get my hands on the third one.",
            "review_score": "1"
        },
        {
            "review_text": "This is potentially the best game I've ever played and if you include the whole trilogy it's without a doubt the best 300+ hours I've spent playing video games. The story is great, but it's really the immersive world that gets you hooked. The combat is a great improvement on the first game and while its age may be showing slightly in its graphics this is still a near perfect video game.",
            "review_score": "1"
        },
        {
            "review_text": "A true pleasure to play. One of my all time favorite games. The critics, fans, and every one else who has played this game loves it. You will too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is something beyond awesome, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "I've been experimenting with running games on my Surface Pro (v1). This game runs great, you won't have the top notch graphics, but it works for a very mobile platform. If you've got a Surface Pro, check my other reviews, as I've been trying several games.",
            "review_score": "1"
        },
        {
            "review_text": "Classic - 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Always fun to play, never had an issue with what to do, and love some of the humor in the game! Protip: Punch everything you can =P",
            "review_score": "1"
        },
        {
            "review_text": "Banged an awkward alien  10/10  P.S. DLC payed for but didn't work.",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as the first!",
            "review_score": "1"
        },
        {
            "review_text": "This was a fun RPG I played it all thru.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best of the franchise so far. ME2 has the fighting mechanics better tuned than the first, actions truly do feel like they have a greater impact on the game, as well as it also takes into account the choices of the first. Darker and grittier than the first it is also lifted up higher still with the tense story line. Good replay value. But a slightly linear game than the first with not as much of a open world feeling as the first. But can be excused due to the numerous side missions that feel somewhat meaningful. You can collect a array of resources to upgrade both the ship, weapons and unlock New weaponry.",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliant game :D The option to customise your armour is awesome, the soundtrack is beautiful and the story is fantastic :D I strongly recommend this game :D",
            "review_score": "1"
        },
        {
            "review_text": "The second game in the series and it doesn't let you down once. Awesome voice-overs, immense roleplaying feeling, unparalleled storytelling and hard choices.  Damn, BioWare. You just created history.",
            "review_score": "1"
        },
        {
            "review_text": "GET IS GAME ITS EPIC!!! I LOVE THE STORY!!! MAKE WANT MASS EFFECT 3",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best RPGs I have ever played. Great story, Great characters, Great lore, even interesting side quests. If you haven't already and you are even a casual fan of RPGs, pick up this game.  We'll bang, OK?",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, probably my favorite in the series. Definitely worth getting!!",
            "review_score": "1"
        },
        {
            "review_text": "The next chapter in a fantastic series, come back as Shephard in ME2 and determine how Terminator-ish you look by how dickish your actions are! Also, great improvement on combat mechanics and squad command system (using familiar HUD from ME1) but be warned there is ammo in this one so you can't just fire all your guns willy nilly. Didn't really like the levelling sytem in this one, reminds me of the transition between DoW2 and DoW2 Retribution, but a much more expansive campaign with different and (again) really well executed characters and plot. Can't wait to play the third! *****",
            "review_score": "1"
        },
        {
            "review_text": "If you like PC RPGs and Shooters then THIS is DEFINETLY the game for you! It's one of the most awesome PC games I've ever played and a fricking good RPG at that. Since all choices are carried over to all following episodes I highly recommend to start with the first title of this series!",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best story games ever made, so I won't go into more of that. The action is tight and challenging for everyone. Plenty of small options to suit different play styles - I'm a sniper lover and had a great time. Then there are the worlds, and they are beautiful. It's going to be a fun time.",
            "review_score": "1"
        },
        {
            "review_text": "If you loved Mass Effect, you'll love this one 10x more! If you love a good stoy, space ships, and saving the galaxy, this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Mass Effect 3",
            "review_score": "1"
        },
        {
            "review_text": "A life-changing experience. Without a doubt, the greatest single player gaming experience available. You absolutely have to play this series.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG games you'll ever play.",
            "review_score": "1"
        },
        {
            "review_text": "First you ♥♥♥♥ the alien. Then you fall in love with the alien.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say, that has not already been said about this game? You owe it to yourself to try it at least once ;)",
            "review_score": "1"
        },
        {
            "review_text": "Excelent game, far better gameplay mechanics than the first one. 'Coolant' clips to keep your guns cool is a nice touch. Especially with each weapon having a dedicated amount of coolant so you don't blow through all your ammo with one weapon. Also nice, the new armor system. Makes choosing what to level easier each time you level.  Not as in depth on the individual character development as the first however. . . Largely, I think, due to not having the IC mission debriefings, and a much larger character cast.",
            "review_score": "1"
        },
        {
            "review_text": "Even if you haven't played the first one, the second is worth the playthrough, free feel to ask from a friend for a ME1 save if you want the 'stuff I did before counting'.  Either way, this game is worth the buy. even without DLC, play it now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is more cinematic and better written than most movies.",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that is more important than saving the galaxy is solving the crew members dady issues!",
            "review_score": "1"
        },
        {
            "review_text": "I love story oriented games. This has a story, I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Play it now before the 3rd one is out.",
            "review_score": "1"
        },
        {
            "review_text": "I have not yet played the third Mass Effect game, but this is much better than the first one. In fact, I'd have to say this is one of the best games I've ever played. I thoroughtly enjoyoed it.",
            "review_score": "1"
        },
        {
            "review_text": "How to get laid for dummies=♥♥♥ effect 2  69/11",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Polished Bioware Masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't checked out the Mass Effect series I highly recommend it. Bioware at its best.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever, have done so many playthroughs",
            "review_score": "1"
        },
        {
            "review_text": "This game, really stands the test of time. Play it now!",
            "review_score": "1"
        },
        {
            "review_text": "The Mass Effect trilogy is my all time favourite game series, and Mass Effect 2 is the best game from that trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the very few games that actually lives up to its trailer AND its hype. When I looked at the MetaCritic score, I thought 'What, it's only 94.'  Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time, certainly pick it up if for some reason you're on this page and haven't yet.",
            "review_score": "1"
        },
        {
            "review_text": "Warning, some spoilers.   You played ME 1 before looking at this, right? If not, go back and get ME1 right now and play it.   OK.   This game takes everything good about ME1, and makes it better. Then it takes the few downsides of ME1 and completely revamps them.   Combat is an order of magnitude better; it feels almost like Halo or Battlefield. You can now interrupt villainous monologues instead of MST3King them as they play on your headset. You can give Tali a cooldown hug, trade witty banter with Garrus, and listen to Jack spew profanity.   Oh, and you can kill a freaking thresher maw with a pistol if you're really good.   Shepard is back, and she (come on, admit it, you played FemShep because MaleShep's voice was unintelligible and you couldn't bring yourself to abandon your beloved character for a new incarnation in ME2) is more badass than ever. She can punch a mecha to death with her bare hands, kill krogan berserkers with a handgun, kill a freaking Reaper with an assault rifle, and repeatedly prove that no matter how much Harbinger rants he is no match for Shepard.   Shepard's friends are...mostly back. Wrex is basically the krogan king, so your Big Guy is Grunt--think adolescent Wrex, or in other words pure testosterone backed up by brute force. Garrus is Space Batman. Tali is all grown up and in charge of awesome missions of her own. Ashley won't talk to you because of the Cerberus thing, but that's OK because at least she's been promoted a bit. Liara is a badass information broker and femme fatale of sorts, and if you don't have Lair of the Shadow Broker buy it as soon as you get this game because it is the best freaking DLC and it exists to reinforce what a badass Shepard is and how badass all her buddies are.   Shep's new friends are...pretty cool. There's Miranda, the arrogant jerk with a ridiculously sculpted body and a skintight catsuit, who becomes slightly less of a jerk over the course of the game; Jacob, the career soldier who at least has his ♥♥♥♥ together; Grunt, who's basically testosterone incarnate; Thane, who's badass; Jack, who's ♥♥♥♥ed up in the head and wears tatoos and little else; Samara, who's a space paladin with...um, lots of cleavage. Looooooooots of cleavage. And then there's the BEST CHARACTERS EVER:   1. Doctor Mordin Solus, who is the best because he:  -offers practical sex advice and doesn't judge -blinks upwards -omits pronouns and this is awesome -is a scientist and science is cool -Sets bad guys on fire -Is the very model of a scientist salarian -and has a cool neck thingy.   and, 2. Legion, who is a geth, and is awesome, and I refuse to hear a word against Legion.   Pros:  +DLC is great, get it all.  +Combat MUCH improved from ME1.  +Soundtrack even more epic.  +Story and characters still awesome.  +Harbinger is best villain.  +Mordin Solus.  +Liara's character development.  +Mordin Solus.  +Grunt in general is great.  +Mordin Solus.  +Legion.  +Mordin Solus.  +The final mission, beyond awesome.  +Mordin Solus.  +Garrus's recruitment mission.  +Garrus in general.  +Mordin Solus.  +Niftu Cal, BIOTIC GOD!  +Mordin Solus.  +Cooldown hug for Tali, best little moment I've seen in a game in a long time.  +Kal'Reegar, great bit character.  +Aria in general.  +Mordin ♥♥♥♥ing Solus.  +Vanguard revamps make it the best class.  +You can shoot a guy while he's in the middle of an evil rant. This is awesome.  +And, last but not least, Mordin Solus. He cannot be emphasized enough.   Cons:  -Still cannot romance Wrex.  -Cannot take up the mating offer you get from a krogan on Tuchanka if you beat the thresher maw.  -Cannot punch out Miranda when she acts really jerkish.  -Jack is a sort of flat and superfluous character, and you already have some decent biotics early-game, so ehhh.   11/10 would assume direct control again.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I have ever played. 2 play through so far. 1- Soldier, 2- Adept and continued on to finish 3. My first play through was with an ME1 save game. I had no appreciation for the choices as I was new to the game and made some bad calls. Recently I started another ME2 game (with out using ME1 save) knowing more but even starting fresh the same 'bad' choices were made I wanted to avoid BUT it was so much better the second time knowing what I did last time and being able to manipulate situations based on my first play through. I think even saying that about a game speaks to its character and this is 5 years after it came out. This is a game that everyone should play BUT play ME1 first. You cant skip that or your going to have a bad time.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the first. They fixed the horrific inventory system and added more characters with interesting backstories. Added a few new species too and basically made everything better than the first game. Note that you still really should play the first game because the first is referenced A LOT. 'Hey I remember you from the first game' 'Hey, your from the first game aren't you' 'Didn't you help me out in the first game' Also, Garrus is very awkward about loving my red-headed femshep. It made me laugh. ",
            "review_score": "1"
        },
        {
            "review_text": "Mind blowingly good!",
            "review_score": "1"
        },
        {
            "review_text": "With my external mouse pointer speed set to minimum, and the internal 'camera sensitivity' option set to its lowest, the mouse sensitivity was so high as to render the game completely unplayable.",
            "review_score": "1"
        },
        {
            "review_text": "Love the story and the game play. The game really tests your moral decisions.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good! Too bad Mass Effect 3 isn't as good...",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 puts you in the center of the story. You are the most important thing in story, infact your choices that shapes the game. I can easily say Mass Effect 2 is one of best Sci-Fi games, ever. This game makes you care about the universe, this games makes you care about characters fate, this game makes you care your relationship with the characters, this game questions your morality with every choice you make. It is in the name 'commander'. Unlike other games like 'player grab a gun, player do this, player do that..' , this game puts you in charge. Play this fantastic action filled, space opera, you won't regret it...",
            "review_score": "1"
        },
        {
            "review_text": "amazing game where chooice matter and ACTUALY HAS GOOD GAMEPLAY looking at you telltale/ ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing rpg, but in order to get full gaming experience i suggest you play the first part before u start this. Amazing story, it will break you heart! :)",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the best story of the trilogy. Play them all with the major story DLCs and get ready for Andromeda!",
            "review_score": "1"
        },
        {
            "review_text": "Human? Alien? Alien in mask? Who you sex lies entirely in your hands.",
            "review_score": "1"
        },
        {
            "review_text": "A very strong story, good gameplay, brilliant dialogs and side stories. A MUST HAVE for any RPG player with an affection for good story telling.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good, it cured my depression.",
            "review_score": "1"
        },
        {
            "review_text": "I'm Chairman Mao and this is my favorite game in the Citadel.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't enjoy this as much as the first one, possibly because of the lack of wowing novelty. The plot was certainly epic, but I was only involved by about half the team's stories, and the gameplay felt a tad tedious after halfway in. Then again, maybe that's what you get if you grind scanning and then power everyone up lots. The first few missions are dull; after that the scenery becomes much prettier, and DLC such as the Shadow Broker takes place in beautiful environments. I wish the Firewalker DLC had influenced the game a little more; I missed the first game's bouncy tank :) Overall, I can't really complain, it kept me basically entertained, but I can't see myself playing through a second time.",
            "review_score": "1"
        },
        {
            "review_text": "Developed by Bioware....do I have to say more?",
            "review_score": "1"
        },
        {
            "review_text": "Excellent sequel, nothing compares to it. Amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "What is there not to reccommend? If you are one of the sad people to not have tried this yet. Do it.",
            "review_score": "1"
        },
        {
            "review_text": "What is there not to reccommend? If you are one of the sad people to not have tried this yet. Do it.",
            "review_score": "1"
        },
        {
            "review_text": "GOTY Candidate 2010 Hands down.",
            "review_score": "1"
        },
        {
            "review_text": "Best video game series ever made. Ever. I can't stress that first statement enough. Even if you're not really into RPGs (role-playing games), the action is top-notch, the story is amazing, and the fact that your decisions drive the story makes the replay value sky high! Be sure to play the first one if you want the best experience, but it's not necessary.",
            "review_score": "1"
        },
        {
            "review_text": "Best all-time RPG ever.",
            "review_score": "1"
        },
        {
            "review_text": "Story is not as strong at ME but still a strong game in its own right, the new gameplay Mechanics are enjoyable but the story starts to diverge before it is ruined by EA and Bioware in the 3rd installment of the series",
            "review_score": "1"
        },
        {
            "review_text": "Best single player game ever made. If you haven't at least played the demo, then you're just being silly.",
            "review_score": "1"
        },
        {
            "review_text": "No question, the best game of the series. Play it! ",
            "review_score": "1"
        },
        {
            "review_text": "so far thumbs up...Newby :)",
            "review_score": "1"
        },
        {
            "review_text": "Again the version of this to play is on the consoles, because of the controller support. The graphics are slightly improved but not enough to justify playing it on the PC.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest RPGs of all time, with engaging characters, simple but involving combat mechanics and a plot which actually deserves the term 'epic', at least comparatively. If you can bring yourself to, well worth completing the first game and carrying your character across to this one - improves the experience immensely.",
            "review_score": "1"
        },
        {
            "review_text": "A must-have.",
            "review_score": "1"
        },
        {
            "review_text": "Everything I said about Mass Effect also applies to Mass Effect 2. Buy it, you can't go wrong. (Also has been featured as the #1 game currently out on multiple websites.)",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever released on PC",
            "review_score": "1"
        },
        {
            "review_text": "One of the most immersive games I've ever played... no.. scratch that. Ever experienced. Do yourself a favor and download all the DLC. The Shadow Broker content will blow your mind!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a vast improvement over the original so even if you didn't like the first one you should check this game out.",
            "review_score": "1"
        },
        {
            "review_text": "a really good dating simulator",
            "review_score": "1"
        },
        {
            "review_text": "It's like Star Trek with more violence and alien ♥♥♥♥ing.",
            "review_score": "1"
        },
        {
            "review_text": "FAAAAAAAAAR ♥♥♥♥ing better than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best RPG/Shooters I have ever owned. For the price, it is one of the best buys you can make! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Gears of War in space",
            "review_score": "1"
        },
        {
            "review_text": "The Mass Effect series is one of the best I've ever played, it has an amazing story that never gets boring along with gameplay that flows extremely well.",
            "review_score": "1"
        },
        {
            "review_text": "Finally played this.....shouldnt have waited.",
            "review_score": "1"
        },
        {
            "review_text": "Even better than the first. I do recommend playing ME1 beforehand, though. Not much to say, but play, explore, and make decisions how you see fit. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "If you played the first ME game then there's no reason for you to not play this one. The overall gameplay has improved with a much better combat system. The story is so good as it takes a more darker approach than the first game. Somehow i feel like the choices you make in this game will seriously impacts ME3 depending on your ending. Only thing that annoys me is the mining.... oh, and sadly no mako..",
            "review_score": "1"
        },
        {
            "review_text": "I would absolutely recommend this game to anyone who enjoys sci-fi shooters",
            "review_score": "1"
        },
        {
            "review_text": "Despite what anybody says about the ending to ME3 (which was perfectly fine, I didn't understand the fuzz) this is a game worth playing. One my 4th playthrough on my second system (owned it before on PS3). These games play so much better on PC than any console.",
            "review_score": "1"
        },
        {
            "review_text": "With an amazing, in-depth storyline that branches hundreds of different ways, wonderful orchestral soundtrack, gorgeous visuals, and incredibly intuitive controls, Mass Effect 2 tops it's predecessor in every single way and is well worth the asking price.",
            "review_score": "1"
        },
        {
            "review_text": "!",
            "review_score": "1"
        },
        {
            "review_text": "i love thise series of games. you can choose to be a bad attitude kind of player or a holy paladin so to speak. its cool as HECK with the jokes in the game too. =)",
            "review_score": "1"
        },
        {
            "review_text": "one of the greatest game of all time",
            "review_score": "1"
        },
        {
            "review_text": "This game is outstanding. It looks wonderful, the music is incredible and it's a perfect sequel to Mass Effect, it fixes everything that needs to be fixed and even adds in a few new features of it's own. As an added bonus it's going to keep you occupied for a long time. A proper play through is going to take you in excess of 30 hours, and it's inevitable that you'll go back and do it all again with different settings to see what happens.  Do yourself an enormous favour, although this game is one of the best I've seen. Don't play through it without beating Mass Effect 1 first, the game gains a whole new level of depth when you import a character, decisions and assignment outcomes all have effects in Mass Effect 2.  EDIT: I would put out a warning however that acquiring the DLC for this game is not a process that occurs through steam and can be a significant pain to complete. Whether this is fixed in the version on sale on EAs Origin, I don't know.",
            "review_score": "1"
        },
        {
            "review_text": "Third best current Gen Bioware RPG behind Dragon Age, Dragon Age 2, :) Mass Effect 2 is spectacular.",
            "review_score": "1"
        },
        {
            "review_text": "Another modern masterpiece. Rebuild your crew, get enhancements for your ship and then throw yourself into a suicide mission and try to keep said crew alive. the gameplay is tons better than the first game, and the writing is just as awesome. you got to pull a scam on merchants by claiming they all were your favourite shop on the citadel at the same time (AND THEY NEVER CATCH ON), you shut up pompous alien overlords, and you do it your way. figuratively, you can talk softly and carry a big stick or shove an ever bigger stick into your enemy's ♥♥♥ if you feel like being a ♥♥♥♥. What happens is up to you, the outcome is unique to your choices.",
            "review_score": "1"
        },
        {
            "review_text": "Significant positive gameplay changes since Mass Effect 1 makes combat actually fun. Continuation of a decent, if not altogether original plot with good voice acting (great in the case of the Joker/EVI interactions) makes this game an attractive package.  Also they got rid of the bouncy tank. Oh thank Christ.  I could spend all day Vanguard-tackling people and then blasting them in half with my boomstick. The combat felt very polished and I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "It sounds stupid to put into words, because it is stupid; this game literally changed my perspective on life. Because in a moral sense, the decisions you make and the actions you take are important. It depends on how 'in' you like to get with your RPGs.   In other words: It's how much personal significance you place on a world that doesn't even exist.  I cared that much about this world. I was Shepard.  I was also high on drugs most of the time I played the game, but that's another story better left untold. ",
            "review_score": "1"
        },
        {
            "review_text": "The soundtracks, the graphics and the storyline will take you away. If you are into rpg gaming and sci-fi, you must try this awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "The sequel to Mass Effect 2 is good and the gameplay has the same feeling as the first game, however your choices seem to make a bigger difference here than in the first game as once you've got all your crew you can do loyalty missions to increase their chances of survival in the final mission.  The only thing I found annoying in this game was the sense of rushing because after you start the IFF mission then your under a timelimit otherwise the waiting counts as a discission. Research in this game means scanning planets all day long in the map mode which although boring ends up being worth it for the upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "miranda's fine booty. omg.",
            "review_score": "1"
        },
        {
            "review_text": "Best RPG, Action, Adventure, 3rd person Shooter... Awesome Storyline GET IT.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest RPG in the market. Good storyline. Solid gameplay and nice graphics. A must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Tl;dr - 10/10 IGN. Mass Effect 2 is one of the best Action RPGs of its time.  The combat system is significantly better than the previous Mass Effect, making gameplay more fluid and easier to understand, while retaining difficulty and challenge. More Paragon/Renegade options that make dialogue interesting. The story itself is a continuation of a decent story from Mass Effect made much more interesting with the continuation of Cerberus, and your mission to recruit team members all around the galaxy.  The only problem is that there's DLC that you'd need Bioware points for (EA points) and they're actually really good. 'Lair of the Shadow Broker' and 'Kasumi - Stolen Memory' were amazing story DLC that I got, and I highly recommend them. I guess it's only really a 'problem' just because it's not part of the main game, but it doesn't take away from the experience if you don't get these, as they are not necessary.",
            "review_score": "1"
        },
        {
            "review_text": "Bad ♥♥♥ gameplay, bad ♥♥♥ story, bad ♥♥♥ graphics=nuff said",
            "review_score": "1"
        },
        {
            "review_text": "I played ME and ME2 back to back, so everything is fresh, just finished ME2 today actually, and I must say they made some much needed improvements from ME1 to this one and at the same time, some of the good stuff I really enjoyed about ME1 they took out or just made it worse. I still enjoyed the game, but it felt more like a friend quest than an actual game to fight the reapers, I mean come on ME1 you where fighting Geth or being attacked by geth constantly, this game you run into the collectors what 3 times including the ending, fighting was really sparce compared to ME1, they made more space exploration which is nice, more custom options for shepard's armor, nice, lots of new companions, they got rid of the annoying elevators , but they also got rid of the heat based weapons and went with clips, I actually liked the heat based system, didn't need to worry about runnign around looking for ammo. At the same time, I fired my gun very few times, didn't need too, didn't like that, it's suppose to be a shooter. I don't like cover systems or games that rely heavily on cover systems. You spend 90% of the game getting your crew together and 9% finding resources to upgrade and 1% fighting the enemy. They had a great game going into this, I don't know why they felt the need to ♥♥♥♥ with it. Story still good, I like shepard, somehow from the mumbling and grumbling I've heard about ME3 I have a feelign I won't like that game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun and challenging games of all time. Would recommend to anyone who likes realistic action games.",
            "review_score": "1"
        },
        {
            "review_text": "Overall: A fantastic game. If you want the DLC though to extend playtime see Origin. Unfortunatly they reserved all of it. (♥♥♥♥♥♥♥s) Even if you don't, you miss out on very little. This game is just a great next big step in this incredible series.  ONE DOWNSIDE: Lots of grinding for resources (long, boring, and repetitive) Recommend, cheating to skip back to the actual game without having to waste hours doing a necessary but non-narrative task.  G.G. Seal of approval.",
            "review_score": "1"
        },
        {
            "review_text": "one of the greatest games to ever grace one's computer.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 picks up and evolves the gameplay of Mass Effect 1. This game is simply as good as science fiction games get. Its stunning visuals are what define this generation of role playing games. The user interface is fairly user friendly and easy to pick up for anyone famiair with a 3rd person shooter. This game provides a cinema experience in each action scene and fantastic voice actors and dynamic non-linear secondary characters. A little Uncharted, a little Gears of War, a lot like KOTOR.  One of my favorite things in the ME trilogy is the transfer of your character information from the previous installment and how your decisions actually affect the gameplay in the current and future installments. There is very little in this game that I found tedious or glitchy. But I highly recommend this trilogy of game for anyone who likes RPGs or Science fiction. I'm looking forward to the epic finale in Mass Effect 3: March 2012.  Final rating~~~ 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Just amazing, can't wait for the 3rd",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most enjoyable SciFi shooter I played to date. The story is smart and compelling and has great dialogue and action.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite within the genre, for sure, and in my top five of all time for sure. No game have I ever played or movie have I ever watched lead me to the emotional climax of Mass Effect 2. If you have the time to finish it, it is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know what to say here. I could go on about how good the writing is, how good the characters are, how good the gameplay and music is, and so on. But i'll simply leave it at this. This is a slice of perfection. DEN ATTA DEN.",
            "review_score": "1"
        },
        {
            "review_text": "Until Mass Effect 3's ending is fixed, this remains THE BEST GAME EVER MADE!!! I absolutely recommend it to everyone, anyone, always. The roleplaying, the story, the emotional connectivity ... just unparalleled. I care so much about the characters and feel so invested in Shepard... one of the best media experiences of my life. I just CANNOT say enough about Mass Effect. .... Ethics, history, friendship, love, family, religion, dystopia, humor, horror, honor, AI, racism, space hamsters, CHOICE and IMMERSION, how my choices carried over from the first Mass Effect and how I grew to love Tali and Mordin and Thane..... &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 takes the excellent character development and expert writing of the first game and refines them alongside the now-streamlined gameplay elements, while skilfully expanding the scale of the universe and substantiating it. Its cast of characters possess a depth to them that is rare in modern games, the narrative darker and more personal, the ingenious and extensive elaboration of the universe’s lore polished and captivating, the game as refined a hybrid of the shooter and role-playing genre than before. It is indubitably compelling, emotionally enthralling, intelligent and deeply rewarding in a fashion few games in the market offer; a testament to BioWare’s design competency and their true dedication to the development process through care and creativity.",
            "review_score": "1"
        },
        {
            "review_text": "Played the first one and can't get enough? well play the newer and better mass effect 2 now",
            "review_score": "1"
        },
        {
            "review_text": "Already gone through this game 3-4 times and I never get bored of it. Make sure to buy the DLC, its not a waste of money.",
            "review_score": "1"
        },
        {
            "review_text": "Just like mass effect 1. This is just really good. Love the story line!",
            "review_score": "1"
        },
        {
            "review_text": "I havent even got very far in this, but its awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best game of 2010. It took all the misgivings from the previous Mass Effect, and improved on almost all of them. You'll be sucked into the story more, the missions feel epic, and the ending makes you wish Mass Effect 3 was already out. The crappy resource gathering 'mini-game' and medicore boss fights should not deter you from buying this game. Do yourself a favor, pick it up, play it, and get engrossed in the universe that is Mass Effect. I promise you, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Overall a good game and fun experience. A lot more sidequests and space exploration in this one than there was in the first. One major complaint I have is there removed a lot of the RPG elements, streamlined how you upgrade abilities and removed a lot of weapon and armor customization. The gameplay and storytelling is still great, but this feels more like a shooter, and less like an RPG. Also, the story is still fairly short for RPG standards, but this is a fun game. Definitiely reccommended despite it's shortcomings.",
            "review_score": "1"
        },
        {
            "review_text": "Mass effect 2 is the best of the Mass Effect series. This game should be the poster child to what a sequel should be.   Pros:  Great Graphics Great Combat Mechanics Amazing Story Choices, still do matter Better Character Relationships Better Dialog Both Paragon/Renegade choices are appealing More teammates Ability to move faster (I hate walking in games) Great implimentation of Mass Effect 1 choices in this game  Great Immersion  Cons:  No Gun Customization Little Equipment Customization No Inventory Management Great Graphics, but little graphic customization No Modding Available Some non-essential boring parts for upgrades  Overall, the game lost some RPG aspects to the game but I feel it improved immersion because of it.   If you didn't like mass effect 1, you should play this game, if you liked mass effect 1 you should play this game. If you haven't played mass effect 1, you should play mass effect 1.",
            "review_score": "1"
        },
        {
            "review_text": "You really can buy happiness with money. This game is a must play, buy it and enjoy one of the best made sequels out there.  10/10 - would stick my throbbing ♥♥♥♥ in Tali's ♥♥♥♥♥ again.",
            "review_score": "1"
        },
        {
            "review_text": "Best game of 2010.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rpg games ever made! :D ",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. I like it a lot. You would do well to play it because it is well made, engaging and fun.  The combat is cool, if a little repetitive at higher levels, although the combat loadout is pretty varied so multiple playthroughs aren't only encouraged but a nice change of pace.  The story narrative is solid. Ignoring the silly videogame romances, the characters are interesting through their runs. You won't find any Witcher quality choices that effect the plot, but I thought the conversations and events rated from not bad to pretty interesting.  Get the game, it's a good one.",
            "review_score": "1"
        },
        {
            "review_text": "I was seemingly in the minority of people who hated Mass Effect 1. ME2, though, I can actually recommend. There somehow seems to be more meat and less filler in this one. The grinding resources minigame is still there, although a little more bearable. The frustrating weapon-balancing has been vastly simplified, and the identical except for the barrel-layout dungeons have gone away completely. The silly freudian human resources management stuff is still there, of course. Once at the end, it doesn't seem like there was an awful lot of actual gaming in here, but the presentation is just so... /epic/ ... that you can forgive it. If nothing else, it is a 20 hour long Sci-Fi movie, and if you can get into Star Trek or Star Wars, then you can get into this.",
            "review_score": "1"
        },
        {
            "review_text": "Just awesome, even better than number 1. They've improved some things from ME1, including removing the Mako, streamlining the inventory (I, more often than not, found it annoying in ME1), and ensuring that cover is useful. However, downsides to ME2 compared to 1 include the slightly more annoying combat (you accidentally pop into cover because the key for sprint also puts you in cover), planet scanning, and removal of skill options when you level up. These points, however, are relatively minor, and the game deserves its accolades.",
            "review_score": "1"
        },
        {
            "review_text": "A worthy successor to the original. Every bit as evocative, every bit as polished. Disappointed that they simplified the inventory and levelling system, but the story, voice acting and dialogue more than make up for those particular tweaks.  I played this through on XBOX 360, but at somepoint i'll play it through again on PC as well. Also, Seth Green as your pilot 'Joker', comedy gold. Even better this time around.   Can't wait for ME3.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games out there wth great cinematics and entertainment...",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Mass Effect, I recommend that you get ME2 as well. It's the best Mass Effect game of the trilogy and it has a wonderful storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Fixed everything that was wrong with the first game and added more! Soundtracks amazing, characters are a blast to get to know. One of the best franchises out there!",
            "review_score": "1"
        },
        {
            "review_text": "The BEST of the trilogy in my opinion. Perfect in everything: the story has a very good pace, the mechanics are pretty easy to learn and to get adapted to and it has a high replay value. Addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Even if you haven't played the first one, the second is worth the playthrough, free feel to ask from a friend for a ME1 save if you want the 'stuff I did before counting'.  Either way, this game is worth the buy. even without DLC, play it now.",
            "review_score": "1"
        },
        {
            "review_text": "Great game all together, best of the series.   happy N7 day '15 ",
            "review_score": "1"
        },
        {
            "review_text": "So amazing. Must play.  One of my favorite game series ever. ",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2? More like ♥♥♥ Effect 2. The two is for double the more ♥♥♥ Shepard gets in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Banged blue alien chick in the first game, banged the shy alien chick in this game.  Best dating sim ever. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the same like the former ME1 but better and less frustrating, including not having any side missions with the M35 Mako (No really, I hated that part). They also added more romance options for the player, like Mass Effect wasn't already a space dating simulator.  (For those looking to buy the trilogy, sorry but you'll have to get it on Origin)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Polished Bioware Masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "Bloody brilliant RPG, deffently one of the best from Bioware. Gripping storyline and great gameplay along with stunning graphics really make this game worth while. If you are a RPG fan this is a game you should not miss.",
            "review_score": "1"
        },
        {
            "review_text": "One cannot put into mere words the experience that is the mass universe.   11/10 would bang Tali again.",
            "review_score": "1"
        },
        {
            "review_text": "I should go",
            "review_score": "1"
        },
        {
            "review_text": "One of the Greatest Games EVER made. The controls are excellent, the story interesting, and the humor is a great balance to the grim plotlinee. Very few games i play a second time. This one? 6 times. A+",
            "review_score": "1"
        },
        {
            "review_text": "An absolute masterpice 9/11 Allahu Akbar to Collector Ship  I should go now.",
            "review_score": "1"
        },
        {
            "review_text": "One of the finest games I have had the pleasure of playing. It's a huge step up from Mass Effect 1 (not that it was bad, it just improved upon its fault very eligantly). I higly, highly recommend this game for the story, the combat, and the fantastic dlc. This is one of my personal favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best scifi game series in the last ten years. Grabs you and takes you in like very few games can. It's a big galaxy so go out there, meet exotic people, seduce them, kill them, dance with them and get blasted with their exotic liqueurs.  The only gripe I have is that I wish someone managed to make games as good as this about Star Trek and Star Wars.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "*SPOILERS*   My entire squad and crew of my ship died due to my poor planning and decision making   but I still got to bang Miranda. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is to the first one as T2: Judgement Day is to The Terminator; bigger and better in every sense of the word.  Gone are the crappy inventory screens, repetitive sidequests, and slow planet exploration. Everything's streamlined into a much more accessible experience (though planet scanning can be a drag) and it makes for a better flow.  New and old characters have clever and fluid dialogue that really flesh them out, and the loyalty missions were always fun to do. The story is incredible and the opening scene and final mission are flat out amazing. You really feel like humanity's last hope and want your team to make it through the end.   Brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, good story.",
            "review_score": "1"
        },
        {
            "review_text": "i accidentally pulled an all nighter 3 days in a row to finish this game  the first time  subsequent replays may require more than one hand to count",
            "review_score": "1"
        },
        {
            "review_text": "Even though I've accidentally stumbled upon Mass Effect only about a year ago (already having spent more than 300hours on my console), it's easily become my favourite game of all time. Can't find one single bad thing about this game. Still enjoying it every time I think it's time for another playthrough.  Thank you, BioWare! Can't wait for the next one.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect (1 to 3) is one of the absolute best story-driven game series ever. The whole series is an absolute gem which will make you contemplate some of the deepest philosophical questions and engage you perhaps even more than good literature would. The depth of the story paralleled only by The Witcher series (or arguably surpassed, especially after reading the short stories and novels which inspired The Witcher game series). I cannot recommend the Mass Effect series highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "While I still feel that the overall experience from the first game has been drastically streamlined and nearly all the hardore RPG elements (the whole reason I got into this franchise to begin with) have been removed, the story-telling and overall narrative are strong and engaging. Enough for me to keep playing despite hating the new combat system. In fact, the way in which your actions affect the unfolding story is the one thing this game has most improved upon from the first. That and the visuals of course, but that's to be expected. Just wish gaining levels still felt like it meant something.... And I'm sorry, but why the ♥♥♥♥ do we need an 'End of Mission Recap' screen? But I digress, despite all my negativity, ME2 is still a stellar game. If nothing else, play it for the story. Then play it again for an entirely different one.",
            "review_score": "1"
        },
        {
            "review_text": "No DLC. Shell out the cash, Steam. GABEN!!!",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game ever made. That's all.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, lot's of fun to play. I do recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Honest to God. Bioware knows how to tell a story, and this is space opera on par with Firefly and Farscape.  If for some reason you havent played this, drop everything on your list and go do it right now...   Im waiting...  No seriously.  Right now.  It will make you laugh, make you cry, and you will want to play it again and again. Its like Cats, but with less furries.  It has a few little issues, such as lack of native gamepad support (but your on PC, so there is a fix for that), and some odd little driver problems.  This is the second act of possibly the best sci-fi action-rpg ever made. Do your self a huge favor, and go start a brand new game of ME1, and play all the way thru to ME3. If you dont at least blink away half a tear at some point, your doing it wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Obviously fruitless without its brother predecessor, there is no greater time to join the Mass Effect craze with ME3 coming out Winter 2011. This game excedes RPG expectations not with loot, stats and items, but with conversations that have true consequences. You are not dipped into this series. You take a cannonball into the Mass Effect universe!  Get ready for an amazing adventure you won't be able to stop thinking about until you play this game again and again and again!",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played the first one yet but understood what was going on completely :D Amazing game but not much re-playability for me, cant wait for ME3",
            "review_score": "1"
        },
        {
            "review_text": "Magnificent experience. Packed with poignant characters and moments that bring a deceptively basic story to life.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Everything is really orange for some reason.",
            "review_score": "1"
        },
        {
            "review_text": "Simply put one of the top games of our generation. Cannot be understated what a standout this game is. You don't need to play the original, skip it if you haven't already and don't worry about joining the story on the second episode. The original's mechanics are pretty terrible though it's story was equally excellent.  This game is story-driven and character focused. It's hard to explain how much personality your squad mates have and how invested you get into helping them progress not just as warriors, but has people. I could say some negatives, but they're really minor and you should just buy this anyway.   This game is also extremely polished and will age beautifully. As close to bug free as any RPG ever and the gameplay is silky smooth.   BUY. THIS. GAME.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me just well want to keep playing it over and over again you should play this game i mean play it JUST DO IT DON'T THINK JUST DO",
            "review_score": "1"
        },
        {
            "review_text": "Not a good game to play if you are a perfectionist. Great game to play if you want more Garrus.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. Hardly any bad aspects about it.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played the first Mass Effect but I still understood the story and had fun. On my 3rd playthrough now.  edit: On my 4th playthrough now... which I think speaks plenty for whether you should get ME2 or not.",
            "review_score": "1"
        },
        {
            "review_text": "Great mix of RPG meets FPS. Realistic and captivating character interactions. You don't feel like you're controlling a character, you feel like you ARE the character. Decisions you make matter, choices will come back to haunt or reward you.  Play Mass Effect 1 first though. This is a MUST. You will lose out on so much if you do not play 1 first. You will appreciate, understand and enjoy ME2 more if you play ME1 first. Decisions you made in ME1 can and do affect the outcomes in ME2 when you carry over your character file.  Don't forget to make a BioWare account and purchase some official DLC. It may be an extra $20-$40 depending on how much you get but it literally made my second playthrough a whole new experience.  Play ME1. Play ME2 with all the DLC. Then again with ME3.  Seriously, you will poop your pants. Hard.",
            "review_score": "1"
        },
        {
            "review_text": "The second installment in an incredible trilogy of games. The story and characters are wonderful. However, I would make sure to play the first game before this one.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Best Mass Effect of the whole series so far.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 is the second installment to the Mass effect franchise. While Shepard’s story can begin here, I recommend that players play the first Mass Effect instalment. It greatly enhances the players experience of the story. Mass Effect 2 in undoubtedly a great game with reviews to match, but it has to join that list of games I hate, but still believe are great games and would defiantly play them again. I completed my play through on Veteran, since I felt the default was a little too low. The story of Mass Effect 2 definatly is the pinnacle of the franchise, with a strong opening, mid and end game. You decisions are impactful and extensive. The characters are more diverse and each has a story Shepard can partake in. The games complex mechanics from Mass Effect have been simplified for the better. Levels are streamlined and feel more accessible. Overall I'd say Mass Effect 2 provides the greatest story satisfaction. Players will walk out with what they put into the story. Now, when it comes to gameplay I'm not sure what to say. I want to be somewhat objective about games I play, but still give my opinion. I feel I need to go back a play the game again, but overall I'd say Mass Effect 2 was the most unfair of the three games. What I mean is that I'm one of those people who'll try the game on insanity just to see if I can do it. I couldn't, not because I was terrible at the game, but I felt that Shepard just could do the complex moves he needed to do. Besides that the Squad AI is terrible and dies very quickly putting all the heat on you, which usually mean that you die. It's the first time I've begun to play on an insanely high difficulty and found it unrealistic and unrewarding. What's weird is that I found Mass Effect 3 was possible on insanity, though it required a lot of restarts. Basically I think Mass Effect 2 is one of the mechanically bad games I've played. Everything works, but higher difficulties reveal that the combat and movement are basically broken and poorly implemented. All this said it’s a fantastic game overall and I highly recommend it along with the entire mass effect series. Mass Effect 3 (it’s sequel) is only available on Origin which is run by EA Games.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. A brilliant mix of roleplay and action. One of the best story lines of any game I have ever played. Highly recommended.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played this game, I'm sorry.    I've only been blown away a couple of times by a game, and this was one of them.  8.9/10 Superb game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, no issues for compatability etc...",
            "review_score": "1"
        },
        {
            "review_text": "highly disappointed that I can't continue my save game due to the fact that I'm unable to redownload the dlc that I own from the store. They apparently don't exist on the steam marketplace anymore",
            "review_score": "1"
        },
        {
            "review_text": "Spepard is back and kicking some Reaper ♥♥♥. Taking place after the events of Mass Effect 1 Bioware has successfully reperfected the wheel. Fixing issues that were pressent in ME 1, such as AI that don't respond to the player, weird cinematic bugs, poor textures and so much more. Given a great set of voice actors, an amazing score by Jack Wall and a story that will keep players on the edge of their chairs, Mass Effect 2 is a must have for Si Fi, action and/or RPG gamers. One of my favorite games 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "BioWare, the canadian RPG masters.  When I played the original Mass Effect, it was amazing, the story, the characters, their development. Seeing them becoming not just a bunch of heroes trying to save the galaxy, but a family. It blended everything from choices, emotions, relationships, gameplay, etc.  Then Mass Effect 2 came out, and took all ME 1 did, and made it way better. Watching the return of some of the old crew, and learning from their experiences alone, all of it gave me some of the most happy moments I ever had.  All I can say is, play it, it will not dissapoint you, unless you're not a big fan of RPG and space.",
            "review_score": "1"
        },
        {
            "review_text": "One time, I was wandering around Tuchanka, after completing    Grunt's loyalty mission    with Mordin and I heard that there were multiple breeding requests for    Grunt    one for Shepard, and, as one Krogan I was passing said 'And the Salarians, too!'  I lol'd.",
            "review_score": "1"
        },
        {
            "review_text": "why won't bioware let me be gay with Tali?? WHY",
            "review_score": "1"
        },
        {
            "review_text": "Excelent game, far better gameplay mechanics than the first one. 'Coolant' clips to keep your guns cool is a nice touch. Especially with each weapon having a dedicated amount of coolant so you don't blow through all your ammo with one weapon. Also nice, the new armor system. Makes choosing what to level easier each time you level.  Not as in depth on the individual character development as the first however. . . Largely, I think, due to not having the IC mission debriefings, and a much larger character cast.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 had two things that I didn't like: sometimes you get stuck on boxes because you can't jump, and every humanoid race is unnecessarily sexualized (except for maybe the krogans and batarians).  Outside of those two incredibly minor detractors, Mass Effect 2 is actually flawless. It's a ♥♥♥♥ing masterpiece. If you're even remotely interested in this game during a steam sale or whatever and you haven't played it, do yourself a favor and buy this ♥♥♥♥ing game. It doesn't matter if you haven't played ME1, this game eases you into its lore pretty well and it's good enough to warrant skipping the admittedly excellent ME1.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2:  - I come to the party late like 7 or 8 years, but yeah, it is still rocking!  You will not be disappointed by the game, you will be disappointed by Bioware and EA because they didn't include all the DLC in the deluxe edition, trying to squeeze more of your money buying their DLCs.   This game is a masterpiece! It is the 'Skyrim' in space, it is 'the witcher 3' in a parallel universe. Buy it! And play the ♥♥♥♥ out of it! It will make you go crazy wanting more and more!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Such an excellent sequel to the first game!",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite of the ME trilogy, which makes it my favorite game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played the last years.",
            "review_score": "1"
        },
        {
            "review_text": "And again, BioWare makes my recommend list because they ♥♥♥♥ING rock!! I can't wait for ME3...",
            "review_score": "1"
        },
        {
            "review_text": "The most difficult thing for any developer out there is to create a successful sequel to an award-winning game that features all the great aspects of the first game but none of its flaws and then even goes beyond that. Bioware does this with Mass Effect 2. I will not list everything that I like about Mass Effect 2 as the list would be huge but let me just say that one of the things that really stands out to me is the new combat system.  Where the original Mass Effect had a more traditional RPG like combat system, Mass Effect 2 successfully merges this with some third person action style gameplay allowing for a much heavier emphasis on combat like you would see in a shooter. Besides that all the things I love about Bioware games is still here. A great story, fantastic characters, well thought out dialog, great atmosphere, amazing graphics and so much more.  If you like Mass Effect or any RPG for that matter, you can not miss out on this wonderful game! Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 has a stronger shooter focus than the original Mass Effect. Whatever you feel about that, ignore your reservations because the plot, choices, and memorable characters hold strong - do yourself a favor and be sure to play the dlc, as it adds a nice topping on ME2's solid entry in the franchise.  Protip: There *is* a time-sensitive, no-going-back event in the game, and it would be good to search up a non-spoiler guide to tell you by when to have all the side missions complete.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite series of all time!! I have 4 full play throughs on xbox360 and I downloaded ME1 and ME2 for PC and it won't let me use a controller!! HUGE LET DOWN! I know, I know... if I want to game on PC then I should use mouse and keyboard....NOT!!",
            "review_score": "1"
        },
        {
            "review_text": "Takes the strong story telling element of the first game and leaves the RPG management behind; perhaps for the better. The combat is fun and engaging, the choices deep and consequential.",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect Series is a must buy. Best series.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "If you dont own this game, you have no idea what you are missing, Buy it... Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "Best Mass Effect 10/10 EA ♥♥♥♥ed up the third  #indoctrinationtheoryandsoon",
            "review_score": "1"
        },
        {
            "review_text": "Gaming legend. If you ask me what my favorite game series is, it's Mass Effect. I would suggest buying the trilogy from Origin to have everything in one spot and as E.A didn't like not having control on the sales prices they kept most of the products from Mass Effect in Origin. Whole series is worth you money, plus the dlcs. If you like being immersed in a fleshed out sci-fi universe with characthers you'll become attached to, then Mass Effect is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, addicting, in depth story.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best game I have ever played. It can compete with any new game that has come out even though it is a bit older. The story is incredible, I don't think any other game has made me care about the characters this much. The combat is smooth and fun. Personally I played as a biotic which gives you a lot of variaty in combat along with some badass powers. I cannot reccomend this game enough it is worth the full price and more.  P.S. I have a Windows 10 operating system and even though it said the game may not run on my computer it ran without any problems.",
            "review_score": "1"
        },
        {
            "review_text": "Best Mass Effect Game. Also, it's the most important. The decisions you make here will define basically everything in the third game.",
            "review_score": "1"
        },
        {
            "review_text": "Ocasionally the consoles get it right! Worth 20 hours of anyones life.",
            "review_score": "1"
        },
        {
            "review_text": "'Doctor Chocolates, you old ♥♥♥♥ (she knows too much).'  It's Mass effect 2. Like Mass Effect, but with a better combat system, more choice and Yvonne Strohovski in her native accent. What else do you want?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. Beautiful enviornments, character relationships, and action.",
            "review_score": "1"
        },
        {
            "review_text": "Love the whole trilogy and bought all the DLCs. Yes, the whole DLC system is very confusing, but worth it. My all time favorite singleplayer game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is more cinematic and better written than most movies.",
            "review_score": "1"
        },
        {
            "review_text": "Postively absorbing. Suitably action oriented combat paired to a deep story set in an intricate and believable universe. Although scanning planets to grind for recources will have you tearing out your hair!  An absolute must for any RPG or Sci-Fi fan.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say? I loved ME1 and ME2 is even better. The controls make much more sense and fighting is a lot more enjoyable. They got rid of the Mako which was a relief for me. I found the planet scanning quite relaxing actually.  The storyline is awesome and I love the interactions with C. I romanced Liara (in the DLC Lair of the Shadow Broker) and Garrus. The dialogues are as diverse and interesting as they were in part 1 and it was great fun.  I played once with a female infiltrator Shepard and I started another runthrough with a male soldier Shepard. The woman is paragon and the man is renegade and I like the way the personality influences the game and the interaction. It's quite similar to part 1.",
            "review_score": "1"
        },
        {
            "review_text": "Classic RPG elements with a 3rd person shooter feel. Best game of the series in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, great gun fighting. It's released in 2010 and I'm still playing it!",
            "review_score": "1"
        },
        {
            "review_text": "Get it and shove it up your ♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a nice, good looking RPG game that you should play. Had a lot of fun playing as shepard and playing some of the missions. Overall, great game.",
            "review_score": "1"
        },
        {
            "review_text": "Great Follow up from ME1 and better equipment than the first, introduces new allies and each brings new a feel towards the ME story.",
            "review_score": "1"
        },
        {
            "review_text": "if you're homeless and sad fat guy like me who has never done nothing you probably enjoy this game because shepard is cool and tries to save the world and shepard gets all the ♥♥♥♥♥ but not liaras in this one therefor bad game",
            "review_score": "1"
        },
        {
            "review_text": "Game is pretty straight forward.   It will have a MASSive Effect on you.   The Lore and content of the game is breathtaking.  From saving other races from extinction to banging galactic space babes.  This game is great 8/8 ",
            "review_score": "1"
        },
        {
            "review_text": "Mass Effect 2 has a stronger shooter focus than the original Mass Effect. Whatever you feel about that, ignore your reservations because the plot, choices, and memorable characters hold strong - do yourself a favor and be sure to play the dlc, as it adds a nice topping on ME2's solid entry in the franchise.  Protip: There *is* a time-sensitive, no-going-back event in the game, and it would be good to search up a non-spoiler guide to tell you by when to have all the side missions complete.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down, one of the best games on PC in the past 10 years.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect point for jumping into the Mass Effect series. Not constrained by traditional RPG trappings that are standard in most games within the genre. Characters are fun, believable, and engaging.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty neat!",
            "review_score": "1"
        },
        {
            "review_text": "I recently accepted the challenge of playing through ME1, 2 &amp; 3 back to back to back, and I'm glad I did. It's the only way to truly enjoy the story in full. Fixes everything that was weak about combat in ME1, and created a base that needed minimal improvement in ME3. ME2 definitely has the best overall story arc, even if a bit overstuffed with characters. Get them all and play them consecutively (sadly you'll need to pick up ME3 on Origin), the experience is completely worth it.  Oh and Miranda. Good god dang, Miranda...",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful sequel to a wonderful game. I would highly reccomend playing the first one first as you can transfer the save data over. I'm still 32 hours into my first playthough but I have a feeling I'm gonna be replaying this a few more times.   No other game has brought me deeper into another world.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Not as good of an overall story as Mass Effect 1, but combined with the first and third games, this makes for probably my favorite game trilogy ever made, and not becasue it's the only game trilogy I can think of off the top of my head. These games are more engrossing than most movies I've watched.",
            "review_score": "1"
        },
        {
            "review_text": "No comment is already a comment right? Lel",
            "review_score": "1"
        },
        {
            "review_text": "Can this wait a minute, I'm in the middle of some calibrations.",
            "review_score": "1"
        },
        {
            "review_text": "It's literally perfect for what it sets out to be",
            "review_score": "1"
        },
        {
            "review_text": "A must buy if you love a great story",
            "review_score": "1"
        },
        {
            "review_text": "  Great Game",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant sequel to Mass Effect. I am keeping this review somewhat vague for the same reason my review of the original Mass Effect was: the series is a sweeping science fiction epic that is a clear labor of love to the genre, and the less known going into the series beyond that, the better. Let it surprise you. I'd wager it will.  Side note: Given that Mass Effect 3 is not available on Steam, I cannot properly review it. Mass Effect 3 is a fantastic finale to an utterly incredible series, and I recommend it just as highly as the first two games. The three games together make for what is easily one of the most memorable experiences in all of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "I'd skip reading this review and just buy the entire trilogy. If you haven't played any of the Mass Effect trilogy yet, you are missing out tremendously. Deep and rich storylines, amazing third person shooter with XCOM elements (choose your party), and make your choices as a Renegade (evilish) or Paragon (good). 10/10 I'm sad I can't play Mass Effect 3 on steam.",
            "review_score": "1"
        },
        {
            "review_text": "It has massive improvment over its predecessor and is the best in the series.",
            "review_score": "1"
        },
        {
            "review_text": "The best mass effect game by a long shot.",
            "review_score": "1"
        },
        {
            "review_text": "Played through this game and the trilogy multiple times. I would recommend play all 3 in order but if you only want to play just one. Mass effect 2 would be the one.",
            "review_score": "1"
        },
        {
            "review_text": "Bioware at its best. Might be the best of the 3",
            "review_score": "1"
        },
        {
            "review_text": "One of the best sci fi game i ever played! Good story and graphics!",
            "review_score": "1"
        },
        {
            "review_text": "Simply would reccomend this game, it's amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding character design, not specifially visually, but their diverse stories, feelings and interactions with the player make for a rare experience. Combined with the world and story of Mass Effect (series) makes this game one of my all time favourites.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to pinpoint exactly what makes Mass Effect 2 such a good game. It has that magic spark that all developers strive for, but very few achieve. It could be in the myriad worlds, innovative species and unbelievably detailed lore, or the fantastically designed and written characters, every single one perfectly imagined. Or it could be the agonising, heart-rending decisions you must make, the consequences spiralling far into the next game with you.  Every facet of this game gleams with such brilliance, it's hard to play it just once. And the beauty of it is, it ENCOURAGES you to reply it in a different way, every time. Want to play a hardcore soldier, intimidating and coercing others through force and violence? Do it. Want to play as an Engineer with god-like biotic powers, helping everyone you come across? Do it. And the next time, experiment with yet another style.  Of the Mass Effect series, one of the most intense aspects is persistent effects of your choices. Kill somebody in the first game? They're gone for good. Anger or charm somebody in the second game? They will remember your treatment in the third installment. This gives the series such fantastic replayability that I have completed the trilogy more than 7 times (granted, on console) and each time, I discover a something new.  It's been six years since Mass Effect 2's release, and in six years more, I will still be playing it. It's never too late to experience this masterpiece for the first time. RPGS don't come any better.   ",
            "review_score": "1"
        },
        {
            "review_text": "My personal favorite game.   The conversations are the rewards themselves in this game. The best squadmates in the series. Good DLC. Unfortanetely I cannot offer anything else new to the reasons that already support why this game is awesome (emphasis on awe) in scope and style.",
            "review_score": "1"
        },
        {
            "review_text": "The feels, you're not ready for this much amount of character development. Also you can have sex :) !",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It's a shame that ME3 is not also on Steam. I took one character through the entire trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "Great Story, Characters, and Gameplay. I'll never forget the Mass Effect Series and my journies. Especially Mass Effect 2, arguably the best of the series.",
            "review_score": "1"
        },
        {
            "review_text": "An all-around masterpiece of modern video gaming.",
            "review_score": "1"
        },
        {
            "review_text": "Gold standard..period",
            "review_score": "1"
        },
        {
            "review_text": "I have since ported my save files from the Steam version of this game to Origin (I bought Mass Effect 2 as a part of a humble bundle, so I had keys for both Steam and Origin versions of the game) both due to several crashing issues I ran into with the Steam version of the game, and due to the fact you don't get all of the DLC for the game through Steam. As it stands I will review the game based on my experiences with both platforms.   Steam version",
            "review_score": "1"
        },
        {
            "review_text": "I was amazed by the first Mass Effect, and the second one is just as awesome. A tiny bit less RPG, but a lot presentation and action. The story in this one is verrry strong. One of the greatest RPG's! Highly recommended. Still haven't played the 3rd one yet, and probably never will, just because I don't want it to end...",
            "review_score": "1"
        },
        {
            "review_text": "I can finally sprint outside of combat.  ---edit---  I am greatly disappointed in one thing though, this version does not include some of the dlc. For example, the PS3 version included all of the dlc's such as the Lair of the Shadowbroker (which is hands down one fo the best dlc's ever), the extra character Kasumi, etc. This version only has Zaeed and a few weapons. When I found out it would likely cost me another $20 USD for the rest of the dlc, it left a bit of a sour taste in my mouth. I was hoping it would be the same version as the ps3 release, but it's not.  If you have a ps3, you can get the fully-loaded copy of it for $11 on amazon. It's a must better deal than this, since all of the exra dlc's must be bought through Bioware/EA's website, and there are no sales on those dlc's from what I've seen.  This game is one of my favorite RPG's ever. The game itself is absolutely fantastic, and with all the dlc's, there is a TON of content to enjoy. I'm giving it a negative review, because I thought it had all of the content for it, and it does not. There is nothing deluxe about it. Just a few free gimmicks, and a link to another site where you'll have to sink about another $20 to get the rest of the good content.  So it's really a question of value. $11USD for all of the content for PS3, or $40-$50USD (when not on sale) for PC. How they can still charge this much, when I got the PS3 version years ago for $20CAD is beyond me.",
            "review_score": "-1"
        },
        {
            "review_text": "Mass Effect 2 works fine but when i try to laod Mass Effect it instanly crashs",
            "review_score": "-1"
        },
        {
            "review_text": "ME2 is a good game. Vote is for EA/Origin &amp; Steam.  DLC content is not included in the install, only keys for it. Requires navigating the EA/Origin site to register the keys to DOWNLOAD the DLC to install it. Apparently did this a few years ago when I purchased it. Email address hasn't changed, account still existed, content attached to account did not.  This is utter ♥♥♥♥♥♥♥t and as a result, I will *never buy* another EA game. Will also never buy a game which has a similar bait and switch method to retrieve content from another source.",
            "review_score": "-1"
        },
        {
            "review_text": "Console port without controller support, waste of god damned money.",
            "review_score": "-1"
        },
        {
            "review_text": "I love Mass Effect 2, it is genuinely my favorite game of all time. The PC port however is shambolic. the mouse controls are broken without unreliable extrenal support as the sensitivity is way too high to be playable even on the lowest setting. The steam version also does not contain any of the DLC which is very important to the universe and character development of the franchise. The port also contains no native controller support to compensate for the ♥♥♥♥ed mouse controls. If you desperately want to play Mass effect 2 on PC then it is unquestionably wiser to go for the origin version instead. avoid this port at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "there's no m/m alien sex so this game ♥♥♥♥ing sucks. ♥♥♥♥ you, bioware. ♥♥♥♥ you",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game on the console and was amazed. The game is truly a piece of art but the settings and mouse sensetivity make it unplayable. Looked for a way to fix the sens but nothing helped since my folders didnt match.  Great game, but settings suck and u have to do way too much to make the game playable.",
            "review_score": "-1"
        },
        {
            "review_text": "Are you ♥♥♥♥ing kidding me? This game is worse than the first. I litterally quit playing hte first one about 20 minutes into it. I hate being forced to play on rails and do what I am supposed to do. I hate excessive cut scenes and cinematis and when I change ky bindings don't tell me to use an obscure combination of default key bindings to get something done. I wanted to kil that damn bald headed guy and the game would not let me then I open the door and an NPC kills him. Who is playing this? Me or the developers? Then I am forced onto a shuttle and yet another cut scene so that I have to shut down my PC to stop it. [sigh] give me some autonomy. I paid for the game... let ME play it. Take a look at Fallout and Borderlands if you need an example to aspire to. This game has an interesting story but is so badly executed that I cannot stand playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "NO controller support, game wasn't for me either.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful game. Uninteresting story. Poor combat. Ruined Mass Effect series. I've heard lots of complaints on number 3. I'm glad I couldn't make it through number 2.",
            "review_score": "-1"
        },
        {
            "review_text": "*has to do side missons to gain loyalty from allies that I dont even use in combat to progress with the main story*  ಠ╭╮ಠ",
            "review_score": "-1"
        },
        {
            "review_text": "What follows is my opinion and I can see I will definetely be in the minority on this. I loved the first game in this series because of its RPG elements. But in ME2 they decided to make it more into a third-person shooter and reduce some of the RPG elements. I'm not really looking for another third-person shooter because there are hundreds of them and others that do it better. I liked how the first one had a simplified combat system and although many of its systems and mechanics were not perfect they just needed some tweaking not a complete overhaul. I find many of the screens and UIs from the first game easier and faster to navigate/gather info where as the screens in the second game I find difficult and annoying. It seems like the majority of people love this game and that is good for them but I have no interest in playing this game to completion like I did with the first.",
            "review_score": "-1"
        },
        {
            "review_text": "Obviously not made for PC  (there i fixed it)",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a stinking turd. I liked Mass Effect 1 very much, and the developers just had to carefully expand it for the sequel. Instead, they recreated the interface and the gameplay in such a ♥♥♥♥♥♥♥♥ and dumbed-down fashion that words fail me. I am certain that this is due to console gamers (supposedly?) demanding games that fit into their monkey brains and work with their monkey controllers. For people who liked the first Mass Effect, it is a kick in the groin. Not everything was perfect in part 1, but I cannot name a single thing that improved in part 2. Greatest disappointment of the decade, and I will most certainly not buy part 3 next year.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this because I bought it and wanted to see what the hype was about. I was not impressed. The gunplay is lackluster, the ability system is significantly gimped and dumbed-down from ME1, and the story is the most nonsensical plot since Star Wars Episode 1. I mainly played ME1 (and by extention ME2) for its story and ME2 falls flat on its face in this department. The rest of the game's core gameplay just can't redeem it and I felt like I was just grinding through to the end after about the first 2 hours of play.",
            "review_score": "-1"
        },
        {
            "review_text": "adds nothing to the story, in fact the story takes some very wrong turns here in my opinion.  But I did like the final mission and how everything you did in the game actually mattered, if only they would have put that in the first game, and then just not made a second.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game for many hours trying to like it. Eventually I got bored and quit. It's quite large in scale and story and playability. But I found it slow and tedious. Some fight scenes but a lot of running around, cut scenes, reading stuff, performing tasks. Busy work. The graphics were excellent, visuals nice. Characters seemed entertaining and diverse. But the fun factor was missing for me. If you like that style of game, it's for you. If you are more of an fps guy like me, I think you will find it slow. It's one of those games designed to keep you busy for days and days. Too much work!",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine Mass Effect 1... but worse.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS TRASH",
            "review_score": "-1"
        },
        {
            "review_text": " Introduction",
            "review_score": "-1"
        },
        {
            "review_text": "Holy ♥♥♥♥ this game is overrated. By far the most overrated RPG (if you can even call it that) i've ever played. Shepard (the main character) was completely devoid of any charisma and it's not like he rarely talks. He talks allot in this game. The voice actor they got to do him is just sooooooooo ♥♥♥♥ing bland and vanilla. I think this game got such great reviews for all it's super soft core titillation porn. Oh yeah baby let's make out and dry hump with all our clothes on and then fade to black and fade back with the implication that we just had sex yet we're still wearing all of our clothes. What's up with all the aliens in this universe speaking perfect english. I mean the bulky dinosaur toad guy with the huge head and mouth sounds like a normal person. Like wtf!? It just makes me laugh. Seriously though the only thing that makes this game any more of an RPG than any other shooter on the market is all the talking and the ability to choose arbitrary dialogue. That's it. Customization is very limited and any items you buy are just upgrades for the few items you own and don't even change the appearence. This game has a really weak story line too. Very uncompelling which blows my mind this game got such a good review because THAT'S ONE OF THE MOST IMPORTANT IF NOT THE MOST IMPORTANT THINGS FOR AN RPG! I WANT MY 5 ♥♥♥♥ING DOLLARS BACK FOR THIS PEICE OF CRAP! the fact that this game is rated so high and is considered an RPG tells me that the glory days of RPGs are dead and so is the genre. We can thank all our mainstream critics and the developers of this game for it too.",
            "review_score": "-1"
        },
        {
            "review_text": "I love Sci Fi. I'm a huge Star Trek fan, and Red Dwarf is my all time favorite TV show. I've read dozens of books by Arthur C Clarke, Ray Bradbury, Robert A Heinlein, etc. My friends told me I would love Mass Effect, that it was perfect for me. They were wrong.  Mass Effect 2 was my introduction to this series, and it was a major dissappointment. The game is filled with generic sci-fi tropes, characters I couldn't care less about, and an endless number of cover based shooting sections that never seem to end. Kill generic humanoid. Kill generic humanoid robot. Repeat. That being said, the game has a plethora of incredible fluff written in the pages of the codex. It contains information about the technology, races, and history of the game's universe. Unfortunatly none of this seems to actually make it's way into the game itself. Instead, Mass Effect 2 feels like a mockery of all the brillaintly written material it contains. I found the whole experience boring, forgettable, and at times cringeworthy. I do not recommend this game to anyone who enjoys science fiction.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother; I found it boring.",
            "review_score": "-1"
        },
        {
            "review_text": "2/5",
            "review_score": "-1"
        },
        {
            "review_text": "This is the first game in the series I played and I have to say: I really don't understand the hype and praise this game gets. And beforehand to all the haters and trolls: You're welcome to leave a raging comment :) Just respect that not everybody likes this game. Thanks!  Pros: - Graphics and models are pretty amazing (even on low settings for my machine) - Character customizing - Cut scenes are very well done and really impressive - Always the option to choose between different choices in conversations - The story evolves (even when I have no clue what's going on)  Cons: - The fights are unbelievable boring. What is this, a tin shooting simulator? Pew pew, shouldn't we have better weapons in the future? - I had the feeling I got lost in all the stuff that's happening - The game mechanics are very irritating and had the feeling I did not get any help from the game, like a good tutorial or a clue what the hell's actually happening or what I'm supposed to do. - Hints like 'Press button X to do this or that' are not adjusted to personal settings / keyboard bindings. And this from a AAA game? That's sad. - The levels seem way to sterile, there's nothing to explore - The protagonist can run for almost three seconds. Now that's elite.",
            "review_score": "-1"
        },
        {
            "review_text": "After hours trying to make this game work due to it's phsyx bug, that i could not fix I gave up on trying to play it. Thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "Very dissatisfied with this game. I love mass effect and I bought the bundle of ME1 and 2. ME1 was great 10/10 and i had a blast. After beating the game i was ready to move on to the next game which is the 'delux' edition which means it comes with 3 codes that don't do anything. I go on and it says use the code to connect to EA 'cerberus space or whatever' and it works so now I can go to EA's website to DL the dlc. The site doesnt work when i log in it just becomes a fully functioning page with 0 content. maybe they deleted it because it is so old idk. I decided whatever i'll just port my ME1 character and play on. Steam ME games can't be ported w/o being great with computers and going through a bunch of steps. I figure whatever I'll make a new character and try it out with the 'genisis DLC' and try to find and use that because the default descisions made for ME2 are different from what I had done. I saved the council game says I didnt etc etc. Can't get the genisis DLC without buying it I went through the motions to see how much it would cost. Suprise suprise problems arose I cant even get the Genisis DLC to play the game. Game was over before I even played it.  I'm sure the game plays fine and if you want to start from ME2 not ME1 sure (w/o DLC) but i just didn't feel like playing after finding out all this.  TL;DR: Game effectively doesnt work (can't use dlc or import previous games) which is a no-go for this game for me. would refund if I could.",
            "review_score": "-1"
        }
    ]
}