{
    "app_id": 249990,
    "name": "FORCED: Slightly Better Edition",
    "release_date": "2013-10-24",
    "developer": [
        "BetaDwarf"
    ],
    "publisher": [
        "BetaDwarf"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Co-op",
        "Local Co-Op"
    ],
    "achievements": 24,
    "positive_ratings": 1804,
    "negative_ratings": 621,
    "price": 10.99,
    "description": "FORCED is a challenging 1-4-player game with co-op at its heart! A mix of tactical arcade action, RPG elements and puzzles will forge you and your friends together. As slaves in the toughest gladiator school of them all, you will face a plethora of unique trials - designed to be your death!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/249990/header.jpg?t=1503906717",
    "minimum_requirements": "OS: Windows 7, Windows 8 Processor: Intel Core 2 Duo, AMD Athlon X2, or equal at 1.6GHz or better Memory: 2 GB RAM Graphics: DirectX 9.0c-compatible, SM 3.0-compatible DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c-compatible, 16-bit",
    "recommended_requirements": "OS: Windows 7, Windows 8 Processor: QuadCore 2.0 GHz + Memory: 8 GB RAM Graphics: NVIDIA GeForce 8800 GTS or better, 512MB+ VRAM Storage: 5 GB available space Sound Card: DirectX 9.0c-compatible, 16-bit",
    "reviews": [
        {
            "review_text": "9\\10   Pros    something something Dark Souls, you have to understand how the level works or you die, there is no way to faceroll to the win    nice spells\\combo    awesome in local coop, you'll need to cooperate or you'll fail miserably    good graphics\\music   well scripted boss fights\\encounters    Cons:    probably it's unplayable in singleplayer    you'll definitely need a microphone   ",
            "review_score": "1"
        },
        {
            "review_text": "A great little coop puzzler. Good for frenetic combat mixed with puzzle-like multi-tasking. Has/Had some network issues the forced someone to be on the DMZ (seems to be resolved now).  Mostly a real good beer and pretzels iso fighter.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ING AWESOME!! (I might be biased)",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best 'Diablo 3' style local arena game I've ever played. The more local players you have with xbox controllers connected the better your experience will be but this can still be enjoyed by yourself.  The story is well done, the gameplay never gets boring and is fair, the enemies are challenging but too much and the traps and obstacles are intense and will make you think.  Just a really top game I would recommend this to anyone looking for a game that won’t disappoint!",
            "review_score": "1"
        },
        {
            "review_text": "Challenging to the point of frustration, exciting to the point of exhileration, this game is a must have for competitive players who are lacking a niche MMO or co-op game to satisfy their power gaming needs.  The game is deceptively simple (solve puzzles using an orb and three friends), but as the game progresses, the puzzles (and monsters) become devilishly hard.",
            "review_score": "1"
        },
        {
            "review_text": "great puzzleing mmo battle trough hard puzzles and make sure not to die from bosses and other mobs on your way",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with your friends in CO-OP mode. Needs individual skill and everybody to do their own job to complete certain dungeons. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! Great graphics, great gameplay, and a difficulty that needs a lot of skill. This game is definitly worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! Most fun when playing with friends and going through the trials. Best thing about the game is that each trials has different objectives and each objective may require implementing a different strategy in order to complete it. It is also fun playing bosses and cheering the last man standing of your team to survive while your respawn timer reaches zero.  When playing this game, however, expect their to be bugs and glitches. Not all glitches are bad though.",
            "review_score": "1"
        },
        {
            "review_text": "A unique game that combines both fighting and puzzle-solving skills, with the icing on the cake of the co-op mode in which you can play with up to 3 friends to complete the levels, using both your wits and teamwork. At first i thought it could be another boring 'kill and solve this thing to proceed to the next level' game, but damn i'm happy that i were so wrong.  The puzzles are infact part that has been very well integrated into the battleground of your levels, it means that you will have to both fight and use a spirit with the shape of a sphere (your main tool to solve these puzzles) in order to beat certain kind of bosses, or just to open a door while running from a swarm of monsters or either avoid lethal environment present in the level, or even activate some for your aid.  Even the fighting part itself is pretty nice, 4 different gladiators to choose from, each with their own weapons and unique skills that you will earn as long as you progress into the game by completing the levels themselves and their respective timer to beat, or some 'challenges' which will test your skills furthermore.  The requirements of this game are also kinda flexible, at the minimum of 2 GB ram i could've run this pretty smoothly, of course decreasing video quality, but with even more recent computers it can run decently at higher settings.  One of the best university projects that made into Steam, made with the Unity engine. Definitely a worthy game.",
            "review_score": "1"
        },
        {
            "review_text": "Lately I became a happy owner of 3 wireless game controllers.  Naturally I started collecting (more like 'hoarding') locally cooperative games. FORCED is one of the first i bought.  It was on sale, and had excellent reviews, so being always on a lookout for some local mp games I thought I'll give it a try.   It was an excellent purchase.  My buddy and I have sat through it's levels on numerous nights, from dusk till dawn, and couldn't get enough. Surprisingly though game is easy at first but very challenging in longer run. First few levels are kinda slow-paced and trivial, You get to know your characters and their capabilities, and you don't really care for speedrunning, nor challenges, But what's brilliant about this game, is that it makes you go back and revisit levels and play them through perfectly, for sake of progressing through other hard levels.  FORCED is a story of skill on a very interesting level. Game such as this- easy to play, hard to master- is not a very common thing these days, so I would recommend it to anyone. Playing with a buddy is greatly rewarding experience, so I'd recommend playing it in coop.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. was on offer for like £2.65 for deluxe edition. worth every penny. strongly reccomend. Yet to play co-op but still enjoying it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Absolutely wonderful for a party, even for just two. This is one of the few party games I have played that I have really gotten into, and it had about 10 hours of gameplay for the main campaign. This is one of the best games for you and your friends to just grab a tv and a couch, then play 'till your heart's content. No regrets.  10/10 would couch potato party again.",
            "review_score": "1"
        },
        {
            "review_text": "Yes i would definatly recommend to anyone that has a friend willing to join them. The gameplay is really fun and the co-op is just amazing. while the game isnt all that fun without a friend, i have played it by myself a couple of times seeing how fun it actually is. 8.5/10. There is no bad review to be given.",
            "review_score": "1"
        },
        {
            "review_text": "I do not understand why this game does not get more attention. It is such a solid game. It's very hard but nothing feels cheep. It's very simple but has deep, deep nuances. A lot of games boast larger tech trees yet this one feels much deeper. If you like Guantlet or Action Puzzler type games do yourself a favor and get the best one available: Forced",
            "review_score": "1"
        },
        {
            "review_text": "Good but you need friends for it. At least one friend.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, unsurprisingly. But it's also not very addicting.  I would compare this game to the old Gauntlet Legends games, but with more emphasis on puzzle solving and teamwork. The addictiveness of typical RPG's (like leveling up and collecting items) is kind of absent in this game. It's fun having the flexibility to select your skills and character at any time, but the skills are more like 'powerups' that you unlock through the game.  Overall, I think it has good depth, but the emphasis on puzzle solving makes it more casual, and not really a game to get hooked on.  If I had to give it a vague rating, I would say 7/10 and recommended.",
            "review_score": "1"
        },
        {
            "review_text": "i like Slarth. i wish my name was Slarth. i also like when I'm the ice guy and I throw my boomerang shield like Sivir in leeg of legends. those puzzles got me f*cked up tho. I suggest you play this with a buddy who knows about puzzles. specifically puzzles involving sentient orbs",
            "review_score": "1"
        },
        {
            "review_text": "A damn great game. Get a couple of friends together and get ready for a hell of a time. This game is by far one of the freshest experiences I have had in a while.. Again I did not play this game solo. I purchased the 4 four pack for only 6 dollars on sale and I can tell the 15 dollar price tag is worth it. Great puzzles that do not get repitive, bad ♥♥♥ boss fights that will have you screaming till the very end. Ah The laughs from this game. I def recommend this title, probly one of this years faves... Though I will say one con about this game ... the ♥♥♥♥en etchy glitchy ♥♥♥♥ is kinda annoying.. Minus that a solid game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Game of the year! I dont see why ppl are having problems prbably trolling or something i like turtles specially donatello. coop in this game is fantastic... single player experience is also cool if you are into mermaids... i would recomend this game to all swedish people ^^",
            "review_score": "1"
        },
        {
            "review_text": "This game is insanely fun to play with friends, as well as not overly easy, it requires teamwork and timing for each level to win the extra objectives. While the multiplayer might lag at times, i'm sure that is just part of the development cycle.  All in all, this game is a blast to play, and i would recommend you play with friends as the cooperation makes it more fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best coop games ive played. Its challenging, with fun puzzles and enemies. I'd love to play something like this again with my friends.",
            "review_score": "1"
        },
        {
            "review_text": "Forced is one of the best unity games ever made. an enjoyable coop game with some fairly difficult challenges and enjoyable combat.   -pros: Sound and music  A plethera of interesting settings and objectives  Some tough and unique bosses  Good voice acting for what little there is  Spirit Mentor mechanics  Combat and progression are fun and encourage you to be creative  Local Coop  -cons: The rogue and archer classes are far better than shield and hammer  Some of the completion times use to get crystals for new abilities are somewhat impossible to get  Playing with the M&amp;K after an hour and a half or so starts lagging the game  no pvp   It's still one of the best coop games to pick up and i would recommend to anyone.",
            "review_score": "1"
        },
        {
            "review_text": " 5.5/10  This game is only just on the recommend side.  The public games are a severe lack. There's no hot-join functionality, which means if people are trying to join in on a game they will interrupt the one already taking place.   When playing co-op the progress is limited to the person who has the least, and not the hosts - this does not encourage players who are father ahead to stop op and play coop, when they have to play the same levels over with the same abilities.   The movement with k/m is aweful. In most levels the best ways to move is diagonal and even between the 16 directions that keyboards offers. Without a joystick some levels require very a lot of focus on movement.  Soloing is possible but feels overly complicated and difficult. The mechanics of the levels stay the same no matter the number of players, only the number of foes are affected.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best multiplayer fun game i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "it's like Trine and Diablo had a beautiful baby",
            "review_score": "1"
        },
        {
            "review_text": "This is a very challenging action game with a lot of puzzles in the mix. Not the most difficult game you could be playing but still very difficult, Forced has you playing through a variety of challenges, from puzzles to boss battles to time limits. This was my first game to get 100% achievement status on, and I got that status within 12 hours, so obviously, the game is short. However, I have to admit the game was absurdly challenging and required a lot of patience and planning to play it properly.  Keyboard/mouse controls are great, so I did not bother trying out a gamepad, but there is Xbox 360 controller support. The space key is used for multiple actions, however, and I often had to restart levels because I accidentally called the orb when I was trying to skip dialogue. Not a big deal, mind you. I just found that slightly annoying.  The game could be longer, and I wish there were more character customization options. There are no visual customizations, but what I would really like to see are some more skill and stat choices. I felt like only a few of the skills and stats were worth using. Overall, the game was a lot of fun, and it is worth full price to me, but it is far from a perfected experience.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very nice game. I have tried it with one friend of mine and we both found it very inovative and refreshing. Cooperative play is fun and not very easy. It will challenge your initiative and reflexes. Sure it has some network issues, but other than that it is a very nice title, if you have at least one friend to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "Admittedly, this game IS challenging(and I do mean 'challenging'), but it's STILL a fun experience to play. I especially like the armor of each weapon class. If you haven't played this game yet, you should.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun! Can't wait to play more :)",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Just pure fun for skilled action gamer friends. I completely recommend it if you want a hard and rewarding action game to play with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "AMAZIN. Totaly a most by",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game! Beyond excellent design and a great ton of fun. Get four people you trust to play it with you and it will give you days of enjoyment!",
            "review_score": "1"
        },
        {
            "review_text": "This game is supposed for co-op.  Can it be played on single player? Yes Is it as fun as in co-op? Not even close  There are 4 classes, so it can be played with 3 more friends, where the objective per level is to solve the puzzle, and pass it. Simple as that at first, but some of them are hard, really hard, where 1 mind alone might not be able to discover the solution.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "This review is biased, I like progression and item decisions. This game only contains progression. The story is decent, the heroes are unique in their own way. Simply if you like solving puzzles with an added rpg element and have some friends locally, then you'll probably enjoy solving every puzzle. To me, the game is decent, it's not amazing nor is it bad, originally I had 'no' checked as recommended but changed. It's alright",
            "review_score": "1"
        },
        {
            "review_text": "You should play this game if -you like skillbased co-op games that provides a challenge -you are looking for an awesome game to play with friends (great for LAN parties) -you prefer crisp controls that gives maximum freedom (play with mouse/keyboard/gamepad whatever you fancy) -you enjoy making tactical plans for challenging encounters -you take pride in being good at the games you set out to play  You should NOT play this game if -you prefer grinding games where you can grind your way out of challenges -you don't like trying multiple attemps on a difficult encounter -you don't enjoy having a laugh with your friends -you don't like the fact that sometimes you need to becomie good at a game in order to beat it",
            "review_score": "1"
        },
        {
            "review_text": "Simply great puzzle action fun :) Great mutiplayer. All round solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Great little co-op game, still a bit buggy and not the most interesting story line but still good coop fun. Recommend if you have 1-3 other friends to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "Forced is a fun, creative, RPG that focuses on teamwork and problem solving. it is one of the best Indie games I've seen developed and would recommend this to anyone",
            "review_score": "1"
        },
        {
            "review_text": "Honestly one of the most incredible co-op titles I've played since Portal 2. The different classes are very diverse, and each has a large number of possible skill combinations. The gameplay requires communication and cooperation, as well as skilled gameplay. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "So bought this game as a 4 pack with some friends. Totally worth it! It's a sorta hack/slash rpg'ish puzzle game. You control 1 of 4 different characters (hammer, bow, shield, daggers) each has their own set of skills, passives, and playstyles. You work with your friends to navigate innovative maps and figure out puzzles all with the help of a little orb spirt guy. Every person can call this orb to their position so it can be trolly if everyone is spamming. It requires a great deal of communication as it sometimes requires you to bounce the orb from person to person but without letting it hit objects (part of the puzzle). I highly recommend you pick this up in a 4 pack and play with friends over voice chat as it can be very fun, quirky, rewarding, and frustrating all in one but there is sense of accomplishment similar to when you first beat a boss in an MMO when you nail a puzzle while 3 of your friends are dead and you are teetering on life. The simple combat systems works perfectly as there is plenty of other object happening on the screen to keep you active and always thinking.  There isn't a game out there like this on the market that I am aware. Anyone who plays with friends should pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "I just recently got this game and I'm having a lot of fun. The game is like a puzzle  roggeman93@gmail.com  game.",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome but.Can i have a question?If i buy deluxe edition,how to access black champion armor",
            "review_score": "1"
        },
        {
            "review_text": "Do not play with [HAUS]Trilderos.",
            "review_score": "1"
        },
        {
            "review_text": "its like diablo 3 with puzzles, and the controller setup is awesome ",
            "review_score": "1"
        },
        {
            "review_text": "YES! Such a unique, clever and ultimately FUN game. God damn, I'm so happy with this game right now.",
            "review_score": "1"
        },
        {
            "review_text": "Fun co-op mode. Easy way to kill a few minutes but will probably get old quick.",
            "review_score": "1"
        },
        {
            "review_text": "Fun co-op mode. Easy way to kill a few minutes but will probably get old quick.",
            "review_score": "1"
        },
        {
            "review_text": "You will yell, you will cry, and you will break your keyboard. You'll ragequit so hard, and come back begging for more. This game is just amazingly good fun, and demands to be played in coop with some sort of voip for maximum entertainment. Highly recommended, one of the best games to own. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A real surprise. From the looks I didn't found this any good. But wooooow! This is the best game I have tried in a loooong time. It's newly-thinking, extremely challenging and just too much fun - especially for the price. Tho' I cannot see myself playing this solo. You need them friends! ITS A MUST! :)  HUGE recommendation from me!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must have for everybody, who likes to play in multiplayer with his friends.  It just makes so much fun playing it with your friends and it´s really easy to get in to.  Singleplayer is decent too, but no where near the fun.  There are some negativ facts too: - graphic bugs are happening often and can take away the fun (e. g. being invinsible for your friends and yourself, usual blackscreen, etc. )   Except the graphic bugs this game is a must have for all top down multiplayer supporter.",
            "review_score": "1"
        },
        {
            "review_text": "If you’re looking for a challenging 2-4 player coop game, then look no farther. If you’re looking for a romp in the park, super lax fun-run, then you’ll probably want to keep looking. While the “Chalice” bit is kind of annoying the majority of the game mechanics provide a good set of challenges with extra level up bonuses for doing things faster and/or with more precision and finesse.   It’s not a perfect game and it’s not my favorite game, but it is easily a game you should play if you’ve got some buds and if the price is right.",
            "review_score": "1"
        },
        {
            "review_text": "Fun co-op game. A bit rough around the edges but supporting new developers with a good handle on fun adds to the enjoyment of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Underappreciated. It is actually quite a good game. Lesser-known, but worth the money all the same.",
            "review_score": "1"
        },
        {
            "review_text": "this game is sick. play it everyone forever and always",
            "review_score": "1"
        },
        {
            "review_text": "Got gang banged by 3 cows and 20 invulnerable statues 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, playing with friends is simply a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, but it falls off when you beat it.",
            "review_score": "1"
        },
        {
            "review_text": "This game warns you, best not played on your own. What it forgets to mention is how much fun you'll have over some beer and pizza, couch-playing this game on your steam-link! You're most likely going to die, often. And if you can manage not to look up any walk-throughs, count on figuring out some old-school boss tactics. Not too difficult, so far and heaps of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Do not play without friends. I don't think it is totally mean't to be played single player, at least not to get all the challenges.",
            "review_score": "1"
        },
        {
            "review_text": "The multi player is a lot of fun, game lobby is easy to manage as well also graphics are great one of the better linux ported games I've played, and woulld strongly recommend it to others.",
            "review_score": "1"
        },
        {
            "review_text": "do you like bball? this is the game for you - shoot some hoops while hackin 'n slashin",
            "review_score": "1"
        },
        {
            "review_text": "Even though the game doesn't play too well for a single player, the true power is in the co-op. If you feel like you're up for a challenge with three of your friends or even more challenging, three strangers, this game is for you. There are some small glitches and problems you may run into while playing online, but thankfully, it's never game-breaking.   I would suggest this game for anyone who likes having a good multiplayer experience, especially since every character in the game has a completely different moveset. Try it out and have some fun.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. Could not clear the 2nd Boss yet tho :D",
            "review_score": "1"
        },
        {
            "review_text": "Eh, yeah but no It is very hard and if you play with someone how is autistic it is near impossible and one of the classes is ♥♥♥♥. Other than that it is pretty good, got a good puzzle aspect and its a challend and oh btw hi Luke",
            "review_score": "1"
        },
        {
            "review_text": "This is best 'throw-away' four player coop game I've played since Champions of Norrath.",
            "review_score": "1"
        },
        {
            "review_text": "For all thoose who seeks challenge, who feels bored by most game, this gem is THE amazing game you were looking for.   Do you want to know what a challenge is ? Try this game, you'll find a way of meaning to the word challenge. You need to be quick, accurate, and you deserve what you got. By this, I mean you can grow you char by a lot of ways, but only when you did things well enought to earn the point you need. This isn't a level up system, this is a 'you performed well enought, you are worthy, so take this gift, you'll need it soon and for long' system, and this feels GREAT !",
            "review_score": "1"
        },
        {
            "review_text": "Allows you to play local co-op with up to four players using keyboard or xbox 360 controllers.  Good graphics, simple gameplay. fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome coop gameh",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fun multi-player.",
            "review_score": "1"
        },
        {
            "review_text": "Are you and (+1/+2/+3) friend(s) looking for that new, fun and challenging coop game to play. Look no further! Forced is worth it's asking price, and a ton of challenge and fun. It also has enough variaty to keep you on your toes for quite awhile. I approve this game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty cool game, with some annoying issues. You (and a few others if you play online) must complete a series of challenges to advance. You're afforded the choice of four different weapons - they all play quite differently and come with their own set of abilities and buffs. And each challenge gives you up to three crystals, and when you get a number of crystals, you get new abilities.   It's a pretty unique take on this type of game, as you can't really 'grind' to level up, at most you can get a couple new buffs to help yourself out, if you master previous challenges. Because of this, it comes down more to strategy and skill, and can become quite fun in some segments.   Sometimes, however, things can be a pain in the butt. Certain challenges or bosses seem to combine the most annoying parts of the game all in one, in seemingly unfair ways. And though the game says that it's balanced for either 1-4 players, more players simply make it easier in so many ways.   That said, I really enjoyed the game, when it wasn't being irritating, and would recommend it to others who are looking for a challenging title to play along with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ALOT of fun... VERY intuitive controls and fun oriented graphics (crisp, solid finish but not too serious to weigh down your system).  The ONLY thing wrong with this game is that there isn't MORE OF IT YET!!!..I beat it in 8 hours, although there is still plenty more objectives to go back and get (each stage has a completion crystal, an objective challenge crystal, and a 'beat within this much time' crystal) more crystals.  Time to go play with my buddies to see how the levels change with co-op puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Really great co-op game from the ground up!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good arena game. That's all :D",
            "review_score": "1"
        },
        {
            "review_text": "Forced is an arena challenge/puzzle game with co-op than can suck out your time like nothing else. In this game you're a tribesmen trying to earn your freedom , being helped by the spirit master, sorting through several challenges (total of 25 levels including final boss) to earn power. Each time you complete a level you earn a crystal, if you complete it again doing the time challenge or the skill challenge, some are really hard even playing with 3 friends, what's unfair is than some of the skills and passives require a lot of crystals, being the final passive of each class requiring 75, by then you would have completed the game 100% so why would you keep playing?. The 4 classes are spirit blades some sort of assasin, Volcanic hammer the warrior, The Frost Shield being the paladin and the Storm bow being the archer (obviously), you can swap classes anytime before tackling on a level without any kind of penalty. The levels are either purify temples, destroy stuff, kill stuff, and kill moar stuff, all of them requires strategical use of the spirit mentor which can heal you or aid you depending which shrines you use him to activate, some are really fun like the arena with the spinning laser in the centre, and challenge don't take cover from it. The game is great fun with friends but frustrating very frustrating if you wish to proceed all the way to winning the game, you can grab it during sales fairly cheap to try with friends",
            "review_score": "1"
        },
        {
            "review_text": "Very nice coop game. I don't know if many will get the reference but for the old school arcade players this game is very similar to gauntlet legend in terms of gameplay. The mechanics are really creative and the puzzles are really dynamic. This game is a most have if you miss playing RPG with your friends.   on a side note avoid this game if you are looking for a sologame or if you are looking for a game where you actually play for a bit alone and your friends just kind of jumps in from time to time. THE GAME IS MADE TO BE PLAYED ENTIRELY COOP to enjoy it in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "This is a good arena game. That's all :D",
            "review_score": "1"
        },
        {
            "review_text": "One of the best pc couch co-ops yet. Gives a feeling of the old gaunlet arcade with a lot more depth.",
            "review_score": "1"
        },
        {
            "review_text": "Singleplayer: I would not recommend it. Multiplayer: Funny as ♥♥♥♥. Must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Man, I've played a ton of puzzle games in my days, but this one takes the cake. So get this. You get to choose 1 of 4 classes, all with unique abilities and such, and up to 4 people can play together. Every level has some kind of catch to it. Some are timed, some have puzzles you have to solve, and some spawn enemies constantly unless youcan find out how to stop them. After every 5-6 levels, there's a boss. The bosses are freakin cool as hell. And the combat is awesome. Those abilities I talked about? You unlock more by doing better in the puzzles. The only downside I can think of is that you are constantly followed by WIsp from DotA 2. And he talks. Wisp doesnt talk, he makes bleepbloop sounds. Stupid Wisp, learn your place.",
            "review_score": "1"
        },
        {
            "review_text": "Not really my game, but not a bad game either -- if you like objective-based challenges and twitch/button-mashing action, it might be more up your alley... it also adds a teamwork element that if you refined it with friends could be gratifying... I just didn't stay with it.",
            "review_score": "1"
        },
        {
            "review_text": "this is one of the best games I have played. It not only is an older style game, but it also has the challenges and quirks of new generation game. PLAY PLAY PLAY!",
            "review_score": "1"
        },
        {
            "review_text": "How the ♥♥♥♥ is steam letting these people sell a broken game???? It's BROKEN. 50% of the people who buy this game, do so with the intention of playing w/ friends. However, CO-OP is BROKEN. Steam, get your ♥♥♥♥ together.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically like reverse football in a gladiator arena, it's super fun!",
            "review_score": "1"
        },
        {
            "review_text": "this game is really great for if you don't have mario party but do want to destroy some friendships",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Co-op game for you and three other friends!",
            "review_score": "1"
        },
        {
            "review_text": "Great Coop game - simple controls; interesting puzzles; simple HUD for all the team is shown on your screen; each class has its own niche that really fits well with the others; up to 4 people.",
            "review_score": "1"
        },
        {
            "review_text": "Great, challenging gameplay. As you complete challenges, rewards are shared by all classes, which you can change before any challenege. Writing is decent, graphics are beautiful, and diverse abilities between classes mean that each challenge can be completed with several different strategies, and you will need to learn them pretty damn well to be able to complete some of the harder time trials or special requests.  While built for multiplayer, still a very fulfilling single player experience!  Also, runs very smoothly on my 6YO laptop (meets minimum requirements, haha...) on medium graphics. Some particle effects cause a bit of lag, but in general the experience is fluid and fast.",
            "review_score": "1"
        },
        {
            "review_text": "Forced is an arena challenge/puzzle game with co-op than can suck out your time like nothing else. In this game you're a tribesmen trying to earn your freedom , being helped by the spirit master, sorting through several challenges (total of 25 levels including final boss) to earn power. Each time you complete a level you earn a crystal, if you complete it again doing the time challenge or the skill challenge, some are really hard even playing with 3 friends, what's unfair is than some of the skills and passives require a lot of crystals, being the final passive of each class requiring 75, by then you would have completed the game 100% so why would you keep playing?. The 4 classes are spirit blades some sort of assasin, Volcanic hammer the warrior, The Frost Shield being the paladin and the Storm bow being the archer (obviously), you can swap classes anytime before tackling on a level without any kind of penalty. The levels are either purify temples, destroy stuff, kill stuff, and kill moar stuff, all of them requires strategical use of the spirit mentor which can heal you or aid you depending which shrines you use him to activate, some are really fun like the arena with the spinning laser in the centre, and challenge don't take cover from it. The game is great fun with friends but frustrating very frustrating if you wish to proceed all the way to winning the game, you can grab it during sales fairly cheap to try with friends",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I may have a small play time but i will be playing this alot more. It's sortof like an arena/dungeon crawler type of game, but evolved into a mega baby.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me ANGRY. I am a game developer and this is almost the EXACT freaking game that I want to make. The difficulty curve is BEAUTIFUL and the challenges show a great scope of design. Play this game!",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious",
            "review_score": "1"
        },
        {
            "review_text": "Изумительно!  One of the greatest coop games!",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you have a little group of friends to play it with. Having tried to play this alone it's either stomping the level or borderline if not entire impossible to complete some levels. Still, if you have some folks to play with it's great fun, so much trolling around with the puzzles and whatnot and it gets really disorienting when you're trying to do a fight which involves rotating a mechanic between your group to avoid getting melted by a boss fight. I doubt I'd come back to this after a while, though still it's some good hours spent with friends.",
            "review_score": "1"
        },
        {
            "review_text": "good game but need company to playyyyy `cause the wisp doesn't talk back to you damn spirit  #found out recently multiplayer has alot of fkn issues trying to connect and play with your friends so not cool.... not really worth it especially when it's main purpose is for multiplayer....",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly well voice acted and thought out. Wonderful that they let you change your 'class' on the fly, so all players get to learn all the tricks. Levels are tricky without being perversely hard. Definitely more fun with friends, a process that is handled totally smoothly through Steam.",
            "review_score": "1"
        },
        {
            "review_text": "If you like challenging co-op experiences with no XP or other such nonsense then Forced is made for you. Good enemy design and varied challenges make this good etiher local co-op or over the Internet. This game is a bit heavy on puzzles vs tactical situations which is unfortunate but it's still early access so that may change.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game, the concept is refreshing. However, it feels like the boards in the 3rd section are a bit to hard for 3 or 4 man teams. I wish there was a level-set, like easy, med, hard.",
            "review_score": "1"
        },
        {
            "review_text": "great multiplayer game",
            "review_score": "1"
        },
        {
            "review_text": "Really awsome game",
            "review_score": "1"
        },
        {
            "review_text": "Very good game Best for those who like teamwork and puzzles",
            "review_score": "1"
        },
        {
            "review_text": "This game makes everyone so mad at each other and it's the best thing ever. It's like world of warcraft raiding with 4 people except it's diablo and super hard mode.  and then after you're like holy ♥♥♥♥ that was hard, then it says 'you're not that good.'",
            "review_score": "1"
        },
        {
            "review_text": "10/10 concept if you play it with friends. A LOT of fun and amazing puzzles.  My experience with the game was not the better, I brought it on launch and it had some big issues, but looking at the latest patches, it seems that they're constantly trying to fix things and make it playable.  Anyway, even with problems me and my friends managed to get over 10 hours of gameplay out of it. So it's recommended.",
            "review_score": "1"
        },
        {
            "review_text": "absoloutly ♥♥♥♥ awful",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Forced - Review Episode 193&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Now this is a bit of a throwback. Remember those arcade games back in the 90's where it was a top down view and you had 4 characters, each with their own unique abilities? That pretty much sums up this game in a nutshell, but it has some really good gameplay, graphics, sound design, and puzzles. I say play it with 3 of your friends for the best experience.",
            "review_score": "1"
        },
        {
            "review_text": "this game is easy to get into and fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Great co-op game",
            "review_score": "1"
        },
        {
            "review_text": "Ok, you may call me masochist, but i managed to finish the game solo, it was painful, i raged, i cried and boy was it frustrating, what i am trying to say is, if you are a masochist, solo it, if you still want to try it but you would like a less painful playthrough you should gather some friends and buy a four pack since the online is kinda empty by now. Graphics are nice and environments are diverse but nothing you haven't seen, you have dungeons, deserts, jungle/swamp and a greenfield looking gladiator arena. Controls (at least for xbox controller) work fine, they're responsive and accurate but they are not fully supported or should i say buggy on the menus, but on combat they're totally perfect. It's a hard to beat game that made me feel like playing a simplified top down version of dark souls, i really recommend it, ON THE OTHER HAND YOU COULD ALSO SAVE YOUR MONEY FOR FORCED 2 WHICH HAS ALSO BEEN ALREADY ANOUNCED. In any case, i recomend this game if you want a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice coop game. I don't know if many will get the reference but for the old school arcade players this game is very similar to gauntlet legend in terms of gameplay. The mechanics are really creative and the puzzles are really dynamic. This game is a most have if you miss playing RPG with your friends.   on a side note avoid this game if you are looking for a sologame or if you are looking for a game where you actually play for a bit alone and your friends just kind of jumps in from time to time. THE GAME IS MADE TO BE PLAYED ENTIRELY COOP to enjoy it in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "A fun and challenging co-op action/puzzle game. It's not really an RPG such as Torchlight II or Diablo, but is instead focused on having four different weapon classes to take on challenges known as 'Trials'. Completing each trial will unlock crystals that automatically unlock abilities across your weapons. You can change abilities and weapons before any trial, so no need to worry about taking the wrong things. There is also this orb that you can control and is the main aspect of pretty much all puzzles, and even some combat.  Bought during sale. I really enjoyed this game. Highly reccomended to play if you have any friends to play with, as it can be a bit dull alone. It performed better than my expectations, and was well worth my money.  Obligatory pro's and cons:  + Really fun for 2-4 players + Handles multiplayer scaling and progresses in difficulty very well. + Fun combat and classes + OH GOSH SO MANY ENEMIES TO KEEP IN CHECK WHILE TRYING TO CONTROL THIS ORB AND BEING CHASED BY A GIANT SPINNING DEATH LAZOR  - A bit dull alone - Slight lagspikes at times during multiplayer (could be my internet, though) - Orb-controlling is slightly annoying when you're not co-operating properly in multiplayer. - OH GOSH SO MANY ENEMIES TO KEEP IN CHECK WHILE HAVING TO CONTROL THIS ORB ACROSS A GIANT SPINNING DEATH LAZOR FIFTEEN TIMES  Final score: 8/10 so far. Reccomended to buy during sales, but 14€ is worth it if you're into this kind of games.",
            "review_score": "1"
        },
        {
            "review_text": "A pain to get all the gems !",
            "review_score": "1"
        },
        {
            "review_text": "Awesome if you like a challenging game. Definitely much more fun when played with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics, simple storyline and its fun to do challenges on trials",
            "review_score": "1"
        },
        {
            "review_text": "Great co-op fun, 2-4 players.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game, it has great soundtrack, fairly simple to play but challenging nevertheless. The challenges and time trials add lots of playtime to achieve.  However, buy it only if you intend to play it with friends or family, it's not very good as a single player game",
            "review_score": "1"
        },
        {
            "review_text": "Great CO-OP game, does get tricky quiet fast, but alot fun playing with friends",
            "review_score": "1"
        },
        {
            "review_text": "The first few levels and puzzles where fun, then things turn out to be repetetive; when dying you have to start over at something that takes a bunch of time. Meh, I'll pass.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy. The company has not fixed any of the multiplayer issues involved with this game. WAste of money and time.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not get this game for single-player. CO-OP is probably a much better experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Seemed like a real fun co-op game but sadly none of our group were able to play it on multiplayer due to horrible lag.. Until this is fixed, I cannot recommend this as a co-op game  Singleplayer worked fine, but who wants to play single in a co-op game?",
            "review_score": "-1"
        },
        {
            "review_text": "This was a failed attempt to merge 3 different genres: RPG, Top down hack-and-slash, and co-op puzzle solving. Its claim to fame is that players are supposed to cooperate in puzzle solving while being assaulted by waves of enemies. However, these systems work against each other. The AI enemies are not threatening enough to pose as a threat; they become a mere annoyance as you try to solve the puzzles to finish the level. Likewise, the co-op puzzles aren't very good either; instructions and tutorials are vague, but if you manage to guess-and-check your way to the solution, you'll find many levels that repeat the same type of puzzle. The co-op system doesn't really work with puzzles; you'll be fighting your friends for your idea of problem solving, instead of collaborating to complete the challenge. Connectivity is horrid, and although the game features 4 different classes, they feel somewhat similar against the same dull foes. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Up front, Forced appears to do a good job of blending Guantlet arcade-style smash'm up with ARPG elements--added to with a touch of simple puzzle solving. Sadly, the game idea that Forced is needs much more...  For Single-Players, or Solo-Play:  The attempt at a story is more of a hinderance and should've been left out almost all together. The general direction in design is pretty spotty and left me feeling non-plussed several times as I attempted to learn one mechanic or another. The challenges are a bit too tightly setup, and are limited in scope. Thus, completing challenges unlocks abilites, and so you find yourself 'forced' to wait for much good deal of the fun the game can provide, repeating the same stages over and over. Also, a key element in the game, your spirit mentor, could be so much more interesing. Last but not least, the graphics really could be better, indie or not.   As much as Forced is a solid idea, the production quality and execution are both sadly lackluster...and that voice acting...yikes.",
            "review_score": "-1"
        },
        {
            "review_text": "Got a copy for my wife and myself looking to play some co-op. As with the many other posts have not enjoyed a single second of gameplay. Only an hour or so of attempted troubleshooting. No go with 1.08 or with 1.10 beta.  Valve should NEVER have advertized the game as its broken in its current state.   0/10 for charging money for a broken product.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically just a super dumbed-down version of torchlight or diablo 3. Fun for about a half hour because there is no exploration whatsoever (maybe I was wrong to assume there would be), no loot or gear, and only a handful of weapons with 1 special abilty each. You can only have 2 abilities equipped at a time. Maybe further in the game there's more stuff added but clicking on the small variety of enemies with the same 2 attacks in miniscule maps is just not enough to make me want to progress.  Oh and the puzzle aspect is so basic, tedious and unrewarding that its not really worth mentioning.  But hey, the graphics aren't bad.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want to play with your friends to this game forget it, it never works for us.",
            "review_score": "-1"
        },
        {
            "review_text": "Holy MOther of GarBaGe... the multiplayer feature of this game is worse than any muliplayer I've played in the past 18 years. It doesn't even work. At least other games are laggy or just plain bad. FORCED multiplayer is just broken and since Forced IS A GAME INTENDED TO BE PLAYED WITH FRIENDS, the whole game is broken. The failure of this game is even more monumental than the story of how it was created.",
            "review_score": "-1"
        },
        {
            "review_text": "Games has poor hit detection and isn't meant for single player. I couldn't even make it through the Hall of Trials 4th section because all the enemies move at least 3x as fast as the character. Also, the game mistakenly assumes that you are playing multiplayer game even though I am standing there alone in single player. It still uses plural forms. Really? You couldn't be bothered to change the text or the audio? I couldn't be bothered to play it again. I was expecting something better than this. Why does the character move so much slower while attacking? Realism? This is a fantasy game! I haven't tried the multiplayer, and I am not sure if I want to after my poor first impressions from the single player. Borderlands also gave me this problem. I regret buying the 4-pack of this game as I don't really want to share it with anyone else. I might change my review if I play it again in the future. For now though, as a single player experience, this game leaves MUCH to be desired. I'm going back to Torchlight II.",
            "review_score": "-1"
        },
        {
            "review_text": "What is the point in having a game like this where you cannot, play the multiplayer co-op. Patch or no patch. Please don't call it a complete game and waste my time and money. No wonder it was on sale, so you could rip a few people off.",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry, I don't recommend this game. This game was compared with Torchlight, but I don't agree. It definitely has that Indie feel to it whereas TL2 is very polished. Forced is also puzzle levels with monsters thrown in, not dungeon crawling with bosses. Granted, I didn't play long; only up until the 5th 'trial'.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks! I was kicked out of my group because it only worked with three players. It has a bug that makes you control the same character as someone else. Do Not Buy!",
            "review_score": "-1"
        },
        {
            "review_text": "I can't speak to how this game plays in a co-op setting, as of July 2014, there is no one left playing this game anymore - but I can speak to its single-player campaign.  This game is simply not fun if you play by yourself. Everything is balanced for multiple players, after the first couple trials, the game simply becomes tedious if you're trying to do everything on your own.  While I appreciate a good challenge, this game focuses on the wrong place. The puzzles are brain-dead easy, and the single-player challenge simply comes from throwing an ever-increasing amount of mobs at you. If it was possible to out-run these enemies and kite their numbers down, it would be manageable, but as they all move faster than you and, in many levels, respawn faster than you can kill them it makes the singleplayer game completely unenjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Was fun initially, but then became too difficult to enjoy. Retrying a level 3...4...5 times -- OK. When you can't beat a level after 20 tries, it's time to quit playing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "FORCED is awesome, great combat, while still having mind melting puzzles. Singleplayer is very, very hard, but sadly EVERY COOP GAME has to go through steams connection system. And even more sadly, servers suck, and you cant host a game on yor own, so, you have to play with huge ping to the steam server, making a game that relies on skill and split second reactions unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ no. Buggy as ♥♥♥♥. Didn't look special when it did work.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing a couple of hours, I figured out this game's not for me. I bought it really cheap, but still I regret the purchase. One thing I didn't like at all is the game's controls; I couldn't play it with a gamepad so I used keyboard+mouse.",
            "review_score": "-1"
        },
        {
            "review_text": "Had brief potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Its fun with friends. alone? youll get bored within the 1st few hours...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great if you have some friends to play with, not so much if you want a solo rpg.",
            "review_score": "-1"
        },
        {
            "review_text": "so bad even my controller dont want to play that ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "The camera for multiplayer in this game is horribly broken. When the players are further apart than half a screen, your view gets offset and zoomed out to keep all players onscreen. You are no longer the center of your screen. It was a very poor design choice.  Secondly, some of the challenges require specific skill combinations. Part of the challenge is figuring that out. I detest this use of the skill sets. I would like to play using skills I enjoy, not skills that I must use to progress. That is another very poor design choice.  My last gripe is that I don't feel like the game has much replayability. Once I complete a very difficult task and get the extra gem, I don't want to do it ever again. That isn't a desireable feature for any game.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing sucks dont buy this crap",
            "review_score": "-1"
        },
        {
            "review_text": "Step 1) Decide to try another MMO  Step 2) Download free trial version of FF14 from friends' suggestions  Step 3) follow instructions (including letting them know I need to make a square enix account)  Step 4) Page comes up where I can type in information. Immediately crashes when attempting to type first character. Not worth my time or anyones time. How good can a game be if they can't even get their launcher right.   I miss old Squaresoft.",
            "review_score": "-1"
        },
        {
            "review_text": "Cannot get this game to work on co-op. crashes when trying to get my friends to join a party. If one tries to join while we are playing, the game forces all of us to restart, cannot join in game. We cannot still get a party of 3 going, if we are lucky we will get it going after 30 minutes of trying.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is Gauntlet's ♥♥♥♥♥♥♥♥ cousin who dropped out of school to focus full time on their passion for competitive paint chip eating.",
            "review_score": "-1"
        },
        {
            "review_text": "Good thing it was only $4. Trying to join a coop game is like pulling teath. Obviously no one plays this game anymore, and the server keeps declining me.",
            "review_score": "-1"
        },
        {
            "review_text": "Having major stability issues here, bough a four-pack, and the game seems neat, but refuses to run on my OS X (10.10.5) Powerbook. Buy a single-seat and make sure it works before getting multiple licenses!",
            "review_score": "-1"
        },
        {
            "review_text": "I don't even know why I bought this game, maybe it was shiny, who knows.   What I do know is this game is unfinished.  I honestly thought this was just an early access title like many of the others, but no it's not. I checked the store page 3 times to make sure.   This game has terrible audio mixing that makes most combat and music either too soft or not audible at all. The sounds are extremely far away if you are using headphones. Voice acting was bad, kinda the reason I wrote that first review after playing the starting trials. This game is just one gauntlet of completionist challenges. Honestly this is battle block theater if you take the platforming away and made it too serious.   Really the most laughable part is that they included a built-in twitch streaming platform. In a game that is so boring and requires co-op to be any fun, why do they need to include this? The game is the same ball puzzle, as far as I've played. Use your floating ball to activate shrines and destroy arbitrary spawners and statues.  You play the same character as everyone else just in different armor. I say charater but your just a gladiator without a name or face that wears different armor depending on what the lobby leader ♥♥♥♥♥es at you to be. It's a nice feature that you can change classes at whim so there's no commitment to a certain role. With the human husk of a character the story is terrible and the meat of the game is left to repetitive arenas one after the other.   Meh, the game's just boring, noticibly unpolished, and requires multiplayer for fun. Also multiplayer is buggy and won't connect at times.   So what can you do, play a better game at least.",
            "review_score": "-1"
        },
        {
            "review_text": "At $5 Its maybe worth it. Multiplayer is difficult to function and rarely works properly. And there needs to be some character gear to alter your character besides the 3 abilities to get to have ready on hand, and 3 passive tweaks. Thats if you take the time to level up. Which is done with progress only, If you get stuck your stuck. And you will be grinding old levels for challenges that might yield enough to continue. I played the game for about 2 hours before i realized how lacking it was in gameplay, Its more a puzzle game with some fighting on the side. All in all, i would take a pass unless you have 3 other buddies who want it, and time to spend with this poor multiplayer connection.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed the combat aspect of the game, the variations on possible builds, and the gem rewarding achievement system. But managing the will-o-wisp to activate powerups, necessary to win most levels, was really annoying. It took a significant amount of energy and concentration to move around the battlefield to manage the wisp, rather than letting me focus on the combat. That part of the game did not really add to the challenge so much as felt like busywork I had to do while trying to play the game.",
            "review_score": "-1"
        },
        {
            "review_text": "[/h1]Boring and monotonous, I got it as a joke gift, its tedious quests don't makeup for the bad voice acting and framerate. Please please please dont waste £10.99 on this game i can guarantee that there are better games you can spend your hard earned money on.[/h1]",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game.   Bought a 4 pack and have regreated it. I tried to play for 20 minutes and the game breaking bugs and clunky mehcanics are not only no fun, they are enraging.   Do not buy! You have been warned.",
            "review_score": "-1"
        },
        {
            "review_text": "I HATED THIS GAME. I was fooled by the reviews. This game is frustrating as hell. It's the type of challenge that feels like work and I play games for fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Hard to understand how to play it in local co-op and it also have some bug using the Xbox 360 controller in the game menu",
            "review_score": "-1"
        },
        {
            "review_text": "If a friend tells you that he hates you. Buy him this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Well not bad. But if you got pulled in cause of the interesting combat system, and thought it was cool. You are gonna get some disappointment. They rely heavily on a puzzle solving mechanic, which controls like an octogenerian. Which is sad cause it makes some of the more interesting battle challenges be over way too fast. Im giving this a no recommendation. Because it pulls you in as an action packed game. And it is but it is also way too much a puzzler that controls really slow and annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "On the first day I played FORCED, my buddy hosted the game. I couldn't move my character. On the second day I played FORCED, I myself hosted the game. The game crashed the computer. On the third day I played FORCED, my buddy hosted the game. FREEZE EVERY FIVE ♥♥♥♥ING SECONDS.  11/10 Would be forced to crash again.",
            "review_score": "-1"
        }
    ]
}