{
    "app_id": 250460,
    "name": "Bridge Constructor",
    "release_date": "2013-10-16",
    "developer": [
        "ClockStone"
    ],
    "publisher": [
        "Headup Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Casual",
        "Indie"
    ],
    "achievements": 57,
    "positive_ratings": 840,
    "negative_ratings": 286,
    "price": 6.99,
    "description": "Become an appraised bridge engineer and architect in Bridge Constructor. Create and design your own constructions and watch the cars and trucks pass over them - or see them fall and crash while your inferior creations collapse due to weight and the laws of physics!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/250460/header.jpg?t=1550249971",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Processor: 1,8 GHz Memory: 1 GB RAM Graphics: DirectX9 compatible with Shader Model 2.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is awesome. It’s a simple premise: You build bridges. In reality it is a puzzle game with many solutions. Each level has a set of materials and a budget to work within, but it is up to you how you want to end up bridging the gap. That’s not to say most of your “solutions” won’t fail miserably. You are also constrained by physics and the properties of the given materials. In addition, it is not enough that your structure simply doesn’t collapse under its own weight; it has to be able to support traffic of different loads. I’ve lost count of the number of times that some trucks barely made it to the other side as my bridge built with spit and good intentions fell into a shattered ruin in their wake. This makes even the failures entertaining as you look what when wrong and iteratively adjust your design until it works. I definitely recommend it to the engineering-minded as it will occasionally force you to think outside the box to solve the problem at hand.",
            "review_score": "1"
        },
        {
            "review_text": "One of the many games about building bridges. According to me game is quite difficult in highest mode. The graphics are ok. Gameplay also. Recommend for a small price.",
            "review_score": "1"
        },
        {
            "review_text": "As an engineer, I find this to be a pretty fun bridge building game.",
            "review_score": "1"
        },
        {
            "review_text": "Build bridges the way man intended: completely devoid of meaningful physics, zero real costs per materials, and absolutely no regard for human life during the testing phase.",
            "review_score": "1"
        },
        {
            "review_text": "Bridge Constructor is a brilliant game that puts you in the position of a builder constructing bridges across the 5 islands within the game. Each level tests your skills at being able to solve how to build a bridge in a means to get vehicles across. Anybody who knows of a program called West Point Bridge Designer will find this game to be quite similar, but the achievements and challenges presented will hook you right in. While you are able to build a sensible, well-thought bridge that will do the job perfectly, it's extremely fun to be able to build crazy bridges with massive jumps that still transport vehicles. The physics engine is so fun to play around with through each bridge design - launching cars off your 'ramps' in the hopes of reaching the end - and the ability to do what you will when constructing bridges to finish each level is amazing.  A game that I strongly recommend to anybody interested in purchasing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing casual game, great for buying when on sale. Graphics look really good, and gameplay is just like the android app. It's just what is expected when playing it on a computer, but you won't be surprised.",
            "review_score": "1"
        },
        {
            "review_text": "Picked this game up a few days ago with the most recent Humble Bundle and I'm getting a serious kick out of it. I was looking for a bridge building fix after trying the 'Bridge It' demo but wasn't looking to spend much $ towards that end. In steps Humble Bundle to save the day, check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game.   Occasionally you will have to employ less than conventional approaches in order to successfully engineer some bridges. More often than not 'common sense' engineering works.  This game suffers from being an iOS/Windows Phone cross over. Has an achievement for sharing on Facebook as a result of it's iOS breeding. I have a dislike for games that include any level of Facebook intigration.   That being said: Not a bad time killer, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Lets be honest, we all wanted this type of game when we were kids and now we have it",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would bridge again!",
            "review_score": "1"
        },
        {
            "review_text": "It satisfys my fetish for bridges, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "expensive trucks fell in the water",
            "review_score": "1"
        },
        {
            "review_text": "I bought this thinking it was Bridge Project. I ended up buying BP too, but while waiting for it to download I tried this. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game. I especially like the fact that there isn't only one solution to most of the challenges.",
            "review_score": "1"
        },
        {
            "review_text": "I only bought this because of Vinesauce. Other than that, this game is ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to help pass the time if your looking for something quick and simple.. Even though it is a quite simple game, it's far from easy. You just may have to use a little extra brain power to complete some of the levels in this game.. It's really fun and frustrating at the same time.. lol.. I think its a pretty good game overall.",
            "review_score": "1"
        },
        {
            "review_text": "You work as an engineer for the world's dodgiest Bridge Construction company. The Bridge fell apart as soon as both trucks passed? Oh that's fine. Have a bonus, in fact.  Mind-consuming and frustratingly fun. Haven't played that much but it is really addictive.  However, there are ads on the menu for other games, and constant 'Share on Facebook' options. This game seems like it is built as a Facebook game but not free. I have to take a point off for this as it ruins the experience slightly.  9/10.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun but for me medival was better, this game is much bigger than medival but it doesn't have as much character.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly built bridge constructor game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game for a quick distraction. Physics work well and some levels are quite challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it, played it for like half an hour, and never touched it again (as of writing this review). Still well worth the ten bucks, though.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive, sometimes frustrating, and a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I rope bridged with cars.",
            "review_score": "1"
        },
        {
            "review_text": "I've played a few bridge construction versions over the years. Compared to the previous one I played, this one added some features and took some others away. New to me were concrete, slope mania, and tanker trucks. Gone were two-way traffic, moving bridges, and the ability to adjust the 3rd dimension (bridge width). Overall this version results in a polishes experience that gets it just right. Sometimes it's hard to build a nice bridge, sometimes you can get away with crazy cheap designs. I enjoy it quite a bit.  Slope Mania was fun as well, containing a mix of both hard and trivial challenges. It allows for some bridges that totally collapse while the tanker truck races downward and still makes it across.",
            "review_score": "1"
        },
        {
            "review_text": "The first two challenges (car/truck) are super easy. The challenge isn't really there until you beat everything and unlock the super tanker truck, and you have to relearn everything you thought you knew about building bridges. Having fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "Bridges take a lot of support and physics, this game will show you the basics and not tell you why your bridge sucks. It can waste some good time.",
            "review_score": "1"
        },
        {
            "review_text": "Is an Ok port but am not a fan of getting a mobile port to pc",
            "review_score": "1"
        },
        {
            "review_text": "This game is not brilliant as it is just a straight port but the fairly simplistic gameplay works. Don't spend 6.99 on it though",
            "review_score": "1"
        },
        {
            "review_text": "I rope bridged with cars.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but buy it on android - it's cheaper there and obviously designed with touch inputs in mind.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a good casual game for people who don't have enough time for long gaming",
            "review_score": "1"
        },
        {
            "review_text": "you Construct Bridges... The game gives you the chance to do that perfectly!",
            "review_score": "1"
        },
        {
            "review_text": "really fun design game that is pretty good. should def try it out",
            "review_score": "1"
        },
        {
            "review_text": "Interest -&gt; frustration -&gt; humor -&gt; pleasant surprise.  Don't knock it until you've tried it.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game  the only thing that makes it not worth it is the price tag... it is $10 for a mobile phone port  it has facebook sharing built into it and it asks 'do you want to share this on facebook' at the end of every level.....  but if you can get it on sale for like $3-$5 go for it",
            "review_score": "1"
        },
        {
            "review_text": "Bridges take a lot of support and physics, this game will show you the basics and not tell you why your bridge sucks. It can waste some good time.",
            "review_score": "1"
        },
        {
            "review_text": "You can finish level with bridge collapsed and your tank truck blown to smithereens, as long as you reach the finish flag. Its fun for a while.",
            "review_score": "1"
        },
        {
            "review_text": "BET GAM EVR I RELLY LIK BRIGES I TINK THRE COL 10/10 WOULD BANG",
            "review_score": "1"
        },
        {
            "review_text": "Created an illogical bridge that made my truck explode and fall into a ravine. Moments later the truck levitated with a plank stuck to it and pinwheeled into the finish line. Would suicide to win again. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "More like Trebuchet Constructor. Still counts, ♥♥♥♥♥es.",
            "review_score": "1"
        },
        {
            "review_text": "The physics are broken, which really defeats the purpose of this game. There are much better architecural games for much cheaper.   TL;DR: Broken physics, 0/100 would not play.",
            "review_score": "-1"
        },
        {
            "review_text": "A game made in Unity, with an UI for tablets and a 'Share to Facebook!!' button at the end of every stage. I think that sums it up quite nicely.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not recommending this game only because it is a little pricy for what you are getting. It does have a fantastic physics engine and the graphics (although simple) are polished. I expected it to be a little more sandbox and have a few other features and building materials. If I had to rate the game, it would be a 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels a lot like a mobile game, not sure if I like that... The UI is clunky, placing objects feels loose, and the overall game is too easy. Certainly feels as if this game is best suited for mobile touch controls. Not worth $10.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun at first but after the first 5 -10 bridges you start to wonder what you are doing with your life and consider that maybe building a real bridge would be more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING: This game contains ads for Facebook. After every level you are greeted with a 'Share this on Facebook' ad. Barf. Don't buy this game if your privacy is a concern. NO REFUNDS!",
            "review_score": "-1"
        },
        {
            "review_text": "Boring",
            "review_score": "-1"
        },
        {
            "review_text": "Writing what I think of developers who include a 'Post stuff to Facebook' achievement would probably violate these Rules and Guidelines I never read...",
            "review_score": "-1"
        },
        {
            "review_text": "Fun wears of really quickly. Instead of challenging the game keeps repeating itself and becomes quite boring. Completing the puzzles doesn't feel rewarding at all but more like a chore. I played because I payed. Not recommended unless it's 99 cents or less.",
            "review_score": "-1"
        },
        {
            "review_text": "Personal Rating: 0/10   Wow, people actually BOUGHT this game? Thanks to ♥♥♥♥♥♥♥♥♥♥♥ I can make myself suffer on a daily basis. This game is horrific, with a £7 price tag for a Steam Greenlight game that doesn't work properly.  I kid you not the physics in this game are unimaginably bad. If you make a vertical slope of a bridge it will stick to the surface like glue, including trucks. This game is BAD.  Y'know what, I'm giving it it's own award. The Worst Physics of whenever this game came out. It's cruel that this game is a game you have to BUY WITH MONEY.  Another thing, the music and sound effects. Basic and annoying. Especially the startup menu music. It drills into your skull and stays there.  So well done Bridge Construtor, for making me want to cry because I played your ♥♥♥♥♥♥, unfinished, annoying, broken, confusingly bad, catastrophic mess of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Left it on for a bit longer because I remembered that it had cards, but nope..  Well, I remember back in the day I played a similar game called Pontifex. I remember enjoying that game but I can't say the same for this one. Much of the challenge comes from finding the right spot for triangle supports (typically around the whole bridge so that lone triangle supports don't break it) and levels seem very similar to each other. It gets boring after some time.",
            "review_score": "-1"
        },
        {
            "review_text": "So i made a startling realization today while playing this. I discovered that i can't get by with life on my looks alone. Thats right, it is shocking i know. And i rather thought that i had that going for me. I also realized that i can squeeze the Charmin, and nobody would care. So why am i telling you these two off the wall epiphanies. Because i had more fun squeezing the Charmin, and i will never design or construct bridges.  I mean i had so many things to say about this, but then my cat started to yak and i decided to watch him projectile vomit as my wife chased him around the house. (BTW, not recommended, because, apparently, my good looks are also not enough to keep me off the coach.)  Play on Google, avoid the fee, you'll be done after about 6 lvls anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "The bottom line for me is that I'm not sure that I learned anything about building bridges from this game. I don't expect to become an expert from playing a game, but I would prefer more learning and less randomly placing items and hoping it works. Also, I'm really glad I don't have to drive over any of the bridges I built.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me hate bridges and those that construct them. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Want bad physics? Want to ♥♥♥♥ing rage and want to kill you, yourself and the first one to say hi to you? Play this!",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me hate bridges and those that construct them. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Simple bridge constructing game with mobile game UI and bad physics. Offers entertainment for approx. two hours, and with its price at (9€) I can't really recommend it. If you insist on buying a bridge construction game, I would recommend buying Poly Bridge instead. (12€ atm)",
            "review_score": "-1"
        }
    ]
}