{
    "app_id": 250580,
    "name": "Paranautical Activity: Deluxe Atonement Edition",
    "release_date": "2014-10-20",
    "developer": [
        "Digerati Distribution"
    ],
    "publisher": [
        "Digerati Distribution"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Rogue-like",
        "FPS",
        "Indie"
    ],
    "achievements": 45,
    "positive_ratings": 961,
    "negative_ratings": 430,
    "price": 6.99,
    "description": "Paranautical Activity combines the classic FPS action of games like Doom and Quake, with the randomness and difficulty of modern roguelikes like Binding of Isaac and Spelunky.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/250580/header.jpg?t=1447358600",
    "minimum_requirements": "最低: OS: Windows XP or better プロセッサー: Intel P4/NetBurst Architecture or its AMD Equivalent (AMD K7) メモリー: 2GB GB RAM グラフィック: Intel GMA 950 or AMD Equivalent with OpenGL 1.2 Support ストレージ: 300 MB 利用可能 サウンドカード: N/A",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "+Great OST. +Well optimized. Even on an old PC, no worries.  -But not enough different soundtracks. -Unbalanced : Some Boss can't be beat without some specific upgrades. -Repetitive. Always the same rooms, the same monsters, the same upgrades.... -Only 4 loadouts to start.  To sum up, it's not a bad game, but it's boring and not worth 9e.  ",
            "review_score": "-1"
        },
        {
            "review_text": "The game is pretty good, the new devs are giving us some nice updates and fixes and i think that people who give it negative reviews because of it's previous developer are pretty rude.. The game now has a new dev, a good one. My hours are so low because i played it allot on GoG",
            "review_score": "1"
        },
        {
            "review_text": "Paranautical Activity: Deluxe Atonement Edition is a rogue-like FPS game that takes elements and gameplay from Doom and Quake and couples them with a game like Binding of Isaac, however quickly falls flat. The game is terribly punishing with your small health pool and terrible weapon selection. The controls and gameplay are designed so that the player has to run around and constantly kite enemies hoping their shots will land and hit the enemies. The controls and gameplay are clunky and all the rooms the player goes through seem so repetitive as they are all boxes with different props and obstacles thrown in. There are items that you can purchase to upgrade but the game does nothing to tell you what does the item do. Most of the time you just purchase an item only to find out that it has negative effects! Also, the difficulty of the game seems odd, some enemies and bosses are really easy and on the other hand some are really difficult. I did about 10 runs, and they were all very similar just with different bosses and the 2nd level boss usually takes me down each time. Looking at the Steam Achievements looks like only ~15% of the players even made it past Level 2 which just shows you how punishing and difficult this game is.",
            "review_score": "-1"
        },
        {
            "review_text": "it's a pretty fun, fast pased shooter. i always have a great time with it up untill i inevitably get the snail boss that causes the frame rate to drop to unplayable levels. if you can avoid this boss though then i garentee you'll have fun.",
            "review_score": "1"
        },
        {
            "review_text": "I've always wanted a fast-paced, reaction time demands sending you to your limits, hordes of pitiful enemies ganking you, insane upgrades, fun bosses, creative, colorful, FPS with an odd setting. This game is that but also Binding of Isaac (after fixing all my issues with that game) in a Nazi Submarine.",
            "review_score": "1"
        },
        {
            "review_text": "Alot of reviews hate on this game unreasonably harshly. This is in part from reviews when it was still in developement, or under prior ownership. Admittedly the designers of this game had some management problems and also did not deliver all of the things they promised (such as multiplayer support). What they did do is create a satisfying and addicting shooter.  reasons for this The game is randomised for a different experience everytime TONS of items, over 100 I believe Overall fun and FAST fluid play   I could go into much more detail but it is only by playing the game for at least a few hours that you start to appreciate all the different items/powerups/weapons and how they can interact with eachother. An item that seems terrible 95% of the time may in some circumstance or combined with another become so powerful it is almost game breaking. This coupled with dodging and destroying hoards of 8 bit enemies all the while listening to pumping techno music is extremely satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "I really do not care about the develepor's past or the disrespectful actions that were carried out because of it and the history behind the game. It is a very great title. I rarely find games comparing themselves to The Binding Of Isaac and Spelunky meeting my standards but I enjoy this one a lot! I hope they (whoever that may be) continue to add updates regularly.",
            "review_score": "1"
        },
        {
            "review_text": "I don't get why people hate this game...  Its a firstperson roguelike with a lot of upgrades and weapons. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "As someone who has spent most of his life playing DOOM and listening to Drum &amp; Bass in the background, I can say that this game is just what the doctor ordered. It's a room-by-room, fast paced FPS with kind of silly looking voxel graphics, but I think it hits the dark atmosphere just right for a run and gun first person experience. The weapons are a bit tough to get into the swing of, but all-in-all I find this game rather addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Pros - Fast-paced, bullet-hell gameplay - Easy to set up and play - Tons of replayability - Lots of unique items - Variety in classes and weapons - Fun to figure out what items do - Procedurally generated floors (no two floors are the same) - Multiple bosses - Can easily induce One-More-Run Syndrome - FOV slider  Cons - Enemy vartiation lacking - Dark rooms do not provide enough light - Flying skull enemies gang up on you and take chunks out of your health. Can make you feel cheated. ",
            "review_score": "1"
        },
        {
            "review_text": "I got a real kick out of Paranautical Activity.   You're moving around on a Nazi submarine blowing the ♥♥♥♥ out of the forces of hell. Collect power ups and kill tons of bosses in a super fast paced FPS roguelike. The music is fantastic, the lighting on dark levels is cool as ♥♥♥♥, and is fun enough that any run you do can potentially turn into a game winning one. I had never got to floor 6 before when suddenly, in one run, I managed to beat the final boss and just barely managed to kill her without taking damage. Fun as hell, would reccommned.  Replay value: 9/10 Music: 8/10 Gameplay: 8/10 Graphics: 6/10  Overall: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Good concept done bad. Rooms are way too small, powerups are meh and no driving force to continue playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's mindless fun. Worth $10.",
            "review_score": "1"
        },
        {
            "review_text": "Its a pixelated version of an Rogue-Like 'Quake'. You run around, shoot stuff, the stuff drops money and with the money you buy more stuff to get more powerfull to shoot even more and bigger stuff. After that you will find yourself, shooting at exorbitant amount of stuff in a bullet hell with traps and ♥♥♥♥.  Wanna Rage? Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely good music Fast gameplay Alot of weapons Alot of items A Few characters Tons of achievements Worth every single penny",
            "review_score": "1"
        },
        {
            "review_text": "IMO absolutely not worth full price - check it out if you can get it for very cheap, maybe it's your type of thing. The extremely low production value made me get a refund though.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;Loaded up game &gt;first thing seen 'David Bowie' &gt;20/10 would Recomend again.",
            "review_score": "1"
        },
        {
            "review_text": "Binding of Iscac meets 90s first person shooters If you like neither then don't bother",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games in which you play for 30 mins and get adrenaline for next 2 hours. Balance- good (though I havn't played for a long time) Music- amazing Controls- good (make game more about skill with almost no poor-control damage) Graphics- moderate. I like pixel art, as long as if it not confusing. In this game explosions are confusing and you cant really tell the sizes of explosions. Some other moments also need to be improved.  Overall I want to give this game 7.5/10 Deducted points go exclusively for graphics, sometimes making it diffictult to understand wtf is going on and how big explosions are.  Reccomend for rogue-like fps lovers who want a game as fast as quake 3 or smth",
            "review_score": "1"
        },
        {
            "review_text": "Nothing says good Game Devs like a death threat to Lord Gabe Newell himself. Oh and overall raging baby syndrome.  Oh how is the game? Pretty ♥♥♥♥ tbh. Like a 3/10. Go buy a burger with the $10, a really nice burger. Or CS:GO keys that wil get you 4 blues. Better deal.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is not being worked on anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "wonder if hell get the game thrown off steam again.",
            "review_score": "1"
        },
        {
            "review_text": "This game combines the best quake/doom and the basics of rogue lites, but forgets the need to add depth to the game and add more than a handful of weapons and bosses. Super repetitive aswell.",
            "review_score": "-1"
        },
        {
            "review_text": "Game survived Gaben's ban hammer. 10/10 -IGN  All jokes aside though, there is variety in items, guns, enemies, unlockables, etc. But it all gets repetetive after a while. What I also didn't like is the fact that if you don't get a good gun/item 'till the 6th floor and have a bad superweapon, you're f*cked. I had a really tough time with gaanguses only because I had a crossbow and a cannon, and it ruined and lost the run for me. The only thing that kept me playing for 15+ hours was unlocking the    mystery man    and playing him, just so I can evade having a run where I'm like 'Oh, I'm the tank now, better get some speed and damage ups!'. The deluxe atonement edition is definitely better, but the game still needs some tweaks, updates, and with some luck, even new items/weapons. At this point you're gonna have approx. 30-40 hours at this game if you want to get all of the unlockables including the infinite mode. This game has very much potential, too bad the former developer team left it to rot.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent game needs alot more playtesting to be above decent   the snail bosses roll is undodgeable  i am all for difficulty but when difficulty exist for what feels like a generic reason like impossible to dodge attacks it takes away from the game to me so it's good when it works but some parts show a serious lack of competent playtesting but overall for the $1.99usd i got this game on sale for it's not horrible it just needs a little bit of fine tuning and difficulty settings would be nice as well difficulty i never did like random spiking difficulty  I am not here to say buy or don't buy that is up to you what i will say is turning that FOV all the way up that might help with boss fights but as for me with the FOV at 90 the snails rolling attack was just impossible to dodge the devs could correct this with a sidestep feature or a dodge roll of sorts",
            "review_score": "1"
        },
        {
            "review_text": "Absolute garbage. Same crappy techno music plays the entire game. Poor play control. Nearly impossible difficulty curve.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "Great game,  to idle for cards.",
            "review_score": "1"
        },
        {
            "review_text": "OS: Windows XP or better  Processor: Intel P4/NetBurst Architecture or its AMD Equivalent (AMD K7)  Memory: 2GB GB RAM  Graphics: Intel GMA 950 or AMD Equivalent with OpenGL 1.2 Support  Storage: 300 MB available space  Sound Card: N/A   10/10 GB",
            "review_score": "1"
        },
        {
            "review_text": "Here's how a recent session went for me: Spawned Went to first room. Jumped for the entirety of the rooms fight, and won. Did this (^) for the entire floor and went to floor two. Rinse and repeat until floor three. Rinse and repeat until floor four. Walk into first room of four floor with full health. Did the same old same old. Saw these jumpy ceiling monsters. Stopped jumping, stopped moving. Got ♥♥♥♥♥ by monsters. Died.  10/10 would get ♥♥♥♥♥ by jumpy ceiling monsters again.",
            "review_score": "1"
        },
        {
            "review_text": "very fun; like an fps binding of isaac with quake shooting",
            "review_score": "1"
        },
        {
            "review_text": "Save your money, not worth a dollar let alone 10.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad Game dont bother with purchase, it really blows for a fps",
            "review_score": "-1"
        },
        {
            "review_text": "Politics aside, this is a great game. If you're a fan of rogulike design philosophy, this is a thrill!",
            "review_score": "1"
        },
        {
            "review_text": "apart from the drama the devs gave this title, it's pretty great. I am glad it's on steam again.  rating: 11 crying babies out of 10 basements!",
            "review_score": "1"
        },
        {
            "review_text": "Rad music.",
            "review_score": "1"
        },
        {
            "review_text": "So boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems like it could be a decent game, calling back to the simple circle-strafe and gun mechanics of Doom and that era, BUUUUT.... expect the game to crash around every 10-20 minutes for seemingly no reason. Until whatever bug this is is fixed, the game is basically unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Really bad game, mouse aiming seems not smooth at all no settings to change this. Seems like a step backwards from the last version",
            "review_score": "-1"
        },
        {
            "review_text": "As of now, I find Paranautical Activity to be lack luster if anything. A rogue-like FPS could have been really intuative, yet the controls feel clumsy and the difficulty feels to brash. It tries to play on an 'Items to make it easier' system like Binding of Issac yet going room to room is unpredictable and ends up biting you in the ♥♥♥. Sure Binding of Issac can screw you over if you explore but that's usually in later levels, Paranautical Activity does this on the first level! As I said the controls feel clunky (At least it does on my 360 controller) and the game tries to be too fast paced for it's on good. Doom was great as a fast paced game, but yet Doom didn't have unpassable rooms because you didn't defeat all the monsters (not all the time at least from my memory.) There is a sprint button, yet it completely ♥♥♥♥s with your aim. Doom also had a sprint command but in Doom you can't look up or down and your weapon 'auto-locks) on the enemies you aim at.  Over all Paranautical Activity is taking too much influence from other games too the point where it is completely miss using what concepts it's taking. Difficulty in a game is fine when presented in increments, but I haven't even made it past the first level.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good no doubt. But im pretty sure the ability for Dy-no-mitte is broken.",
            "review_score": "1"
        },
        {
            "review_text": "It's Doom the rogue-like, and it's amazing. If you like the idea of a game that's mindless, frantic, shooting fun, and neither Doom nor rogue-like style would ruin a game for you, get it.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting fast paced shooter than the creator said he would kill GabeN because something happened which was little. Thats how you know a developer put love into the game, with death threats. 11/10 would threaten agin? (GabeN I love you pls dnot ban me)",
            "review_score": "1"
        },
        {
            "review_text": "Well.... this game's back I guess! And it's still pretty good, if not tainted by the whole dev freakout thing!",
            "review_score": "1"
        },
        {
            "review_text": "Strange game, not for everybody. Bit of binding of isac + quake FPS + voxels. Strange music in the background and over the top enemies. The music is bit goa, bit chiptune, bit of everything. Everything bit too random, but I don't know why but as whole I like it :) Read other reviews before buying it (lot of people got disapointed, and I'm not suprised :) )",
            "review_score": "1"
        },
        {
            "review_text": "I just noticed this game was back on the store under the new name 'Paranautical Activity: Deluxe Atonement Edition'.  Ayyyyy lmaooooooooo.   Real talk tho, game is moderately fun, still feels very unfinished and unpolished however. Pick it up on sale (or don't, because of the reason it was pulled from Steam in the first place).",
            "review_score": "1"
        },
        {
            "review_text": "7/10  A fun roguelike shooter with pixelated graphics. Not the best in its genre, but fun nonetheless.  In Paranautical Activity, you have a few classes to pick and they differ in speed, damage, fire rate, health and starting weapons. After picking your character, you'll be traversing through randomly generated rooms, defeating enemies on the way, collecting money and using said money to buy upgrades when you come to a room with items for sale. At the end of each level, you'll fight a boss before progressing to the next level.  The main issue with the game is that it can be very confusing at times. As a roguelike game, it's expected that the game won't hold your hand and a lot of trial-and-error will be involved, but even then the game does little to tell you what each item does. The game could certainly benefit with being at least slightly more descriptive.  Another issue is that because rooms look mostly the same and enemies repeat themselves a lot as well, the game can become quite repetitive.  In comparison to games like Tower of Guns or Ziggurat, it doesn't stand out, but it's still recommended for those who enjoy roguelike shooters.",
            "review_score": "1"
        }
    ]
}