{
    "app_id": 250660,
    "name": "Bunny Must Die! Chelsea and the 7 Devils",
    "release_date": "2013-09-26",
    "developer": [
        "Platine Dispositif"
    ],
    "publisher": [
        "Rockin' Android",
        "Rockin Android"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Metroidvania",
        "Anime",
        "Action"
    ],
    "achievements": 32,
    "positive_ratings": 221,
    "negative_ratings": 100,
    "price": 6.99,
    "description": "From the creator of the Gundemonium Collection comes a thrilling new 2D action-platformer! Help Bunny escape the Devils’ Labyrinth and defeat the 7 Devils in this hilariously over-the-top action-platformer game. Battle through a large, connected map filled with unique enemies, traps, and puzzles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/250660/header.jpg?t=1524153917",
    "minimum_requirements": "OS: Windows XP, Vista, Windows 7, or Windows 10 Processor: Intel® 1 GHz Processor or comparable Memory: 256 MB RAM Graphics: DirectX® 9-level Graphics Card DirectX: Version 9.0c Storage: 500 MB available space Sound Card: DirectSound-compatible Sound Card",
    "recommended_requirements": "OS: Windows XP, Vista, Windows 7, or Windows 10 Processor: Intel® 2 GHz Processor or comparable Memory: 512 MB RAM Graphics: DirectX® 9-level Graphics Card DirectX: Version 9.0c Storage: 500 MB available space Sound Card: DirectSound-compatible Sound Card",
    "reviews": [
        {
            "review_text": "The Year is 1999X. Thermomewclear power: a modern scientific marvel that allows free clean energy for all of bunnykind. This safe and renewable energy was the perfect solution, until the Thermomewclear Power Plant blew up and cursed poor Bunny with a pair cat ears. Still retaining her long lapine ears as well, she is vexed by the fact that no one can tell if she is a rabbit or a cat. She even went as far as to seek the aid of a wise old bunny, but unfortunately he was brutally murdered by a rampaging bull and has left Bunny stranded in the cave of the 7 devils. If you think sounds mightily effed up, you are probably right, but no matter. It is time for Bunny to set forth and kick some devilish ♥♥♥!  Bunny Must Die! Chelsea and the 7 Devils is a classic example of the tried and true Metroidvania formula. It was created pretty much singlehandedly by Murasame of Platine Dispositif (aside from voicework), and like his other works the game can be punishingly hard at times. The original release was only in Japan, with 4:3 graphics and a midi-ish soundtrack. However this localization offers many enhancements over the original release, such as new widescreen graphics coded in by Murasame, a wild soundtrack arrangement by Woofle, and a fresh English translation.  When starting BMD the first thing you'll notice is the lush hand-drawn anime graphics. The next thing you'll notice is that you can't walk to the right. You must first walk to the left a few steps to collect 'The Gears of The Past' to be able to turn around. This quirky bit of humor quite obviously pokes fun at the general mechanics of the Metroidvania genre, and trust me when I say that a whole lot more will be lampooned before you finish the game. The game even pokes fun at you (and then throws a viciously hard boss your way) for sequence breaking. Yes, the large-foreheaded first boss lady will fly off the handle if you skip her.  Now despite the amusing jokes and cliches blown out of proportion, the gameplay in Bunny Must Die is your standard Metroidvania exploration with plenty of Castlevania-style combat. You also gain the ability to bend time to your will, and that opens a whole new dimension in gameplay and puzzle solving. I should note though that no matter how good you are at this sort of game, you WILL die often. Just go into this adventure knowing that fact and you will have a good time. The way we learn is by making mistakes, right? And sometimes being repeatedly run over by a turret-tank while it fires laser beams up your ♥♥♥♥ is a learning experience too.  Rockin' Android has definitely gone all-out in the process of making Bunny Must Die a breakout title for the western world. They have go so far as to give the options to use the original graphical mode and soundtrack, despite the overhaul that is provided by default. This speaks volumes of their dedication to customer satisfaction, and to their preservation of the original product's values. Just as with the Gundemonium Collection, Rockin' Android has taken an already awesome property and further polished it to gleam like a diamond and stand out on it's own in the rough sea of indie games.  So to recap: Bunny Must Die! Chelsea and the 7 Devils offers frenetic platforming, Metroidvania-inspired exploration, kickass brutal bosses, a rocking re-arranged soundtrack, a superbly localized and hilarious story, a cute as heck main character, a super secret hidden character with a second playthrough, and tight controls that ensure that if you screw up, it's your own damn fault. What the heck are you waiting for? Bust out your favorite gamepad, buy the game, and kick some demonic patootie! Bunny's fate depends on YOU!",
            "review_score": "1"
        },
        {
            "review_text": "Bunny Must Die! Chelsea and the 7 Devils is a metroidvania platformer made by Platine Dispostif, who are known mainly thanks to their bullet hell games Gundemonium and Hitogata Happa. How did the developers manage the genre change?  The level design is in metroidvania style, with semi-open world where you are unlocking rooms of previous zones to progress further. What stands out with the game is definitely the sweet visual anime pixelart style that looks great, considering also the well-made animations. Chelsea and her moves look great!  The unique gameplay mechanics the game offers, is the option to control time. You can stop or rewind the time, and you'll have to use it for few puzzles; in other cases it's a great utility skill for combat. But don't expect spamming those skills, you have very limited resources to slow time, so you can't affect the time for more than few seconds.  Weapon system in the game feels weird, as you are finding weapons through the levels, but you can have only one weapon at time and you can't swap to the previous weapon. You have to hope you'll find your favourite sword or boomerang soon again.  What ruins the whole impression from the game is the controls. They are terribly clunky, you'll miss jumps pretty often. To dash, you have to quickly double tap the movement key which usually badly reacts in shorter ranges to jump. Blocking is made, as it feels like a tradition for Japanese platformers, by tapping the specific movement direction in the moment of impact.   Conclusion:",
            "review_score": "-1"
        },
        {
            "review_text": "This game features: -Bunny girls -Cat girls -Elf girls -Devil girls -Jack-O-Lantern girls -Flat girls -Well-endowed girls -Rude girls -Nice girls -Brave girls -Shy girls -Skimpy clothing -Breast expansion  Basically it has anything a man could want and the gameplay is good too.",
            "review_score": "1"
        },
        {
            "review_text": "i need help my screen turns black everytime i load the game but from what i have seen its a good game",
            "review_score": "1"
        },
        {
            "review_text": "A bit of an odd game when compared to everything that's out there. Aside from some minor issues like Stiff controls and a Brutal trip with minuscule leeway, this is a really fun game to play!  The bosses are fast paced and vicious (Well most of them anyways) and the game eases up on any gamer that actually spends the time looking for everything (I was unfortunately underpowered when I made it to the final boss, who I discovered by accident).  The soundtrack is completely awesome! The speed is varied due to the controls, but the pace is consistent and enjoyable. This game feels more like an old school game from the time when gaming was all about BRUTAL PRACTICE! The dialogue is entertaining, and the weapons are all different and there is enough to satisfy a great number of gamers. The graphics work for the game.  I definitely recommend this game; I bought it at full price and haven’t regretted it yet! Although, there was a time when I was crying out in frustration! (Damn Jade Tower!).",
            "review_score": "1"
        },
        {
            "review_text": "Edit: It was a joke review guys, how did this thing receive upvotes?  Turn on the purple bunny suit, huge boobs! Yeessssssss!  A catgirl bunnygirl. She is normally flat, but man when she puts on that purple suit her hooters get huggggeeeee.  I mean I like big breasts and curves, but them things go 'boing' and suddenly big ol tittays. Not to mention her ears are nice and adorable. The purple suit makes her 'heavier' for obvious reasons (her boobaloobs are large) which makes her capable of many things. I rather enjoy the purple suit and wish there was also a blue suit for even larger melons. I suppose the added weight might be a bit much though, but still.  Also did I mention curves too? She's gets pretty curvy. She's bordering on cute and sexy so I'm totally down with that too, but the main feature is those boobs jumping up and trying to escape her top. Everyone is staring hoping to see them slip out. Course the game isn't porn so that shouldn't happen and I'm not huge into that kind of stuff anyway. Just the lucious line in between them. Beautiful cleavage.  She has white hair. Did I mention that? Also there's other characters who are kind of hot, but I think the purple bunny suit keeps her at the 'largest', though I haven't been through the entire game so I don't know for sure. Things are kind of silly, I mean hello, giant breasts! I think I mentioned this but those boobs are great. I wish they'd bounce more when you jump. That'd be awesome and I'd record it and say 'lets see that again!' contantly.   I didn't say anything about the actual game? Uhm...well whatever. The game doesn't matter. What really matters is busty bunny boobs.  Anyway, the game plays sort of like a faster paced side scrolling platformer with minor RPG elements. The game is pretty damn good actually, but hurts my eyes are points. Music is ok, nothing amazing though. It has some odd elements in it and the story is off, but in a good kind of way. Also there's a ufo. Maybe they made the purple bunny suit? Have I mentioned her bulging breasts? Probably worth 10 bucks if you're a big side scroller fan. You might hold off till a sale though.",
            "review_score": "1"
        },
        {
            "review_text": "It's a Metroidvania and takes that term to a literal level also with gameplay being a mixture of Metroid and Castlevania (you even got the candles!). The game can be pretty hard also with how it adds bullet hell elements into the mix. The asthetics are very colourful and nice to look at and even the soundtrack, old or new can leaving a tune stuck in your head.  Overall it's a very fun game and is also pretty zany. The difficulty might throw a fair lot of people off but it's still a game worth experiencing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not very good. It's playable, and almost enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Much more powerful than Holy Grail's Killer Bunny.",
            "review_score": "1"
        },
        {
            "review_text": "It's Winsauce with -=Hard-to-master=- controls NOT bad controls,a lot of the fun/difficulty lies in mastering the moves.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game a little confusing to begin, but gradually you get used to it.",
            "review_score": "1"
        },
        {
            "review_text": "✘",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game the general theme/gameplay seem pretty solid. There is a nice detailed map which includes items/obstacles etc so you dont get lost. This had the potential to be a really good game.  Then they decided to go full retro and even include the old 8/16 bit platformer staple: bad controls.  So yeah probably give this a miss, its a platform game with bad controls.  You cant really forgive that when basically every platform game this these has good controls. Even worse the controls and very deliberately bad so players can 'enjoy' mastering them and going from awkward bunnygirl to awsome bunnyninja i guess.  I doubt most people will ever make it to the exalted bunnyninja state.",
            "review_score": "-1"
        },
        {
            "review_text": "I would want a refund if i could get it but i think i already passed the experation date...also i got this on sale, also i got this before refunds were a thing.  This game is the kind of stupid that most people probably should avoid. Sure the story is ...a joke in itself, but the gameplay is harder than most rogue likes; it dosent even come with controler support.  I couldent even get past the FIRST BOSS of the game...  I dont recommend this, just...no, find some other metroidvania games, this games just not worth trying with how annoying that is.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game - REALLY like it because it looked like a lot of fun from videos I saw of it. However, it's absolutely no fun when you have to perform split second actions and deal with loads of things coming your way with stiff, unresponsive controls and character movement. Especially when the only way to recover health is at a save point, and you usually wind up taking far too much damage than you should thanks to the aforementioned control problems.  It's unfortunate that I have to give an otherwise creative and quirky Metroid-style game a snub. Unless the devs patch the game to improve the controls, it's going to remain in my 'unfinished' category.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls for this game are just silly. It took about 7 seconds playing it to realize I don't want to play this anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "cant even play because of a stupid bug that closes the game and there isnt even a a guide to fix it anywhere good game 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Played all of 10 mins of the ♥♥♥♥♥♥♥t before the ultra stiff controls made me bail.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't be fooled by looks, this game is really hard. Reminds me a lot of old 2d Metroid games and Castlevania series, but this one is impossible compared to those. Grab this if you are looking for a one tough challenging ♥♥♥♥♥♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and enjoyable but unbelievably frustrating, some deaths feel entirely cheap or wall jumping in areas need 100% accurate timing or you fall completely to the bottom and have to start all over. Another thing is nothing is obvious, there are hidden walls, and back tracking, though out of all that once you make it through you feel a sense of accomplishment. So I reccomend it to anyone who is up for a challendge, just don't feel ashamed if you have to look up a walkthrough, I did.  ",
            "review_score": "1"
        },
        {
            "review_text": "Do I really have to try and sell you on bunbun Metroid? Come on.",
            "review_score": "1"
        },
        {
            "review_text": "A potentially amazing platformer brought down my awful controls.  I started the game out very optimistic, loving games like Wings of Vi, But, I steadily realized how imprecise and unreliable the controls and movement in the game are. If you can get around the terrible controls, however, it's pretty cute and the art and music is cool. From what I've played so far, however, I would suggest you give this a pass.  I do intend to keep playing it, if nothing more than to justify my purchase, so I might update this later if something happens.  Edit: So, after beating Bunny's story, I feel compelled to give it a recommendation. While the controls continue to be awful, everything else the game throws at you is quite good. So, buy it on sale.  For some reason I didn't unlock 'Chelsea and the 7 Devils' after beating 'Bunny Must Die', so I guess I won't be doing that. Oh well.",
            "review_score": "1"
        },
        {
            "review_text": "Controls are weird. I didn't get very far before getting frustrated.",
            "review_score": "-1"
        }
    ]
}