{
    "app_id": 250600,
    "name": "The Plan",
    "release_date": "2014-02-14",
    "developer": [
        "Krillbite Studio"
    ],
    "publisher": [
        "Krillbite Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Atmospheric"
    ],
    "achievements": 1,
    "positive_ratings": 19476,
    "negative_ratings": 1644,
    "price": 0.0,
    "description": "A fly ascends to the skies, pondering the pointlessness of its brief existence. The Plan was developed as a side project by Krillbite Studio, who's currently finishing their main project Among the Sleep.&quot;Hey, You Should Play This&quot; - Patrick Klepek, Giantbomb&quot;Some may argue that The Plan isn't really a game and it...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/250600/header.jpg?t=1447358600",
    "minimum_requirements": "OS: Windows 7/Vista/8 Processor: Intel i3 Memory: 1024 MB RAM Graphics: Intel integrated DirectX: Version 9.0c Storage: 120 MB available space Sound Card: Yes Additional Notes: Optimal with headphones",
    "recommended_requirements": "OS: Windows 7/Vista/8 Processor: Intel i5 Memory: 2048 MB RAM Graphics: Nvidia Gefore 400 or up DirectX: Version 9.0c Storage: 120 MB available space Sound Card: Yes Additional Notes: Optimal with headphones",
    "reviews": [
        {
            "review_text": "This is probably one of the shortest 'games' on Steam; it lasts only 5 to 10 minutes, and then it's finished. Many would argue it's not a 'game', since there is almost no gameplay. In  The Plan  you are a fly, a fly with a plan. She wants to fly higher than any fly has ever done before, so she starts on a journey of discovery. You can lead the fly a bit during her journey, but in the end she goes up and up and up, and that's it as far as playing this game is concerned.  But arguing if  The Plan  should be called a game or not, is besides the point. For me, it's like a small but polished piece of art. If large and great games like  Middle Earth: Shadow or Mordor  are the novels of games, then  The Plan  is an exquisite poem, maybe even as short as a Japanese Haiku. It's all about atmosphere, and about the gradual changes in atmosphere as the journey progresses. These shifts are made through the artwork, and also through the soundscape. In the beginning there's not much more than the sound of the fly up-close, but once she soars higher, the developers with a stroke of genius added a piece out of Edvard Griegs hauntingly beautiful music for Ibsens play  Peer Gynt : 'Aases Tod'. The emotional effect of this sudden musical layer took me by surprise, and made a deep impact. There are even many more 'layers' to be discovered, but just as in any good poem, these should be left to the player's imagination.  So, just get this one, and treat yourself on a special journey. It's free, so don't object ;-).  Overall score: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is not a game, It's rather short interactive experience. It will take you only few minutes to finish it. As I see, for many people this game is something more than just a simple experience. It gives them some kind of mystical experience, even reveals the secret of life. It didn't give me so much. To be honest I was little bored of it. So why did I give it positive review? Because after all it turned out to a nice joke and I enjoyed it.  VERDICT: It's free and it takes only about 5 minutes, so you have nothing to lose. Maybe you will find secret of life here or maybe you will laugh at the end. Or maybe you will be disappointed, who knows? But even in the worst situation you will listen to very nice music.  It's worth to find out.  Like this review? Consider to join  Good Games Giveaways &amp; Reviews  group and maybe press big sexy 'Follow this curator' button on our  curation page  to read more reviews and win free games.",
            "review_score": "1"
        },
        {
            "review_text": "Short &amp; Sweet (&amp; Free). I played this game for about 10min, &amp; enjoyed it all. You play as a fly. Not sure if theres a goal, or if all games end the same (i won't say how mine ended in case you want to find out for yourself), but i had fun for the 10min that i played it.  Got 1/1 Achievements, another (easy) Perfect Game. Also, it's free, it's a small DL (112mb), so there's no real reason not to try it. Enjoy :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that you can easily complete in 3-5 minutes without doing anything but keep the fly ascending to somewhere high above. While in doing this, if you take a few more minutes to think about what the story orr principle behind are supposed to tell. Then you might need much longer to figure out, evne a life time practice, really impressive.   ",
            "review_score": "1"
        },
        {
            "review_text": "Fly in the sky like a fly that is fried.  I cried.",
            "review_score": "1"
        },
        {
            "review_text": "Without a lie .. this has to be the best  'Fly Simulator'  I have ever played!  (Ok .. well its may be the only one I've played .. lol!) .  Not much on the gameplay side but to travel up towards the light and ...  (well I leave the surprise to you) . It's worth taking this 5-10min journey if for nothing else than to experience the atmosphere that has been created. The graphical effects in the background look slightly surreal with a stiring musical score building up all the way to the end of the game.  It's free, it's a small download &amp; for those achievement hunters out there an easy perfect game in it for you.  The Plan was a rather unique &amp; enjoyable, albeit short experience  (much like this review :) ) .    If you enjoyed reading this review, please follow  True Blue Reviews  for more recommendations! ",
            "review_score": "1"
        },
        {
            "review_text": "This will be an odd review, as it might take longer to read this post than the 5 minutes the game took to play through.  The Plan happens to be a wonderful take on the brevity of life and how well it can be shown in such brevity- through the life of a fly. Sure, there might be arguments over the validity of calling this a 'game,' but it doesn't really matter. It's a short and controlled experience that brings you on a journey of struggle and insight about your place in the universe and what meaning we may find in what little time we get to live for.  This game has all it needs to make a great game, pared down to the absolute minimums necessary. A pervading and eerie atmosphere, subtly haunting music, and the smallest story about the path of life itself. We try to ascend as much as possible in the time we are given and therein lies the transcendent reflection on the nature of life.  ",
            "review_score": "1"
        },
        {
            "review_text": "Gotta say I was pretty skeptical and wary of just how 'good' this experience would be, given how 'amazing' other pretentious artsy indie games were. I mean; it's about a fly. But figured that for free and for something that was apparently so short it was worth a shot anyway. Even if I do have a bit of a bug phobia and actually wondered if I could handle 5 minutes of nothing but a fly.  Well... it's a good thing I didn't let any of that get to me. I wasn't prepared for just how impactful this game would become. First Aase's Death starts playing followed by an unexpected increased visual range and scope. The further you go the music builds and the visual journey becomes more epic until... the end. That's it. It's done in a flash. It gave me chills and made me tear up and then it was done and I just sat in silence for a moment as I pondered what I just experienced. It was so unexpectedly moving and really just plain unexpected in general. Such as life, which this 'game' portrays quite uniquely well in more ways than one.  Really... great things really can come in small packages. Even ones not at first visually appealing. See, this is what I meant about it being such a simple, yet eloquently conveyed metaphor on life. The Plan can be taken in any number of ways and can vary slightly in meaning and depth from person to person, making it more worthwhile to take five to ten minutes out of your day to play this little 'game' through once or twice respectively and see what you make of it.  ______________________________________________ Easter egg: Click the credits at the start after beating the game. :D",
            "review_score": "1"
        },
        {
            "review_text": "The Plan provides a brief, divine glimpse into the life of a fly. That's all it does, and that's all it needs to do. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I decided to try it. what i got wasnt a laugh, wasnt a scream, but an experience. Im not gonna lie. I cried in the game. Its just so touching. A small game that provokes a million thoughts. Even though the game can be completed in 5 minutes or less, it manages to make you think about an array of things. A must play. And with this excellent music choice... I feel ashamed of played with this game free. This game is a true masterpiece. 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "The story about the obstacles in a flies daily life.  I personally really enjoyed flying around in The Plan.  The atmosphere was beautiful, the music fitted in perfectly and the story was very touching. It's not really a 'Game' its more of an experience you go through. ",
            "review_score": "1"
        },
        {
            "review_text": "More of an experience - a short one - than a game, but delivers exactly as promised.  I guess what you get out of this, is going to be relative to what you put into it. I found it to be food for thought on a number of topics so it is interesting enough for me, even just for this reason  But I also find the graphics to be sweet, soundtrack to be one of zero-annoyance, and the ending was effective and well-placed to avoid monotony - and can add a new spin to your musings.  Replayability - well it is a kind of story without much ability to control it so once you have seen it, any replayability will come down to whether you will get more thought from re-experiencing it, and that is subjective - I will keep the game in my account because I would like to see what I get from it, or put into it, upon replay at some time.   And I did not feel that the price was unreasonable :)   I would recommend this as a short experience that may inspire some reflections, and I will be interested to see what more interactive and immersive creations the devs come up with.",
            "review_score": "1"
        },
        {
            "review_text": "I do feel like I have more insight into ... the meaning of life.",
            "review_score": "1"
        },
        {
            "review_text": "Short, relaxing, one achievement = perfect game!",
            "review_score": "1"
        },
        {
            "review_text": "  Our life in 5 minutes, enjoy. This game is great!",
            "review_score": "1"
        },
        {
            "review_text": "i love this kind of games, amazing experiment =) it's free, short &amp; enjoyable, go try it now !",
            "review_score": "1"
        },
        {
            "review_text": "Michael Bay would be proud",
            "review_score": "1"
        },
        {
            "review_text": "A fly can fly ~~~~~~ Ez perfect achievement~~~~~~~",
            "review_score": "1"
        },
        {
            "review_text": "This game just touched me in a way I couldn't comprehend. This game, by itself, has made me question the purpose of my existence. In fact, it made me question why we ALL exist. It's symbolic of both hell and heaven. 'Is The Plan a great game?' No, it isn't. It's the best damn game that you can possibly view upon and play. Do yourself a favor, and enlighten yourself with this masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "If you want an actual game, don't download this.  That said, it's artsy, pretty, and quick.  But the real reason to download this is because in ten minutes time you can get the one and only achievement and add a 'Perfect Game' to your profile.  To do this, beat the game, click the restart, then click the little credits that pop up at the start this time. It's that simple.",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is truly the greatest and most inspirational game of our era. No game has invoked so many emotions and so much philosophical thought in me. It has opened endless avenues regarding the meaning of all that is around us, which all games have failed to do; until The Plan came along  You play as a quiet but determined fly as you try to transcend the airs of wisdom and try to discover the meaning of the universe. This truly masterful game starts you off at the bottom where you appear beaten and defeated. Fear not however; as you aren't ready to give up yet. You will be able to fly and navigate through the roughest terrain and beautiful scenery as you try to fly to the top and become one with the universe, gaining its infinite knowledge. When you reach the top, the phenomenal writing throws you a twist that none could have foreseen. The ending will give players a completely different perspective on everything that they might have known.   The graphics and sountrack are perfect as well, with a tear-jerking song playing halfway through this masterpiece. No games have ever reached the graphical fidelity as The Plan has. If all games were held to the sound and graphical standards of The Plan, we would be living in a gaming utopia.  The Plan is one of those games that no one will ever forget its greatness. Whether it is the flawless writing, the beautiful sound, the awe-inspiring graphics, or the fantastic gameplay, The Plan is going down into the history books as the most revolutionary and inspirational game that will ever be.",
            "review_score": "1"
        },
        {
            "review_text": "The best FPS i have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A beautifully tailored masterpiece depicting Man's struggle against the ever-cruel world we sad humans reside in... I demand a sequel to this unforgettable journey of a lifetime. Why traverse the stars when you can sit down on your dirty desk chair, load this wonderful work of pure genius and explore the galaxy with the common house fly? Special thanks to my friend Jon Hoseman for recommending me this experience of a lifetime. The simple yet intricate 5 minute journey brought me to a different time and realm, allowing to ponder life's gifts. It is a pity Mother Nature had not granted the common housefly sentience, else the human race be doomed. thank you, The Plan, you have opened my eyes...",
            "review_score": "1"
        },
        {
            "review_text": "Glorious. Take ten minutes out of your day and just play it. Go now. Now. Go. Now.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great colorful game with an incredibly epic music. For this genre of games is a big surprise. I would recommend it to anyone, because playing in it only five minutes, you get positive emotions throughout the day.",
            "review_score": "1"
        },
        {
            "review_text": "You get to play as a fly xP",
            "review_score": "1"
        },
        {
            "review_text": "An amazing and very deep metaphor for life. I will never look at a fly the same again!",
            "review_score": "1"
        },
        {
            "review_text": "  The Plan",
            "review_score": "1"
        },
        {
            "review_text": "The plan is a neat little Indy experiment. Not really a game, you are a fly and move around the environment until..uh...your ultimate escape from it all. I am sure thier is a deep poetic meaning in here some where, to me it was a fun whimsical 10 minute journey as a fly. I have never played a fly before in a game, so it was worth it just for that. If you like interesting ideas that realate to gaming at all, I would suggest spending the few minutes it takes to play this game, its an interesting experience. Works fine with a game pad too, just FYI.",
            "review_score": "1"
        },
        {
            "review_text": "Easy, short, with beautiful graphics but not a big time killer.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a beautiful experience. I cried at the end of it. If you ever cowar down in a corner, or run for you're life, and risking someone elses, then remember, that all the animals in the world exept humans face danger all day. Every day, a fly gets caught in a net. Every day, a zebra looses a family member. Everyday, animals are worried about facing a bandit, etc. but they dont know what other creatures face all day.  And be happy you have a greater meaning in life. I honestly think this fly is lucky to live that long. When I played this game, I saw that the poor fly got close to death atleast 3 times, and that happends everyday in the life of flies. But this was actually only 5 minutes of the life of a fly.  A fly, looking for light, LOOKING for a meaning. Looking for something to make it special. Looking for a life like our's  Well what I just said was very depressing, lets talk about turtles!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game ^^ and only 5min for 100% achievments :D",
            "review_score": "1"
        },
        {
            "review_text": "its like skyrim with guns",
            "review_score": "1"
        },
        {
            "review_text": "IT'S FREE!   Well guys and girls... This game is very simple, but has potential to become a great game. Graphics are very good, but has some crashes when you're playing like change window and real crash when you click on the credits to gain your achievement. The music is very touching. 9/10 The SFX in the game are almost hidden, you must be patient to percept then, like the cry of the leaves when you drop down on then, and the florest souns, like birds and even the grass movement.  If you wanna check out a diferent concept of game, this is for you.   (Português Brasil) É GRÁTIS!  Bem meninos e meninas... Este jogo é bem simples, mas tem potencial para se tornar um ótimo game. Gráficos muito bons, mas vi alguns bugs durante o jogo, por exemplo ele muda de tela sozinho e pode travar ao clicar nos créditos quando você tenta conseguir a conquista(achievement) A música é muito boa. 9/10  Os efeitos sonoros do jogo são quase ocultos, você deve ser paciente para percebe-los, como o choro das folhas caindo quando se desce sobre elas e os sons da floresta como aves e o som da grama se movendo.  Se você quer experimentar um conceito diferente de jogo, esse jogo é pra você!",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best free to play game ever in existance.",
            "review_score": "1"
        },
        {
            "review_text": "I am fly, and I am cry.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game in the sense that at the low cost of free it made me feel ripped off. Philosophical , yes but replayable? Less so than black death. ",
            "review_score": "1"
        },
        {
            "review_text": "You are a fly but not just any fly. You are a fly witha a vision, a vision of a better tommorow. You accend to the skys to look for that better tommorow and when you reach the top it may or may not be what you expect. A fly is not a simple as you think, It has hopes and dreams just like everything and it too must struggle to reach them. The journey of the fly begins now.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has changed my life for the better. Thank you so much for this glorious experience. I'm a better person now then I was 6 minutes ago. However, you will have to pay for my flooded basement because the ending of this game made me cry for several hours. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "nice and easy",
            "review_score": "1"
        },
        {
            "review_text": "Speachless... Simply amazing, lol. It's short, tiny download, and i have win xp and it ran fine. If you are reading this, just play it real quick.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really inspirational. I cried the first time I played this, I really did. 8/8 m8 The comparison of Navi to an annoying fly, so true. Like Skyrim, with flies. I recomend this for every YouTube Let's Player. As Mindcrack Pyro would say, 'It's game theory guys.' The Plan, now for Xbox, WiiU, and Playstation.",
            "review_score": "1"
        },
        {
            "review_text": "this game has taught me about how something so little can embark on something so great 10/10 play it with headphones",
            "review_score": "1"
        },
        {
            "review_text": "Half life 3 confirmed!",
            "review_score": "1"
        },
        {
            "review_text": "You're a flyyyy and you fly hiiiiigh into the skyyyyyyyyyy... till you die.  It's a pretty short game but with nice sound effects in my opinion. It's also F2P, I think it's worth a look!",
            "review_score": "1"
        },
        {
            "review_text": "You can see the game almost didn't have gameplay. But, you can see, in this game, you playing as a fly, you flying with plan. This fly want to fly higher but a lamp closed it.  You may didn't understand. just, try this game. Recommended",
            "review_score": "1"
        },
        {
            "review_text": "I read the reviews before playing this game and thought 'it's not going to be that cool'. I was wrong. This game captured many emotions while I played it and it being a free game, I highly suggest you play it. Like now.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game to each &amp; everyone who is in my friend list &amp; all other gamers . It will not take a lot of your time but u will remember 'The Plan' for a long time .  ",
            "review_score": "1"
        },
        {
            "review_text": "Simple, short, thoughtful (in a profoundly Ecclesiastes-like, meaningless way), and pretty.  An easy achievement, if that's what you're looking for:  1.) Click on the fly to start 2.) Fly UP and avoid the few minor hazards 3.)   Fly into the light   4.) Click reset at game end to return to the start screen 5.) Click the credits at screen bottom to earn achieve  My game crashed the first time I clicked the credits, but it processed after a restart - 1 achieve, 100%, ~5 minutes.  If you're wondering, after the fly turns into the glowbug there is no new content for repeating the game, at least for a single repeat through.",
            "review_score": "1"
        },
        {
            "review_text": "In over 25 years experience in games, nothing has surprised as has 'The Plan.' Behind its simple, yet elegant facade of a Fly's flight to freedom lies a stirring tale of identity, guilt, and self discovery, all with a simple, but beautiful, underlying question which pervades every aspect of this experience: Why? I got through it in one sitting, glued to my chair. It brought me through an emotional roller coaster, all culminating in a heartbreaking finale that left me in tears. Not only is this without question the best video game, it is the most extraodinary creative feat I have ever had the great pleasure of experiencing.",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is a very simple game and short where you fly around being a fly. You don't know exactly where you are going to. But that doesn't matter, the journey is beautiful. That is because of the gorgeous background and music. I don't have a lot to tell about it. I wouldn't say it is a game, but it is more an experience.   My rating for this game: 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone needs to play this. It changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year. Heartbreakingly sad, i dont even know why......   10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "cool idea of a game :D, made me feel warm inside    Cringe",
            "review_score": "1"
        },
        {
            "review_text": "OMG... What you do at the end... What you think... Is all that matters...",
            "review_score": "1"
        },
        {
            "review_text": " The Plan  is not a game, but a small piece of interactive freeware. The eerie, yet beautiful background along with the fitting soundtrack and simple mechanics provide players with a soothing five minute playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far one of the best 2D upward scrolling six-minute fly simulators on Steam. It offers immersive slowly hovering gameplay, while 4 arrow keys offer a wide range of intensely complex controls and unnatural vertical flight patterns. Truly, this game's defining characteristic is its unparelleled storyline, keeping users enthralled up to the very end, when the sudden plot twist gives them insight as to what it really means to be one of the most boring and inconsequential organisms on the entire planet. Perhaps the best feature is the notable lack of lag and small download size for low-end PCs. A must have for anyone with no money and a heavily refurbished and cobbled together 2003 Windows XP computer.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever imagine that you're a small creature ? A helpless, a fragile creature, a fly ..   This game showing you the side of the world that you never seen before .. The tyranny world, so much challenges in order to reach the top ..  The spiderweb that try to stop you, The wind that try to push you away, The falling leaves that try to drag you down, But.... Once you almost reach it........ Remember, you'll not always get everything you want ..  The best 8min of my life...  Go and try this ~",
            "review_score": "1"
        },
        {
            "review_text": "This is as far the most realistic fly simulator I've ever played. We can feel the 6-minutes worth of flying around with the burning sensation of flying around reaching the most final goal, the light. It is a very long game, and I truly enjoy the game. The game itself gives us the feels, and lets us know how it feels to be a fly, and how to be a wise fly. The sound of the environment, the sound of the fly's wings, they combine altogether and make a wonderful melody. Flying leaves, and standing trees, doesn't let the fly to give up. I love this game to the very end. This game is very educational, I'd recommend this for everyone who is looking for games.   This is definitely the best game I've ever seen. With this game, I've learned, and I won't kill flies anymore, I know how they feel very well, and it indeed hurts. I cried, I knew this would happen. I feel sorry for them. Going through the obstacles of avoiding people to live on their own, trying hard to reach the goal. Flies are the most wonderful living being I've ever seen, the God's creature, just like us, who deserves life just like any other creatures in the universe. 11/10 I would play it over and over. Thanks, The Plan, you've brightened the light of the people who plays your game.",
            "review_score": "1"
        },
        {
            "review_text": "Life is cruel.  And that white light they told you about? Trust no one.  Fly simulator. Simple as that.  May make you think twice about swatting.",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "-Hey listen! -SHUT THE ♥♥♥♥ UP NAVI Nice eastern egg from Zelda",
            "review_score": "1"
        },
        {
            "review_text": "Biggest gaming surprise this year. It is less than 10 minutes long and yet manages to strike very deep chords; a great example of how to deliver a message with limited resources. Games like this bring a much needed breath of fresh air into the industry. Kudos to the creator and I can honestly recommend this to everyone out there. Really worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "5 Minutes of my life well spent on this game. This game has truly and deeply inspired me.. that fly touched my heart. Life is too short.. even though it the longest thing we do. Nothing can compare to what I've just played.  I give it 10/10, 5/5, an Oscar, an Olympic Gold Medal, a Nobel Peace Prize, and the Medal of Honor.  I recommend (while being high or/and drunk).",
            "review_score": "1"
        },
        {
            "review_text": "basically roleplaying as a fly",
            "review_score": "1"
        },
        {
            "review_text": "A work of art. It's odd, it's simplistic, and very brief; so is life. The previous statement is the message this game attempts to convey and does so in such a perfect way: by having the player take the role of a fly's brief existence. It's a must-play. Even better is the fact that it is free to download, for this is a message that must be experienced by all.",
            "review_score": "1"
        },
        {
            "review_text": "It was really beautifully done. The visuals and audio was really great. And the Ending! :(   It was too short though. I wish it was longer, and you could do more. But if this is what they can do with a small game I'd love to see their other games to come.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, I though this game had NO POINT. Then looking at the end, just wow. Go try this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is art! I suck at reviews so im just gonna thums up this",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game to everyone out there.The game won't take you more than 5 minutes to complete but I promise you that it will leave its mark on you.Its a F2P game and it will be worthwhile of your time to play it! 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "Unique experience that lasts 5 minutes. You might cry at the end. Or not.",
            "review_score": "1"
        },
        {
            "review_text": "The game is simple but the plot is deep and strong. It is the one of the most heart touching games I have played last year. The music is wonderful, and design of the game is very beutiful. In short, this game takes your away in its own world. You play as a fly, and all what you need is to fly. It's a good metaphor of meaning or life. And the name of the game says for itself: God has own plans for us.  10/10  I wish this game could a be a little bit longer.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful thing. What a Haiku of a game. I'd play it again",
            "review_score": "1"
        },
        {
            "review_text": "10/10 BEST GAME EVU, WOOD BANG! the music was muSICK (pun). This made me cry tears for my eye. really good and ♥♥♥♥.  Happy smokin' genlemen.",
            "review_score": "1"
        },
        {
            "review_text": "Great artistic short, loved it!",
            "review_score": "1"
        },
        {
            "review_text": "I loved it. Definitely worth the time even if it is short. Beautiful, atmospheric and I loved the surprise ending. Don't forget the awesome music. Krillbite Studio does not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "best 6 minutes of my life",
            "review_score": "1"
        },
        {
            "review_text": "This hurt me emotionally. The ending caused butterflies. I have a new appreciation for the hard, though short life that flies live through every day.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure if anything I did in the game is worth it if the only ending is death.",
            "review_score": "1"
        },
        {
            "review_text": "This is brilliant well-made-master-piece-of-game-ever!!! Recommend this game to everyone!!!",
            "review_score": "1"
        },
        {
            "review_text": "1. This is not a game. 2. I didn't like that I expected a game :P 3. I liked the graphic apperance and sound. 4. I introduced my friend to it and it was funny looking at him when he was doing exactly what I did - he tried to play it the same way I did - and tried to find a 'way out' / 'completing the game'. 5. I'm sorry but I cannot reccomend it 'as a game'. I will push 'yes' just to appreciate the work of ppl who made it.",
            "review_score": "1"
        },
        {
            "review_text": "A nice and short experience to have for free. The end was humorous :D",
            "review_score": "1"
        },
        {
            "review_text": "It's a 5 minute gameplay but  I like the idea.. Amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Sugoii!! Really love this simulation game... i really hoped it to last a bit longer but it make sense for the game to be small.. since the life of a fly is also that small   10/10",
            "review_score": "1"
        },
        {
            "review_text": "I ended up enjoying this. It was pretty and serene, and definitely feels like something put together for a portfolio for a future designer. All in all, oddly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "A nice little short story about a fly. Very nicely done. It takes like 5 to 7 minutes to complete and if you will try this you won't regret it. It has beautiful music and beautiful art. It's like a very short visual novel. I give it a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥...   best free to play title, ever!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Simple game, quick download, thought-provoking, short (takes exactly 5 minutes to beat once), and a single, simple achievement, so a great way to boost your achievement average.  I highly recommend playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good freebie, worth a go",
            "review_score": "1"
        },
        {
            "review_text": "Wow ! Such fly ! Much wind ! I fly to the light, mum ! Amaze !  ",
            "review_score": "1"
        },
        {
            "review_text": "For the mere price of nothing and the all but five minutes this takes to complete, it is well worth the investment. Surprisingly beautiful in its simplicity.",
            "review_score": "1"
        },
        {
            "review_text": "I cried.",
            "review_score": "1"
        },
        {
            "review_text": "The 5 minutes it took to beat this game has changed my life completely. Alot of time must have gone into make this complex out of the oridnary game 100/10",
            "review_score": "1"
        },
        {
            "review_text": "Played through this game for the first time a year ago.  Still contemplating life.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like no one got it so I will help you out. This game is about suicide in our current society.  There you go.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wonder what happend to Navi? Now you can experiance it first hand! Life sure is hard without Link, come experiance the story you never knew, and maybe didn't care to. Hey, listen, you were going to spend those 5 minutes it takes to finish it doing something stupid anyways like...reading far enough into the reviews section to find this. Atleast you can add drama to the gameplay and act cooler than all your friends for knowing the secrets until they check your steam history, then you're screwed, but you tried so good job soldier, better luck next time!  Edit: (Also if the game crashes while you click the thing to get the schievement, just start it back up and click it again. It happend to me, but it's not a big deal it still recognises that you completed it once so it's fine still.)",
            "review_score": "1"
        },
        {
            "review_text": "RIGHT SO I WAS CHILLING W SOME STARS AND THEN I WAS GOING INTO THE LIGHT AND THE MUSIC WAS DRAMATIC AND  I SCREAMED OUT WHY I TRIED TO STOP I COULDNT STOP I COULDNT SAVE HIM  ",
            "review_score": "1"
        },
        {
            "review_text": "Wow !! Man ....... Firstly I was unable to figure out where we had to go , when I realized that going up is the only way ... Suddenly that spider's Net grabbed me !  The falling leaves were the best part for me , It was the main interactive thing in the game I thought going up was never ending but I suddenly saw that I was in a terrible condition out there   Cant figure out what the end was !! was it the sun ?? but it doesnt matter now  The nicest game for around 30 Mb ! That's Great",
            "review_score": "1"
        },
        {
            "review_text": "bee simulator 2015 #beecultists",
            "review_score": "1"
        },
        {
            "review_text": "If you are tired but do not want to go to bed, play this game. If you long for silence and the touch of nature in a loud and lonely world, play this game. If you need to remind yourself how small you are in this endless universe, play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best game of this generation",
            "review_score": "1"
        },
        {
            "review_text": "this is an emotional rollercoaster  please grab tissues before playing  1 like=1 dorito  11/8.71 -Ign  ",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me started Being that little fly ♥♥♥♥ing changed me man. It changed me. the story was pretty powerful the leaf character was pretty deep I haven't been able to play any games since I completed it. I'm letting it all sink in leaf #3 to be exact The third act really ♥♥♥♥ing left me speechless And the romance? Phew dude. Sexy. when the character development took off it really soared It went over my head dude The development It was just beyond my reach It gave my mind wings It wasn't really ever a grounded story to begin with Except for in the beginning when you were on the ground I crie erytiem it was like skyrim with wings It was like borderlands with flies it was like bioshock with leaves Witcher 3-esque landscapes Diablo II itemization grand theft auto but better graphics The depth of a five nights at Freddie's story times 10 overwatch without some winner screaming in our ears about how it was ♥♥♥♥♥♥♥t he just died Dude you should copy paste all these things we just said and put them in a review on steam, including this message where I said you should totally do it I mean I would say it was helpful and funny And I would scroll right past it  So yeah I'll do it.  I knew it was going to be a hit Dude I guarantee that is going to be top review in a couple years when the game takes off It's too ahead of its time Right now to take off Lmao edit the review and put that in",
            "review_score": "1"
        },
        {
            "review_text": "WTF!!!! It took only 6 minutes to complete whole game.Game has really good graphics and music but its too short.It is correctly shown how difficult is a fly's life... I will surely recommend ......",
            "review_score": "1"
        },
        {
            "review_text": "Came for the fly, stayed for the fly, become the fly.",
            "review_score": "1"
        },
        {
            "review_text": "step over Cod and Battlefield, the Plan is here. 11/10 RIP gtaV",
            "review_score": "1"
        },
        {
            "review_text": "I recommend you plan to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Whilst in the midst of my ever ascent it made me ponder the meaning of life. The many trials and tribulations. The success stories and the failures in which one must learn to lick their wounds and continue. This piece of art provoked many emotions; sadness, joy and finally at the end relief. This game does what no other game has ever even come close to doing and that is find a game that I can play with one hand.",
            "review_score": "1"
        },
        {
            "review_text": "Take a few minutes out of your day for a free achievement and thought provoking game. The simplicity of the adventure is ironic because of the complexity of the conlcusion. What does that mean? Just check it out!",
            "review_score": "1"
        },
        {
            "review_text": "really nice made short game",
            "review_score": "1"
        },
        {
            "review_text": "This game is hands down the most beautiful fly simulator I've ever played. The soundtrack was awesome! This game is very short but powerful in a way. I LOVE THE PLAN!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game!, Its So Short And Simple But It Really Puts You Into The Worthless Life Of That Poor Fly, I Strongly Recomend It...",
            "review_score": "1"
        },
        {
            "review_text": "Game of the Year 2014, need Bee and Wasp DLC please.",
            "review_score": "1"
        },
        {
            "review_text": "Life changing, such passion, many cry.",
            "review_score": "1"
        },
        {
            "review_text": "Delightful short adventure.",
            "review_score": "1"
        },
        {
            "review_text": "A 6 minute long game where you play as a fly.   Much deep. Very relaxing. Wow.",
            "review_score": "1"
        },
        {
            "review_text": "9 minutes well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Wanna experience something different? Give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply brilliant. I start as a fly, aware of who I am what I am for and my purpose in life. As I fly upward I become more and more aware of my existence, my tiny, insignificant existence. I literally view my self smaller and smaller, floating aimlessly into the great beyond. As I exist this earth I fly away father and farther, into the cosmos. In my last moments I am placed with an option, one which I shall not spoil, but simply put I felt as if no option was more important in my life. Please play. If not for you for the little fly friend within you......",
            "review_score": "1"
        },
        {
            "review_text": "Seriously the best game of the year! After 200 hours or so, im still trying to beat this. Don't fly into the light!",
            "review_score": "1"
        },
        {
            "review_text": "Free and easy!  No flyswatter needed!  Take flive minutes and check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible. I feel that all I`ve done in my life is wrong. I`m closing to the lightbulb.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully done. The 'game' might only be a few minutes long, but the ride is very enjoyable.  ",
            "review_score": "1"
        },
        {
            "review_text": "Short and beautiful song! Totally worth the 6 min gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Was a fly. Flew into space. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Holy, F@cking, ♥♥♥♥♥. I would not like to be a fly, but for a 5 minuete game this was f@cking amazing -The Graphics - Sound Concept - The Hidden Things like the S- (i wont spoil it) This game is amazing, it's short and amazing and now i want to get their 'Among the Sleep' just because of the above mentioned things, It's amazing. Just Wow, great job with this. I think this is the ONLY game i ever unlocked all the achievements.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's free. It takes 5 minutes to beat. It isn't a bad game. There's not much more I can say.",
            "review_score": "1"
        },
        {
            "review_text": "When I first clicked on this game, I was very skeptical on the product itself. Little did I expect a game of such caliber that would lead to moving me to such a high and intense level. Let's say I smiled a little less, my eyes were a little wetter, and I was in awe by the time I finished the game. The storyline was complex on a simple level. The music alone was a magnificent component and made the gameplay much more epic than expected. 10/10 would recommend and play again.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely delightful and insightful",
            "review_score": "1"
        },
        {
            "review_text": "It was alright...I mean the replay value isn't very high but hey...it is free to play.it was pretty fun, all I really want to know is how to get the one acheivement....",
            "review_score": "1"
        },
        {
            "review_text": "The most amazing piece of motha♥♥♥♥in art ever. If you don't see the beauty in the game....no, this expirience then you are clinicaly ♥♥♥♥♥♥♥♥. Spread the word, everyone MUST play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game... This game... Has all the abstract and metaphors that its not even funny. This game is not for normal players.",
            "review_score": "1"
        },
        {
            "review_text": "Ridiculously relaxing, awesome music. I like the concept and the ending made me laugh and then sad after I thought about it.",
            "review_score": "1"
        },
        {
            "review_text": "it is a life changing game that should be played by all ",
            "review_score": "1"
        },
        {
            "review_text": "This game made me question wether or not an objective reality exists. Think about it this way.. The fly has a limited perception when compared to ours and our ability to quantify and calculate the universe. To the fly our perception of reality would be mind blowing to say the least. The truth is that our view of reality is very limited in a sense that we cannot look at our very existence objectively. The laws of the universe we have come to, 'understand' can and only have been proven through our 5 senses. They cannot be proven any further because we cannot take an objective look, and if we did.. what other senses would we need to be able to ultilize to get a true objectlive look at reality. Our perception of the universe is as flawed as the the perception the fly carries through this game and ultimately.. to his death.",
            "review_score": "1"
        },
        {
            "review_text": "I began not knowing what was to ensue.  I did not know I could feel so much emotional attachment to something I saw as an annoyance, something that hindered my peacful life. Though it was brief, this fly showed how dramatic one's journey could be. Through rough winds and perilous leafs that keep act as walls and keep you from climbing one can relate the same as it also reflects life and it's difficult climb.  This fly represented life itself. Life is short, and at some times difficult, and some times beautiful, and sometimes also easy.   I began the game not knowing what it would be, and finished the game taking a piece of it with me to take along the way for the rest of my life's journey.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love dramatic games like this, it is really worth the download!",
            "review_score": "1"
        },
        {
            "review_text": "Its like tetris. Up wards. With a fly.",
            "review_score": "1"
        },
        {
            "review_text": "Download this game! It has amazing grafics and has an amazing story and an even bette plot twist :)",
            "review_score": "1"
        },
        {
            "review_text": "Pointless, but somewhat entertaining for 10 minutes!",
            "review_score": "1"
        },
        {
            "review_text": "I liked playing a little fly. It won't keep you engrossed for hours, but it's a fun, simple diversion. I highly recommend you try it. It's FREE! Give it a chance and maybe you'll enjoy it, too.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting :D",
            "review_score": "1"
        },
        {
            "review_text": "I cried at the end, 10/10 would recomend",
            "review_score": "1"
        },
        {
            "review_text": "A great waste of 6 minutes",
            "review_score": "1"
        },
        {
            "review_text": "Fly hovers in air Wind holds him back from his goal The leaves are pretty.  Is it a metaphore of going through life? Maybe... and maybe it's just a fly.",
            "review_score": "1"
        },
        {
            "review_text": "Yes. This game showed me life from angles I hadn't witnessed. I think twice now when I go outside. Ahh, tricky webs and heavy leaves.. This game is worth every minute you have to spare. Do not miss out on this beautiful experience.",
            "review_score": "1"
        },
        {
            "review_text": "Better rename it to Fly Simulator Extended Edition!  Nice visuals, nice music. Very VERY short.  Oh, I loved the Easter Egg of being able to play as Navy! ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Life of Fly   My journey starts out with me on my humble home the rock(or was that poop), a spike of curiosity suddenly welled up in me saying 'hey lets fly up, up as far as the light that always shone above us.'  Thus my journey began, my journey started out easy, just the leaves falling and falling but suddenly I got caught by a spiderweb. 'No, my journey must not end now, I have yet to reach the light far above the sky', I struggled to escape from death, I though all hope was lost but the strings of the web grew loose and each one unhinging from their roots I became free.  Continuing my journey, sudden gusts of winds blew through, each of the gales it blew I struggled to go forth... the light is near, I must endure... the winds grew stronger and stronger but I did not let myself be stopped, my goal is almost at a palms reach.  At last the winds subsided and I flew even higher, higher than any fly would've dared, but what is this, am I in space or am I in heaven? The view was breathtaking, there were lights everywhere, clouds that formed magnificently but that is not the best site, for beyond that was a glowing red orb, was this my creator? or was it the sun. I couldn't possibly know how far I have flown. It shown beautifully, I must reach for it... a horrifying sound was made as I touched it, I couldn't see anything... everything was black but then as sudden as the darkness, light came in, a blinking line asked for my name so I gave it what it asked, I must have entered heaven...   10/10  This game made me live a life I will never forget",
            "review_score": "1"
        },
        {
            "review_text": "Love it, a really great piece of work.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me think about life. How we see things, and what they could really be.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.  The truth is that I would like a little challenge, but the music is great, the gameplay is fun and simple and the game itself is fun and relaxed, with a beautiful atmosphere. Also, if you click on the credits before you start, you get to fly something like a wisp with wings, I love that too!  The ending is majestic and funny and I love showing the game to friends and watching their expressions! :p  I have to add that it's nice and fun for a free game, but I wouldn't pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "There is no plan. Everybody dies.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, beautiful and entertaining five minutes. Although thats all there is to it i really liked it. So did my girlfried and many others that I showed it to.",
            "review_score": "1"
        },
        {
            "review_text": "15 minutes. That's all it takes to question your existence. On a scale of things, playing as a fly can make you feel so insignificant. Just a tiny, tiny, tiny, part of the huge cobweb that is life.",
            "review_score": "1"
        },
        {
            "review_text": "For what it's worth, it's definitely a game to try. It makes you think as you go along especially when you start to hear the score.   I've always swatted these flies dead whenever I get a chance. But now I'm feeling some sympathy for these critters. Imma let them fly and land on me from now on.   So I think you should play this game. NOW.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I won't analyse this. I loved it. Thanks for making this.",
            "review_score": "1"
        },
        {
            "review_text": "I would not call this a 'game', more of an 'artistic expression of the futility of life'. Which it expresses well in a simple manner. Its pretty and the music fits in well.   If you need a moment or three to settle down and be reminded that struggles in life are ultimatley meaningless, because in the end we have no control of our fate, that everything we do is half chance, then load this up.  And also, one really easy achievement. Probbly to prove that the most satisfying things in life are done after a struggle with defeat.  But I'm probably wrong. I'm only taking a chance here.",
            "review_score": "1"
        },
        {
            "review_text": "Something tells me there might not be a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "The saddest, heart wrenching, most tear-jerking experience of my life. The cinematics were beautiful, and I think we can all learn a little something about ourselves from this emotional masterpiece. Be safe my bretheren, for this game has shown me the light. Don't follow the light, please.",
            "review_score": "1"
        },
        {
            "review_text": "This gave me an existential crisis... I need a moment",
            "review_score": "1"
        },
        {
            "review_text": "was fun enough for a few minutes at no cost.",
            "review_score": "1"
        },
        {
            "review_text": "If you have 10 minutes of your life to spare, The Plan is worth that time.  Game-play: Very simple, yet elegant. The game-play is not for the game but the story.  The story: Short and abstract, there are many ways to have your interpretation of this brilliant story.. A fly on a journey, A human's life symbolism, a journey that has a dark and disappointing end.  The art: The art style is not something you see everyday, and is greatly intriguing as the protagonist fly's upwards.  The music: Absolutely beautiful, the game hands down has the greatest soundtrack, it is recommend to play with headphones, the music really gets deep into your feelings over a fly... It's amazing  All up: A beautiful game that is free that deserves game of the year.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice artistic game great choice of music and story!",
            "review_score": "1"
        },
        {
            "review_text": "While this is not a 'game' per se, but literally more of an artistic experiment, it will still be the most entertaining 5 to 10 minutes you will have in a while.  In case you wonder: the music at the end is Edvard Grieg, Death of Ase.",
            "review_score": "1"
        },
        {
            "review_text": "This game was just so beautiful... This is a perfect masterpiece of a simulator, and even with it's simple mechanics and very short experience, it still manages to evoke emotions into the player. This game details the life of a fly perfectly, from first take-off to death. I used to wonder just what it was like to be a fly, but now? Now I know.   This game is easily the greatest simulation game I've ever played, and probably ever will play. 10/10 would experience again. Please, be sure to give it a try, if only because it is short and free. At least then you can say, 'I now know what it means to be a fly.'",
            "review_score": "1"
        },
        {
            "review_text": "play this game if you want to die a fly but come back a fairy",
            "review_score": "1"
        },
        {
            "review_text": "This game made me feel sad for a fly for the first time in my life. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME. THIS GAME MAN. It is a work of art. How they made me feel for that fly in like 6 minutes I'll never understand. Six minutes. And I want to cry. 6 minutes..",
            "review_score": "1"
        },
        {
            "review_text": "Better than CoD  14/10",
            "review_score": "1"
        },
        {
            "review_text": "The dialogue is superb.",
            "review_score": "1"
        },
        {
            "review_text": "I always wondered what a bug simulator would be like.... well - other than Spore. But - this isn't it.  Beautiful graphics and sound.... interesting play, but one time through and very fast - took me around 5 minutes to explore every piece of this game.  My fly took off, battled a web, got blown around, went in to space(?).... then to fly heaven.....and then saw grandma....  Look - for free, it has earned the 100 Mb of hard drive space it consumed. I've paid much more for much worse.... (Sim City 5 comes to mind).",
            "review_score": "1"
        },
        {
            "review_text": "I've never cried so hard in my life. I tried to stop it toward the end, but I couldn't. If you are having trouble in your life, this is for you",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of the best fly simulators I've ever played.  10/10 would fly again.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I've played this year. Better than anything AAA developers have made in the past three years. Finally, a project like this masterpiece comes along and challenges not just the art and application of video gaming, but also tears at the fundamental nature of both man and flykind. You will be in awe, you may be inspired. Laughs may be had, and tears might be shed.",
            "review_score": "1"
        },
        {
            "review_text": "I normally hate what I call 'games that aren't games', but I really enjoyed this. Extremely casual, yes, but very pretty in its simple way and visually engaging. Very nice art style and good controls (not like that matters in this type of 'game'). Oh yah, and free XD",
            "review_score": "1"
        },
        {
            "review_text": "Got about 10 minutes to spare? Try this game/experience out.  6.89/10",
            "review_score": "1"
        },
        {
            "review_text": "this game makes you think about life. about what is the meaning of life. it gives you a feeling after you play it that i cant describe its weird.",
            "review_score": "1"
        },
        {
            "review_text": "It's better to burn out than to fade away.",
            "review_score": "1"
        },
        {
            "review_text": "I cry a lot :(",
            "review_score": "1"
        },
        {
            "review_text": "A compelling experience coupled with some of the finest pieces of music, and an unexpected ending. It is also free, small, and you can even play as Navi. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Never has this subject been touched before... The great life of a fly. You must wonder what it feels like to be a fly.. probobly the best thing you'd ever want to be. Sitting here right now, I have a fly in my room. As it buzzez and Endlessly Hits the window desprately trying to get out. Being stuck in such a small little ♥♥♥♥♥♥♥♥ body that just gets Swatted or eatin by a spider..  But yet they still endlessly fly and enjoy life. Eating poop, feeding on decomposing carcasses, with a side of poop and occasionally biting a 2 year olds arm and making him cry.  That.. totally didnt happen to me or anything &gt;.&gt; All is to say is this is most probobly the closest thing you're ever gonna get to being a fly.  So apparently when you're writing a review you're supposed to explain why you did or did not like it. SO RIGHT NOW I HAVE TO KEEP TYPING AND WASTE MY LIFE SO YOU CAN USE YOU'RE LOOKING BALLS  TO READ MY REVIEW TO SEE WHETHER OR NOT THIS GAME IS WORTH PLAYING..   I hope my review has been helpful.. but for the sake of me being lazy GO PLAY THE FREAKIN GAME AND DECIDE FOR YOUR FREAKIN SELF!  ",
            "review_score": "1"
        },
        {
            "review_text": "This game will BLOW your mind. the ending BUGGED me though...It was pretty disGUSTing when you get past the wind. you'll get stuck but the beast does LEAF you alone. I only have one piece of advise...WING IT, it will all be worth it at the end as it's very enLIGHTening.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 to play if you want to loose 10 or less minutes of your life seeing a fly, fly its a fly simulator flying so yea.",
            "review_score": "1"
        },
        {
            "review_text": "Great !",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful music and charming wordless story. The entire experience is humbling. Nice break from heart-pumping games :)",
            "review_score": "1"
        },
        {
            "review_text": "Give this game a try. It's free to play! :)",
            "review_score": "1"
        },
        {
            "review_text": "It cured my cancer 9/11",
            "review_score": "1"
        },
        {
            "review_text": "I.. um.. .. Well, I now appreciate flies, eventhough they are pestering bugs who rub their little hands together as if they are planning to kill my family...",
            "review_score": "1"
        },
        {
            "review_text": "It's not so much a 'game' in the traditional sense - sure it has controls, but the six minutes that it takes to complete the game are a fantastic example of voiceless storytelling in video games.  Spoilers Follow:  You are a fly. You use the WASD or Arrow keys to fly around. At first, it seems a little bit pointless. There are no Quick TIme Events, no onscreen objectives, and a relativly sparse world that doesn't really have any interactive areas. So you just fly across, until you hit an invisible wall, then you begin to fly upward. The soundtrack simmers. A gust of wind hits you, ushering you across to another invisible wall. You can only continue up.  Reaching a wide expanse of space, you continue upward. It worked before, right? The orchestral soundtrack swells as god rays appear, guiding you upward, as if toward some form of salvation. The light gets brighter, and an opaque object appears. Could it be...?  White screen. It was a lightbulb.  A blinking cursor appears. You stare at it. What will it type? A profound philisophical quote from Socrates? A nihlist insight revelant to modern society? No, nothing comes up. The cursor blinks, again and again. Then it hits you.   you   are meant to type something.  You are the overseerer of what happens next. In fact, you controlled the fly to the pre-determined end that it met. The gusts of wind, the invisible walls - they might have served a purpose in game design, but they were also indicitive of another concept; The inevitability of life, and the misconception of having control in our ultimate destination.  The fly is destined to die - we led it there, but apart from leaving our keyboard, there was no other end goal. In this way, we don't feel bad about killing something; we have been given no backstory about the fly, or any reason to control it. We just did so out of past conditioning to control. And when we saw the lightbulb, we continued towards it, knowing the fly would be destroyed, and the game would be over. The comment being made by the developers is one about our subconcious acknowledgment of fate being pre-determined, and our primal desires to control the destinies of others, no matter how logically or logistically viable that might be.   I guess the main point is that six minutes of shooting a fly into a lightbulb has made me learn more about my self than 600 hours in Skyrim or Borderlands 2. Just play the damn thing - it will take you less time than it took to read this diatribe.  Score: As a game, 5/10. As a statement, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "It touched my soul.",
            "review_score": "1"
        },
        {
            "review_text": "Better love story than Twilight ",
            "review_score": "1"
        },
        {
            "review_text": "I... think i just acomplished something... After finishing this short but sweet game. I sit at my computer staring at the screen, my mind is unable to comprehend the symbolic beauty. The beautiful audio kept me anaware and unexpectant of the dangers one must face in the short life of fly.",
            "review_score": "1"
        },
        {
            "review_text": "This is it. This is what I have been looking for over the last 700 years. When the Bubonic Plague took my wife, I made a promise to her that I would see the most beautiful thing this world has to offer. And I finally found it. This game brought tears to my eyes, which hasn't been done since the passing of my beloved Elizabeth. I can finally let my soul come to a rest. I can finally go home. I can finally return to my Elizabeth.   Dat ♥♥♥♥♥ better have made me dinner and cleaned the house, or I'm gonna kill her stupid ♥♥♥.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "A beatiful 'master'-piece. Easy to play, hard to master. Easy controls. Simple gameplay. Great Story, nice graphics. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is life. Existentially amazing.",
            "review_score": "1"
        },
        {
            "review_text": "WTF am i doing with my life?",
            "review_score": "1"
        },
        {
            "review_text": "Looks like the plan failed.",
            "review_score": "1"
        },
        {
            "review_text": "More proof that the quality of a game experience isn't dependant on its length.",
            "review_score": "1"
        },
        {
            "review_text": "Quite tranquil in a way, going about your life as a small fly, striving for the glowing light in the sky. Nice soothing music as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game touched me very deeply, never before has the death of a charter made me feel so many feelings after completing the game I turned off my computer and lied in my bed as I pondered the meaning of life.  -Gleamingace",
            "review_score": "1"
        },
        {
            "review_text": "  Name:  The Plan  ",
            "review_score": "1"
        },
        {
            "review_text": "Just a simple 'fly Simulator' .",
            "review_score": "1"
        },
        {
            "review_text": "This was such a great game... Beautiful visuals put in front of a flawlessly told story while still being free. 9.5/10 - Best half hour I've ever spent on a video game.",
            "review_score": "1"
        },
        {
            "review_text": "After reading the reviews, I thought that the fly just kept going up and up, forever.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of the most powerfule experiences...that I've ever experienced XD Only takes up about five minutes of your time-very beautiful game, very short, well worth the minimal effort you need to play it.",
            "review_score": "1"
        },
        {
            "review_text": "For free, you should really try it. Won´t give away antyhing, but 10 minutes for a perfect game on your profile and a nice little journey, why not?",
            "review_score": "1"
        },
        {
            "review_text": "This story talks about a little fly. A simple and little fly who wanted to live his life. But the unexpected happened.  This game is very heart touching, it made me feel connected to the fly that I was controlling. I would recommend this to everyone. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not really a game, more like a short, interactive movie with clever plot twists. As it's free and short, it's obviously worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "Metaphors? Meaningfulness? Press W to win, spend 5 minutes, have some patience, get the achievement, feel sad if you actually watched the screen. The paradox of simplicity.",
            "review_score": "1"
        },
        {
            "review_text": "Why not spend 5 minutes of your life to end it feeling sad and left quite empty? It's better spent that way than doing actual work I guess.  MetaJon Score: 5/10",
            "review_score": "1"
        },
        {
            "review_text": "its free",
            "review_score": "1"
        },
        {
            "review_text": "Fly, cobweb, die. (Storyline 10/10)",
            "review_score": "1"
        },
        {
            "review_text": "You can 100% finsih the game &amp; get the achievement in less than 10 minutes! YaY! =)",
            "review_score": "1"
        },
        {
            "review_text": "I'll start off by saying that this game will have very split reactions among its players. Some will call it a unique, haunting metaphor for our mortality and life. Others will write this game off as too simple, devoid of any meaning or substance, and too artsy-fartsy. After playing this game, I can see why both camps would believe these things.  Admittedly, there isn't much to this game. You are a fly, and you decide to fly higher and higher... and that's all I'll say about the plot. I wouldn't be able to tell much more beyond that without spoiling the game anyway, seeing as you can complete the game within 5 to 10 minutes.   However, a game's length doesn't completely determine if a game is good or not. How much you enjoy the game should be mostly dependent on the player's overall experience. Yes, length can be a big factor in one's enjoyment, but some games are designed to be short, one-and-done playthroughs.  The Plan  is the embodiment of this philosophy. It doesn't matter that the game can be finished in roughly 1/5th of an hour; as long as the player enjoyed their brief time as a fly, then time is irrelevant in this case.  Players may be divided when it comes to the overall gameplay of The Plan, but it's hard to deny that a lot of effort went into detailing this game. The graphics look quite nice, with mostly dark backgrounds that reminded me of LIMBO or NightSky. However, while those games mostly had silhouetted landscapes, The Plan has a bit more detail. Gusts of wind are drawn on-screen smoothly, giant leaves threaten to crush the philosophical fly, and the game's climax shocks us with a surprising transition or two.  I must also tip my hat to whoever was in charge of the audio for this game, as it is simply some of the best ambient noise I've ever heard. Rustling leaves, huge wind gusts, a tense encounter in the trees, and the haunting melody in the finale stand out in my mind long after I finished playing. The sound quality in this game is superb, and I was completely immersed in this game due to how realistic the sounds were.  As I mentioned above, the game is incredibly short, so there is very little to no replayability once you've seen the conclusion, since you know what happens. The game also seems to crash at the end of the game when returning to the main menu (as of the time of this writing), and, for whatever reason, I can't figure out why there is a text field after the conclusion. But these are some minor gripes. They don't detract at all from the game's overall quality.  In conclusion, I recommend you play this game if you want to do a bit of thinking about morality and regret, need a quick time-waster (and want to earn a quick achievement), or if you just want to hear a haunting tune. And, at a low price of free, you have nothing to lose if you don't like it (well, other than 5 minutes of your time, but aren't we all wasting time anyway?).  -----------------------------------------------------------------------------------   Pros:    + Great atmosphere + Nice visuals + Amazing sounds + Thought-provoking + Doesn't drag itself out too long / feels like the perfect length for a casual game + FREE!    Cons:    - Game has virtually no replayability after the ending - Crashes when returning to main menu (at the time of this writing)",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of my brother-he was a fly. I got so emotional, and started crying.  10/10 would recomend for space scene.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 GOTY ALL YEARS IF YOU DONT PLAY THIS GAME CONSIDER SUICIDE",
            "review_score": "1"
        },
        {
            "review_text": "The Plan... A range of emotions you may feel playing this. Curiosity Sadness Frustation Fear (Should definately be rated 18+ as death is so brutal) 10/10 IGN would become a fly again ",
            "review_score": "1"
        },
        {
            "review_text": "This game is perfect. It is the least buggy, and at the same time most buggy game I've ever played. 7 minutes of pure, non-buggy bugness.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "You fly, to the Sky You die and maybe you know why then you go to the credit and maybe you get it A Great 100% Achievement, the Perfect Hunter Treatment  10/10 would do it again",
            "review_score": "1"
        },
        {
            "review_text": "Some say the game is too long... Some say it is too short... But if you put all your effort, all your time, everything you got into this game, you will be pleased that you downloaded this game. 100/1",
            "review_score": "1"
        },
        {
            "review_text": "This game is so incredibly phenomenal. I feel so touched by the movements of the insect, I can hardly captivate the intensity of my emotions. Every moment of playing this game felt as if I was I was living an illusion of what this world really is. As if I were some insignificant being trying to grasp the meaning of life. The acoustics in this experience was so astonishingly breathtaking. It was so tremendously, graphically, and aesthetically pleasing that it felt like I was being caressed by gods. The story is so exceedingly addictive and delightful I would donate my left testical just for another moment of this game. 0/10",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my life 10/10",
            "review_score": "1"
        },
        {
            "review_text": "if i had to sum this up in 3 words, i'd have to say very very sad...no wait thats 2 words, emmmm... very much sad.",
            "review_score": "1"
        },
        {
            "review_text": " This is not a game- it is an experience.",
            "review_score": "1"
        },
        {
            "review_text": "If you can spare about 5-10 minutes of your life you should totally download The Plan and give it a try. It's certainly what you could call, an interesting game, an interesting adventure. It makes you think and by the end you realize that it was not what you were expecting it to be. Certainly worth playing, also bloody damn gorgeous graphic style and soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Simply incredible and best housefly simulator with awesome graphics!",
            "review_score": "1"
        },
        {
            "review_text": "This game is emotional, it made me cry my eyes out on how beautiful it really is. I even played it twice in a row (I mean it takes 6 minutes to complete but still) It's amazing, got the achievement like a pro. 100/10 rating my favourite game.. - Xaphoon.",
            "review_score": "1"
        },
        {
            "review_text": "And in the end, what are we? Nothing more than flies seeking the answers of life. The pursuit of knowledge kills.  10/10. Made me rethink my life.",
            "review_score": "1"
        },
        {
            "review_text": "Some people have made the mistake of seeing Killbrite Studio's work as a load of rubbish about flies, but clever people like me, who talk loudly in restaurants, see this as a deliberate ambiguity, a plea for understanding in a mechanized world. The points are frozen, the beast is dead. What is the difference? What indeed is the point? The point is frozen, the beast is late out of Paddington. The point is taken. If La Fontaine's elk would spurn Tom Jones the engine must be our head, the dining car our esophagus, the guard's van our left lung, the cattle truck our shins, the first-class compartment the piece of skin at the nape of the neck and the level crossing an electric elk called Simon. The clarity is devastating. But where is the ambiguity? It's over there in a box. Shunt is saying the 8:15 from Gillingham when in reality he means the 8:13 from Gillingham. The train is the same only the time is altered. Ecce homo, ergo elk. La Fontaine knew his sister and knew her bloody well. The point is taken, the beast is moulting, the fluff gets up your nose. The illusion is complete; it is reality, the reality is illusion and the ambiguity is the only truth. But is the truth, as Hitchcock observes, in the box? No there isn't room, the ambiguity has put on weight. The point is taken, the elk is dead, the beast stops at Swindon, Chabrol stops at nothing, I'm having treatment and La Fontaine can get knotted.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would re plan",
            "review_score": "1"
        },
        {
            "review_text": "It's just a fly getting high.",
            "review_score": "-1"
        },
        {
            "review_text": "It's alright if you're into games which revolve around what you see in the environment. However, for its size (which I note is rather small) it may not be worth it. If you have 50 something Megabytes and 5 minutes spare, it is 'okay' for the first time, but I don't think it can played again with the same effect. I don't mind it, I just wish there was more 'game' in it. But overall, if you want to press the W key and occasionally some others, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Completely changed my view on flies.  Never again will I harm or look down upon a fly.",
            "review_score": "1"
        },
        {
            "review_text": "This game wasted 7 minutes of my life. Totally worth it Fly/10 would fly again",
            "review_score": "1"
        },
        {
            "review_text": "-Flew very high up -Saw a light -Thought : 'Is that the sun? Is that the end of the forest? Am I gonna see a beautiful landscape at the end?' -It was actually a light bulb. -Fried on it  420/10-Would get fried again.",
            "review_score": "1"
        },
        {
            "review_text": "I became fly Jesus and sacrified myself to a light bulb so that all flies may be redeemed.",
            "review_score": "1"
        },
        {
            "review_text": "Best fly simulator and 8 minutes of my life. Play this game. ",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking to find a game, you've come to the wrong place. I feel like this title is more of a message, a provoking message, of how the things we strive to achieve may not be worth it at all, the euphimism being the fly trying so hard to get to the light, just to have it end up killing itself. It's an incredibly easy game to get %100 on, and as a completionist I have to recommend it for that, and the message it conveys, but like I said it's not a game and more of a message. I may be completey wrong as well, so if that wasn't the developer's intention then I apologize, either way, check it out and get a %100 complete game.  This has been an EqualJones review, thanks for reading and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Not bad for a short joke. Should be even shorter though.  And in the end it said this): 'The game crashed. The crash report named '2014-02-15_125400' next to game executable. It would be great if you'd send it to the developer of the game'.",
            "review_score": "1"
        },
        {
            "review_text": "the message behind the plan   there no plan. ",
            "review_score": "1"
        },
        {
            "review_text": "just amazing belive it or not an emotional expirience the meaning of life for a single fly he seems insignificant but he is so much more is one peice to the puzzel in the riddle of life. it is incrediable how attached you get to this fake digital fly. he is almost a real friend",
            "review_score": "1"
        },
        {
            "review_text": "the game! aaah what a twist of an ending. at the end of the game, you're gonna feel that you're not more than a mere of a fly. great soundtrack too",
            "review_score": "1"
        },
        {
            "review_text": "touch the face of god with your filthy antennae",
            "review_score": "1"
        },
        {
            "review_text": "Realy good story, amazing character development. I feel like i became one with the fly. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fly your way to the top.",
            "review_score": "1"
        },
        {
            "review_text": "It's not a game but a video. Simply amazing!!!",
            "review_score": "1"
        },
        {
            "review_text": "Magnificent, touching and astonishing! Wasn't expecting such kind of feelings and thoughts from the game that lasts less than 5 minutes..or maybe forever?.. ..or maybe its not the game that lasts?  Keep on with this kind of things, guys!  10.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Free-to-play, 5-minute philosophical game. No artsy fartsy drivel.  Worth your time if you like games like Brothers, the Stanley Parable and Thomas Was Alone.",
            "review_score": "1"
        },
        {
            "review_text": "A short little adventure with a good atmosphere and controller support for an enjoyable 5 minutes before you finish the game, maybe have it crash, go back to the menu and click the credits for the easiest perfect game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Very fly.",
            "review_score": "1"
        },
        {
            "review_text": "A short game,sad story sad music...they just wanted a place to stay.. And I was silent for 5 minutes. Damn, it make me sad :(",
            "review_score": "1"
        },
        {
            "review_text": "Great game 5/5 ",
            "review_score": "1"
        },
        {
            "review_text": "its the single greatest game on steam",
            "review_score": "1"
        },
        {
            "review_text": " 'What then is truth? A movable host of metaphors, metonymies, and anthropomorphisms: in short, a sum of human relations which have been poetically and rhetorically intensified, transferred, and embellished, and which, after long usage, seem to a people to be fixed, canonical, and binding. Truths are illusions which we have forgotten are illusions — they are metaphors that have become worn out and have been drained of sensuous force, coins which have lost their embossing and are now considered as metal and no longer as coins.'  — Some dude who probably played this game for too long",
            "review_score": "1"
        },
        {
            "review_text": "welll strange game ._.  really lol",
            "review_score": "1"
        },
        {
            "review_text": "'In order, here are the emotions I experienced during the three minutes it took me to play The Plan, the new free morsel from the Norweigan indie developer Krillbite: confusion, frustration, boredom, fear, amusement, delight, joy, enchantment, and regret. One of the things independent games ask us to do is accept that a three-minute game can be as valid as a thirty-hour one. Games like these make it hard to disagree.' - Joseph Bernstein (Buzzfeed)  'Krillbite Studio, the developers behind Among The Sleep, have gone on and released a most polished, visually stunning and freeware new game' - Konstantinos Dimopoulos  (Indiegames.com)﻿ ",
            "review_score": "1"
        },
        {
            "review_text": "I held the W key for about 5 mins and the I beat the game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a portal to zen mode. Relaxing and yet make you think about life.  Pros : + Beautiful Scene + Beautiful Sound + Easy to Play + Relaxing + Portal into zen mode + Makes you ponder about life  Cons : - It's a Fly (personal grudge towards all fly)  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Is YOUR plan for life anymore meaningful?",
            "review_score": "1"
        },
        {
            "review_text": "The game only takes about 5 minutes, and honestly, i've played it for the achievement. But in those 5 minutes something amazing happened. In the end, you create 'feelings' for your character, and it almost feels like you don't want to suicide him.   I have to say, creating feelngs in 5 minutes for a character is a great achievement from everyone who worked on this game!  Furthermore; The soundtrack and the graphics are just beautiful. Great job. Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "An artistic game. It deserves being tried by everyone: it makes you feel pretty much like watching the life of a human being, more than the one of a simple fly...",
            "review_score": "1"
        },
        {
            "review_text": "I am not sure what the game wanted to convey.",
            "review_score": "-1"
        },
        {
            "review_text": "i recommend you play this game - the game is free - only takes about 10 minutes of your time per play through - this one of those games that isn't really about what you do and what happens, its about how you feel playing it - narrative has fitting beginning middle and end (i specially liked the surprise after the ending) - good use of music - mechanically, the game play has very few 'game-like' elements, just six directional movement and object avoidance - the narrative is done purely with game play (no reading text, no voice acting, etc.) - can be as meaning less or as deep as you want it to be ... just like the subject matter",
            "review_score": "1"
        },
        {
            "review_text": "U can't fly through leaves!  10/10",
            "review_score": "1"
        },
        {
            "review_text": " Nominated for 'Game that Screwed Your Mind in the Shortest Time' award",
            "review_score": "1"
        },
        {
            "review_text": "Very very short, but very beautiful game also. You're a fly... and you fly. Nothing more until the end, but with astonishing visuals and music (classical).  I got some lag flying through the breeze, but nothing that makes me mad. The game is free, light download, just give a try.",
            "review_score": "1"
        },
        {
            "review_text": "I only enjoyed this because there was an achievement.",
            "review_score": "-1"
        },
        {
            "review_text": "Why? That's all I can say, really. The game was an amazing experience. I loved it, then that ending. Yeah it was a twist, but I thought it was supposed to be SAD. Anyway, Its really easy and kinda repetative. It's free though and should only take 1 or 2 minutes to install, try it out. Oh and when it says in the popular tags, its not all that scary.  Word Rating: Meh, its got good ideas. Number rating: 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "It let me live out my dream of flying to a fiery death 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is a game, but not a game. It is a philosophical adventure, where a fly explores the meaning of life, the meaning of existence, the meaning of the universe. The Plan will make you doubt yourself, and how you have lived your life. The Plan of the fly is to unveil truths, and to make players philosophize. The Plan will make you wonder, 'Who am I to this fly?'  A quick little quest, not replayable, but beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "It's up to you to decide what you learn from this game. Some may not see anything and think this game wasted 4-6 minutes of his/her life playing this game. Some may learn an important lesson from this game.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who is disgusted by closeups of bugs this game was gross to play at first.  unless you play Navi mode, which is a nice addition as well as the only achievement   It deals with the life of a fly and conveys it's message through atmosphere and music, eventually crescendoing into something huge and magnificient, yet paltry in comparison to our lives. An art game that only runs for a few minutes, I can certainly say that I was content with what was presented and as such say that this isn't a bad game.  Plus it's free, so that's always a plus.",
            "review_score": "1"
        },
        {
            "review_text": "You just play as a Fly and go up for about 5 minutes, that's it. But I did get an easy achievement.  I like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Took me 10 minutes to figure out the conrols 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "The Plan has great music and it's something to do when you're bored, the game itself need's more things to be added but other than that, it's a enjoyably game.",
            "review_score": "1"
        },
        {
            "review_text": "Eh Hem. You die when you reach the sun. Dont try to dodge the small sun, because you cannot. btw...Spoiler Alert.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I've ever played. I thought it would be dumb, but all these reviews are right. This is a beautiful, wonderful, and most of all intellectual experience. It takes you to another level of thinking, and shows you true beauty and pain. I have never been more satisfied with a game. It let my cold, cold heart feel again.",
            "review_score": "1"
        },
        {
            "review_text": "Mother of God! I almost never plar a game more than once this is one game that I will keep in my Steam library forever and tresure this beautiful and unpredictible game. A MUST PLAY! GO PLAY THIS GAME! COUPLE MINUTES OF WONDERS! NOW! PLAY IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable. Good visuals, supports surround gaming (nice feeling) and very great soundtrack!  Didn't see that ending coming! :'D Nicely done",
            "review_score": "1"
        },
        {
            "review_text": "Flying simulator w/ nice buzzchievement.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wonder what it's like to be a fly? If yes, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Short Game, with a great story behind it. Only takes 10 minutes to complete this game.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year, NA. \\o/",
            "review_score": "1"
        },
        {
            "review_text": "I played 10 minutes or so of The Plan before I reached the ending (or so it would seem). I made a concerted effort not to rush through the game, just tried to explore it.  The game is not very substantial, and it is very short. The Plan is ultimately a game made on the side by developers who are working on a bigger game, and I would not expect much more.  However, what it lacks in quantity it makes up for in quality. The Plan is a very aesthetically pleasing game, easy to run and is enjoyable to play. There is no combat or puzzle solving, just the pure exploration of the imagination of the game's creators. The music is excellent and really adds a feeling of immersion. Such a game would not be expected to have much of a replay value, but what it does have is heart and a lovely idea.  For the very generous price of absolutely nothing, I see no reason why not to devote a few minutes of your day to pick up this little beaut.",
            "review_score": "1"
        },
        {
            "review_text": "dont get the point and i still not get the point  ",
            "review_score": "1"
        },
        {
            "review_text": "T_________________________T    THIS GAME IS BEAUTIFUL",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Simulator game ever played !! :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is the only game that has ever moved me. It tells a story of life, love, danger, and mystery with only imagery and music. This is one of the greatest games ever to be created and few could every hope to be greater! You shall never see the humble fly the same way ever again.  11/10 (A ten is too low to properly score this game)  Game of the Year",
            "review_score": "1"
        },
        {
            "review_text": "Wow I am not going to spoil it for anyone but this is a must play game.",
            "review_score": "1"
        },
        {
            "review_text": "Well the life of a fly is short, like the game. Funny unexpected end.",
            "review_score": "1"
        },
        {
            "review_text": "Still better than Takedown:Red Saber.",
            "review_score": "1"
        },
        {
            "review_text": ";_;",
            "review_score": "1"
        },
        {
            "review_text": "Your a fly 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well now... This one sort of took me by surprise. Very artistic and a strong sense of simbolism going on here. Not really a game per-say, but none the less worth 5 minutes of your time.   Plus, its a great boost to achievement hunters such as myself out there, its one and only achievement is both easy and preety epic looking if I do say so myself.",
            "review_score": "1"
        },
        {
            "review_text": "A short yet worthy experience.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth buying.   The good news is 'The Plan' is free, takes up little drive space &amp; is moderately interesting. It's also a short game-ish thing that you can cram in between actual games.  'The Plan' misses the mark of being of being a completely profound experience like 'Journey', but it's still worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "it is good but very emotinal too ps needs doritos",
            "review_score": "1"
        },
        {
            "review_text": "Jacob's Story Read below to read about his epic journy of hardship and beauty to reach the stars!!  ***SPOILER ALERT***         Since Jacob was a little larvae he had a dream that he would go on a great adventure to the great beyond and fly away with the wind. When he turn 20 days old he grew the courage to leave and begin on his epic adventure. It was a dangerous trek from all dangers. Furious, gushing winds. Gigantic leaves falling off from trees. When he finally flew above the trees, he gasped of how breathe taking the stars and sky were. He flew higher and higher, trying to reach the stars. As he was flying higher he imagined his self flying to the stars. He thought to himself that he would fly farther than the stars.....to the moon. He wanted to look down and see the whole world. He flew faster and faster to reach the sky. Jacob saw a bright light above the sky. 'Is that the sun?' he said in excitement. He flew closer and closer to it as it grew bigger and bigger. As he flew closer to it, he could feel the bright heat coming off of it. His eyes determined on the light he flew closer. Jacob felt determined that he just needed to touch it. ....And he could, He flew to it, hugging and feeling its warm embrace. Then.....zzzzZZZAAAAAPPPPPP!!!!!!! As Jacob was falling downward, he looked to bright light and saw the stars and the clouds and the moon. Gazing upon their beauty, he felt that he lived his life with no regrets. He smiled, as his wing broke away from his burnt body. A tear came to his eye as the sky turned to dark and engalfed by the tall trees. He closed his eyes to imagine himself flying through the stars as he hit the ground. He saw the bright light once more and felt nothing.....and felt everything.  Jacob was still young, but he followed his dreams to the end. He embraced the massive world and took it head on. He will always be remembered and loved. We will miss him.   R.I.P. Jacob 8/2/2015-8/21/2015",
            "review_score": "1"
        },
        {
            "review_text": "It's free, functional, and a relatively small download, so there's really no reason not to give The Plan a try if you're looking for a quick diversion. It definitely belongs in the 'not a game' category, if you're the kind of person who separates playable experiences that way. There are no puzzles or ways to fail. But there is some nice art and quality music integration. All-in-all, it was interesting and relaxing, and I don't regret the time it took to download.",
            "review_score": "1"
        },
        {
            "review_text": "The best game i ever played.",
            "review_score": "1"
        },
        {
            "review_text": "i cri evrytiem  11/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "I feel enlightened after my 5 minute journey through this game. It makes me rethink my entire existence. 10/10 need to play",
            "review_score": "1"
        },
        {
            "review_text": "Very nice flying game and musics... download it now",
            "review_score": "1"
        },
        {
            "review_text": "You play as a fly who likes to fly. Really fun 10 minutes!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so deep, it tore at my heart strings, 10/10 would fly Sirflysicnewton again.",
            "review_score": "1"
        },
        {
            "review_text": "This game has great music and artwork, and yes its not hard to finish. It only takes about 6 min. but its worth playing it for that time.",
            "review_score": "1"
        },
        {
            "review_text": "It's a short but fun game if i had to mark it out of 10 i would give it a 8/10  P.S. It's a very calm and relaxing game.  By The_Lonely_Toaster",
            "review_score": "1"
        },
        {
            "review_text": "  Well.. Not quite sure what I am supposed to be doing in this game. Just a fly and ugh.. flew.",
            "review_score": "-1"
        },
        {
            "review_text": "It was okay. It's not really game though, but it's free so I'm not complaining. It's cute, I guess.",
            "review_score": "1"
        },
        {
            "review_text": "Have no idea what i just played :3",
            "review_score": "1"
        },
        {
            "review_text": "Trippy as ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing short game, I wish there was a spider on cobweb.",
            "review_score": "1"
        },
        {
            "review_text": "If i was a fly, this would ne the peacful way to die.",
            "review_score": "1"
        },
        {
            "review_text": "Wow a brain ♥♥♥♥ing game haven't played games like this for a long time alr totally 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is perhaps one of the most touching games i have ever played . Its short but sweet . When the ending comes it comes too soon justified in its own simplistic ways . You couldn't ask much of a free game . I love the art work and the score . Anyone who appreciates quality in a short little package should appreciate what The Plan has to offer !",
            "review_score": "1"
        },
        {
            "review_text": "i recomend this game to fps players because it has so much action",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would Fly again.",
            "review_score": "1"
        },
        {
            "review_text": "after playing this game, i look at flies in a different view.   10/10 will play this game again for the graphics &amp; music.",
            "review_score": "1"
        },
        {
            "review_text": "I started the game... And I did not say anything. Just silence. And 'Tzzt'.   &lt;Return&gt;  Me: 'Wat'  ",
            "review_score": "1"
        },
        {
            "review_text": "Be free, Seth Brundle!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing music and artwork and one simple achievement",
            "review_score": "1"
        },
        {
            "review_text": "free, small and very short (5 minutes?)  Looks nice, sound and music is good, but for me personally it was a waste of time. I would only recommend it if you want to relax or need a reason to think about life for a few minutes, since there is nothing to do basically.",
            "review_score": "-1"
        },
        {
            "review_text": "This game changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "  The Plan  is in Motion",
            "review_score": "1"
        },
        {
            "review_text": "Very pointless. But I loved it. So it doesnt matter",
            "review_score": "1"
        },
        {
            "review_text": "Very pretty visuals, love the music from Peer Gynt Suite. Fun to figure out the achievement.",
            "review_score": "1"
        },
        {
            "review_text": "Swag. Just. Swag. It's so beast. Swag. So much. Swag. Much Such Very Wow. Swag.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, short game that, intentionally or not, causes you to ponder the meaningless of life and how it all ends suddenly. ... For the acheivement, you also get to kill Navi, which is nice for LoZ players :)",
            "review_score": "1"
        },
        {
            "review_text": "A game that makes you think about the purpose of life.",
            "review_score": "1"
        },
        {
            "review_text": "this is a very very short game and it is fun at first but then it is just really slow and i never saw the point of the game. i dont get the very ending and the meaning behind it. not worth the few minutes it took to play",
            "review_score": "-1"
        },
        {
            "review_text": "this is a very very short game and it is fun at first but then it is just really slow and i never saw the point of the game. i dont get the very ending and the meaning behind it. not worth the few minutes it took to play",
            "review_score": "-1"
        },
        {
            "review_text": "Artistic and hollow.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretentious walking (flying?) simulator worth every penny you'll spend on it.  You fly up. You get stuck in a spider web/wind blows you a little off course. You get killed by a zapper/lightbulb that, for some 'symbolic' reason, is in ♥♥♥♥ing space. The end.",
            "review_score": "-1"
        },
        {
            "review_text": "boring waste of time and space",
            "review_score": "-1"
        },
        {
            "review_text": "I just don't see any real depth or life lessons in this game. However, I'll admit that I am deeply biased, as I raise insects as a hobby. All I got out of this is that the programmers don't share my love of creepy crawlies, they just like seeing them added to 'the circle of life'. Plus, it glitched out twice when I clicked on the credits, preventing me from getting the sole achievement. I have no desire to spend another 5 minutes pressing the 'up' button, just to see if it'll crash on me again. Real flies are *way* more fun to watch than this game. Thumbs up if you like insects! :D",
            "review_score": "-1"
        },
        {
            "review_text": "The game may have been cool if it lasted more than 5 minutes and had something to actually do in it. Well, at least it's free and has a super simple Achievement. Uh, yeah. 1 single Achievement.",
            "review_score": "-1"
        },
        {
            "review_text": "It's just a holding W simulator, really. While the visuals are nice, and the sounds are great, there's not that much to it.",
            "review_score": "-1"
        },
        {
            "review_text": "The only thing actually good about this game, is that it's like 5 minutes long and you get XP at the and. I almost fell asleep while playing it though. It's like a bedtime story or like a lalaby.   For those of you looking to get a higher Steam level (XP), just get it for the fun of it!",
            "review_score": "-1"
        },
        {
            "review_text": "what",
            "review_score": "1"
        },
        {
            "review_text": "Unrealistic. Flies can fly much quicker and don't listen to ambient and classic.",
            "review_score": "-1"
        },
        {
            "review_text": "An absolute waste of oxygen",
            "review_score": "-1"
        },
        {
            "review_text": "This isn't much of a game. Most of the people who played it probably did for the easy 100% achievement. If that's all you want then this will satisfy you but if you want to have some fun, you'd be better off playing something else.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of comments make this game out to be incredibly sad, but it's just 'meh' to me. The fact that it always crashes for me at the return screen doesn't help it's cause either.",
            "review_score": "-1"
        },
        {
            "review_text": "I genuinely have no idea what people see in this game. But hey, free achievment for clicking the credits on the main menu",
            "review_score": "-1"
        },
        {
            "review_text": "Played for the achievement.  Of course people like Patrick Klepek and Nathan Grayson recommand this game. That alone should be enough to tell you to pass on this, unless you're an achievement ♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I was kinda high. It was ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Very beautiful, but not my type of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I wonder if anyone at Valve played this 'game' before putting it on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "its a free game sure. one achievement which is easy (just click on credits really).   Otherwise its a Artistical game to me. you play as a Fly and the goal is just fly up and up high as you can till you die.  thats about it...  everyone getting emotional about it i dont see it.. but its a free game worth a try nice and small.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really game material. Yes, it has some artistic value and the music is very nice, but there are better places, like youtube, for this kind of thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Look, if you just want to add a game to your collection: download this. The music is pretty snaz and it's cool just to mess around as a fly. So if that's your cup of tea ~ I recommend ~ BUT OTHERS WISE NO!",
            "review_score": "-1"
        },
        {
            "review_text": "This game Is TERRIBLE no explanation what to do and who the hell wants to just fly up?? this game is meant for your ♥♥♥♥ing phones",
            "review_score": "-1"
        },
        {
            "review_text": "What kind of game is this...?? ",
            "review_score": "-1"
        },
        {
            "review_text": "It sucks you do nothing but fly in a creepy background",
            "review_score": "-1"
        },
        {
            "review_text": "what the f.",
            "review_score": "-1"
        },
        {
            "review_text": "You play as a random fly that goes up and up then theres a big twist and it's gameover... Now bare in mind there is probablky some stupid hidden meaning behind this but the game was borring, i may as well have taped down the up key and watched nothing happens except the wind sometimes blows at the start. Do not beleive these other reviewers there is nothing deep about this game, and I deffinatley didn't cry at the end, I was just glad I could play something better when it was over!",
            "review_score": "-1"
        },
        {
            "review_text": "Just didn't do much for me...",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is slow and boring. The graphics and music are good, but the overall game, and the ending, were just poorly made. I see a lot of other people 'got something' out of playing this game, but i didn't 'find' anything that made me 'rethink life' or whatever.  The concept was good, but I felt it was poorly executed; I would only recommend you play this game if you are very bored, as its free, and can give you something to do for the next five minutes.  And one last complant that nobody probably cares about... The title makes no sense. :|",
            "review_score": "-1"
        },
        {
            "review_text": "What is dis all i did was fly in a 2d place WTF",
            "review_score": "-1"
        },
        {
            "review_text": "Hah that was so amazing! try it out.",
            "review_score": "1"
        },
        {
            "review_text": "Reached treetops, promptly crashed. Pointless and boring up until then.",
            "review_score": "-1"
        },
        {
            "review_text": "Truly a masterwork piece of art. Best game/art ever. amazing for all your needs. Please join 'The Plan Appreciation' if you are truly an enthusiast of this amazing piece of artistic talent and expression in video game format. 10/10 have played again and again",
            "review_score": "1"
        },
        {
            "review_text": "You go up and then die from a lightbulb....not entertaing and explains why it was less than 10 minutes of entertainment.",
            "review_score": "-1"
        },
        {
            "review_text": "Holding W till you reach a light bulb, then die. Not very entertaining in my eyes. The 'deeper message' is non-existent.",
            "review_score": "-1"
        },
        {
            "review_text": "The Plan pretends deepness, but its lackluster gameplay and pretentious metaphors ruin the experience. Go play Journey instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of time, but it's free",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of time, but it's free",
            "review_score": "-1"
        },
        {
            "review_text": "The game consists of holding up and occasionally moving left or right. Even as an art project it doesn't seem particularly deep or moving. Largely a waste of time, though at least a very short and cheap (free, in fact) waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "It made me play in awe initially, but then I hoped the ending wasn't like I imagined it was... But it really was. I have to say it is a beautiful and introspective game, but with a very frustrating ending.",
            "review_score": "-1"
        },
        {
            "review_text": "Don´t download this game.",
            "review_score": "-1"
        },
        {
            "review_text": "....I don't know if i should suggest this game or if i should not, i mean i am just a fly flying around, what is the point of this so.... I am disliking it",
            "review_score": "-1"
        },
        {
            "review_text": "I got my friend play this, i thought that it was okay but here's what he said:  'F*cking mos stupid piece of sh*t I've ever played. Saw first review, saying it'll make me cry. Bullsh*t. I have anger management sessions and this ♥♥♥♥♥♥ me right off! YOU FLY FOR 6 F*CKING AGONISING MINUTES JUST TO GET KILLED OFF BY A SINGLE F*KCING SH*TTY LIGHT. F*CK THIS GAME. STUP*D ♥♥♥ SH*TTY GAME. Wasted 6 MINUTES of my life just flying up, expecting something good to happen. Nope. C*nty b*tches play this game and c*nty b*tches only. F*ck this and my life.'   Yeah that's what he said...",
            "review_score": "-1"
        },
        {
            "review_text": "Boring.  Nice to have an achievement, but really, you're just going up.....No skill involved. I don't see why people are over-glorifying this title.  At least with the achievement you get to play as a 'Ball of light' fairy, but that's really it.    Long story short, a boring waste of time. Nicely made, but utterly pointless.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok...I mean no offence, but over 100 MB to play just about 5 minutes, it's not nice... What I can say this is a... Image-Idea that the developer wanna send us a message, a thinking about poor little thing in this life... In all about 5 minutes you just press Up and Left, Right to avoid the leaf, the wind. You fly, fly and fly up to the...heaven, hm...the sky really beautiful (oh you can see the Horsehead Nebula, too) until you fly to the strong light, oh what is that? A sun, A God? No, just a...100W Incandescent light bulb, should I touch it? Just try, and kaboom -&gt; so bullshjt. The most thing I love is the sad song and the beautiful sky...  So, I am not really wanna tell you play it, just try it once, hope you can see a beautiful hidden message. But if the 'game' has a little more scene, a little more story, I will be very recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I can't even think of a funny review, this 'game' was made in probably 10 minutes and it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly long and boring, even if it only lasts 5 minutes. It's not a game and it's not an interactive piece of art. Keeping a single key pressed during 5 minutes to watch a boring movie, without any other choice, is not an interaction. The end is predictable since the begining. And guess what ? The software crashes after you reach the end. Come on !!",
            "review_score": "-1"
        },
        {
            "review_text": "People who love to get laid in 4 minutes might like this, for the more romantic people among us -- do not play this pseudo-artistic game.",
            "review_score": "-1"
        },
        {
            "review_text": "Ummmm..... what?  I had no idea what was going on in this game, and well, to me it just felt like Fly Simulator 2014. It took me 5 minutes to beat it and I wasn't even sure if I beat it or lost it.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe I'm just insensitive, because I'm not seeing where the appeal is coming from. The music is nice, the visuals are nice, but it isn't life changing by any means. I guess the appeal comes from the lesson, which funnily enough could be anything. That life will have hurdles, and no matter what you do you'll die in the end? That flies have thoughts, no matter how miniscule, yet are disregarded so heavily?  In the end, I just can't grasp the appeal except that in the end, what you type is displayed. Which has given me chuckles, seeing people put 360noscope among other things. You get what you pay for, which isn't much more than a self-determined lesson (one that you probably already knew, no less) and some laughs when you see what other people wrote.",
            "review_score": "-1"
        },
        {
            "review_text": "The Plan is nice looking with pleasant background music. The experience I felt was lacking. I was able to predict how it would end before it happened so for me there was no great revelation in this 'art piece'. As a demo reel it was good, showcasing the skills of the team well but as something that I would play or experience it failed. Download it to listen to the music and look at the art style but don't expect any great revelations or philosophy from this title.  Edited 20 Jan 2015  Coming back to this after nearly a year and the ending made me smile. Did I change as a person in that year? Am I more easily amused? I don't know but it did raise a smile....",
            "review_score": "-1"
        },
        {
            "review_text": "This is pointless. 6 out of 10 4 for its decent graphics 2 for its music  To be frank, I'm not a sensitive person. This game is pointless, It seems there're only three things you need to do- Fly, Dodge and Escape. Using WASD, to control your Bugs flying direction. But what's the point of all this? Does it refer to some part of our life? Some call it art, I donno. People call Piscasso's drawing art but it's as pointless as hell to me. So does this game. This game isn't meant to be replayable. Sometimes perhaps you think TOO MUCH. Or I simply is not sensitive enough to discover the true beauty of this unworthy game.",
            "review_score": "-1"
        },
        {
            "review_text": "wasted 10mins of my life...",
            "review_score": "-1"
        },
        {
            "review_text": "We all want to avoid what inevitably awaits us in the end. The Plan with its awesome music score paints this image and we instantly feel someting very deep for the fly which broadly speaking portrays every single one of us.",
            "review_score": "1"
        },
        {
            "review_text": "Most awesome soundtrack and great atmosphere. Download it already, if this game's not worth the disk space I wonder which game is!",
            "review_score": "1"
        },
        {
            "review_text": "I thought I could resist the light…  …I can't.  10/10  Flight  Fly Simulator of the Century.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't really a game at all , its an interactive journey where the only way you can go is up and a bit on the sides .Still even with such simple controls it captivates you and keeps you interested in the life of this fly . The message seems to be a lot more philosophical than it is literal . Also the soundtrack to this game is wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "the fly made me angry but he dies later and it was the ♥♥♥♥ing easiest 100% achievement completion of my ♥♥♥♥ing life so 10/10 hands down",
            "review_score": "1"
        },
        {
            "review_text": "One bottle of wine, 12 Minutes of gametime. I feel small and insignificant. This is some beautiful stuff. You should experience it, but don't be in a dark place when you do!",
            "review_score": "1"
        },
        {
            "review_text": "Don't watch the trailer. It will spoil the whole thing.",
            "review_score": "1"
        },
        {
            "review_text": "So deep I can see Adele rolling in it",
            "review_score": "1"
        },
        {
            "review_text": "amg dis game so g00d ign rates 11/10 (I just did this review for the badge)",
            "review_score": "1"
        },
        {
            "review_text": "So good I actually want to pay them some money.",
            "review_score": "1"
        },
        {
            "review_text": "Spoiler Alert! . . .  I really thought I was going to heaven, I guess not XD. The game was a lot shorter than expected (About 10Min) but, that doesn't make this a bad game. Krillbite keeps the feel of among the sleep by seeings things in someone or 'something's' perspective, also gameplay is simple, left, right up &amp; down. I really don't know why but, the spider web scared the **** out of me! It was so sudden, the wind, the trees &amp; the leaves make the atmosphere complete. Overall Great Game. 827/827",
            "review_score": "1"
        },
        {
            "review_text": "I don't think I can put into words the emotions this game made me feel again.   The story telling is out of this world. An overwhelming performance on the part of the voice actors.   10/10 A perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "Took me 6 hours to finish the final boss.",
            "review_score": "1"
        },
        {
            "review_text": "It's just like real life. You go up and up (or achieve and learn a lot of things) yet you end up dying anyways. Depressing but it's the truth. At least it's better than just sitting and doing nothing at all. What a great game to reflect on. :D",
            "review_score": "1"
        },
        {
            "review_text": "Really not worth the 3 minutes it takes the reach the end.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not sure I understood but I think I needed that.",
            "review_score": "1"
        },
        {
            "review_text": "I can't beat the boss",
            "review_score": "1"
        },
        {
            "review_text": "Take five or ten minutes and give this a play.",
            "review_score": "1"
        },
        {
            "review_text": "Great procastinator game 333333333333333333333333333333333333333333333333/1 ",
            "review_score": "1"
        },
        {
            "review_text": "that was sad!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice little game, 5 well spent minutes",
            "review_score": "1"
        },
        {
            "review_text": "A short piece of poetry, thanks for giving us this little gem...",
            "review_score": "1"
        },
        {
            "review_text": "I beat this game in 6 minutes. That said, it's still interesting and has an entertaining ending. Just download and play it, it's free and has a small download size.",
            "review_score": "1"
        },
        {
            "review_text": ":c More beautiful than a goat making sweet, sweet love to another goat.",
            "review_score": "1"
        },
        {
            "review_text": "Though very short and very simple in its functions and delivery, The Plan is enough to make us wonder all the way until the final payoff. It is enough for you to play once or twice, but most likely this is a game that would be more entertaining when you're watching someone else play it for the first time, and that's a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "The game went all black for me and i could only hear noises help?",
            "review_score": "-1"
        },
        {
            "review_text": "Well played...",
            "review_score": "1"
        },
        {
            "review_text": "This game so well!",
            "review_score": "1"
        },
        {
            "review_text": "Most boring and pointless game in the world. You fly up for ten minutes, there's a lightbulb and the game ends. Waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game. Allows for maximum playing time as a fly. Really envelopes you into the life of a fly. 100% would play again.",
            "review_score": "1"
        },
        {
            "review_text": "It's free for a reason, I have a feeling this 'game' was made by a collage student's project and s/he somehow got it on Steam. Do Not Play This Game. I wish I could get those 5 minutes back, I would have used them for something much more fun, like repeatedly applying a cheese grater to my retina.",
            "review_score": "-1"
        },
        {
            "review_text": "Well made, nice atmosphere, the shock of your first spiders web, beautiful background and the light. Worth the time =D",
            "review_score": "1"
        },
        {
            "review_text": "The most inspirational game to date  10/10",
            "review_score": "1"
        },
        {
            "review_text": "very calming and relaxing",
            "review_score": "1"
        },
        {
            "review_text": "A fly slowly makes its acsend, with wind, and leaves, rain and trees, a fly ascends and into a home. There the fly is met to its destiny. A light in the sky...    No not the sun. A lightbulb. ",
            "review_score": "1"
        },
        {
            "review_text": "strangely soothing",
            "review_score": "1"
        },
        {
            "review_text": "This game turned me into an atheist 10/10",
            "review_score": "1"
        },
        {
            "review_text": "best fly simulator ;D but limited as hell x:",
            "review_score": "-1"
        },
        {
            "review_text": "With a beautiful soundtrack and gorgeous zen graphics, The Plan may be the most beautiful game I have ever played. It shows the futility of life through the eyes of a fly, seemingly one of the most insignificant of creatures. Though short, it had me nearly in tears at the end. This should be made into a short film, though, in a way, it already is one. I would recommend this game to everyone I know, as it is literally the best indie, and the most beautiful game, I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Unique game with a great soundtrack.  And it's free.",
            "review_score": "1"
        },
        {
            "review_text": "It looks nice but what is the point of this game?",
            "review_score": "-1"
        },
        {
            "review_text": "The Plan is definitely an interesting game. It doesn't really have a clear objective and it's very, very short, but it is interesting. You play as a fly. Just a fly. A normal fly. You don't have super powers... You're just a fly. You fly upward and upward to your eventual death by bug electrocutor. That's it. There might be a metaphor, but I didn't catch it. There is only one achievement, so, of course, I have one-hundred-percented it, but it is a great achievement. You'll love it if you get the reference, I'm sure.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game to say the least. It combines simplicity with an absolutely beautiful soundtrack to create, what I define, as art. If you're the kind of person who is able to appreciate nature, then you'll probably like this interactive art piece (game). Just try it; completing the game takes no more than 5 minutes, you may just like it.",
            "review_score": "1"
        },
        {
            "review_text": "pretty great game for what i got to play. on linux it crashes after the spiderweb",
            "review_score": "1"
        },
        {
            "review_text": "This would be better categorized as an experience and not as a game. I am not going to spoil the experience and it is free and short anyway so:  If you want a small experience that might make you ask yourself some questions, do go ahead and pla... experience it.",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the worst game ive ever plaied. All it is is a fly going up. [Its a good fly sim though.]",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed every second, of the approximately 5 minutes I spend on this game. Even though the game is using those 5 minutes telling me, that my life is pointless. but it does it in a way that makes this game absolutely brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "this game is the engine of the universe...",
            "review_score": "1"
        },
        {
            "review_text": "i dont think i will ever experience anything greater",
            "review_score": "1"
        },
        {
            "review_text": "Very simplistic and short game but the music is beautiful. The game is free so will always recommend",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would play again. The ending was enlightening.",
            "review_score": "1"
        },
        {
            "review_text": "This beautiful creation has brought tears of both joy and sorrow to my eyes. The well thought out storyline and immersive graphics have amazed me. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Magical realism used in a concise and evocative way. Once you start thinking about this game metaphorically, it's difficult to stop. Plus the end made me laugh out loud. Highly recommended.   Don't forget to listen to the stars at the end :)",
            "review_score": "1"
        },
        {
            "review_text": "I haven't laughed at the ending of a game in a while, but this game... well I wont spoil it for you, so try it out. After all it is free. ;]",
            "review_score": "1"
        },
        {
            "review_text": "Emotional , worth playing.. just 3~5 minutes",
            "review_score": "1"
        },
        {
            "review_text": "best game ever,  simple game with an unexpected ending,",
            "review_score": "1"
        },
        {
            "review_text": "A life changing game. I can never go back to who I was before I played this.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. Very exciting plot line, and very moving ending. Reminded me of my childhood.",
            "review_score": "1"
        },
        {
            "review_text": "Flies are love. Flies are life. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of 'The Turin Horse'. This is more than a videogame, this is a fantastic interactive art piece.",
            "review_score": "1"
        },
        {
            "review_text": "Very very short, very very sad",
            "review_score": "1"
        },
        {
            "review_text": "Simple and elegant, definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, Would Fly And stuff",
            "review_score": "1"
        },
        {
            "review_text": "I found myself with my jaw dropped staring at a white screen with a little back, blinking line for 3 mnutes after finishing the game..... then i entered my name and quit the game! 10/10 would listen again    Hey, Listen",
            "review_score": "1"
        },
        {
            "review_text": "It's worth the 5 minutes to 'play' The Plan just for the audio experience alone. The music and sound effects are done really, really well. Listen with a headphones for the best experience. The visuals are cool. A nice low-stress diversion.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "To shame this game is not longer 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This... is simple art.",
            "review_score": "1"
        },
        {
            "review_text": "Okay... I don't know why i enjoyed this game so much, maybe it's because my secret dream is to be a little fly? Who knows. One thing is certain - this game is surprising. How? Well, u fly, fly and fly, over and over and you have fun with this. Frankly, i don't know why but it's a fact. The only drawback of this game is its duration. Yeah, 7 min is so short time. Anyway, take this game and play, right here right now, try to be a super duper fly. Fly to victory!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Skyrim with Hopes and Illusions",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is the greastest game of all time with 1000080p graphics and music by the gods themselves, cross console multiplayer, and is the top game on steam.",
            "review_score": "1"
        },
        {
            "review_text": "So beautiful...  MoreThanTen/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a very soothing game just to spend a few minutes on. You start out as a fly in the beginning and the game is straight forward from there. I also enjoyed the art style.",
            "review_score": "1"
        },
        {
            "review_text": "A brief insight into the world as a fly sees it. Interesting interpretations and conclusions can be drawn from the game's ending and its title: 'The Plan'. This brief artist adventure is worth sparing a few minutes to play.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this (partly because my first thought was exactly to do, what the devs wanted player to do, i.e. ascend) It's certainly worth asking price and, also, it sounds absolutely lovely!  SPOILERS! SPOILERS! * *   As it stands, it's pretty good 'F*ck this gay Earth' simulator, where you can fly off into space to see Horse Head nebula.. and also Pillars of Creation, just to remove all the doubt, along with subtlety   Sad thing is - that's the only thing you can do. I think It would really help to have more stuff to do on the ground and have chance to end the game on the ground, just to make the final experience so much more satisfying.  ",
            "review_score": "1"
        },
        {
            "review_text": "Well that was a surprise.",
            "review_score": "1"
        },
        {
            "review_text": "I don't think The Plan is a game in the traditional sense. It's not even fun in the traditional sense. But it has meaning. It's a story. Even if the story is (very) open to interpetation, it instils feelings in the player. Which, if you think about it, is what games are all about.  It's hard to delve into what the game is about without spoiling it, so I'll try to be vague. In The Plan, you play as a fly in a big, scary world. You work hard to keep pushing forward, rising from your place on the forest floor up into the heavens, only to find that the heavens aren't what you think. The 'twist' at the end is small, but still speaks volumes towards the idea that this glorious, awe-inspiring ascension is more grounded than it appears at first.   The Plan is very, very short. A single playthrough might last 10 minutes at the most. It is possible that, for some, it may take longer to download this game than to play through it. Despite its puny length, The Plan is definitely worth a look. The game looks great visually, and the soundtrack is absolutely glorious. Unless you are some hotshot banker, on-call heart surgeon, or someone else whose time is super important, The Plan is worth the 10 minutes and $0 you will spend on it.",
            "review_score": "1"
        },
        {
            "review_text": "A short allegory of life told through the many eyes of a fly. Music and lighting work together to create a beautiful atmospheric effect. A remarkable tale of a game.",
            "review_score": "1"
        },
        {
            "review_text": "So I played as one of the most annoying bugs out there... and after playing this I actually feel sad :( !!! You must experience this ! . . . So what ya waitin for, bring out the fly in YOU !!!",
            "review_score": "1"
        },
        {
            "review_text": "I loled.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't expect a game about a fly to be so pretty &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A great metaphor for life.  You start as a big fly in this unknown terrain hoping to find your way. Soon you discover where you should go and utras you move along this life there are winds that try to stop you. At times you find yourself being trapped in webs but that should not stop you from your goal.   You keep on going and despite all the dangers that lies ahead you still keep on going. Till you reach the light. Then, everything is complete and you have reached your destination.  Is it death?  Is it a revalation?  Is it hope?",
            "review_score": "1"
        },
        {
            "review_text": "Great game, 8/8 will play again you follow the last minutes of a fly's live with the beautiful music piece aase's death by edward grieg playing in the background",
            "review_score": "1"
        },
        {
            "review_text": "I keep playing it again, over and over...",
            "review_score": "1"
        },
        {
            "review_text": "There are so very few words to describe this game. I would even go to the lengths to call this game a work of art. If you've got some spare time on your hands, I strongly suggest downloading and playing this game. 12/10",
            "review_score": "1"
        },
        {
            "review_text": "I cried.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "You're a fly on a compelling journey.",
            "review_score": "1"
        },
        {
            "review_text": "ok that was interesting!",
            "review_score": "1"
        },
        {
            "review_text": "This game (or maybe better called 'cinematic experience') takes less than 8 minutes but the ending is entirely worth it. There's not much that can be said without spoilers, but it's a short and free download so there's no excuse to not give it a try.  Watch the emotional rollercoaster go from 'what' to 'meh' to 'what have I done? I'm a MONSTER' in less time than it takes to download a standard AAA title. That's good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "This game had me thinking a pop scare was to come, but as i ascend into the big light in the sky and the music plays louder and louder. There it was, The beginning of the end for this tiny fly(or bee cant ♥♥♥♥ing tell cause im dumb). Well played.",
            "review_score": "1"
        },
        {
            "review_text": "Fly away my little fly",
            "review_score": "1"
        },
        {
            "review_text": "Fly Log Day 16:   After pupating for a week I entered the next chapter of my life, Adulthood. How exciting I thought it would be initial, but I quickly I couldnt be more long. After several days living the mundane life of eating poo, pooping on humans food source and whiping my hands afterwards, I craved something more. I decided to move up in the world.  I was met with much hardship: gail force winds, killer leaves, and viscious arachnid brethren. But the freedom felt heavenly.  10/10 - would seek a higher calling again",
            "review_score": "1"
        },
        {
            "review_text": "My feels Pls I can't take this anymore Omg Such good game Much sad Very detail Wow",
            "review_score": "1"
        },
        {
            "review_text": "Very simple yet complex a visual art piece non the less",
            "review_score": "1"
        },
        {
            "review_text": " Wait..what??? ",
            "review_score": "1"
        },
        {
            "review_text": "An thoughtfull little peace of art. you owe it to yourself to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Wow...what a really nice little game! It's always nice to find these little treasures hidden away in the corners of Reddit. It's very simple and short but completely to the point. It is also VERY much an 'art' game.",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' is pretty cool. It's super short, but on your way to the end you make your own little story. I like a game that makes you think. And the music is pretty awesome aswell :)",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the shortest game I've ever played. 13 minutes is all it took to complete, and the ending was fairly deep.  As a free game, it's worth a try. It only takes about 10 minutes to fully play, compared to some games that can eat up hours before you decide it's not the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Literally the worst thing I've ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "Play it. It's free and it only asks 10 minutes of your time, max. The ending is very rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Oh wow. That escalated quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever. All you do is hold up and win in 3 minutes.  1/10  Except that it's not a game and it's really stupid. Easy 100% though.",
            "review_score": "-1"
        },
        {
            "review_text": "So I got this based on good ratings and the $0.00 price tag. I can only really recommend this time waster to those who are willing to allow 10 minutes of their life go to pot. This is basically a screen saver with an 'up' button.",
            "review_score": "-1"
        },
        {
            "review_text": "Very simple idea and game as far as I see, but nice quality execution. The 7 minutes of playtime was worth it. :D",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty game.  Best moment to play this: when waiting for another download to finish.",
            "review_score": "1"
        },
        {
            "review_text": "Life of a fly can be poetic. Amazing artwork and soundtrack.  10/10 would press up arrow key again for 6 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Best fly simulator in the market! It simulates the sad and happy life of wild/household flies and their sad death.",
            "review_score": "1"
        },
        {
            "review_text": "In five minutes this game will make you rethink your entire life.  Probably the richest story-based experience on Steam.  10/10 would ascend again.",
            "review_score": "1"
        },
        {
            "review_text": "I was NOT expecting that ending... To be honest it was so beautiful I never even thought of the possibility. Beautiful music and background though. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "It was cute, and it's free, and it doesn't take very long at all to finish.",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful experience.  Recommend trying it out late at night",
            "review_score": "1"
        },
        {
            "review_text": "The most beautiful game I have ever played. When you think you have reached as far as you can go, your only half way there. T.T",
            "review_score": "1"
        },
        {
            "review_text": "I had fun playing this. If you want some peace and quiet and some breaks from all the action games, play this. It's very chill, nice music, and the game also makes you rethink some things about life. ",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, the scene is incredible. From the beginning, I did not get the point of the game at all. However, as I playing this game, I gradually know the meaning of the game. IT'S LIFE!",
            "review_score": "1"
        },
        {
            "review_text": "Like 2001: A Space Odyssey, but with more flies.",
            "review_score": "1"
        },
        {
            "review_text": "Short, beautiful, great music, profound and free. Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "You travel though a large and scary world, you start to wonder if there is a point to your existance? Then you become atached to your beloved fly that you have soared to new hights with. Through the tops of trees and through a vast galaxy with intense music playing to urge you on even more. All i have left to say is sometimes the light is too bright.   10/10    ",
            "review_score": "1"
        },
        {
            "review_text": "Please play this game everyone. The world will be a much better place if you do.",
            "review_score": "1"
        },
        {
            "review_text": "Well done Krillbite, you made me sad for a fly and left me questioning my own existance. Great F'n job!",
            "review_score": "1"
        },
        {
            "review_text": "Nothing to see and nothing to do in all the 5 mins of gameplay :|",
            "review_score": "-1"
        },
        {
            "review_text": "*-*",
            "review_score": "1"
        },
        {
            "review_text": "rip young ♥♥♥♥♥ there's a heaven for a G :*(",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is not so much a game as it is a short animated parable. It's visually and musically rich, but very limited in scope, and requires extremely limited input from the user. You maneuver a fly through a small clearing in a virtual forest. I won't reveal the ending. That's about it. I enjoyed the artistic qualities very much. Both the painterly setting and the musical score are outstanding. Definitely not for anyone looking for action and challenge in a game. Still, the price is right; if it seems intriquing, give it a shot,",
            "review_score": "1"
        },
        {
            "review_text": "Probably the greatest piece of philosophy that you can get for all of your nothing. And the FEELS. Oh GOD the feels...  10/10 - Would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "Just a nice calm game you can sit down and play for 10 minutes",
            "review_score": "1"
        },
        {
            "review_text": "So this is how we die, huh?",
            "review_score": "1"
        },
        {
            "review_text": "My take away of The Plan is that it is a brief experiential metaphor on the journey through life. It begins with curiousity and wonder then takes you through the complacent routine, sudden hazards and obstacles, beauty and contemplation, and ultimately an almost comedic tragedy. The Plan is visually and audibly beautiful with a stylistic visuals and a soundtrack that compliment each other and the experience as a whole. It is the gaming equivalent of a masterful short story or film short, and well worth the 5 minutes or so it takes you to complete it.",
            "review_score": "1"
        },
        {
            "review_text": "A nice little sequence showing the ascension of a humble fly.",
            "review_score": "1"
        },
        {
            "review_text": "That was quite a nice game, however short it has amazing looks, great music, and it makes you ponder things although, that is quite a questionable ending",
            "review_score": "1"
        },
        {
            "review_text": "Life, The Universe, and Everything.....                                                                                                             42",
            "review_score": "1"
        },
        {
            "review_text": "A cute 2 minutes game nothing amazing somewhat boring in the middle but the ending is nice.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 ign 'the feels' ",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - great soundtrack (slow strings) - good buildup - you feel like it's all leading to something - pretty good visuals  Cons: - Ending VERY VERY anti-climatic. It sucks. - No story really. You feel like there's a story that's about to be told but it doesn't get told  Summary: Sucks. Pass it unless you've got too much time. I finished the game but didn't even get the achievement.",
            "review_score": "-1"
        },
        {
            "review_text": "next time when u kill a fly think about it....",
            "review_score": "1"
        },
        {
            "review_text": "Wow. 5 minute free game. Good play.",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is a free to play game with just about 5 minutes of gameplay. Is it worth bother downloading? Yes! It has some funny moments and online interactivity, it looks nice, is atmospheric and even features achievements (actually just 1, but whatever), kind of a new game plus, and a plot twist! All of that in 5 minutes! So I recommend you give it a try",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet, and to the point. It's amazing that a game can be so short, and without words, yet still carry such heavy emotion through music and atmosphere.  If you like experiences like this, then I highly reccomend 'Journey' on PS3",
            "review_score": "1"
        },
        {
            "review_text": "Play this. Pointless. Original. Beautiful. True definition of a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I never know whether to reccomend or discourage when it comes to free to play games, because it's not like you can ask for your money back. For what it's worth, The Plan does look quite nice, but even to a pretentious indiephile such as myself I see little point in this game. Some of the art assets look lovely, and the ending is a bit of a shock, but I think this game was going for a kind of simple poigniancy that I'm afraid it doesn't quite achieve. Perhaps it's due to the fact that they used poorly made 3D sprites in occasions where it would've been simpler and more attractive to use 2D ones, perhaps it's due to the lack of player involvement, and the original idea could've been worked into something a bit more engaging, but as it stands, Plan still falls short somehow.",
            "review_score": "-1"
        },
        {
            "review_text": "It's Good, Worth a go",
            "review_score": "1"
        },
        {
            "review_text": "Somewhat of a nice experience!",
            "review_score": "1"
        },
        {
            "review_text": "I don't get it. What do we do after we get zapped and type are names? ",
            "review_score": "1"
        },
        {
            "review_text": "A Fly on the wall experience!",
            "review_score": "1"
        },
        {
            "review_text": "Excuse me miss, I didnt get my permission slip signed for this Feels Trip",
            "review_score": "1"
        },
        {
            "review_text": "Start of game: 'What the heck is this...' End of game: *cries*  Seriously, this game is almost meditative. Especially when Edvard Grieg's song started playing.",
            "review_score": "1"
        },
        {
            "review_text": "XD Is it bad that I laughed kinda hard at the end? Was is supposed to be a funny anti-climax? Either way, love these free but interesting sort of games!   [Also thanks for the free 100%] [Also, atheist undertones?]",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what happened. One minute I was flying up. The next, I thought I found heaven. I could never be more wrong.",
            "review_score": "1"
        },
        {
            "review_text": " The Plan Review",
            "review_score": "1"
        },
        {
            "review_text": "Either you'll think this is dumb, or it will take you for a ride. The game is so short, and free, that you should just go play it. Personally, I think this belongs in a museum, say in a little booth with a curtain and headphones.",
            "review_score": "1"
        },
        {
            "review_text": "A piece of ART",
            "review_score": "1"
        },
        {
            "review_text": "I cried.",
            "review_score": "1"
        },
        {
            "review_text": "-SPOILER-  Ok I just wasted 5mins of my already very boring life to just fly upwards and (I think) get hit by a light and die. And the rest of the time I was playing it to try find a hidden ending or something different, but yes the game is as simple as it is said.  But i guess its just the life of a fly.",
            "review_score": "1"
        },
        {
            "review_text": "It's free, it's short, and it's beautiful with a touch of irony. Play it now.  I was expecting there to be sparrow as you clear the treetops, but the music, visuals, and ending far surpassed my expectations.  Have you played this yet? Why are you still reading?  If you had started it at the beginnning of this review, you probably would have finished the game by now. Seriously quit reading and start flying upward. It even has controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Downloaded this game,played it non-stop and won it.Got all achievements. Great game :D  But... When i tried to write this review i got this message '' You need to have used this product for at least 5 minutes before posting a review for it (1 minutes on record). '' Yes,i won this game in 1 minute :D",
            "review_score": "1"
        },
        {
            "review_text": "Really gave me some time to stop and think about what I am doing with my life in this game where your goal is to fly...",
            "review_score": "1"
        },
        {
            "review_text": "An short but intense experience that I would recommend to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "the best game on steam. the best game anywhere.",
            "review_score": "1"
        },
        {
            "review_text": "Very nicely game, you need to play it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a short game but it makes up for it the fact that graphics are really good and the soundtrack is aswell. ",
            "review_score": "1"
        },
        {
            "review_text": "You must try it",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: Got thr achievment.  I've played this before in another account. But sadly everytime I play and try to get the achievement the game crashes ;u; But still reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "Play this with some good quality headphones on and the volume all the way up. It's over quick but it is worth it. Fantastic job guys!",
            "review_score": "1"
        },
        {
            "review_text": "And thus, a new tragic hero is born.",
            "review_score": "1"
        },
        {
            "review_text": "The most artistical game out there.",
            "review_score": "1"
        },
        {
            "review_text": "A short, sharp experimental deliberation on the meaning of life.",
            "review_score": "1"
        },
        {
            "review_text": "My mind is blown",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't get better than this. 10/10 Play it now.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic, albeit short game. music is amazing, some would call this game art.",
            "review_score": "1"
        },
        {
            "review_text": "The raw definition of life. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "well you fly strait up for about 6 minuts and then die",
            "review_score": "-1"
        },
        {
            "review_text": "Well, that was nice 8 minutes!  Also, I dare you not to swiwel with the music in.. erm.. last half of the game!",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever 10/10  Enough said...",
            "review_score": "1"
        },
        {
            "review_text": "Best Game I have play yet it makes you think about life and if you was in there shoe. Pls the music is just wonderful the act is really nice as well so I recommend this game to anyone who have some time on his/her hand to download and play this wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "One phrase to describe this game: Through simplicity comes complexity",
            "review_score": "1"
        },
        {
            "review_text": "I beat this game in 5 minutes, the ending was funny and the only acheivement was an easter egg. Pretty awesome.",
            "review_score": "1"
        },
        {
            "review_text": "help stop fly abuse. Many have already played and signed up. Go online to  PETA.org/stopflyabuse ",
            "review_score": "1"
        },
        {
            "review_text": "The game was quite good for how short it is. It only took me a couple minutes to complete but the art and music make up for it completely. I would suggest not rushing through the game (like i did one my first time) and taking some time to enjoy how beautiful the game actully is.",
            "review_score": "1"
        },
        {
            "review_text": "It's a short, sweet, free game. Install it, play it, and reflect at least once. It's not much a game as it is a message. But the message really puts our lives into perspective.",
            "review_score": "1"
        },
        {
            "review_text": "I love it ! The simplicity, the music, the panorama, and the feeling you get when finally realized, 'Wow, being a fly is tough !'",
            "review_score": "1"
        },
        {
            "review_text": "Play with headphones and you get Goosebumps Simulator 2013.",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game to play in your free time!",
            "review_score": "1"
        },
        {
            "review_text": "...wut... that was... that was... a moment...",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game just play it its free and only takes 6 minutes that you will never forget",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game you should try it :)",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, This allows me to fulfill my inner desire of being a fly. just fly around for hours and hours, I cannot believe the amount of fun that I have just flying randomly in this game! It makes me feel like an insect, just like I have always wanted",
            "review_score": "1"
        },
        {
            "review_text": "This game is deep. And it's responsible for a lot of feels.",
            "review_score": "1"
        },
        {
            "review_text": "Really quick weird little game. Not sure the point.",
            "review_score": "1"
        },
        {
            "review_text": "It's a sort of video game short story. I really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever, there is so much meaning behind this game, based on the fly's point of view.",
            "review_score": "1"
        },
        {
            "review_text": "This game... was... just... Amazing",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the most fun one could ever have in 7.5 minutes! This was so good that I threw out my 50 inch LED 3D television and gave up bathing. If I were you, I'd sell my children and play this until your fingers bleed. Awesome/10.",
            "review_score": "1"
        },
        {
            "review_text": "This was oddly satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "For a game that doesn't really last longer than 5-10 minutes it's a really interesting experience. From the same mould of a game as Journey. Something I'd describe as experience gaming and if that's your kind of thing then I say go for it. Even if it's not it's only 10 minutes and it's free so it's worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "Such a calming, simple game with suprising depth.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game Ever 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Worst Game EVER!!!! all you do is play a fly which you have to fly up and up and then you die by a burner.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is short but still pretty nice. The end is really unexpected and it made me laugh, but it's really only a one time game.",
            "review_score": "1"
        },
        {
            "review_text": "I find this games commentary to be very compelling. It's short, but great.",
            "review_score": "1"
        },
        {
            "review_text": "My life and everything in it makes sence now.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! Not really a game, but nice graphs and works just great on Linux.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the shortest games I have ever played. However, the developers tell the story within this game in such an amazing way that is worth a gander.",
            "review_score": "1"
        },
        {
            "review_text": "This is more of a work of art rather than a game. I can't recommend it on principle but if you need a touch of emotional torque, feel free to give it a look.",
            "review_score": "-1"
        },
        {
            "review_text": "Very pretty game that allows the player patience and peace of mind.   Very simple, barely even a game. But, it lingers with you.",
            "review_score": "1"
        },
        {
            "review_text": "To say too much would be to ruin the experience. If you have a few minutes, you'll experience it all.  Give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "The best game I have ever played. I give it a 1000 out of 3. Makes me feel bad about all the flies I killed. :(",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever spent time considering the nature of life and death? Have you pondered the pointlessness of the common fly? Well here's your answer! For the low price of free, you too can experience the rollercoaster thrill-ride that is The Plan. Download this game and play it. Afterwards you can use the philisophical concepts which you have experienced to pick up hot girls at parties! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty weird game, but still good :D It's not at all a long game, there's no plot, not a fantastic gameplay, but it still has something: a nice short story. If you want to know something about a small fly, check this out :)",
            "review_score": "1"
        },
        {
            "review_text": "The game craashed at the end after i input my name. maybe i'm missing something important? ",
            "review_score": "-1"
        },
        {
            "review_text": "Oh man, this was really solemn. I feel for that little fly dude.",
            "review_score": "1"
        },
        {
            "review_text": "Aboslutely wonderful! The music is great. I felt really attached to my little fly guy. Worth the 5 or so minutes of game play!!",
            "review_score": "1"
        },
        {
            "review_text": "An aw inspiring game that brings you into the life of a fly. A must play game.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, this is a game you should play. Turn Skype off and your volume up for the effect.",
            "review_score": "1"
        },
        {
            "review_text": "for a short game it has a lot to say its well worth 6-7 mins of you're time ending is so sad =[",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful little experience. It's more a thought or an idea than a game, but well worth six or seven minutes of your attention, which is what'll take you to reach the unexpected finale.",
            "review_score": "1"
        },
        {
            "review_text": "The plan is a beautiful game. You play as a fly who is just well, flying. You keep going until you reach the end. Now, when you see a fly you kill it but that fly has feelings as well. I think this game is better than Grand Theft Auto Five and Battlefield 4 combined. Game of the year right here!!",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Worth 112 MB and a few minutes of your time. Beautiful, emotional, amazing. This game demonstrates... something. I'm not sure what. But it's definitely art.",
            "review_score": "1"
        },
        {
            "review_text": "I Cryed...........",
            "review_score": "1"
        },
        {
            "review_text": "Only takes 6 minutes to understand a fly...",
            "review_score": "1"
        },
        {
            "review_text": "5-10 minutes of gameplay... then DEAD. poor poor little fly",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly short, but incredibly powerful.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game, the music was absolutely stunning. Considering it only takes few minutes to complete the game it is worth to check it out.",
            "review_score": "1"
        },
        {
            "review_text": "worth every penny, a must play!!!",
            "review_score": "1"
        },
        {
            "review_text": "mind blow .........D: so sad! &lt;3 &lt;3 &lt;3 &lt;3 people need to play this!!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and poignant all in a few minutes of gameplay. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I won't be able to kill a fly anymore.",
            "review_score": "1"
        },
        {
            "review_text": "I'm interested where does the final comment at the end of game go? Did the developers gather the final thoughts of players?  if so, would you show them somewhere like what 'the walking dead' did?",
            "review_score": "1"
        },
        {
            "review_text": "This has the best music of any free game i have ever heard, it is magical and eery even though its just a game about a fly. Little to no mechanics, no graphical options, no FOV sliders  10/10, i cried",
            "review_score": "1"
        },
        {
            "review_text": "I will never hurt a fly again! 11/10 for the feels.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the game 'Journey' you'll appreciate this short appetizer",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy story based games, some of the games I love most people would say it wsa an interactive story and not a game at all. This looked to fit my taste when reading the reviews. After playing it, I can tell you it is flat, with no depth or meaning. If you would like to take 10 seconds and get a completed game please do so, otherwise there are many amazing with real story and depth out there for you (To the moon, dear ester, gone home ect).",
            "review_score": "-1"
        },
        {
            "review_text": "Very Atmospheric, love the music and the ambience that it creates. It's very well made for a short game.",
            "review_score": "1"
        },
        {
            "review_text": "If this was a short film you'd be bored out of your skull. As a game, you're still bored out of your skull, but you get to hold down the arrow up key.",
            "review_score": "-1"
        },
        {
            "review_text": "this is one amazing game music is just amazing",
            "review_score": "1"
        },
        {
            "review_text": "This game is brief, but surprisingly heartwarming. Anyone who enjoyed Journey will love The Plan.",
            "review_score": "1"
        },
        {
            "review_text": "Great game :)",
            "review_score": "1"
        },
        {
            "review_text": "i would say its worth it. in the end.... i let you figure that out for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "I played the game for about 3 minutes and it was great ( even though i didn't cry ). I dont know how to get the achievement and I think that fly died at the the end. IDK",
            "review_score": "1"
        },
        {
            "review_text": "Haha totally unexpected",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this to everyone, it's a beautiful game and emotionally moving.",
            "review_score": "1"
        },
        {
            "review_text": "that was strangley depressing ",
            "review_score": "1"
        },
        {
            "review_text": "How To Win -  Step 1 - hold w  Step 2 - you have completed the game!  But seriously though, this game is short, and arty. It may be boring to alot of people, but a good ending :D",
            "review_score": "1"
        },
        {
            "review_text": "That was deep",
            "review_score": "1"
        },
        {
            "review_text": "An exercise in philosophical debate disguised as a game title. lol. An Original idea nicely planed and executed...now you just have to make it into an actual game! :)",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet. You've wasted more time watching youtube or browsing reddit. Give it at least one playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little 'game', if you can call it that.",
            "review_score": "1"
        },
        {
            "review_text": "omj what. the sountrack is ♥♥♥♥ing awesome. but the game is so, gud",
            "review_score": "1"
        },
        {
            "review_text": "this is the really saddest games ive ever played after i done kill so many flies i feel bad :'(",
            "review_score": "1"
        },
        {
            "review_text": "Simple, beautiful, and free.",
            "review_score": "1"
        },
        {
            "review_text": "In five minutes this game puts itself in such stark contrast with your life that you have to appreciate it for its simple, yet metaphor rich atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "If you got 5 minutes to spare, give this one a go.   May not seem much, but this will give you some feels.",
            "review_score": "1"
        },
        {
            "review_text": "I thought this was pretty cool. It's one of those games where you think to yourself, 'this is stupid', but then as you play the music, the visuals, and then the end is pretty legit. Nice work!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, kinda makes you think alittle about the world around you, somewhat short for my taste, but its free, so who cares. ",
            "review_score": "1"
        },
        {
            "review_text": "This may not be a game , but more of a journey. Thought it is short, its was a very moving journey. More games that use narrative to move a story the music and imagery did a wonderful job here . I love the creativity of this and wish more games would experiment then stick to tried and true. A must download for true 'gamers'.",
            "review_score": "1"
        },
        {
            "review_text": "The excitement it just too much for me sometimes",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the strangest gaming experiences I've ever had. Try it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool",
            "review_score": "1"
        },
        {
            "review_text": "i played for a solid 10 minutes. why did i get so attatched",
            "review_score": "1"
        },
        {
            "review_text": "If you have 5 minutes to play, you really should try this. I won't spoil anything in this review but man dem feels, dem dam feels ;( + the music is AMAZING !!!!!!!!!! 11/10 would bang",
            "review_score": "1"
        },
        {
            "review_text": "'A fly ascends to the skies, pondering the pointlessness of its brief existence.' Everyone should play through The Plan atleast once. This game is a great expirience that words can't describe. The Plan is the most beautiful game I have ever played. You start as a fly near the ground and ascend upwards. The fly encounters some dangers ( wind, leaves, and a spiderweb ) and eventually is over the tree tops. At the end you are flying high in the sky and can see stars in the background. A large light appears above you and eventually your fly is attracted to a lightbulb. When the fly touches the lightbulb ( mysteriously sitting in the sky ) the screen turns white. You are given the option to type whatever you want on the white screen. The Plan will make you ponder life and existence. Enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this. Its short and really pretty. There is'nt much story, but the ending.. I wont spoil it. Check it out yourself and you wont ever forget it. Trust me, its worth the time to play it..",
            "review_score": "1"
        },
        {
            "review_text": "A great peace of art - since it's free, you have to give it a shot",
            "review_score": "1"
        },
        {
            "review_text": "If you havge 5/6 minutes free and just want to relax, play this.. Leaves you thinking!!",
            "review_score": "1"
        },
        {
            "review_text": "After initially giving up after about 2 minutes, and going back for a second go after re-reading the reviews this is definately worth a short play through! After getting past the boredom, and confusion, and frustration the music takes over and it becomes beautiful! So random but weirdly meaningful...",
            "review_score": "1"
        },
        {
            "review_text": "The plan was an amazing journey. It took me through a lot of emotions and all I have been through in my life. It is a good game and you should pick it up. Its free!!",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game I've ever played  11/10",
            "review_score": "1"
        },
        {
            "review_text": "A comedic way to waste time if you're bored!",
            "review_score": "1"
        },
        {
            "review_text": "what the hell did i just play",
            "review_score": "1"
        },
        {
            "review_text": "Very simple game with the greatest ending ever.",
            "review_score": "1"
        },
        {
            "review_text": "I have spent a total of 8 minutes on this masterpiece and I loved every single minute of it.  It was the most glorious and intoxicating rollercoaster of emotions. This will change the outlook of not only your life, but of flies as well. You will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Never have I felt more intouch with my inner fly.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ best game. recommend to everyone. MLG strat. 10/10 everyone ages 10 and up please play this game. changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea where they got the idea, but there is a game about a fly well ya know flying around. Its short but its free so it makes sense. So is there anything else you can do in this game your asking me, well uh you can get the fly to get hit by a leaf thats kinda cool. I will say this download this game its worth it and will bring a smile to snot dribbled faces.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting... O.O",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Figured I'd pitch some support for this game; first things first, it is a beautiful game. It'll take approximately five minutes ut of your day and it is fully worth it. It's another one of those journey-esque art games that just makes you think. Overall, beautiful little snippet that really gets the mind going.  On a side note, the music is stuff that I've heard while playing Civ 5 which is...odd, to say the least.",
            "review_score": "1"
        },
        {
            "review_text": "Its like life with all its twists and problems. At the end it always ends the same.  ",
            "review_score": "1"
        },
        {
            "review_text": "The symbolic and spiritual ride it takes you on is well worth the 5 minute journey.",
            "review_score": "1"
        },
        {
            "review_text": "Hillarious! Check it out, it's free to play! :D",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet.",
            "review_score": "1"
        },
        {
            "review_text": "It's a social experiment that is good for a short laugh or a moment of reflection, depending on your temperament. In either case, it only takes five minutes to play and it's free so I say go for it!",
            "review_score": "1"
        },
        {
            "review_text": "Definately worth the five second download and ten minutes it takes to play the entire game.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I'd have an emotional connection to a fly but there it is, and then it's gone.",
            "review_score": "1"
        },
        {
            "review_text": "This game has made me realize, that life is pointless...   15/10  GOTY for the next five years",
            "review_score": "1"
        },
        {
            "review_text": "Tons of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "this game was pointless....like, very pointless....BUT it was highly relaxing and is great for people like me with anxiety and depression and such...",
            "review_score": "1"
        },
        {
            "review_text": "Wow. That was so peaceful, the ending legit made me think about my life a bit... Breathtakingly good, even though it is simple... its just WOAH... I loved it!!!",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "weird game. but pretty.",
            "review_score": "1"
        },
        {
            "review_text": "surprisingly game!",
            "review_score": "1"
        },
        {
            "review_text": "This game explains life in 7 minutes. It's worth the time to download and play it. Do it. Uncover the meaning of the universe.",
            "review_score": "1"
        },
        {
            "review_text": ":(",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful and evigorating experience. I lived, i learned, i cried, and felt compelled to rummage through my refrigerator late at night looking for something 'snacky' to consume.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting little take on life. If you are capable of analytical thinking and have 5-6 minutes to spare, it's worth the play. Not really a game though, more of an input oriented movie. Deep themes.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely! Too bad there aren't any spiders in the game :-)",
            "review_score": "1"
        },
        {
            "review_text": "This game is really amazing. It makes you think of the smaller things in life and it is really relaxing. Ofcourse this game is short i beat it around 6 mins i guess but it was TRULY worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Life cycle single fly everytime ends same.   I cried at the end. Q_Q",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is an incredible game. One of the best games I've ever played and one of the saddest...  This is a must play. ",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know what to say about this game... The Plan went so deep into the little details and little things that we never take note of. We finally view how it would be through the eyes of one single fly on it's journey through it's short life. This stirred up so many emotions in me in just 5 minutes. I really reccomend you play this game. Only 5 minutes of your life that can enlighten so much. ",
            "review_score": "1"
        },
        {
            "review_text": "When I saw the light getting stronger, I said that's it I reached Heaven :D  amazing good work!!",
            "review_score": "1"
        },
        {
            "review_text": "It took my 10mins! So worth it!",
            "review_score": "1"
        },
        {
            "review_text": "'It's just a fly,' they said. 'Shoo it away,' they said.",
            "review_score": "1"
        },
        {
            "review_text": "We are all the fly.",
            "review_score": "1"
        },
        {
            "review_text": "It was Somehow Funny but also sad, how a single mistake can take your life.",
            "review_score": "1"
        },
        {
            "review_text": "this was kind of fun xD this is a game that shows you that you don't have to have a complicated physics engine and story behind a game to make it look nice and entertaining I enjoyed it, because it looked nice",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't be surprised if this won the game of the year award.",
            "review_score": "1"
        },
        {
            "review_text": "For a short game, maybe 3 minutes total, and well not really a game more like an artistic experance. The visuals are enjoyable the music really adds the atmosphere. If you're looking for an actual game type game this isn't for you, this as I said is more of an interactive piece of art. Is it worth downloading? Yes, it is a tiny download and its a quick 'play' through. Well worth it",
            "review_score": "1"
        },
        {
            "review_text": "0_0  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Gaming equivalent of The Fountain, amazing.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 This game made me Reevaluate my life and question the meaning of existence. It's a must play.",
            "review_score": "1"
        },
        {
            "review_text": "What is the point of the game?",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable game. Makes you ponder lifes meaning, 10/10 if you have 7 minutes play it. (The ending is very good.)",
            "review_score": "1"
        },
        {
            "review_text": "D: poor fly",
            "review_score": "1"
        },
        {
            "review_text": "Very beautiful game and very well done. Sad ending that makes you think allot. You should try it, it's just 6 minutes of your time not that much but worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Holding up simulator. 10/10 GOTY would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting little game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best adventures you can experience in such a short time. Its plotline is pretty amazing, short, emotionally compromising, and free. There is trully no excuse not to play this.",
            "review_score": "1"
        },
        {
            "review_text": "The entire journey I contemplated what exactly I was flying for and where I was going, and when I reached the conclusion it made me wonder if it even worth the hassle of the flight... and then I compared the fly's jounrey to my life and now I need a drink",
            "review_score": "1"
        },
        {
            "review_text": "A truly beautiful game from the art to the music good job krillbrite!! :)",
            "review_score": "1"
        },
        {
            "review_text": "Wut is the point of this game i mean rellay WTF",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is a extremely short (8 minutes) game about a fly. I'm not going to spoil much, but it's agreat game with a strong and powerful theme. I highly recommend this game to anyone if they have 8 minutes to spare.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you to the developer for a thoroughly enjoyable 7 minutes. Play this game!",
            "review_score": "1"
        },
        {
            "review_text": "Well done, well done indeed! I was not expecting to end as it did! Short, fun entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "I thought i was gonna reach heaven 8 mins of pure fun",
            "review_score": "1"
        },
        {
            "review_text": "I cried.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "The game says it is a pondering of a brief existence. Game basically, in the most simplest and beautiful of ways (to me this is what it says) is that you only have one way to go. UP. Many things will cross your path and make you fall away from it. Dont give up, finish what you started. You will only end up one way. Make the most of it.  Beautiful game. Worth 3 minutes of my life.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of video game musical scores like I am you must play this. Also the visual style is very interesting and I would like to see this style in more games.",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is as good as a free, 5-minute exploration game can be. Give it a try while winding down.",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "His Life Was Long And Fruitful...... JK.",
            "review_score": "1"
        },
        {
            "review_text": "It is a masterpiece for all who love Minuscule series.",
            "review_score": "1"
        },
        {
            "review_text": "Why does this game exist?",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best free games i played in my entire life! if you have lil bit time and i mean atleast 5\\10 mins try this out... takes secods to download and minuts to finish...",
            "review_score": "1"
        },
        {
            "review_text": "A really nice and well done game! It tells a story about the small things in life. The game itself is good and the detalis are flawless. I also liked the background music! :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, play it if you have 5 minutes :)",
            "review_score": "1"
        },
        {
            "review_text": "You should play this free game if you have free five-ten minutes and some patience. (More like this, please...)",
            "review_score": "1"
        },
        {
            "review_text": "Totally amazing stuff, real feeling, great visuals and top top soundtrack!!  Short but wow! :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a wonderful mixture of atrowk and music some might day it's boring and dull but all you have to do is enjoy the fact that you dont have to do much and that the creators of this game have made a game that you have to enjoy the artwork and music not killing everything",
            "review_score": "1"
        },
        {
            "review_text": "Yup, a really game. Kinda reminded me of 'And then everything started to fall'.  And as my mate used: 'yea lif def sux'.",
            "review_score": "1"
        },
        {
            "review_text": "I dont need to tell you what i got from this game. Play it and find out what it means to you.",
            "review_score": "1"
        },
        {
            "review_text": "12/10, best game you will ever play. Recomeneded for all gamers ;)",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game, artistic and free. It only takes a few minutes to complete, but it'll still make you feel. Currently has a bug (pun intended) that causes the game to crash as soon as it ends, preventing you from getting the achievement. Hopefully will be fixed soon",
            "review_score": "1"
        },
        {
            "review_text": "This game... I dont even know where to begin. This game is likly the most beutiful game I have ever played. Its awe inspiring. The journy that you and this fly travel though its life changing. This fly represents the stugles of life and you the mind, all the stugles that you lead the fly though is so deep. im not going to spoil the ending for you but you must play it all the way though. 15/5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Play this game. While it doesnt have a particular storyline, nor is it immensly interesting, but in what little the game entails, it will make you think and feel. It is quite shocking, really. Its free and short. It will take you five minutes or less to finish, so play it. I promise, its not a waste of time.",
            "review_score": "1"
        },
        {
            "review_text": "lovely game if you have a spare 5 to 10 minutes well worth playing",
            "review_score": "1"
        },
        {
            "review_text": "Tis game is beautifully amazing! I enjoyed it so much that i bought the FULL soundtrack and it only cost me 23 bucks! If the creater dorsnt make a follow up to the game by 2017 ill kill myself. Hope this guy gets an invitation to work for steam :)",
            "review_score": "1"
        },
        {
            "review_text": "Umm, I was confused then saw what was up at the top.....and just laughed my ♥♥♥ off.......wow....lol",
            "review_score": "1"
        },
        {
            "review_text": "i liked how short this game is, i don't really care that it crashed after the ending, it looks beautiful and the ending is kinda sad",
            "review_score": "1"
        },
        {
            "review_text": "If you're college educated, you might have a Pavlovian response to this game. It's euphoric.",
            "review_score": "1"
        },
        {
            "review_text": "Well,I guess it's a peaceful game for anyone who just wants to get away from all of the s**t thats going on today (ex. Mass Shootings, Government Gone insane, and so on...). You CAN make up your own story,but basically you are a fly trying to get to space or something like that. Will you guide this fly to space or whatever is up there (because i know and you don't), Will you ever know where this fly might wind up?, Find out in The Plan!",
            "review_score": "1"
        },
        {
            "review_text": "This game was very relaxing and good for deepthoughts. If you are a deep thinker as I am, you should play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the Year. Not really, but well worth a play. Life is short, what are you waiting for?",
            "review_score": "1"
        },
        {
            "review_text": "Next time i think of squishing a fly, i will think twice -tear-",
            "review_score": "1"
        },
        {
            "review_text": "If I'm to be honest, it was kind of unnerving, but the payoff was totally worth it. GOTY",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the experience.",
            "review_score": "1"
        },
        {
            "review_text": "For a free WTF experience play this game. (You'll only waste about 10 minutes of your life.)",
            "review_score": "1"
        },
        {
            "review_text": "Much cry such sad only light return to doge at end",
            "review_score": "1"
        },
        {
            "review_text": "beautiful representation of the human mind and soul 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I was sitting here thinking: 'Okay, so I got stuck in some spider webs, I hit a million borders and I got blown by the wind a few times...' I tried playing for about 5 more minutes until I found out that there is no objective at all... But it is still a beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "I saw people say that this game had no storyline, but there is a question I have about that statement. Is it supposed to? Is a simple fly supposed to have a story? I bet that fly you killed earlier crawling on your screen didn't have a story... This game.... it makes me think deep within myself, and it makes me truly believe, life is not fair, not in one tiny bit, the life of the fly is truly worthless, it lays eggs, and it dies, this is not a game, its an experience, one that will keep you up in the middle of the night, wondering the true works of yourself, others, and a fly, and it will stop to make you think, 'Am I any different?'.",
            "review_score": "1"
        },
        {
            "review_text": "Headphones,turn the phone off and send everyone away.Enjoy the 6 minutes!",
            "review_score": "1"
        },
        {
            "review_text": "lik if y cry evry tim ;-;",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why i played this game but I did and it was surprising how a game can put such perspective on things its reminescent of short films that are bigger than what they appear its surprisingly good",
            "review_score": "1"
        },
        {
            "review_text": "A truly immersive six minutes of gameplay. Without a word, some simple, but beautiful graphics, and a spot-on soundtrack, this game works wonders. ",
            "review_score": "1"
        },
        {
            "review_text": "Just try this game and see it for yourself. I did not see that ending coming, and boy that was one heck of an ending.  Totally worth playing for six minutes, and it's free. Just give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Brought back memories from the war of 1861. I never meant for it to end up being you Roscoe, if only I had been with you. I'm so sorry Roscoe, it was all my fault.",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is an interesting title. It took me five minutes to play through and it was a cool little message that I think was much more interesting than just writing a quote and having it shared across social media.  Spend the time to think about the message and it would be worth the choice?  Ignore it and carry on with your day and never think about this game again? Either way it's worth the play.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "its a game where you play as a fly named jones smithington as you fly the vast open world looking for your long lost wife you encounter trouble, the spider gang has shown up and they are up to no good and you must fly out of their nets, and continue your journy to find your wife samantha dingus smithington, as you fly up to find her you see a light thinking its her, you fly closer and closer you relise its a bug zapper but before you know it you get a glimps of your beloved before dieing because some how the light has a ♥♥♥♥ing gravitational pull.",
            "review_score": "1"
        },
        {
            "review_text": "Short and surprisingly beautiful, it makes you think about your or any one creatures significance in the world. I really enjoyed it!",
            "review_score": "1"
        },
        {
            "review_text": "Its a journey that i thought i had made it until the light shon down on my fluttering wings :( 5 mins is all u need why not give it a try",
            "review_score": "1"
        },
        {
            "review_text": "Very strange game but has a good sense of humour, fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Short and simple, yet so powerful. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "for me it crashed when i click return but It is a really good game 100/10",
            "review_score": "1"
        },
        {
            "review_text": "interesting game,",
            "review_score": "1"
        },
        {
            "review_text": "For the 5 minutes I played this, I enjoyed it. The Plan: Go up. It's very nice and the music is grand. It (the game) makes you think.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful experience that everyone should have. The music is top notch and the message is very thought provoking.",
            "review_score": "1"
        },
        {
            "review_text": "A short and nice visually attractive game, check it will take 5 minutes of your time.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful made game. The music is just stunning. Only takes a few minutes of your time to play this so I highly recommend playing it. The end was a really nice touch too. I only have one problem, the game crashed on me at the end but I still loved it none the less.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun and good game,How to unlock achievement?",
            "review_score": "1"
        },
        {
            "review_text": "Well, that was so ♥♥♥♥ing unexpected. i mean WTF? game of the year pl0x",
            "review_score": "1"
        },
        {
            "review_text": "its a fun little game if you want to waste 6 min.",
            "review_score": "1"
        },
        {
            "review_text": "Such a beautiful game. Game of the Year 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Life. In one game.   Sometimes, it may seem that there's nothing in your way as you ascend up in life. Other times, it may only take a single leaf to take you down. Occasionally, you might be weak enough only for a gust of wind to sweep you off your feet, but if you believe you're strong enough, you will be able to conquer that gust of wind. Spider webs, you can't get away from these. You will get stuck, you will get shocked, and you will know fear. Only in these times, though, you will know your strength.  There always comes a point in time, where there's nothing in your way. Once you reach this point, you begin to believe you have reached what you have strived for. But as you ascend up, up, into the sky that is life, you begin to realize that to everything, there is an end.  8 minutes on record. I do not regret those 8 minutes of my life spent on this game, and those minutes I spent to write this.  Life. In one game.  Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great, just great, very fun to play and a great ending",
            "review_score": "1"
        },
        {
            "review_text": "Even though it was so short; i loved the way it progressed. It is very well drawn out and worth a playthrough. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! can't say much. Download and try, you'll see meaning of life in this game",
            "review_score": "1"
        },
        {
            "review_text": "It looked good and it sounds good but something about it made me feel different like no other...",
            "review_score": "1"
        },
        {
            "review_text": "very good game and quick",
            "review_score": "1"
        },
        {
            "review_text": "CANT GET THE 1 ACHEIVEMENT CUZ IDK WHY",
            "review_score": "-1"
        },
        {
            "review_text": "Just a simple trip ascend. However at last, there's no way to avoid death... Just like how the real life goes.  After somewhat philosophical, yet FATALISTIC ending, some may feel helpless of themselves.",
            "review_score": "1"
        },
        {
            "review_text": "It doesnt last long and its freetoplay. If you are interested in what games can also be, give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Its easy, its fun its just life itself. wow.",
            "review_score": "1"
        },
        {
            "review_text": "Great music",
            "review_score": "1"
        },
        {
            "review_text": "If you play this game, you will have a deep understanding of the universe.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth the download even if there is no replay value.",
            "review_score": "1"
        },
        {
            "review_text": "I would rate this game.",
            "review_score": "1"
        },
        {
            "review_text": "As has been stated above, this isn't so much of a game as an experience, or a short film. You have very little control over the outcome of the game, down to really only where in the skies the fly flies before the ending of the game.  I highly recommend this game for anyone who has five minutes and a little bit of emotions to spare. The visuals are nice, not overwhelming, and the score accompanies the game nicely.  I actually ended up caring for the fly in the end and felt surprise and fright when it was in danger. I never actually got caught in the spider web, which i've heard happens alot. Try it. :D",
            "review_score": "1"
        },
        {
            "review_text": "just... try it! :) It'll take 5 minutes of your day, but I think it'll keep you smirking for the rest of it",
            "review_score": "1"
        },
        {
            "review_text": "If you can spare a few minutes to understand the difficulties of a fly's life, go ahead and download this game :') HAHA",
            "review_score": "1"
        },
        {
            "review_text": "A superb five minute game, with great music and a terrific ending. Too bad it's so short though.",
            "review_score": "1"
        },
        {
            "review_text": ";_; this is the one of the most brilliant and beautiful games I have ever played. Very touching. Kept me going until the end. The music was probably the part that made me cry. 10/10 would play. A++ This game is brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "Easiest achievement game ever the game is well boring cause there isnt much of a story in it u just fly around but i recommend u to try it out  GL&amp;HF",
            "review_score": "1"
        },
        {
            "review_text": "Actually...kinda...fun...in a weird sort of way.",
            "review_score": "1"
        },
        {
            "review_text": "gets to some kind of plane sound and force closes!",
            "review_score": "1"
        },
        {
            "review_text": "The game is very short, it should only take about 5 minutes too complete, but in those 5 minutes, you are involved in an very immersive experience. The game may be short, but the emotion attached is undeniable.",
            "review_score": "1"
        },
        {
            "review_text": "Saddest (in a good way) game of the year.",
            "review_score": "1"
        },
        {
            "review_text": "This is the saddest game I have ever played 1 million out of 10 is my rating   ",
            "review_score": "1"
        },
        {
            "review_text": "I hated this game. There was no crouch control... Needs to have Christian Metal... Would not mind having more wubs wubs either. I will change my opinion once these changes are made. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the very best.",
            "review_score": "1"
        },
        {
            "review_text": "This game can only be described as amazing ",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME OF THE YEAR",
            "review_score": "1"
        },
        {
            "review_text": "its simple awesome",
            "review_score": "1"
        },
        {
            "review_text": "This was awesome! was so clever how i typed.. ddddaaaa ..dumb asss . and what an unexpected cruel twist! I will make it to the moon next time!",
            "review_score": "1"
        },
        {
            "review_text": "Just play it, it takes not long to get trough! :3",
            "review_score": "1"
        },
        {
            "review_text": "looks great, sounds amazing, completely awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I Recommend this game if you want to be kept busy for 20 to 30 minutes and although the game is a bit boring the end is rather amusing",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game I've played in a long time. So emotional and story driven. Great gameplay and fantastic art. Game of the year right here.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely Recommendable !  The game is about a FLY, and you need to follow the path of the ''light'', but what is this ''light''? You're at the florest following this path, but is it a sun ? Or just an illusion ? Is it the Heaven ? Whatever it is you will discover by yourself.  You will spent your 10-15 minutes of your life, being the best FLY of the world... or not, with a awesome and shocking end... or not.  It just depend of you to see what happens with this beautiful fly &lt;3 (and understand a flies life) &lt;(*-*&lt;)",
            "review_score": "1"
        },
        {
            "review_text": "If Joseph Campbell were still alive, this heartbreaking tale would be the subject of his next book. 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "I gotta say... I was not expecting that ending :)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing.  Very good graphics for a small game.",
            "review_score": "1"
        },
        {
            "review_text": "It's Terrible, all these reviews are fake.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me wish flies lived longer. The 'big finish' made me giggle in delight.",
            "review_score": "1"
        },
        {
            "review_text": "A MUST play",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most intense game of my life. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "What a twist.",
            "review_score": "1"
        },
        {
            "review_text": "10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "What more can you ask for if you have a fly simulator? 69/1",
            "review_score": "1"
        },
        {
            "review_text": "i literally ♥♥♥♥ my pants when i saw the end ",
            "review_score": "1"
        },
        {
            "review_text": "This was simply beautiful. It really shows the deeper meaning games can carry and that they don't need to be action packed thrillers, you can make art with them too. Although, I consider this a journey more so then a game.   Yet again, it is wonderfully executed and I would hands down recommend everyone to try this game at least once.",
            "review_score": "1"
        },
        {
            "review_text": "Was actually pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "I am glad I am not a fly. This game will tell you why.",
            "review_score": "1"
        },
        {
            "review_text": "really made me smile when i finally killed this buzzing ♥♥♥♥♥♥♥. led him straight from his humble home in a peacefull forrest straight into a symphonic deathbulb in the sky. really beautiful and great art style. would play again just to see him die over and over.",
            "review_score": "1"
        },
        {
            "review_text": "A good game but i dont understand the point??",
            "review_score": "1"
        },
        {
            "review_text": "The tears....the tears are real for nothing more than a fly on a magical adventure. 10/10 A+ a navi out of ten congrats",
            "review_score": "1"
        },
        {
            "review_text": "A game that you can close your eye(s) to play!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's quite an achievement to make a 5 minute long 'game' a chore.",
            "review_score": "-1"
        },
        {
            "review_text": "4 times in a row. still doesn't make sence O.o",
            "review_score": "1"
        },
        {
            "review_text": "Great Game - an experience you shouldnt miss.",
            "review_score": "1"
        },
        {
            "review_text": " Just...what? ",
            "review_score": "1"
        },
        {
            "review_text": "While short, this is an incredible game along the lines of Dear Esther and Kentuky Route Zero. The only song in the game, Ase's Death by Edvard Grieg makes the 5 min it takes to play through worth every second.",
            "review_score": "1"
        },
        {
            "review_text": "This is actually a very compelling little experience. I hesitate to call it a 'game', as I'm not even sure there are opportunites to fail or even any choices to be made, but as an artistic expression and experience it is definitely worth a download. Give it a shot, you probably won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure what I just experienced, but it was just that. Quite the experience. =)",
            "review_score": "1"
        },
        {
            "review_text": "Best bug for your money by a large margin. Maybe the game lacks a certain depth of gameplay, maybe you're a closed-minded ♥♥♥♥. No way of knowing. All I know is this game gave me chills at the end. Also it has a great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Life is short. Enjoy it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Such Swag, very yolo, many boring, wow",
            "review_score": "1"
        },
        {
            "review_text": "Not for everyone, but looks nice and features an amazing song. Ending is sad. Not a 'game,' per se, but an interesting journey.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would fly again.",
            "review_score": "1"
        },
        {
            "review_text": "If you have a few minutes of your life to spare, try The Plan.  ...now that I think about it, it's like the movie Melancholia in a really tiny scale. :D",
            "review_score": "1"
        },
        {
            "review_text": "it is a good game",
            "review_score": "1"
        },
        {
            "review_text": "It's okay I guess. Pretty confused at it. I'd recommend it to people like my Twin sister and I thank RaedWulfGamer for his awesome review on this strange, but good game. Keep at it! :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome short game, more of a story-like life lesson but still would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Hint: This game is one big metaphor. It's an experience thing, not meant to be a fun, playable game. It's great though. Makes a good point. I took a ride on the Feelcoaster. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutly beautiful. Best $0 I have ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing, really. I can't wait for a sequel. :)",
            "review_score": "1"
        },
        {
            "review_text": "this game broke my heart in 5 minutes",
            "review_score": "1"
        },
        {
            "review_text": "great game kinda boreing on second playthough good smooth controlls for a 2d side scroller ",
            "review_score": "1"
        },
        {
            "review_text": "thought it would be better but it does make my mind go boom",
            "review_score": "1"
        },
        {
            "review_text": "eventhough this game is short it's still pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best game EU!",
            "review_score": "1"
        },
        {
            "review_text": "THIS is what a free-to-play game should be. A pointless little indie game that's just there to either have fun with or promote the developers. Not something that's entire goal is to make a profit and persuade you to spend money on micro-transactions. It's pointless, but fun and only takes a minute to download, three to complete. Everyone should give this a try.",
            "review_score": "1"
        },
        {
            "review_text": "cool music,great game",
            "review_score": "1"
        },
        {
            "review_text": "It's so pointless, yet so wonderful. The music is just perfect, so is the background view. It's strangely addicting :D.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most marvelous game I have ever played and I showed it immediatly to everyone around me. Your reaction to the ending says alot about you. I was awed by it, completely inspired and in love with the symbolism. My sister however was extremely confused and didn't get it until I explained it, but was then immediatly amazed by it.  The best personality test ever.",
            "review_score": "1"
        },
        {
            "review_text": "Kind of like playing through a 'Fantasia' segment. I avoided my thesis with this game; its a fun little time waster/relaxation tool. Although I can't unlock the achievemnt, even tho I know what to do, so that's a bit of a bummer.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game. I really had no expectations going into this game but once I had completed the game it left me feeling different than when I had started it. A fly, simple and yet complex, was a good catalys for pondering the unknown and the meaning of life. I'm not very emotional myself but I could easily see people crying at the end of this short journey. I see no reason to not experience this jewel in the ruff for the low low price of free (plus maybe 5 minutes of your life).",
            "review_score": "1"
        },
        {
            "review_text": "Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "is anyone else confused about the fact that all of a sudden you were in a house with a backround and light?????????",
            "review_score": "1"
        },
        {
            "review_text": "Fly.FLY.FLYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY",
            "review_score": "1"
        },
        {
            "review_text": "I got caught in a web and actually peed a little bit. Emotionally moving 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I guess the point of this escapes me. Nice music though.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is fun when your just bored because your just a fly going up to the sky for no reason",
            "review_score": "1"
        },
        {
            "review_text": "It's a great way to pass the time when you are bored and can't afford another game",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Be a fly &gt;Roam the world &gt;Get blown by wind &gt;Enjoy nature &gt;Get killed by humans :(  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "I wouldnt recommend this game to ANYONE. It is boring all you do is fly around as a fly you dont eat, sleep, or annoy people like flies do if I could do that in this game then I would be happy but this game sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Well. if this is about letting you know you should play this or not, then You absolutely should! although it is entirely short, but the music is beautiful and the ending is thought provoking. enjoyed it :)",
            "review_score": "1"
        },
        {
            "review_text": "Wonderfull And Pointless, A Game That Trully Represents Life.",
            "review_score": "1"
        },
        {
            "review_text": "My moment of Zen.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "There's really no point of this. You're just a fly flying through, and once you get to the top, the game wants you to type a random word or whatever.  Useless.",
            "review_score": "-1"
        },
        {
            "review_text": "An emotional game. First try completed it in 6 minutes. You just fly around as a fly in this game, being guided to the light shining in the darkness. You journey through the forest over you to head towards the light. Made me cry at the second time, mostly because I'd wonder what those flies feel like in their lives of pointlessness...",
            "review_score": "1"
        },
        {
            "review_text": "Great way to entertain yourself for a few minutes.  This an incredibly short indie game has its own atmosphere, nice looking graphics, great music, philosophical motive and unexpected ending, and don't forget about the interesting achievement.  Beautiful project, I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Would play while stoned again, wish the spider web actually had a spider I waited too long...",
            "review_score": "1"
        },
        {
            "review_text": "Really good nature and funny because the sun is a light.",
            "review_score": "1"
        },
        {
            "review_text": "This game shows that simplicity is beatiful. It has a greater meaning than just a fly flying up. One of the best games ive played that are free. thanks for the experience krillbite!",
            "review_score": "1"
        },
        {
            "review_text": "'The best free game between me and my friends'  -HeroSkullRoo ",
            "review_score": "1"
        },
        {
            "review_text": "What got it's head stuck in a lightbulb in the end.",
            "review_score": "-1"
        },
        {
            "review_text": "Play this for the realization of the fact that a fly can live the same life as you and me. Beautiful short game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome...Seriously.(no sacrasm)",
            "review_score": "1"
        },
        {
            "review_text": "still didnt get any joke inside of this..",
            "review_score": "1"
        },
        {
            "review_text": "This game stole my heart",
            "review_score": "1"
        },
        {
            "review_text": "Had not spent proper 5 minutes on gaming till I played The Plan!",
            "review_score": "1"
        },
        {
            "review_text": "I like the graphic of the game , control very simple , easy and short game .  The End",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually an emotional experience. Usually people hate flies, but you can totally see in this insect's own pair of eyes and the fear and wanting to find a place to stay. The game is short, but in turn it's such a awesome game. I totally give this game a 'Thumbs Up'. Such a beautiful game...",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is a short game but entertaining for what it is. The music is killer, probably the best part of the game. I liked it well enough - the plot twist ending is pretty amusing. Overall it's definitely not the worst game I've ever played. Give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "The ending is unexpected!..that's all i have to say..and please, play it!",
            "review_score": "1"
        },
        {
            "review_text": "Noooooooooooooo, I nearly cried when I got to the end... Poor fly, he had so much he could have done in his life. I can now definitaly say that I will try to never kill/hurt a fly ever again in my life! R.I.P fly, R.I.P...",
            "review_score": "1"
        },
        {
            "review_text": "Most guys wish to kill flies while, you could just show them the way out....beautiful loved playing this with my friends watching, loved their interpretations of this work of art ,i got its a metaphor for life to a scary monsters gonna pop out some one even got scared he thought the bird chirping was gonna pop out and scare him highly recommended 6 mins of my life i gladly give up.",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty dope",
            "review_score": "1"
        },
        {
            "review_text": "Honestly probably one of the most boring games I've ever played. Yes it is free therefore is worth it if your so bored you want to waste 5 minutes of your life, if not don't bother. You're basically a fly whos only objective is to find the lightbulb to commit suicide? The only challenges you have is a few gusts of wind, Some falling leaves and a spider web. Literally can be completed within 5 minutes. The best part of the game was the menu screen where I could quit the game. :-)",
            "review_score": "-1"
        },
        {
            "review_text": "If I could summarize this game into words, it would be a dramatic black comedy. You control a fly and your only option is to go up. I won't reveal anything but within the four to five minutes, I had a mixture of emotions. The one that came out the most, though, was joy; Joy that I spent a couple of minutes playing this very incredible peice of artwork. It's message is somewhat clear, not very subliminal. The score fits around perfectly as you simply control this fly. Hands down one of the most beautiful art games I have ever played. All it took was those five minutes. You should use five minutes also. Trust me, it's worth the experience.",
            "review_score": "1"
        },
        {
            "review_text": "Very cheesy, at least they kept it short. The 'game' is well made in the single stage it has but check for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Free, short game with a small download. Be sure to click the credits after you beat it once.",
            "review_score": "1"
        },
        {
            "review_text": "I love it. Its simple but still on my top 10 favourite games.... HOW COULD THIS BE? Whatever. I was surprised when i started playing it. :D Everybody reading this: its free and its amazing. if you dont have it get it.",
            "review_score": "1"
        },
        {
            "review_text": "Prepare to Cry.",
            "review_score": "1"
        },
        {
            "review_text": "Not truly a game I think, but it was a unique expeariance. Wish I could say it better but the top commenters really nailed it!",
            "review_score": "1"
        },
        {
            "review_text": "Loved it, got completely lost in it the first time... There's something very 'human' about it.",
            "review_score": "1"
        },
        {
            "review_text": "The best 60 minutes of my life were spent playing this game. It's an absolute masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "He just wants a home",
            "review_score": "1"
        },
        {
            "review_text": "It made me challenge my perception of life around me, and made me question why we do things and what I should believe in, it also made me ponder religion, science and matter as we know it.",
            "review_score": "1"
        },
        {
            "review_text": "Definately be paying for their main project, that was 10 minutes well speant",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of the strangest games i have ever played. All you really do is fly (LOL) upwards whilst listing to some realxing music,",
            "review_score": "1"
        },
        {
            "review_text": "Just trying and see :)",
            "review_score": "1"
        },
        {
            "review_text": "the ending made me cry",
            "review_score": "1"
        },
        {
            "review_text": "A fly, thats what you are. A simple, pointless existence...oh wait, you are trying to fly upward while avoiding being crushed by leaves, fighting powerful wind currents, and worst of all, every flys worst nightmare come to reality...spiderwebs. An amazing game with amazing artwork and detail, the plan is exactly that, a plan to get to the very top, no matter what could possibly stand in your way, you must go where no fly ever dared to go before. This game is truly amazing, and i personally do not care what all the haters say, this game is short, yes, but truly amazing in it's own right. A truly awe-inspiring experience.",
            "review_score": "1"
        },
        {
            "review_text": "What to say about the plan...hmmmmm. It was truly a masterpiece in the videogame world. If you are going to play any fly simulator this year, make it the plan. The background music and the scenery adds to the intensity of the game, no the experience of a lifetime. Plus, an end that will leave you in shivers. I really connected with the main character, I felt like I was actually the fly, trying to figure out my meaning in life. I highly recommend this perfectly crafted game. You will not be disappointed. The plan will always hold a place in my heart in the video game world.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth the time spent! It was an experience, to say the least.",
            "review_score": "1"
        },
        {
            "review_text": "A plot that will leave you in tears, hauntingly beautiful music and a great concept. It's a must download for any true gamer  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A truly innovative way of telling a story and making the player shift focus from everyday struggles. The narrative is not achieved through walls of text or hours of dialogue but with something as simple as a change of perspective. The game lasts for a deceptive five minutes, but provides food for thought on a level unbound by something trivial as time. This is not really a game, but an experience, something to broaden the scope in which we observe life itself. Marvelous, truly marvelous.",
            "review_score": "1"
        },
        {
            "review_text": "What is the point of the game i guess just a waste of time ",
            "review_score": "1"
        },
        {
            "review_text": "better have a dam good gpu because this game is a pc killer im talking 5 fps on titans but worth it because huge plot twist that will blow your mind",
            "review_score": "1"
        },
        {
            "review_text": "A great game with a sad ending. Good if you have a spare five minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting ........ that poor fly trulely tragic at the end lol",
            "review_score": "1"
        },
        {
            "review_text": "totally epic",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Compelling story, it is full of drama and suspense. The graphics are top notch for its time. I would recommend this game to anyone up for an amazingly beautiful story and who loves great scenery!",
            "review_score": "1"
        },
        {
            "review_text": "You're a fly",
            "review_score": "1"
        },
        {
            "review_text": "Yes, although short it opens your mind to how big the world is and how insignificant you are!",
            "review_score": "1"
        },
        {
            "review_text": "Pointless. Just press up and left twice. Recommended for the only reason to get the game: the incredibly easy achievement.",
            "review_score": "1"
        },
        {
            "review_text": "Oh this game downloads in like 5-3 seconds, and took me a little while to beat it and i felt, Sadness, Regret and alot of other emotions for this little fly, for free, I call this a deal",
            "review_score": "1"
        },
        {
            "review_text": "It's a beautiful, compelling game that can be played entirely through in about 5 minutes",
            "review_score": "1"
        },
        {
            "review_text": "free achivement XD",
            "review_score": "1"
        },
        {
            "review_text": "I cannot believe that I got so emotionally attached to this innanimate object of a game. Without giving you a goal, it immerses you in to the world of a fly. The last time I was so entranced in a game, I was playing Minecraft, 12 hours straight - and we found the Cat song record. Bliss.  Honestly, truly and sincerely recommend this game - play until the end, you will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "I never understood flies, but now I think I get it. They're tiny and vulnerable. Not to mention the most disgusting insect (EVER) wraps them up and tries to eat them! But, this game makes you realize that flies are just like everything else in this world, and they just want a home like everybody else. As I was controlling the fly it never occurred to me that he was looking for a home. When I got to the end, I hadn't realized what had just happened and I froze in my seat. It was a sad ending that I did not expect...",
            "review_score": "1"
        },
        {
            "review_text": "took 2mins to load and i had nothing better to do... that was worth my time=)",
            "review_score": "1"
        },
        {
            "review_text": "Like the ending xD",
            "review_score": "1"
        },
        {
            "review_text": "Honestly i like the game haha theres not much to it but it has me stuck trying to earn that one achievment xD",
            "review_score": "1"
        },
        {
            "review_text": "The fly sim of flight sims.",
            "review_score": "1"
        },
        {
            "review_text": "One of the Best storys in a game ever! You are a fly, no not a normal one, your not some boring House Fly, YOUR A OUTSIDE FLY, He flys to his goal slowly! This game is longer than any other game! this very game is 6 mins long! Most are 4 hours+ but this is 6 mins long! This game should be Game of The Year 2014 and on!",
            "review_score": "1"
        },
        {
            "review_text": "Up up and away",
            "review_score": "1"
        },
        {
            "review_text": "My life had no meaning until I experienced life as a fly.  Everything has been put into perspective..",
            "review_score": "1"
        },
        {
            "review_text": "Easy Achievement, ~5 minutes",
            "review_score": "1"
        },
        {
            "review_text": "what the ♥♥♥♥ xD? ",
            "review_score": "1"
        },
        {
            "review_text": "This is the ONLY fly simulator that you should ever play...probably the only one out there too... Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "minute 1 : what I am doing with my life? minute 2 : okey.... minute 3 : the music is... touching me minute 4 : this is beautiful minute 5 : where are you going little fly? minute 6 : really, what I am doing with my life?! Buuuaaaaaaa",
            "review_score": "1"
        },
        {
            "review_text": "This game was short but sweet. At first you have no idea what to do, as you go on you wonder what to do and where to go. And then it ends and your left thinking about every single fly youve ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "It's a thing. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You play the game by hitting UP arrow, all other controls are a lie, even the right and left controls are kinda pointless because you bump into invisible walls that kinda break emersion. It is visually stimulating though and cool and worth the 1 minute it takes to beat the game; well, it's not actually a game it's like an animated short.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to get all achievements, just one, so your completion rate is higher.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "'Hey, listen!' get the game.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my, this is so amazing, and very short. It's free, so why don't you download it already? You can't be upset by this game, absolutely wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "What an odd thing it is to be a fly. What is the point of the life of a fly? it's its own point. Don't use condoms.",
            "review_score": "1"
        },
        {
            "review_text": "Wow... The ending is very deep. A game about a fly flying. Really good. But a little short. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing, beautiful art, good for those days when you just don't really wanna do anything, or clear your head for a little while.",
            "review_score": "1"
        },
        {
            "review_text": "BORING. no interactions with anything, you pretty well just fly straight up. thats it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very interesting, short artistic game, if you are into surreal, artsy stuff this will definitely provoke a lot of thoughts and emotions.",
            "review_score": "1"
        },
        {
            "review_text": "When I reached the final part,I thought I was in Heaven....10/10 music",
            "review_score": "1"
        },
        {
            "review_text": "The Journey to the Heavens waiting to be seen by a fly.   All the Gorgeous scenery.  All the Struggle to get through the obstacles that awaits us.  All built up to encounter 1 faithful End.  This is The Fly of Life...",
            "review_score": "1"
        },
        {
            "review_text": "What a lovely idea, really makes you think about the life of this poor creature.",
            "review_score": "1"
        },
        {
            "review_text": "W-Holding Simulator 2014.  On a more serious note, it is a beautiful little game/art project. It is extremely short and contains a thought-provoking message.",
            "review_score": "1"
        },
        {
            "review_text": "this game has no point you just fly up and nothing happens",
            "review_score": "-1"
        },
        {
            "review_text": "It's free. It's six minutes. It's worth every cent and every second.",
            "review_score": "1"
        },
        {
            "review_text": "Short and Free. Totally worth your time and money. 9.9/10  PD. Game crashes when trying to get the achievement.",
            "review_score": "1"
        },
        {
            "review_text": "An impressive gaming experience with a moving plot.  Truly something to be desired.  Every gamer should own a copy of The Plan.",
            "review_score": "1"
        },
        {
            "review_text": "This game is touching in many ways, and it makes you think about what you have just done to a poor, innocent, harmless little fly.",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' is a free, pretty experience. It has BEAUTIFUL graphics and sound, lasts a mere few minutes, and is definitely worth the time.   Play value= 40/100 REplay value= 79/100 Graphics= 90/100 Music= 90/100 Price=100/100 Additional Points= Heartwarming/ Crying value +2 Being the best Fly Simulation= +2   Final Verdict= 84/100 points",
            "review_score": "1"
        },
        {
            "review_text": "Such a Beautiful Game such detail put into it i would like to see a Catipillar one or even a Dragon Fly :D Imagine",
            "review_score": "1"
        },
        {
            "review_text": "This was perhaps the best game I've ever played. Should totally play this while high. It's better than skyrim!",
            "review_score": "1"
        },
        {
            "review_text": "A truly amazing experience. Amazingly atmospheric. Games that are like this are amazing. In The Plan you play a fly in the midst of an existential crisis. Truly a masterpiece. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Wow wth im so mind blown",
            "review_score": "1"
        },
        {
            "review_text": "I dont know what to say after playing the game , it left me speachless at the end.",
            "review_score": "1"
        },
        {
            "review_text": "This game symbolizes life, especially for younger people. We come into and through the years of school and college and we think we are going to go so far in life and we are rising up the ladder and then it happens.... life happens. The bug zapper happens.",
            "review_score": "1"
        },
        {
            "review_text": "Nice short indie game where you put yourself in the shoes of a fly exploring a wooded area which has its dangerous threats to the fly. The end of the game is kinda unexpected. Thumbs up to the soundtrack too. Go ahead and try it out, it's just 10 minutes of your life worth spending!",
            "review_score": "1"
        },
        {
            "review_text": "This fly simulator has to be in my top 3",
            "review_score": "1"
        },
        {
            "review_text": "I have mixed feelings about this one... I had absolutely no idea what to expect going in. I don't see it as a game so much as it is a work of art. And it's a free work of art. I can honestly say this is the worst game I've ever loved, and I mean that in a good way... You have to play to understand. Or maybe you won't understand. I'm rambling... Just download it.",
            "review_score": "1"
        },
        {
            "review_text": "Great really short minute game, well put together and the music is perefct, if yoU have 5 minutes to spare I highly recommend playing it",
            "review_score": "1"
        },
        {
            "review_text": "Was really short, but really beautiful. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "short but cool :)",
            "review_score": "1"
        },
        {
            "review_text": "Trully a masterpiece, no other video game even come close to this one. Breath taking sceneries, tear jerking soundtracks, extremely deep content, all the elements were there to make me cry.  10 out of ♥♥♥♥ing 10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. Wow. That was such a surreal experience. Well worth the time and effort. I've never felt so in touch with life as a whole. I feel ethereal.",
            "review_score": "1"
        },
        {
            "review_text": "Wondering what's your purpose in life? Play this and you will be enlightened. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful Music Life Pondering More Tears Hightly Reccomend 10/10 Worth $10",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing.",
            "review_score": "1"
        },
        {
            "review_text": ":( So freekin sad those lights should be illegal, what did flies ever do to us? :**c",
            "review_score": "1"
        },
        {
            "review_text": "An inspiring game about life, death, and the obstacles of the universe.       You also play as a fly",
            "review_score": "1"
        },
        {
            "review_text": "This shiz is deep man.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the greatest game I've played all year",
            "review_score": "1"
        },
        {
            "review_text": "well this game was odd, it was over really quickly but i almost have a hint of of sorry for any fly in the world as they have a very short life span. took me 6 minutes to complete and would reccomend it",
            "review_score": "1"
        },
        {
            "review_text": "A sad little story about a sad little fly. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Even though playing as the Fly was incredible, I wish that they'll release the Falling Leaves as a DLC character. I've always wanted to see the Leaf's point of view. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "A beautifully crafted game that truly is unique. Well worth the free download and proof that you don't need a huge budget to create a stunning looking end product. If you haven't downloaded it yet, I have to ask you why not?",
            "review_score": "1"
        },
        {
            "review_text": "Best Game 2014!, sad ending though :'(",
            "review_score": "1"
        },
        {
            "review_text": "You fly around and towards a light. The background and the music are well worth the 5-10mins it take to fly.",
            "review_score": "1"
        },
        {
            "review_text": "The most beautiful and inspirering game of our time",
            "review_score": "1"
        },
        {
            "review_text": "very simple and humbling, free game. very recommended",
            "review_score": "1"
        },
        {
            "review_text": "A simple gamee that doesn't take much of one's time. Beautiful graphics and simulation. Great story and music in the background. Totally worth the time spent playing.",
            "review_score": "1"
        },
        {
            "review_text": "with good graphics into the beautiful game ....",
            "review_score": "1"
        },
        {
            "review_text": "Best game I have ever played! Seriosly download it!",
            "review_score": "1"
        },
        {
            "review_text": "Tis more than a game about the common life of a mere fly...Tis about the contemplation of life..the yearning of knowing it's meaning...The curiosity grows as life progresses..festering like disease! Then you find thou-self caught in a web of confusion..struggling to get out! As you escape the leaves of disaster tumble down on thine weak defenceless soul...covering the answers that lie above you..and the wind of procrasination pushing you further from your goal! And as you get closer and closer you become weaker and weaker! Exaughsted...and by the time the answer lies in front of you...the lights of knowlege burn out..and you shrivel along with it...let this be a lesson my friends! Life's meaning is not merely somthing you look for and find...but the experience that leads to the end...OH and the combat system in this game is FANTASTIC! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is a simple game all around: simply moving music, simply astonishing graphics, and a simply impactful message. The game is an interesting way to spend about 4 minutes, and you may even step away from it with a new view on things.  Apart from that, it took less time to play than it did to watch the teaser and download. It will be hailed by art critics as a stark post-modern view on the meaning (and lack thereof) of life, and may trigger those who identify as a fly or other airborne insect.",
            "review_score": "1"
        },
        {
            "review_text": "Even though being short I couldn`t keep but love the design of the game. The soundtrack is amazing. The game is very well made. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's OK...... for a free game",
            "review_score": "-1"
        },
        {
            "review_text": "In my opininion, this game is more than simply flying around with a little insect. It is hard to admit, but in the end you will become the fly, the ending is frustrating. A game that prooves that art is still exising and taking new forms.",
            "review_score": "1"
        },
        {
            "review_text": "As weird and as it is, and as boring as it should be, i really enjoyed it...",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game, when I thought it was going to the sun, then I stopped and thought it could be a light/lamp. I really didn't expect that. Simple. Easy. Good.",
            "review_score": "1"
        },
        {
            "review_text": "The music isn't bad, but the game is boring.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a special way to get to know yourself. Try it!",
            "review_score": "1"
        },
        {
            "review_text": "You really get to realize what it is to be a fly.. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever if you are bored and waiting five minutes play this game. Some people think the game goes past the bulb it dosen't thats the end. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, only takes 5 minutes of your time and you can uninstall it if you hate it. But honestly, try it. It is one the best atmospheric game I've ever tried. 10/10 (The ending kinda has a sense of humor and truth or something, I can't really explain it. Try for yourself!)",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game, full of suspense and drama. With a cruel end that is oddly satisfying. 9/5",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing life story but that ending though..",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - would fly again",
            "review_score": "1"
        },
        {
            "review_text": "Short. Free. Highly recommended. Anything else would be a spoiler.",
            "review_score": "1"
        },
        {
            "review_text": "very unique and strange environment, but touching too :}",
            "review_score": "1"
        },
        {
            "review_text": "Very short (around 5 minutes) experience, which I enjoyed twice. The game is beautiful, and the music and sounds matched perfectly with the mood, which I really enjoyed. The end was neat, and worth the wait.    After it finished, it comes up with a text entry prompt. What you type will become a star in the next menu screen - hover over the stars to see what other people have written.     When you return to the main menu, click on the music titles at the bottom to unlock the only achievement, and play as Navi from Legend of Zelda.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is not for everyone. This is for people who understand.   A brilliant piece of art that leaves you speechless. Short, but a 'must play'!",
            "review_score": "1"
        },
        {
            "review_text": "It's worth 5 minutes and free, so sure, why not... but otherwise, meh",
            "review_score": "1"
        },
        {
            "review_text": "An interesting experience.",
            "review_score": "1"
        },
        {
            "review_text": "9/11 need more light",
            "review_score": "1"
        },
        {
            "review_text": "15 minutes of my life spent as a fly that I will never regret, simply stunning and beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game! simple fun fast and down right awsom",
            "review_score": "1"
        },
        {
            "review_text": "The Plan seems more art than game and its premise is very simple. You are a fly whos only goal is to reach the great bright light in the sky. Keep flying past falling leaves, wind gusts, and spider webs as you elegantly weave through the tree canopy. If you want to get deep you can find meaning in the game hinting towards the futility of life and the dissatisfaction with reaching to attain lofty goals, or you can just appreciate that this free game has a single achievement that you can complete in about 5 minutes.  I do recommend using some sort of surround sound headphones as the soundtrack and effects are great.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful.  I think that trying to explain what it's about can do it diservice. It can impact you on a deeper level that words can encapsulate, and trying to put that experience into words can make it less than it is.  Even though it only lasted 10 minutes, it was a powerful experience that has stayed with me. It has been a lens that has in some way helped me to appreciate life.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a profy in games reviewing, but this game is beautiful, short, free, but beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "+Good graphic +Nice BGM +Easy Control +Shortgame +1  Hold up till u burn yourself",
            "review_score": "1"
        },
        {
            "review_text": "I was skeptical about this game, but... well, it's free, what could I loose? So, I jumped right in this experience. And I was glad I did it. It takes you 5-10 min to finish it, but I can assure you it's a very significant experience you'll remember for a long time. Atmospheric, great sound track, awesome visuals. Recommended if you can spare 5-10 min and if you're willing a relaxing game.",
            "review_score": "1"
        },
        {
            "review_text": "'The Plan' is an art house installation on your PC.  It is a textured work that needs to be experienced and interpreted by the viewer rather than explained by a third party.  What I will say though is that what you get out of this may be nothing other than boredom. You may, if a little more atuned, feel an appreciation of the exquisite graphics and soaring, perfectly suited sounds. However, you may, if you are in the right frame of mind experience something much more.   It's all down to you.  Life is just a cosmic joke afterall.... but it's up to you to write the punchline.",
            "review_score": "1"
        },
        {
            "review_text": "Short fun, very atmospheric. Wonderful payoff at the end. Worth the five minutes to play.",
            "review_score": "1"
        },
        {
            "review_text": "All these really deep reviews and I cried from stubbing my toe getting up to stretch. 10/ What the F##K is going on",
            "review_score": "1"
        },
        {
            "review_text": "The plan is comparable to a poem - it is a very short game that will only take you about 5 minutes to complete. Nonetheless, it is highly centered on ambience the the small journey you are about to make. The life of a fly is short, so the game reflects that.  You can either assign greate artistic value to the game, or you can deem it a total bore with no play-value. However, not all games need to be a 150+ hour treck to be valueable. Therefore, give it a try if you seek a short, but insightful 'gaming' experience.",
            "review_score": "1"
        },
        {
            "review_text": "I beat it twice to make sure the emotions were real.   What an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Little Fly Thy summer's play, My thoughtless hand Has brush'd away.  Am not I A fly like thee? Or art not thou A man like me?  For I dance And drink &amp; sing; Till some blind hand Shall brush my wing.  If thought is life And strength &amp; breath; And the want Of thought is death;  Then am I A happy fly, If I live, Or if I die.  -William Blake",
            "review_score": "1"
        },
        {
            "review_text": "My entire life I was led to believe that I was special. My teachers, my aunties and uncles, my friends, and my parents. My Mum especially. I live my life believing that one day I will make a name for myself, get the fame and fortune.  But this game made me realize that I am a fly. Nothing but a fly...",
            "review_score": "1"
        },
        {
            "review_text": "I can't tell if I'm missing something...  All I did was fly against a gust of wind a few times, try my best to unstick myself from a spider's web. Then there was a grand finale, which I'll keep quiet about, because I did get a little chuckle out of it.  Anyway, you're a fly. A housefly. You buzz around, stay out of the trees and shadows (and aforementioned spider's webs). Just survive, ascend as quickly as you can. Stay alive.  It had a very Limbo feel to it (which was cool). I'll play it again to make sure I'm not missing a huge chunk of the game, because, admittedly, I was unimpressed with the gameplay. But it was cool to play at least once.",
            "review_score": "1"
        },
        {
            "review_text": "its the same music as in'war thunder'..relaxing till the fly seen the light,,good little 5 minuter",
            "review_score": "1"
        },
        {
            "review_text": "This game is 10/10 no doubt about it who ever doesnt have this game need to get it NOW!!! IT IS THE MOST LIFE CHANGING GAME EVER! ",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and… surprising.",
            "review_score": "1"
        },
        {
            "review_text": "Things To Say About The Game  The Spider Web Scared The Crap Out Of Me And I Was Thinking Was The Fly Going To Die?! 10/10  When I Saw White Light I Thought The Fly Was Going To Heaven  Did Anyone Else Get To 'space'  They Should Add Other Flies To The Game Because This One Seems Lonely  Did The Fly Die!? Welp, I Guess The Light Is The Way To Go  Fly Little Fly  Shame On You If You Dislike This Expierience Its Not Suppost To Be A Game Its Relaxing (except spider webs)  Fly Simulator 2013",
            "review_score": "1"
        },
        {
            "review_text": "did not see that coming great little game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you can spare 7 minutes of your time to this game, 3 things might happen : 1- you might find it boring , a waste of time . 2- You'll love it (like me). 3-You won't get it . It is up to you to play and try to figure out what the game is trying to tell you , if and when you do , you'll see what a beautiful message it delivers. Althought I can't recommend it to anyone and everyone , I can say that for me this game was one of those pleasant surprises you get now and then.",
            "review_score": "1"
        },
        {
            "review_text": "Is more a movie than a game. Worth playing it. Awesome soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "brillianty sad game. 5 minuites long to play. 1 week spent thinking about it",
            "review_score": "1"
        },
        {
            "review_text": "this game is small but beutiful game,its just a amazing game,id recimend this game if your angry or something",
            "review_score": "1"
        },
        {
            "review_text": "amazingly awesome game sure it might be boring at first but its really really awesome",
            "review_score": "1"
        },
        {
            "review_text": "That was slightly crushing.",
            "review_score": "1"
        },
        {
            "review_text": "I almost cried because of a 6 minute game.",
            "review_score": "1"
        },
        {
            "review_text": "I..... I..... I like.........this........game.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me laugh.",
            "review_score": "1"
        },
        {
            "review_text": "I... I... I can't explain how I feel...",
            "review_score": "1"
        },
        {
            "review_text": "well, too much data for such a short game, but I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most Kafkian experience of the last five year of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "THAT SPIDER WEB SCARED THE HECK OUT OF ME!  10/10 anyways, ear-wise and gameplay-wise The music was great!",
            "review_score": "1"
        },
        {
            "review_text": "At first glance, this game appears to be a fly simulator, or something. But, as I played this game, I noticed things about it that make it generate profound thought.  As you progress as the fly, the camera zooms farther out, making you less significant on the screen. This is symbolic of how insignificant we become when we see how much of the world operates without care of our existance. As we see more of the world, it becomes easier to realize how insignificant each one of us truly is. As we realize our own insignificance, we draw nearer to the light of truth (embodied within the game as the light bulb), and eventually, we reach it.  Okay, maybe I'm off in left field somewhere, but that's what I took away from the game.",
            "review_score": "1"
        },
        {
            "review_text": "Short and delicious.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome possum, with a lovely ending.",
            "review_score": "1"
        },
        {
            "review_text": "Life simulator. You start, you fly, you die, the end... Just like in real life.",
            "review_score": "1"
        },
        {
            "review_text": ";_; (It's interesting. Play it.)",
            "review_score": "1"
        },
        {
            "review_text": "Hm... The Plan... I don't know how to put it into a category of negative or positive response. I found it less of a game, more of a timekiller, which I suppose is good to have with nothing else to play. The graphics are nice, and I do like the gameplay, flying upwards and upwards as a fly. I got this game after watching an episode of a show about killing flies, so I'm like, 'Hey, I want to play a fly simulator,' so I found this game and got it. All I can think of to say... Is quite a nice timekiller. I suppose this game deserves a positive review... So there. ?/10 -PotatoCat",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. That fly needs to take a God damned bow",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game, it really got the feels I teared up a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Dozens of games stand out as pure examples of art meets video games. Video games -are- art, in fact. But none have ever stood out quite like this one.  The meaning of life itself summed up in less than five minutes and presented as a mind-blowing experience I urge each and every single one of you to spare the few minutes for.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this, hope there's gonna be more brief games like this. The graphics look lovely and I'm all about short indie games ❤︎ The graphics sort of remind me of Limbo Try it out if you haven't, it's free",
            "review_score": "1"
        },
        {
            "review_text": "I think",
            "review_score": "1"
        },
        {
            "review_text": "Chill game pretty cool",
            "review_score": "1"
        },
        {
            "review_text": "10/10. This game is an iconic emblem for the next generation of all video games. Watching a fly go up..and up..and up. This game takes the physics and engineering of animal games to a whole new millineum. Some of the thing you can expect is: awesome scenery. Leaves. and much, much more. This is a must get for anyone who wants to sit for 5 minutes watching the most revolutionary game ever created take its toll on your heart.",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, the art is impressive and all, but as an experience this was a waste of 10 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "How to play The Plan:  Step 1: Press the Up arrow key Step 2: Go to space  10/10 best flight simulator on Steam",
            "review_score": "1"
        },
        {
            "review_text": "Thank you, I realy Love this Little game. it´s soooo impressiv and.. it shows you the life. the whole Life of Everybody. Thank you, Have a Nice da :)",
            "review_score": "1"
        },
        {
            "review_text": "This is amazing it really is it pulls you in you just cant quit once you start. I suggest everyone play it through once if they can do this as a side project I would love to see a main project.",
            "review_score": "1"
        },
        {
            "review_text": "A very...Interesting game.I thought i was going to the sun only to realise ... I wont spoil it.I wont spoil it ",
            "review_score": "1"
        },
        {
            "review_text": "Laughing out loud.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a metaphores of life, you'll get it if you finished it for like 10 times",
            "review_score": "1"
        },
        {
            "review_text": "So nice, can be converted into some messages and may not. Enjoyable time.",
            "review_score": "1"
        },
        {
            "review_text": "This was by far the funniest thing ever. now know what the life of a bug is like xD",
            "review_score": "1"
        },
        {
            "review_text": "I played this game after I stumbled upon deathy cancer, And I immediately needed medical and mental help. I was told by my doctor that this game would help me as soon as I played it. And did it help me? yes.",
            "review_score": "1"
        },
        {
            "review_text": "Finished the game and I only cried for about twenty minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Wounderfull!  Life  Death  Time  OMG!  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. There are no other words to truely describe it.  The simple design, the music and the though provoking message that this game inspires is one that will stay with anyone who plays it.",
            "review_score": "1"
        },
        {
            "review_text": "i lost myself a minute after completing this game, many things fill my head; past memories, futures worries, then I realize that many people try their best to live good, but few of them try their best to die good, for death is our last goal of life.  play this game and find out yourself. Not all people understand the game, but i hope u will understand yourself more then before.   worth to play. 10/10.   ost: Aase's death-Edvard Grieg",
            "review_score": "1"
        },
        {
            "review_text": "Fly can stop a falling leaf mid air and move it around. Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "The only fly I liked, then it died, 5 minute game, free to play, I would recomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game i have ever played in my entire life. Not only did i witness the brutal murder of a house fly, i also realized the meaning of life... you may think you're soaring high when in reality you're about to hit a lightbuln... right?",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic very short thing!",
            "review_score": "1"
        },
        {
            "review_text": "This game has little to no content, it is basically just a demo of the awesome art work/play style the game dev can do. I look forward to seeing more games from this dev in the future.",
            "review_score": "1"
        },
        {
            "review_text": "PLEASE PLAY THIS IT'S FREE AND HILARIOUS I AM CRYING LAUGHING YOU JUST HAVE TO KEEP FLYING AND THEN YOU'LL SEE THE JOKE.",
            "review_score": "1"
        },
        {
            "review_text": "Video games are art, just like how my anal-region isn't for sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's a beautiful game with a great music.",
            "review_score": "1"
        },
        {
            "review_text": "This is such a good game, although you aren't doing much for some reason it is still such a good game.",
            "review_score": "1"
        },
        {
            "review_text": "a short &amp; sweet existential journey with ridic athmospheric sound track throughout.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have ever played!   10/10 would be a fly again.",
            "review_score": "1"
        },
        {
            "review_text": "the most detailed and epic game i have played......................i cant stop thinking about it.............such a life changing gameplay..............my perspective on life has changed forever",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice way to spend 5 minutes, don't expect much from it but it has some nice music. Gameplay is very dull though.",
            "review_score": "1"
        },
        {
            "review_text": "interesting, calming, and deep",
            "review_score": "1"
        },
        {
            "review_text": "Excelent Game. Excelent music, excelent lighting, awesome in every aspect, and an unspected ending this fly not deserved. Enjoy, and you can play it again and again, enjoying this piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beutiful. Its one of the best free games on the marked. This is truly worth playing. The 'story' is amazingly emotional, the picture is beutiful, music is fantastic. This is no game, this, this is ART!  ",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful piece of art and a meaningful experience.  I will never, ever kill a fly again...",
            "review_score": "1"
        },
        {
            "review_text": "Not quite what I expected. I'm a wee bit depressed now. Good game. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A life of an insect.",
            "review_score": "1"
        },
        {
            "review_text": "WTF WAS THAT?",
            "review_score": "1"
        },
        {
            "review_text": "Boooooooooooooooooring but easy achivement (100%)",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes I wonder: why are we here? What is it all for? What is the meaning of this neverending cycle of insanity called life? And then I found The Plan. It made me into a different man. A happier man, a better man. Now, I can gaze into the abyss and spit in its eye. Take that, abyss. You're not the boss of me. I played The Plan. I am alive.",
            "review_score": "1"
        },
        {
            "review_text": "What an end :-D",
            "review_score": "1"
        },
        {
            "review_text": "Plzzz Never Hurt a Fly :-(",
            "review_score": "1"
        },
        {
            "review_text": "Slightly boring but the ending is epic and worth the minutes it takes to reach.",
            "review_score": "1"
        },
        {
            "review_text": "Even though this game is not challenging in the slightest, it has an awesome soundtrack. After reading the reviews, I wanted to play it for the story and not just for a quick achievement. I made the right decision, and i'd suggest other people to do the same.",
            "review_score": "1"
        },
        {
            "review_text": "great game. very short, and no gameplay, but beautiful, soothing, and with great music. i kinda expected that ending, but halfway through, i thought they weren't gonna go through with it - oh well. recommended if you have 5-10 calm minutes, especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "its a calming and relaxing game )",
            "review_score": "1"
        },
        {
            "review_text": "Very well done, beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "breathtaking environment 10/10 and you play as a Fly how awesome is that!",
            "review_score": "1"
        },
        {
            "review_text": "  It has good music? that is really all I can say because I have no idea what I just played. Keep going up...and that's it. Honestly I'm more than a little confused about what just happened...If I missed some deep meaning in this, let me know. Rating up because for what it is, it is fairly decent...I just really don't know what it is to be honest....",
            "review_score": "1"
        },
        {
            "review_text": "  Simplisity is beautiful.  This game is art.   I'm going to go contemplate life &amp; death. Goodbye.  ",
            "review_score": "1"
        },
        {
            "review_text": "Basically a press up simulator. Very short and entertaining for a single play through that only takes ~5 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Free, relaxing, pretty... Liking it depends on the mood...",
            "review_score": "1"
        },
        {
            "review_text": "This was the absolute most fun game I have played to date on Steam. I'm so glad that I downloaded it. The surprise ending is especially exhilirating. The game does not take long to complete, but the short time that you are playing is like a brief glimpse of heaven. 10/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "WTF is that ending XD",
            "review_score": "1"
        },
        {
            "review_text": "Good game! It's kind of weird and artsy, but I reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Short, but sweet. The Plan is a beautiful, atmospheric game with a very mysterious ending. Its also only like 7 minutes long. Definetly worth the 0$ you you pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a beautiful soundtrack and realm makes you think. It also has one of the best Easter egg / achievement I've seen so far.",
            "review_score": "1"
        },
        {
            "review_text": "I do like it but............. whats that thingamagigger at the end and why does it kill meh?",
            "review_score": "1"
        },
        {
            "review_text": "The Plan is short. But it's not any longer than it needs to be. Its a quick, atmospheric, and contemplative game. Visually, it looks pretty good, and the one piece of music included is excellent.  Give it a try!   Letting you fly Navi into a bug zapper - 10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "lol the ending is funny",
            "review_score": "1"
        },
        {
            "review_text": "Even though this game is short its well worth your time. Just play the game.",
            "review_score": "1"
        },
        {
            "review_text": "relaxing music,ending touched my feelings..",
            "review_score": "1"
        },
        {
            "review_text": "This game is simple yet amazing. Boring at times, but the ending mad up for it. Good job.",
            "review_score": "1"
        },
        {
            "review_text": "Simple. Beautiful. Free. Short and sweet.",
            "review_score": "1"
        },
        {
            "review_text": "This game gave a new perspective of live (or fly's life)",
            "review_score": "1"
        },
        {
            "review_text": "This was a very weird and beautiful experience. I never knew leaves could be so scary!",
            "review_score": "1"
        },
        {
            "review_text": "Never uhh have I uhh felt l-l-like Jeff uhh Goldblum... Now it's v-very apparent that I uuuuuuuuuuuuuuuuuuuuuuuuhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh have.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, short but good. Loved the visuals and music, very fitting. You should really consider expanding this game.",
            "review_score": "1"
        },
        {
            "review_text": "engaging story amazing graphics responsive controls beautiful music  free, 3 minute game that's better than 95% of the early access titles that crawl out of the woodwork",
            "review_score": "1"
        },
        {
            "review_text": "If you like gallows humour, this game offers a great plot. The latter just takes a few minutes of your precious time, but that's totally worth it and a significant part of the experience. The Plan is definitely underpriced, being for free. I wouldn't regret having spent some cents for this piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "There's not much here, really. You're a fly, and you... you know, fly.  It's peaceful. It's pretty. It's thoughful. It's free.  It's nothing revolutionary, but for the price, it's hard to beat this experience. Kinda special, and certainly woth the time.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that will only take around 5 minutes to complete. It is an /incredible/ 5 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as simple as it gets yet I was intrigued by the gameplay and story.",
            "review_score": "1"
        },
        {
            "review_text": "I thought The Fly was ascending to be a God.",
            "review_score": "1"
        },
        {
            "review_text": "For one brief moment, I felt the heartbeat of the Universe and it was one with my own.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I have no idea what I just did until the very end, but the game is very pretty.",
            "review_score": "1"
        },
        {
            "review_text": "More like a piece of cerebral artwork than an actual game. I'd still recommend it though. It's proof that games indeed can be classified as art.",
            "review_score": "1"
        },
        {
            "review_text": "rather short and no story to it, still found it rather fun and the music they used was lovely. Its nice to see something different in the gaming industry",
            "review_score": "1"
        },
        {
            "review_text": "  Heuuum ... Easy achievement, I guess it was",
            "review_score": "1"
        },
        {
            "review_text": "Worth the 5 or so minutes to see how much diffrent life is from a perspective of a fly.",
            "review_score": "1"
        },
        {
            "review_text": "  Oh boy I wasn't expecting this. Very short game but powerful orchestration. The short and simple gameplay makes it good for a quick emotional trip without having to make very much of a time commitment.",
            "review_score": "1"
        },
        {
            "review_text": "What is life, anyways?",
            "review_score": "1"
        },
        {
            "review_text": "Short game good for passing the time. More atmospheric than anticipated - I don't think people play this for the gameplay mechanics though and nor should you.",
            "review_score": "1"
        },
        {
            "review_text": "fly upwards for about 5 minutes... that is all!  I managed to get caught in a web, but it was easy to break out of and there are falling leaves you can temporarily stop/be stopped by.  easy 100% achievement if you're into that sort of thing or an amusing distraction for a few minutes if it isn't",
            "review_score": "1"
        },
        {
            "review_text": "Wow, made me feel less insignificant there for a second. Gotta be careful to not let that happen again :o",
            "review_score": "1"
        },
        {
            "review_text": "I survived falling leaves, spiderwebs and the troposphere. The life of a fly can be pretty dangerous!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and quick game.",
            "review_score": "1"
        },
        {
            "review_text": "Very charming and challenging game. Not takes a lot of time to finish. And it's free )",
            "review_score": "1"
        },
        {
            "review_text": "Cool 6-minute or so experience. Wouldn't really call it a game but it was in a way, really touching. An interactive story. That's what I'd describe it as.",
            "review_score": "1"
        },
        {
            "review_text": "Potential spoiler    The game takes place in Soviet Russia apparently.",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere is just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Sad and beatiful game ;)",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -An immersive experience -A well-developed story narrated in 10 minutes -Decent graphics  Cons: -Too damn short",
            "review_score": "1"
        },
        {
            "review_text": "Download it.  This was exactly what i needed. I was going through some anxiety and decided to try this out... i needed something simple. Basically all you need to know is the art design is great.. evocative and moody. The sound effects great. The sinlge musical score that guides you to the game's end is utterly beautiful. And no spoils... but a great ending. The game is very short as you have probably noticed... so i recommend to play this when you really need it. When you are feeling down... just click start... the second it begins it will hook you until its all over... i feel a lot better now",
            "review_score": "1"
        },
        {
            "review_text": "It was very atmospheric and calming, but also gave me anxiety XD",
            "review_score": "1"
        },
        {
            "review_text": "This game shows that 'meaning' is something we invent. Just persist and see for yourself.  On hindsight, I'm laughing because this is the only game in the world that makes you 'feel' something for a creature you'd otherwise swat away. Atmosphere, music, visuals - they come together quite nicely.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect.",
            "review_score": "1"
        }
    ]
}