{
    "app_id": 250760,
    "name": "Shovel Knight: Treasure Trove",
    "release_date": "2014-06-26",
    "developer": [
        "Yacht Club Games"
    ],
    "publisher": [
        "Yacht Club Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Pixel Graphics",
        "Great Soundtrack"
    ],
    "achievements": 85,
    "positive_ratings": 9334,
    "negative_ratings": 332,
    "price": 18.99,
    "description": "Shovel Knight: Treasure Trove is the full and complete edition of Shovel Knight, a sweeping classic action adventure game series with awesome gameplay, memorable characters, and an 8-bit retro aesthetic.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/250760/header.jpg?t=1507226670",
    "minimum_requirements": "Минимальные: ОС: Windows XP SP2 Процессор: Intel Core 2 Duo 2.1 ghz or equivalent Оперативная память: 2 GB ОЗУ Видеокарта: 2nd Generation Intel Core HD Graphics (2000/3000), 512MB DirectX: Версии 9.0 Место на диске: 250 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The idea of a Knight with a Shovel is, ground-breaking.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: + Beautiful artwork + Awesome soundtrack + Great variety of enemies and levels + Challenging  Cons: - ???  Definitely one of my favorite games this year!!    10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Shovel Knight is one of those games that you instantly fall in love with. It borrows from all the best games (Zelda 2, Megaman, Mario 3, Ducktales and Castlevania) while retaining a style and humor all its own. It has incredible platforming, a lot of items, but the thing I loved the most was the design of each one of the characters from  The Order of no Quarter . WOW! The environments and characters have so much detail and personality to them, it's surprising to see that level of detail in an NES 8-bit style game. Yacht Club did such an amazing job with this game. It gives the nostalgia off the NES and it does it by it's classic-style game play. If you like Mega-Man, Link's Adventure, and other 8-bit adventures, then this is for you.",
            "review_score": "1"
        }
    ]
}