{
    "app_id": 250700,
    "name": "Super Time Force Ultra",
    "release_date": "2014-08-25",
    "developer": [
        "Capybara Games"
    ],
    "publisher": [
        "Capybara Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Pixel Graphics",
        "Indie",
        "Action"
    ],
    "achievements": 33,
    "positive_ratings": 675,
    "negative_ratings": 72,
    "price": 10.99,
    "description": "Super Time Force Ultra is an insane platformer filled with robots and dinosaurs and fun and time travel... sometimes all at the same time!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/250700/header.jpg?t=1471371604",
    "minimum_requirements": "OS: Windows XP or later Processor: Core 2 Duo or better Memory: 2 GB RAM DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 or later Processor: Core i3 or better Memory: 4 GB RAM DirectX: Version 9.0c Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "   The Super  Time  Force is here!  ",
            "review_score": "1"
        },
        {
            "review_text": "You've finally done it; you've invented time travel! But before you can begin to use it to make the world more better robots start falling from the sky, everything starts exploding, and a future version of yourself appears in front of you. Turns out time travel isn't quite all it's cracked up to be, but that's OK because the Super Time Force is here to fix all the stuff you screwed up and make the world more awesome for everyone! Though it's probably Capy I should thank, not the STF, for giving me some an awesome...time, with one of the most outrageously fun and intensely smart games I've played all year!  Super Time Force Ultra (the last word being as this is an updated version of the Xbox One/360 game) is a side scrolling shooter ala Contra, but with an insanely clever implementation of a time manipulation mechanic. The gist of this is you have the ability to rewind time at will, letting you back up and remedy a poorly done section or avoid a grisly death, all while your other character continues to run on their own timeline repeating your entire previous run before you rewound. What this means practically is you have the ability to stack characters on top of each other, allowing you to clear huge amounts of enemies, collect items, and quickly decimate bosses incredibly fast as dozens of versions of yourself run along the screen at once. Think the replay mode at the end of a Super Meat Boy level, except now everyone has guns.  But the mechanic doesn't stop as just a rewind button, but also allows you to save other versions of yourself by killing an enemy before they get to you, and then stacking your saved character onto yourself and doubling your firepower and lifespan. This not only lessens the blow of death, but actually makes it rewarding and almost encouraged, as well as completely destroying the frustration of a difficult segment or challenging enemy as it's so easy to rewind and do it again.  With so much rewinding and replaying segments it would be easy to have the pacing be absolutely sluggish and repetitive, but STFU accounts for this by giving you but 60 seconds to run through levels (though there are certain collectibles that extend this slightly) making it an all out dash for the end before time runs out. Frequently I'd find myself playing for hours without ever realizing it, as with everything moving so fast and absolutely no downtime it's ever so easy to melt away into the game and have it feel as if no time has passed at all.  I realize trying to take this all in makes STFU sounds like an immensely complex and stressful game, but the genius of it is that as soon as you get your hands on it everything is shockingly intuitive. Reading the 'how to play' summary before starting the game had my head spinning, but within moments of playing the game everything fell into place and only continued to become more engaging and creative the longer I played and experimented with them. STFU is incredibly smart yet completely accessible to anyone that picks up the controller, and it's this fact that allows it to break out of the realm of just an interesting idea to being an insanely fun experience. It balances intelligent design with pure joy and entertainment with a deftness that is rarely achieved in any genre, no less one that has been floundering in a pool of uninspired mediocrity for the last several years.  But maybe ultimately what makes STFU so gratuitously delightful to play is the sheer amount of unrestrained fun you can feel emanating from every bit of the experience. From the gorgeously colorful art style, to the silly writing and even more ridiculous scenarios it's abundantly clear how much work developer Capy Games put into the game to make every single second as abundantly entertaining as it is. It's been far too long since I've played a game for the sole purpose of enjoying the hell out of it, and to be perfectly honest I cannot think of a single thing to complain about or that I feel could be improved upon in STFU. Capy has achieved excellence in all areas of design, and deserve a significant amount of commendation for what is almost certainly the most impressive game they've made in a long line of critical hits, and I can't thank them enough for finally bringing to PC.  In short I've had the  time  of my life, and can't wait to do it all over again (and I won't even need a time machine to do so)!   Full disclosure: Super Time Force Ultra was reviewed using a copy provided by the developer. You can read more of my writing on  Kritiqal  [kritiqal.com] . ",
            "review_score": "1"
        },
        {
            "review_text": "  Playtime and Time/money",
            "review_score": "1"
        },
        {
            "review_text": "This game made me rage more than Dota, CS:GO, and Battleblock Theater combined, and I loved every second of it. 10/10  But in all seriousness, this game is crazy fun, with a unique approach to puzzle solving and boss slaying, and a really light-hearted approach to the whole thing. It's got simple controls, good mechanics, unique characters, and the ability to go back in time is very well done and the uses for it are plentiful. I suggest getting this game if you're looking for a unique game to shake up the classics, or maybe if you're masochistic, in a good way. Overall, it's a great game, and at the time of the review, I intend on putting many more hours into it. Actually I have thousands, but I keep going back in time to stop messing up. Man I called my teacher 'mom' a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Braid meets Broforce in a well executed comedic story with refreshing gameplay mechanics.  When you die (or when you feel like it) you can rewind time and try (again) with a (optionally different) character, the effects/actions of your previous character will still remain throughout the next try, and if you succeed in stopping the death of your previous character, you will gain HP/powerups.   Next to the addictive, arcadic and intense gameplay, replayability is found in the form of unlockables, secrets, challenges and leaderboards.  EDIT: Having finished the campaign, I can add that the ending is awesome, that it unlocks an extra mode which is super ultra awesome, and that I might go back in time to play this game again.   Made with loving and caring, don't skip this gem!",
            "review_score": "1"
        },
        {
            "review_text": "The mechanics of Super Time Force Ultra are a lot of fun. A sidescrolling shooter, you can reverse time to 'double up' (and more) on yourself to help kill enemies and beat the level within the time limit. If you die, rewind and try to save yourself from dying by killing the thing that killed you before it has the chance!  The levels are varied in terms of art, each world has a level that mixes up the objectives and style, and each boss is really fun and zany. There's a lot of unlockable characters, each has their own style and abilities, giving you an ever-increasing pallette of tools to deal with the challenges you face.  The game isn't incredibly hard, but it is really fun, and the challenge level felt just about right for me. For the ultra-hardcore player, a hardcore mode unlocks on completion, that locks out a character completely if they die, unless you can travel back in time and prevent their death. Sounds like a lot of fun, but I'm certain it will make the game REALLY hard, so if you're after a challenge, there it is!  I enjoyed the game's art style, which reminded me of Bravest Warriors / Adventure Time, and the humour is really good. There are a few overlong cutscenes (namely at the start and the end of the game), but they're so well written and amusing you don't really mind.  There's a lot of unlockables and collectables too, so there's a significant amount to do after completing the game's stages. There's a lot to do and a lot of excuses to spend time with the game after completing it.",
            "review_score": "1"
        },
        {
            "review_text": "STFU is a rollicking good time. The core mechanic is well implemented and doesn't get tired--unfortunately the humor does wear thin.",
            "review_score": "1"
        },
        {
            "review_text": "The people that made this are brilliant, and this game is awesome. Do yourself a favor and purchase it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the stuff dreams are made of. Solid game lots of abstract thinking and strategy involved also trippy as F*%(!",
            "review_score": "1"
        },
        {
            "review_text": "This game is too much fun.. If you like side-scrollers, if you like innovative ideas, if you like comedic stories, and if you just want to smile while you blast knights, robots, dinosaurs, vagrants and alternative-dimension enemies, this game is for you. In fact, ♥♥♥♥ it, if you are a gamer, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is really solid fun, great for playing in small chunks, and the writing will get a few laughs. Definitely worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "Yep. Its a good game. Good for a mindless romp in explosions, also good for a thoughtful romp with explosions",
            "review_score": "1"
        },
        {
            "review_text": "This is a gem of a game. Nice shooter mechanics, a variety of well done characters with their own unique abilities, and hilarious writing. Turtles in time meets contra minus taking itself seriously in the slightest. ",
            "review_score": "1"
        },
        {
            "review_text": "I don't typically play Contra-style games, but this was something special. Very highly reccomended.",
            "review_score": "1"
        },
        {
            "review_text": " What I liked:     Unique Time Travel based combat   What You Need to Know:     Game basically requires a controller, the game only shows Xbox controller prompts    The Levels are short missions that require you to use the time travel to speed through some parts    The bosses are fun, requiring you to stack up multiple version of yourself to stack up damage on them    The combat is very shallow and just not fun because of the timer put on you in each level. It's more a speed run game with it in    My hours maybe short, but I got through 1/3 of the game and just wasn't enjoying it, so if your on the edge of buying, just skip it your not missing much    My Score:",
            "review_score": "-1"
        },
        {
            "review_text": "Die. Save your past self. Power-up. Kill everything.",
            "review_score": "1"
        },
        {
            "review_text": "+ pixel art graphics with nice colours and animations + cool sound fx and music + tutorial and easy to learn how to play + lots of action and replayability with different combinations + nice puzzle levels @ HellaDeck + funny moments and dialogs + cool and funny characters &amp; some of them are references from other popular games + pretty awesome scenes at each campaign level + ultra mode is unlocked after the normal campaign completion (same levels, more characters to unlock)  - the gameplay gets frustrating some times - gets a little bit tiring after some time - more challenging in ultra mode, but even more difficult to control your character successfully -you don't enjoy it much",
            "review_score": "1"
        },
        {
            "review_text": "The raddest single player co-op game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The pictures and videos make it seem like this is an arcade-style retro action platformer.  In a way, you could say it is. But then, not really. I'd actually classify it as a *puzzle* game, and a very very good one at that. The premise is that you control a character in a level which is much too long for the time limit you have and with death being ~everywhere. Only, when you die or at any given time you can stop time, rewind, then from that point spawn a new character (of the same or another class, there are a lot of classes which you unlock throughout the levels, each with their own unique skillset). You'll move again, but the previous character still does the stuff you controlled it to do.  This leads to a very puzzle-like way of approaching levels. You will constantly branch and rewind, using new characters to protect older ones (which allows you to pick them up again) which died originally. Bosses result in a giant carnage of 15-30 characters blasting various weak spots at various points in time.  At the end of each level, the game plays back everything in 'normal time', which is very interesting to watch.  It's a really good game. Graphics are solid, controls are very tight, the mechanic is quite unique and works well, enough stuff to do, the only thing I would criticize is that unless you're going for a minimum-rewinds approach, difficulty is often on the low end.",
            "review_score": "1"
        },
        {
            "review_text": "Somehow they managed to make the game less fun by adding time travel. This is the first time I've ever seen that happen. This game lets you brute force your problems with up to 30 simultaneous selves... imagine, for a level to actually be a challenge you have to even think about, it has to be so hard you fail at it after playing it 30 times. To make things worse, the enemies so far that I've encountered which require multiple selves to defeat are not puzzles at all, no, they merely have so much health that you run out of time when trying to kill them with only one self.",
            "review_score": "-1"
        },
        {
            "review_text": "Play as dinosaur on skateboard, get murdered, rewind time and save myself as a dolphin with a machine gun.",
            "review_score": "1"
        },
        {
            "review_text": "Brillant &amp; Extremely Clever",
            "review_score": "1"
        },
        {
            "review_text": "HARD AND AGGRAVATING... But worth it in the end",
            "review_score": "1"
        },
        {
            "review_text": "Usually when I get mad wishing that I came up for an idea of a game, that's when I know I truly loved it.  Once you actually get a hang of the time controls, the game really opens up. You'll become super hyped for boss battles and watching their replays are just insane.  The writing, humor, in-jokes, and puns are just icing on the cake. If you love side scrolling shoot 'em ups, goofy dialogue, awesome characters, and TIME, then get this jam.",
            "review_score": "1"
        },
        {
            "review_text": "Really funny and with good unlockables and a great difficulty curve.  Platforming is good, and becomes a puzzle in itself.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little romp with an interesting time mechanic and gameplay reminiscent of Contra and other platform shooters, good humor, a fantastic art style and plenty of replayability. Definitely worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "went back in time to tell myself to get this gdamn game. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Super Time Force Ultra is a shooter in the same vein as Contra but with a few twists.  1) There are no weapon pickups. Instead, you get to pick a new character with each respawn. New characters are unlocked as you finish levels and collect things. Each character has a different weapon and a charge shot that is essentially a secondary fire. Sheildy McBlockerson is particualry useful... 2) When you die and respawn you can spawn at any point in time since the start of the level, meaning you get to see the future and adapt to different obstacles. 3) Each life you play exists within the timeline, meaning each of your thirty lives could potentially be in play at the same time. This is the primary gameplay mechanic as it allows you defend or support other lives and to team up on bosses.  Playing takes a little bit to get used to. Death can sometimes occur frequently, not because it's particularly hard, but there are are a lot of bullets and enemies on screen. If you're sensitive to flashing lights, this may not be your game. I love this game and can't stop playing. The art, sense of humor, and time mechanic is sweet. My only real complaint is that I wish there were more levels or, better yet, a level creation tool!",
            "review_score": "1"
        },
        {
            "review_text": "Metal Slug Meets The Matrix  Aside from the charming pixel art, campy story, and ridiculous puns, this game is serious fun. The reason it stands out from other run n' gun games is that you team up with yourself on previous playthroughs. This mechanic transforms each game into a hybrid of bullet-hell action and puzzle solving. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This here is a hilarious and intriguing take on a sidescrolling action platformer. It's definitely not for everyone and a game I could only get myself to play in short bursts, but I enjoyed almost all the... time... I put into it. I'm sure there are plenty of reviews explaining how the game works, so I'll just list my likes &amp; dislikes.  Likes: + Large cast of playable characters, including 3 Steam exclusives (&lt;3 Zoey) + Innovative time rewinding gameplay + Very funny, if a bit sophmoric, sense of humor throughout + Plenty of replay value + Achievements aren't too difficult (31/31 in exactly 12 hours)  Dislikes: - A lot of the characters weren't all that fun to play, so I never really used them - Gets a bit tiresome and frustrating if played for too long - Can be blown through in an hour or two if you're a pro - Catching the Lookers",
            "review_score": "1"
        },
        {
            "review_text": "When you wanna use all your lives in one go",
            "review_score": "1"
        },
        {
            "review_text": "Well made game with interesting mechanics, I don't exactly like it personally, but it is a good game",
            "review_score": "1"
        },
        {
            "review_text": "Dis gme rly gud",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would travel back in time and buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, bought it 75% off. Best thing i like about this game is, it never gets boring. One of my favorite games on steam :)",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't get through the tutorial because the controls they tell you are all for a controller, which I don't have, and I don't want to use. And these aren't the simplest controls for a game. My fault for not knowing it was another sidescroller designed primarily for controllers, but it seems like should assume that's the norm these days. Maybe I should relent and learn controllers, but I really just prefer keyboard. Thanks for reading.",
            "review_score": "-1"
        },
        {
            "review_text": "Quantum loop simulator  Tutorial prompts are xbox controller buttons but menu prompts are keyboard buttons. And I have no control over that. ♥♥♥♥ing brilliant  10/10 Would have to keep checking the config again",
            "review_score": "-1"
        },
        {
            "review_text": "why",
            "review_score": "-1"
        },
        {
            "review_text": "is cool n stuff",
            "review_score": "1"
        },
        {
            "review_text": "So much fun. This game is definitely worth your time, even if it's just for the writing. But the beauty of this game really is too maximize the time powers. Tons of fun, really unique, interesting, crazy, and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Very good, you should play it.",
            "review_score": "1"
        },
        {
            "review_text": "A really interesting game this, the time mechanics make a whole new twist on a the run n' gun genre.  Well worth playing,",
            "review_score": "1"
        },
        {
            "review_text": "Super Time Force Ultra is non-stop fun. I can't stress enough how smart this game's design is. It uses the common time travel trope and packages it with an amazingly chaotic action/puzzle element.  You will start each level with one character, traversing the level as usual, but when you die, you get to choose where in your previous life you want to divert the time-line with a new character. Your previous selves keep playing as you did and if you save them from dying, you can converge your time-line with theirs to gain their special attack. It sounds complicated, and on some level it is, but the flow is super satisfying. It takes some thought and strategy to get through the levels and perfecting a level can take some real dedication.   The dialogue is super corny, but it's legitimately the funniest game I've played in years. The scenarios are absolutely over the top and childish in the best possible way.",
            "review_score": "1"
        },
        {
            "review_text": "A very underappreciated time-♥♥♥♥ery game, and it NEVER takes itself seriously.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and funny as f*ck, haven't had this much fun with a platformer in ages, very clever time travel gameplay, surprisingly funny dialogs.",
            "review_score": "1"
        },
        {
            "review_text": "its a gud gaem, play it.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game.",
            "review_score": "1"
        },
        {
            "review_text": "STF is a super fun game. with a cool game play style. it has a simple but butifull art stile and I think it was worth my money",
            "review_score": "1"
        },
        {
            "review_text": "The most brilliant homage to Contra and Gunstar Heroes, on a high octane mixture of meth and crack. This game is INTENSE, full of high speed gameplay, fantastic time reversing play mechanics, and stylish 8bit-♥♥♥-modern 2D graphics with awesome trippy chiptunes. Rewatching the level replays is at once hilarious and mind-blowing. There is nothing quite like watching 10+ copies of yourself completely annihalate a boss in less than 5 seconds.  Perfection!",
            "review_score": "1"
        },
        {
            "review_text": "Fun gameplay. Dialogue is a little too awesome and can feel like eating a never ending bag of skittles. Without a strong option to skip all dialogues it can become a numbing experience as you continously press any number of buttons to carry onto the action. But the action, oh it is sweet.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "It's like an non sexual adult Adventure Time on crack.   Remeber when first playing Portal and your head hurt because your brain was learning to think with portals and then one after another you understood how portals work and how you can use them in your favour and at some point thinking with portals became totally normal for you?  Well this game is kinda similar to this but with time travel paradoxes. At first you are totally blown away and neither appreciate time travel paradoxes nor can you make them work in your favour. But while fighting the first end boss you are starting to fully understand and begin to plan ahed your moves doing (at that time) seemingly useless stuff only because you know that couple of paradoxes later it will come in handy and help you defeat the boss. From then on time is your ♥♥♥♥♥ and you make her work for yourself!  Come to think of it: It's a lot like chess or go but those games are for dorks so go forth and learn the art of war with modern time travel technology!",
            "review_score": "1"
        },
        {
            "review_text": "...  ...  I have no idea what's going on. Why exactly I'm doing what I'm doing, or where exactly half these people (and lizards?) came from.   TIME OUT  Time-travel jokes aside, Super Time Force Ultra is a 2-D Run-and-gun game with multiple different characters and one key mechanic. Warping back in time to work with your past and future selves. You die in one hit, but automatically warp back to either re-do what you just did or select another character and try something completely different.  You can also save your past selves for some extra health. The character doesn't matter in this case.   I have no idea what's going on. Why exactly I'm doing what I'm doing, or where exactly half these people (and lizards?) came from.   Although it's crazy fun. ",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is extremely fun with the rewinding time mechanic and how the boss battles are essentially puzzles that you have to solve because of the time limit on the levels. The characters are all very different which makes the game really fun to just keep making massive combos. Watching your entire squad at the end of the mission is surprisingly fun.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting 2D puzzle-shooter hybrid with fun sci-fi references and side-missions that can occupy completionists for a while. Really look forward to seeing speedruns in the future.",
            "review_score": "1"
        }
    ]
}