{
    "app_id": 251060,
    "name": "Wargame: Red Dragon",
    "release_date": "2014-04-17",
    "developer": [
        "Eugen Systems"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Military"
    ],
    "achievements": 0,
    "positive_ratings": 7949,
    "negative_ratings": 1137,
    "price": 24.99,
    "description": "The new reference in RTS at its best!The Wargame series returns to duty, larger, richer and more spectacular than ever before. In Wargame Red Dragon, you are engaged in a large-scale conflict where Western forces clash against the Communist bloc.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251060/header.jpg?t=1505207424",
    "minimum_requirements": "OS: WINDOWS XP SP3/WINDOWS VISTA SP2/WINDOWS 7/WINDOWS 8 Processor: AMD/INTEL DUAL-CORE 2.5 GHZ Memory: 2048 MB RAM Graphics: 256 MB 100% DIRECTX 9 AND SHADERS 3.0 COMPATIBLE ATI RADEON X1800 GTO/NVIDIA GEFORCE 7600 GT/INTEL HD 3000 OR HIGHER Network: Broadband Internet connection Storage: 20 GB available space Sound Card: DIRECTX 9 COMPATIBLE Additional Notes: INTERNET CONNECTION REQUIRED FOR ONLINE GAMING",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'm surprised that I still haven't written a review of this game yet.  It's a great game; in my opinion the most polished Wargame of the series. Although European Escalation has the superior campaign. Scripted campaigns (European Escalation) are a lot more fun to play than a sandbox-y campaign where you play against an extremely predictable AI on rezoned multiplayer maps (AirLand Battle and Red Dragon).  Wargame's always been an RTS with greater focus on force composition and positioning rather than micromanagement. Deathballing that you typically see in Starcraft/Command and Conquer does not work here. Your forces have to be spread out, ready to support eachother, and be able to take their objectives on the map.  The force you deploy in multiplayer is your 'deck', which you build not unlike decks in popular card games such as Hearthstone. Select an alliance/coalition/nation, create a deck with logistics, infantry, support, aircraft, navy, tanks, and the like and deploy that deck in battle. Since the game uses a deck system, like the cards in a real life deck of cards you're limited in the number of units you can deploy. Try not to lose both your Su-27PU's in one go.  The game also places emphasis on logistics, which I have never before seen in an RTS game. All units have health, fuel value, and ammo value for EVERY weapon (including coaxial machine guns). You must sustain your forces through a well maintained logistics line. Supplies are also limited (and the amount of supply you have depends on how much supply units you've included in your deck) so use sparingly.  Combat is fairly realistic. Engagement ranges seem more plausible than in traditional RTS games (where a marine can only see and fire up to 10 feet in front of him).  The game is extremely well optimized; I was able to run it at a steady 40-60 FPS on a laptop that could only use Intel integrated graphics (albiet on medium settings). You can zoom all the way out so that you can see the entire map and your units icons, or zoom all the way in to see combat from a footman's perspective.  The naval portion is a bit gimmicky. Sure, sometimes it's fun to play with ships but the combat is not nearly as exciting or engaging as land/air combat. However, amphibious land units does open up more tactical options since you're not 100% restricted to crossing bridges or chokepoints.  As a Cold War history buff, having access to over 1400+ real life units from over a multitude of countries spanning North America, Europe, and Asia is extremely exciting as well. Even now I'm still overwhelmed at how many variants of Abrams tanks there are (M1 Abrams, M1IP Abrams, M1A1 Abrams, M1A1HA Abrams, M1A1HC Abrams, M1A2 Abrams).  I don't play this game as much nowadays, but only because I've played it almost exclusively for the past few years and it feels slightly stale to me now (although I do get on every now and then). Wargame: Red Dragon is one of the few games I've bought that has kept me entertained for so long.  A warning: this game is not meant for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game overall (in beta) but don't be fooled - the naval component is so highly restricted that it's a huge disappointment. Barely any ships, most nations don't have their navies represented whatsoever.",
            "review_score": "1"
        },
        {
            "review_text": "Builds Armor column made of Abrams and Bradleys. Sends armor column to capture objective. Column runs out of fuel half way. Sends CH-47s to refuel armor column. While refueling, CV gets suprise attacked. Realize I forgot a recon unit. Sends back column to regroup with new units. On way back, column gets spammed with rocket artillery. 1 M1A2 Abrams makes it out allive. Sends M1A2 back to home objective. Runs out of Fuel. Builds new armor column. New armor column obliterated in battle. Says '♥♥♥♥ it' and spams Jets and Naval. Kongo destroys eveything in it's path. Takes all enemy objectives. Minor Victory.  10/10 M1A2 Abrams.",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me that without any fuel helicopters and jets can't fly and tanks don't advance even when I'm commanding them with my deep RUSSIAN voice.",
            "review_score": "1"
        },
        {
            "review_text": "Developer Eugen takes the RTS genre to a cold war gone hot. Gone is the concept of base building, and resource management. WG:RD introduces players to a realistic RTS unlike anything seen before. No longer will players contend with Actions Per Minute, but rather with tactics, units, and teamwork.   With a blistering amount of units (1500+) they've managed to capture the most minute, and accurate features of nearly every unit. Players will find themselves lost in the sheer number of statiscal difference while attempting to create the perfect army. The complex task of 'deck building' becomes simplifed by a restrictions and bonuses. The more you limit your military the more you have available.   Graphically speaking WG:RD shines above almost all RTSs on the market. With almost painstaking authentic detail to units it's a shame to realize they are only utulized when fully zoomed in. The games scale makes it impractical to play any attention more than what's needed.   Although WG:RD is a shining example of the RTS genere; it does fall short with it's limited maps, and often sidelined naval battles. You'll easily find yourself playing the same maps time after time. Not necessarily a bad thing when you have 17 nations to choose from, and more FREE DLC along the way  Wargame: Red Dragon is an armchair generals wet dream. Pick it up today.",
            "review_score": "1"
        },
        {
            "review_text": "Plays match against random dude. Late game, I'm losing terribly. Cue massive helicopter swarm from bottom of map heading towards my spawn territory. Last thing I see in chat is:  'here i come' ",
            "review_score": "1"
        },
        {
            "review_text": "Wargame: Red Dragon is the strategy game I didn't know I needed. Its the only video game I've played consistently over the past couple of years and I'm still learning new things about it every day. If you're a military equipment nerd, a military strategy nerd, or looking for a very deep and challenging RTS you've found the perfect RTS.",
            "review_score": "1"
        },
        {
            "review_text": "THIS is the RTS that i was looking for. The learning curve is like climbing mt everest with a 19' alienware laptop. But the game delivers 10/bang",
            "review_score": "1"
        },
        {
            "review_text": "Extremly realistic models, my father was US army in the 80's and he recognizes all of the units the game displays. Badass gameplay really gives you a scale of what COULD happen if there was a war in the 80's. Naval, Air, Land it has it all and they all work for you to kill as many North Koreans as possible. SO many differnt units to chose from on each country/faction. The game is beautiful and I have had NO bugs and glitches while playing. I have enjoyed the campaign (Which is not very story oriented) and the skirmishing and multiplayer is up to par as well. The game mostly has a particular audience and fan base on the side of Army nerds (Me) and RTS players alike. If you play CSGO maybe it's not the game for you. If you play Arma, than give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "I've played the Wargame series since the beginning with European Escalation. It is immensly complex and has a tough learning curve, but is definitely the best stratgy game on the market. I was excited to see there would be a third game, and immediately preordered it and started playing the beta. There is a lot of balacing to be done, but that is not the reason I'm giving this a negative review. The game was advertised as incorporating navies for each country and naval combat mechanics. There are a grand total of 30 ships for 17 nations, yes 30. Blufor and Redfor each get a pool of ships from their nations' navies, and some major navies such as the United State's and the UK's are sorely underrepresesnted. Naval fights are blobs to see who can mass the most ships with CIWS and missiles, and there are no tactics at all. I love the wargame series, but I cannot in good conscience advise you to buy this game. Buy Airland Battle, which is far more balanced and doesnt lie to consumers about its features. Really dissapointed with Eugen, I had very high hopes for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Lot's of problems.  Naval combat is awful. It's a sideshow with no balance. The deck system isn't even made for it, and there aren't enough naval untis to allow each nation to have their own (just BLUFOR and REDFOR ships), don't be fooled by the lights and sounds.  ALB would be a much better choice if it still had enough people playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "+Started up the game, put on some Noth Korean music on, hailed the all mighty kommunist party, and went on blasting down frenchies and eating french fries at the same time, while my 'million man army' won the entire battle without a single official loss. -Contains no North Korean WARSHIPS! -Not made by North Koreans -Makes North Korea look like warmongers  8.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Once you start the game just hit the red mute button in the lower right and you're good to go!",
            "review_score": "1"
        },
        {
            "review_text": "The fact that I can play as North Korea pretty much makes this game a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "100% recommend this game!!   Comes with two mini games; Lobby simulator and Warchat!",
            "review_score": "1"
        },
        {
            "review_text": "Good optimization: check A caring developer: check A slightly mature community: check  Yep this game meets my standards.",
            "review_score": "1"
        },
        {
            "review_text": "Wasted all of my planes trying to drop Australian napalm on a Chinese UAZ-469 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a most have RTS game. Gameplay is amazing with both good single player and multiplayer experiences. The best part is this game is released for Linux, so if you miss playing proper RTS games look no further. The Wargame series has given me more enjoyment over the past few years than any other game. Well done Eugen Systems keep them coming and keep support Linux.",
            "review_score": "1"
        },
        {
            "review_text": "North Korea destroy Nato 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I am not very good at this style of game (rts) but i just love looking at all the little tanks and stuff driving around so i think whoever you are you will get a sertain amount of joy out of this game (probally high). 9/10 would totally recomend",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game which you should definitely get, but I would actually recommend Wargame: AirLand Battle over this game, which has several flaws.   A few key points about the game: 1. The maps are beautiful and are well-balanced for the most part. Maps manage to feel unique even though there are very many of them, all for different numbers of players. 2. Naval combat, while it sounds cool, is underwhelming. It's basically like a downgraded version of land combat and the naval maps aren't very imaginatively designed.  3. The developers seem to have trimmed a game mode or two from the previous game which, in all honesty, isn't the end of the world since we still have the most important game modes, but when you get a new game, you expect it to take what was present in the previous game and expand upon it, not remove from it. 4. The campaigns are pretty mediocre and are gimmicky. The AI is extremely stupid even on the hardest difficulty, and you can bait it easily. To counteract this, the AI gets a handicap in that it gets extra units at the start of the game, which isn't that big of a deal. The AI's basic strategy is to send waves of vehicles at you in hopes that you will just give up. The only thing that interrupts this is the constant artillery bombardments against your command units which, by all accounts, should be hidden to the enemy. The campaigns themselves are interesting and based in history, but they get old because, when it comes down to it, there is generally either one solid strategy or two solid strategies which allow you to complete the campaign successfully, and there isn't any room for strategic creativity.  Multiplayer is super fun.  Score: 83/100: If there were as many people playing ALB as there are people playing this, I would just play ALB, but this game is still worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Longtime Wargame player, the desk system in this version is perfect. Naval Warfare is not really up to scratch but its such a small part of the game not to really affect anything too much. Land battles seems much more balanced than previuous versions. Campaign mode is tough but beatable. Great end to the series if it is.",
            "review_score": "1"
        },
        {
            "review_text": "Geat game! It is my first game of the Wargame series and I'm having so much fun. It is a must have for people who are interested in post WW2 military and wars.",
            "review_score": "1"
        },
        {
            "review_text": "First, if you enjoy RTS games, this is one you will definitely enjoy whether you like campaigns or multiplayer.  The first most important things in regard to first playing is that there is a learning curve, and its pretty steep. For many, few games offer the dynamics or air and land comat with the lethality and speed that WG does, and remains blanced and fair. That boils down towards, if you want a game that is slower paced, it may not be for you,  Having over 400 hours, i can say i am well acquainted with the pors and cons of the games design, and firstly i'd want to ring up the campaigns. There is a few scnearies with the last two being expansive and very long. Theyre great and ultimately they turn out the way you craft your forces to tackle the problem. Every time you play it, it ill turn out somewhat differantly which makes the games replayability remarkable. The downside is that the game compensates the poor intelligence of the AI with spam, and that spam is typically utilizing superior units, and those you can match are hard to replace when lost. it's incredibly easy to lose and unfortunately i've had to reload previous saves in order to actually win. The end result overall is still a great experience well worth your money alone.  Second is the multiplayer. The multiplayer is similar to the campaign with its owns ups and downs. The first most obvious and great thing is your ability to hand craft your pre-set battle group or 'deck'. It allows you to play however you choose. It again requires a degree of understanding the game. When that is reached though, the creative and dynamic limits are only limited by you. This paired with other players doing the same leads to games where the outcomes are wildly varied. This is where the game really is worth your money. It is the reason why i can comeback time and again over games like Fallout 4 and other titles that are immedialtely boring after only a single playthrough.  There are huge negatives which i Eugen needs to address though. The first is lobby stacking. The greatest problem that turns me away is the ability for experienced players to simply stack into one side of the team and wait for the lobby to fill up essentially gauranteeing a win. This is literally game breaking, and anyone new to the game will immediately realize after a dozen loses that the game is against them. It is a terrible and unfair system and isnt fun. If this wasnt an issue, the game would easily be a 9 out of 10,  Everything altogether though, this game is brilliantly designed and encourages varied strategies and dynamic mindsets to counter and succeed against real people or computer AI's. Aside from its quirks, its well worth your money. ",
            "review_score": "1"
        },
        {
            "review_text": "I think if anyone were to ask me what was the best RTS of all time, this game wouldn't come up.  Not because this isn't the best RTS of all time, but because I know despite how amazing and incredible it is. How it's such a ridiculous technical marvel with the most incredible depth in an RTS to date.  It's because just like Dwarf Fortress, I know that if I send regular joes into this with that impression, they'll just come out loathing it due to the sheer incredulous difficulty that comes with it. It makes TA: Spring or Forged Alliance look like Baby's First RTS. It makes Starcraft 2 look like a kid's show. It's like someone took the time to kill from modern FPSs and threw them into a super hardcore RTS so your hour long plans can get wiped out in five seconds. It's actually somewhere along the lines of Men of War, but with 10x the unit diversity.  This game is only just slightly under games like Dwarf Fortress and Aurora in terms of difficulty to learn. But just like them, if you bother to actually learn all its intricacies... you will be rewarded with something truly magnificent.  You'll still get your ♥♥♥ kicked though. All the time. Also the subreddit and forums are full of ♥♥♥♥♥♥♥♥s and nothing helpful plus all the guides are outdated so don't expect anyone to hold your hand.  ---------  By the by, you don't actually need any of the nation DLC. Maybe get them if you like the countries but other than that they're not required to be competitive at the game. I have 118 hours in Red Dragon and I don't even have a single one of the DLCs. Never felt like I needed them, though they are fun and extensive. ",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, but there are lot of disclaimers to note:  1. There is a STEEP learning curve to the game, and there isn't a good tutorial in-game.  2. While there are a few good guys who don't mind helping out a noob, the vast majority of the community will view you as prey to get an easy win. Proof? Create a multiplayer game, title it noobs only, the first 3 people will be level 15+, and won't even apologize that they tried to take advantage of you being a beginner for an easy win.   3. Lots of battles are won or lost within the first 5 mins. These are 20 minute battles, mind, so there's a good chance that you will be on cruise control for 15 minutes of it.  4. Artillery units are overpowered as of now, and matches could boil down to people just shelling the crap out of each other for 10 mins.  Now why do I recommend the game?  1. There's no other game like it. It is like Total War on steroids, every unit has a counter-unit...It is the very basis of strategic thinking.  2. Once you get over the big hump of learning the game, it is quite a lot of fun...unless you match up with one of the vast number of people who are diehard followers of the game and know every key-binding and inch of the map in the back of their head.  3. There is a HUGE amount of units to select, granted some may be the exact same (but made available for different countries) but in general, you can browse through each unit with a very detailed model to boot for a while.  4. Like I mentioned, there are hidden gems in the community, and some of them have written up some very comprehensive guides for the game. Whether you want to read through a 200 and 180 page guide for a game is a whole different question altogether though.",
            "review_score": "1"
        },
        {
            "review_text": "This is my best game strategy",
            "review_score": "1"
        },
        {
            "review_text": "Highly realistic tactical RTS. The realism can lead to slow feeling matches, but the satisfaction of a properly executed bombing run has few equals. If you've ever wondered what would have happened if that cold war had gone hot; this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. I learned about how to davai hard, the Polish space marines, German Übermensch abilities, Roki Vulovic and a plethora of other things from a single game. 5/7",
            "review_score": "1"
        },
        {
            "review_text": "Okay, I am not objective coz it is my favourite game.  As all games have its ups and downs, pro and cons but it can be highly adjective and I do simply love it.  Great job by eugen team, including great support and free DLC policy - very rare in those days.  Game is very realistic and can get ur whole attection for long time. Never boring.  Never 2 same games, mssive replay potential. So may variations. Big choice of units and always can find something sweet.  Very few 'OP' units.  Match maker can be an issue and very steep learning curve. Be patient coz if you will rush in to the game game will kick you back very badly. Be patient and learn, check replays from your victories and failures. And most important is TEAMWORK.  Play against AI is pleasant but not very challanging and simply completly different than against human players.  Keeping that in mind, if you are good vs AI that do not mean you will be any good vs human players!  Still strongly recomend, and if some one is new in the game very happy to give some advice and help.  ",
            "review_score": "1"
        },
        {
            "review_text": "YES buy it, especially on sale. If you can persevere past the learning curve, this will be your favorite RTS, hands down.",
            "review_score": "1"
        },
        {
            "review_text": "Wargame: Red Dragon is 3rd game of the series and one of best RTS available right now.   + Good gameplay. + Variety of nations: 17 in base game and additional 4 in DLC. + Large variety of units with deck building system allowing to customize your play style. + Decent visuals for large scale RTS and good performance even on older hardware.  + Replays  - UI could have been better and more customisable. - Skirmish AI isn't that great. - Should come with more decks for AI instead of making player to make everything, however there is option to import decks that are made by other people. - Multiplayer community is full of rage quitters/leavers.  * Not base building RTS * Multiplayer focused * Takes time to learn units and how to use them well. Game does provide armory where player can view every units characteristic.",
            "review_score": "1"
        },
        {
            "review_text": "If you want a WW3 simulator, you should play this series of games. ",
            "review_score": "1"
        },
        {
            "review_text": "If you like cold-war games, You'll like this. If you like strat-games,  You'll also like this. If you're like me, and you love Czech/Norway, Then you'll probably also like this. NORWAY WAS STRONK IN COLDWAR!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, perfect for any RTS fan out there. Buy it :D",
            "review_score": "1"
        },
        {
            "review_text": "So far this game has been totally amazing. 1,600 units, ranging from Hinds to HEMTT's, all with there pros and cons! Amazing aircraft, trustworthy tanks, inglorius infantry, and valiant vehicles make this game Amazing!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS ever.  2nd Korean War: Koreans: T-90 My forces: some infantry 11/10 Would invade South Korea again.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Airland battle, you'll like that one. Very good gameplay, learning curve is a bit steep, but nothing too hard, and the Naval assets are a great addition.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say, inbetween the Planes, Boats, Tanks, Mechanized/Motorized, Infrantry, artillery, and recon elements in the game and the way they managed to put them together into an RTS and then make it fun to play this ranks as one of my favirote RTS's of all time. Now if only more people played it.",
            "review_score": "1"
        },
        {
            "review_text": "dont read the ingame chat unless you like to see butthurt",
            "review_score": "1"
        },
        {
            "review_text": "love this game, great follow up to previous installment",
            "review_score": "1"
        },
        {
            "review_text": "Despite being somewhat ignored by the developer compared to previous games, a lot of balance issues that still need to be resolved, and slow patch rate, and steep learning curve, this is by far by favorite RTS in a long time. While early on the balance was not very impressive, it has been slowly improved over time. There are some key features missing, namely automatch if you wish to get into online multiplayer games. New players can expect some frustrating games against seasoned teams that are horribly one sided.  That being said, if you are a fan of the Cold War and love RTS games, I believe if you are willing to put the time and effort into learning to play, it is a very rewarding experience.",
            "review_score": "1"
        },
        {
            "review_text": "The single best RTS ive played to date! Im a very seasoned RTS and Turn based Stratagy player and have found this game to meet alot if not most of my needs. Yes there are flaws but they are well worth playing through! Keep up the good work Eugen!",
            "review_score": "1"
        },
        {
            "review_text": "I love this company and this game. I have 'low' hours in this game because of a unit limit....Came over from RUSE (no unit limit)  Pros: -Every unit under the sun -Bunch of nations -Makes a constant fun struggle to manage -Constant tactic changing -Feels more compact than any RTS i've played before -Fueling/Ammo impact is amazing! LOVE this concept -Naval/Land battles are fun -Different play styles for different people  Cons: -UNIT LIMITS (I know its part of the game to make you think...but i WANT massive battles including a disposable army lol) -Restrictions, wish you could play a certain nation at a certain year and go with what they have ready -NO UNIT LIMITS ON AI! (If i have one YOU have one...cheating AI !) -No settings for UNIT limits/Restrictions, be nice to have it for the players that want that option, if not you don't have to use it -Hunting down and trying to kill the LAST or what you hope to be the last remaining AI Command vehicle to end the round...often times, three people i play with are searching high and low, and in every corner of the map and we still can't find the game ending ai command vehicle, most of the time its an average of 30 mins. We hate time limits, so we never have one, sometimes thats the worse decision! lol",
            "review_score": "1"
        },
        {
            "review_text": "This series is one of its kind, a good breakthrough in the RTT genre.  Did I mention it's a RTT game? A RTT franchise that plays way better than decent, and that should had explained all.   Well the red dragon is simply the third game in this franchise, nothing less, and shouldn't one expect more. An Eugen's sequal after all.   It left a legacy that hopefully some innovitive developers will pick up and let it live on in the futrue.",
            "review_score": "1"
        },
        {
            "review_text": "It's easier to command the individual atoms in my cat.",
            "review_score": "1"
        },
        {
            "review_text": "Wargame: Red Dragon is a great Cold-War gone hot RTS game that is easy to understand and fun to play. It is almost the same as Wargame: Airland Battle but it offers new nations like North Korea and Japan. It also has new map enviorments, naval gameplay and over 600 units to use in batle. The game is far from perfect however and it has more balance issues then any other Wargame title. Ships dont make noise when they move, unit accents are messed up (the same voice actor is used for UK and Aussie troops) some factions are almost useless (Danish) and some units need balance issues fixed. The single player is also poorly made and overly hard. Wargame: Red Dragon is a epic RTS game but the issues need to be fixed and Wargame needs a much larger profile. 'Off you're ♥♥♥ and on you're feet lets MOVE!' U.S Riflemen.",
            "review_score": "1"
        },
        {
            "review_text": "The ai is eiather ♥♥♥♥♥♥♥♥ or very smart depending on the circumstanses ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun campaign and extremely competitive multiplayer, best RTS in years.",
            "review_score": "1"
        },
        {
            "review_text": "The best way to describe it, is it is not an RTS, but a simulator. Hense the name Wargame. It is very intense and gripping. Even when you loose you have fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best Multiplayer strategy games i have everseen. If you love Modern military combat and strategy games you should buy it. Its hard to learn at first but once you get used to it you wont let it go. *Double Thumbs Up*",
            "review_score": "1"
        },
        {
            "review_text": "A great modern RTS game. The only disadvantage is the naval.",
            "review_score": "1"
        },
        {
            "review_text": "The spririt of sudden strike together with a damage model and supply management plus ground/naval/air units together: Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "I have over 300 hours in Wargame : Airland Battle, and can see spending a lot more time than that in this game. The battles are bigger, yet seem more concentrated, units are deadlier, some general concepts have been balanced since Airland Battle. The new naval units really change the dynamic, but there are maps without them for those who rather just have ground and air fights. All in all, a great RTS that feels like you are watching WW3 unfold.",
            "review_score": "1"
        },
        {
            "review_text": "From a background of competing in and playing RTS's since 1998, Wargame is by far one of the greatest RTS series i have ever witnessed and has astonished me time and time again with every little detail within every pixel. Bringing a new perspective of the battle with so many specs in every unit and actully listening to there community for the next patch to sustain smooth balance has truly showed off and will desemate nearly every other RTS when Red Dragon is complete.",
            "review_score": "1"
        },
        {
            "review_text": "'Smell that? You smell that?  Napalm, son. Nothing else in the world smells like that.  I love the smell of napalm in the morning. You know, one time we had a hill bombed, for 12 hours. When it was all over, I walked up. We didn't find one of 'em, not one stinkin' body. The smell, you know that gasoline smell, the whole hill. Smelled like... victory'",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: It could be the best real-time strategy game ever released, but it is just game which has so much lost potential.   So, what's the story. When you starting this game for the first time your reaction is 'Wow! A lot of units! A lot of paremeters! A lot of different armies!' Yeah, but... It is not super-realistic or thought-out game as it seems to be at the first glance. This game trying to be realistic sometimes, here is no tanks shooting each other on 30 meters like in CoH or whatever, but a lot of things are sacrificed to 'balance' and it doesn't make game balance better. If you think that you can get multiple different experiences playing different types of armies, you are wrong. There is a few optimal choices while most of armies unable to achieve anything but hurt you.   Eugen made the basic parts of the game long time ago. And they did really good job! But they stopped driving this game to make it better. Currently, only one guy is continuing to work on this game and oh man... that would be better if they stopped touching this game. That guy doesn't even play his game or play it very occasionally on very low level. It seems like once a quarter he's drinking something, opens excel file and doing balance changes randomly. Today german regular infantry dominate over against anything, tomorrow they are not even usable. Today Eastern Block and Commonwealth are the worst, tomorrow they are the best. Why? Because f*** you, players, that's why.   Pros - Unique gameplay; - Decent replayability; - Decent number of strategies and tactics (but it's gotten repetitive and formularic at this point); - Matchmaking and rating system for 1v1.  Cons - Poor support; - Poor balance (in multiple acpests, not just between Red and Blue forces); - A lot of mechanics that should be in the game are missing; - Lack of content (like online campaign, different game modes, different theatres, etc); - No map-generator or map-editor and existing maps are mediocre; - No matchmaking for team games + smallish community size = lobby sim; - Huge amount of minor faults (some of them are not very 'minor').  So, playing this game is a quite specific experience. It is fun to play through the first time and explore the game, but once you have gotten experienced enough there is nothing to catch up to here. It is too unfinished to play it competitively and too complicated and noob unfriendly to play it casually. I wouldn't recommend to waste your time on it.",
            "review_score": "-1"
        },
        {
            "review_text": "If you enjoy real time strategy games, as a commander looking from a top down point of view on a huge map, with cold-war era armies battling it out with each other with amazing firepower and awesome graphics, this is the game for you!  Before you start a (non-campaign) game, you have to create your own deck consisting of different units like infantry, tanks, vehicles, helicopters and jets. And in each category there are many choices of units, whether you prefer stronger but more expensive and in lesser amounts or weaker but cheaper and in higher quantity, and even the type of transports that infantry move around in, be it by helicopter or by apc/ifv. With the diversity that this game provides, you would never get tired of reediting your deck after every game to figure out the best combination for you, and that is one of my favourite parts of the game!  The gameplay itself is very good, and the AI is always challenging as they will have point advantages over you according to the difficulty you set of them, ensuring that you never get bored and have a challenge in every game. Gameplay is also not linear, there are many ways you can go about engaging your enemy, be it infantry hiding in buildings to ambush oncoming tanks, using tanks to make long range engagements, or even sending infantry in helicopter transports to make a sneak attack on the enemy base! The usage of jets is also very satisfying, something that you don't usually have in other rts games. The tactics you could use are limitless, it all comes down to your creativity! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Wargame: Red Dragon is hands down one of the best RTS games created in the past 10 years. If you have a decent graphics card you will notice images that will blow your mind. Zoom out to see the entire battlefield or zoom in to see the dense foilage and textures on groundhog level. The variety of units is undeniably spectacular and the gameplay is fantastic. I wish Eugen would have done a better job at marketing this game to the North American community; because I firmly believe that this would be one of the most popular games played today if they had. Constant updates and new units to keep the game fresh over time, there are really not enough good things to say about this game. Absolutley YES I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "One world to describe this game: Epic",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS games in years!",
            "review_score": "1"
        },
        {
            "review_text": "Great strategy game. love the online multiplayer. Geat game to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "- A great game. - Graphics and gameplay. - But very difficult.  10\\10  ",
            "review_score": "1"
        },
        {
            "review_text": "'The perfect amount of water.' -IGN 7.0/10  ----------------Serious review below---------------------  Graphics: 8/10 Although the graphics didn't change much from W:EE, it's still good to look at. Except when you bullet time and see the artillery shell.  Sound: 10/10 Sounds are A LOT better than W:EE, mainly because the 'BANG BANG BANG BANG' hammering sound has been swapped.  Gameplay: 9/10 Now THIS is what I call an RTS! The infantry AI prevented it from getting a 10/10, you must click several times to get them to move how you want  Overall: 9/10  TL;DR: (+)   - Graphics are good  - Low system requirements  - Gameplay is awesome   - A truckload of units  - Sound effects are great  - T̶h̶e̶ ̶p̶e̶r̶f̶e̶c̶t̶ ̶a̶m̶o̶u̶n̶t̶ ̶o̶f̶ ̶w̶a̶t̶e̶r̶ (-)   - AI = potato  - Artillery shells look horrible in bullet time  - Learning curve is a cliff  - Infantries teleport when they go to a building  - REDFOR navy is impossible to beat without spamming anti-ship planes  Would recommend to anyone looking for a good RTS.",
            "review_score": "1"
        },
        {
            "review_text": "A must-buy.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely unique product. There is basically nothing similar on the market. Of course there are some things which possibly could be done better in the game, but still, overall Wargame series provide great experience for players who want to take command in large scale modern battles with significant gameplay depth and some kind of 'realism' flavor.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game,  Now if only they would do a WW2 version or Vietnam version this sereies would be even better. It would finally replace the unballanced COH series and give us a realistic relm to fight in WW2. ",
            "review_score": "1"
        },
        {
            "review_text": "this game has basically taken over my life and i need to play it at least twice a day to stay happy. GOD HELP ME",
            "review_score": "1"
        },
        {
            "review_text": "Lobby Simulator 2015. Love it! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "day one: 'you are a noob' =you have been banned from this lobby= day two: ?? day three 'you are a pubstomper' =player has left=  but still, best wargame ever (for land, the ships are just for show)",
            "review_score": "1"
        },
        {
            "review_text": "Fun, somewhat informative about various coldwar militaries, but the AI cheats like a ♥♥♥♥♥♥♥ and your average online player is far far more skilled than you'd expect. I have been wrecked more times than I'd like to admit at this game.",
            "review_score": "1"
        },
        {
            "review_text": "A good addition to the series but a few flaws hold it back from being the crowning achievement it could have been.  Depending on the map played, sometimes the craters that appear from heavy shelling will appear to exist in a layer of dirt that exists a few feet below the transparent ground that used to be there before. Normally it isn't even noticable but if you zoom in a lot on areas that get heavily bombarded you will see problems. This was not a problem in ALB and hopefully might get patched in the next major update.  The game is the first in the series to let you set up AI players to use your own custom-made decks, which means you can create target-practice decks or simulate historical or hypothetical engagements (well... sort of, heh).  The addition of new units really changes the gameplay mechanics, as enemy AA defenses will rely far less on easily-vulnerable radar guidance systems. Also, although you get a few more units per card than in past titles, the maps are much larger and can really punish you for losing certain units. These arguments are all illustrated best in the AH-64D Longbow, which is the US's endgame glass cannon capable of turning a match completely around... or being a large waste of points never to return (you get 1 or 2 per deck, period).  A very fun title which is also relevant enough to get denial-of-service attacks from the North Koreans on a monthly basis. The game also automatically logs you into the chat room where you can see them taunt our capitalist way of life.  8.5/10  ",
            "review_score": "1"
        },
        {
            "review_text": "I have been having issues with this game, specifically with the move functionality; - in that it works only after installing the game! If i leave the game and then return to it, the mouse will only select the item and not move it! I use Windows 7, SP2.   I have de-installed twice and am now getting hacked off with it! What is going on????",
            "review_score": "1"
        },
        {
            "review_text": "It's airland battle with boats and north koreans. Also the ability to control time in single player.",
            "review_score": "1"
        },
        {
            "review_text": "A great addition to the Wargame series. If you're already a fan of previous games, I would reccomend purchasing this.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice game if you like multiplayer strategy with a hint of realism,The game is pretty slow and there are no bases but the combat is very tactical with thousands of units and tens of armies to choose from.Adds sea units to wargame so the game encompasses land,air and sea,pretty good if you ask me.Campaign much more challenging from the previous game and its very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Deep strategy that is relentless in making you pay for careless mistakes. It's both horrifying and at the same time, satisfying that you can lose/shoot down a $30 million aircraft in 8-15 seconds of actual combat.  Pros: +Lots of scope to field an army that best suits your playstyle.  Cons: -STEEP learning curve. Prepare to fail a lot before you get some success.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game overall,GREAT graphics,no glitches,lag,or any other problems. I highly recomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm digging this game so far. It's like total war and company of heros had a baby. A lot of folks are saying it is really hard, but it's not that hard if you setup a skirmish against an easy enemy and give yourself a hard or very hard ally on your team. ;) That's how I play most RTS games that allow you to have allies, until I figure out the units a little better. Graphics are nice, but the only thing I don't really like is that the infantry looks silly up close when they run around, like they are sliding on the ground. Just doesn't look that good, but most of the time you will be playing with the camera zoomed out far enough that they just look like little ants anyhow. Sound effects are nice too, love the sound of the bullets flying around in the game.",
            "review_score": "1"
        },
        {
            "review_text": "The new units, maps and nations are more than enough to make this a great addition to the series. Although the Naval addition is a total disaster, so don't buy it for that.",
            "review_score": "1"
        },
        {
            "review_text": "I love the Wargame series, Red Dragon is a really good conclusion to it. If you want a realistic RTS then this is the closest you'll get. None of that constructing factories bull ♥♥♥♥, it's all just managing your units and keeping them supplied. Also the game looks amazing, very sexy on a GTX780!",
            "review_score": "1"
        },
        {
            "review_text": "Bratte: Trust me they never rush middle Rubber: ok  2 minutes later you see 20 abrams, helis, AA and planes coming from middle ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely recommend this game! One of the best games ever released. Every battle is intense, no such thing as a boring match. No game is perfect, yet for all the tiny detials involved, it is amazing! Nothing compares to this game. No such thing as base building, it is straight up battles. Sound strategy plus good tactics are a most. Graphics are amazing. Gameplay, for all the units and all the details, amazing! I def consider myself a huge fan of the franchise and will keep supporting! One of the best game developers in that they follow through with their game, upgrading it constantly and making sure it is finely tuned. Unlike many other games, the newest released game is better than its predecesor. I rate this game as highly as AoE and Rome. Def recommend it and will continue to recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Multitasking Simulator 2014: Revenge of the Asians",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game...i would recommend this game to anyone who is into RTS Modernish Era gaming.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest modern RTS games of all time, far better than your average RTS. Features realistic combat between various units from Aircraft and Navies to Infantry and APCs. A small tactical mistake such as losing a strategic road intersection can cost you a battle. The game has a difficult learning curb but still is fun to play. Features every major Warsaw Pact and NATO nation such as ANZAC, UK, USA, USSR, West Germany, Japan, Both Koreas, China and several more nations. Each nation has at least 100-250 different units ranging between every kind of human technological innovation in the Cold War such as Jet Fighters, Anti-Aircraft, Modern Tanks, Rocket Artillery, and much more. The only thing this game needs is major Middle East nations that played a large role in the Cold War such as Iran, Iraq, Israel, Turkey, Syria, and Egypt. Otherwise, this game has over 2000 different units combined, intensely realistic combat, requires the player to make complicated tactical and strategic choices in both campaign, singleplayer, and multiplayer. One of the greatest RTS games of all time, if not the best. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "1500 hours on steam record, still discovering new units to use.",
            "review_score": "1"
        },
        {
            "review_text": "Takes time to get the hang of it and the controls, but once you do its one of the best games i have ever played. :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is one that is not going to be liked by all. If you've come here looking for a game like RUSE, look elsewhere.   Pros-  Massive scale Awesome Graphics Has a lot of playability Things can go sideways very fast Multiplayer can be challenging, but you can ge the hang of it eventually A few, but replayable campaigns Custom armies  Cons- There are NO hands on tutorials Infantry virtually useless This game WILL take hours to learn Sea combat is almost impossible to master  8.5/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with your friends. The ability to zoom out fully is really nice to have. Navy is fun but, it didn't seem to work out very well. Highly recommended to get this game even if you don't have friends you can just play by yourself with AIs or try a mutliplayer match.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game, an RTS that focuses on the S part for a change. No build orders, no base building, just using the map to advantage. Quite punishing until you get used to it, this is all about balanced forces and combined arms.",
            "review_score": "1"
        },
        {
            "review_text": "still one of my favorite game but i whish they would fix the ai 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A great game that requires in depth strategy and team work to succeed, my best moments come from when playing with friends but its great fun eitherway, my only criticism for this game would be that the out of lobby chat can become clustered with 'trolls' but this is a hard thing to control when the chat is set out like it is.  overall this is a terrific game which I recommend to all fans of rts. 5* .",
            "review_score": "1"
        },
        {
            "review_text": "This game have a steep learning curve. You need at least 100 playing hours to start familiar with the game mechanism and in-game units. But once you get into it, you will love it.",
            "review_score": "1"
        },
        {
            "review_text": "Wicked game with huge amounts of depth, and gameplay changes every single time I have played it.",
            "review_score": "1"
        },
        {
            "review_text": "2nd best RTS ever ! (1st = warcraft 3 everybody knows it.....)",
            "review_score": "1"
        },
        {
            "review_text": "Larger than normal learning curve but one of the best RTS games out there once you get used to it.    10/10 potatoes    ",
            "review_score": "1"
        },
        {
            "review_text": "Overall, one of the best games I have ever played..   I haven't played any multiplayer games yet. But seeing the videos online, playing against humans certainly is different than against the AI.   If want to play against the AI, you will find a mixed bag. Sometime the AI is simply overpowered and sometimes it's acceptable.   The game, just like any complex strategy game, requires a steep enjoyable learning curve but it is certainly worth it.   On the negative side, the game is better played in multiplayer which is a problem for people who doesn't have the time or friends interested.   The game could use some better terrains system. I can consider this as a future development.   I am looking forward to see the next iteration and I would like to see the following: 1. Better AI.  2. Better terrain system that can give more depth to the game.  3. Modding  4. Better campaign   If I choose only one thing to ask, it will be better terrain system, building to hide in, real towns and cities, ability to build ground defenses (mines, sand bags, camps and so), ability use the commandos and infantry in more deep way).   The game is really good in terms of weapons management and selection but the maps are not interactive.   Will definitely buy the next iteration.   Modding is what makes the PC games superior.   ",
            "review_score": "1"
        },
        {
            "review_text": "VERY good rts, and very fun, probably has steepist learning curve of most games except civ, you can't be a noob or you lose, and very realistic, and counters upon counters.",
            "review_score": "1"
        },
        {
            "review_text": "looked at chat realised it was hitler before he had an army 11/10 would get permanently scarred from wargame red dragon chat again",
            "review_score": "1"
        },
        {
            "review_text": "Great for multiplayer games only and forget the naval units: the game is better without them. It would be the perfect military sim if the single player part was better, especially the campaigns: due to weird and awkward design choices, and questionable AI. It is still a must for any true RTS wargame fan.   Add on 16th of July   Skirmish singleplayer mode is good with a challenging computer AI (cheating a bit...).",
            "review_score": "1"
        },
        {
            "review_text": "The Wargame series is a visually impressive quasi modern day RTS. The focus is on unit command instead of base building or economic development. I'm personally a fan of games that move away from the building RTS genre. Notable games such as the Ground Control and Total War series come to mind. If you enjoyed those games and also have an interest in modern day combat, I would highly recommend the Wargame series.   Specifically to Red Dragon, it is clear this is the latest iteration of the series as the amount of content is truly impressive. The multiplayer experience is excellent in custom created games, however it is lacking certain aspects. As opposed to AirLand Battle there is currently no co op campaign. There is also a fundamental flaw regarding skirmishes in multiplayer verse the AI, there is a high occurance of dsync.   If you enjoy regiment size or larger command games this game should be on your list.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Challenging but rewarding. Extremely detailed graphics and units. Red Dragon seamlessly integrates air and sea combat into the foundation laid by European Escalation. You will lose days of your life, because the game will engross you. Like, seriously, pack a lunch if you plan on playing a match, because it's going to last a while (I love that). The only Cold War force missing is Cuba, and knowing Eugen, it's probably in the works.  Cons: Lack of depth in naval units; the game only has twenty or so naval units out of maybe two or three hundred, but it leads you to believe there are more. Wish there was, frankly. There is a learning curve and it is steep; the game is unforgiving, and if you make a mistake you *will* pay for it. The game could use some video tutorials. As an addendum to that last, it's in game tutorials are woefully inadequate. There's a feeling that the developer expects you to muddle through, and this game is not forgiving enough for that. If Starcraft I/II are go fish, Red Dragon is a world championship chess match. Red Dragon is if anything more forgiving than it's predecessors, but it is definitely not easy to just pick up and play.  TL;DNR (?): This game isn't for everyone, but if you're looking for beautiful graphics, glorious depth, realism, and a challenge, I highly commend it. If you just want simple RTS to play casually, RUN AWAY FOR THE LOVE OF ALL THAT IS HOLY. That said? Omigyad I love this game. ",
            "review_score": "1"
        },
        {
            "review_text": "Wargame one of the best RTS games in the world with really good concept and really awesome game engine!!!  the wargame series going beter every new game Eugen Systems makes.  The third one the battlefield is on asia and it contains naval units and water type vehicle what give new tactical gameplay on the game.  This Game is Really fun to play with mp 10vs10 games with low recourse points. Its makes game go really intese!!  The game is litle bit hard to start because the game is 'cruel' I mean by this planes and choppers are really easy food for anti-air systems and you have to always remeber logistics!  But I still recomend this game to everyone who likes RTS! :)",
            "review_score": "1"
        },
        {
            "review_text": "Came for the Koreans, stayed for the global chat. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  Strategy 10/10 RTS 10/10 Military 10/10 Realistic 9/10 Multiplayer Hell Ya !",
            "review_score": "1"
        },
        {
            "review_text": "If you are an rts player like myself, this game is new, challenging, and extremly entertaining. Let me go a little bit more into detail.  Stuff you should know: No base building (not that type of game) Very strategic (requires real time decision making, plus longer strategic game plans) Has a large skill curve (if you're starting off, play with bots or a friend) Buuuuunch of units  This game is an amazing blend of tactical combat and strategic planning, with different units fufilling very different roles. All in all, this game will punish your mistakes, and reward your successes.  Before you buy Watch a match of the wargame red dragon reddit tournament to see how the game is played, and judge for yourself if this is for you. I strongly recommend this game, as it has brought me countless hours of memorable fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you are an rts player like myself, this game is new, challenging, and extremly entertaining. Let me go a little bit more into detail.  Stuff you should know: No base building (not that type of game) Very strategic (requires real time decision making, plus longer strategic game plans) Has a large skill curve (if you're starting off, play with bots or a friend) Buuuuunch of units  This game is an amazing blend of tactical combat and strategic planning, with different units fufilling very different roles. All in all, this game will punish your mistakes, and reward your successes.  Before you buy Watch a match of the wargame red dragon reddit tournament to see how the game is played, and judge for yourself if this is for you. I strongly recommend this game, as it has brought me countless hours of memorable fun.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is what World in Conflict should have been.  It has a great amount of realism and unit deploying customization.  It requeries a good basic knownledge of belic equipments to avoid being crushed in MP everytime.  Top 1 war game recommended for those who seeks realism and strategy.  This is really a MUST HAVE game in your library",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best RTS ever made. Buy this.",
            "review_score": "1"
        },
        {
            "review_text": "great RTS the game the games has incrdibal graphics and is a lot of fun from fighting at sea to blowing up land units with jets",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME FOR SINGLE PLAYER, the AI difficulty is ridiculous. Instead of each difficulty changing the way the AI chooses its tactical decisions, it gives the AI MASSIVE discounts on its units, effectively turning any match into a 1 unit type spam fest. Every time I try to play, no matter what tactics I use, whether it be a tank blitzkrieg or a guerilla war, the results are always the same: the sky is blackened by the sight of dozens of attack choppers, or an entire wall of tanks. The AI makes very little tactical plays and relies on simply zerging you down by out-pacing you with units to an ungodly level. I've played the multiplayer and this doesn't seem to be an issue and focuses on strategy, rather than the bologna that is its single-player.",
            "review_score": "-1"
        },
        {
            "review_text": "As a true fan of strategy games since my childhood, I thought that this genre is abandoned by all its glory, untill I found Wargame series. Developers are even getting better with each game. WARNING : CONTAINS RTS EPICNESS  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Are you a cold war alternate history circlejerker? Yes? Buy this game. Are you interested in war porn? Yes? Buy this game. Are you an autist? Yes? Buy this game.  Also: Torille  Post Scriptum never play the naval mode, it sucks.",
            "review_score": "1"
        },
        {
            "review_text": "shweet",
            "review_score": "1"
        },
        {
            "review_text": "Great modern-military RTS",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS there is. You dont have to be a military geek for this but it helps. Protipp: Try to ignore the Wargame Chat",
            "review_score": "1"
        },
        {
            "review_text": "Love this game I don tget the full expericae as i play on my normal 'office' style laptop still have lots of fun though",
            "review_score": "1"
        },
        {
            "review_text": "Has fagots as playable units. 9/10 needs another 'g'.",
            "review_score": "1"
        },
        {
            "review_text": "This is an AMAZONG RTS.  And i plan on spending countless hours on it. BUT In its current version, there could be some ironging out. there are occasional shader bugs which me and my friends have experienced. as well as RARE crashing. And units could be more balanced. All this being said, i love it. So why not get it early? ",
            "review_score": "1"
        },
        {
            "review_text": "not happy i payed for the game and its no longer working ffs",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great, perfect for anyone who likes RTS games. I found it a little diffucult to get in at first, as there is so much to manage, but when you get a basic grasp of the game it becomes really fun. The naval side of it could use some work, but other than that, this game is amazing. If you don't have AA defending, let's say, AT infantry, then that AT infantry is probably dead. It all comes together into an amzing blend of strategy, cooperation, and the feel you get when there are a thousand untis on the field under your command!",
            "review_score": "1"
        },
        {
            "review_text": "The best RTS game I have played probably ever! A complete experience that does not lack in any area. Pretty much a must buy for RTS lovers",
            "review_score": "1"
        },
        {
            "review_text": "As someone who plays the SP side only, I'm actually enjoying WRD more than I'd expected. Having entirely new armies (North Korea, South Korea, China, Japan, ANZAC) is fun. I'd previously heard of the Type 59, the J7, the Korean K1, etc but never really understood what they were until having to lead or fight them in the campaigns.   The campaigns themselves are a pleasant surprise. There are a few mechanics I miss from WALB, but overall, the new organization around companies &amp; battalions leads to a much wider variety of tactical situations than WALB. I've had some surprisingly interesting battles where I'm fighting with scraps of different formations and having to put together a novel tactical solution.  Far and away the best part of WRD is the variable speed. While I eventually came to love WALB, the sheer franticness of the battles meant that I nearly always had to rely on setting up a defense and waiting for the AI to bash into me, since the AI could outmicro me in defending against my attacks (optimizing AH and ATGM ranges while simultaneously dropping mortars AND calling in CAS strikes :&lt;). With the new bullet time feature, I'm finally able to enjoy employing real tactics, and I can finally get down to ground level and enjoy the phenomenally beautiful engine. There have been some amazing scenes that I always missed in WALB since I needed to stay high to monitor the entire board.   One downside is that the campaign map seems less well thought-out than WALB. It's often unclear what you can and cannot do, and when you can't do an action (e.g. Assign a squadron to a new airbase), there's no explanation why. I miss the 'cards' you could play in WALB around the actual movement of formations, such as aerial recon, commando raids, naval strikes etc. The ideal Wargame would blend the new mix-and-match formation system with the strategic actions and UI clarity from WALB.   The only other downside is that the AI seems to rely more on bull-rushing you with everything it has right at the start of every match. My recollection is that WALB had a little more variety in how the AI would respond. This may well be because they've removed some of the worst features of the 'all-seeing' AI from WALB (thank you!), and without that omniscient vision, a full on rush is the only tactic remaining? Still, it's early in WRD's evolution, and hopefully the AI will gain some more variability as the game matures.   So overall highly recommended. There are one or two steps back from WALB, but also some real advances and I'm greatly enjoying my time with the campaigns.",
            "review_score": "1"
        },
        {
            "review_text": "I've always been a big fan of RTS games, with Command and Conquer: Tiberian Sun being my first 'real' game that I ever played.   I've found each of the Wargame series to be fantastic, with wonderful graphics, highly customizable armies, and a wide range of terrain with which to fight upon, with each of these variables increasing with the next game.  Read Dragon in particular is a great addition to the series, introducing naval combat, along with many new nations' units to use.  I'd give the series overall a 8.5/10, and Red Dragon specifically 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good i wish i could marry it. Seriously.  Based Eugen.",
            "review_score": "1"
        },
        {
            "review_text": "It's a hard to game learn but a very good RTS.",
            "review_score": "1"
        },
        {
            "review_text": "The community is pretty ♥♥♥♥♥♥ and i always end up in multiplayer games where everyone leaves the second 1 of their units gets destroyed, which results in my team (or should i say; just me) being completely roflstomped to death. Haven't had 1 memorable multiplayer game that was actually fun.  Also chat should be avoided unless you like to partake in an ever ongoing discussion about which is the better country.  So yea, the game is pretty good though. But if you plan on getting it, make sure you got some friends who play with you. or play against bots. (they are actually pretty good)  I can't really tell a lot about the campaign, haven't had a in-depth look at it yet, but i know it is hard as hell.",
            "review_score": "1"
        },
        {
            "review_text": "you get the play as North Korea and blow things up 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely Exceptional Real Time Strategy Game. Would recommend to anybody who wants to get lost in a world of complex mechanics and thrilling action.",
            "review_score": "1"
        },
        {
            "review_text": "TLDR; Good idea, poor executuion.   Micromanagement is a mess, no match making, unit stats and unit exclusions are inconsistent ,engine is overly simplistic and won't be improved, comunity management=censorship and now the game is turning into a pay2win game.",
            "review_score": "-1"
        },
        {
            "review_text": "very worth to try",
            "review_score": "1"
        },
        {
            "review_text": "Just the absolute BEST strategy game i've played in a good long time. absolutely one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "This game is on par with games like Arma 3 in terms of content and graphics. Even thought it's still in beta, it's well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "How do I play this?",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS war type strategy game out there. I also love Men of War Assault Squad 2, but this is just so much more polished and professional where MoWAS2 is very unpolished. Anyway, this is a great game, and I would recommend it to anyone who likes military type games and RTS.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, so for the best RTS I have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "best RTS ever, a must have tittle.",
            "review_score": "1"
        },
        {
            "review_text": "The best RTS game in recent 3 years!",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of the wargame series I highly recommend this game. It is unique, difficult to master, has lots of maps and units, and unlike most games these days has a great single player setup as well as a great multiplayer experience.",
            "review_score": "1"
        },
        {
            "review_text": "Only the first day of beta, played a handfull of matches and imo its so much better than Wargame: Airland Battle, not to mention I have spent hours all ready druleing over all the new and old units, and new and old weapon loadouts for the units, I cant wait to get some decks built and get into battle!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you like military simulation, strategy, or having your commanding skills put to the test then I highly suggest Wargame: Red Dragon. Be prepared to have to precariously balance your offense and defense to overcome your enemy with land, air, and sea. Don't expect to have your hand held. You either win or you watch your military crumble against the onslaught of arty, air support, tank platoons, and infantry companies. When you win though, you know you damn well earned it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I've played that I've been really, really conflicted about.  Pros: Graphically impressive, very complex tactics, amazing level of detail in unit design (including visibility, perception, armor, range, damage, etc. etc.). Probably the closest thing to real-time realism on the market right now.  Cons: Extremely steep learning curve, zillions of units and game mechanics to learn, and the developers didn't support it with a tutorial. The fan community has brought up various resources to help, but general feeling is that to get a proper designer tutorial, you'll be looking at buying the first game, European Escalation.  The game is very complex, which means it'll take time even for those familiar with the older games in the series to pick it up. (First game EE was purely land, second game AirLand Battle introduced aircraft, this game introduces naval units.)  I'm fairly experienced with other historical RTSes (although none are as realistic as this one) and I found the learning curve for RD unworkable with the limited time available to me. I put eight hours in-game, trying out guides and putting what I'd learned from fan manuals into practice: my victory or defeat still feels entirely arbitrary. [Update: this is because the guides deal with playing against humans, but the AI uses several pathfinding shortcuts which give it several important differences from human performance - it has omniscient line-of-sight so concealment doesn't work against it, and it has 'human wave' mentality for dealing with chokepoints.]  The fan community has been great, and if you have a lot of time and attention to put into this game, it may be the game for you. Likewise, if you don't mind buying the first game and working through that as a prelude to playing this one. Folks who find analysis to be fun in its own right, or who are detail oriented, may enjoy this game too.  I found the time demands of learning the game to be too heavy. I disapprove of the designer's decision to essentially shortchange new players by removing the tutorial on the assumption that they'll have played the prior games. The fan support is very heartening, but it seems to reinforce the designer's laziness so they can get away with it. The designer should include solo-play tutorial support in ALL titles in the series, not just the first few titles. This sales model of 'expecting people to buy your earlier games before they can play your later games' was already proven unworkable with the Wizardry series way back in the 1980s. Eugen should know better.  There's all the hallmarks of a good game in here, provided you can devote the very significant time and focus requirements to crack the shell, either by doing online mentorship with the fans, or by buying the previous titles in the series. However, in all honesty, it didn't work out for me and I couldn't recommend it in good conscience.",
            "review_score": "-1"
        },
        {
            "review_text": "what do i do if it wont wont load up after it says 'prerying game'. i already tried doing what it says in the support forms and all.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;play as Soviets &gt;buy 4 T-34s &gt;they ambush a M1a2 &gt;they kill that capitalist piece of ♥♥♥♥ &gt;Operationissuccesfull.jpeg &gt;tfw HATO tears &gt;10/10",
            "review_score": "1"
        },
        {
            "review_text": "Just avoid, horribly unbalanced, the AI cheats heavily on the easiest setting, and the always on chat is extremely toxic.  The AI has infinite points/ammo/fuel they can see hidden units, their normal non AA tanks can attack aircraft yet yours cannot.   The visibility for planes/helicopters that are non recons is awful considering how far they should be able to see.  Due to seeing everything, the AI will launch artillery on your command vehicle or destroy your flanking tanks with a single plane, while yours barely scratches theirs.  Something that helps in a RTS is flanking, but the AI sees everything so flanking is impossible, they'll just see you coming and kill you from a distance.  The only AI weakspot is infantry in buildings where they die in vast numbers trying to kill your infantry with tanks.  They get no penalty for moving through rough terrain while yours do.  Multiplayer results in rushes or cheap tactics with sore losers and a toxic community behind it.  The beginning campaign is not at all beginner level, the autowin is unrealistic with its expectations of your forces.  Avoid unless you like a smashed keyboard, as this WILL result in one.",
            "review_score": "-1"
        },
        {
            "review_text": "It IS fun. BUT horribly confusing, Should have made an interactive tutorial rather than confusing tutorials you have to read",
            "review_score": "1"
        },
        {
            "review_text": "Difficult learning curve. With time and effort a very fun game! Youtube videos by Stealth17 a great help!",
            "review_score": "1"
        },
        {
            "review_text": "like this for it to be out for mac",
            "review_score": "1"
        },
        {
            "review_text": "Blufor players are absolute p u s s i e s and will quit at the first sign of trouble, leaving you their half-dead armies for a complete loss.  Otherwise, pretty good.  But really, the game has such massive attention to detail and vast depth that it feels extremely cheap when the experience gets hobbled by fatalistic players. If you're a fan of Cold War military hardware or Tom Clany novels (Red Storm Rising) you'll definitely have fun customizing decks of units with hundreds to choose from, adapting them to your own play-style.  Learning Curve = BRUTAL You have been warned.",
            "review_score": "1"
        },
        {
            "review_text": "a great game but you need to be good at tactics and army",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutley Epic in both scale and detail. A true 9.5 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Fun but becomes stale very quickly. Generally disappointing release plagued with unbalanced units and factions. Heavy detraction from 'authenticity' and historical theme of the series. This game does not do justice to the two other Wargames that preceeded it.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome, awesome game.   This game really surprised me. The real appeal of it is in the multiplayer. The game the closest to it would be World in Conflict, but still It's very different from what I have ever played before. A bonus to it is that the cold war era setting is kind of rare in video games. It has some downsides but they are all forgivable.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS I have ever played. If you are interested in destruction, realism, strategy and modern warfare this game is for you! More improvements and more features added which are amazing. Even if it's just beta. :)",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy game i have ever played and is brilliant game to play with all the different units and countries. Defenality reccomed it ",
            "review_score": "1"
        },
        {
            "review_text": "Builds well on previous two titles. I really enjoy this kind of realistic RTS format. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "it's really cool",
            "review_score": "1"
        },
        {
            "review_text": "I have followed this series since the first one and it has steadily matured without loosing itself in the growth, the addition of Aus (Being both Australian and additional factors) is both a welcome and long awaited change  further the commonwealth red and blue dragons etc. are also good additions giving flexability to the way you can play from the old versions.   if you ever wanted to have a taste at what it would be like to actually command forces in a realistic environment this is the closest thing i have seen yet to the real deal, at least short of joining the army and spending the 20 years on your career to reach brigadier +",
            "review_score": "1"
        },
        {
            "review_text": "1. oh, a battle sim. Gonna be awesome. 2. ok, just gonna try a small skirmish, small map, 10 minutes, how hard can it be? 3. Proceed to GET ♥♥♥ KICKED! 4. Repeat 2 until honor is regained. 5. Walk tall (probably never).",
            "review_score": "1"
        },
        {
            "review_text": "If, like me, you've always wondered if the F-15's perfect combat record is more of a product of its design or an indicator of the quality of the opposition it's been up against... if, like me, the thought of a horde of WW II era T-34 main battle tanks rushing a state-of-the-art Leopard 2A5 in a desperate attempt to land a lucky shot on its vulnerable rear armor makes you a little bit giddy... if, like me, a modern warfare RTS that models ammunition, fuel, and morale and supports up to 20 players in multiplayer each of which can specialize in roles from air support to infantry to artillery or any combination thereof sounds like the game you've waited your whole life to play: buy this game.  Just be aware that the community is small and always will be on account of the niche target audience of the game, and that for some reason the preferred gametype is a sitzkrieg-inducing extremely campy team deathmatch mode where artillery sniping usually carries the day. Don't let that get to you though. The fun in this game is seeing cool military hardware in action, it's not the best competitive RTS on the market.  And let us not speak of the toxic chat community. As that would be giving them exactly what they want.",
            "review_score": "1"
        },
        {
            "review_text": "best cold war game",
            "review_score": "1"
        },
        {
            "review_text": "I can't change my language setting to English. Can anyone tell me why?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just... amazing. There is a strategic map where you can move units to and from sectors to reinforce the front! That is something I just have not seen! This game is very bold, and just... overall a great game! I would reccomend this for weekend nights so you have time to play and really, emmerse yourself into the game for the best experience.",
            "review_score": "1"
        },
        {
            "review_text": "Do you know what will Help you win a battle in this game?  .  .  .  .  .  .  .  Your Brain!",
            "review_score": "1"
        },
        {
            "review_text": "No red dragons.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best RTS in the last five years!",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun, but irritating as all hell as if i play it it will invariably freeze, then once i force close it, steam still thinks it to be running and prevents me from doing anything until i 'close wargame red dragon' which, i had already force closed and is no longer running, again very fun to play, but not worth a hard restart every time i try to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Very Good war strategy !",
            "review_score": "1"
        },
        {
            "review_text": "it is what I call fun.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I have played EVER besides Anno 1602",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game with 2 ways to play it. 1) go all out. Figure out the optimal deck, select the nations with the best overall chances of wining and master mind the game (Duh). 2) Just go in to appreciate the detail and thought placed into the way the game plays out. You probably wont win much but you will have a hell of a time just participating. Yes there are balance issues but isnt that true of the world we live in. I know most gamers dont appreciate that but a valid argument could be made that this just makes the game all the more immersive. I have been on the losing side of a steam role in which the enemy units far over powered my units. I approached it as if I were playing as a rag tag coalition of worn out and over worked units.",
            "review_score": "1"
        },
        {
            "review_text": "Fantasic game, takes a while to get to grips with all the units and gameplay. However once mastered you will be highly addicted! Brilliant graphics, brilliant gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of rts. and i got to say i didnt like it. i dont like how ammo is. air is over powered. and theirs not that much when it comes to sea battles.",
            "review_score": "-1"
        },
        {
            "review_text": "A truly epic RTS",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game! Long time player of the series. Cannot recommend it enough! Long time player of entire series. The campaigns are a blast. Best Military rts/strategy game out there in terms of combining big and small picture. Love it! Eugen please Wargame 4 next!",
            "review_score": "1"
        },
        {
            "review_text": "I would definitely recommend this game to anyone who enjoys RTS games. It may take a while to get your head around everything in the game, but once you know how everything works it is great fun and easily takes up all your free time.",
            "review_score": "1"
        },
        {
            "review_text": "great game very realistic. extremely competitive multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "North korea is best korea except when they fight the USA +1",
            "review_score": "1"
        },
        {
            "review_text": "-community",
            "review_score": "1"
        },
        {
            "review_text": "pros:  fun, cold war is neat, low on micro managament, more about tactics, naval combat is fun to look at and adds a nice element to multiplayer. cons:  french bias, more hidden infantry than vietnam, tonks are pretty useless outside certain situations, french artillery is way 2 good, naval combat seems to boil down to who has more ships/planes, french bias.  I'd definitely recommend the game, but I'd wait until a sale if you're on the fence about it.",
            "review_score": "1"
        },
        {
            "review_text": "THE best RTS on the market if you are looking for Modern Warfare.  ",
            "review_score": "1"
        },
        {
            "review_text": "A must have RTS game. 10/10.   Both challanging and exhilarating, Red Dragon is by far the best RTS and Wargame title I have ever played. The amount of detail put into each unit and campaign is just awesome.   Free DLC and a nice community makes it worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "pros:  fun, cold war is neat, low on micro managament, more about tactics, naval combat is fun to look at and adds a nice element to multiplayer. cons:  french bias, more hidden infantry than vietnam, tonks are pretty useless outside certain situations, french artillery is way 2 good, naval combat seems to boil down to who has more ships/planes, french bias.  I'd definitely recommend the game, but I'd wait until a sale if you're on the fence about it.",
            "review_score": "1"
        },
        {
            "review_text": "THE best RTS on the market if you are looking for Modern Warfare.  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing what if strategy game that puts together over 1400 cold war units into one big war. Giant maps for you to truly immerse yourself in. Supports up to 20 players in epic 10 v 10 matches.",
            "review_score": "1"
        },
        {
            "review_text": "You can love it or hate it. Love Real Time Strategy? Buy it NOW...NO excuses. First person shooter or Turn Based Strategy? You'll get frustrated to no end. Been playing since the beginning of the series and I am a proud owner of each game. Wargame: European Escalation, Wargame: Airland Battle, and Wargame: Red Dragon are just simply the best modern RTS and has no competition. With satellite view straight down to bolts of a tank, the wargame series' focus on beautiful graphics aside from the truely inspiring game mechanics is what makes this series the best. The new Navy aspect introduced in Red Dragon gives endless options to attack the opposing enemy, but don't think the Navy will save you in every battle. You have the power to do whatever you want. Thinking from different perspectives during battle is what leads to victory. You got to love having a fresh experience each battle, and then replay the video capture to look at your mistakes and successes all while enjoy how beautiful the battle looks.  This series keeps geting better with each year. W:EE - infantry,tanks, helocopters, and artillery. W:AB - intro to Airplanes. W:RD - intro to the Navy. Who knows what lies next. Do you have to buy all the games in the series? No, each new game adds to the old one and you don't miss anything jumping straight to Red Dragon. Its in the Cold War times and what could have happened. They keep adding to the game as the timeline gets closer to the 1990s which means bigger badder units and more choices. More opportunities.  What are you waiting for? This is the best RTS on the market to date. If you think you are the best at conquering in Civ 5 then just try Wargame. No more thinking for 10 mins about moving to one space (which the campaign will cover that for those who like that) etc. Wargame is quick and new each time you go to a battle. You got to be quick, thoughtful, and strategic in Wargame battles. Time to play a real wargame. Wargame: Red Dragon",
            "review_score": "1"
        },
        {
            "review_text": "Wargame: Red Dragon is hands down the best strategy game out today. The maps are challenging, and interesting. There are over 1000 diffrent units to fight with. Each unit having real world statistics, and loadouts. Single player campaign is a challenge. But, the multiplayer is where this game truely shines.  Multiplayer server settings are customizable which makes for very interesting battles. Going from a 2 vs 2, to an all out 10 vs 10, is jaw dropping. I am a huge fan of the series, and I highly recommend checking it out. There is a VERY steep learning curve, so be patient.  The best part of this game, is watching Starcraft players get stomped because Zerging doesnt work in the real world.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game (even in Beta - though there are still some balancing issues to be worked out). The wargame franchise really is the new standard for RTS games, but it can take a while to get a handle of the game mechanics. I really recommend this for anyone who is interested in a modern RTS. No need to worry about base building, the game is purely about combined arms combat.",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece of RTS. A must for armchair generals.",
            "review_score": "1"
        },
        {
            "review_text": "I have enjoyed this series. I have played RTS style games for as long as there has been computers able to play them. I haven't played the beta much but what I have played I really like.",
            "review_score": "1"
        },
        {
            "review_text": "A further progress of their previous titel. Wargame has without any doubt the best tactical battlefield simulator for modern day units. There are hardly any flaws I could detect. If the campaign could be extended to the world map instead of (time limited) theatres and some economy and diplomacy would be added it could become a grand strategy game and Wargame could be a Total War in the modern era. A turn based strategic/real time tactical WWII version would also be possible with this great Iriszoom engine. This game is already maginificent and has still a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, cancer community",
            "review_score": "1"
        },
        {
            "review_text": "This game can be brilliant - the tactical thinking required puts it way beyond most other modern RTS games - the graphics are great, the units are varied and 'real' and the campaigns are stretching and a brilliant mix between semi-strategic and full tactical. I love it and I've found myself going back to the campaigns again and again to try out different strategic plans and battlegroup / company / battalion combinations. Would I recommend it? NO It is mainly a multiplayer game, this is fine, it has a strong multiplayer community - all the wargames have had this, but there is no multiplayer campaign - which makes this a multiplayer skirmish game with a limited single payer bolt on - a wasted opportunity, and my advice would be don't waste your time. Particularly as, at the point of both pre-purchase and full publication the Eugen website was advertising this game as having a multiplayer campaign - either an honest mistake or a strong indication that something went very wrong in development. I won't be purchasing any more Eugen products unless full multi campaigns are an option. Don't bother with it unless all you want is sup com style skirmishing - otherwise buy Wargame Airland Battle - it's cheaper and has a multi campaign option, though it isn't quite as good. Eugen , you really missed a trick there.",
            "review_score": "-1"
        },
        {
            "review_text": "If you get this game thinking it's the successor to R.U.S.E. you will be very disappointed. They are absolutely nothing alike. Be ready to spend several hours searching the internet to try and figure out how to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I play as JSDF and pretend I'm fighting Godzilla. 10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a gem, a masterpiece. Eugen has fine-tuned every title in this serie, and in this the latest one put themselves in the absolute frontline of realistic RTS games. This is a deep game, with a massive amount of real world unit types which allows you to build your own combined force. The game mechanics are quite easy to learn but hard to master, but the pure amount of statistics of every single unit means you have to put in a great amount of time to learn how to use each unit the best way possible. You have to concentrate on your strategy and mastering the use of different unit combinations for the given situation and be prepared of your opponents units and how to counter them. The campaigns are not the strenght here, but the multiplayer are, and it is excellent. Eugen is continously and often updating the game and tweaking/correcting units, game balance etc to fine-tune the game according to the players response. DLC´s with new countries are continously beeing released. Prepare to loose sleep. The more you put into this game, the more it gives you back. It is timeless in many aspects.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game, it's a terrible buggy mess.",
            "review_score": "1"
        },
        {
            "review_text": "The game is quite good and has very interesting games. Although, you do get elitists who think they know everything about warfare and will destroy you with words if you make a mistake. The worse thing though is that a few people get problems with Eugenes servers, we also get disconnected mid game. This really needs to be fixed and the problem is caused by Eugenes servers.",
            "review_score": "-1"
        },
        {
            "review_text": "Now that this game is out people really should buy it. Mostly if you were a fan of any of the other wargames this would be a 10/10 for you.",
            "review_score": "1"
        },
        {
            "review_text": "Don't get it, somehow i always fail at doing everything in this game... but it looks very good and maybe i've to learn it",
            "review_score": "-1"
        },
        {
            "review_text": "Wargame: Red dragon is possibly one of the most epic In depth Stratagy games, that still feels like a game, ever made on planet earth. Being able to Create your own armies and then pit them against on another with real world tech etc, makes for some GREAT conversations and ENDLESS possible strats. This game is ♥♥♥♥ing awesome, whoever doesnt like it probably just sucks at it. This game is Unforgiving, and VERY competitive.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! No words can really be put here to show how awesome it is!",
            "review_score": "1"
        },
        {
            "review_text": "Great game GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "rubbish boring game",
            "review_score": "-1"
        },
        {
            "review_text": "More complex than your casual Strategy Game and way more fun than your casual simulation. Awesome game, with interesting and good game-mechanics and lot of fun in the Multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "get the ♥♥♥♥ing game already",
            "review_score": "1"
        },
        {
            "review_text": "buy this game, play this game, and I'm falling in this game.",
            "review_score": "1"
        },
        {
            "review_text": "It can be a little confusing at first but watch a few youtube videos, play a few bots with some new decks and just jump right in.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for an in-depth, tactical, beautiful, modern, and realistic military RTS, then this perfectly fits the job description.",
            "review_score": "1"
        },
        {
            "review_text": "She's a good one",
            "review_score": "1"
        },
        {
            "review_text": "CAUTION: I strongly recommend this game, but I give it a thumbs down as I am writing here about the flaws which should be known to be able to enjoy it - I hope the devs will notice, too.   'Wargame: Red Dragon' is the best 'Wargame' so far and the only somehow realistic RTS game out there.  Enough is written about the awesome parts, so I will mention here what I dislike about it.  The micromanagement is not well done, other games make it significantly more comfortable to manage your units.  The AI is not very good and so if you are not very good at giving your troops really idiot-proof orders, they will get themselves killed easily.  The great 3D terrain is hard to estimate regarding its angles, so you often have the problem that in mountain or hill areas your troops cannot see or shoot the enemy as they are aiming too high or low.  The more you zoom out, the less precise is the information about where your units are standing. The overview is bad.  There is no playable tutorial to prepare you for all this, so yeah, you will lose a LOT of units and you will lose a LOT of matches against AI or humans until you find out how everything works.  The devs should really work on fixing the problems mentioned above or consider them in their next 'Wargame' - it should be more accessible and more comfortable to play, and you should be able to select an AI strategy for your individual units or groups of units so that they can work more autonomously.   Ah, and the naval combat is still bad. It is overpowered and already during the creation of your deck it just feels wrong. You can build a nation-limited deck, e.g. France, and then still add U.S. anti-ship planes or a Japanese Warship for naval combat? This doesn't fit to the rest. And if you already have naval combat, then please, add submarines, too!   So much about the gameplay. Technically, the game is really beautiful. The graphics are nice and the engine is really well-optimized (runs perfectly smooth on any system), and I didn't notice any bugs.  The only thing that is really missing is a better campaign. The game has in theory so much potential to make you feel connected to your troops as every solider even has his own name - so why is there no dramatic story to be told? Instead you play kind of chess, read some text messages and fight random matches against the not-so-bright but at the same time overpowered AI. Quite a disappointment compared to many other RTS gems out there. A scripted campaign to teach you how the game mechanics work (e.g. the campaigns in Blizzard's strategy games) so that you have at least a little chance to survive in multiplayer would be far better.   It is hard to give this game a kinda objective rating as there are no competitors. It somehow has the same problem as the ArmA series - they are ambitious games trying to show a quite realistic approach to warfare, they have significant flaws, but at the same time they have no competitors.  CONS: Bad AI, bad micromanagement, very bad UI (wrong unit position indications really, really suck!), imbalanced naval combat, disappointing campaign.  PROS: Sweet engine, great multiplayer, huge variety of nations and units, deck making is fun, endless tactical possibilities and matches with your friends or against them are some of the best ever seen in RTS games.  I'd rate this 7/10   + 1 point for long-time motivation thanks to awesome multiplayer, map packs and nation packs + 1 point for not having any serious competitors and therefore strongly enriching the RTS genre  equals 9/10.  Now go out there, buy it, lose dozens of matches, get frustrated as ♥♥♥♥, try hard and be victorious in the end.",
            "review_score": "-1"
        },
        {
            "review_text": "I suck.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Developer Eugen takes the RTS genre to a cold war gone hot. Gone is the concept of base building, and resource management. WG:RD introduces players to a realistic RTS unlike anything seen before. No longer will players contend with Actions Per Minute, but rather with tactics, units, and teamwork.   With a blistering amount of units (1500+) they've managed to capture the most minute, and accurate features of nearly every unit. Players will find themselves lost in the sheer number of statiscal difference while attempting to create the perfect army. The complex task of 'deck building' becomes simplifed by a restrictions and bonuses. The more you limit your military the more you have available.   Graphically speaking WG:RD shines above almost all RTSs on the market. With almost painstaking authentic detail to units it's a shame to realize they are only utulized when fully zoomed in. The games scale makes it impractical to play any attention more than what's needed.   Although WG:RD is a shining example of the RTS genere; it does fall short with it's limited maps, and often sidelined naval battles. You'll easily find yourself playing the same maps time after time. Not necessarily a bad thing when you have 17 nations to choose from, and more FREE DLC along the way  Wargame: Red Dragon is an armchair generals dream. Pick it up today.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion its the best Wargame till now (what ive seen and played so far in Beta). It feels again like EE with the best parts ALB in it. Of course there are still some bugs and balancing stuff in it, but after all it feels really great to play. So if you liked EE a lot and also ALB you will not regret this buy! Hopefully this game will attract a lot of people and maybe we see us on the Battlefield ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game is not good not bad But I prefer to click on no because it does not have good garaphic .",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible Game. Just so you guys know, theres no like flying aiplanes and drving tanks. It sucks. Nothing fun about it. Dont waste your money like I did.",
            "review_score": "-1"
        },
        {
            "review_text": "Bombers and Artillery.",
            "review_score": "1"
        },
        {
            "review_text": "The game has a wacky serial key system. Dont ♥♥♥♥ up, or you wont be able to play online or with friends.",
            "review_score": "-1"
        },
        {
            "review_text": "cant even start the game up.. idk why (someon help) ",
            "review_score": "-1"
        },
        {
            "review_text": "One of many purchases that I regret.  Bought it on sale for like $10 and find it really boring and confusing.  To even play this singleplayer game you need to create an account.  Terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Very tactical. Much units. Such boats. Wow. ",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks...The only good part is the movie at the beginning. poor stories, poor control, poor strategy...even it's 75% off, it's still sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Needs some more balance which will come with Eugen sooner than later, but better than Airland Battle in almost every way.",
            "review_score": "1"
        },
        {
            "review_text": "too ♥♥♥♥ing hard",
            "review_score": "-1"
        },
        {
            "review_text": "It's not fun at all. Piece of crap",
            "review_score": "-1"
        },
        {
            "review_text": "Ugly game, unreal air combat, misslile distance is cutted, airplanes altitude is too low, infantry is able to hit F117 with ZRK",
            "review_score": "-1"
        },
        {
            "review_text": "If you came from Warcraft,SC2,Total War,AoE2,AoM,CnC or other rts, you gonna have a bad time",
            "review_score": "-1"
        },
        {
            "review_text": "  I decided to play Wargame: Red Dragon last week for the first time in awhile.  The first thing I did was check the credits for a pseudonym I used while doing what pretty much amounted to unpaid, outside consulting &amp; testing for Eugen. I noticed it was removed.  At first I was, understandably, fairly upset by this. I realize that some of the people who Eugen gave their special thanks to ended up coming around to bite them, but really, I'd done no such thing. I had had my disagreements with their choices on several occasions, but their choices were their choices. If it ruined the game I enjoyed, so be it.  And then, I actually sat down and played a few real matches. The best way to describe the way the matches felt was helplessness. I was doing absolutely nothing wrong in terms of my strategy or tactics, but I was unable to successfully grab any ground or maintain a foothold, yet fundamentally, in my experience, I knew I was doing very little wrong, and indeed, because of that, though I had no real front, I was often able to withstand more than I reasonably should have despite being at a significant disadvantage.  It was at this point that I no longer felt like I had been slighted by Eugen for removing the evidence of my involvement, because I accepted that even since the last time I played this game, nothing had truly been fixed. All they have done is play with numbers, but nothing has been done to fix the core problem of what Wargame is. In many ways, things were in a signifcantly worse place than where I left them, balance-wise, and the simple fixes which could have been done years ago, literally a game ago, still have not been taken, and indeed, many weird choices abound - I remember arguing with the developer that interacted with us on the matter of the Chieftan Mk. 5's 'late model' 120mm and the M1 Abram's 'early model' 105mm gun, to which I'll let you assume who was calling which gun what (spoiler: I'm not an idiot).   USSR, and many (very little) NATO countries have better air-to-air power than the US. Okay? US has superior surface to air missiles than the USSR. Okay? China has the best ATGM in the game, Noth Korea has access to one of the best tanks. Okay? Planes ripple firing some of the most expensive air to air missiles on one target. Okay? One specific tank getting buffed patch, after patch, after patch, after patch, until most recently they finally decided they'd done to much and increased its point cost by the minimum increment possible. Okay?  These are the sorts of things that best allow one to understand the state of the game - if they understand Wargame. Which is to say that the way Red Dragon is set up is pretty awful in comparison to other games in the series.  However, while I feel other games in the series are less flawed, all of the games are fundamentally flawed at their core due to the implementation of infantry. You see, back when Wargame European Escalation came out, infantry could be killed a little too easily. From what I understand, it was all too easy for the area of effect associated with HE (high explosive) which the mechanic used to damage infantry to overlap with more than the amount that were intended to be damaged. For example, if you had a gun which dealt HE 3 damage, it should only deal that 3 damage. Instead, however, when the hitboxes overlapped as they tended to, it was very easy for that to kill more than the intended amount.  Now flash forward to AirLand Battle. With a mixture of the cover system which effectively spread infantry out in a wider area while still letting them operate in larger groups (a necessity for infantry combat) and a significantly more subtle change to the stealth characteristics of infantry to 'deal' with the problem. That is to say, that  the problem was never dealt with , it was simply worked around. Instead coming up with some system to ensure that when infantry were dealt HE damage from a single source that it could only deal that much damage in a single shot, they sidestepped the issue completely. This created a new phenonema: the best reconnaissance units were now infantry, which inherently had only second-best-at-best optics before could now move very close to enemy locations and spot things before they were spotted. Keep in mind, that in addition to this, these infantry units are inherently in the cheaper range of the unit prices available in Wargame.  And again, now we move into the (near) present with Wargame Red Dragon. A game which has continued to exhibit the inherent flaw of infantry still being hyper-vulnerable, and now, hyper-stealthy. With a larger amount of units, Red Dragon features far more infantry suitable to the task of 'infiltration' and also features a large amount of artillery - with few mechanical/design choices allowing for effective counter battery. If all those words scare and confuse you, what I mean to say is, the developers additionally populated the categories of indirect fire units (artillery) and these super stealthy infantry units, while making it harder to deal with the indirect fire options directly with your own indirect fire units specifically tasked to destroying theirs. This means that it's even harder to attack, and extremely hard to defend, without populating as much of the map as you can with infantry which cannot be spotted until the enemy is right on top of them.  And I do mean right on top of them. The extremes of the current situations are as follows:  The best reconnaissance vehicles cannot spot a regular group of infantry equipped with a missile launcher before that missile launcher can target  and destroy  them The best reconnaissance helicopters cannot spot a regular group of anti-air infantry equipped with a missile launcher before that launcher can target  and destroy  them  Compare this to the significantly more dynamic and visceral nature of the vehicular combat in Wargame and the issue becomes extremely apparent. Infantry are roadblocks, except they're not just roadblocks, they're roadblocks the size of the Great Wall of China. They stagnate the game, and leave it practically frozen, with either side unable to accomplish anything beyond attrition via indirect fire.  I don't know, I guess I just think it would be cool if this game played out a little bit more maneuver warfare than WW1 because of a developers choice to balance around a game flaw.",
            "review_score": "-1"
        },
        {
            "review_text": "game play utter crap you want a war game get what i play its better soviet strike much better than this crap game",
            "review_score": "-1"
        },
        {
            "review_text": "After giving up on the tiny tutorial in game I stumbled upon a 200 page guide and found out this game has 1400 unique units.... that is just too much, if you are into very very detailed and complicated simulators then this is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "The only real power comes out the end of a really long rifle.  -Joesph Stalin",
            "review_score": "1"
        },
        {
            "review_text": "this game is bad. I really wanted it to be good but it is so damn hard and there is no hands on tutorial for people who have never played before. wasted 2 hours of my saturday and 20 dollars. i want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, bad controls and just not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "What a horrible game. They show you all this crap youre looking at. NO, this is not how the game is played. The ads for this game are completely FALSE. Personally just want my money back. Unfortunately they won't give me my money back. What a horrible game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very unrealistic, tanks take 1 shot from an assault rife and they die, infantry don't shoot at anything and they think that Russia is the best country in the world.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably one of the hardest RTS games i have ever played. Things happen extremely quickly and it always seems like the AI always has one up on you. Never played online but it would proably be more enjoyable than playing singleplayer. In my opinion do not buy any of the Wargame games.",
            "review_score": "-1"
        },
        {
            "review_text": "This game still produces a lot of crash to desktops and has many balance issues, the naval warfare part of the game is very poor and not that balanced. Their DLC policy looks like they need to earn some $ to compensate for their failed game 'Act of Aggression'. Had a lot of fun with this game, but it's just broken. Be aware if you are going to buy this game, it can be a lot of fun to play with friends but it has technical and gameplay issues.",
            "review_score": "-1"
        },
        {
            "review_text": "Map 1 of the 'easy' mission. Numerically superior enemy troops pour out of their spawn, sparying your troops with gunfire and napalm before you can even get your troops into position. After 5 hours in game, I still cant work out how to even get my troops out of their transport units, despite reading some of the very detailed 'guides' on the internet which say they deploy automatically, they dont and the deploy button doesnt seem to do anything.  Avoid. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is unplayable, it has no tutorial and no control interface. It isn't even possible to get your troops onto the map let alone fight with them.  It's a straight up scam and I can't believe it's even allowed on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, wonderful design...... xenophobic, anti-Semitic, and anti-homosexual community. Pretty much turn chat off unless you really want to talk to the alt right.",
            "review_score": "-1"
        },
        {
            "review_text": "Im very happy i got this on sale because it wont even ♥♥♥♥ing work. I cant run the damn thing, cant connect to steam client every single time. i bet this game is pretty good, but ill never know. wish i could get a refund,",
            "review_score": "-1"
        },
        {
            "review_text": "  the goal of the game is to steal cd keys and teamkill as many units as possible  add me if u wanna buy maphacks",
            "review_score": "1"
        },
        {
            "review_text": "Waste of time and money. Not a strategy game just an arcade style shoot em up. Good graphics and sound ruined by cretinous logic, gameplay and does not resemble anything close to reality. Save your time and money and don't go anywhere near this.",
            "review_score": "-1"
        },
        {
            "review_text": "Ruse was innovative for its time, and the first Wargame (European Escalation) had glimpses of greatness despite its flaws. Back to the third installment Wargame: Red Dragon is just dull and dry. There are more thoughtful strategic games out there (even if they are less pretty) and more exciting tactical ones.  I will revisit this review when this game is out of beta, hoping new maps and contents can shake things up.",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely complex, difficult game. Hard to get into. Controls are odd. Way, way too complex. NOTHING like Star Craft or Command and Conquer. Not a real RTS at all. Weird.",
            "review_score": "-1"
        },
        {
            "review_text": "This is without a doubt the best RTS I have ever played. Amazingly detailed campaigns which lead to huge multiplayer battles, from 1v1 to 10v10, battles and maps vary from small skirmishes to huge clashes between superpowers. Over 1400 units from numerous nations from NATO and the Warsaw Pact. Wargame: Red Dragon delivers all the best aspects of RTS, and Eugen Studios has now added Naval Warfare into this amazing franchise. Many maps contain the ability to bring in naval reinforcements, leading to naval landings, combined with tanks battles in the open ground, urban warfare in the towns and villages, special forces raids, all with fighter planes circling over head, shooting each other down, or delivering deadly payloads from cluster bombs to napalm. This is a must-buy for anyone who enjoys RTS, whether that be COmpany of Heroes, the Total War series, or even Civilization, this game tops them all. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "'This is a new outstanding form of stratagey, getting the avaibilities of using ground, sea, and air at the same time. A must get!'",
            "review_score": "1"
        },
        {
            "review_text": "Great for Modern Day Strategy fans. Very tacitcal game and every game is different. You also got so many options of units, classes and countries to choose from. The possibilites are endless and is a great game for military strategy minds. I cant get enough of my NATO decks and in game operations.",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best RTS I have played in my life.",
            "review_score": "1"
        },
        {
            "review_text": "I'm only doing this for the community badge progress. Good game though.",
            "review_score": "1"
        },
        {
            "review_text": "The best one of the whole war game series. Much like the old Steel Panthers game, if you enjoy war, stragety, and competiting, this game is right for you.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Create deck \\ &gt; Japan deck &gt; Simulate battle &gt; Japan vs Japan &gt; Station troops in houses and AA to protect them &gt; Ambush enemy &gt; ??? Military stuff ??? &gt; Wins battle &gt; Profit",
            "review_score": "1"
        },
        {
            "review_text": "This new RTS game in the Wargame Series is absolutely great, the addition of naval units adds to the strategic thinking required, I would recommend this game to everyone and especially those who have played the previous wargames 200/10",
            "review_score": "1"
        },
        {
            "review_text": "super great game!!!   if you can get over the steep learning curve, then you'll find this as good as any Total War or RTS game.   the campaign is fun, but not as in-depth as a Total War Grand Campaign.  the Multi-player is where it is at! 10 V 10 games are intense!!  a must buy for any RTS player who wants something modern and realistic",
            "review_score": "1"
        },
        {
            "review_text": "Quick comparison to AirLand Battle  Positive +Better maps: there're less silly chokepoints, more open Space +More units +Better deck building system : Now it makes sense to actually use coalitions or nations, branches are very useful as well +Infantry is very viable now  Negative -Special Ops infantry is a tad too viable now -Tanks still too expensive to compete against the cheap ATGM onslaught -Naval is ♥♥♥♥, thanks for trying Eugene -Some coalitions too well rounded, I'm looking at you Eurofor &amp; Commonwealth  Neutral ~USA &amp; USSR are not really superpowers here   For ~20 bucks you're in for quite some fun. Also no one is playing ALB or EE anymore so you're somewhat out of options.",
            "review_score": "1"
        },
        {
            "review_text": "Hard to get going but once you understand its not bad.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying war, with 10 vs 10. Awesome !",
            "review_score": "1"
        },
        {
            "review_text": "Its an average game that fails to innovate itself in anyway. The naval combat is broken and dull and the campaigns are boring. However if you haven't played any of the other wargames yet you should buy this one due to the fact that you will love it dearly until the developers make another sequel that ends up being more of the same.",
            "review_score": "1"
        },
        {
            "review_text": "FU%$ING AWESOME! One of the greatest games I have ever played! best RTS game in the world!",
            "review_score": "1"
        },
        {
            "review_text": "great game just make sure to play with friends and have an open mind beacause the chat room is quite...'Interesting'",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, realistic military units, the game play is very smooth. The campaign is a bit challenging, but the skirmishes are probably the best.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best RTS game out there. Good singleplayer campaigns and great multiplayer. The free DLC's are nice too. One has to wonder though why Eugen didn't just keep it as one Wargame and then update it continuously instead of creating 3 different games...",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS Game in this era",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Some say that it's like RUSE meets Total War. It's little like World in Conflict with less restrictions. (i.e. you're not restricted to just Support or Armor units). It's definitely worth it. Watch for the steam sales.",
            "review_score": "1"
        },
        {
            "review_text": "its a great game with awesome weapons and logistics and after so long i still am learning.    wargame series   100/10",
            "review_score": "1"
        },
        {
            "review_text": "Great RTS game with a lot of effort and detail put into each individual unit. A must have for fans of the large scale tactical RTS games.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING! DO NOT expect this game to be like any other RTS game. If you are expecting this to be similar to Total War, Company of Heroes, World in Conflict, or Men of War: Assault Squad 2, this game is not for you. This RTS is a very serious tactical and strategic game. Every mistake you make and misstep in preparation will cost you dearly. Though, in contrast, every successful push made may very well change the tide of battle. It has a large learning curve, but after some determination, it's worth it.   I tried out European Escalation and Airland Battles in the past. I sucked at it horribly and couldn't finish the campaign. Yet, I still enjoyed its unique gameplay. I bought Red Dragon because it was on sale and I was interested in trying out the additional gameplay content. Knowing the basics of how to play from EE and ALB already, I jumped straight into campaign thinking that my experience from TW, CoH, WiC, and MoW: AS2 would surely have improved my skills compared to my first time in Wargame... I couldn't have been more wrong... My forces were obliterated within the first minute of the match... Lost to an easy AI on the very first mission of the easy campaign.   This time, I wasn't going to give up on a game I couldn't win. I watched a few battles to see the tactics and strategies players used to win against both AI and human opponents from their deployment patterns to mid-battle decision making. I was also lucky enough to find a veteran player willing to give me tips on deck building, guide me through some basic combat techniques, and invite me to his group of other veteran players who would advise me on how to play. After a little more practice, everything changed. I started to win more than lose and do an efficient job.   In total, I only found two cons in this game. The minor one would be the naval battles which are just clunky and follow a last-one-standing-wins rule rather than the tactical combat that is regular land battles. The most negative con I find would be the rather newbie-unfriendly community of veteran players. I'm not saying all veterans are unwelcoming, but if you're new, you're very likely to run into matches where you're kicked for being too low ranked. You have a better chance of finding a match by joining a very large match like 10vs10 because they don't bother to check everyone's levels. Though with inexperience, you wouldn't contribute much to the team in such a match. The best way to gain early experience is by creating a server of your own and title it 'Newbies only.'  9.5/10 Would learn how to play rather than do college homework again.",
            "review_score": "1"
        },
        {
            "review_text": "Red Dragon feels like a step sideways for the awesome Wargame series.  More content (nations and units) are always welcome and there's a ton here. The campaign is a step back from AirLand Battle. The naval units feel out of place and don't add a lot to the game.  Overall, this is a good game but for me, the changes to the campaign keep AirLand Battle as my go to in the series.",
            "review_score": "-1"
        },
        {
            "review_text": "This game like spitt hot borscht into face of enemy. Most applaud.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this a lot, when reviews say mother of all RTS, believe it. I was new to this series when i thought men of war series was the best. Wargame Red Dragon is hands down fun, it does take abit to understand what everything means as far as what tanks are better etc, I got through it, even as a person who hasn't played the series before. Futhermore, if you're looking for something new to play or looking to get that RTS, fix you'll find it here, I've spent many hours playing, and i've only played OFFLINE. I got it on sale, if you have the chance to buy on sale do it for sure, it just makes it all the more enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Basically were black people  meet.com ",
            "review_score": "1"
        },
        {
            "review_text": "Wargame: airland battle Red Dragon, defines Real Time Strategy. the combination of ground, air and naval is just blissful to any RTS fan. larger maps will seriously test your skills in all ways. There are things that could work really well with this, but everything has its limits and red dragon is well over enough to satisfy anyone. if you want a modern RTS, well here it is.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Game that i keep coming back to, i'm not great at it, but i have fun stomping or being stomped on.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rts's (if not the best) I've ever played.   You don't need to build the mandatory base with a certain amount of power crystals, barracks and what have yous to get to the main part: Fighting.  Fighting is realistically slow paced without being boring (this means that your strategy means more than your clicking spees).  That said, I you like extremely fast paced RTS's then this game is not for you. I would recommend giving it a shot though.  One of the more interesting and fun parts of the game is the army deck building, where you decide what type of a force you will be wielding and what units it will be composed of.  In short, a great RTS with fun army customization and without the (in my opinion) annoying mandatory base building.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game for anyone taking the time to learn about it!",
            "review_score": "1"
        },
        {
            "review_text": "I love everything about this game,",
            "review_score": "1"
        },
        {
            "review_text": "Worth every single cent",
            "review_score": "1"
        },
        {
            "review_text": "Hvae you ever wanted to do this? ....Push R&amp;S up, get eyes on, call in IDF, surpress the enemy, bring in some CAS and move some mud! Then close with your armor and bring their guns to bear while the dismounts move in and take the city!  How about this? ....Bring in your SEAD aircraft, sniff out and destroy the enemy AAA and SAMs. At the same time you coordinate your arty and to take out the non-emmiting AAA/MANPAD threats. Clear a corridor and bring in your helos loaded with troops and insert them behind a terrain feature and move them through cover to an AP. Bring in a scout and snoop and poop the objective, call in prepping fires, pin the enemy down and unmask your infantry and seize the control point.   You can do all of the combined arms tactics that you have seen in every movie, read in every book, dreamed of while deployed and more.   Wargame.... I love all three of them. The SP campaign is tough and the skirmish mode is an endless load of fun.  You can't get away with playing these games like they are C&amp;C or CoH, you actually have to use your brain and flex some strategy. I play on an old 2008 iMac and it functions just fine. Only problem is that in Yosemite when Steam calls home and looks for updates the game locks up. I just kill the WiFi and that fixes it.   Get it, you'll love it.",
            "review_score": "1"
        },
        {
            "review_text": "I like how you can improve yourself as a player by reading an actual tactics manual. On that same note, its nice how you can apply real world tactics and concepts (maneuver warfare et. al.) to the game and actually execute them effectively. Its nice not having to build bases and research ♥♥♥♥♥♥♥t and build additional pylons or whatever, and having the game focus more on realistic logistics and strategy instead of typical RTS fair.   tl;dr, 11/11 would slav with again.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS's I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I'm certain i would love this game and play it constantly... IF ITS TUTORIALS TOLD YOU ANYTHING! the controls are a little bit wonky compared to other RTS games and the tutorial is terrible, only explaining how things work and not once mentioning how the control scheme is. the game itself is good but the tutorial is terrible beyond belief and controls awkard",
            "review_score": "1"
        },
        {
            "review_text": "Can play as Germany and fight France because WWII re-enactments in Skirmish mode.  70567/3 Would Deutsch again",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ Poor support, heaven forbid that a company actually take support responsibility for their products.. ♥♥♥♥ THIS",
            "review_score": "-1"
        },
        {
            "review_text": "Pros -Lots of supply trucks  Cons -Not as many transport trucks as in previous titles   ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent tactical game, Red Dragon rewards careful tactical management combined with strategical planning.   Keep a view of the overall situation while getting that pesky SAM off the map, know the strengths and weaknesses of your units, beware the lowly soldier for he will cost you a T-80 in the right situation.  Fun with friends, and even the campaign is interesting!",
            "review_score": "1"
        },
        {
            "review_text": "The navy in this game was put out as this great thing that really changes the game series. In my opinion, it was very cool and very well done, but I rarely find myself or my opponents using it as regular land units are better. This game is the definition of an RTS, but be warned, it does require some skill to not lose in MP constantly and casual players will not enjoy that.",
            "review_score": "1"
        },
        {
            "review_text": "How i can get new CD key, because i want to open new account, anybody know how I can get new CD key ",
            "review_score": "1"
        },
        {
            "review_text": "B U Y I T",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy RTS and games like Arma, you'll love this one!  There is a bit of a learning curve, but once the game 'clicks' with you, you'll be addicted! ",
            "review_score": "1"
        },
        {
            "review_text": "A good evolution from Wargame: Airland Battle although the sea combat is not quite up to par with the rest.   The included campaigns are quite nice and play out a little differently from the previous title. The included units are great and varied as well as the maps. Deck building alone, will entertain you for many hours.  If you go into public multiplayer, watch out for pub stomping, it's a common occurrence on public servers and might put you off.",
            "review_score": "1"
        },
        {
            "review_text": "Excelent over the top military simulator. Incredible detail",
            "review_score": "1"
        },
        {
            "review_text": "Not good. Tried playing online once absolutely hated it.",
            "review_score": "-1"
        },
        {
            "review_text": "The best Wargame i've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "SO MANY UNITS!   WERLD WER TREE!  NAPE EVERYTHING LIKE OPRAH FLYING A JET OVER NAM!  NoPopCap/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing fun, but a warning: find a group to learn and play with, most of the community is intolerant of mistakes and often times kick you if you are low ranked.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike it's predecessors, Red Dragon lacks a good tutorial, aswell as a good single player campaign. You'll get this for the multiplayer, no doubt. And don't get me wrong. As everyone says, the learning curve is steep.But when you got the basics, making your own deck, playing competitive games with other people and have a nice chat in the Lobby-Simulator is absolutely worth it.   So, if you want to know why SovKor has too many unicorns, ships don't make sound and US needs an infantry buff. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Best ♥♥♥♥ing game ever, ugh omg, so great, like great great great great great great. I mean sometimes its aight, but ultimately... its great.",
            "review_score": "1"
        },
        {
            "review_text": "EXCELLENT graphics!!! Only gameplay must become more realistic.",
            "review_score": "1"
        },
        {
            "review_text": "Definatly worth buying if your into RTS games",
            "review_score": "1"
        },
        {
            "review_text": "Yes! Yes! Yes! Three more times 'Yes'! Great strategy. Make you think ten steps forward. Very vompetitive and brings you a lot of fun. Totaly recommend this, comrades!",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best RTS games I have played. The level of intricacy with each country is pretty amazing. For example, almost every country gets their own custom BTR and different modifications of it depending on the unit type. This is only one unit. This level of intricacy stretches across the entire game. There are at least 10 countries on Bluefor and around 10 on Redfor.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great RTS. I see explosions and missles and bullets and explosions and more missles and longer range missles and grenades and explosions and missles that are longer range than the last missle and unguided missles. They got it all in this game.",
            "review_score": "1"
        },
        {
            "review_text": "The trailer alone gives you an erection.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the previous games, well, you're in for a treat boys.  OMG PLEASE KEEP SUPPORTING THIS GAME!! I WILL BUY ALL DLC.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant graphics and great for LANs",
            "review_score": "1"
        },
        {
            "review_text": "I will highly recommanded this game, the multiplyer is a lot of fun! around 600-1300 people on at a time, including a when a new DLC or Patch comes out around 2300 people get on. But now lets get into the game itself. the game has over 1900 units and 25 countries. It has indepth maps around 40 maps. ranging from very huge to quite small. Each tank has it's own speed, fuel, ammo, health, range and optic. Theres heli, jets, infantry transports! Almost every country has it's own tactics, etc... The game is just very detailed... I would almost say it's worth $40... But the General Chat Room is just worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Best and most complete rts ever... It would have been good to have better solo campaigns , but the best of these kind of game is always the multi player ! Excellent overall game , bought the full serie , never regretted a cent !!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic, unique thinking man's strategy + deck building.",
            "review_score": "1"
        },
        {
            "review_text": "Please play this game",
            "review_score": "1"
        },
        {
            "review_text": "No matter how much you play this game you will still prettymuch suck.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to experience the 'Cold War Goes Hot and Tactical' WG:RD is where it is at.  The few improvements over the previous installments includes more unit/faction variety (with upcoming faction DLCs will expand said variety) and basic naval combat, culminating in a overall combined arms battlefield.   The game would be better if there were more single-player story scenarios added; expand on the naval combat with inclusion of more ship classes and types; more factions, especially those that would expand on the European battlefield (i.e. Mediterranean nations like Italy, Greece, Bulgaria, Romania, etc.)  Overall is a solid RTS for those who are looking for this type. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Best Cold War RTS! You will love it!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for years despite i have low hour count here on steam, hope there will be more nation packs after upcoming Yugoslavia&amp;Finland update,  definitly recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Could use more players !",
            "review_score": "1"
        },
        {
            "review_text": "The learning curve is a bit on the high-side, but this is the best war game I have found. Strikes the right balance between action and tactics and feels like what a sequal to Close Combat 2 should have been. After buying the 2nd game (AirLand), I tried the 1st (EE), but the 3rd (Red Dragon) has the best scenarios of the three and if you are only going to try one, try this one.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely one of the best RTS games out there! You are given control of an army that you personally pick and customize for yourself. The new addition of naval and amphibious vehicles add beach and river assaults, along with completely naval warfare. Ships can bombard the coastline from close up, or artillary bomb from far in the water. The new countries add more troops and game styles. One of my personal favorites. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "good game you can have alot of fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive and fun to play. Recommend to everyone who enjoys strategy and especially fans of supream commander. Best you watch some youtube vids to see how the user interface works because the tutorials are long and boring and all in wrighting. Once your set though the game is a BLAST!",
            "review_score": "1"
        },
        {
            "review_text": "So much fun so, not for the faint of heart",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a commander view of ARMA and is insanely addicting. It is not too hard to get into and always offers a challenge as you get better at the game. It just feels awesome calling in airstrikes to constantly blow up peoples armies and set things on fire, and with the free dlc, is kept fresh every time you play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really beautiful. The units are pretty balanced as long as you play with a bigger country. The multiplayer games are usually always stacked so new players really don't have much of a chance or a means to learn. (to much trial by fire) The ai when facing them is more like tower defense, and could use some improvement. Overall I would say its not worth the money picking up if you are new to the series unless they drop the price down to 20$ The game itself is great, but the community is one of the worse I have seen, so many rage quitters often leaving you 1 vs 4 or more.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't like this game. Looked great, but learning how to play it took too much time. It's now gathering dust.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this is the best military strategy simulator in existence. I own pretty much every good strategy game there is. Favorites being company of heroes, total annihilation, command &amp; conquer series, dawn of war. This game is my new favorite, The first few patches were rocky but the support for the game is great. Updates happen like every month and the development team also gives you free dlc every few months. The game is very well balanced and will take you a few hours to learn. You will want to know all 1500 units very well to be any good. All the units are spectacular in every field you could judge. The game is much more action packed than you would assume, sound is good, graphics are better. You have a large range of graphics to choose like dx9 or 10, I think open gl also. If you are jumping from wargame airland battle I would say that my favorite new features include customizing enemy decks and half naval half land maps are awesome. Its fun to pound land units with big ships. If you are buying wargame red dragon for the first time then I would say you really really need to buy wargame airland battle first. It's just as good.",
            "review_score": "1"
        },
        {
            "review_text": "Are you a brilliant commander? Do you lead your legions of infantry, hordes of tanks and squadrons of airplanes to glorious victory over the capitalist dogs (or if you are on the other side - those dirty commies)?  Or will you be the first one to run away, with your men being burnt by napalm, your tanks burning after and airraid and the airplanes fallen from AA fire?  To find out - play Wargame RD! The game that you will hate, but like a battered dog still come back to.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best realistic warsim on the market its an amazing game with many differnt play styles. weather you like to plow into our enemys with a mix of pricey but king hiting heavy tanks and little t55s that are basicly just good for cannon fodder or if your a air force man and love to have dog fights and bomb your enemys with fast high powerd strikes just watch out for that AAA. how about an support army where you run supplys up to the line and back to your foward base for other allies to stay in the fight while at the same like bombarding enemy positions with massive rocket attacks and big guns aswell as counter batterys just remember to move after you fire as there is no doubt some big shells coming at you. or maybe your a behind the lines sort of guy sneaking recon teams far up into the hills and forrests to get behind the enemy and give you and your team vital intel on enemy movments. thats not it tho how about marines use there transports to cross rivers and oceans to flank your enemys defences, and a powerful navy to bombard the land while you send in marines and harriers to make a beach head and cut your enemy in half. but if thats not enough then maybe your a mechanized warrior bringing 100s of infantry to the front in bmp transports fireing missles and cannons as they rush towards that enemy town just remember to smoke infront of that tree line with all the m1a1 abrams in it or youll all die. all in all this game is great but it does have a steep learning curve there are campaigns tho to train and skirmish mode but they game doesnt hold your hand or teach you much so i would suggest watching replays on youtube and training videos like i did back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "Very terrific game, must have for military and RTS fans.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, big and bold. Bit of a learning curve but well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "My first game of the series, struggling so far, I need an adult.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, time investment to learn how to play properly, worth it if you do.",
            "review_score": "1"
        },
        {
            "review_text": "Love it! All round a great game! A fitting sequel to the unbelievable sequel to Escalation: AirLand Battle. The only downside I have wit hthe game, is unbalanced navy combat. The PACT side has fantastic ships, and great planes - compared to the NATO, which have alright ships (but can't compete with PACT) and great planes.  Definitely worth a purchase if you love strategy games!",
            "review_score": "1"
        },
        {
            "review_text": "Its like a post-cold war orgy",
            "review_score": "1"
        },
        {
            "review_text": "Great game , but really long and difficult learning curve",
            "review_score": "1"
        },
        {
            "review_text": "Game is great epic great!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not usually an RTS player, I find them all too clicky and stats driven, knowing DPS and modifiers etc. However I am a military enthusiast and enjoy realism in games. This is what sets Wargame series apart from many other RTS.   An excellent blend of current and past nations, historical and some modern conflicts and full 'deck' customisation allows anyone from any nation to get involved (and at some points, a little patriotic) As an Australian I don't often get a chance to see games featuring our World Class Special Forces SASR or Bushmaster APC's mixed in with other nations, however with nations such as Australia, Canada, Brittain, West Germany, Japan, Korea, CSSR, Poland, USA, Russia, Czech Republic... the list goes on!  When customising a deck to take on either AI or Multiplayer skirmishes of land capture, total destruction or an interesting shared currency mode known as Economy, you have vast options on wether you want close air support, helicopters, infantry deployed via land, air or sea. You can explore tanks, reconnisance snipers, artillery and MRLS systems and even Navy to some degree. It's an incredibel mix that really suits any gamer style with strengths and waeknesses to every deck and nation. Not to mention the Prototype vehicles the the amazing Nighthawk for the USA with a deadly and precise guided bomb, or the Russian KA-50 Akula Tank Killer!  The community is very quick to judge, and the learning curve was steep! Reading forums and guides on playstyles and strengths really helps you blend into the battle. However persist the first few 'Ranks' and you realise the tide of battle can easily be changed if you know what to look for and use team strategies  The only downsides are that because they've themed the game to follow the 80's/90's style computer screen they have made a very backwards game room chat and game preview facility you have to 'join' and look at each players stats individually to understand if the teams are balanced or not. One window for chat between your game room/general chat/friends is also rather annoying. The other downside is there are often connection issues that result in one person leaving at the start of the game, the points are redistributed, but if your team can overcome this then quite often you can counter quickly with the higher income.  Wargame Red Dragon is an excellent multiplayer, great unit selection and balanced gameplay that will leave you asking where the time has gone to. Its a nail biting ride through every game with fluid battle dynamics, excellent realism and quite a little bit of pride when your team overcomes the enemy! I'd highly recommend Wargame franchise to anyone interested in a little more than base building and spamming units.   9/10 ~R",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of the old Warhammer 40k Tabletop game, i have to say Wargame Red Dragon has a lot elements of this game. You create a army around a certain strategy, you try it out and see what works and what dosent. Than you repeat.   If i compare it too other strategie games, it play out a lot slower. But thats a good thing. I lets you think about you moves. You got time to breath and keep your strategy straight.   10 v 10 matches in Online Multiplayer are really fun. And i really dosent matter if you are a new player. You get carried by the others without destroying their game expierence. Which is great.   I like this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "I love Red Dragon. But here are my light gripes:   It has some internal balance issues that need to be addressed.  Co-Op Campagins. Not everyone want to play with Tryhards online.  If you wanted to see a cold war gone hot, you would already have owned this game.",
            "review_score": "1"
        },
        {
            "review_text": "Take the time to learn how to play it and you'll love it. I'm hooked!",
            "review_score": "1"
        },
        {
            "review_text": "played alot of hours of this game and still loving it, best game out of the 3",
            "review_score": "1"
        },
        {
            "review_text": "Wargame: Red Dragon takes the overall franchise to its highest point with the addition of sea units and battles, as well as amphibious units and an expanded role for air and artillery units. Unfortunately, while the sea action side of things is one of the main things originally billed as a major draw, the actual sea dynamics are quite quirky and not especially groundbreaking or terribly well done. While the ground and air units seem to be fairly well created and designed, the sea units are quite lackluster-a fact shown out in the multiplayer where a majority of maps often used don't utilize the sea portion at all.  Additionally, the single-player tends to be typical of what you'd come to expect from a Eugen game. It's scripted and challenging, but not necessarily great by any means. The AI follows the same patterns and the 'difficulty' level for the campaigns is more controlled by the 'starting battle units' or 'morale' than by actual strategy and capability. What the single-player turns into is more of a 'How well can I micromanage my units without losing too many points?' than an actual strategy situation.   The multiplayer is where this game gets its strength. The customizability of the decks is great, the different perks are awesome, and Eugen is constantly adding, tweaking, and balancing units for the multiplayer (at the expense of any additions to single player). This is essentially a multiplayer tactical RTS Arena game with a tacked-on single player mode than it is a true RTS with story + multiplayer. That having been said, it is a lot of fun and quite challenging, but once you get used to how to use specific decks and patterns, it tends to be quite fun.  Worth a buy, definitely, but also something that a Single Player type would not enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend this game. I've always loved and played RTS games but the Wargame's are way too.. Complex and confusing. There are no guides to help you in-game, no tutorial mission, nothing - aside from very small guides that are only a sentence or two long (not to mention the only thing that they cover are the things that hardly matter.) The AI is insane in this game. On easy you will get screwed. AI just randomly pops units out of nowhere in your secured territory - I can understand minor stealth units, but when tank battalions randomly pop out of a building it makes me wonder. AI always has an advantage over you. I just can't figure out this freakin' game, all my play time is mostly just me watching ally AI and how it works. Which ends up not being helpful because even your Ally AI goes bonkers. So I don't know, it looks good, plays well most of the time and is pretty intense but - it just needs a tutorial mission to help newcomers understand this game. For the veteran players that understand this game.. I probably could recommend it, however nothing has really changed from the previous game aside from the Naval units.  Recommended on sale, around the &gt;$10-$20 range.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is of exellent quality little to no problems running the game. It is beutifully designed and a very well balanced game. There is virtually no problem at all and is very near perfect",
            "review_score": "1"
        },
        {
            "review_text": "Simple amazing. I hope they will do another one.",
            "review_score": "1"
        },
        {
            "review_text": "Hate the new maps...well,most of them. But still a great RTS.",
            "review_score": "1"
        },
        {
            "review_text": "I think its a great game, its a work in progress.",
            "review_score": "1"
        },
        {
            "review_text": "way better than wargame: airland battle although i do have a couple of thing i dislike first off the fact that you cant get U.S.S Iwoa battleship or any other naval ships other than frigate, corvette and a few destroyers i mean to me id love the fact of having iwoas 16inch guns just a blazing cutting down enemy ships from a distance rather than having to spend a but load of point to get one of the few destroyers that can get cut down easily by asm or other ships even if it is esorted by anti air ships or any other type of ship and lastly add a carrier cause it really takes to long for jets and anti ship helicopters to get to the intended target via main spawn it would really be nice to have them launch off of carriers and be able to resupply via carrier while that said carrier was close to the front lines also i dont know if yall intended this or not but i have noticed that some destroyers or frigates have landing pad are yall gonna maybe make an update to allo helicopters to land on em? other than that very very fun game not like any other war sim i have played i really recommend it to anyone who likes war sim",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and it hurts me to say 'BUT' being Airborne in the US Army, i would really love that the Airborne category of each nation should have a C-130 or C-17 fly in and parachute units in. Considering thier all infantry the fact that they could be dropped a certain distance behind enemy lines would be awesome. They could still be vunerble to fighter jets and such makes sure that you dont try to send them into enemy base.  That is my only gripe",
            "review_score": "1"
        },
        {
            "review_text": "Love this game but they could have done alot more with the navy. anyways i recomend this game its alot of fun and after 875.1 hours i can't complain at all.",
            "review_score": "1"
        },
        {
            "review_text": "Can liberate western capitalist pig-dogs. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "it is a really great game. I do, however, wish there were either longer campaigns, or more campaigns. I do multiplayer sometimes but i would prefer more options for when i want to play against computers",
            "review_score": "1"
        },
        {
            "review_text": "This game is very difficult. But, I like it.",
            "review_score": "1"
        },
        {
            "review_text": "*sends in 20 M1 Abrams thinking they are indestructable like they claim* *gets blown to hell by a bunch of attack helis* *seems they arent invincible to modern tech* 0-0 They lied to me... 10/10 would send Abrams again.   Fine ill do a real review. Great game with awesome features. Just wish when my tanks and vehicals finally got to their destination the just stopped insted of pulling off to the side of the road exposing their side armor. Also wish i could control which direction my tanks faced so i can have my frontal to the enemy insted of my rear. Simmilar to the way company of heroes does it.",
            "review_score": "1"
        },
        {
            "review_text": "a brill game nice too see some british units it is hard but worth the effort too master it :) ",
            "review_score": "1"
        },
        {
            "review_text": "Best non-base building strategy game I've ever played 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has depth in spades, over 1,600 units, with the amount of nations and units available, it's simply amazing. I don't play online, I bought this game to play against the AI and I must say no two games are alike. You have tremendous strategy to employ, a feature that a lot of new RTS games are missing is the ability direct you AI partner, i.e., toss a flare down and ask for aid and they will send forces to your rescue. I loved this aspect in the last Red Alert, though the expansion for it removed this aspect, completely ruining a lot of the experience IMO. Simply put, this game is exceptional - I can't say enough good things about it. If you are a fan of modern warfare or you like large scale games such as Total Annihilation or the original Supreme Commander, you no doubt will highly enjoy this game. IMO, hands down this is the best wargame I've played in my 35 years of gaming, it's the pinnacle of RTS games.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS around.",
            "review_score": "1"
        },
        {
            "review_text": "This game very well. I'am still wait for new version of game ;)",
            "review_score": "1"
        },
        {
            "review_text": "+ it´s Wargame! + you will die a lot, yeah! + 1700+ units? yeah, yeah!  - poor naval battles - absence of map editor - no additional maps to download - personally I found Airland Battle maps more enjoyable - for unknown reason very minor modding community  Not as decent as Airland Battle (doesn´t mean RD is bad at all), the Red Dragon still offers a very intensive firefights and hardcore battles as well. Get ready for being destroyed over and over... If you like hardcore strategies, a must have ;)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rts of our times. If you are looking for a realistic battelfield simulation, don't look further !",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Needs mod tools, otherwise amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game will teach you much about the strategy used in real life battles, the units used around the world, and the importance of military inteligence and comunication. It's a must have to anyone who loves realistic games.",
            "review_score": "1"
        },
        {
            "review_text": "Killed delta force with 20 points chinese 'farmers' with AKs and some ♥♥♥♥♥♥ rpg",
            "review_score": "1"
        },
        {
            "review_text": "a good game realistic aplus nice and fun no unit blob like sc2",
            "review_score": "1"
        },
        {
            "review_text": "Wargame Red Dragon is for a certain type of person. Its not for the instant gratification brigade, you won´t get points for getting out of bed, and nothing comes easy.  I should say that although the majority of wargame players play it for the Multiplayer, I would recommend this game wholeheartedly even just for the single player. If you crave PvP reking scrubs erry day then no, single player against the AI probably isnt for you. But for certain type of people its nice to watch a cold war gone hot unfold.  The graphics are wonderful, with the little numbers popping up upon a kill one of the most satisfying things. Especially when you land a 1000lb bomb on top of a group of unarmoured soft targets! A little sea of red numbers rises out of the mess.   Units wise, theres just about everything you would need or want, and you can customise for hours. I´d say knowledge of real world weapons systems is a plus, but not an absolute necessity. Yes, the cliche is that you have to be a cold war/military nerd but thats just not true. The unit variety just adds more depth and possibility for play styles.  Although I've tried the MP a few times, its not for me as pubstomping is absolutely rife and the server options and general MP UI is not helpful in avoiding pubstomping and/or finding yourself a good game. The playerbase is diminishing also because of this, I believe. If Eugen were to add a matchmaking system.......  Overall, 8/10 from me. A great time killer, will age well, and is good fun. It may teach you a thing or two about military hardware/tactics, and if you're that type of person, will give you hyper-competitive PvP action too.  Underrated, solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Polish artillery is true artillery.",
            "review_score": "1"
        },
        {
            "review_text": "After spending some time, completing some campaigns I'd think this is a very good game, focused on tatical level of combat. Many units, from infantry, through support, tanks to aircraft. It's very enjoyable. Campaings are really nice, but after playing them I'd like to make a wish, and this is why I'm writing this review.  I wish this particular game to be just a step toward something bigger. Just imagine a game with this tactical combat, and campaings where you could produce your own regiments, compose batallions or companies as you see fit. In campaing scenarios you can already do something like that but on minimal scale. I'd really love to see campaings where you can receive orders from head of your countries or coalitions of countries (NATO, EU, w/e), then assemble your forces as you see fit based on your mother country potential (even if it means to play with forces 3 or even 10 times bigger then opposition - just to show them their place !!!), then finally lunch a campaign with some set goals, be it peace keeping in Georgia or Balkans, or Aphganistan intervention. This is what I'd expect from next game in the series.  So far this game is like 8.5/10 in my opinion, but again - it has potential to grow to something I'd really love to play",
            "review_score": "1"
        },
        {
            "review_text": "I like this kind of game, and actual game and play were simple, intereasting and awsome.  But one thing in the game other old player don't like newbie, they don't like to teach or  give tips of how to do good play.  I really like this game but where there are no newbie incomes or banish not good with this game,  game will be fail.  Game is just a game if u r not progamer or something, u just enjoy and play all kind of players.",
            "review_score": "1"
        },
        {
            "review_text": "I used to read books in my free time, Now I stare at warchat.....  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the game i was looking for a very long time. This is the game that requires skills and clear mind, u have to predict as much as u can in order to win. The best thing in my opinion is, that you are starting to play while u are in the menu. U want to choose your deck well or u may be lack of some units that could be usefull. Its even more fun if u are playing witf ur friends and u r trying to split duties while u r planning by picking more specialized decks to get some advantage.   For me everything is good there - graphics, simulation of battlefield, variation of units(the biggest ive ever seen), those free dlc that developers gave to us and gameplay. By gameplay i mean community. the possibilities are infinitive, u will never play this same battle with oder human.  And also there are some that are not good - i think that the biggest disadvantage is that the game is not frendly to new players. There is tutorial that u can read ingame and its not that i dont like to read, but game is so big that u cant remember all that stuff and u cant check tutorial when u are playing so u could use that knowledge in practise. And maps... it looks like they have made the game and forgot about maps. literally, there is just few  For those who love single player - u won't find much there, the campaign its decent and its not easy like the whole game itself. like i said before it's unfrendly to new players.  But if u like the idea of the game, u will stay and have great time playing after u learn how things work.  I recommend game to all military fans and those of u who want to play simulation of the battlefield, not some another rts game where skills = smashing lmb",
            "review_score": "1"
        },
        {
            "review_text": "If you were looking for the most realistic historical fiction from any game, then it would be Wargame: Red Dragon. Cold War gone hot, see the possiblities of World War 3 and play as the faction you wish to see triumphant. This game can pass as a war simulation with a few tweaks, but the game is mainly for players who want a gradual feeling of mimimumalistic logistical gameplay with some strategic cordination modeling warfare of the modern world. Experience urban warfare, and know the powerful arsenal of many nations of the west and asia. The campaign can be brutal, and the AI relentless, sometimes relying on twitch reaction W:RD is very fast-paced and not for the faint-hearted. There are hundreds of units at work, and so many tactics to choose from it is overwhelming. But if you are the those strategic geniuses, then you will find this game very rewarding as this will let you excercise the commander in you.",
            "review_score": "1"
        },
        {
            "review_text": "Am I the only person that would LOVE to have a game like this ibut during WWII time period",
            "review_score": "1"
        },
        {
            "review_text": "Exceptional multiplayer especially with friends to play it with.  Horribly bad singleplayer",
            "review_score": "1"
        },
        {
            "review_text": "After having played this game for 30 hrs and understanding this game properly now i can edit this review and say that this game is really well balanced in terms of units. For every unit there is in this game there will be a counter for that unit which makes this game that much intense as u have to use ur points wisely that u gain from either controlling sectors of the map or destruction of enemy units depending on the game mode.  This game is fast paced and as a veteran from shogun 2 i can say that this game takes some time before u get used to it.It is 100X more faster than shogun 2 battles. Before u get this game BE WARNED U will lose a ♥♥♥♥ ton if u dont understand how to play this game the PROPER way. U have been warned. 10/10 hardest rts i have ever played in my life",
            "review_score": "1"
        },
        {
            "review_text": "Why the hell didn't I review this before?  It's wonderful. If you're scared of it, play the campaigns in slow mo until you relax and you get used to it. There's a good guide out there to learn to play.  Will make an actual review when the time comes, but for now, thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer:  You will want to watch Youtube tutorials (There's a decent one for noobs on Razzmann's Youtube channel) where you'll discover the basics. Red Dragon has a terrible tutorial sadly. Don't let this put you off! The game is amazing and despite the claims it's hard to learn, it's the STRATEGY that's hard to pick up, but that's the same with every damn RTS. People saying it's too hard are the ones giving up five minutes in when a unit dies (you will always have units die in Wargame, chill fam).  ____________  Once you pick up the basics, I reccomend that you play on single player to learn the units and hone your unit-control skills so you're ready for MP. I love playing singleplayer campaigns and ♥♥♥♥ for a while sometimes when I'm bored and feel like watching hundreds of enemy tanks blow up. It's pretty fun but not the ultimate Wargame experience; that's Multiplayer.  Multiplayer:  10v10 matches are alright, but be warned that spam is all too common, and the game was never balanced for 10v10. You'll sometimes have teams stacked with really good players on one team (prevalent in servers with Teamspeak IPs in the name) so it's better to not feed sealclubbers.  The best experience you can get is to start up your own lobby ('Create Game' in the multiplayer menu) and make a match for noobs only, and kick anyone with a higher level or experience so teams are balanced and fair, and then have a go! You'll learn how to play effectively over time with experience. Don't be afraid to lose. You have two gamemodes: 'Conquest' is the 'competitive' game mode with equal unit-spawning points for both players to promote an intense battle over a long time, while 'Destruction' gives players points for killing other units, and makes protecting expensive tanks more important.  Naval is almost never played, it's just not something that ever stuck with the community.  Ranked is another ball game, but not too different. It's limited to 1v1 and 2v2 (1v1 is the only one you'll find still being played) and is in the Conquest game mode. The games are intense and you're always trying to outplay your oppenent. I love it when I get a good game. Sometimes you get someone who uses a cheesy tactic to win unfairly, but the majority I've played are legit and fun.  There is more than one way to play, find what you enjoy and, enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game. Easy to learn the controls, easy to maintain situational awareness on the battlefield, easy on they eye's.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorites. Not for everyone and hard to learn -- all about online play with a steep learning curve. One of the only realistic-ish war games out there with its own totally unique combat. Eugen: make number 4!",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "its lit but needs a better learning guide instead of reading. +1",
            "review_score": "1"
        },
        {
            "review_text": "'Victorious warriors win first and then go to war, while defeated warriors go to war first and then seek to win.'  - Sun Tzu",
            "review_score": "1"
        },
        {
            "review_text": "Can confirm, Soviet Russia or gulag. In all seriousness the game is fantastic with many great features. Said features include in-depth tactics and unit variation, fun campaigns, naval and land battles, large scale and small scale battles, kickass visuals, and more. GET IT OR THE GULAG AWAITS YOU, CYKAAAA BLYAAATTTT!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Is an INCREDIBLE game and every RTS should be like this! My only request is to ability to battle using units dating back to the 1940s or 30s, which sadly isnt a thing and might never happen. So far the oldest units are from the late 59s and early 60s but i just think its pointless without vietnam. HOWEVER it is a great game and worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "The only game i can spam Katyusha's at 2 people and still get taken over because my Katyusha's could not hit the damn boats, ROCKETS ARE SO SLOW. DONT RECOMEND. if you suck at this game, helicopter spam. Always Works!",
            "review_score": "1"
        },
        {
            "review_text": "Best Wargame out there...Get it.",
            "review_score": "1"
        },
        {
            "review_text": "October 4th, 2016 update.  Many of the below issues have been addressed. The game has become much more playable and is very fun against friends.   ------------------- Get AirLand battle. While I understand the game is meant to be difficult, and I've been fine with the difficulty the last two installments (It's been VERY fun!), the AI in Red Dragon is broken. Broken to the point of an Easy AI being able to spam fighters, helicopters, tanks, and every other unit it wants faster than a human can. On Easy. If I was playing Medium or Hard, I'd understand and expect that kind of difficulty, it's meant to be a difficult game. On /Easy/ though, is meant for an /Easy/ experience. More often than not, it's to learn the game a bit better, get to know the controls, units, strategies, et cetera.  Yet when I play with up to two or three other friends of mine against a single /Easy/ AI, we all get destroyed by it's massive firepower, surpreme control of it's units, and basically what we refer to as 'AI Cheat' nonsense. Such as the second we call in a plane, they have three-to-four planes litterally clipping into each other to engage ours within a few seconds. They manage to get armies of helicopters, tanks, planes, and artillery bought and on the move by the time we have five tanks, a handfull of infantry, and maybe three planes.  All in all, I love the Wargames series. I think it's well done, well researched, and well implimented. The difficulty options are appreciated in the original and in AirLand battle. In Red Dragon? It's either get stomped by an easy AI, or hide in the corner of the map until it runs out of reinforcements and play a mop up game after 40-60 minutes of gameplay. Not very enjoyable and it gets old quickly.  I would play this game much more if they fixed this AI nonsense and left the surpreme commander AI's to the higher difficulty levels.",
            "review_score": "1"
        },
        {
            "review_text": "Game well crafted and supported by its dev.",
            "review_score": "1"
        },
        {
            "review_text": "Will beat you into the ground when you first try multiplayer (hell, even singleplayer aint no picnic), but its one of those games where you can look at your replays and actually learn from your mistakes. Very skill based game and pretty enjoyable all around.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. I'm addicted!",
            "review_score": "1"
        },
        {
            "review_text": "I've spent so much more time crafting decks and pitting WW2-era fights (400 T-34s vs 400 M18 Hellcats M36 Slaggers and M24 Chaffees) than actually playing the game.  (But the gameplay itself is fun too)",
            "review_score": "1"
        },
        {
            "review_text": "If you want a real time strategy game and you want realism, take your jacket off, and stay here a while.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly good. Please add same speed control (bullet time-v.slow-slow-normal-fast-v.fast) to AirLand Battle and you're golden.",
            "review_score": "1"
        },
        {
            "review_text": "This game will always be one of my favorites. It remains one of the best rts games I have played. You build an army out of a deck with limited unit numbers. You build your deck according to your play style. Each type of deck theme has it's strengths and weaknesses. You have to think hard and use tactics according to your deck style and only then will you come out on top.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like games like this. Do not buy expecting a RTS with base building, unit creation, or anything a typical RTS would have. Not really my speed, but I would recommend it to those who like strategy. That being said, the single-player is garbage. It's not a RTS, but a turned based game mode where even the 'Easy' mode is insanely tough.  Did get a refund, but again, not because the game is bad, it's just not my preferred flavor of strat game.",
            "review_score": "1"
        },
        {
            "review_text": "Just sideshot it m8",
            "review_score": "1"
        },
        {
            "review_text": "This is one off those games that you will be dragged thrue the dirt before you start to enjoy it.   I didn't find the campain apealing but the Mulitplayer is soo much fun when you get in to it.  You need about 100 games before you start to understand it.   My tip go on youtube and look upp tutorial videos!  This game can give you a really good game or a really bad one but same map can be plaied again and again.  ",
            "review_score": "1"
        },
        {
            "review_text": "SO fantastic a game, waht else to say?",
            "review_score": "1"
        },
        {
            "review_text": "Tired of economic RTS? Tired of WWII / heroic fantasy settings? This game is for you. Huge amount of units, realistic nations, big maps, interesting mechanics, and epic 20 players battles!",
            "review_score": "1"
        },
        {
            "review_text": "Varying degrees of HELICOPTER RUSH",
            "review_score": "1"
        },
        {
            "review_text": "It brings all of the complexity of Cold War era conventional engagements in a simple package. It's incredibly challenging and fun!",
            "review_score": "1"
        },
        {
            "review_text": "20% of the time you will warplay 80% of the time you will warchat",
            "review_score": "1"
        },
        {
            "review_text": "China's weapons and equipment in the game is too backward, I hope the production team can update the Chinese weapons and equipment.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest RTS I've ever played.  Gameplay is superb, only needs work on the multiplayer experience to completely dominate our souls.",
            "review_score": "1"
        }
    ]
}