{
    "app_id": 251150,
    "name": "The Legend of Heroes: Trails in the Sky",
    "release_date": "2014-07-29",
    "developer": [
        "Nihon Falcom"
    ],
    "publisher": [
        "XSEED Games",
        "Marvelous USA, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "JRPG",
        "RPG",
        "Anime"
    ],
    "achievements": 27,
    "positive_ratings": 3413,
    "negative_ratings": 318,
    "price": 12.99,
    "description": "Hailed as one of the largest, longest and most meticulously detailed turn-based JRPG series of all time, this first chapter in the ongoing Trails saga sets the stage for what's quickly become Ys developer Nihon Falcom's most popular and best-selling franchise in their entire 30+ year history.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251150/header.jpg?t=1539027392",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III 550 MHz Memory: 512 MB RAM Graphics: 32 MB VRAM, 3D accelerator compatible w/ DirectX 9.0c DirectX: Version 9.0c Storage: 3 GB available space Sound Card: Compatible with DirectX 9.0c",
    "recommended_requirements": "OS: Windows Vista, 7 or 8 (64-bit supported) Processor: Core 2 Duo 2GHz or higher Memory: 1 GB RAM Graphics: 64 MB VRAM, 3D accelerator compatible w/ DirectX 9.0c DirectX: Version 9.0c Storage: 4 GB available space Sound Card: Compatible with DirectX 9.0c",
    "reviews": [
        {
            "review_text": "Unbelievable world building and detail, well-developed characters, careful deliberate pacing (although slow due to having to set up a huge saga as its first entry) and a well-written script all contribute to creating a world that pulls you in and is populated by characters you care about. Despite the huge amount of text in this game (yeah by the way, stay away if you don't like reading) I found myself savoring each and every line in the game, even those by random NPCs. It's like reading a good fantasy novel, it really is the best world building and such work that I've seen in a JRPG, most likely ever.  That would be reason enough to jump in, but the RPG underneath that world is also fun, balanced, and somewhat nostalgic.  Battles have that 'everything matters' feeling, a sort of mix between a strategy game and a traditional RPG system. Character progression is tied to the story, but gets really good after about the midpoint in the game, and battles ramp up in strategic scope as you go along.  Overall, this should not be missed by fans of JRPGs, or anyone that enjoys good narrative and world building in video games, especially the more literary types who are accostumed to diving into fantasy novels and taking in all the details and workings of a fictional world to heart as it slowly unravels in your head. By the way, the random NPCs who roam around the village and such? The soldiers? The innkeepers? They have character arcs. Character. Arcs.  That's all. There's no overstating the narrative and world detail that goes into this series. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "Me like JRPGs. You like JRPGs. This incredible JRPG. You buy JRPG. They bring over more JRPG.",
            "review_score": "1"
        },
        {
            "review_text": "I played the original release of Frist Chapter back in 2006 and the Second Chapter in 2008, and now my son (4-yr-old) is playing the re-released on Steam. On a glance this is one of your staple JRPG: cute and seemingly clueless though motivated protagonists, tactical turn-based combat, heavy text-based menu and stats/mechanisms. But beneath that thin layer of disguise, you would have one of the most wonderfully made story-driven RPGs with a plot as dark as the Witcher series (dare I say) you have ever played--if you play all three entries you will reach the same conclusion.  Needless to say the story goes beyond the good vs. evil scheme, but characters in this game also evolve in a believable way. They are very aware of the changing world and interact with each other in meaningful ways. Suffice to say you won't find any one-dimensional character in this game, be it a protagonist or antagonist.   Also worth mentioning is the quality of English translation, which I believe has been to be marvelously done by professionals. It's almost like a re-interpretation of the source material--if you will--in Japanese. This definitely sets this game (and most likely its sequel--Second Chapter and the 3rd) apart from the likes of Final Fantasy and such.  You will probably find choke full o' troupes or cliché common to comics and mangas in this game: - shadowy groups with profound motives beyond human comprehensions and far reach to every corner of the continent by all means fathomed by only the most conspiracy-minded individuals in the creative industry,; - mysterious enemy combatants ranked in number not by sheer strength but their legendary reputations; - villains turned out to be activists manipulated by a greater force each step of the way without a clue; - etc.  However if you can look past this and accept that most of the deeper story-driven games are more or less like this, and it's only a matter of expertise to conceal the usage of these troupes, then you will have a wonderful time like me to explore this universe--its lore and its characters. Not to mention this is one of the few REAL steampunk themed games available on PC, or even the entire industry, consider it being a niche not generally looked into. And if you are concerned about cliffhangers since this is the only the first entry, worry not--for each 'chapter'(game) conclude its story in a satisfying way, while foreshadowing the next one and leaving room for a respite and a sense of achievement.  Gameplay wise, this game sports both open-world (opened up gradually in the first 5 hours) and meaningful character customizations (able to be re-speced at any time) through assemblies of clockworks and gem-socketing (thus comply to its Steampunk theme). Enemies are varied and requires certain tactical thinking in the manners of both character positioning in the battlefield and strength/vulnerabilities of each enemy type. Character progression is also non-linear, meaning there's no hard coded class definition, so you can have detailed customization of each character's role, while everyone still has their unique specialties.  Aesthetically this is one of the more pleasing JRPGs you'll ever come across. The graphics have been remade into HD and its aesthetic design definitely takes cue from both contemporary and mid-19th century old-world life, and the visual design does a great job taking care of every minute detail in 3D and the textures are excellent if you take into account of the fact that this game is made in the early 2000's.  The soundtracks have been one of my favorites and it certainly sounds like it 's heavily inspired by the work of Academy award winner Joe Hisaishi.  To conclude this review, I would absolutely recommend this game to all RPG enthusiasts, even if you don't usually touch JRPG. When you do, make sure you endure through the first 3 or 4 hours of this game after which point the story really starts to pick up its pace.  Final verdict: first chapter of a deep and story-driven steampunk RPG trilogy, 9.5/10. ",
            "review_score": "1"
        },
        {
            "review_text": "Trails In The Sky is a JRPG from Falcom, a cult classic developer that's been churning out diverse and well crafted role playing games in a variety of styles (from action to strategy to dungeon crawling to metroidvania) since the Nes days. Joining all these games are equally diverse and gorgeous soundtracks from the developers in-house band/sound team.  Trails In The Sky's biggest twist on the jrpg formula is that it's actually well written...Falcom you madmen! How do you ever expect some crazy gimmicks like 'a good script', 'foreshadowing', 'plot twists', 'humor and whimsical moments that are actually funny', or 'character development' to ever catch on in the anime/game biz? Obviously this is why you guys are so obscure.  Oh yeah and the battle system is really fun too and both the story and gameplay are nicely paced, if you don't mind a ton of reading. But let's be honest, you're mainly playing this to see Estelle and Joshua grow and develop as characters along with their relationship.  The cute, sweet, funny, slice of life bits are honestly the best part too. So I'm happy it stays that way for about 40 hours, hahaha.  Go play it. Best Jrpg I've ever played. Can't wait to play the rest of the trilogy!",
            "review_score": "1"
        },
        {
            "review_text": "I usually judge an RPG twice. Once at around the 2 hour mark, and once more at around 10 hours in. If an RPG manages to get past those two milestones, then it's safe to say that I've become invested and am enjoying myself. The story is very good, despite a few cliches here and there. I feel like all the characters are unique, and more importantly, alive.   The progression of the story is also interesting, as it plays out more like a 'coming-of-age' story than what I'm used to from most games of the same genre. Estelle and Joshua travel across the country, remaining the only permanent members of the party. In each chapter, 2 characters are introduced and added to the party, and go their own ways at the end of the chapter. It's refreshing to follow Estelle and Joshua through the story as they grow into their own respective roles.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best JRPG's I have ever played story/plot wise, combat is also particulary good but mainly I play this for the story rich enviorment it offers. I would recommend this to almost anyone who enjoys a good checker board JRPG but like any other game - depends entirely on the person who plays it.  Every character in the game has a special role, with each progress you make the game becomes more interesting to play, even the side/minor characters in other towns you will be visitting have always something new to say. But what got me the most of all into the game is the strong bond between the two main characters you'll be always playing (from start to end), not to mention the uncoverage of their hidden backstory throughout the progression of the game.  In other words, I think this game deserves an excellent grade in my book, there is also a sequel to this game which I will be definitely playing and if you ever decide to play the first one, then I think you won't regret playing the second one either.",
            "review_score": "1"
        },
        {
            "review_text": "Classic RPG remake with touching storyline with lots of twists. Played the game mostly for the story. It's practically impossible to complete the game perfectly within a single playthrough with monster book filled (conflicts with getting perfect BP). The combat is not to my liking though. At points in time I feel that fighting encounters is really a bother as it's time costly with large group spawns.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just simply amazing. If you enjoy long and adventurous RPGs, not to mention JRPGs, then you've come to the right place!   The plot itself is excellent. It reflects the struggles people can experience, the pain of losing what you consider dear, and the heartwarming friendship of those around you. Estelle Bright, the main female protagonist, discovers herself stumbling upon a path to a long and winding journey with the main male protagonist, Joshua Bright. She doesn't know what to expect, but she prepares herself both mentally and physically for the challenges up ahead. Sounds a bit cliched, perhaps? But if the journey begins with an odd pair consisting of a whiny, child-like teenage girl and a smart, awkward teenage boy, who both have an unbelievable amount of potential, you start wanting to follow along to see how their future turns out.  In addition to the main plot, which was fantastically written, there is a multitude of sidequests that each have their own unique effect on the gameplay. You don't just quickly rush through the events and understand the story. You take your time with each event, paying close attention to every detail, and not only understanding the story, but feeling it and living within it. And you are able to do all of this because characters of The Legend of Heroes: Trails in the Sky is capable of pulling you into their own world.  The connections and relationships between characters are rather interesting, and you easily feel the need to know how these connections develop over time. Each character has their own wonderful background, full of mysteries that are yet to be uncovered and investigated. There is so much to learn about them and there is so much left unsaid. Their personalities are quite the attention grabber as well!  And while wandering around and exploring to your heart's content is enjoyable, the battles are also extremely exhilarating and always keep you on edge. There is never a time when you can sit back and relax during a battle. This is because it is not always easy to defeat the monsters or the opponents, and this is a good thing. Why? If something was easy-peasy, it would be expected to get boring after a period of time. These battles are battles that you must endure and help your main characters fight through successfully. They provide some difficulty, and though it can be frustrating at some points, it really does keep you going back for more.  To top off this tall stack of excitement, the soundtrack, artwork, and design are simply impeccable. The music accompanies the beautiful scenery of the game. I always found myself being awed by it all; it never failed to amaze me.   All in all, this is a fantastic game. I certainly do not regret purchasing it at all, and I always find myself being tempted to replay it over again. So, is this something you should buy? Definitely! You have my vote!",
            "review_score": "1"
        },
        {
            "review_text": "If you want an immersive world where even the most irrelevant NPC's have something to say about what's going on after every little thing you do, then this is the game for you.  The story is great, it really pulls you in, and the characters are lovable. There's mysteries and plot-twists and drama and everything you could want in a good story. I guarantee if you make it to the end and finish this game, you will purchase the sequel within minutes once the credits start rolling.  This game is also great for completionists. There's tons of things you can miss if you aren't paying attention. Quests, treasures, etc.  Do not buy this game if you can't handle large amounts of voiceless dialogue. The combat is NOT the selling point of this game, though that doesn't mean the combat is not enjoyable. I enjoyed the combat. But the story is the main selling point of this game.  I give this game a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic.  If you like milling about talking to NPC's because you're a busybody and want to get up in everyone's business? Buy this now.  If you like your stories in RPG to be more about political intrigue and turmoil rather than that destiny to save the world crap, get this now. Your characters are junior members in basically an international NGO! You have run-ins with the national military! Rabbelrouse with foreigners!  This game's just fantastic. Only thing that isn't the greatest ever is the battle system, but it's serviceable, if a bit finicky. Tinkering with orbments to try and ease out the spells you want is a neat little problem solving challenge, if you want to get that into it.  But seriously, get this game. It's actually the first of three, with the second coming in soon by all accounts!  One hell of a cliffhanger until the next game comes out though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. The writing is the best I have ever seen in a video game. The detail is just mindblowing. The battle system is really easy to get used to and if you know what you are doing then you can pull off some amazing combos and just destroy the bosses. I have played this game 5 times when I first got it (250 hours of my life ) and that was before I got it on steam. After that I did 2 more runs and I regret nothing. The characters are really well done. All of them are really usefull in battles too its just up to your preference.Even the NPC's are really well done they always have something new to say. Hell some of the generic NPC's are better than most Rpg characters I have seen in my life.  I DO have 1 problem with the game though. The final boss has REALLY high physical defence. Even if you increase your strenght you can't do that much dmg on him withouth using an S-Craft. This makes getting one of the achivements really annoying. He also has great magical defence too.Also I pretty much tried every status aliments on him and nothing works. Even the super boss of this game is affected by some of the status aliments ( then again the super boss is dificult for other reasons). The final boss is still not all that hard its just takes long.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;3 JRPGs &lt;3, just feed us steam gamers with more and more title! This game is interesting so far, nice humor, interesting battle system. Only complain is about my eyes bleeding when reading the dialogues or menu..to be a PSP port is ok for the rest of GFX, but the fonts should be more clear.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game that sets up an even better game! Fun characters, lighthearted plot, tons of sidequests, an interesting but not complex battle system, and RPG character development that is balanced enough to keep the game interesting while opening up a variety of ways to make your characters OP.  Also this is a prerequisite to play the next game, SC.",
            "review_score": "1"
        },
        {
            "review_text": "Completed the game quite a while ago, and decided to review this VERY UNDERRATED JRPG.  Do note that this is Part 1 of the trilogy.  This game is best for those looking for: 1. Great story  2. Excellent world-building  3. Brilliant music  As part 1, this game introduces you to Liberl Kingdom, and expect even better things from its 2nd part  Warning: This game may be too dialogue-intensive for some people unfamiliar with the JRPG genre ",
            "review_score": "1"
        },
        {
            "review_text": "First time I played this was back in 2011 on my trusty PSP which now lies somewhere because I have no idea why. And boy, that was an experience. Being a hardcore fanboy of RPG and especially those from Japan (because I'm a giant fat weeaboo) and played games like the original Legend of Heroes, Ys, Generation of Chaos, Persona/Shin Megami Tensei and whatnot I was very quick to pick this up from my local Gamestop back in California. I think that was the best 20 bucks I spent during that semester.  Trails in the Sky is a spinoff/sidestory, or if you would like to call it the sixth game in the Legend of Heroes franschise. It's your typical turn-based JRPG with a little twist and a bit of strategy to it. Battle doesn't become too dull thanks to that and because of the 'Arts' system you can customize your characters (which are quite the amount) for a specific role whenever you want to. And it is paramount for the important battles. Unless you are playing on easy. Which you shouldn't do anyway. Shame on you if you do. Like, seriously.  But then, a lot of peope play RPGs for a good storyline which Trails in the Sky does not falter at. More the opposite; albeit that it has a problem of pacing. Now, the game is divided into chapters (I actually forget how many) but the game doesn't start to pick up about halfway through and for many that can be a turnoff. But to compromise this there are a lot of other things one can do. Sidestories, extra missions, exploration. The world of Trails in the Sky is vast and extremely beautiful which is one of its selling point. It's extremely well detailed and the characters just compliments this so well. Compared to a lot of other JRPGn out here on Steam the characters are actually interesting (*cough* Agarest *cough*) Seriously, of a cast of 35 party members in Agarest only three of them were actually somewhat interesting. Now, Trails in the Sky doesn't really have THAT huge of a cast but that doesn't matter when the majority of the characters are great. But of course, it's Japan so we have some sort of stereotypical characters which you will always see. *sighs*  But those minor flaws just pales in comparison of the whole greatness of the game. It's a rich and engaging world with some actually great music (I actually have the CD with the OST, suck it ♥♥♥♥♥es!) that fits the vivid world and enhances the experience. Battle is somewhat fluid, characters actually have an interesting personality (for most part) and has an amazing story... if you can get past the first two chapters (but hey, the story isn't actually bad even from the beginning).  The experience from playing it on a PSP was great but I don't think I could experience the details from that small ♥♥♥ screen the same way I can do on a PC. I mean, holy ♥♥♥♥. The difference is amazing and I can finally enjoy both the artwork and the surroundings to its fullest potential. Only downside is that I feel like a neanderthal sitting in front of my computer and playing games with a controller. With both hands close to the crotch with the vibrating controller, I could do something else. Ya'now.  9/10. 'Anime was a mistake' - Hayao Miyazaki  but this game wasn't",
            "review_score": "1"
        },
        {
            "review_text": "Great Game with lots of fun. Wish there are more games like this.  Would say this one of the jrpg game which can rival games like dragon age.",
            "review_score": "1"
        },
        {
            "review_text": "I have played the game 8 years ago when I was a boy. Though I played it in chinese version( I don' t even know why there was chinese version at that time). But this time I'm playing in HD and English. The story doesn't change. But the change is mine. An old game and an old me now. I wonder what can I gain by play this again. Maybe just memory of my former self or the memory with this game 8 years ago. Whatever, thanks Xseed to renovate this game for me.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far my favorite game.",
            "review_score": "1"
        },
        {
            "review_text": "The legend of heroes isn't action packed, or fast paced. It isn't particularly innovative either. Where this game shines is in the well-paced an believable character growth, and the attention to every small detail in it's many superbly written stories within the story.",
            "review_score": "1"
        },
        {
            "review_text": "Great story with lots of plot twists and memorable characters (and everybody seems to be hiding some secret). The localization is incredible - the English translations are perfect. Only flaw in my opinion is that although the game has great music, the game reuses them a lot.  9/10  P.S. Thanks to Ve for recommending this game! ♪",
            "review_score": "1"
        },
        {
            "review_text": "Hey guys, writing this review in the time of Winter 2013™ to say that this game is an excellent JRPG.  I really can't wait for Summer 2014™ to come so I can get to play the Second Chapter!",
            "review_score": "1"
        },
        {
            "review_text": "I am a person who rather play than read and/or watch.  Do understand few things: not to brag, but I've played many, MANY JRPGS and plot-heavy games through my life. Some even helped me decide my life's decision. After the first chapter of the game, I can easily tell/guess the coming plot. It is almost too easy to guess what's coming. That itself usually puts a -10 in my books, because the plot twists are no longer a twist...it's something expected.   However....  This....this story... It got me so hooked onto it that I laughed and smiled at the accomplishments of the characters, and cried tears of joy during happy times; and not forgetting, the sad tears I have gushing out from my eyes when it is at the end. The way the characters developed, the pure honest to goodness emotions that is overflowing from the characters, warms my heart.   Gameplay: Simple, easy enough for beginner gamers to adapt, and nightmare difficulty for those maniacs. In other words, easy to learn but hard to master. 8/10  Story: ........ 10/10  Character Development: ....... 9.5/10  Graphics: Old school styled. Not really high end, but that makes it more accessible for most people. 7/10  Game Logic: There's tons of magic and high leaping around... but yet again this is a fantasy world so.... 7/10   For those who wants immerse and entertain themselves for 50+ hours, 10/10 get it.  For those who wants to improve their gaming's strategic sense, 9/10 get it, and play on nightmare.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I ever read!  Seriously, this game is fun and not very tough, so if you like family-friendly storyline, quirky humor, and reading a lot, it's worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge JRPG fan and grew up during that golden age, SNES &amp; PS1 era. I've played a ton since then. Some were good, some were meh, but Trails in the Sky is one of the only JRPGs that I REALLY enjoyed since the SNES-PS1 era. It actually feels like a PS1 game, but with crisper graphics. It has everything that I miss about JRPGs, a good slow burning story, great character development, turn based combat, and an amazing soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "After completing this game without any spoilers of any kind i can say without a shadow of a doubt, it is the best game i have played during my life. The story, the characters, the development of said characters, the gameplay, the humour, the amazing OST, the beautiful art style... This game is a true masterpiece. I am writing this moments after finishing chapter one and was litterally begging for chapter 2. If you must play any RPG game in your life, this is it. Invest the time to play this gem and you shall not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "What started off as a nostalgic trip down memory lane for the JRPGs of the old days turned out to be something far greater than I'd imagined. While it may look aged, under the hood you'll find quite the competent RPG game with easily over 40 hours of gameplay.  The true strength of this game lies in its story and amazing attention to detail, which while starting off VERY slow - is definitely worth getting through towards the later chapters as it ends up being one of the best written stories I've had the pleasure to play through, I am eagerly awaiting the 2nd chapter!",
            "review_score": "1"
        },
        {
            "review_text": "Glad this was brought back out, just as fun and addictive as I thought it would be.  The story is wonderful and the characters are entertaining, would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Played this to the end on the PSP and loved it loads. If you want a JRPG with an incredible story, this game is the best. One of the best soundtracks i've heard in a game as well, it fits the game/scenes so well. Combat starts off very slow n dull, but it picks up a load once you start getting reasonable amounts of quartz to properly utilise your orbment slots.",
            "review_score": "1"
        },
        {
            "review_text": "Damn solid, although it ends on a bit of a sour note for me, personally. Nothing too major, just a trope/cliche that I'm not particularly fond of, and one that I think is overdone/done poorly a lot. Still, considering this is just part of a series, I'm not too bothered by it; if this game is any indication, the rest of the series will more than make up for it.  Nothing that you haven't seen before (not surprising considering it's age) but I don't think it's much of an exageration to call this a masterpiece. Everything seems to be gracefully woven together, with attention to detail where it matters. The characters are likeable, if a bit generic in some instances, but they play together nicely. The world building is fantastic, each NPC having several different bits of dialogue depending on where you are in the main story. Lots of locales, lots of friends. Even bits that would be jarring on their own are supported so well by the rest of the game that it makes sense.  Plus, it does one of my absolute favorite things a video game can do, ever! I don't understand why developers can't figure out that the climax is so much more interesting if it draws from all your actions leading up to that point. It's honestly rare, and probably worth playing for that reason alone.  (On that note, if anyone is interested in getting into game development, definitely give this one a study. The execution is mostly flawless, even if not all of the pieces are perfect.)  9.9 out of 10, lmao",
            "review_score": "1"
        },
        {
            "review_text": "It's as slow paced as any JRPG and has about as much pointless (yet humorous) dialogue. The story poses many questions along the way and the plot becomes increasily more in-depth until the point where I played the 2nd half of the game only taking a break to go to work and sleep. In the end most (but pretty much all the important) questions are answered and the ending leads straight into the plot of Second Chapter. But then you replay the game and suddenly all the pointless dialogue was actually foreshadowing the whole time.  Also this game can really break your balls, even on Normal (the easiest difficulty).  Great soundtrack too.  Gameplay: 8/10 Story: 9/10 Characters: 9/10 Music: 8/10 Epilogue: 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I've been longing for a decent JRPG for quite awhile. I'll pick up a game and usually I end up getting bored before I reach the final boss.   I am delighed not only was I so addicted to this game I basically played constantly in my spare time, but I'm already working on my second play through. Right after finishing. Because I want to pick up on all the plot hints I missed and the side quests I appereantly missed. &gt;.&lt;  It's fun, the combat system is simple and reasonably fun (I love turn based games). I'll admit that it's not one of those games who's battle systems made me want to grind, but I didn't mind sitting running around fighting all the monsters that I came across.  I love how this game doesn't give most of the characters backstories. They hint at them and then continue on. I like how it was natural in the story for these people to team up. A lot of times it's kind of like 'Meet random talented person. Get involved helping random person. Solve their problem. They join you for rest of game.' Characters leave group when it's natural and join hen it's natural.  Overall, a good game! Definetly worth a play if you want an actual story, a JRPG, or turn-based game.",
            "review_score": "1"
        },
        {
            "review_text": "This is great. Grabbed it in the sale fired it up just to check it works and everything else went on hold 108 hrs later Im on here searching for part 2. Yes it is a complete game but the story continues. Steam why do I have to search about for the second chapter? The only downside is some of the dialogs can be quite long which I did enjoy reading but at 11:30 with work starting early can really make you wish you saved before the dialog started.",
            "review_score": "1"
        },
        {
            "review_text": "Classic JRPG that comes with interesting plot. the main protagonist is a staff-wielding girl with pigtails (twintails). couldn't say no to a staff-wielding girl with pigtails.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. One thing annoys me though, text boxes. You hear this very annoying beeping sound as each text character appers, you have no option to turn off without turning off all sound. However (and I'm not saying you do this as the creators probably don't endorse this), there are ways of macgyvering a fix. Just do a google search about the game and annoying sounds to find the right threads out there (requires some basic computer skills). It has made the game wonderful for me.",
            "review_score": "1"
        },
        {
            "review_text": "Great 'old-school' (as in 2004ish) turn-based rpg. If you have that nostalgic hunger for decent TBRPGs, this one is definitely a keeper.",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt one of the best rpg's I've ever played. The characters all have depth and personality, the story is amazing, and the overall feel is just perfect.  I also love the battle system (reminds me of 'Arc the Lad', but on a small scale and smoother). I also love the mouse support for this game. You can literally play the whole game with one hand if you wanted.   One of the best games ever made. I'm really looking forward to the rest of the series being ported to steam :)",
            "review_score": "1"
        },
        {
            "review_text": "I love this game I never knew it was a thing until a friend told me about it and let me try it out vis steam though my account from his. So I am going to buy it today and i am going to play this and have fun doing so.  It Has a Great story From what I played its assets are awsome and the combat is smooth but I only have on issue and that is some times I cannot find the missions for the guild and they end up being fails but notto worry i just reload or restart till i find them. If i was to rate this it would be   9/10 which is very high in my books for jut playing the game up to the second town; but it while worth it and deserves it.",
            "review_score": "1"
        },
        {
            "review_text": "Hey guys, I just recently finished this game and if you are into JRPG's with a great story line this one is must play. It has a great memorable story the characters are well designed. Some things I really enjoyed about this was at no point did I have to grind out levels (assuming you don't run from fights) so you are always moving forward, there is a ton of depth to this game but it has a very good pace so you are always moving forward you don't or at least for myself never felt like I was stuck having to spend hours on some small side quest that was boring and lose interest and that does happen in some games I believe I did all of the sides I only did one play though I found the side quests added to the story a lot of course I missed a lot too for items like there Ultimate's and probably some other chests.  I am 30 and been playing RPG's since I was around 6 back on the NES then SNES so I have played many RPG's since I was a child. Anyhow it is a very well done game, I would defiantly recommend this to anybody who wants a large engaging game with a great memorable story. You are able to customize a bit but I wont go into detail you will have to play it for yourself and find out as for myself I would like a bit more options for that but in no way was it something that held the game back. Hopefully If I can ever come up with some extra coin I will try the second chapter of this game to continue the story and if it is anything like this game It will be a joy to play. Anyway if you are looking for a solid Single player RPG this one is definitely something to pick up and give a try of course everybody is different with individual expectations of what a RPG should encompass but as for myself this has made it onto my personal top 10 list I cannot wait to continue the journey in the second chapter. -Nik",
            "review_score": "1"
        },
        {
            "review_text": "In a period where RPGs in general are in a bit of a slump, I spotted this purely by accident; I wasn't sure whether It would prove worth my time; but it was on sale, and I hadn't played an RPG for a while, so I thought, 'what's to lose?'  I regret nothing.  An incredibly developed and immersive world. People that actually feel like people. A Battle system that's easy to use but also highly customisable. A strong Storyline That keeps you guessing. It's got all this and lots more.  For something I picked up as a 'What If?' I have been repaid many times over. I strongly recommend this to anyone who likes RPGs, purely on it's own merits, but as an added incentive, the more buy it, the more likely the other entries in the series will also appear.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible journey that gets better and better each hour. Having just finished it, it's definitely worth seeing through to the end. Good to see it finally getting justified recognition on Steam.  It doesn't start as slowly as other reviews have made out, and there's no more text to read than, say, Persona 4.  You'll be rewarded with an all-time fave if you like:  - great plot - well-written characters - suspense - strategic battles that give you time to think - cute graphics  What you WON'T get is  - anime porn titillation - monster hunting - cinematics - ridiculous plot you never understand  This PC version is very easy to play, works beautifully with a mouse. There's 60 hours here on a normal play-through. If you like JRPGs, or are curious about how great a good one can be, get it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.  If you're a fan of JRPGs there's nothing really to blow your mind. It's just a solid game with a pretty good story with a lot of twists.  Pros:  +Runs great, I don't really recall any technical trouble, except maybe once or something in 50 hours.  +good controls, you can play with just mouse for example which felt really natural.  +Good combat. I like the grid movement and using line attacks or AoE.  +Story. It may start a bit slow and feel pretty childish and tame, but don't let that fool you. It gets deeper and more mature towards the end.  Cons:  Graphics are pretty weak especially if you look at big screen. Still quite charming quality to them.  Sound design is pretty weak. Some ok music, but you get quite tired of it.  Please support this series. I really want to see all 3 games and more released in the west :D",
            "review_score": "1"
        },
        {
            "review_text": "Ever since I played this on the PSP, I've been wanting to play the sequel to the game. Little did I know that there was, in fact, a PC version of the game first!  After trying out the original Japanese version of FC, SC and TC, I have been waiting for an English translation of them. Seeing the great news appear on my Facebook wall made me add the game to the wishlist, and on the day, someone went ahead and bought it for me!  Playing through the whole game again, and I must say, I am not disappointed. Nice to see the voices have been added!  Looking forward to seeing SC in the near future, maybe. :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game.  Awaiting Second Chapter.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, so Im in the last parts of this game and im going to put it simply...  I haven't enjoyed an RPG (JRPG) so much since FREAKING XENOGEARS AND FFIX on ps1!  The characters are funny, the story starts slow and then it hooks you when you least espect it, the villians are not what you actually espect from typical villians. It feels like the creators of the game wanted to break out from the typical molding of RPGs of the oldschool times and created this Honestly I had a great idea to write a full review of this game, but I can't help myself to get hyped while talking about it.  Im just going to say that this game could have put up a good challenge against the old rpgs of the PS1, Its simply a must buy if you enjoy RPGS and Im freaking looking forwards for the next 2 parts of the saga, this game is simply amazing and it wont dissapoint you.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent JRPG with fantastic story and solid mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "I´ve played RPGs on PC and other Platforms as far as I can remember back. But the last RPG I actually finished was Dragon Age Origins. I don´t really know, what happened after that point - but to me it somehow seems, modern games in this genre have lost something. Something, I´m somehow unable to name - for the time to come, lets refer to it as 'Charme'. Visuals made a really big step forward, but somehow that little special something, which makes a game unique got lost on the way. I didn´t like the last 2-3 Final Fantasy Games, neither could I enjoy Dragon Age Inquisition. For me, the genre was kind of dead.  Until last summer. I stumbled upon Trails in the Sky. I´ve heard of the game before, but I only knew it was originally a PSP Game with ... well lets say decent critcs. As a huge fan of JRPGs I thought 'okay, 15 Euros - you can´t make much wrong at that price' After that I have to admit, I sort of forgot about the game since I had to work abroad for almost half a year.  In my winter holidays, I finally found the time to tackle the game.   It sort of left me back stunned. I finished the game in about 50 hours, In three days, in one go. I dont even remember the last game, which managed it to make me to this. I won´t praise Trails to the skies, (pun not intended) it has enough flaws in my opinion. I mean the story in the first installment is ... well somewhat predictable if you ask me and I don´t consider it very original, but it somehow breathes that certain atmosphere or charme I talked already about. The protagonists, as well as the rest of the main cast, are incredible likeable and you simply want to know, whats happening next. So, all I can actually say is - buy it, support the developers and simply enjoy it.  Id like to tip my head to XSeed, for bringing us such a gem. All I can do now, is to wait for the second part and hope I won´t have to wait for to long. But nevertheless, SC is already on my 'buy on sight' list",
            "review_score": "1"
        },
        {
            "review_text": "Oh ♥♥♥♥ The Chests Have Messages!!  Well time for new game plus.  No seriously didn't know chests had hidden messages after 2/3 of the way into the game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's I've played in years, its quite simply spectacular, the writing is amazing, the characters are relatable and really awesome, the pacing is nice, the game just feels whole, and the funny thing is... It's just the beginning.   If you love RPG's you should take a gander at this, its really one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "I've only played a couple of game 'days' (just past the farm), and I'm already VERY impressed with this game. It's funny, the battles are fun, the artwork is lovely, and the game overall simply gives a very polished, proffessional feel. If you like JRPGs, chances are good you'll like this one.   (As for language, the English is very good - I haven't noticed any engrish at ALL - and I've only noticed one use of questionable language, which is refreshing in an age where everyone feels the need to add foul language to everything for absolutely no reason whatsoever.)  This is definitely a title I feel bad having gotten on sale (though I might not have tried it had it not been on sale) because it's worth every penny of the full price. Maybe I'll buy the sequel(s) at full price. :)",
            "review_score": "1"
        },
        {
            "review_text": "I used to think old school FF games were one of the best, but oh boy how wrong I was. This is the best JRPG I ever played. Great story, characters, battle system, TONS of fun with the dialogues and chests. I think the only thing this game lacks is a better soundtrack. Still a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great Story. Lovely characters. For me the best JRPG Game on Steam. A must have for JRPG fans.  Can't wait for the second chapter. Hopefully this summer.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really hard to judge. First said, I normally dont like to play games on computer, when I could play them on a gameboy too. The only drawn scenes, which i hoped there would be more from them, where the intro and the ending sequences. The story itself is fantastic, the whole heroe, i mean bracer thing is a cool idea. Even so, i didn't liked the ending, its a bit clichee how the involved person acts. (And I hoped, the male would be the maincharacter, though ;) ) Sound is interesting, especially the music josh plays. Fightsystem is okay, but there could be a brother range in difficulties. Last critisicm: It would be great to have some influence of the story (I hoped to bring josh to love kloe, but he still loves his sister)",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Solid RPG. Was never bored. I like how they made use of all characters! Can't wait for the sequel! Day one pre-order!",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the better JRPGs that I've played in years. Fantastic story, decent combat. Looking foward to the release of the second chapter.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Sadly I'm only a casual gamer who has too many great games who doesn't have time to finish them all. Darn you STEAM!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's funny how easy it is to write a review for games that you didn't enjoy and how hard it is to write them for games you loved. This is a game that I loved!   There was much to enjoy in this game for me from the writing of the main characters, to your traveling companions all the way down to the little wandering townspeople who's dialogue changes with the events of the story you can really tell that a lot of effort was put into the dialogue in this game. It didn't give that feeling of bland lifelessness that many newer games do with their worlds that may be populated with many people, but they all say the same thing or are just simply filler objects with no dialogue whatsoever. To put it simply, I found that I cared about the characters and that is something that is missing from the writing of so many games today.  The story was engaging and filled with humour and suspense that has you pondering the various mysteries that are introduced throughout the plot and are resolved in a way that left me feeling both satisfied and ready to grab the next chapter in the series.   The music wasn't heavely varied but was well placed and helped establish the atmosphere of the many locations you will visit with a few tunes being memorable.  The battle system was fun and allowed for a variety of tactics without getting too bogged down in overcomplicated game mechanics. The battles where fun and seemed to be designed in such a way as to offer a bit of challange without putting the player through the annoyance of having to constantly retry because you weren't using a tactic that was designed for that particular fight. (I'm looking at you FFXIII &gt;:|)  Overall, the game was a long adventure that was filled with wonderful characters that I enjoyed and left me with pleasant memories. I really do recommend this game for people that miss the well thought out RPGs that just don't seem to exist anymore.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, can't wait for part 2!",
            "review_score": "1"
        },
        {
            "review_text": "It Was a Great Game, Interesting Twist at The End. Truely Enjoyed The Game, Cant Wait For The Sequel",
            "review_score": "1"
        },
        {
            "review_text": "I think this is my 2nd JRPG after Fire Emblem Awkaing. I enjoyed the hell out of the game. Simply buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I almost didn't get this game as it seemed there were a lot of bugs.  However, I got it anyway, and have enjoyed it quite a bit so far. I'm only in chapter 2 at the moment and have only come across one game breaking issue (which I believe they have patched - it's where I had to open a chest to fight a sidequest monster and I got stuck in place after the fight ended; restarted, opened the chest from a step farther away, and no problems ever since).  It's a very enjoyable old school tactical turn-based RPG. You do not customize your character stats, but you do get to pick equipment and what magics to equip --- you don't, however, pick your clothing or anything like that. You can go and grind to get more XP and items to craft your magic ability, or you can just go at it head on.   I've played some games where setting up your 'formation' in tactical turn-based game was useless, but I've found it really can make a difference against higher level or higher-number opponents.  The game is a bit lightweight in the customizing department, so I would label this as a 'simple RPG' or an 'easy to pick up RPG'.   Graphics are not bad. Sound is not bad. Overall, it's just a lot more enjoyable that I thought it would be, and way, way less buggy than I thought it could have been. I hope they do the other games in the series as I would definitely buy them.",
            "review_score": "1"
        },
        {
            "review_text": "A great story with an excellent pace, likable characters and fun game mechanics. The only downside is waiting for the second chapter to come out!",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game (first chapter). Great characters, very fun personalities. Love the story as well, it manages to stay coherent and provide valid reasons to keep you running around every possible location on the map. The combat is also very well balanced - not difficult (I lost and retried less than a dozen times overall) but does require you pay attention to what is going on. It is quite long and has lots of details (lots of NPCs with dialogs as well) for a game that is possibly intended for younger gamers - no blood, no deaths, no strong language, etc. But perfect for someone like me that enjoys story-driven JRPG. Xseed Games - get off your collective butts, guys, and finish translating the second chapter already! And the third! I would buy them instantly. Too bad I can't read Japanese..",
            "review_score": "1"
        },
        {
            "review_text": "A very fun turn based RPG. Reminds me of some old school RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "A classic JRPG with great story and memorable characters. Can't wait for the sequel!",
            "review_score": "1"
        },
        {
            "review_text": "The best RPG I've ever played.  I experienced some issues with the video cutscenes (OP &amp; ED), but the whole game was flawless. Now, time to play SC, and I hope TC will be transleted soon :D",
            "review_score": "1"
        },
        {
            "review_text": "Very good. Best classic JRPG style game I've played in a long while.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. Good combat system, great dialogue. I'll warn that it's very wordy so if you don't feel like doing a lot of reading, you may find yourself skimming, but it's still totally worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "I have no words to explain how good this game is.  It starts off slow, sure, but once it picks up the pace you're in for an amazing game. It ends on a cliffhanger...But soon that won't matter...Or so I hear.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game long and boring to start out with but as the story progressed, I got more and more involved and it was addicting and I even put off finishing the game because I didn't want it to end. The ending still bugs me and I won't be satisfied until I get the second chapter. 10/10 would play again and definitely recommend this game to anyone who looks at it. Had a very engaging story and really drew me in and the characters were easy to connect with. While the cliffhanger ending is bothersome, it's well worth playing and waiting for the next part. So yes, if you don't have this game, I'm giving you some good advice when I tell you to get it NOW!!",
            "review_score": "1"
        },
        {
            "review_text": "This might be the greatest JRPG we have ever seen, the most criminally underrated of all time. The story is amazing, the stategic and turnbased gameplay is addicting and challenging, I love the S-Craft limit break like abilities that you can pull off at any given moment as long as you aren't messed up with a status effect. It really surprised me and I love this entire series now.",
            "review_score": "1"
        },
        {
            "review_text": "I have been following this game for a while now, waiting for it to come out on PC. I owned it for PSP, but never got around to playing it. I now see what I missed and am glad to be experiencing it for the first time. Highly recommended for JRPG fans. Light-hearted, great battle system, interesting story, I can't wait to continue playing.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played a JRPG this great since Skies of Arcadia, my personal GOAT. The slow combat is made up for by a decent cast of anime troupe-y characters and solid world building.  It's a game that has lots of small details scattered about. And it's all those little things that make the game so damn charming. NPCs have stories paly out over the course of the game. Treasure chests talk, and they insult you.",
            "review_score": "1"
        },
        {
            "review_text": "Good: Fantastic story - great characters -very cute emotions - fun battle system - decent magic system - lot of wandering - bracer board is meh",
            "review_score": "1"
        },
        {
            "review_text": "Synopsis: With an unbelievably detailed world, a great soundtrack throughout, and a beautifully detailed story (and characters) Trails in the Sky is one of the best JRPG series available to date. The first game in the Trails series (a trilogy, currently with game 2 in the series predicted to get it's US launch in 2015) introduces us to the heroes of our story, Joshua Bright and Estelle Bright. The game, with between 70-90 hours worth of gameplay, follows the story of our heroes as they set out from their hometown in their quest to become full-fledged members of their guild, the Bracers. Over the course of their journey we're able to watch as both Joshua and Estelle grow and meet a number of other individuals who aid them in their quest to bring peace and resolution to the rising turmoil in their home country of Liberl.  While I could ramble on and on with a wall of text, I think that this is a fair synopsis of the story, and as such will proceed to the pros and cons of this game.  Pros: Up to 8 playable party members, each with a fully developed backstory that's revealed as the game progresses  Great voice acting (even in English!) really sets this game apart from numerous other RPG games  Graphics fit well with the genre and themes of the game and are complimented well by the game's music, though they are clearly not the most modern graphics available  Rich story-driven game experience, something every JRPG fan will be able to love and appreciate  'Quartz' system allows for characters to be dynamically built to fit almost any role they're needed for  Detailed dialogue with both NPCs and [empty] Chests builds a more immersive game world for the player to explore  Large, flowing game world that feels neither to linear or too small for the grandeur of the story  Guild questing system offers a prevalent, immersive side-questing feature to the game  Cons:  Part 1/3 in the Trails series, while not truly a 'con' per-se only part 2/3 has been confirmed for release in the US (allegedly via Steam) in 2015 despite all 3 parts having been released overseas already, if part 3 never makes it stateside fans of the series will have to seek out a 'fanlated' download for the 3rd installment as all 3 parts combine into a single complete story (yes, each sequel is a DIRECT sequel, picking up right where the previous game left off)  Preemptive strike can be finicky at times, registering a monster's facing as having changed up to 2-3 noticeable seconds before the on-screen model responds to the change   Backtracking, LOTS of backtracking, I can't stress enough how much backtracking there is in this game  And following right along with backtracking, monster spawns have no variation or randomization to them, instead each monster model will always result in a fight with the same type/amount of enemies each time you engage it, which leads fight to grow repetitive over the duration of a chapter  Expensive quartz crafting system makes optimizing characters costly and time consuming  Final Evaluation: Truly, this is one of the best JRPGs that I have played in ages, and it's easily my favorite start to any series since Tales of Symphonia got its US port. So what can I say? The pros here speak for themselves, this is a game deeply entrenched in the ideas of good storytelling first-and foremost and it serves this game well (as it serves any quality RPG well), especially with how well the voice actors were chosen for the US port of this game. Plus, after so long with the Arts system used in the Tales series the Quartz mechanic was also a nice fresh breather from what had become oh-so-familiar. The cons are more of a hit-or-miss experience wise, and for the sake of my final evaluation I'll overlook the obvious glaring issues with this game being [part] 1/3 in a series where the ending may never even see the light of day (officially) in the US. The quartz system's costs and the monster spawns depend on you personally. I didn't mind the quartz format since I never ran from combat, but never running led to numerous boring fights that really made me 'feel the grind'... so to speak. Again, for me, the backtracking didn't bother me as it typically comes with the JRPG territory but for others this can be a big turn off, especially with all the side quests this game features.   The Final Take:  Graphics - 8/10 These graphics really fit the game well. Clearly a step up from the traditional JRPG turn-based combat system but falls a bit short by failing to go all-the-way and implementing real-time combat and appropriate AI.  Audio - 10/10  A beautiful soundtrack that is used well throughout the entire game to truly maximize the emotions any given scene is trying to evoke in the player. Perfect.  Gameplay - 7/10 Gameplay can be hindered, at times, by the lack of 360-degree control. This is especially noticed during travel between places and attempting to engage from behind enemies. The preemptive strike mechanic also seems to be somewhat glitchy and it would be remise of me to not take these flaws into account when thinking about the game's overall gameplay. Otherwise, it's a solid, all-around JRPG... though I do wish there were a bit more player control on the battle map.  Game World - 10/10 An amazing game world with a very detailed society and social structure. Coupled with the flawless execution of cross-border politics and the promise of other countries opening up to the player in the remainder of the series makes this a land no JRPG fan will be able to resist exploring.  Story - 9/10 A very well executed story. Cliché at times, predictable at others, and a bit underwhelming in the climax due to the carry over into the rest of the series. The characters develop well over the course of the game though and all of the characters are very likable. With well written dialogue and a story that operates smoothly on a national scale it's a thoroughly enjoyable experience.   Difficulty - 6/10 Hmm... this one's a bit difficult. Leveling is almost unnecessary through most of the game, you'll do just fine just fighting what you happen to run into by chance. Until act 4. Once you reach the final act enemies are MUCH more durable and dish out FAR more punishment. Dungeons in act 4 serve to power level characters to the level the game wants them at (which in my case was a 10 level bump into the 30s from the 20s).   Final Score - 8/10 A very well done JRPG with solid overall presentation throughout. Beautiful music, quality writing, and genuinely likable characters transformed what could have been a passable story into a truly memorable experience. If you don't like turn based combat or the JRPG genre then this game might not be the right game for you but for those of you who like an expansive, immersive JRPG story this is a must own series. ",
            "review_score": "1"
        },
        {
            "review_text": "SHORT VERSION: If you like games with well-crafted lore and setting, lovable characters and excellent attention to detail as well as world-building, this game is definitely for you. While it may start out slow, it's because it takes it's time to build up, and in the end it will be all worth it.  ________________________________________________________________________________  Have you ever felt nostalgia for something that you haven't played yet? This was what I felt when I started playing Trails in the Sky. Made by Falcom back in 2005, Trails in the Sky tells the story of a plucky young tomboy named Estelle, and her adopted brother Joshua, as they take on the role of junior members of the Bracer Guild, a group that undertakes tasks and requests to protect civilians and maintain the stability of their country, the Liberl Kingdom.  The story itself is very well presented, and is really something that modern JRPGs lack. The characters themselves are likable, with humorous banter, good one-liners and engaging dialogue when push comes to shove. The amount of foreshadowing is insane, having the subtlest detail early on in the story developing and playing a huge role later on. While it starts out fairly tame, with a bit of a slice-of-life atmosphere as you take on various sidequests from the Bracer Guild, it slowly becomes evident that something is happening within the kingdom, as numerous incidence and weird coincidences occur starting from an airship hi-jacking, which escalates into a full-scale conspiracy. The feel itself is reminiscent of late 90s to early 00s JRPGs like Suikoden and Xenogears, as the developers themselves wrote the story for years before they could even make it into the game, making sure that no plotholes or sudden asspulls happen in the story. There is focus on world building too, as there are various notes and NPCs in the game that shed some light into the history of the Liberl Kingdom, from political structure, history of the royal family, political events and relations with its neighboring countries, as well as regional customs. This can also be seen in reading the Liberl News issues, an in-game newspaper that can be bought and will not only shed light on recent major events that your characters have partaken in, but also show off backgrounds of places and traditions in the kingdom.  The gameplay involves traditional turn based JRPG action with a bit of tactical movement thrown in with the use of movements in grids and heavy emphasis on turn order manipulation. Its a relatively simple formula, but becomes interesting as you gain more skills that work with turn order. Unlike most JRPGs before, status effects are actually good in this game and is key to making short of hard to kill enemies and/or bosses. The skill system has a bit of depth in it, promoting mixing and testing different combinations of gems (or Quartz in this game) that results in different skills.  Exploration is open-ended. While the game doesn't have a full world map and eschews for interconnected highways and roads like Final Fantasy X, the game encourages players to explore areas that are available to the from the get-go, which rewards players with good equipment, good leveling spots and sidequests. Sidequests in this game are entertaining, as they're not just fetch quests or eliminating X numbers of monsters, but rather involve bit of investigation and decision making for full reward. This, coupled with the characters throwing witty dialogue makes sidequests fun to do and not feel soulless or seem like padding.  As with all Falcom games, Trails in the Sky excels in the music department. The musical score ranges from a jazzy battle theme and upbeat field music, to relaxing seaside themes and orchestra. The selection makes every scene count and fits right in whether it be a sentimental one or while traversing along the highroads. Just the opening theme itself gives the player of what to expect from the game, starting slow and steady and slowly making its way to an epic orchestra.  As far as it goes, Trails in the Sky is one of those games that I really really want to promote, its a very under appreciated and niche gem, made with a lot of heart as well as attention to detail and good story telling. With a good amount of drama, mixed with political intrigue and with a dash of humor, Trails in the Sky is a game that harkens back to the days of quality JRPGs.",
            "review_score": "1"
        },
        {
            "review_text": "I've only played and finished the PSP version, but I decided to give a try for this one too. So, for quick review :  + Good story (this is important) + Fluid control, either with controller or keyboard and mouse + High resolution with good 3D + Pretty good voice acting  - The texture kinda low at higher resolution. It's looks good on low-res display like PSP, or if you play it on TV. But on PC, usually people are barely one meter from monitor, sadly the texture looks blur. - This is subjective, but I do hope this has dual voice. Yes, I am aware with the lisencing issue. The English voice is good, but I still prefer the original voice  especially Tita .  Foods for thought :   This is only the first part of a trilogy (Second Chapter and The Third), and so far, only First Chapter (this one) get translated. I really hope they'll release the english version for both SC and Third. Or else, you are stuck... like me ;_;.   Based of what graphic card you have, you can override the setting from your graphic card control panel, so you can maximize the graphic. I have maximized the anti-aliasing, and now the 3D looks really smooth.   So yeah, I recommended this game. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "What I can say about this amazing game. I already own the PSP version, and I had to buy the PC version just to support it. I didn't play the PSP version. But after waiting and waiting, I heard they're gonna re release this game on Steam. So by luck, I had to buy it.    So good part about this game.  Pros: If you love Lunar settings and Grandia somewhat battle system, you'll feel right at home.  Pros: Amazing music. Some music repeats here and there, but it won't ruin it. It's fun to listen to it. A+ Pros: The characters are amazing. They're not too 'Animelike' But they're fun and great.   Cons: The only bad thing I have to say about this game, the battle soometimes takes long time to finish. Not a bad thing, just takes a lot of time to beat.    Final thoughts: Lunar + Grandia = Legend Of Heroes. Great game. 8/10. A MUST HAVE!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic! The characters are memorable, late game strategy is fairly complex and there's no lack of challenge at higher levels. I love the story, and I can't wait for the next installments. If you enjoyed Xenosaga/Xenogears or some of the earlier final fantasy installments you're going to love this game.   Best features:  - Characters all play very differently. The story gives you plenty of time to learn each character's strengths and weaknesses, and while you cannot control your party until the end of the game (for truly legitimate storyline reasons), once you have that control you can put together some really interesting dynamics for the end game. Teamwork is important, and many characters have skills that allow them to function in multiple roles without breaking away from their overall archetype.  - Deep and engaging storyline. For a first chapter I'm really excited to see what happens next. The initial story is fairly self contained, but the characters are developed just enough to give them true depth without revealing everything about them. It seems clear that the next installments will expand on each character, and I honestly can't wait to see it. The bad guys are developed in a similar manner as well, and there are already indications that some of them will be returning in the sequels. Character motivations are unambiguous (except for when they need to be), and personal conflicts are well defined.  - Unique skills are awesome! Individual character skills are highly accessible, very powerful when used properly, and thematic to each character. A full party can shift gears from offense to defense at just about any time with these skills, and the enemies are vicious enough to reward both aggressive and conservative playstyles when necessary.  - Very Limited level grinding. XP received is based on your character level. If you're below level for an area you will gain levels very quickly. If you're overpowered for an area you will gain levels extremely slowly. As such, you will quickly rise to the appropriate level for a given area until it's time to move on.   Areas that need improvement:  - Itemization is dull. There are only a few game changing pieces of equipment. Most are just currency sinks that keep you in line with the enemies' power curve. In most cases characters will upgrade automatically (aside from the two main characters). It would've been nice to see more variety in the gear.  - You can miss out on sidequests. If you're not careful you'll bypass a lot of hidden quests, or if you advance the story line too quickly you'll lose access to some quests forever. There's no real reason for this other than 'time constraints.' The only benefit of this system is that you can't really overpower the sidequests, but for completionists it's a pain.  - Magic feels underpowered. For the most part you won't really need to use magic aside from healing. At low levels you don't really have enough MP to build a dedicated mage, and at higher levels it's difficult to stack quartz in a way that really maximizes the power of magic since the quartz that boosts magic damage is blue, and blue is primarily for healing magics that heal for a fixed amount and are not based on your magic stat. Since you need to stack the same color to gain access to the most powerful spells, the system seems to work against itself as a result. Magic is used in a few very specific circumstances, but any character can do the job for the most part.   Overall: 9.5/10. The games flaws are minor and nitpicky. It's strengths are glorious. This game is worth every cent.",
            "review_score": "1"
        },
        {
            "review_text": "I am not really a JRPG person. Does Fire Emblem Awakening count as a JRPG? If it doesn't, I believe the most recent one I played is Phantasy Star IV on an emulator. Other than that, I've primarily been acquainted with WRPGs.  But this game is great.   As of the time I write this, It strikes a delicate balance between modern and classic RPGs. In terms of being player friendly, it is neither hand-holding or frustratingly cryptic. The graphics are outdated but pleasant, a good mesh of 3D and 2D and character portraits with a wide range of expressions (something I always appreciated since FE). The battle system calls for no mastery of strategy, but it's always satisfying to nuke a horde of enemies with a big fat AoE.  So far I spoke only of how this game might be acceptable. Why do I like it so much? The story, my dear boy, the story.  By story, I mean everything from the background of the world, to characterization, the plot, and how it's all presented. The steampunk-ish world where there are monarchs, airships, and magic goes between almost idyllic and gut-wrenching (in a good way) as events unfold. All the NPCs you meet have their own lives, and although it may be just a few lines, they change over the course of a chapter so you can see how their stories progress. The plot constantly piques your curiosity, but is not overbearing and feels natural, thanks to the focus on the main characters meshing beautifully with the standard secret conspiracy/shocking reveal fare of JRPGs. You'll grow to like them and care about them, and see things unfold from their perspective. Witty dialogue from a hardworking localization team certainly helps as well. In retrospect, you might be able to play 'spot the cliches', but the game manages to make it immersive and engaging.  Oh, and the music's great too. More focus on chill than epic, but that's how the game rolls.  So I think you should buy this game, worth full price, and if you're too poor for that do buy it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is second best JRPG on steam. (the best being its sequel, Trails in the Sky SC)  The story is fantastic, the soundtrack is amazing, the character customization is simple yet complex at the same time, the battle system is straightforward, but with a surprising amount of depth, there is a ridiculous amount of dialogue and backstory for just about every major and minor character. It's nearly perfect in every way.  If you have any interest in JRPG's whatsoever, there is no reason not to buy this. It's 40-50 hours of pure JRPG joy. And when you're done beating the game, and enjoying it, then you can get another 70 hours out of its direct story sequel, Trails in the Sky SC. This is as good as it gets.",
            "review_score": "1"
        },
        {
            "review_text": "I got to admit i am very impressed with this game, Alot better then expected, The story is fantastic and the animated scenes are soooo cool. And that's what i love about JRPG's they know how to make awesome RPG's and add amazing story lines and music to them, Unlike the typical american hack and slash type of RPG games that get too repetitive and start to drag as you get deeper and deeper into the game play. They need to add more fighting action with kicking and dodging and punching and slashing and pile them up into combos Dragon Nest is the perfect example, Whoops! im getting off topic lol If you like a deep emersive fanatasy love and hate story with tactile turn based combat and great animation you will love this game. I think its way better then Y's and Agarest by far. I did find some cons on the games UI and a few of the key functions. But not too much to worry about where it could affect the game play. I just wish they would make more games like this. The PSP has tons of those awesome JRPG's i wish they would port to PC. A must have game if your a fan of anime and JRPG's and turn based. TWO THUMBS UP!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "Best the genre can offer!",
            "review_score": "1"
        },
        {
            "review_text": "It was an entertaining game!  Some of the dialogue caused eye-rolling, but that is to be expected to some extent. ",
            "review_score": "1"
        },
        {
            "review_text": "Next please.",
            "review_score": "1"
        },
        {
            "review_text": "Old school RPG. Music is great.",
            "review_score": "1"
        },
        {
            "review_text": "From the beginning to the very end, Trails in the Sky FC ( First Chapter ) is a mix of really warmful feelings with a tiny bit of darker elements.   The main story itself is simple and has been seen quite a lot already.However, it is the entire cast of characters who make it such an enjoyment to fulfill the role of a couple of young bracers in the Kingdom of Liberl. Estelle and Joshua, the two main characters, works very well together. And that complicity,until the very end of FC, with each chapter introducing new characters to team up with, each playing an important part in the whole story, will bring you a great deal of good emotions ! But that's not all, FC standing for First Chapter, there is of course a second chapter coming, and it seems FC is just a prelude to emotionally prepare the player for the last minutes of the game and what is to come in SC. You'll have to play the game to understand.  While FC truly shine thanks to its characters and their story, it is still a rpg, meaning a combat system. It is classic but quite good, thought some combats are a bit long and leveling is needed from time to time. The item and magic system ifsa bit unusual and feel underused. It is still rather simple an easy to use, but be aware of you spending, because you can quickly run out of money if you don't farm a bit.  Add to all that the technical part, lovely visuals, graphims, cute chara design, and a great soundtrack. Yes it is now one of my favorite rpg.  So in a few months hopefully; the second chapter of Trail in the Sky should be released, which is supposed to complete the main story. Feeling heartbroken by the end of FC, considering its ending, such a cliffhanger and all that has been left unexplored. So hopefully again. the wait shouldn't be too long before going back adventuring with my favorite bracers and their friends.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the best JRPGs on the PSP.  The localization is incredibly witty and the story does a great job of stringing you along with a nice organic plot that isn't some 'you're the hero' cliche. The game does use plenty of tropes, but the writing keeps them feeling fresh all the way through.   It has turn-based combat, with a bit of positioning involvement. And the CP system is a pretty neat way of making you choose whether to save your points for massive attacks or use them on smaller special attacks, when the big attacks would just be overkill. Also, every character has a decent amount of customization of their spells and whatnot through the orb system.  The PC version so far has some pretty glaring bugs, but looking at the Hub page, the developers seem to be updating to fix them as quickly as possible.   This game, also, is merely the first part of an overarching story, and ends on a bit of a cliffhanger. I'm rebuying this game here, mostly so that I can help fund the localization of the second game, coming sometime next year. There is apparently some added content also, but I haven't read too much about it yet. And yes, I plowed through the game, and it did take a good 40+ hours. I don't think I did everything, but I did as much side content as I noticed. With the new achievements, that time could get stretched much further if you're into that sort of thing.",
            "review_score": "1"
        },
        {
            "review_text": "-Likable characters -Good Story -Amazing music -Lots of content -Decent combat system  Buy it it's fun. Now we can all wait for the sequel to get translated.",
            "review_score": "1"
        },
        {
            "review_text": "Slow start, but picks up during chapter 2. Great ending and is remniscent of Grandia's gameplay. I found myself skipping battles more to get to the story more though. Hopefully the third game gets translated after the second comes this winter.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the nostalgic JRPGs of old, then this is right up your alley. It has all the great things thatthe old school turned based games had. There are no relying on flashing icons to find a quest. You have to actually read it and locate it yourself. The one thing it lacks is the 'click on every dresser, bookshelf, night stand and crate for random loots' that I loved on my old PS1 games.  For those of you that remember the days of ready dialog, looking for quests on your own and enjoying a game that doesn't make you feel like you have to rush to power level, then purchase this game.  For those thatenjoy the lazy mans way of questing by relying on flashing icons to show you where to go, feel like you have to power rush to level and hate ready dialog boxes, this game will probably not by to your liking.",
            "review_score": "1"
        },
        {
            "review_text": "!",
            "review_score": "1"
        },
        {
            "review_text": "Haven't completed it yet, but this is a REALLY good strategy JRPG. Great worldbuilding, great characters, great jokes. There's just so much about the game that simply feels right.  But if I have to find something to complain about then it's the UI, especially if you're playing with a controller. It works, but it could've been a lot better.",
            "review_score": "1"
        },
        {
            "review_text": "I'm giving this a thumbs up, but be warned it's very long. I have put in 60 hours and at about the 45 hour mark I just wanted it to end. Worst part was the final boss, or the fake final boss. After to beat him you fight the real final boss, but wait there's more! The Final boss isn't done when you defeat him, he transforms into an ever more powerful form. It's about a 90 minute fight for all 3 battles, and you can't save after each battle. I got tired of fighting and let him kill my party, I was doing 1k attacks and it was barely moving his health. I loved this game til the last 15 hours I put into it. I 100% Ni No Kuni and never once wanted that game to end. They just drag the story out too long in Legend of Heroes.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. I like the most is the extensive storyline. It feels like those FF series I been playing. The boss fight was pretty decent as well.",
            "review_score": "1"
        },
        {
            "review_text": "I'm normally not that interested in a long-winded story... but this one is different. The battles aren't just 'point, click, hit tihings'; you have to actually think some things out. The soundtrack ain't half bad either. Well worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, Great soundtrack, Great gameplay, Great game   'you can take my contents, but you'll nver take MY FREEEEDOOOOOM!'-Chest in Chapter 2",
            "review_score": "1"
        },
        {
            "review_text": "the best RPG on steam until second chapter comes, serious this is a game for true jrpgs/rpgs fans it may start really slow but the pay off is outstanding, no to mention the soundtrack that my have some boring songs(swap the battle theme for the ZANMAI REMIX and it gets amazing) but on later chapters it get fantastic just listen to ,SILVER WILL on youtube, but not just the soundtrack but everything gets great, it been a long time since i got this invested on a game. plus its worth buying to support XSEED alone, those guys deserve it.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is like any other JRPG. Great soundtrack, balanced battles, skills, and geat abilities. Don't try to be an achievment person in this game, you'll just waste your life. Instead focus on the amazing and beautiful story.",
            "review_score": "1"
        },
        {
            "review_text": "*DISCLAIMER* This game has a few issues but they are getting patched out at light speed. When I first tried playing 1080p didn't work, nor did fullscreen. Now they do. Controller support was buggy, now it isn't. There are an odd couple graphic bugs left, like poor resizing due to the game being made for 4:3 ratio and playing on 16:9 but oh well.   The story is fairly slow paced. If you like that is a matter of opinion. The battle and magic system is pretty cool. Every NPC says it's own text which changes after each event. Even item chests have their own custom dialog if you examine them after looting them. My issue with the game is the ending. Oh boy what an ending. I played this game for 42 hours for *that* ending. I am so very frustrated.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun JRPG. Good story, characters are very interesting. I wish there were more weapons and armor and items, hopefully if they make a 2nd one. Could also make leveling a bit easier. Over all a very well built and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "best JRPG on Steam",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ing devoured this game. The story while a little long, is good. Tons of twists and turns and when it all comes together in the end, the pay off is amazing. The combat isn't groundbreaking, but it is more involved than your standard ATK/MAG until the mob is dead. Character design, music, and art style are all quite nice as well. Long story short, I'm already chomping at the bit for the second chapter to come out later in '14.  If you loved FF7, or any of the Tales... games, do yourself a favor and check this out.",
            "review_score": "1"
        },
        {
            "review_text": "A LOT of conversation early on... But so far so good! Looks solid. Great music!",
            "review_score": "1"
        },
        {
            "review_text": "After playing it on the PSP briefly I decided to get it.... I don't know if it's just me and my settings but it is not 16:9 aspect and it kind of sucks playing it on my TV, still the game is awesome. Packed with content. Hours and hours of gameplay. And to have this game wherever I take my laptop its pretty fun. I was missing a good old turned based strategy RPG and this one made it for me. Recommended if you like JRPGs",
            "review_score": "1"
        },
        {
            "review_text": "Somehow this game makes me nostalgiac without ever having played it before.  It's a very well put together JRPG which will remind you of earlier PS1-PS2 titles, specifically Grandia, Chrono Trigger, among others. A lot of side quests, and great exploration. The story so far is 7/10 for me. It's not overly epic; you're more a private detective mercenary then a world saving hero. Then again, I haven't finished it yet.",
            "review_score": "1"
        },
        {
            "review_text": "Little bit cheese, great combat.",
            "review_score": "1"
        },
        {
            "review_text": "Short review: I like the battle, customisation and (mostly) the characters but I hate the backtracking. Anybody else who wants to play a JRPG and isn't happy with the crap on PSN (like I'm ever going to play Hyperdimensional whatever or some other paedophile game) should play this",
            "review_score": "1"
        },
        {
            "review_text": "Its a long time since i`ve played an RPG game that really got me interested and addicted... I have searched and played so many games and without any luck. just one after another common, boring RPG game with an 'exiting' 'new' battle system.. bah, that line there is used up, I believe. But this game did just the opposit of that! The story &amp; dialogue is wonderful, the gameplay &amp; battle system is SIMPLE (The way it should be), awesome and satisfying. I felt the urge to continue until the end, and I am glad I did! This game is fantastic to say the least. My favorite game of all time is Grandia on Playstation, and this game had a similarity to that game!  10/10*",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, very well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure I have much else to say that other's haven't. If you're a fan of oldschool JRPGs with a lot of text and story then you should definitely get this.  I went to the trouble of getting all achievements.",
            "review_score": "1"
        },
        {
            "review_text": "The treasure chests alone makes the game worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "If you are into story heavy RPG's then this is for you. Well worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "this game, pure AWESOME no negatives here AT ALL if you like jrpgs and snes style chrono trigger ish stuff THIS GAME wont let you down  I wont go into huge detail, but vs other games of its genre, this rocks just wish the whole series would come out on steam pc  (there are like 9 games in the series) ",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good. I'm planning on doing a longer review later, but for now, this is all.",
            "review_score": "1"
        },
        {
            "review_text": "Do it, add to cart.  This will make you happier.              do it  ",
            "review_score": "1"
        },
        {
            "review_text": "Just buy this gem. also i hope they fix the crashes.",
            "review_score": "1"
        },
        {
            "review_text": "Games is made by Falcom, one of the premier traditional JRPG developers. Unlike the Ys series with great action intensity and boss battles, Trails in the Sky allows the player to immense themselves with enticing world building. It's a slow burn but one that hooks you after a while.  The long awaited JRPG arrives, at a very attractive price to boot.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!  I never heard of the game before, but quite a hidden gem of a game.",
            "review_score": "1"
        },
        {
            "review_text": "For me it's been years since I've played a JRPG. As I've gotten older, my interests turned to dark, more serious RPGs, like the Elder Scrolls. However, I still decided to give The Legend of Heroes: Trails in the Sky a try and I was impressed how much fun I've had in the short amount of time I've played. Trails brings back the old-school feel of console RPGs, while still embracing new game mechanics. The combat system, although simplistic, still carries a touch of complex customization to keep players interested.   The story and the characters are instantly likeable, funny and charming in their overdramatic dialouge. For someone who grew up on Final Fantasy, the Tales series and who's first console RPG was Lunar, Trail's handling of characters sure brings back memories, while making new ones. But this review isn't carried solely on nostalgia. Trails stands on its own. The combat is smooth, even on an older laptop as mine and the framerate hasn't even been an issue. Playing it with a USB controller was instantly recognized, without any issue on my part to set buttons. Although I've yet to clock in ant double digit hours, I've throughly enjoyed everything about this game.   I hope STEAM recognizes the flood of positive reviews for this game and works double-time to bring more JRPGs of this nature to us. If so, I'll buy it. For us older gamers, it's a nice break from the dark and gloomy RPGs, and to sit back, laugh and have fun in this light-hearted adventure.",
            "review_score": "1"
        },
        {
            "review_text": "The art style is outdated and, the keyboard controls are blah, but I'm liking it. You should also check out the Ys games!",
            "review_score": "1"
        },
        {
            "review_text": "100 hours of talking to every NPC.",
            "review_score": "1"
        },
        {
            "review_text": "Only 7 hours in, I can already tell that this is one kickass JRPG! Also, save anywhere is awesome for people who may have to stop playing at anytime.",
            "review_score": "1"
        },
        {
            "review_text": "Don't start it if you don't want to spend 2-5 painful years awaiting for the last chapter to be released on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Tbh, Final fantasy tactic combat system doesnt quite suit my taste and the battle are a bit tedious (no random encounter though). I'm here for the great soundtrack and story rich tags. And finally I was able to find the Japanese voice patch and enjoy the game in my weaboo mode.",
            "review_score": "1"
        },
        {
            "review_text": "Defines the word 'nostalgia'  For those who really loves old school RPG, turn-based game with Rich Story + theme songs; I would recommend this game, period...  The only thing that concerns me is, when is the Second Chapter coming out? Damn the ending trailer!",
            "review_score": "1"
        },
        {
            "review_text": "This is the first RPG I have played where the combat never has those stupid  What the heck just happened I missed 5 times in a row and then got crit to death?!?!?!  moments. (it has happened to me in some games) Each turn has specific turn bonuses, (anything from standard crits to healing and strenght boosts) and if you play correctly, you can steal them from your enemies with a special attack (I forget what they are actually called) that allows a character to attack the next turn instead of the person who would normally take that turn, or a skill that has a short cooldown/cast time. Used correctly, they can make boss fights much easier, but still worthy of the name  BOSS . The story is also well done, and it always left me wanting to know what would happen next. It did become a bit of a grind in the last zone for me, (a huge maze that you can quickly loose yourself in) and it took me a few months before I decided to finish it, but I now regret not finishing it sooner. It has great world design, and even though the graphics aren't the best, they could draw out some beautiful scenery.   I have played many different RPG's, and this was one of the best. 9/10  The reason it isn't 10/10 is because their is almost no loot. Money is mainly earned from questing, and all gear is either purchased or found in chests. I am someone who would much rather get great items from killing enemies than grinding to buy something at the store. Now that I think about it, though, this may have been done for world building reasons.  Going back to combat, the skill system in this game was unlike any other I had seen. Each character has a device called an  Orbment , and by inserting special gems (quartz) into them, their element changes and grants the character new skills. Systems like this may have been used in other games, but this is the first one I've played that has used it. I realize I gave my rating above, and it is usually done last, but I am too lazy to move it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun JRPG. You have to know what you're doing too. ",
            "review_score": "1"
        },
        {
            "review_text": "I don't play many JRPGs, but I tihnk this is a good one.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. I prefer turn based games versus the more popular real time fighting styles, which makes it rather tricky to find a game that I like for pc, as I don't have a different gaming console.  This game is much better than I thought it would be. I hadn't heard of it before, so didn't know its anime, or PSP renditions going in. The game is much more complicated than I anticipated (the prologue was a little confusing for me with the orbs, quartz, etc, when I was just reading through the explanations), but it quickly fell into place and was pretty straight forward. The heroine is a little annoying at times, but she is a sheltered, headstrong 16-year-old, and the other characters call her on it, and she is an interesting foil to Joshua, the male lead. As the game progresses, her behavior matures a bit, which is rather astonishing to have character development in a game like this. My only complaint about this game is to do with the conversations. THere are A LOT, and you can hold down a key to try and speed through the speech bubbles, but that doesn't help much. It gets annoying very fast, and very tedious, especially since there isn't a way to exit out of a conversation, and EVERY NPC has dialogue. In its sequels, I hope this is changed. Some chapters have so much dialogue, you have to take frequent breaks to not get frustrated (at least, I did).  The game has replayability factor, is incredibly detailed, and the vernacular is great! There are allusions to sexuality, but it is not blatant, no boob armor, and the humor isn't overdone. It really is a very good game. I am tempted to get a console to play its sequels that have been released already in other mediums.",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of old school JRPG that made JRPGs so popular back in the days. Tight and emotional story, punishing but rewarding boss battles, catchy tunes, colorful and memorable characters. If you say you like JRPG but haven't tried this game yet, then by all means, please try it.",
            "review_score": "1"
        },
        {
            "review_text": "KITA KITA KITA DA ZE! It's FINALLY HERE, BROS! Buy it, play it, love it or hate it, and PRAY for Trails - SC - to come out!",
            "review_score": "1"
        },
        {
            "review_text": "I preferred playing the over visiting relatives for the Holiday Season.  10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Enter key simulator",
            "review_score": "1"
        },
        {
            "review_text": "Walk and talk. Walk and talk. The worest game I ever purchased. Want my money back.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely hate the missable sidequest which you have to finish the quest before going to certain place or complete event X. Typically JRPG that must use a guide. Don't record the incompleted quest, it makes me feel bad i failed because of your stupid design.",
            "review_score": "-1"
        },
        {
            "review_text": "It's impossible to skip cutscenes and dialogue, even if you've seen/read them before. That in itself is enough to warrant a thumbs down. Additionally, the game is full of meaningless grinding and padding. Fairly early on in the game, you arrive at a mine. Inside said mine you get to ride in a minecart, the minecart takes you to a dead end where you have to talk to a chap in order to learn to flip a lever, only I'm fairly certain I clicked that lever before going into the minecart but whatever, so then you go back, flip the lever, arrive at the elevator only to find out that the elevator needs a key. Go back to the starting point, go back to the dead end, talk to the chap again, learn that the ♥♥♥♥♥♥♥ knew about the elevator key yet neglected to mention it, get key, backtrack and finally go to the damn elevator!   Now, this sounds like a fairly standard introduction to a boring rpg puzzle right? That's what I thought, yet on the next level of the mines, there are no minecart puzzles, let alone any minecarts, only a straightforward path. The whole section with the minecart was just a timesink to pad a lacking game. And pretty much every single side quest is like this too.  And the difficulty level, now don't read this as something good, higher difficulty in this game does NOT mean, use strategies to prevail. No. The enemies just gets buffed way above their level, to the point where two hits will drain your life bar, and there's usually around 3-5 enemies in any given fight. You cannot play around this. Even on the lowest difficulty, grinding is unavoidable. Don't even bother choosing anything other than normal, it just increases the amount of grinding needed. I did, and I had to go back and suffer through the whole intro and yap yap yap non-stop dialogue one more time.  Usually in rpgs you can avoid the vendor junk and hold out for the good loot in dungeons and secret chests. Not so here. There's no looting in town, I mean none. No secrets, plenty of dead ends though, but nothing, NOTHING, to justify such exploration. Really strange. And the loot found in dungeons are really, REALLY, sparse as well. So you grind to be able to buy the junk from the vendors, just so you can reach the next area, where your gear isn't so hot anymore anyways.  The worst parts of jrpgs are all included in this game, if that's not your thing, stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "Cookie cutter characters, poor characterization, a plot that doesn't develop until the last hour of gameplay, a slow combat system, poor enemy designs, and generic locations. These are just a few of the complaints I noted while playing The Legend of Heroes: Trails in the Sky.  The game feels like a B anime show, with mountains of unnecessary dialogue and attempts at humor that never really hit the mark. Character development feels very forced, and usually devolves to one character listing off their personality traits in a conversation.  Most of your time with the game will be spent moving from town to town, solving problems that have only a passing link to the primary conflict. The storyline quests that the characters pursue have little to no bearing on the actual plot. In short, the game is mostly filler material, with plot development only occuring in the first and last few hours.  The combat system isn't bad, but does drag on in certain fights. Animations can't be skipped in any way, so when battling groups of enemies the fights tend to drag on. The monsters you will encounter have no coherency with the locales of the world, and aren't threatening in the slightest. Most of the game is spent fighting squirrels, sheep, and bugs. The game's inhabitants are terrified of these creatures.  If you're a big fan of JRPG tropes, stereotypes, and story beats, this might be what you're looking for. It was all just a little too predictable for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game, I gave it more than a fair shot I think. The story and dialogue are pretty good but the combat is slow, repetitive, and uninteresting. As was stated in another review they put up road blocks to force you to grind out levels, where you fight a monster and do literally zero damage to it, go gain 1 or 2 levels and you are able to fight it normally. I don't mind grinding out levels but the devs need to make the combat more flashy and interesting for the player if its going to be required.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too much text and unstoppable dialogs to be a real fun. Gosh this could be way much better without that all. Be more like FFVI storyline, interesting but not this massive.",
            "review_score": "-1"
        },
        {
            "review_text": "I had been on the fence about getting this game for a long time, but finally decided to give the game a shot on sale. Simply put, it was still a waste of money.   The game is dated, but that isn't the problem. First off it's just buggy, so have fun getting it to start, and even then, not randomly crash on you. After you jump that hurdle though...  When you read the store page and the only highlights are 'Featuring upgrades never before seen'  'Support for all resolutions' 'A complete bestiary' 'one of the largest, longest and most meticulously detailed turn-based JRPG'  Yes...it's exactly as bad as it reads.  The game will be the longest visual novel you will probably play in your life. Interrupted by the most awkward combat sections ever created.  Both combat and story are boring; Just pure, unoriginal, repetitive, repetitive, unoriginal, repetitive garbage.  Unless you can sustain your interest in a game based purely on sprinkles of old one-liners and sterotypical tropes, do not buy please. Try to help gaming move forward instead of getting slogged in the past.",
            "review_score": "-1"
        },
        {
            "review_text": "Sometimes thing can be to traditional.... Which in this case was the issue  Story was a slow burn to start, and the grind while not an XP issue (XP is adjusted based on level) is merely substituted with another system. All fine as it's part of a classic JRPG game, unfortunately the maps are hidiously designed, with travel between points feeling like a mindless bog....   Can't recommend if your looking for something quick to play and go, but as a JRPG it's alright...",
            "review_score": "-1"
        },
        {
            "review_text": "The game is pretty poorly written, the dialogue makes me cringe to read. Everything is very slow paced, if you play many RPGs, you will probably get bored with how much hand holding the game does.",
            "review_score": "-1"
        },
        {
            "review_text": "There are some good things about old-school RPG's, and some bad things. One of the bad things is not being able to progress the story line without having to fight monsters every few seconds. This game suffers from that. I don't know whether I have the patience to persist with it, in spite of the many positive reviews.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is OK. Nothing special. Same old same old. The problem I have with the game is the lack of game play in it. I like grinding. But wandering around aimlessly for hours at a time going from NPC to NPC to proceed the story is boring as ♥♥♥♥. I am at 37 hours and just got to chapter 3. Of that 37 hours I've spent maybe 3 hours actually fighting monsters. Literally 4 hours tops...Including grinding and all the side quests. (which are no more than walk to an area. find an item or enemy and bring back or kill) there is not any real surprise or any life to the game. just endless walking. the map direction is the worst because the screen can swivel and when you bring up the mini map it looks like you have to go north when in fact north might be walking south on your screen. Stupid and confusing at times. there are a few decent boss fights. (3 challenging ones so far) but for 37 hours of game play the anti climactic tone of the whole game is getting annoying. The end of chapter 2 there is no final fight. just hours of dialogue that is very badly written and one can only hope to button mash 'B' to end the suffering. I'll play on and finish the game but unless there are awsome boss battles and many more enemy fights it will be a disappointment. Im not sure why everyone seems to like the game. The story isnt that great. The only mini game is fishing and you dont get to partake in that till over half way through and its not very fun. the leveling system is there but you dont choose any perks when you level... you just hear a 'Ding' sound and your hero grow a little stronger. The magic system is the only real thing in this game with substance. but its not enough to hold your attention unless your are USING magic. eg: fighting and grinding. which did i mention there is very little of in the game. I really want to like it but I cant. I found my self skipping dialogue and wishing for fights most of the game... Buy it if its on sale and dont expect anything great. UPDATE: Chapter 3 ... I have to watch all of the arena battles even if im not fighting??? OMFG!!!!!!!!!!! SO STUPID!!!",
            "review_score": "-1"
        },
        {
            "review_text": "the prologue took 6 hours",
            "review_score": "-1"
        },
        {
            "review_text": "This is terrible. :/",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad RPG but the fight system is super slow and repetitive. Also there is so many dialogs that lasts for hours that it gets boring quite fast.  Except from that, the graphics are nice and the game seems to be not buggy at all, I think I just don't like the system. ",
            "review_score": "-1"
        },
        {
            "review_text": "More issues on launch than BF4. Can't even load the game anymore since recent patch. Wait until a Steam sale if ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable. Crashes after during intro.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has so much potential. However, there is way too much dialogue for my taste and you will be at the very beginning of the game for about 10 minutes minimum and that includes the animation that plays for an EXTREMELY big amount of time. I swear, they shouldve made THAT their trailer for this game. in the end, there is way too much dialogue and information, and not enough gameplay. and by information, I mean they will tell you what to do, but then go into huge amounts of detail why and such, which eventually you forget. I only made it out of the beginning and gave up on this game. If you are into more story than game, then this is a good game. otherwise, this gets a 6/10 from me.",
            "review_score": "-1"
        },
        {
            "review_text": "I have only played it for about 5 hours and still find the 'how you do stuff' of the game to be difficult. The cutie kiddie look of the game is different but not appealing to me. If you are looking for something that plays like Dragon Age or Skyrim, this is definetly not that. The approach to gaming is very different than the RPGs we are used to. That said, if you are willing to put in the time it can be rewarding.",
            "review_score": "-1"
        },
        {
            "review_text": " Description:   Legend of Heroes  has 5 series each with multiple games. This is the first part of the  Trails in the Sky  series. I have not played the previous ones, but I do not see them as a prerequisite.   Gameplay:  10+ year old JRPG so nothing new here. At its core all you do is *go here* or *go here and kill this*. Combat is turn based with minor tactical elements. Fairly simple and rarely difficult. The only real uniqueness comes from picking your passives/spells and there is an in game manual that explains it well.   Story:  Usually easy going and lighthearted.   Conclusion:  Although the gameplay is very dated, I enjoyed this one. At no point while playing did I want to stop, but after 60+hrs ill need a break before steam releases the second chapter.",
            "review_score": "1"
        },
        {
            "review_text": "simple, enjoyable, and many more",
            "review_score": "1"
        },
        {
            "review_text": "Seems a bit bland. Lots of mindless waffle that you just mash the buttons to get through. Don't care about the characters and was really hoping for some aweful tragedy to change the tone a bit.  Shame as the game itself looks great and the combat system is quite nice. Music was sending me slowly insane.  Edit: ...after playing another 3 hours, it gets better.",
            "review_score": "1"
        },
        {
            "review_text": "Great classic Jrpg with fun characters...now it's time to wait on the 2nd chapter.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that brings out the nostalgia goggles.",
            "review_score": "1"
        },
        {
            "review_text": "It is a charming game with an in depth storyline that literally had me laughing, and games don't do that to me that often. The RPG maybe loses something in translation when thay are brought to the U.S., but it seems like this one was made specifically for English speaking players, either that, or the translation was done so well that it seemed native to America. It is very possible an American programmed it, I don't know honestly, but the gameplay is really interesting, but be prepared to read a lot of dialogue. I give this game a paw up.",
            "review_score": "1"
        },
        {
            "review_text": "Best JRPG of all times, I have played this (FC) on my PSP long time ago, still willing to pay for this game now that is on PC, really good character design, they feel so real that I feel sad when they are sad, I feel happy when they are happy. Huge yet nice story. I hope steam will have SC and 3rd soon.",
            "review_score": "1"
        },
        {
            "review_text": "I've heard lots of good things about this game, so I finally caved in and bought it. Only about thirty minutes in and I was already enjoying it. The first couple chapters exceeded my expectations. The story is action-packed and the characters are loveable while not being cliche.  Originally, I had a rant here about erratic difficulty, but I think I overexaggerated it a bit. There is still difference in difficulty between sidequests and story progression and sometimes required battles are quite difficult. My problem is that I forgot items even existed. Once I stocked up on items and started really using them, the difficulty dropped from impossible to challenging but manageable. Learn from my mistakes, readers: stock up on items and use them. You're gonna need them, especially once you hit Chapter 3. The retry offset function is there as well if you need it.  Anyway, the story and characters are great and I highly recommend it to any RPG fans out there.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic. This is everything that is good about JRPGs, with fantastic story, setting, and characters that were all built into an epic experience. The more invested you are in the world and people around you, the better your experience will be in this game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 This Game is just perfect! I loved the First part of the story. If you are considering to buy this, DO IT. This game has a perfect story not too shabby graphics and a casual rpg style gamepla (probably). BEST GAME I HAVE PLAYED IN YEARS!!",
            "review_score": "1"
        },
        {
            "review_text": "LOVE, love, LOVE!, this game... okay so it's very 'wordy', basically you'll spend a lot of time reading dialogue, but it's wriiten very well and for the most part entertaining. The tbc is good, easy to grasp, the characters are quite funny at times, the overall story is well written and engrossing. Great value for money (I paid £12.99), I certainly recomend this game if jprg's are your thing...",
            "review_score": "1"
        },
        {
            "review_text": "The best JRPG on Steam. you can't go wrong in buying this game.  Totally worth every minute.",
            "review_score": "1"
        },
        {
            "review_text": "This is the game for you if you are a fan of old school turn-based JRPG. Refreshingly good illustrations and excellent storyline are plus points! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "pros : great game cons : entire game feels like a prolouge to the sequels x.x",
            "review_score": "1"
        },
        {
            "review_text": "Good animation in this one. Styalised character sprites of the chibi style (I believe), and an easily rotateable camera have everything looking nice from may angles (retation is required laster to see some paths).  Not gotten that far in myself, but the story is well-written. Not for people who don't want to sit and read, because everything out of combat involves lots of nattering with NPC's  Nice and simple combat mechanics. Maximum move/attack distance every turn, with chargable special attacks, and magical skills that can be swapped in and out depending on your choice and, to a degree, the character's specialisation.",
            "review_score": "1"
        },
        {
            "review_text": "For something labeled as a 'prologue', this game sure have plenty of character development moments, decent plot, some unexpected twist, and challenging battles. Totally can't wait to see what the main course looks like  Some notes : -The battle system feels a bit slow, It does make for some interesting boss battles, but I find myself mostly skipping random battles in the field or dungeons.  -Luckily, the game rarely ever punished you for that, while most boss battles are challenging, they can be tackled with proper skill/team setup and good strategy, not just grinding. -The story starts out slow, really slow, but once it picked up its pace (around the second chapter or so), it is quite engaging, but... -Damn you cliffhanger ending!",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far the best hidden gem I have ever found on Steam. From the story, to the gameplay, to even the most insignificant NPC, the game doesn't show any slack. Right off the bat you can tell how much effort was put in this game to make it something enjoyable for any who play it. The only downside is that not enough people know about this game, making progress on the release of it sequential games' english translation almost non-existant. If you enjoy any JRPGs then odds are you will love this game just as much as I do. Plus it has Olivier, the greatest character of all time!",
            "review_score": "1"
        },
        {
            "review_text": "This game was one of few that has captivated me in a way that after playing it, I longed for more story! I anxiously await the port for the sequel; been waiting for any sort of information for it but still havent heard anything...Please import the sequel soon!",
            "review_score": "1"
        },
        {
            "review_text": "After spending 82.3 hours getting to the final boss, but picking the wrong team to beat it :p, I can safely say that this is a beautiful game. It's length can be compared to 'If my heart had wings' (Longest visual novel you can find anywhere). What is even better is that you can pretty much play the entire thing with just your mouse.",
            "review_score": "1"
        },
        {
            "review_text": "This game really reminded me of the great RPGs of the olden days, and adds alot more. This game is very humorous and witty and will constantly keep you on the edge of your seat with various plot twists. Would strongly recommend this game to anyone!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like a story rich game? Do you like to grind for something other then leveling? Do you like to have heroes have real reasons to go on an adventure other then 'save the world'?  Then I highly recommend this game and I'm only Chapter 1 and have played for 19 hours as of this review. Usually I don't like to grind but because of the rewards other then leveling I'm alright with it. There are escort quests that don't have the NPC run right into the monsters that you are defending them from. Gathering Quests and Hunting Quests have little stories behind them and have a degree of difficulty to them (you have to find them instead of the map showing you where they are)  The Main Characters have nuances and reasons for being 'Bracers' which I've only scratched the surface to currently. People who join the Main Characters have reasons for journeying that doesn't seem forced or contrived, with stories and histories of their own (again only scratching the surface as of now).  The cooking craft is helpful in multitude of ways and you really have to balance between your funds and your need to gather certain crystals that activate powers powers and open parts of your 'powers'.  The music is a bit repetitive but that's rectified by listening to other music while you play.  This story will pull you in and keeps you wanting to be involved with the game.",
            "review_score": "1"
        },
        {
            "review_text": "must try this game, worth your time. still waiting for the next saga to come out",
            "review_score": "1"
        },
        {
            "review_text": "Recommended",
            "review_score": "1"
        },
        {
            "review_text": "good game, waiting for SEQUEL!",
            "review_score": "1"
        },
        {
            "review_text": "The game is meant for anyone who enjoy classic feel RPGs and it so delivers..Most play if you love RPGs",
            "review_score": "1"
        },
        {
            "review_text": "I would definitely recommend this game to anyone who is into JRPG's. The game itself is a lot of fun. There's a lot detail put into the game in terms of NPC's and immersion. The Story is fairly straightforward, and the battle system is easy to use. The only complaint that I have is that the MC's are very generic for their archetypes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is deffinantly worth the money. I have nearly completed it and it has been suprisingly fun. The story is really good and all the charecters are really remmemberal, but there is somthing that lets the game down and that is the dialog. Now the dialog is really nice in all but there seems to be far to much and some times your just skipping it. All in all I will give this game a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "My first impressions, wow. I already like the writing of the story and the battle system doesent feel like it will get old fast at all! Can't wait to play it through, oh and Falcom... Please release Trales of Cold Steel. Edit: This game is one of my favorites, I love it. I really appreciate the story and the gameplay doesn't get boaring at all. None of your skills are set so you can change up and customize your character however you want. Edit 2: I have finished the game and can easily say this is my favorite game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I realy don't even know what to say everything was amazing  def my new favorite game, and off to play the sequal",
            "review_score": "1"
        },
        {
            "review_text": "If you are a JRPG, this is definitely a great game to play.  Solid story, fun combat--overall a quite excellent pacing/balance between story and battles.",
            "review_score": "1"
        },
        {
            "review_text": "You know a game is superb when the 71 Hours you played felt like 10 Hours. *goes to prepare for SC*",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game, amazing story, average-ish combat. I would absolutely reccomend this game if it weren't for it not even working for me and many people having the same problem.",
            "review_score": "-1"
        },
        {
            "review_text": "Scree☆!",
            "review_score": "1"
        },
        {
            "review_text": "Great JRPG!",
            "review_score": "1"
        },
        {
            "review_text": "JRPGs are famous for its involving story and challanging quests. This game are able to do both well. The story, although quite predictable, it is still really involving, especially the twist in the ending. The battle and equip system is good, though I felt that it is just need a little bit more variation in magic and equipment system. All in all a very good JRPG, well-worth the money, can't wait to play the sequel :D 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great story and simple to in-depth combat depending on how you play. An enjoyable game overall.",
            "review_score": "1"
        },
        {
            "review_text": "Very Enjoyable game with the exception that it always freeze my gaming laptop and considering my gaming laptop is relatively new and this game is doing this even after I have lowered the settings of the game. I get at least 1-2hrs before the game freeze my laptop each time, before i have to restart. Making sure I save the game after every 2nd battle (Very Annoying) I doubt I will complete this if it keeps up. Hopefully there is a fix around this otherwise I will have to give a negative review later on.  For now I give it a thumbs up simply because the game is good.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely LOVE this game! I don't normally post reviews, but for this game, I can make an exception. The storyline is amazing, not rushed, and the character development is top notch. If you are on the fence about buying it, BUY IT! You will NOT regret it!",
            "review_score": "1"
        },
        {
            "review_text": "its a solid oldschool ps1 throwback RPG thats about 20-30 hrs and its made by Falcom so the music is good. Also, there is a good amount of story.   btw if you are looking for nial hes prolly in the bar.",
            "review_score": "1"
        },
        {
            "review_text": "Just great. More games like this!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated games ever.   9/10 Story 10/10 Characters 10/10 Music   If you like Classic JRPGs then buy this game without a second thought. Its Amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Great story, great anime...",
            "review_score": "1"
        },
        {
            "review_text": "definitely one of the best jrpg i have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "First few hours of this game and I was not impressed. Next 60 or so after I was hooked. Incredible game even for its age.",
            "review_score": "1"
        },
        {
            "review_text": "This is Classic JRPG comfort food. If the SNES and PS1 JRPS hold a place in your heart, this is for you.    A world full of character    All NPCs have a personality     Neat combat system  ",
            "review_score": "1"
        },
        {
            "review_text": "The Legend of Heroes: Trails in the Sky is a fantastic 2-D RPG with fights in a round-based old-school fighting system. Everthing fits together perfectly, from the music score to the lovable characters, the superb world design to the story. Everyone should give this a try!",
            "review_score": "1"
        },
        {
            "review_text": "Treads the line between 'classic' and 'cliche', but grows on you as you become more familiar with the setting and characters. If you've played similar games (which you have, come on), relatively little will be 'new' to you, but it comes together in a very charming package.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very fun and entertaining! I really enjoy all the Tails and Final Fantasy games and this game is on the same level as those. Don't even hesitate to try this one!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome on the PSP, awesome on PC. Fabulous Turn based RPG with elements from Final Fantasy Tactics, Xenogears, Legend of Dragoon, and other fantastic Playstation RPG's. Play it so we can get the next two installments.",
            "review_score": "1"
        },
        {
            "review_text": "Great rpg. Fun depth and tactics.  There are only a few negatives: - Cliche anime characters: Headstrong tomboy who doesn't think things through, Cold main character who is extremely analytical, etc. - Navagating areas that exclude the minimap is annoying. I suggest getting a pen and paper and making notes of every place that you go through. If you don't care about getting every single item, you can probably avoid this.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with loveable characters. Character driven story, backed up with great translation work by xseed. It credits the original script as the dialogue is the strongest bit of the game. Good thing, as there is a LOT of it.  Combat animations are a bit slow and the system overall is just 'meh', but enjoyable enough tinker around with it for a couple playthroughs.   Buy it already",
            "review_score": "1"
        },
        {
            "review_text": "buy it!  Awesome story, with more to come! Amazing gameplay. great soundtrack.   This game started my love for JRPGs. This is a very solid game that have the mechanics and story needed for a loved RPG. Its great if you know you like JRPGs and a good start for a new love! I played the game twice after i bought it (finished the story), and i am still intruiged to play again! Go for it!",
            "review_score": "1"
        },
        {
            "review_text": "If you like classic rpg's with good storylines, this is definitely for you. I bought this due to the overwhelmingly positive reveiws here on Steam and I was not disapointed. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Best jRPG I've played in YEARS.  Pros:  Great story, characters are likeable and believable, there is ton of interesting and funny dialogue and an amazing sound track to keep up with all of this and make things even more memorable.  The orbment and quartz system add a lot of flexibility and customization to all characters and the 'semi-tactics' combat style keep things interesting and dynamic.  Cons:  Sometimes the simplified tactics combat can be frustrating and uncooperative if you want to experiment on strategies that depend on character positioning.  A few more words:  The devs responsible for porting and adding all the extras they promised (such as hd assets, monster book, and others) took a while to deliver but sure did a great job, it was worth waiting a bit until achievement bugs were fixed and most of the features got implemented.  9/10 - Keep up the good work and I'll surely keep hyped for the next chapters of this trilogy!",
            "review_score": "1"
        },
        {
            "review_text": "A Legend of Heroes indeed!  Legend of Heroes: Trails in the Sky (AKA Eiyuu Densetsu: Sora no Kiseki) is actually the sixth entry to a larger series which, itself, is the sixth entry to a much larger and older franchise created by Nihon Falcom, A wonderful little group of developers whom I, frankly, just can't shut up about.  In terms of story, gameplay, and graphics, Trails in the Sky FC (which is the official title) is the first title of the first trilogy arc in the entire Trails/Kiseki universe, with the second title and, hopefully, third title on its way here, in which all the characters, nations, politics, etc., are established. The gameplay resembles that of traditional RPGs such as Final Fantasy or Dragon Quest, in which enemies are visible in the overworld, and at the same time, battles are very much like a simplistic version of RPGs, ala Tactics Ogre and Final Fantasy Tactics. I should also note that a magic system is implamented very much like Final Fantasy VII's Materia system for complete character customization. As for the graphics, the engine was based on the graphics engine Falcom used on their previously released, and successful, PC game Ys VI: The Ark of Napishtim, which also served as the back bone, with many tweeks and enhancedments, for not only the majority of Trails titles but also for later Ys titles such as Ys: The Oath in Felghana and Ys Origins.  All in all, the gameplay and graphics will feel both old and new while the story will keep you on your toes with the anticipation of SC being released later this year, if all goes well. If you're tired of some the later RPGs of this generation and want something with a bit of old and new, this one's for you!",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best JRPG I've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "As far as JRPGs go? It was pretty fun. IMO worth the $20 they are charging for it at the time of writing, but if you're unsure, 'Follow' it and wait for a sale =) I think you'll enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "Still playing on first runtrough. All I can say is it is great. You can feel the love that has been put into it. The world building is great and the story seems to be as well. The combat system puts enough change into it to keep it from being the old menu based combat of the old FFs. Highly recommended for those who like story driven games. The prolouge took me 10 hrs cause I kept on talking to NPCs because it was geniunely interesting. Action junkies, look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "I have found TLoH:♥♥♥♥ to be a fun and immersive game. It is by no means the best game I have ever played but I have thoroughly enjoyed it.  The characters all have personality and things about them that will make you either love or hate them.  When they say this is story rich, what they really mean is there is a lot of reading to do. This can sometimes be a bad thing when all you want to do is go explore. However the story is a good one and worth the read in my opinion.  The music in the game is beautiful and fits the world well.  I am not looking forward to finishing this game, mostly because I am not yet ready to say goodbye to this world.   I have enjoyed this game and I am sure if you give it a chance you will too.",
            "review_score": "1"
        },
        {
            "review_text": "Legend of Heroes: Trails in the Sky is a game I bought last August right after it came out on Steam because I had some extra money and I generally like JRPGs. I didn't actually end up playing it until January 2015, and after finishing it I can't believe I didn't play it sooner.  As has been stated in other reviews, the world building in this game is great. I was sucked in pretty quickly and was fully invested from very early in the game until the end. The characters, while not all exactly unique, are very likeable and fleshed out. From all the supporting cast to the party members (and especially the two main characters), they're all memorable and have their own distinct personalities.  The combat system isn't groundbreaking but it's very solid and I liked it quite a bit. Think somewhere between Skies of Arcadia and Final Fantasy Tactics. You move around on a grid and your movement is limited, but your positioning very much matters, as line attacks or AoE attacks can hit multiple units on both sides. My only real complaint with the game (and it's a relatively small one at that) is that it's somewhat restrictive in where you can go. After you clear the first region for example, you move on to the next with no option to return. There's no real reason to ever go back even if you could, I just like being able to go anywhere in a game like this.  After finishing the game, I've been extremely eager to play the sequel which, barring another delay, should be out within a couple of months in English. If you like character and story focused games (and if you like JRPGs how could you not?) then you won't be disappointed with Trails in the Sky.",
            "review_score": "1"
        },
        {
            "review_text": "To start out with I'd like to mention that I'm a sucker for the Final Fantasy series, but have been pretty terrible at getting my act together to try out other acclaimed JRPGs. I didn't know about this game until it's Steam release was announced and people seemed to get pretty psyched about it online, so I figured I had to try this. More than half a year later I got my act together and have just now finished it. And holy ♥♥♥♥. This is one of the best games I've played in years.  Is it a perfect game? No. First of all the combat system grew old and a little too repetetive on me quickly and there are pretty far between serious combat challenges. Mainly due to this, the game is fairly easy (there's a few really tough battles, but not that many).  I think my main concern with the combat is also due to the 'battlegrounds'. They look different, but throught the entire game they're essentially the same. It's a fixed square area where characters and enemies can move around. The nature is a little different depending on where in the game you are, but there are no obstacles or interactive objects on the battlegrounds whatsoever, which is a shame as that would have added an additional element to the combat.  That is pretty much my main gripe with the game, though. Well, that and the fact that it starts a bit slow, but I'm alright with that.  What really makes this game phenomenal is the story. It's not just good. It's really, really good. It has everything - romance, tragedy, political intrigues, humor, war, betrayal, and I could keep going. And it's not just implementing these themes - it's implementing them together very, very well. The characters are also well-written and have some pretty good interaction. They're different both in personality and in their role in the story. I never found that any of the main characters felt out of place or unnecessary, which is pretty impressive with a fairly large character roster.  There's also a ton of side stuff to do with varying difficulty. Standard monster-killing sidequests, take item from A to B-quests, escort quests, etc. Alongside all this, there's a lot of hidden stuff and collectibles, that are completely optional and a lot of it is pretty well-hidden. If you truly want a 100% completion then you have to extremely thorough and visit and revisit almost all areas - and you have to do it before progressing too far or some areas will be locked. Normally I hate this locked approach, but I actually find it works alright in this game, as there's always something new to do in whatever area you end up in next.  Completing the game took me just under 50 hours - and I tried to be thorough in finding most collectibles and items (and failed...). If you're not into all these extras I reckon the main game can be completed in less than 30 hours without rushing anything. If you're into JRPGs you should definitely not miss out on this title!   Be warned, though. Halfway through the game I learned that this is just the first of three chapters. It was originally released in 2004 and they're still not done with the localization of the second chapter, yet, so finishing the entire story is going to require some patience. Playing this game is still completely worth it, though!",
            "review_score": "1"
        },
        {
            "review_text": "Seems a fine game WAY too much dialogue imo and im normally all about reading to keep up with the story but this one can get ridiculous at times lol other than that it's awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I have played the PSP version, which is the same. And I would like to say that this is one of the best JRpg I've ever played. The battle system, character customization, and story are what kept me playing this game. I can't really fully review this game without spoiling it. I give it 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Overall a fun game (so far ...)  I quit because I was tired of the endless useless chatter with no purpose.  I'll get back to it someday but not for a while.   Cheers A.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you're a fan of JRPG's. Really took me back. I'm psyched to find some time to play the second chapter, though buyer beware, the third chapter may not be translated for english release for a LONG while. Originally released around 2005 in Japan, we're just seeing the second chapter now. Regardless, this is one of those games that ranks right up there with the best of the JRPG's of all time. Tons of writing, and good writing, fun characters, and a really good story so far.   Just started the second chapter and it seems even better than the first thus far, with some added battle mechanics as well.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is solid and has some novel mechanics, while not being revolutionary in any particular regard.   There's orbment (i.e. magic) system frustrated me a little - Much of it goes unexplained outside of an in-game manual, and it's quite cumbersome to keep flicking between the manual and the menus to figure out which combinations of orbments will gain you access to which spells. Around mid-game when I had access to most types of orbments, I slapped a 'good enough' config into my characters and then never had the incentive or desire to delve back into it other than to replace orbments with higher level ones.  Support and defensive orbments/abilities also seemed to be unnecessary throughout the entire game, other than in the final boss battle. It all just boiled down to damage, damage, damage...  What really kept me playing though were the game's story/writing, the music, and the attention to detail.   Unlike many JRPGs, the plot is engaging and coherent and the characters are interesting and relatable. It's all quite trope-heavy, so don't expect stunning levels of originality - but it's pulled off with enough charm and intrigue to keep you nicely entertained.  The music is catchy and pleasant - up there with Final Fantasy at times. Sound effects are pretty standard / nothing special. The attention to detail can be seen in the environments (particularly in the towns), enemies, dialog, etc... It feels like a lot of care has been put into the game.  I was happy to sink ~50 hours into it, and would recommend it to JRPG fans.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, it feels like Final Fantasy Tactics and Tales of... series have merged to make this. The game play is easy to grasp and combat is easy in the beginning. I many not have put much time into it yet, but I'm already hooked.",
            "review_score": "1"
        },
        {
            "review_text": "A great JRPG with unskippable battle animations",
            "review_score": "1"
        },
        {
            "review_text": "This one suprised me when I first played it. Interesting tactical combat system, great story, great soundtrack. I've played a lot of JRPGs but Trails in the Sky is now one of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "The only downside is that it does not have voice overs on dialouge which is a big let down for me because ive played jrpjs with voice over dialogue.   ",
            "review_score": "1"
        },
        {
            "review_text": "just finshed the game, easy to play but with some nice customisations to gameplay make it overall fun and entertaining even if the excessive small talk dialogue is f***ing annoying at times..... BUT with joyous character quirks like a new age dominatix style alchoholic who's 'special move' is to run at the screen with her cleavage and then tell her opponents 'someones been naughty' and then proceeds to whip them vigourosly while she giggles, a dirty neu-romantic pervy poet that tries to sleaze on everyone even the teenagers and a somewhat incestuos sister-adopted brother romance plot make it all worth while!",
            "review_score": "1"
        },
        {
            "review_text": "This game was fantastic. I originally bought this game because I saw it had good reviews and was on sale over the holidays. This game quickly became a pleasant surprise as I was able to get many many hours of entertainment out of it for the price I paid (~$10).  That being said, 'Trails in the Sky' is definitely not for everyone. There is a ton of text to read and just as many cut scenes to watch. Infact, I would say the combat to story ratio is about 50/50. Nevertheless, I didn't find that bothersome at all because the story itself was interesting and the characters were all well-developed. If anything, the story was what kept me going during some long, repetitive dungeons and irritating monster fights.   Am definitely looking into purchasing the second chapter of this series!",
            "review_score": "1"
        },
        {
            "review_text": "This is honestly one of my favourite games I've ever played. All the characters are extremely well written and charming as well as the combat being fun. Something I really appreciate about this game is the fact that you barely need to grind at all, so long as you don't run from every encounter. The story, whilst not mindblowingly original, is still very interesting and entertaining.  My only criticism I have is that some of the sidequests are frankly impossible to do without a guide (unless you're willing to spend hours trying to complete a single one). However most are relatively straight-forward and fun, as well as to help immerse yourself in the idea of being a Bracer.  Overall this game is exceptionally good fun and ultimately one of the best I've played for shear enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome story and character focused JRPG.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great TB JRPG! I really love the graphics, since it keeps it old-school yet the static images of the people are very nice. I do not know the background of the series much and am very new to it, but I was able to catch on very fast and now got a decent strategy on farming these gems to get all my slot unlocked and also setting up my charactor armor. Once you get the tactics down for building up your CP past 100 harder enemies are much easier to deal with at low levels. If you love games like Vagrant Story or .Hack, omg .Hack !! then this will really be worth getting! I cant wait til I get these guys past level 50! The only thing I wish I could change is the sndfx for the dialog boxes and I wish they would just be auto filled, that constant typing effect is very annoying to me, I do not might reading, but that just gives me a headache. There should be more options to control the game effects as such.",
            "review_score": "1"
        },
        {
            "review_text": "Short and on to the point review - This game is worth your buck :D",
            "review_score": "1"
        },
        {
            "review_text": "If you like your JRPGs packed with story and excellent world building, just buy the game right now. If just want to slay some monsters and go on a bit of an adventure, look elsewhere. I personally love the Trails sub-series and recommend it to anyone who likes JRPGs. The continent of Zemuria is one I'll be returning to on a regular basis for as long as they keep the story going.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful game. The characters and world design really draw you in, you feel like you're a part of that world. Give it a shake and stay for Tita.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a fantastic game. The game hits on all major points for me. Great story, compelling characters and amazing dialogue. I'll break down who should buy this game:  If you are a fan of JRPG's - buy it. If you like great stories - buy it. if you like good dialogue - buy it. if you are a gamer......buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A must play for all JRPG fans!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story, great writing, great characters, fun combat. I think anyone would enjoy this game, even those who don't typically play JRPG's.",
            "review_score": "1"
        },
        {
            "review_text": "This game can speak for itself.",
            "review_score": "1"
        },
        {
            "review_text": "Trails is an RPG that while not really innovative on any front, does everything well. The story is fantastic, the combat system is polished, the music is great, and the world is well built and all of the locations have character to them. Nothing the game does is new to the RPG genre, but I was constantly impressed by how well thought out everything in the game is. The characters have lots of hidden depths, and the story has a number of great twists to it that take you by surprise. Innovation and creativity are often praised in the video game industry, but there is something to be said for a game with a lot of polish that makes you constantly want to continue playing.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, I remember checking the trailers at first but I wasn't sure about it in the beggining, in the end I decided to buy it when it was on disscount and damn it I loved every part of it. Great story, great characters, great world, and the battle system, I was skeptical at first with this mixture of turn based and rts but in the end it worked well.  The story is great but there is A LOT o dialogue to read it can sometimes be tiresome, If you are the kind who speaks to every npc to get every posible detail of the game you will be reading a lot, and even if you don't sometime the cutscenes are very long so it still gives you a lot to read. Overall a great game,spent about 100 hrs trying to get all the achievemnts so if you look for something to consjme you then this is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "If you're ready to read a long visual novel with great character development, humour and a hint of romance then this games for you  I loved this game. It might not be for everyone as it is a bit long in between chapters but it works well for me because the only reason why its long is the game is building the characters up so well you just know that some time in the future they're going to smack you with a plot twist.   I'm also a sucker for romance sub plots i feel this game makes the characters do exactly what you want them to do and also what you least expect them to do.   This game is also incredibly easy dont expect to come in thinking it will be a challange still in my opinion alot of fun ",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of JRPG's, you owe it to yourself to pick up this game (also pickup Trail In the Sky: SC, as the story continues in their, they were meant to be one game originally)  The best story I have ever experienced in a game, reasonably deep combat and character developmnt, and a suprisingly deep and fleshed-out world to experience. Any one of these reasons alone would be enough to buy a game, and this one has all three.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty great tbh.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best JRPGs I've ever played! Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "The Legend of Heroes: Trails in the Sky is the first title in the 'Trails of' series. The game is heavy and rich dialogue with a fairly complex game world where every characters evolve and develops(including random NPCs). Exploring this world and getting to know its residents is an immersive experience. The story is very well-written despite some pacing issues as for some people, the story seem to take quite some time to have big events happening. It actually only picks up towards the end. The gameplay is similar to most grid turn-based RPG, but with the management of the orbment and quartz system which adds a twist of fun into it. The Legend of Heroes: Trails in the Sky is part of a triolgy, so expect to follow-up on the adventure and story of our main characters.",
            "review_score": "1"
        },
        {
            "review_text": "A old school JRPG that focus on story and music instead sex, violence, and crude languages with that said, it is a refreshing change.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game stories ever!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great JRPG. The characters are likeable, beliveable, and well developed. It's a turn based battle system which is getting harder to find these days.  The story is a slow burner so far. I am in Chapter 2 and not too much has happened, but that's to be expected in a series that is written with being a trilogy in mind. Built around several sidequests to earn income as well as main story missions to progress the story.  Overall I highly recommend this game to anyone looking for a classic turn based JRPG. Just don't go expecting some massive melodramatic save the world story. Well, at least not yet that I've seen. That could all change obviously. :P",
            "review_score": "1"
        }
    ]
}