{
    "app_id": 251110,
    "name": "INFRA",
    "release_date": "2016-01-15",
    "developer": [
        "Loiste Interactive"
    ],
    "publisher": [
        "Loiste Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Adventure",
        "Atmospheric"
    ],
    "achievements": 74,
    "positive_ratings": 757,
    "negative_ratings": 98,
    "price": 23.79,
    "description": "INFRA puts you into the boots of a structural analyst on a routine mission. Quickly though, your task turns into a fight for survival, all caused by deep-rooted schemes of the past. Your tools are simple: your camera and the wits to navigate a labyrinth of debris.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251110/header.jpg?t=1541773640",
    "minimum_requirements": "OS: Windows® 10/8.1/8/7/Vista/XP Memory: 4 GB RAM Graphics: 512 MB of memory or more. Requires support for Shader Model 2. DirectX: Version 9.0c Storage: 18 GB available space Additional Notes: With &quot;memory available&quot; and &quot;model &amp; texture quality&quot; settings on &quot;low&quot; on 32-bit systems or systems with 4 GB of memory or less.",
    "recommended_requirements": "OS: 64-bit Windows® 10/8.1/8/7 Processor: 64-bit Memory: 6 GB RAM Graphics: Dedicated graphics card with 1024 MB of memory or more. Should have support for Shader Model 3. DirectX: Version 9.0c Storage: 18 GB available space",
    "reviews": [
        {
            "review_text": " Job Simulator that's compelling, atmospheric AND fun?!",
            "review_score": "1"
        },
        {
            "review_text": "I was very pleasantly surprised with the game. It looks great considering the aging engine. (It would be amazing on modern engines) It's very atmospheric and I just love crawling in every place looking for easter eggs and more things to photograph. (and if you're careful you can find plenty of batteries. I had 10/10 for both almost all the time in last episodes)   Some people complaing about the protagonist's voice acting but I find it very fitting for what I imagine the guy is like :) The game has a lot of easter eggs, hidden things, things that only Finnish people understand (+/-) and on top of that extreme attention to small details. I found a phone number in random poster after the cave early in the game and much later I could call the number for some additional fun. Plenty of things like that.   The basic gameplay consists of walking around looking for structural damage / other things that need maintenance or documents exposing corruption and then snapping a photo of them. May not sound very exciting but the beautifully aged environments make if very enjoyable. For me at least. The game really rewards exploration.   There are also a number of puzzles which vary from simple to slightly more complex ones but you don't have to solve them all (Unless you're looking for 100% completion) Good thing about the puzzles is that usually they are rather logical. There are few places where you have to do some precision jumping but if you've played any fps games it's nothing too difficult.   There is also bigger plot behind the whole thing which slowly unravels as you find new clues and stuff. I have to pay more attention to it on the next playthrough but it seemed interesting enough. Anyway I'm really looking forward to part 2 and want to congratulate the devs for great work so far.   As a sidenote I bought the game for my 70 year old father who enjoys playing Myst type games and he at least seems to have enjoyed the experience even if some areas that require nimble fingers were causing additional grey hairs for him :)   As a final warning I'd like to point out that if you're looking for continuous action and get bored of exploring places just for the sake of exploring you may not enjoy the game as much as I did.",
            "review_score": "1"
        },
        {
            "review_text": "(TLDR version below vv) Generally not a puzzle kinda guy, shooters and builders are more my thing, but this one tickled my pickle. The tag 'puzzle' is a bit misleading anyway, as this game has more characteristics of an unlinear adventure game. The plot is immersive and just the right amount of complex, even my good-for-nothing brain could keep track of all the people, conspiracies, fraud and general timeline of these events, which all stitch together nicely as you progress further in the game. Not only is the plot cinematic, but so are the sceneries. Especially for an indie game, the landscapes are beautiful and the surroundings highly, if not even meticulously detailed. You can barely notice the 'indie' in this game. Sure, it's an indie game so it has its bugs and quirks, but so do the AAA titles- only they cannot compete with this kind of originality and storytelling.  TLDR VERSION!!  IS GOOD, I LIKED, MUCH STORY, VERY FASCINATE, SHOULD BUY!  WHY IS BUY?? -Story -Landscapes, graphics, general outlook -Attention to detail+humouristic details, easter eggs etc. -Originality -Not annoyingly difficult, but rewarding and stimulating- a bit like Portal -Open-ish world -Part 2 is coming as a free update(!!!!)  WHY IS RECONSIDER BUY?? -Clunky dialogues/voice acting -Has random bugs, although fairly rare. -I didn't recognise some NPC characters as humans at first. Doesn't affect gameplay however, just pointing it out for you nitpickers.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game, just finished Part 1 and really enjoyed the attention to deatail and the story. Looking forward to playing part 2 and 3. Highly Recommend.... worth the price!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is my second favorite game so far, with Half-Life 2 (+EP1 &amp; EP2) on the top. Truly a game that I've been searching for forever. I love to relax and dive into a virtual world with exploration, and I'm quite impressed what you guys did with the Source engine!  As I'm working as an automatic technician, my job is to repair and maintain process systems in several industries, and I really felt 'like home' while playing this game, and being able to mash buttons furiously without any real life consequences is great.  The amount of secrets, alternative routes and details are overwhelming. Got atleast 4 of my friends to buy it already, they all seem to enjoy it. Thank you, looking forward to part 2!",
            "review_score": "1"
        },
        {
            "review_text": "One of the better games I've played for long time. Truly an exploration game, without any zombies or other monster bull****. I love it. The game has the eerie athmosphere nearby all times, and you're actually afraid the building itself, not any jumpscares or anything like that.  Best part? It's made in Finland and the game seems to be located in Finland, even if it has a non-Finnish city name.   So if you want to go through old Finnish industrial complexes without having to fear for zombies, this is an excellent game. The story is also really great!  I couldn't stop playing, and almost finished the whole game in one sitting. Not many games have done this to me for long time.  Absolutely LOVE it!",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, when I bought INFRA, I really didn't know what would be involved. Now, I know, And I can tell you, INFRA is more than a game. It's a real experience to master, an unexpected journey, a precious one. I had no particular expectations when I started to play and very quickly I've been really impressed. From the office, that warm cocoon you have to leave with your only 'friends', your flashligh and your camera, to the very last dark tunnel you have to escape to. The game brilliantly alternates between the great outdoors and shabby interiors, between quiet moments and those more agitated, between easy puzzles and those which will lead you gently but steadily to madness. There's also the purpose to deeply involved the player, not only to follow a path, but to make it your own way. The more you'll explore the faster you'll understand what, why and how you need to do it. From here, the only usefull advice I can give to you : Keep your eyes fully opened and your brain fully prepared to really appreciate it. Yes, INFRA is a masterpiece. Unique and scarce one. Thanks Loiste Interactive for being more than just a company that wants to make money.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed my time with this game. I am looking forward to playing the rest of it when the devs release it.",
            "review_score": "1"
        },
        {
            "review_text": "stole a car , ran over 10 people  then came home and played infra .",
            "review_score": "1"
        },
        {
            "review_text": "The closest thing I've seen to an urban exploration game. It's a charming journey through abandoned buildings with some mild puzzling and platforming with plenty of easter eggs and terrible voice acting.  GAMEPLAY: WASD controls with sprint and crouch, plus a flashlight for dark areas. You will walk, sprint, and jump through debris, avoiding various obstacles that a building in disrepair will throw at you. There's some mild physics puzzling here in the form of picking up objects and being able to carry/throw them around. This is used pretty sparsely, only being necessary for a few puzzles, and thus comes off as a bit of an afterthought or because it's a trend. The puzzles aren't overly difficult, but aren't pushovers either - they're a nice mix of nudging the player in the right direction and having them pay attention to the environment.  The most unique feature of this game is the photography mechanic. The player, due to the protagonist's background (more later) must take pictures of structural deficiencies in the areas explored. I haven't seen a mechanic like this before, and I quite enjoyed it - it provides an objective without combat, and encourages the player to explore the environment with great attention to detail. The only issue is it seems somewhat arbitrarily selective with what can be photographed. I won't say here what to look out for - part of the fun is figuring it out for yourself - but there were many times where something looked very much broken to me, yet didn't register with the game. Regardless, it's fun, and isn't necessary for completing the game - it almost serves as a bit of role play, and a collection challenge. Another great feature of the game are the collectibles. They encourage exploration off the beaten path, and I had a feeling of accomplishment at having found them. Moreover, they're related to the overall narrative, which gives the player a better understanding of the events in the game. One particular easter egg, relating to a hidden stash of beer, had me grinning from ear to ear. You can tell the developers had a lot of fun thinking up and implementing these secrets, which I appreciate immensely. There are also plenty of optional notes and audio recordings that can be discovered which flesh out the backstory.  VISUALS: This is the highlight of the game for me, as it looks beautiful. Though you're primarily wandering abandoned areas, there are lots of objects strewn about, readable signs, etc. Some of the foliage looks a little bit on the 2D side of things and some of the character models a bit robotic, but it's not immersion breaking for the most part and doesn't really stick out. Some of the best parts of this game for me are taking in the spectacle of exiting a building and stepping into a huge open space overgrown with vegetation, having been reclaimed by nature.  AUDIO: This game is mostly on the quiet side of things, given that it's about one man traversing abandoned buildings. What audio there is fits well - chirping birds, gusts of wind, maybe a distant car in some areas. But the voice acting - good lord, the voice acting. Some of the secondary characters are acted decently enough, but the protagonist sounds like Tommy Wiseau in a PS1 Resident Evil game. It can be somewhat jarring, as it's laughably bad at times and you may find yourself wondering what on Earth his accent is supposed to be. In addition, he insists on narrating little things, like announcing 'I have [X number] packs of batteries for the flashlight!' when you pick some up. However, the game has a slightly humourous tone, so it almost works in a Deadly Premonition kind of way. In any case, it doesn't wreck the experience, but it certainly takes away from any seriousness the game wants to have. During the sections where the protagonist interacts with other characters, there's some light banter that can be fun to listen to and helps flesh out the experience.  STORY: You play as an engineer for a consulting firm, sent to evaluate the structural integrity of a building complex (hence the photography mechanic mentioned earlier). While exploring the complex, you can discover - completely optionally, from what I recall - the reasons why the facility shut down and about the people who used to run the facility. The story isn't groundbreaking, but I wasn't expecting this level of depth to the narrative, so it was a nice surprise to uncover it (especially in the form of easter eggs). It invites the player to piece together various clues that's up the them to find, so it doesn't hold your hand, and is satisfying to make the various connections.  Overall, I'd recommend this game for players looking for a slower, more relaxed experience. The pleasure of this game comes not so much from challenge, nor a heartwrenching story, but from quietly traversing long-forgotten places on your own and uncovering their secrets. I enjoyed my time with INFRA, and look forward to its hinted sequel.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me instinctively want to take a photo whenever I see something broken down in other games.",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game. Highly immersive exploration with some puzzles. 10/10   ",
            "review_score": "1"
        },
        {
            "review_text": "Filled with numerous puzzles from simple to maddening. Follow Mark (a building inspector) as he goes from inspecting a dam, to uncovering a mystery, to trying to survive in an environment that's literally threatening to crush him and bury him.  The game does sufffer from some less that spectacular translation to English, and areas that lack any narrative to explain why you are doing what you are doing. At one point I was literally just flipping switches and turning valve wheels because I knew that's what the game required, but had no idea what the end goal was until I reached it. (Oh, so that's what I was doing...)  Still, I recommend this if you like environmental puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this game and learned a little about hydro power generation and water treatment along the way!  Nice mixture of puzzles and they introduce new types thoughout the game, although some got a bit repeatative near the end. I would like to see more time critical puzzles during collapses - i found these the most challenging. Actually found some bits funny (ie office politics at start and 'bundy-off' attitude in worker notes). I did find that the game crashed for me at several points running Win 10, however i just restarted the game and picked up pretty much where i left off.  Have my 'office survival guide' and hard hat ready for Part 2",
            "review_score": "1"
        },
        {
            "review_text": "The game concept is great, but I hope the developer can do some improvement, such as in game option menu (I don't know why I cannot find this 'BASIC' function in this game), and quick save/ load shotcut key",
            "review_score": "1"
        },
        {
            "review_text": "I love the game. It's beautiful, and offers great gameplay. The scenery is amazing. I just wish I wasn't stuck at the dam...  I need help  &gt;_&lt;",
            "review_score": "1"
        },
        {
            "review_text": "It's a walking simulator, it's got a flashlight and camera that run out of power in 5 minutes, and English is not the devs' first language, but it's alright. Americans may get a heart attack at the flagrant safety violations (seriously, what part of DO NOT BLOCK FIRE EXIT do you not understand?)",
            "review_score": "1"
        },
        {
            "review_text": "A well-made quest with great level design, timing, gameplay intensity. Not boring at all. 6 hours and still in process.  If you've ever read Atlas Shrugged by Ayn Rand you'll enjoy the plot.",
            "review_score": "1"
        },
        {
            "review_text": "Looks like the guy from postal 2 found a new job.  10/10 would take pictures of broken things again",
            "review_score": "1"
        },
        {
            "review_text": "This game runs perfectly and looks amazing. Its 7/8 m8  EDIT, M8!!! I tried playing this after giving up because the puzzles are too damn hard and I find out that my save is corrupted. There are giant textures covering everything interactable with. It's a flat orange texture that says trigger on it. I am also at a part in the Stalburg Water place where you have to put in a code to disable an alarm and the code is 1986 (I had to look this up because the window the code is in is opaque white). The buttons I have to put the code into are under a flat black surface so I have to guess which ones to press. I figured out where 8 was and it would not select the number so I cannot finish th game.   EDIT #2!!! :D I found out how to fix the glitch!!! I had to restart the chapter! :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Warning: causes short-term addiction",
            "review_score": "1"
        },
        {
            "review_text": "This game has so much little detail that it is amazing.  atmosphere is fantastic. story is deep and interesting. realistic artstyle.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy it if you are prone to motion sickness... Got my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "It kept crashing for me, too many crashes at startup. It would load but when i went to start the game, it would freeze at loading screen. All i could do was close it from task manager.   When it did run, i couldnt use any button on the XBOX 360 controller except the select / start button.  I figured 'hmm ok, let me try the steam controller' and same thing....  requested a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of enjoyable playtime. Had only a few moments of frustration. The voice acting is subpar, but I heard it's getting a rework. Also, according to an achivement there are 100 geocaches hidden in Infra but I've only found 4. (edit: There are not 100 caches. There are 16.) Also, I need part 2.  edit: Wow, this game seems polarizing. Here's my opinion on it: Do take your time while playing a game? If yes, you'll like Infra. If you like to play faster, then you probably won't.  edit2: Part two is out! And it's really, really, cool. Goes in a spookier direction, no jumpscares but the atmosphere is amazing. There seem to be huge eastereggs in the game about the plot- some things in part 2 are just crazy, in a good way. Some details are just incredible in this game. However, I do have some problems. Some puzzles are kind of weak, but overall they're fine. And chances are that if you're playing part two you don't really care about Mark's voice acting. And overall part 2 is amazing",
            "review_score": "1"
        },
        {
            "review_text": "Very good game especially for a small budget indie developer, strongly recommended.  The goods + Electro-mechanical puzzles on well balanced difficulty; not too easy, not too hard. + More than one way to advance. + Believable (possible to see in real life) and interesting story. + Surprising details in the environment. + Immersively beautiful countrysides (although not much interactive).  The not goods - Inadequate number of spare batteries depleting frustratingly fast; use them wisely!  In a game where protagonist's main duty is documenting damage in numerous abandoned premises more batteries should've been provided or should they have lasted reasonably longer. - Outdated graphics especially apparent in the first chapter, but then compensated with beautifully designed, colorful sceneries.  - The protagonist easily gets killed (by environmental factors) preventing total immersion.  Overall, with well balanced puzzles, beautiful sceneries, a different concept and simple (not poor) gameplay this game is a successful as well as enjoyable puzzle exploration indie game.  Graphics: 7/10 6 (+1) for the vistas and ambiance)  Sound: 7/10 Story: 8/10 Gameplay: 8/10  Result: 75/100",
            "review_score": "1"
        },
        {
            "review_text": "INFRA is not my usual type of game - I normally stick to RTS titles. Yet the concept of walking through dilapadated ruins looking for dangerous cracks and things out of place sucked me in, and I'm very glad it did! Having played through Part 1 (Part 2 is due later and will not be DLC but an integral part of the game, which will rise in price when it is released, so buying now may save you!) I would say that my favourite part of INFRA is the incredible atmosphere the game manages to create. An effective mix of impressive visuals and ambient effects bring to life the game's juxtaposition of the natural and artificial landscapes - so you'll emerge from a tunnel to see the decaying entrace behind is encrusted in trees and plants just as a slightly haunting tune plays, giving a pleasantly melancholy feeling.   The game puzzles are nice and varied, with clever use of the same elements to prevent everything from feeling too 'samey'. The game plot appears threadbare at first, but as the game progresses you can find out a lot more - nothing is presented explicitly, but if you piece together the scattered documents you find along the game you can put it all together, culminating in the final setpiece which sets the game up nicely for Part 2. The game has pretty good replay value, with a good mix of hidden achievements and collectibles (e.g. when going off the game path to some inaccessible place you'll sometimes find a geocache). After finishing my first playthrough I really want to go through again and find every little detail! Overall, INFRA is a steal for its price - I'd thoroughly recommend it",
            "review_score": "1"
        }
    ]
}