{
    "app_id": 251270,
    "name": "Corpse Party",
    "release_date": "2016-04-25",
    "developer": [
        "GrisGris"
    ],
    "publisher": [
        "XSEED Games",
        "Marvelous USA, Inc."
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Horror",
        "Anime",
        "Adventure"
    ],
    "achievements": 17,
    "positive_ratings": 459,
    "negative_ratings": 39,
    "price": 10.99,
    "description": "A group of friends unknowingly perform an occult ritual that traps them in an otherworldly elementary school. Here, the vengeful spirits of young children threaten their lives and their sanity, and the only hope of survival is to uncover the chilling details behind the murders of those trapped before them...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251270/header.jpg?t=1539027006",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8/Windows 10 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 64 MB VRAM, 3D accelerator compatible w/ DirectX 9.0c DirectX: Version 9.0c Storage: 4 GB available space Sound Card: Compatible with DirectX 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My first introduction to this game was when a huggable person sent me a screenshot showing some of the game's dialogue. From that point onwards until years later when I was actually able to play the game, it was known to me as the 'Pooper Buttering' game. :o  Of course I knew even at the time that that was hardly what this game was about. The title can tell you that much. And when I saw that this game had come to Steam, I decided to buy a copy for myself and my huggable friend to see what this game truly had to offer.  And what followed next... well lets just say I'm glad this game was in 2D RPG Maker sprites, because this game is all kinds of ♥♥♥♥ed up. Throughout the entire experience you are treated to an endless amount of horrible things either that have happened or that you will see happen, usually involving sharp objects and angry spirits. Yet despite the gorefest, there is real story here, and I was interested in seeing where everything led. Having finished it all, and deciding not to spoil anything, I'd say it was pretty good. :D  Gameplay is sort of an RPG/Adventure game thing where you roam about, figure out where to go next, and try not to die horribly at one of the many points that this game tries to kill you. It's not the most interesting gameplay in the world, but it works fine. It's certainly not a VN where all you do is just have dialogue choices. So for people who like story-driven games that are also freaky as hell, but are not big on VN's, then this one might be one to take a look at. :D  Woohoo corpses!",
            "review_score": "1"
        },
        {
            "review_text": "I can safely say this is my 2nd favorite horror game right behind Silent Hill 2.   Corpse Party is one of those series that doesn't get almost any coverage in the gaming media but has a huge fanbase behind it. It originally started as an RPG Maker game that was released only in Japan in the 90s and then a decade later it got remastered and released in North America.   Since this game is technically an RPG Maker game it doesn't function like one. It has a menu that you would expect from an RPG game as well as characters HP but its never really put to use. Which makes this an interacting story driven that just so happens to be made with RPG Maker.   The games story is told through 5 chapters as well as few extra chapters to tell a few side storys about some characters . The main chapters have mult. endings for you to discover. Most endings are kinda similar but some have a unique twist to the story and the game makes you want to discover all of them. All the characters are very well acted and makes you have a connection to them since the story will add a lot of depth to them. The dialogue is very well written that the characters feel like they are actually real people that are trying to survive. The 'True' ending is very satisifying and will make you remember this creepy story for a while.  The chapters will have moments that you have solve puzzles in order to progress and some have to be done in a specific order so you can get the right ending. As well as avoiding certain objects in the environment in order to survive. The game does have save points scattered throughout the environment and you will want to make sure you use them in case you mess something up. I managed to beat the game and find all the name tags and endings in under 15 hr. with the help of a guide, and I can tell you I loved every second of it.  Conclusion: Corpse Party is a series that if you love interactive storys and some good horror you will have an amazing experience out of this. However if you want something like combat and could care less about a story... this game is not for you.   If you want to get into the rest of the series you are going to want to start out with this game first, then Corpse Party Book of Shadows, and then Corpse Party Blood Drive which is exclusive to the PS Vita which I can't wait get into!!! You can get the entire series on the PS Vita since the first 2 games are on the PSP.  Rating 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got to butter up my pooper",
            "review_score": "1"
        },
        {
            "review_text": "666/10 would butter my pooper again",
            "review_score": "1"
        },
        {
            "review_text": "that feel when in the end    NO ONE BUTTERS UP THEIR POOPERS   ",
            "review_score": "1"
        },
        {
            "review_text": "A nipple tingling, ball tightening sensation that will scare the socks off of your buttocks.  69/10",
            "review_score": "1"
        },
        {
            "review_text": "Say, ever heard of Sachiko ever after?  Explaining Corpse Party's origins might be a little confusing at first so I'll keep it simple. Corpse Party originated as an indie pc game in 1996. It got a cell phone remake but it was canceled due to the development of this PC remake (the one on steam). In Japan this game is called 'Corpse Party Blood Covered' and was released in 2008 episodicly. It got a PSP remake we known as 'Corpse Party Blood Covered Repeated Fear' released in 2010 but was called simply as 'Corpse Party' by xseed. A 3DS port was released on 2015 in Japan and the english version will be released sometime this summer.   Ughh, see how confusing that was? Technically you don't need to play all versions of Corpse Party. If you've played ether psp, 3ds or pc versions you won't be missing out on much. It's the same game with same characters. You can continue with Book of Shadows then Blood Drive for the PSP and Vita.   The series has gotten a manga series and a anime OVA (I personally don't like the OVA for its many problems), and a live action movie with a sequel on the way.  Well that's great, now how about the actual game? Corpse Party is about a group of students who do an innocent sounding ritual for a friendship charm that goes wrong. They end up in a school that was once demolished and rebuilt as their school. They are trapped in a school from the past with vengeful ghost and traps at every corner. The game sticks to its routes being a RPG horror game that allows you to see the game from a different perspective of the characters trying to find a way back home.  The game has many endings and as messed up as it sounds you can collect name tags from corpses and find out how they died from the main menu. Depending what endings you get you can unlock extra chapters that expand the story. This makes dying or making the possible wrong choices worth your while.  The game isn't perfect, like it's psp and 3ds counterparts it has some parts that would take a few tries to get through. The translation done by xseed is a little off like a few lines not matching up to what the character voices are saying or the text box saying something completely different compared to the Japanese version.  Corpse Party is an interesting spin as a horror RPG with retro character sprites. It offers different art style and voices compared to the modern versions of the game for psp and 3ds. Many complaints are from people who are ether misinformed about this PC version or expect this to be a port of the psp game which is the opposite. If you have already played the psp or 3ds version you're not missing out on anything. Just continue with Book of Shadows then Blood Drive. Hope you enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "I've watched playthroughs of this game, and I thoroughly enjored it so I bought the game. It was on my wishlist for months, and 2 days ago, the day before halloween, I caved in and bought the game on sale. The game is definitely worth the $15 price, especially for the gameplay. However, this is NOT the same art as the ones that you've probably seen on YouTube. 5pb didn't licensce the art for this version, so the art looks MUCH similar. This was a huge deterrent for me, since I fell in love with the art and the gameplay together. I quickly requested a refund, since this was a big disappointment for me. If you're comfortable with how the art looks in-game, the I DEFINITELY recommend this game for you. If you're not, then consider getting the PSP/3DS version, as there are no known mods to add the PSP art sprites into this game (at least to my knowledge).  EDIT: Spelling fixes.",
            "review_score": "1"
        },
        {
            "review_text": "This game has an *EXTREMELY* well written story.  I highly recommend it because of it.  The beginning seems a little slow, but, it does pick up in pace as the story continues. Unfortunately, I do have one nit-pick: the soundtrack (as great as I think it is) seems out of place at times. Other than that, I'd say this game is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Nice and story-rich 2D horror game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Small note that this is the PC version of the game, not the PSP!",
            "review_score": "1"
        },
        {
            "review_text": "I loved this anime and this game did so well portraying it. My only real issue is that every now and then I had no idea what to do or where to go/(got lost) that I found myself checking a walkthrough at least once a chapter it seemed. Still, despite that, I had a lot of fun... especially dying over and over :D Wrong end? More like beating the chapter more quickly ;)",
            "review_score": "1"
        },
        {
            "review_text": "Just finished and now need book of shadows! Steam! what are you doing with your life? Had fun butting up my pooper and looking at dat ♥♥♥ of niomis. 10/10 would die a billion times again",
            "review_score": "1"
        },
        {
            "review_text": "Best horror 8 bit game on the market.",
            "review_score": "1"
        },
        {
            "review_text": "Good Lord this game. Just. This game. It's NOT the one with the CG's and the original art - but this style grows on you all the same (if you want to see those style look up Cryaotic; his LPs is what had me buy this to play myself). This game was addictive, challenging, fun, and frustrating in one giant package. And the replay value is actually pretty high since once you beat it with all the good endings you're like 'huh...how could I have died elsewhere?' and you go back and try and get those achievements and tags and all that. It's just...so much fun. I had a blast and was TERRIFIED all the while. I'd totally reccomend this game. Good twists and turns, no plot holes, good closure, believable horror. PLAY IT!  TLDR; Accidentally ate one of my friends and then got killed by scissors 12/10 would eat scissors again.",
            "review_score": "1"
        },
        {
            "review_text": "I'm Huge Corpse Party fan, i've played the games on my PSVITA so i just had to get this at Steam. I Have actually never played the Windows Version before so i guess i get something new + it has some new endings.. This game is a must buy and IT is just so GUD. I love any aspect of this game and its Dark story, even some of the stories from the dead victims are creepy for example the one guy who ate his friend and the story of the two dead sisters.",
            "review_score": "1"
        },
        {
            "review_text": "OMGF buy this game it is super sugoi~~~~~~desu~~~~~onii-chan~~~~~~hentai~~~~~weebtrash~~~   time to be serious. This game is definatly worth a buy if you can look past its bad art from 1996. THIS IS NOT THE PSP REMAKE THIS IS THE ORIGINAL VERSION  but it is pretty much the same game as the psp version with more endings. highly reccomended  UPDATE:: On larger displays their are some v-sync issues that result in screen tearing. not game breaking but annoying none the less",
            "review_score": "1"
        },
        {
            "review_text": "An awesome title from the equally awesome Corpse Part series,this title inspired the creation of countless horror RPGMaker games and it's easily one of the best of it's kind.",
            "review_score": "1"
        },
        {
            "review_text": "▒▒▒░░░░░░░░░░▄▐░░░░░░░░░░░░░░░░ ▒░░░░░░▄▄▄░░▄██▄░░this game░░░░░░ ░░░░░░▐▀█▀▌░░░░▀█▄░░░░░░░░░░░░░ ░░░░░░▐█▄█▌░░░░░░▀█▄░░░░░░░░░░░ ░░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░░░░░░░░░░ ░░░░░▄▄▄██▀▀▀▀░░░░░░░░░░░░░░░░░ ░░░░█▀▄▄▄█░▀▀░░░░░░is 2spooky4me░░ ░░░░▌░▄▄▄▐▌▀▀▀░░░░░░░░░░░░░░░░░ ░▄░▐░░░▄▄░█░▀▀░░░░░░░░░░░░░░░░░ ░▀█▌░░░▄░▀█▀░▀░░░░░░░░░░░░░░░░░ ░░░░░░░░▄▄▐▌▄▄░░░░░░░░░░░░░░░░░ ░░░░░░░░▀███▀█░▄░░░░░░░░░░░░░░░ ░░░░░░░▐▌▀▄▀▄▀▐▄░░░░░░░░░░░░░░░ ░░░░░░░▐▀░░░░░░▐▌░░░░░░░░░░░░░░ ░░░░░░░█░░░░░░░░█░░░░░░░░░░░░░░ ░░░░░░▐▌░░░░░░░░░█░░░░░░░░░░░░░",
            "review_score": "1"
        },
        {
            "review_text": "Another over-rated game imo. I feel like just because it's a japanese/anime themed game on Steam that it gets love it doesn't earn (like other poorly localized products).  This is no exception.  Despite the great characters, story and music, I feel we as consumers deserve more. The art and sprites are bad and in my playtime of playing on 4k, there was some bugs.  Shame that the Sony handheld PSP has a better version. How many years ago was that?  Pass.",
            "review_score": "-1"
        },
        {
            "review_text": "Starting note: The version of this game available on Steam is 'Corpse Party: BloodCovered', which was released for the PC episodically from 2008-2009 and 2012. No content has been added or removed from the Japanese version, and very little was changed from a gameplay standpoint (limited to unifying certain systems that changed from chapter to chapter, like the map titles).  Corpse Party is a horror game that sticks with you because of its strong characters. While some horror stories are quick to introduce and off unlikable characters just to show that there is danger, Corpse Party makes sure you actually feel the impact of each terrible situation. The first few deaths are not of people that had it coming, but characters that clearly didn't deserve to die. This sets up the threat and malice of the villains in a way that a straight-up slasher movie usually doesn't go for. Because of this, even knowing who will live or die doesn't make things any better. Those who die are the ones you wished could live, while those that survive are forever scarred by the experience.  Part of the popularity of this first entry into the modern Corpse Party continuity also lies in how it grounds its horror in the familiar, and doesn't rely on any single type of horror. The creator has admitted that the franchise is meant to have ero-guro content, but there is a lot more to the story than blood and gore. The setting of an old schoolhouse is something eeriely familiar, even outside of the original Japanese audience. There's something spooky about wandering the dark hallways at night, and Corpse Party takes it further by showing how such a familiar location could be home to horrible activities. This juxtoposition of the familiar and the strange/terrible is a staple of Eastern Horror, but this game is a great example of why that works and continues to be utilized.  The gameplay of Corpse Party: BloodCovered is relatively simple, using basic RPG Maker controls (a nod to its RPG Maker roots) and lock/key puzzles. The trick to Corpse Party is that the 'locks' aren't always obvious, and sometimes not having the 'key' item or choice will lead to a bad ending (stylized as 'Wrong End'). However, these endings are as much a part of the story as the 'clear' or 'true' endings. Some aspects of the characters simply aren't seen outside of these alternate endings, motivating a collector's urge to see every potential fate. There are also more standard collectables in the form of nametags, but these are more for completionists and to hide a few easter eggs (such as the nametags of characters from Corpse Party Zero, or people that worked on the game).  For those that enjoy horror adventure games that rely more on character and story than trying to shock the player through jumps, Corpse Party is a great choice. It may not be the most 'original' story, being heaviliy inspired by certain types of urban legends, but it is a story that can stick with you if you let yourself become attached to the characters. For those worried about the gore content, this version of the game is the least gory, as it relies on text descriptions or sprite animations for most of the deaths.  If you enjoy this version of Corpse Party, I'd also highly recommend playing its 3DS version (Corpse Party: BloodCovered:...Repeated Fear) and that game's sequels (Book of Shadows, Sachiko's Game of Love: Hysteric Birthday 2U [currently JPN only], and Blood Drive). If you want to see where the series began, picking up the original 1996 PC-98 game and a PC-98 emulator (or playing the fan remake 'Corpse Party -Rebuilt-') is also a good idea.  And since I'm sure people want to know (and don't always look before asking), here are some of the major differences between BloodCovered (BC/this game) and BloodCovered:...Repeated Fear (BR 3DS):   [Corpse Party: BloodCovered]  Original version of Chapter 1-4 Revised version of Chapter 5 (2 new endings, 1 extended ending) Extra Chapters 1-3, Tooth Original Artwork Amateur Voicetrack and Vocal Songs   [Corpse Party: BloodCovered:...Repeated Fear]  Revised version of Chapter 1-4 (altered/added scenes, 1 new ending) Original version of Chapter 5 (plus one ending from BC that was not in BR PSP/iOS) Extra Chapters 1-14 Redrawn Artwork Professional Voicetrack and Vocal Songs",
            "review_score": "1"
        },
        {
            "review_text": "Just based on screenshots alone, this is not a scary game. What is scary is how the story, music, sounds, voice acting and clever use of visual effects literally transforms each scene into a hellish nightmare. Corpse Party is not a visually stunning game, but everything else is unbelievably strong. It is a game that pushes against its limitations by using everything it has to the greatest of stomach-churning effect.  Now that I've played the game, those screenshots which seemed innocuous at first hold a much greater weight.",
            "review_score": "1"
        },
        {
            "review_text": "I got this from a friend and bought it for another. No hard feelings towards him but why didn't I just buy it for myself.",
            "review_score": "1"
        },
        {
            "review_text": "Really great storyline, I really enjoyed checking out the wrong ends and all. It really gave me a thrill during the one chase scene, and I enjoyed the plot twists and such. The right ending to the whole game was pretty heartwarming, and I loved the special moments bewtween the characters, especially the begining. Very great game, 100000/10",
            "review_score": "1"
        }
    ]
}