{
    "app_id": 251230,
    "name": "Livelock",
    "release_date": "2016-08-30",
    "developer": [
        "Tuque Games"
    ],
    "publisher": [
        "Perfect World Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 50,
    "positive_ratings": 307,
    "negative_ratings": 87,
    "price": 7.19,
    "description": "Livelock is a co-operative top-down shooter where you play solo or with up to two allies to break the cycle of infinite war between machines. As one of the remaining Capital Intellects, your role is to unlock Eden and revive humanity.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251230/header.jpg?t=1496186534",
    "minimum_requirements": "OS: Windows Vista 64bit, Window 7 64bit, Windows 8 64bit, Windows 10 64bit (32bit OS not supported) Processor: AMD/INTEL Dual-Core 2.4 GHz Memory: 4 GB RAM Graphics: NVIDIA GTX 650 / AMD Radeon HD 7800 or equivalent DirectX: Version 11 Network: Broadband Internet connection Storage: 8 GB available space",
    "recommended_requirements": "OS: Window 7 64bit, Windows 8 64bit, Windows 10 64bit (32bit OS not supported) Processor: Intel Core i5-2500K @ 3.3 GHz or AMD FX-8350 @ 4.0 GHz Memory: 8 GB RAM Graphics: NVIDIA GTX 670 / AMD Radeon HD 7870 or equivalent DirectX: Version 11 Network: Broadband Internet connection Storage: 8 GB available space",
    "reviews": [
        {
            "review_text": "I have waited for this game for a long time and after playing it i feel somewhat let down. I must admit upon my first couple of hours i enjoyed it to some degree - i was playing solo offline to get used to the game, then however i entered a few online matches. Online Gameplay is very different, slowing down and some hideous sound clicking issues when the voice audio kicks in over the background fire etc. The part of this game i was most looking forward to is the most dissapointing of all - Survival mode, i expected some streets/arena to run around with team mates blasting and running for your life.  What you actually get in survival is the tiniest survival area i have ever seen in a game , its basically a small square of land always the same. One of the greatest problems is the game is just too easy, even on hard with unlimited continues you can just keep running through levels and eventually complete them . Gameplay is also extremely linear with a few walls you can break to reveal 'secrets' these are basically score multiplyers.    I couldnt recommend this game as i really dont feel there is enough content for £15 . Others may really be enjoying it but for me it was a waste of hard earned cash. As a result of the problems with the game i requested a refund from steam however as i have played 5 hours ( virtually all offline ) i cant get one. So if you decide to purchase this game play it online immediately to see if the online / survival suits you . Not happy with the game , not particularly happy with steam refund policy on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent twin stick shooter. Lots of action, great graphics, solid shooting mechanics and AI. Recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Livelock takes the formula from Helldivers and makes some adjustments that work. It's a decent twin-stick in a sea of not so decent twin-stick. The game has great graphics and is fun with a couple of friends.",
            "review_score": "1"
        },
        {
            "review_text": "this game remind me like helldivers and alien swarms.. i hope they add more content for this games.",
            "review_score": "1"
        },
        {
            "review_text": "The only down side is it's biggest downfall.  If the multiplayer didn't go out of sync so very often then I would love this game a whole lot more I really like this and want it to do well.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "i attempted to play this 'game', if that's what you call it, and i've never seen anything so horrible to play, or get involved in, in my life!!! I do NOT recommend this at all to anyone. it is NOT fun. If you can't tell, this is not my style of game to play.  Every time i tried to 'respawn', or whatever you call it for this program, the enemy didn't give me a chance to rotate at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Game completed in under 3 hours. Game doesnt run smoothly all the time especialy in multyplayer. Once you complete the game there is no point playing it anymore unless you find doing the same thing 2 more times with 2 different champs insteresteing.  Also make sure youve played under 2 hours of this game to get your refund otherwise youve lost your money and given your money to somone that doesnt deserve a penny.",
            "review_score": "-1"
        },
        {
            "review_text": "A very nice game. With friends is even better",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun, tons of action, this is the type of game I've been waiting for a long time. It has increadible artwork, an amazing soundtrack and a cool story. And for 20 bucks, it's a bargain!",
            "review_score": "1"
        },
        {
            "review_text": "Having a great time co-op, it's a good sign in an indie title when the levels actually become more fun instead of dragging and staying the same. Lots of upgrades so far, cool character classes and the action is a blast.",
            "review_score": "1"
        }
    ]
}