{
    "app_id": 251290,
    "name": "The Legend of Heroes: Trails in the Sky SC",
    "release_date": "2015-10-29",
    "developer": [
        "Nihon Falcom"
    ],
    "publisher": [
        "XSEED Games",
        "Marvelous USA, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "JRPG",
        "Story Rich",
        "RPG"
    ],
    "achievements": 23,
    "positive_ratings": 1108,
    "negative_ratings": 26,
    "price": 22.99,
    "description": "Picking up shortly after The Legend of Heroes: Trails in the Sky, Estelle travels across Liberl in search of Joshua. The journey involves more than seeking loved ones, however, as the Bracer Guild also tasks her with unraveling the mysteries behind the newly unveiled Society of Ouroboros.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251290/header.jpg?t=1539027445",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III 550 MHz Memory: 512 MB RAM Graphics: 32 MB VRAM, 3D accelerator compatible w/ DirectX 9.0c DirectX: Version 9.0c Storage: 4 GB available space Sound Card: Compatible with DirectX 9.0c",
    "recommended_requirements": "OS: Windows Vista, 7 or 8 (64-bit supported) Processor: Core 2 Duo 2GHz or higher Memory: 1 GB RAM Graphics: 64 MB VRAM, 3D accelerator compatible w/ DirectX 9.0c DirectX: Version 9.0c Storage: 5 GB available space Sound Card: Compatible with DirectX 9.0c",
    "reviews": [
        {
            "review_text": "In Chapter 4, there is a segment of the story where, if you choose to visit the general store, you can spend a little bit of money to buy chocolate for your party members that have been staying up patrolling the whole night. This action does not change the course of the main story or unlock additional sidequests or equipment. It provides absolutely no benefit other than a couple of lines of dialogue.  It is the little details like these, put into the game with the hearts of the developers, that are what makes Trails in the Sky SC amazing.  Trails in the Sky is not an open world sandbox game, but the amount of effort put into the world and characters of the story is simply astounding. Your party members are a vibrant, well-developed cast of some of the most memorable characters you will meet, and a great deal of thought was put into each and every line of dialogue as the characters interact with each other, bringing their personalities to life. The NPCs which inhabit the cities and villages of Liberl are also lavished upon the same treatment, with almost all the NPCs having unique names and distinct personalities, down to even the airship crew and shop owners. And given that all of the NPC dialogue changes after each segment of the main story, you'll also be able to follow the little happenings in their daily lives. Yes that's right---most NPCs in the game have their own mini-storylines, a few which will tie into your Bracer Guild sidequests, but most which are just their to simply add life to the world.   My favourite of these even spans multiple regions and games, involving the grandma of Rinon, your Rolent General Store owner, who wants to find a wife for her son. She eventually gives up on Rolent and travels to Grancel at the end of FC, to no success. On the airship back though, she meets Kitty, a tea seller girl from Edel Department store, who is on the way to Bose, and gets along quite well with her (while her sister rejoices at being able to take over as #1 tea seller). Well, thanks to the airships being grounded, Kitty ends up working at the store in Rolent, and Rinon while suspicious of his grandma, can't help but admire the girl's enthusiasm and hard work. Later, in Chapter 8 the wedding of a couple (whose story began in FC, and whose ring you retrieve on a sidequest in Chapter 4) takes place, and well, no points for guessing who catches the bridal bouquet.   To anyone who loves a sprawling world with many secrets and lifelike characters, I can't recommend Trails in the Sky more.",
            "review_score": "1"
        },
        {
            "review_text": "Second Chapter follows the story directly where Trails in the Sky First Chapter ended. The game goes on a much grander scale in both story and battles, and does it well. You're expected to have have played First Chapter in many places and are rewarded for remembering small details.  Like the first game SC has a bit of a slow start as it builds the world and backstory but really picks up and gets crazy later on.  There's some small changes to the combat system with 'chain crafts', new spells and crafts but it's still very much the same. It's sort of like a grid-based strategy RPG battle system but simplified. However there is a lot of customizability to your characters and party and many ways to approach each battle. For environments the dungeon design is good and varied, especially later on. Unlike a lot of JRPGs there is almost no reason to grind enemies for experience. The experience gained from battles scales massively with your level so if you bring an underleveled character to a boss it might actually gain enough XP to go above the others.  A big part of what made FC great for me was that the characters had a lot of personality and the dialogue was well written. In SC a lot of characters remain effectively the same and there aren't a ton of new ones you learn to know. But especially Estelle and Joshua have a lot of character growth as you might expect. At the same time you certainly get a lot of backstory on everyone as the story progresses.  The music throughout the game is superb. Especially in the final areas of the game I was really awed by this. In my opinion it's a big part of what makes the game so good, as it's effectively switched around to set the mood.  In general the game builds on all of the things I liked about the first chapter. As for a few (mostly minor) dislikes:  I expected Second Chapter to be darker toned than the first. The 'secret society' tends to follow anime tropes and hide behind mystery rather than truly seem evil or do horrible things (with some exceptions). This is a matter of taste of course. I sort of preferred the political plotting of the first game and how the society appeared very sinister there. Speaking of anime tropes, the 'saved at the last second' thing is used so many times in SC that it gets pretty silly.  I think the game could've had a little less of the same kind of content as First Chapter. Things like fetch quests walking around Liberl to progress the story. A playthrough of SC can easily take 70 hours. I wouldn't have minded it being some hours shorter and having less of the same from FC. In a way because of recycling many areas SC obsoletes FC content wise, which isn't necessarily a good thing. They're two halves of the same story, and the first half should still be fun to revisit after playing SC.  The battle system is fun, but like First Chapter normal difficulty doesn't have many challenging encounters if you use all the tools at your disposal. While it's easy to make your own challenges by setting limitations you can't be expected to know which ones work well on your first playthrough. This is personal preference but being able to mindlessly beat certain bosses by repeating the same strategy draws me out of the story, so better difficulty options could make it more fun.  Hard and Nightmare difficulty don't appear balanced without a New Game+ save file. Most people seem to agree that the final prologue boss is impossible to beat without getting a lucky pattern when starting a new save. Difficulties apart from normal were unlocked after beating the game once in the PSP version so it's not intentional but still unfortunate.  Just like in First Chapter all animations in battles are still unskippable and watching them makes up a lot of time in a playthrough. I didn't mind the slow pace caused by this because the game is so good overall. But I'm sure it could get annoying, especially on repeat playthroughs.  In short, if you enjoyed the first chapter this is a must buy. It's a bigger game that expands on the world and directly continues the same story bringing it to a satisfying end. The game is well paced without much filler and has an impressive endgame. The combat system is fun and tactical but on normal difficulty will not be particularly challenging for veterans of the first game. A great soundtrack brings the story and combat together nicely. For people new to the series I would still recommend starting with First Chapter, since SC assumes you remember what happens there without recapping it.",
            "review_score": "1"
        },
        {
            "review_text": "Ok....maybe I should actually write a serious review for a game for once...maybe... nope.    The Legend of Heroes: Trails in the Sky Second Chapter is a turn based strategy JRPG set in Liberl Kingdom, a smaller country in Zemuria (the continent that the Trails franchise is set in). SC is the second game of the series set in Liberl, so play the First Chapter first. You play as Estelle (yes, a female protagonist, woo!) just like in FC.  The story is stunning. The focal point of the game is the absolutely amazing character development, world building, and storytelling. The Legend of Heroes series is hailed to be one of the best story driven JRPGs out there, and there is a very good reason for that. There are trips and turns all over the place in which you can never guess what will happen next. The character interaction is stellar. It can be hilarious at time (cue Olivier), but serious at others. The characters fit together to create a perfect setting. The NPCs all have their own story. They don't seem like just NPCs, but people that actually have a life and don't rely on the player characters so much to do everything. They travel around and react to different situations in the game. The villians have their own reasons to be the villian and not just 'because lel'  In other words, people actually act like people instead of random anime tropes.  The gameplay is pretty good. The battle screen uses a grid based system, where positioning matters. Staying close together increases your chances of taking AOE damage, but makes healing and buffing easier. The orbment system allows you to customize what your characters do... especially people like Estelle who have balanced orbment slot setup. Art casters (magic casters) became more balanced vs taking physical attackers than in FC. Sidequests don't seem repetitive (except a very certain thief), and can range from monster hunting to helping a guy impress a girl by keeping sober while drinking lots of alcohol... (don't ask.)  The music brings it all together. Falcom Sound Team jdk really does do an amazing job at creating music that fits into the story.  And of course, we can't forget the localization team that brought this game to the West. Hats off to XSEED for pushing through a project that was cursed by Murphy's Law, and delivering an amazing localization.  Buy this game right now. It is absolutely worth it at $30. The game will probably take 80-120 hours depending on how much extra stuff you do and difficulty level. Even then, replayability level is very high as you can go back and find the all the little hints that led up to the end, and man, Nightmare mode in this game is pretty difficult, so it's a fun challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Truly an amazing game. One of the most immersive and story driven RPG's iv'e ever played. over 100 hours in and i wish it was 100 hours longer!   PROS:  - fantastic character development - Great soundtrack - Deep, rich and well written story - Orbment system is well thought out and implemented.  CONS:  - Combat is fun, but i found myself wishing there was more abilites to choose from - Although story is well written, It's been done before - While characters are well fleshed out, you've seen these 'archetypes' before  To be honest, i'm nit picking with the cons....I'd reccomend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best JRPG I've played in recent years. Trails in the Sky FC was pretty much the appetizer of the trilogy, but here is the real meat of the story. The game starts right after that heartbreaking cliffhanger from the first game, so obviously it's absolutely required you play FC before SC, otherwise nothing will make sense to you.  I think Trails in the Sky SC's biggest strength is definitely the writing. It's a surprisingly well thoughtout world, richly developed and lovable cast of characters, and memorable story that will reward you with a satisfying JRPG experience. I would even go as far as saying it's better than any of the Final Fantasy or Tales of franchise I played. Although the characters are pretty much your standard anime or Japanese game character archetypes, each one is fleshed out and executed well. The interactions between characters are gold, especially anything involving Estelle and Oliver since they add comedic value. While I can't say much about SC's storyline due to avoiding spoilers, if you thought FC's story was great, well you're in for one hell of a ride. FC took me around 20 hours to beat, SC took me 60 hours. Just let that sink in. Yes, the story has a few extra layers added but it's not overly complicated as long as you pay attention.  The gameplay is the same as FC but with some improvements to the turn based battle system. I really liked the addition of chained special attacks which let's you use multiple characters attack at once. More artes have been added and crafts upgraded for stronger effects. Other than that, just expect FC's gameplay.  I would describe the visual to be modernized retro style graphics you see in playstation rpg games, except a lot sharper. You can tell the production values just by looking at it and the presentation. Let's not forget the wonderful soundtrack. It adds a perfect level of immersiveness invoking a spectrum of emotions on certain scenes of events.  Lastly, I really have to give props to XSEED for their amazing efforts in localizing SC. They released the game not out of business/profit priority, but labor of love. And double props to them for announcing the final game of the trilogy that's currently in the works. While SC can be seen as the finale story, there are some loose ends that will be resolved in the 3rd chapter (I hope). So once the 3rd chapter is up for pre-order, I'll immediately snatch that up paying full price showing my support just like how I did with FC and SC. Thank you XSEED for letting me experience such a magnificent game.   Normally, I don't replay JRPGs as much, but this is worth going through the 2nd time. Overall, Trails in the Sky SC gets my highest recommendation for any RPG players out there.",
            "review_score": "1"
        },
        {
            "review_text": "A fine example of a great JRPG. Good storytelling with immersive world to explore, very diverse and interesting NPCs as companion. The battle systems are quite challenging, but no insane grinding required here. Though it is quite tedious if you hunt for achievements. This one follow the adventure from the first chapter, so you should play both of them.",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest this is probably my favorite game of all time.  I  LOVE  the characters, the story is good, the gameplay is interesting   I spent way too much time fiddling with my orbments   and the ending is... feelsy. (I love it) The voice acting is great at the times that its there (Only in combat) but i really wish there was more. Do i think you should buy this game and its prequel?  ♥♥♥♥ yes!  Partly because of depending on the success of those games the chance of getting more games from this series increases and partly because its a great damn game. My main complaint about the game as of writing moment, is that it ends. I WANT MORE DAMNIT!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best JRPG of all time. Very lovely and attaching characters. Very funny, This Olivier dude... Words cant describe the feels i had while playing the game... its very immersive and touching.  There is a lot of reading to do! A LOT. If you dont like to read, dont even bother.  @++++++++ I never write reviews, but this.... this......... WOW! MUST PLAY",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for 75.8 hours, and the best part is it has taken just over two weeks to do it. Once you get sucked into this story, you'll only want more and more. I rarely write reviews but I'll do it for this one. Let's get into the meat of it.  Trails on the Sky: SC starts immediately after the conclusion of the First Chapter and concludes the story of Estelle. Just so I don't spoil anything accidentally, I'll just say the identity of your enemy is revealed to you from the beginning, which is a nice change of pace compared to most JRPGs, which throw evil guy after evil guy at you only to reveal there's an even bigger evil guy pulling the strings from behind.  This doesn't make the journey to beat that enemy boring, though. The lengths said enemy will go in order to fulfill their evil plot will make you shudder every step of the way. And there resides one of the strongest selling points of the game. You will FEEL what's happening in that beautifully crafted pixel world. The anger, the joy, the fear... every character is so well written and developed that their emotions can touch you quite deeply. We should thank the localization team for that, too, thank you based XSEED and Carpe Fulgur for a job well done.  The attention to detail gets a honorable mention here too. There are TONS of dialogue lines which you will never see in a single playthrough, but only because every possible choice (mainly party configuration choice) you make is covered. Special dialogues if certain characters are present, interaction between characters even in the most menial of sidequests, a lot of NPCs reacting to a particular teammate because they know each other... Detail, detail everywhere, and everything adds up to the feeling that those characters have ties to people and places, that they live in cities and know half the neighbourhood, that they're not just personality clichés detached from the world and designed just to fill a particular role in your party.  That's about it for the story and immersion parts. The graphics are... well, Trails graphics. If you're interested enough in the game to look at the reviews, you don't give a damn about the graphics. The only particularly ugly thing I've noticed is that certain characters are introduced by showing a full screen image of them against the background, and the borders are BADLY pixelated. This could be easily patched, so pls fix. Slight framedrops/stutter occur in certain areas, I'm almost 100% certain it's a game issue, since it always happens in the same places (Grancel entrance, for example) and my computer runs it at 120 FPS with zero problems the rest of the time.  The soundtrack is so exquisite I have a playlist of jdk songs saved on youtube so I can listen to it whenever I'm just fooling around in my computer. A friend of mine described it like this: 'I'm feeling nostalgia listening to songs of a game genre I've never played'.  Finally, the only downside I can think about: the game abuses the mechanic of having someone appear juuuust a little too late and save the day for our heroes. It happens a number of times and it's pretty well explained so it always makes sense but... how about appearing five minutes earlier and saving me the trouble of going through that boss fight?",
            "review_score": "1"
        },
        {
            "review_text": "Trails SC is one interesting example for an old school style JRPG experience  Just like FC, SC might not be the prime example in top notch visuals and high res textures, but -imho- it points in several other, maybe even more important, aspects like gameplay, likeable characters that manage to fascinate in terms of character development over the two installments and last but not least - in storytelling.  Especially the last point, is something, I as a person who learned to love RPGs und JRPGs in particular with titles like Breath of Fire 3, Grandia 2 and the like, missed dearly in the last few recent years.  Don´t get me wrong - the Storyline of LoH: Trails FC and SC is far from being very inventive. It feels more like the 'do it yourself RPG Kit' ... it´s nothing you´ve never seen before, but nevetheless - Falcom and XSeed with their localization still manage it to make you play further on - you´ll still want to know how the story will develop any further and how the individual paths of your (possible) party members will turn out. In my case, thats something no game since DAO has archieved.  The gameplay is rock solid and fun to play - combat is strategic and deep enough, to keep you busy with various Quartz / Magic combinations but at the same time it´s easy and understandable enough for not to overburden you - in my opinion it´s simply almost the perfect mix.  One last point: in this game you´ll read. You´ll read LOTS. I´d probably even say, this game (as well as FC) is almost as much a VN as it is an RPG. XSeed managed it to localize and write it in a way, which is easy-going and fun to read (at least for me, as an vivid reader) and at the same time, it won´t overburden people not native in the english language, as myself, for example. So, once more, i´d like to tip my hat to XSeed for granting us a game which must have been one hell-of-a-struggle to translate and localize. Please keep going like that, your work on these two games as well on the others you´ve published, is very very appreciated.  Okay - last but not least - Recommendation or not ?  Well ... for people like myself, who already 'devoured' FC I don´t think I have to recommend it, do I ? But what about other players, perhaps even those never to have laid hands on a JRPG ? If you like classical RPGs, like Baldurs Gate or Albion ... I think, you should give it a try - get the first part, it might turn out quite an interesting experience.",
            "review_score": "1"
        },
        {
            "review_text": "I usuallly don't write reviews before finishing a game, but at this point my opinion is pretty set. This game is awesome. Buy it.  On a more serious note, if you haven't played the first game in the Trails in the Sky series (available on steam), well I cannot recommend you this game. You must have played the first game. Also, do note that the difficulty in this game is way higher than in its first iteration, so don't go on an play on nightmare just to make you seem tough, this game gives you challenge even on normal.",
            "review_score": "1"
        },
        {
            "review_text": "'SC' is for the second chapter. If you haven't played the first, go find that one. It's excellent. You'll need the pair, btw.   As for SC, it's an overall improvement and a great closer of the story (as it is the second half).   The whole game system of the previous game is similar, but many improvements were made to the combat and a few expansions. Combat was made a bit faster due to shorter animations and enter/exits, some complexity was added here and there. One major improvement I loved was a lot of equipment has downsides so you have to debate over certain pieces for certain builds. Not just constant upgrades like the last game. The whole orb mechanic was overhauled and feels much better.   (SPOILER FREE) Story, for the most part, is very fulfilling and ties up well as a large part of the overall LoH larger series. If you enjoyed the First Chapter, you won't be dissapointed. Still a bit slow and sluggish in some areas (especially if you're going for all the side-quests and chests and such), but doesn't get too dull and pays off in the end.   Overall, the duo is an amazing set of JRPG games. Just amazing. If the combat (for the time) wasn't a bit dull and the story was a bit quicker, I wouldn't think for a second this wouldn't be considered a masterpiece of the RPG genre. As for now, it's close. Really close.   Side note: There's a small bug to watch out for if you're using a gamepad. Some menus in the final chapter couldn't be used with a gamepad, and it took me forever to find out via Steam forums that the mouse can be used to click on menu items when this happens. Duh, right? Stupid me. If this happens, remember the mouse!  Second side note: I had quite a few problems running the previous chapter, nothing game-breaking, but a few jolts. Many of those problems don't exist in the SC. I still get frame-stuttering in certain areas, but not as bad. Outside of that there's the final chapter menu/mouse problem. That's all. Pretty well ported this time.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the game, and I really wanted to write a review on it. After playing SC, I can see why FC and SC are split into two parts, and that both are worth getting. I've been following XSEED on their development on translating SC and they weren't kidding about the script size. It's huge and plays a huge factor on why this game is so good.  SC (Second Chapter) is significantly darker than FC (First Chapter) in many respects, but still maintained a light tone throughout. I mean, it goes deeper into the overarching group Ouroboros and explains a lot of the things which FC doesn't.  Comparing with other JRPGs, the most unique thing about Legend of Heroes is the parallel storylines that takes place throughout the entire series. Most of the NPCs have their own storyline that runs in parallel with the main story, and sometimes they overlap and change the scripting around based on the actions our heroes take throughout the game. So, while the game can technically be rushed, the full magnitude of the world of Liberal can be appreciated simply by talking to each NPC after completing each milestone. It's a tedius process but it's very very worth it. It brings so much life to the game, it's actually really impressive with the amount of detail they went into the scripting. I can go on and on with examples, lets just say pretty much nearly every NPC with a name has a story one way or another! I would get this game just because of that! And after starting a new game+, not only does all of the main characters have this nostalgic feeling to them, even the NPCs have a nostalgic feeling... something I do not normally get from other games.   While SC was significantly darker than FC, both FC and SC stayed very true to oldschool JRPGs. The style, the character development and the unravelling of the main antagonists and twists. The progression and the fact that there's already a diverging storyline early on in the game makes the game have replay value. I honestly did not expect the game to be this thorough, something that I find to be lacking in more modern rpgs. Most playable characters have so many ties to the world and from it there is a great deal of character development throughout the series. Every character was unique and enjoyable. The plot turns in the story was also very good, the cutscenes are great and there were a lot of funny moments. Olivier is my favourite character in the series =P.  There are also side quirks in the game, like gambling, fishing, and cooking which all ties with how the scripting is handled in the world at various times. They also help you in same way as well so there is incentive to work on them. There are also bracer points to maximize, which gives you reward items and scripting changes as well. There are some puzzles in the game, however they are not an integral part of the game.  The music is fantastic. The battle system is great, with some battles being very difficult, especially near the end! The customization with the orbments gives some unique tactics throughout the game. Every character also has their own unique S crafts and weapons, which brings additional flavour to how each battle is played out. One major difference between SC and FC are that there are interchangeable characters throughout most of the story, meaning that you can pick, from a group of characters, 4 to take with you to progress the story. This changes the scripting based on what characters you choose, and adds to the replay value to the game.  While the graphics is a bit lacking compared with modernized RPGs, I must say it adds to the nostalgic touch to the game. However some might enjoy this because it allows room for the imagination to fill in the gaps. The cutscenes/fight scenes are still very good. And honestly, albeit the lack of graphics, how Falcom made use of it still captivated me throughout.   What can I say, I banked a good 110 hours on this game and that's just online. Looking at some other recommendations some of them banked 200 hours even! As far as the bang for the buck for an RPG is concerned, this game is pretty much worth it, as currently I am paying ~30 cents per hour for the game, and I suspect this number to decrease after this review is published. Most other JRPGs I would expect aronud 50-70 hour play time.  Buy this game, not only because it's good, but also if you also want to support more JPRGs that focuses more on the storyline/character development itself! Also, SC practically one-upped FC in so many ways as well, so if you liked FC then be prepared for a treat!",
            "review_score": "1"
        },
        {
            "review_text": "  The Dream Continues",
            "review_score": "1"
        },
        {
            "review_text": "First off, if you HAVEN'T played the first game yet, then stop reading, go get it, play it, complete it 100%, and THEN get this game and carry it over. It's worth it in more ways than one, believe me, and you won't feel totally lost here!  This is one of my highly recommended JRPG series for a good reason - excellent gameplay mechanics, great in-depth and compelling storyline carried straight over from the first game without missing a beat, and of course the characters - of which you get to control some new characters you didn't in the first game.  You will probably spend a lot of time exploring and talking to NPCs just like in the first game, but that's the beauty of it - the game world is so beautifully done it makes you WANT to explore every nook and cranny of it, it makes you WANT to actually do those side quests. Sure, the graphics are a bit dated, but the level of detail is still overwhelmingly good for a game like this. Oh and there are a few places outside of battle where the environment itself does damage to you/your party, which is new to SC.  I also have to give high marks for the music. A lot of the music was carried over from FC (and hey the music in that game was great too!), but many new tracks were added in as well, especially for the various combat themes.  The combat system is the same as it was in FC, with some nice enhancements to it - the least of which I'll mention is the addition of new crafts (including the Chain Craft system) and new orbal arts thanks to enhanced Orbments. Oh. And attack food. You heard me right. Nothing more satisfying than to chuck a cookie at an enemy and watch it do the damage.  And of course the witty treasure chests are back! I will make a note here that initially when I first played through, they weren't all that unique at first, you had to play through a bit before you saw much in that. It may have changed in the meantime, but just keep that in mind.  The fishing minigame has been enhanced (you can now fish in many more spots and there's more challenge to it), and there's also gambling minigames now - you can play poker, blackjack, roulette. You even have a side quest involving gambling now. I spent a fair amount of time in the gambling minigames because like the real deal they were ADDICTING!  Enough of me rambling on about the game. IF you've played the first game, then hurry up and get this game and continue the story! If you don't have the first game, GET IT FIRST, play it through, then get SC and carry over your completed FC save over! I promise you'll be sucked in by this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best JRPG I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone needs to play this beautiful masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Give us the news regarding third chapter already!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "XSEED, a localization company notorious for desecrating masterpieces with stale memes, misplaced references, and hideous fonts, actually managed to hold themselves back from completely destroying this one. Since the story is one of this game's most prominent features, it's really a good thing that they did. It didn't escape unscathed, though; the main font is pretty bad, and they UNIRONICALLY use Comic Sans multiple times in this game (though thankfully not in places you'll see all the time.)  Unless you speak Japanese, it's this localization or nothing, so in all seriousness I am grateful to XSEED. I do wish they'd quit it with the awful Internet memes. It's like they don't know memes age like milk. I sure like playing Ys: The Oath in Felghana and seeing 'Forever Alone' pop up on my screen. Men of class and taste can distinguish flash-in-the-pan memes from more long-lasting ones, but even then, you should either write real comedy or not attempt humor at all, because memes are garbage.  Basically the point of this review is that XSEED should hire me.",
            "review_score": "1"
        },
        {
            "review_text": "If you thought the first game was incredible, the second chapter will blow your cranium to oblivion. This game improves on the previous chapter in every way possible. The story goes on full cylinders from start to finish, with returning and new characters appearing with brick solid storylines that make you care immensely. The combat expands further with more Orbments to work with allowing for more awesome Arts to be utilized to really dazzle your screen. There is of course, the soundtrack, oh my gosh, the soundtrack, what a beast it is! The first soundtrack was fantastic, but this game's blows it away, especially the boss battle themes that get you pumped up for a satisfying fight! Not gonna lie, this game is huge. Took me slightly over 100 hours to finish it on Hard difficulty!  I am updating this review now that I finally finished this masterpiece on Nightmare difficulty. It was one hell of a journey with a lot of experimentation to overcome its plethora of challenges. The game may seem unfair at times due to its spike in difficulty, especially during the Prologue, but once you get passed those obstacles, you will feel like a king, or queen if you are lady, for beating such odds. If you intend to take the challenge, be fully prepared for a long haul as you are going to need to do a A LOT of farming in order to actually stand a chance against the bosses. You have been warned! ;)  If you are new here, leave this page now, go buy First Chapter, finish it, then come back and pick up this epic slice of heaven! You will not regret it!   *Oh and be sure to finish the First Chapter with 100% completion, you will be rewarded at the start of this game for your efforts.",
            "review_score": "1"
        },
        {
            "review_text": "Small note: I have finished the game offline, and am currently on my second playthrough, hence explaining my relatively low playing hours on Steam.  Will get around to finishing it again once I'm done playing FC on the PSP.  This is a review for both games in the franchise.  Video games are a medium of entertainment like no other; they can tell engaging stories and present them like no other medium can, they can involve interactions with countless characters and can make us view characters in various ways depending on various routes, quests and interactions (novels are much more restricted in these aspects). And yet, video games often fail at reaching many people, and despite constantly evolving and presenting stories like no other medium can (examples being the likes of Shadow of the Colossus or The Last of Us), due to ignorance and a lack of understanding about the medium as a whole.  An issue that plagues gamers in general nowadays is how to view graphics as well; on one hand, graphics are better than ever, and can enhance the overall experience (whether it's atmosphere, gameplay or simply the game as a whole looking nice). On the other hand, there are gamers craving the old-school appeal of the likes of Chrono Trigger or The World Ends with you, where the games are more focused on the dialogue, character interactions and world exploration. The game I'm mentioning in this review is an old-school game that emerged in an age where people are leaning to the former rather than the latter, though story-based games aren't without their fair share of fans.  Legend of Heroes: Trails in the Sky is a game with a rather strange history. The game is easily among the biggest JRPG franchises in Japan, yet has cult classic status elsewhere; for those unaware, a cult classic is something that has a small following, yet the fans of whatever it is absolutely adore and may go so far as to hold it as one of the best in its genre for whatever reason. Legend of Heroes: Trails in the Sky (from this point onward referred to as just Trails in the Sky) is one such game.  The game was originally released in 2004, and was eventually translated in 2011. A sequel to the game, referred to as Legend of Heroes: Trails in the Sky SC (short for second chapter) was originally released in 2006, and translated in 2015.  The game follows two characters, Estelle (a tomboy who has an obsession with sneakers) and her adopted brother Joshua (whose past is a complete mystery). They become bracers at the beginning of the story, and face various challenges along the way.  While the premise will undeniably turn some people off, the storyline is a lot more than what it seems. The game deals with a wide variety of themes, whether its war and the effect it has on various people, the effect using a particular resource has on people, how much are people willing to sacrifice for peace and much, much more. The story is also epic in scale, and by the end of the first game the player will wonder if there is a resolution to the dozens of subplots going on (small spoiler: yes for the most part, though I still want the third chapter over).  The characters are among the most lively I've ever seen in any work of fiction of general, with some of the funniest dialogue I've ever read (the game has practically no voice acting) as well as being extremely developed with a great deal of care and subtlety. A lot of effort was put to make the characters follow conventional tropes only on a superficial level and make them very multi-layered and complex, making them come off as (and this isn't easy to do) human.   In fact, the game's greatest strength is how natural and human everything feels. The character interactions, story events and dialogue never feel forced or unnatural, making it easier for the player to be immersed in everything that happens. Another massive positive that connects with my opening point that games can tell stories no other medium can tell is how lively the world is. There are literally hundreds of NPCs, each with their own personality, motivations and backstories, and interacting with them from the first game to the second game can vary wildly (especially if you maintain save files from the first chapter to the second). This is extremely rare among video games, which almost never give any semblance of a personality to NPCs, much less continuous development or any interesting interactions.  The gameplay is turn-based, mainly revolving around managing and upgrading orbments, and within battle paying attention to benefits as well as casting arts. The game is relatively easy, but has massive difficulty spikes while fighting bosses, making it challenging yet extremely strategic since there are also various benefits depending on the turn a character is fighting. These benefits can be received by foe and ally alike, and a large portion of the gameplay is dedicated to making sure your allies receive those benefits.  The graphics are extremely dated by modern standards, but also rather fitting for the game, matching its retro feeling.  The soundtrack is easily among the best in any video game period, and manages to never feel out of place or unfitting the scene or battles it plays in. Seriously, look up a few tracks on YouTube and try to tell me its bad music, I dare you. I cannot recommend this game highly enough, especially if you are fond of engaging storylines and want something more old-school.   ",
            "review_score": "1"
        },
        {
            "review_text": "First of all, if you haven't played The Legend of Heroes,: Trails in the Sky First Chapter yet, do so now. Go on, I'll wait...   Done that? Good. Now I don't have to give a review. If you played through the first game, then you know just why you should pick up this one.",
            "review_score": "1"
        },
        {
            "review_text": "I cried tears of joy when I finaly heard that this game was being released. I've been waiting for this game for so long...",
            "review_score": "1"
        },
        {
            "review_text": "After finishing this, you'll end up researching the entire 'Legend of Heroes' game franchise and looking for ways to play them all. The mythology is that engrossing. Hopefully the 3rd chapter get localized, but for now on to Trails of Cold Steel!",
            "review_score": "1"
        },
        {
            "review_text": "This and the first chapter are really my greatest games of all time  And much like the first game, it's just downright amazing from beginning to end. There is just so much love and attention to detail put into these games and it really really shows. This game is an experience and I cannot even express with words how much I recommend it and how important of a game it is to me now. Please give these games a go. You won't regret it",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel. Story is much more epic and there are a lot more playable characters. You should play the first chapter before trying this game, as a lot of the backstory comes from the first game.  And just like the first game, SC has a lot of plot twists. Went 'holy ♥♥♥♥ didn't see that coming' quite a few times.",
            "review_score": "1"
        },
        {
            "review_text": "The much awaited return of   Joshua   Trails in the Sky is brought to a climatic end and leave you begging XSeed to bring the rest to us before we go mad! ",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: If you played the first game and liked it, this game is worth your time and money. Buy it when you have the finances for it. If you didn't like the first game for certain elements, you most likely won't like this one either since it retains basically all of them on top of all the new stuff. Here's my review of the first game:",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly enjoyed this game, particularly as a follow-up to Trails FC. The story is immersive and has moments of humour and seriousness, punctuated by the occasional dose of bad-a$$ery. Highly recommended, but replay value is hampered by tedium (battle animations, backtracking, menu system - similar issues with FC).   Pros: * Enjoyable characters * Immense level of detail put into the world - recipes, books, conversations, etc. * Engaging story * Soundtrack   Cons: * Not much in the way of new maps/locations vs. FC * Inability to skip battle-animations * Excessive backtracking between locations (a waypoint type of system would have been nice) * Menu system is annoying to traverse (lack of sort/filter for items, equipment/party exchange is cumbersome)",
            "review_score": "1"
        },
        {
            "review_text": "This series has slowly risen to the top of my list of favorite jrpgs. The second chapter continues right after the end of the first game and is every bit as great as the first with a few added quality of life features. If you are an old school jrpg gamer you will find an appreciation for this game and the entire series as a whole. Buy it, play it, love it.",
            "review_score": "1"
        },
        {
            "review_text": "Just great. More of this style of RPG and Steam will get far more of my yearly wage. Absolutely fantastic game, great fun, reminiscent of older RPG's but with a far deeper and more intricate world. Something I'll play time and again.   Whoever made this game: Please make more like this,",
            "review_score": "1"
        },
        {
            "review_text": "Just sublime from start to finish, almost perfect.",
            "review_score": "1"
        },
        {
            "review_text": "I've been waiting for a decade to play this installment, The Legend of Heroes: Trails in the Sky SC are just a massive awesome game with a deep story telling, great improved combat system, beautiful soundtrack and even the NPCs have their own line and each one of them have a freaking NAME and have their own mini background story (not all of em tho). Each choice you make in the game will really affect your gaming experience and it's simply awesome.   and each one of the playable character are really interesting in their own way, heck... even you can control a cute, adorable toddler that carrying a big-a$$ machine Gatling gun in the battle while saying 'PREPARE TO MEET YOUR DOOM....' and saying 'huh,,, Scary!!!' afterwards LOL     Amazing OST ✔    Epic Story ✔    Relaxing and Fun Mini-game ✔    Awesome Side quest ✔    Gin no Ishi, Kin no Tsubasa ✔    and of course More Tita &amp; Olivier than ever ~~~   worth every penny &amp; time i spent   ",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed the first game, why are you reading this? It's more of that, except bigger and better. And, y'know, cliffhanger resolution and all that. You already know you want it. Go buy it.   If you haven't played the first game, you also shouldn't be here. It's a direct sequel, it starts pretty much immediately after the end of the first, go get the first game before starting this.  ",
            "review_score": "1"
        },
        {
            "review_text": "My god, its just so good. Music, gameplay, story, everything is just on point. Easily the best RPG of this type I have ever played.  Newcomers: Make sure to play the first one first, otherwise you will be lost.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome old school RPG",
            "review_score": "1"
        },
        {
            "review_text": "Part 2 of Trails in the Sky; both games are basically one game split in half.  Has a few new mechanics (like Fishing), and picks up where the story left off in FC. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This is the sequel to the first chaper, so , If you enjoyed the first one then this is a must buy!   First one had an amazing cliffhanger at the end and now fans of this series can finally find out what happens next!!",
            "review_score": "1"
        },
        {
            "review_text": "“可愛いことは正義だもん！” by Anelace Elfead",
            "review_score": "1"
        },
        {
            "review_text": "All the negative review owners have more than 50 hours playing this game. If it was really bad they would give up in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "This game definitely improved over FC which is already a great game.  Hopefully we will see the 3rd translated as well.",
            "review_score": "1"
        },
        {
            "review_text": " Trails in the Sky SC",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful continuation from the first game,as of march there is hope for the third installment. Of course, we will all still be waiting to see if they ever convert the cold steel series to pc, which is still doubtful. It's vastly more positive than their previous statements that relayed there wouldn't be a conversion of the rest of the series.  Hopefully it will actually be out by spring of 2017, the last one took them several years. . .  Still, the game play is entertaining, easy, and has a great story line.  I wont post any spoilers, you will have to play through it yourself. If you liked the old final fantast and ultima games then you will love this one.  Play the first one first though!",
            "review_score": "1"
        },
        {
            "review_text": "Slow, dull battles in a system thats pretty much identical to the prequel. A plot that plods along at a glacial pace. Simplistic, awkward dialogue that repeats itself more often than not.  I got this on sale and I still regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent second chapter to this series. The characters are fantastic, the world immensely detailed and full of life, the story is gripping, and the battles actually do not get too tedious (and when they do, equip one of the various quartz that makes it easy to avoid battles!) I highly recommend everyone check out the first chapter AND this one!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy a  long  and  story rich  adventure Trails in the Sky is definitely for you.  What this game lacks in graphics makes up with it's rich story and length (When I said long, it's really long, took me 100hrs in to finish the game). And you get Olivier -- The Hunter of Love, I mean what else could you ask for?  Story Length: About 50 hours of mainstory, Another 50 hours for side quests  If this is the first trails game you have played, I highly recommend you to start in the first chapter first. Because the story of second chapter starts you right off the bat at where the first left off, if you haven't played it, you will have no idea what happened.  If you are a huge fan of JRPGs, or RPGs in general, this game do not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "If JRPG is your type of game, you won't go wrong with this.",
            "review_score": "1"
        },
        {
            "review_text": "This game has cheese 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game and its predecessor First Chapter belong to a rare breed that's all the more rare these days: The turn-based, character-driven JRPG with great storytelling and music, but less emphasis on impressive graphics. If you've enjoyed games like Suikoden, Grandia, Lunar or Xenogears in the past, this is the best game you could buy today. Just remember to start with First Chapter; it's a continuous story, and it's one of the most powerful stories that've been told in gaming since the days of Suikoden 2.",
            "review_score": "1"
        },
        {
            "review_text": "Looking forward to the third chapter!",
            "review_score": "1"
        },
        {
            "review_text": "The best JRPGs on Steam. Do finish the first game first though or you will get confused with the story. SC continues of direcly after FC and does plenty of things better.  YES: +Great story with a satisfying ending +Plenty of sidequests +Runs on toasters +Skill customization is improved +More party members +More character development  +NPCs (Anton lol) +Minigames (Fishing, Casino Stuff) ++THAT SOUNDTRACK +++MORE OLIVIER  NO: -Dated graphics -Lack of voice acting -Anelace not a permanent party member   LOVE IT OR HATE IT: +-Old School Battle System +-Difficulty  Hopefully, one day The 3rd will eventually get translated.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommend. This is no FInal Fantasy at least by today's standards (which is a good thing imo). Put it up there with Suikoden, Lunar and Chrono. Like those games and you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "The Trails series is the gold standard for turn-based JRPGs, and has been for some time. It's good to see them finally being translated and released in English. SC follows directly after the events of Trails in the Sky, and resolves most of the stories of its characters while leaving lots of room to expand upon the story of Liberl and the Zemurian continent as a whole.",
            "review_score": "1"
        },
        {
            "review_text": "The Legend of Heroes: Trails in the Sky SC fills in a lot of the questions and plot holes from the first game while retaining a great OST and same battle system. Expect many plot twists and A LOT more character development than from the first game.  Amazing conclusion and follow-up from the First chapter. However, there is a Third chapter that will be probably releasing sometime around 2017 so if you've fully enjoyed the first and second chapter, the third game is not necessarily needed to play since SC offered a nice conclusion, but from the ending of SC there are still some things not fully revealed if you're still interested.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs I've ever played. The first game was very good but ultimately didn't do anything truly special, this one continues where it left off and manages to use the first one's 50 hours worth of world and character building to create a truly incredible experience.  Also, even though this is the better game, you HAVE to play the first game first. The story has so much less impact if you don't.  This was easily my GOTY (despite originally being from 2006).",
            "review_score": "1"
        },
        {
            "review_text": "Roll playing game of a lifetime.  Excellent port, fantastic translation.  I love the detail in the dialogue and the detail in every character.  Truly, phenomenal. I can't begin to fully describe this masterpiece of a game. It toys with my heart, makes me laugh, makes me smile, makes me cry, and makes me frown.  Anyone, ANYONE, can appreciate certain elements of this game. From one, to one thousand elements. ",
            "review_score": "1"
        },
        {
            "review_text": "I'll recommend this game to anyone who is a fan of JRPGs made in the old style, names like Chrono Trigger or Final Fantasy 6. To be perfectly clear, the graphics are nothing to write home about and the combat system is functional and does it's job, while providing a fair degree of customization regarding how you build your characters via the quartz system and its associated buffs/debuffs.   It is the story where the game really shines. There are a lot of NPCs in this game. A mindboggling amount. And most of them have their little stories to follow and something useful to say. The main cast is excellent, with Estelle being an interesting change from the usual 'woe is me' burdened protagonist we've often seen. There isn't much I can say apart from recommending you to at least try it, or the first game. If the characters grow on you, it'll be a game very much worth the 80+ hours you might spend on it.",
            "review_score": "1"
        },
        {
            "review_text": "The best JRPG OF THE decade",
            "review_score": "1"
        },
        {
            "review_text": "I played the original on my PSP several years ago, and I remember LOVING that game. I was really bummed out when I found out that the second game hadn't been released, and after some years I just forgot about Estelle and Joshua - until I got a Steam account. I looked around the store for any games I would like, and finally found this. The continuation of the first Trails game. I was THRILLED! I bought it and started playing it the same day, and I can say without exaggerating that this game is just as good as the first one - if not better.  The characters have all developed since the last game, and the tone - while still having that Trails humor to it - is a bit darker than the first one.  The combat system is great, and I loved messing around with my orbments to get the best arts possible (white Gehenna, Saint and Clock Down ftw).  The world map is less detailed though, and doesn't display road names etc. The only negative thing besidets the map is that it has distracted me from reading my uni textbook...  But, yes, I highly reccomend this game to Trails fans and RPG-fans alike (though if you're new to the game, you should of course play the first game first.)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best jrpg's I've played.",
            "review_score": "1"
        },
        {
            "review_text": " No one's looking. Cry as long as you want. And I'll... just hold you like this.   Fans of the original Trails in the Sky have long awaited this almost ill-fated sequel, not only is the painfully long wait over, but it is exactly what we all wanted to see and more. Trails SC continues the story of the first game and far exceeds expectations in terms of story.  The gameplay is essentially identical to the first game with the addition of Chain Crafts, which allow multiple characters to attack in the same turn at the expense of some of their CP, and a new Orbment system which balances the magic system a bit and allows for more and better magic. The new Orbment system requires slots to be upgraded after unlocked in order to use more powerful Quartz, some of this better Quartz is either improvements of older ones, combination of two effects or brand new ones. The Orbment menu is now thankfully color-coded to know which line you're putting Quartz in and aids to better visualize the Sephith sums of each line. Other than that the game also adds a fishing minigame and some gambling minigames at the casino in Ruan for your leisure. The Bracer Guild quests are back and the game still follows the same chapter structure but allows you to edit your party as long as the plot dictates that they can be in your party. The battles have improved slightly with shorter attack animations, improved Crafts, new S-Crafts and encounters that force you to devise new strategies.  Graphically the game is exactly the same as its predecessor. HD assets and almost every PSP exclusive feature are available from the beginning. In the sound department we have new songs in combination with older ones that add up to a really expansive soundtrack. The new music exclusive to SC is fantastic and probably far better than its predecessor, with more rocking tunes and even the relaxing new ones have a better feel more suited to the current plotline and a final boss theme that might as well be one of the best in the series. Unfortunately, updating a 2006 game to new standards has also included a slew of bugs. While there are workarounds for every bug I’ve managed to get stuck in some places and in the worst case I accidentally did a sequence break and skipped a major boss fight altogether. The translation also feels spotty at times but with the huge amount of text there is I’m willing to let it pass. Treasure chest jokes are unfortunately missing for the most part.  Just like its predecessor, the plot takes the spotlight in this game and I’d even say outright steals the entire show. Right from the beginning stakes are higher as the story continues right after where FC left off, we join Estelle as she looks for Joshua and tries to become a stronger and better Bracer while getting an insight on the mysterious group “Ouroboros”. Even though the pace remains rather slow, in every chapter our heroes face bigger threats compared to those of the first game and a lot of conflicts that were subtly hinted in the first game unfold. Even the sidequests are a step-up since they no longer involve such menial tasks since now the world is in danger and quite a few involve subplots essential to the world-building of the game. Trails SC is a lengthier affair than the first game, clocking at around 40-60 hours in an average play, with a New Game+ available and various difficulty modes if you ever want to replay it.  There isn’t a lot to say about Trails SC that hasn’t been said in reviews of the previous game other than “it’s bigger and better”. If you enjoyed the first game then SC is a must play, if you didn’t then you probably are missing out on a truly exceptional traditional RPG, one that took a long time to arrive and is worth every second and penny invested into it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best conclusions to one of the best JRPGs ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Not recommended. Makes playing other JRPGs near impossible, as it's just so good everything else appears like garbage afterwards.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just great, if you've played the first chapter, this one is like a fulfilling experience. Not only its fun to play, good strategy rpg gameplay, enjoyable overall; it has great character development, emotional attachments and a big climax that will make you feel like it was all worth it.  Seriously great game, just play it.",
            "review_score": "1"
        },
        {
            "review_text": "Well this is probably the easiest review ever. Did you play and enjoy Trails in the sky to completion? Then yes, you should totally buy this game. Have you not played Trails in the sky yet? Then go play that first, then play this game. It's called second chapter for a reason. You don't start a book halfway through...probably. Do you do that? If you do that's kind of weird honestly. I'm getting off topic. This game's great, basically. Third chapter when.",
            "review_score": "1"
        },
        {
            "review_text": "Recommend. must play for jrpg lover.",
            "review_score": "1"
        }
    ]
}