{
    "app_id": 251510,
    "name": "Constant C",
    "release_date": "2014-03-11",
    "developer": [
        "International Games System, Co., LTD."
    ],
    "publisher": [
        "International Games System, Co., LTD."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Puzzle",
        "Casual"
    ],
    "achievements": 15,
    "positive_ratings": 44,
    "negative_ratings": 7,
    "price": 6.99,
    "description": "In the year 1905, Albert Einstein published the theory of special relativity, suggesting that nothing could move faster than the speed of light. What if any mortal could break that constant? Stretch it beyond its limits? Would human beings finally be able to find a way to cheat death and win over immorality?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251510/header.jpg?t=1447358645",
    "minimum_requirements": "OS: Windows 7, Windows 8, Windows XP Processor: Intel Duo Core Processor or Up Memory: 1 GB RAM Graphics: DirectX 10 Graphic Card DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": "Memory: 1 GB RAM DirectX: Version 9.0c Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I've play this game on Desura. Puzzles are well design. Make your hurt your brain when you are struggling, but also feel very smart when you finally figure it out. I highly recommend this game to anyone that wants an interesting and challenging puzzle platformer, or anyone that just like something new and fun. Music is fantastic. The new Time Attack Mode really is very intense. There are also a lot more new Levels in Time Attack Mode!",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very solid, unique mechanic that works really well - objects don't move unless they're close to you. This is a great mechanic because it creates interesting dynamics and lets you take the puzzles at your own pace. The gravity shifting also synergies really well with the time manipulation.  HOWEVER  While I like those mechanics, the game suffers from poor pacing and uninspiring level design. The difficulty curve could be more consistent, and some things could be explained a bit more, but my biggest gripe pacing wise was the time cube thrown in at the last section. It's essentially a second you which only moves through gravity, and it's another mechanic I really enjoy, but it comes in too late to be used very much.  The game boasts 100+ levels, but here's a rough breakdown of them: ~20% I'd call easy enough to be filler levels ~40% are  more  filler levels which are trivial just to pass, but also have collectibles  (Example)  ~25% solid, enjoyable puzzles ~15% unclear, at times frustrating levels  The story didn't catch my attention and I didn't even pay attention to it.  I want to reccoment this game because I enjoy its foundation, but its bland level design and meh execution makes me hesitate to suggest it. At the very least, just know what you're getting into and it'll be fine. 75/100",
            "review_score": "1"
        },
        {
            "review_text": "its the worst game ive ever played i wanna kill it",
            "review_score": "-1"
        }
    ]
}