{
    "app_id": 251530,
    "name": "Anomaly Korea",
    "release_date": "2013-11-06",
    "developer": [
        "11 bit studios"
    ],
    "publisher": [
        "11 bit studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Tower Defense"
    ],
    "achievements": 35,
    "positive_ratings": 433,
    "negative_ratings": 113,
    "price": 3.99,
    "description": "Exclusively brought to Steam for PC, Mac and Linux in Anomaly Bundle, Anomaly Korea is an expansion campaign to Anomaly Warzone Earth. The alien robots are back and this time they’ve got Korea in their sights. It’s your job to lead a squad into fierce fire-fights and fend off the alien invasion.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251530/header.jpg?t=1549526727",
    "minimum_requirements": "OS: Windows XP SP3 (32 bit) / Vista Processor: Intel(R) Core(TM)2 Duo 2.1 Ghz or equivalent Memory: 1024 MB RAM Graphics: GeForce 8800 or equivalent DirectX: Version 9.0c Storage: 700 MB available space Sound Card: Integrated",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you liked the original Anomaly (Which I loved), chances are you'll enjoy this. It bares no real differences besides the fact that this is a ♥♥♥♥♥♥ mobile port where alt-tabbing will lead to certain doom. If you've never played the original Anomaly I'd suggest skipping this, but if you're adamant, let me tell you what you have in store for you.  This is a 'tower-offense' game, the inverse of the usual tower defense. It's a short game, but there is a splendid variety of units for you to bring into battle, and towers for the enemy to set up. You will take on several story-based missions that serve as kind of a sequel to the original Anomaly (So if you've never played that, you'll have no idea what's going on here). The game challenges you in different ways such as preventing you from calling in more units, stopping you from acquiring more powerups (Very important tools you can use to give your units the edge in battle.), giving you a time limit, and etc.  The story isn't as in-depth (Nor is it necessary to experience before moving on to Anomaly 2), about every unit is recycled from the original, there are NO graphics options to speak of, nor any audio quality options.  It's a very unique concept but also much better done in the original Anomaly game rather than this crappy mobile port. It's ok, but really not a must-play unless you're head over heels in love with this series. I'll give this a 6/10. It's ok, it's not bad, but doesn't really live up to the name the original Anomaly made for itself. This PC port was clearly just made as a grab for money as the port itself has no effort put into it, and because of that, I cannot recommend you picking this up on PC.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a nice game from the Anomaly franchise. It's way too short though...barely over 10 levels",
            "review_score": "1"
        },
        {
            "review_text": "Well, I finally got Anomaly Korea, so lets see how good this is. (I have played this game a LOT more than 13 minutes)  Anomaly Korea is a top-view reverse tower defense game, when you are in control of a task force whose goal is either destroy all towers or get to a certain point on the map. The game starts off after the events of the original Anomaly. You play as a commander fighting a war against a race of sentient alien machines (that is literally what they are called). They have now targeted korea, and you are the only thing in the way of the machines at the moment. So, lets get to the review.  Pros: - Good graphics, great visual effects. - A variety of vehicles at your disposal. From mechs to tanks to mobile shield generators. - You can change the formation of your convoy. (protip: keep your most powerful unit at the front to soak up damage) - There are special tactics you can use in the battle. You can use anything from healing to smokescreen. - Campaign is really good. Got me hooked in the first 10 minutes. - (I think this is the best part) you can change the course of your units mid-battle, which allows you to make split decisions when something new shows up. - Runs smoothly even on weak computers with decent graphics.  Cons: - The game gets a little repetetive later on. - You have to play the first game in order to understand what actually happened beforehand. (for instance: where did these machines come from? What is their goal other than destroy everything?) - No multiplayer. :(  Overall, this game is a great game to get if you are into reverse tower defense games. It mixes strategic path making and fast reaction skills to make an excellent strategy game. It's graphics are pretty good for being a port from a mobile game. There are actually uses and purposes for having certain units in your convoy.  I give this game a 7/10 (Definitely worth a look). This game is awesome if you are a fan of strategy and tower defense. If you are new to the franchise, I highly recommend this game to start off with. The storyline is gripping, and it actually feels like you are fighting a war against giant robots.",
            "review_score": "1"
        },
        {
            "review_text": "Bad port of a tablet game. No resolution options. No controller support or even key binding options. Not to mention the fact that the gameplay mechanics are overly simplistic for a PC game.  But what is even more inexcusable is the fake Korean voice acting and language. The 'Korean' accent is horrible - it's more like an American attempt at a Chinese accent. The Korean words on billboards and such are mostly non-sensical. Let's just give the devs the benefit of the doubt and attribute this to their ignorance and not some overt racism.   If you can't be bothered to hire a Korean voice-actor or research at least a bit more into Korean language, then don't include 'Korea' as part of the title.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't really like, tower defence games but this one touched my heart. It was pretty intersting and fun to play. Good graphics and story too.  9/10 Recommended ",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and game mechanics, the overall sound is okay. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "50%-50%",
            "review_score": "1"
        },
        {
            "review_text": "Good game for boring moments. It forces you to think but not to overthink. Game is allowing you to make your own decisions in so simple gameplay. In few words: It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "A Strategic game base by Towers Defense, but the twist is you are the attacker and your gonna make route,what army you've gonna use and upgrading it. It also has a great graphics for 600mb+. Download it now guys. :)",
            "review_score": "1"
        },
        {
            "review_text": "Anomaly Korea is a game that I recommend because: - have a good price - is a method to banish boredom - is a nice indie game - have trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "i got this game free in dlh site.. and such an amazing game worth my time :3 (hope to spend some bucks in this one since i got it free) (y)",
            "review_score": "1"
        },
        {
            "review_text": "this one beter and harder then anomaly war zone earth but i like it really good",
            "review_score": "1"
        },
        {
            "review_text": "Worth that money !",
            "review_score": "1"
        },
        {
            "review_text": "Nice game'o",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Really beautiful and high quality tower defense game. I recommend it! 10/10.",
            "review_score": "1"
        }
    ]
}