{
    "app_id": 251730,
    "name": "Legend of Grimrock 2",
    "release_date": "2014-10-15",
    "developer": [
        "Almost Human Games"
    ],
    "publisher": [
        "Almost Human Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Dungeon Crawler",
        "Adventure"
    ],
    "achievements": 60,
    "positive_ratings": 2075,
    "negative_ratings": 215,
    "price": 17.99,
    "description": "Legend of Grimrock 2 is a dungeon crawling role playing game with a modern execution but an oldschool heart. A group of four prisoners have shipwrecked on the secluded Isle of Nex. The island is filled with ancient crumbled ruins, mysterious shrines and a vast underground network of dungeons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251730/header.jpg?t=1447358653",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core 2.33 GHz Intel or 3.0 GHz AMD Memory: 2 GB RAM Graphics: Geforce GTX 8800, AMD Radeon 4850 or Intel HD Graphics 5200 or better (1GB graphics memory or more. Shader Model 3.0 needs to be supported). Minimum supported resolutions 1280×720 and 1024×768. DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Quad Core 2.66 Ghz Intel or 3.2 GHz AMD Memory: 4 GB RAM Graphics: Geforce GTX 660 Ti or AMD Radeon 6850 or better (1GB graphics memory or more. Shader Model 3.0 needs to be supported). Minimum supported resolutions 1280×720 and 1024×768. DirectX: Version 9.0c Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "This is how you do a sequel.  Writing a brief review of  Legend of Grimrock 2  is the easiest thing in the world: it's just like  Legend of Grimrock , except much bigger, more complex and better. Fixing all of the first game's minor woes (like the skill system, now completely reworked to be much more flexible and less exacting), it brilliantly survived the transformation from a straight dungeon crawler into a more open-world type of design, going for broader rather than deeper dungeons in a rich (and sometimes genuinely surprising) variety of environments while still keeping everything tight and focused: exploring an island where everything is related to everything else, hidden paths tie it all together and nothing is quite accidental.  With the addition of multi-level maps to really amp up the complexity of puzzles and more varied enemy types to spice up the fighting,  Legend of Grimrock 2  is more than just a worthy successor to the brilliant first game; it's an expansion on everything the first game promised and delivered. A huge, beautiful, clever and fantastically polished RPG experience and easily one of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "So far this is a HUGE improvement and expansion on the original, it's more open-ended, you spend as much time out on the surface as you do in dungeons, there's a night and day cycle, more secrets, more loot, more everything! It's a challenging game but you can always chicken out and check the solutions to puzzles on the internet if you can't brain your way through it. If combat is too hard for you, just set the difficulty to Easy. Great fun game, fantastic atmosphere and sense of mastery!",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the most significant dungeon RPGs in years. As good as GR1 was in a throwback to the good-ol-days, GR2 takes the next step, improves on nearly every aspect, and provides a much deeper, thoughtful, and dynamic world.  The amount of character variation is incredible; between the combination of race/class/and ultimately how you decide to build each person. There's no 'right' or required group, and it seems as if a variety of class/build combinations would be successful and more imporatantly, fun.   The combat system is strategic and challenging; combining just the right amount of pacing, real-time action, and strategic positioning. Weapons have depth with special abilities, often making equipping a difficult choice of round-to-round stats vs the benefits of the special attack. Characters have enough room to create any of the iconic traditional roles, or any combination between.   The puzzels are integrated into the terrain and narrative so well that they seem to just melt into the environment, in a very Myst-style fashion. Their locations and solutions are often overlapping with other adjacent (or non-adjacent) areas in that you can recieve clues to puzzels you have yet to encounter and encounter puzzels you have no solutions for; the name of the game is flexibility and patience. The game rarely asks you to be instaneous and in that you should appriciate the same from the game. Not everything is to be solved on the spot.  Overall, a powerful RPG/adventure game that really gets its all right within the system its defined for itself. Often times I find myself questioning whatever game I'm playing could've done better, with GR2, I am only ever amazing about all the things it gets right. Difficult enough to be a challenge but not so much it gets frustrating. Just a really special game.  ",
            "review_score": "1"
        },
        {
            "review_text": "There is an achievement for killing an enemy by throwing pants at it. GOTY",
            "review_score": "1"
        },
        {
            "review_text": "The open world makes this a huge improvement over the first game. surpassed not only the original but every grid-based dungeon crawler I've encountered. My friends would lament the passing of the grid-based dungeon crawls and fondly remember 'Dungeon Master', 'Eye of the Beholder', 'Wizardry', 'The Bards Tale'. Few will review this game and not re-count how amazing those games were to those who remember them. I think this game doesn’t just build upon the classics it surpasses their accomplishments. I",
            "review_score": "1"
        },
        {
            "review_text": "I'll start this review with saying, that I loved the first LOG and once I completed it, I went straight to google and queried 'games like LOG' and 'LOG 2 release date', knowing full well, there wasn’t a chance it was being developed yet, but just hoping it was, as the experience was fantastic. Well I got my wish! At current I have around 14hrs into the 2nd installment and have not been disappointed.   If you are reading these reviews to get an idea of gameplay, I can say the grid based movement system can be odd or awkward at first, if you have never experienced it but you really feel like you’re playing an old school dungeon crawler or a tile based board game and sink right into it after a handful of minutes. Don’t get this confused with turn based or real time pause type games like wasteland 2 or dragon age. This is real time with you being limited in movement to linear paths only. You move as you would with any other game using w a s and d in a linear fashion on an invisible grid. You can rotate within a grid square using q and r or rotate by dragging and pulling your mouse. You are also able to look around with the mouse within your FOV up, down and side to side. You are probably wondering why even utilize this and not just use free roam? The grid based system has a direct influence on combat, as you can only engage an enemy that is in a tile(s) directly in front of you - ranged weapon, firearms or magic can be cast/fired beyond 1 square. You cannot move diagonally. This makes combat difficult and tricky when multiple enemies are engaged with you. Back yourself into a corner and hope you have enough health potions to duke it out before your entire party gets wiped out.   This is a good spot to describe the party system. It’s a four party group stacked 2 x 2. The front two, typically are your tanks, damage dealer type heroes with the back being your spell casters and ranged weapon guys. This is pretty standard but important to understand how that works within the grid system. When facing directly in front of an enemy, the front two take the brunt of the damage while allowing your back row to cast and fire. Let an enemy flank your party and the back row now becomes the focus of the full force of an attack. This can be very troublesome as they typically don’t have the protection or armor the front row has.   Attacking can be confusing for a new player as you don’t actually click on the enemy to attack, like you would in a standard first person hacker. As long as the party is facing the block with an enemy in it, you simply click the item/weapon in your hand to perform the attack (in party box lower right hand corner). To cast a spell you first need to find the scroll, have the required skills/traits to cast it and finally to use, right click the hand and select the correct glyphs to perform the spell. You have to memorize these and perform them every time you cast a spell. There is no hot key for spells. Spells with multiple glyphs need to be drawn, by holding and dragging the mouse across the designated glyphs. This stumped me for a while as I was simply clicking them which are fine for single glyph spells but useless for more complex spells.  The world is full of secret chests and loot so keep an eye out for button like stones on walls. In fact whenever I go through a new area I always look left and right at every wall surface to find hidden wall buttons. Get used to doing this. Getting through the game will be considerably harder if you are not finding the secret items. All secret chests need lock picks to open! You find these in the world so search every last block. This is not like path of exile or another action RPG where they dump items on you. These lock picks are few and far between, in some cases you will have to make a decision which chest you want to open. In these circumstances I simply save it and test each one out for its contents (CONTENTS ARE NOT RANDOM) when you decide which chest has the most useful loot go to it, loot it and save it. Another great aspect of the secret chests is that some are buried around the world, so you may be given a treasure map and tasked with digging up areas looking for it.  So now to my favorite part of this game - the puzzles! This game has the best combination of RPG elements and adventure game puzzles. If you like complicated puzzles that you would often find in classic point and click adventure games, you will love these. They really make you stop and think, all while testing your sanity. They can be downright frustrating for some and near impossible for others, who don’t have the constitution or mental makeup for them. All, however, are very logical when the solution presents itself, from either trial and error, or simply when you fold and look it up online. Solving some of these will make you feel like a genius! And your efforts will be rewarded with a shimmering melody and a rare item or clue.   Without giving away any spoilers I would like to touch on the story and level layouts. Each unique area you access consist of outdoor open environments, coupled with a labyrinth of dungeons beneath. This differs significantly from the original where you were confined to the claustrophobic dark of the tunnels. This offers a nice respite from the stress of dungeon crawling IMHO. Its always a breath of fresh air, literally, when you make it out to the bright summer sun after spending hours, laboring in the rat infested deep. You are able to back track to previous levels in case you want to open a locked chest or forgot to do something important. I cant speak for the entire game, but at least to where i am, 14hrs in, i was able to go as far back to the opening beach. There is a running theme through the levels/areas, in regards to story quest items. You are not simply leveling and grinding for the sake of leveling. You collect story unique items which will most likely be used in some synergistic fashion at the climactic ending. I am no where near this but seeing how the levels have progressed thus far, it would be a logical deduction.   There are many game options at the start of a new game all of which allow you to scale the difficulty. Easy Normal and hard are the difficulty levels. In my opinion Normal can be difficult for new players or if your party is not balanced correctly so choose wisely. You also have the option of disabling the map function which forces you to draw your own maps on grid paper which is lots of fun tbh. It forces you to slow down and take note of things around you, as opposed to running through the dungeon in which case you can become quickly disoriented and lost. You will never really become lost but they are useful when running from an enemy(s) so you can keep your orientation so not to back yourself into a corner which as explained earlier can be game ending. Another option is to allow quick save anywhere in the game (f5). This in my opinion is too easy to spam so I choose the option to save at save crystals which are sparingly spread across the levels. One final option is to only be allowed 1 save per crystal. This is extreme and to be used with caution. You can do a lot before you come across another save crystal so dying before you reach it can be disastrous and for some a game ender all together.  I can't recommend this game any higher. Pick it up and you will have hours upon hours of fun. I am sitting at work writing this review because I can’t wait to get home to play it!",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. It is oldschool rpg in modern graphics. It is quite non-linear and there are lots of mods out there. I recommended this game to anyone who loves good dungeon crawler game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like dungeon crawl type games, this is must play (the first game too).  Great experience, interesting puzzles and exploration, challenging monsters. The only thing I didn't like is the HARD end battle (there is also optional another hard battle, but I'm talking about the one you can't miss). It is much harder than rest of the game, so be prepared.  I'd recommend the game of course. Looking forward to LoG 3!",
            "review_score": "1"
        },
        {
            "review_text": "Gives you a retrogasm. A truly awesome game which does everything right. You gonna have a blast if you are a) an ancient gamer from the 80s/90s or interested in retro gaming because dad has this weird grin when he talks about Lands of Lore. God, how i have missed this kind of RPG. Its like the designers opened a bag of fun filled with a well thought game design, puzzles that actually make you think instead of looking on your mini map where your goal is already marked and a combat system that dares to kill your party if you dont shape up and think how to get rid of a nasty monster. Everyone who loved Eye of the beholder or Dungeon Master should buy this. Support what they created here. This is made for gamers, not for share holders.",
            "review_score": "1"
        },
        {
            "review_text": "This is an expanded, polished, better version of Grimrock, with an overworld map and dungeons, as well as a world editor used by the devs to make the original game. If you enjoy dungeon crawling and / or oldschool RPGs even a little bit, get this one!",
            "review_score": "1"
        },
        {
            "review_text": "It has been a while since i played any game with such enjoyment. Bright example that you don't need $500 million budget to make a great game. It's something like first person view RPG metroidvania. Great level design, it's really interesting and addictive to explore the island. The puzzles are really challenging. For the price - must have game. There are some downsides, like hidden button wall scanning, backtracking to crystals, bogus riddles (rock, paper, scissors, who knew...). But it's nothing compared to game's bright sides.",
            "review_score": "1"
        },
        {
            "review_text": "awesome and huge - much bigger than the first -also great editor and tons of mods. old school rpg fans will surely enjoy it- I really cant think of any better classic single player rpgs in the last decade than both grimrocks ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely brilliant! Finished the game in 24hrs and didn't find all the secrets, extras and loved every minute of it. Takes everything from the first game and improves it all. After finishing I just wanted to start again and keep on playing. Can't remember the last time I wanted to do that with a game.  The gameplay works smoothly and I never encountered any bugs. Some of the puzzles can be pretty hard, but with some out of the box thinking and careful scanning of walls and looking around they can all be solved.  Buy this game, you won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "Really impressive game. Great throwback to the old school RPG games like the Might and Magic/Pools of Radiance type games. I took the easy route on this and used a guide when I got stumped as well as to see both endings. Even with the assistance of a guide AND being on easy, this game was still challenging. Hats off to the gamers who have solved these puzzles without assistance and put the effort into playing on old school/hard. Worth the pickup if you long to find a game worthy of the old school RPG genre.",
            "review_score": "1"
        },
        {
            "review_text": "Finally, a videogame sequel that actually improves upon an already good game rather than just charging gamers for a glitch filled half-thought-out copycat of the last installment!! The puzzles are interesting but not unsolvable, the creature are fun to fight. And the game is challenging enough to keep it entertaining and includes several new added outdoor environments and day/night lighting effects that look great for an Indie Developer. The Grimrock series does it right and revived the old-school dungeon crawl series with more modern finesse and graphics. Don’t expect to have to put hundreds of hours into this one, but in my opinion Legend of Grimrock II is one of the few sequel games on the market right now that delivers what’s promised. Well worth the money compared to most others! Can't wait for number 3!!!",
            "review_score": "1"
        },
        {
            "review_text": "So far, so amazing.  The same systems you loved in the first game, with expanded RPG elements and open environments that make it feel more like a traditional RPG game instead of a niche puzzler. But don't worry, all the puzzles and secret switches are still there to keep you staring at walls for hours.  Some details:  Updated graphics and environments. This game is super pretty. Come out of the dungeon and adventure outdoors in deep forests, shoreline caves, and other beautifully detailed areas.  Weapon and weapon skills redesigned. Weapon skills are now Light, Heavy, Missile, Thrown, and Firearms, so melee characters are less restricted by skill choice. Weapons now have special attacks built into them, which must be activated and use energy.  More flexible character creation, with eight classes and five races. Skills are no longer tied to class, so any class can learn any skills. Racial bonuses redesigned to be less obviously fit for particular classes. Classes and races grant bonuses that can be built upon with skill and trait choices.  Smarter enemies for tougher, more engaging combat. No more easily dancing around enemies, as most enemies have the ability to attack to their side while turning to face you. In general enemies are quicker to attack and more often have special moves.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly polished dungeon crawler that nearly surpasses every aspect of the original with flying colors. The game is gorgeous and it is genuinely fun to explore, fight, and solve puzzles.    Oh God the crabs are back.  They brought back the crabs.  0/10.",
            "review_score": "1"
        },
        {
            "review_text": "Legend of Grimrock 2 serves as a wonderful example of how old-school and new-school can be blended together to create something greater than the sum of its parts. What's even better about this entry to the Grimrock series is that it attempts to out do it's predecessor and succeeds in every way. You should really play this if you haven't already.",
            "review_score": "1"
        },
        {
            "review_text": "Better in every way than the first game and especially in combat, this is a must get for any Dungeon Crawler fan. The only things that lets this game down is when it makes assumptions about party composition (you do need someone good at ranged/magic for one particular puzzle, so all fighter or rogue parties that use melee weapons are not a great idea even though the character creation would let you build them) and the final boss fight, which is not as bad as what the first game provided in this area. This is definitely one of the best dungeon crawlers and I would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "It may sound counter-intuitive and contradictory by its nature, but this is a square-based open world game. Of course it is not “Skyrim”-like open world, but you actually can go wherever you like, do there whatever you want, and you do not need 100% completion to see the end titles. Of course, the game is still square-based, you can’t expect to be able to put basket on someone’s head, actually there are no NPCs at all, it is still a dungeon crawler. And of course completing 100% percent of the game gives you more immersion into the world and story.  What I personally really like is limitations the mechanics make you work around, tactics you should learn and skills you acquire (to never need them again naturally!). What I disliked is the no problem of throwing away an item you’re going to need later without knowing it and without an easy way to find it later.   Role playing system of the game is massively reworked in comparison to the first instalment, so one may need a couple of test runs to decide which party to go with. The world looks astonishing. And yes, secrets in the game are mostly very satisfying, though some can be really difficult to get. That is actually the main reason to play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good. If you ever wanted to play a Wizardry game that was actually balanced well, here it is.",
            "review_score": "1"
        },
        {
            "review_text": "Where do I begin ... This game is pure genius. I haven't finished playing it yet but so far what I have seen is amazing. I find it a bit hard on the normal mode lol. I love the puzzle/riddle aspect of the game. I highly recommend this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Did you play dungeon crawlers on your windows 98 on them sick ♥♥♥ floppy disks?! Guess what ♥♥♥♥♥es! It's got an upgrade.  Serious note: the game is great same as the 1st. The monsters are great and even better with the 2nd. The puzzles are aggravating same as the 1st. (I'm not a smart guy so the later puzzles were a pain). I combat is still the same but then again how can you switch up a tile base game.  All together this game is great. You don't need to play the 1st one to know whats going on because it 2 different stories. (Unless you want your 4 characters to be the most unfortunate people on the planet) the game is solid (so far) I have yet to encounter and bugs, errors, or glitches. If you want your money's worth of entertainment this series will give it to you.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for long winter evenings. Tons of puzzles, nice graphics and without bugs. 10/10 for me",
            "review_score": "1"
        },
        {
            "review_text": "The best dungeon-crawling RPG I've ever played. Top 10 favorite games ever. tenouttaten",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I love it very much. Not everyone will love it, but it's not the sort of game that cares about those folks. It's a reasonably challenging game with some of the most respectable riddles of any RPG I've ever played. The combat is great, definitely more polished over the first game and strikes a nice balance between rewarding strategy, improvisation, and speed. The world is nicely fleshed out with lots of attention to detail. The designs are not extravagent or particularly novel, but they're not meant to be. This is a classic fantasy game in many respects.  But the core of why I love Legend of Grimrock is really how much it respects the intelligence of the player. It expects you to use your brain, and it rewards you for paying attention. It has some flaws with minor mechanics - but nothing that will plague your game experience. As a whole, it's just a satisfying 20 hours.",
            "review_score": "1"
        },
        {
            "review_text": "I do not write reviews BUT Legend of grimrock games are absolutely addicting and deserve it. THERE AREN'T MANY GAMES THAT ONCE I START I CANNOT STOP UNTIL I FINISH IT. This is one of the few. I love exploring and finding secrets. Remember in zelda throwing a bomb and finding a secret? Same feeling. This is just like a 1st person zelda but youre alone. I can't get enough. I will be surely depressed when i finish the 2nd. I hope they're making another one!",
            "review_score": "1"
        },
        {
            "review_text": "Legend of Grimrock was a remake of the old Dungeon Master series of video games, where four of the unluckiest people on whatever fantasy world you care to name slugged it out in a first-person viewpoint through a never-ending dungeon solving puzzles, killing monsters, and reloading saved games a lot. Grimrock is a fantastic revival, updating the format with a new-school look and filling the dungeons with enough monsters to cover every possible phobia that human beings have. Creepy spiders? Got them. Horrible zombie monsters? Got those too. Starving to death in a dungeon because the puzzle for a solution eludes you? That's you. It turns out you are the monster who ate all the cakes and now have no more cakes. Way to go, Chompy McFoodie.  Legend of Grimrock II is largely the same thing, but massively improved and even more difficult than the first game. I get the feeling the developers didn't have a good direction to take the Grimrock series, so they went the BIGGER AND BETTERER route. This is not a bad thing at all - the first Grimrock left me vaguely unsatisfied after I reached the bottom, because I realized all we were doing was running around narrow corridors in a ♥♥♥♥♥♥♥ mountain. Well, Grimrock II is for picky-picky pants who thought along the same lines, because this time you get to GO OUTSIDE AND GET KILLED BY HORRIBLE MONSTERS. Seriously - the game has you start out fighting for your life on the beach with scraps and rocks, and every fight feels like a ♥♥♥♥♥♥♥ do-or-die frantic clawing at each others' throats. The game is able to keep this crazy amount of tension going with each and every new area - fights become intense and terrifying with every new monster because it has this little quirk or trick up its sleeve that it's going to use to ♥♥♥♥ your party over and kill you dead.  It works out a lot of the quirks from the first game's puzzles - mostly. The puzzles are difficult, but not too brain bending - they don't quite reach the Portal sweet spot, but they come close and solving them made me feel like a champion. There's still a couple that require moon logic and sent me towards a walkthrough guide.   The plot is a bunch of accented nothing. The first game's story had a bunch of information on the world, but not a whole bunch as to why the King sent four poor suckers into a mountain cave to find out what the ♥♥♥♥ is going on. The second game doesn't have much more than that. It has lots of beautiful details about the world that the game exists in, but there's not much else to it other than 'Gotta get the ♥♥♥♥ off of this crazy death island full of crazy death monsters, gotta go!'  I can't really say much more about this game other than it's a bigger and better sequel and you don't need to play the first game to understand it. I will say that whenever people talk ♥♥♥♥ about beating hard bosses in Dark Souls or Bloodborne, I'll talk about the time I got jumped by cobras and crazy undead Medusa archers just to get a longsword that I didn't even end up wanting to keep.",
            "review_score": "1"
        },
        {
            "review_text": "Better than LOG in every way. Polished, logical, and extremely tough. A must buy for anyone with an interest in old school crawlers.",
            "review_score": "1"
        },
        {
            "review_text": "Dig up the treasure. Stand on the pressure plate. Throw the rock. Eat the Turtle eggs.",
            "review_score": "1"
        },
        {
            "review_text": "My first playthrough was Hard Insane Ironman, not a boring moment ever. Loved it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent turn based RPG. Played the first which was great but this improves upon it immensely. Lots more items, more monsters, more puzzles.....never got bored for a second. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "More content than Destiny and half the price, 10/10 In all seriousness though, I had no idea this was coming out. I was surprised and excited to see it in the Steam store.The first Grimlock was awesome. So far, this is even better. Best release I've played so far this year.",
            "review_score": "1"
        },
        {
            "review_text": "Almost perfect BUT :  - Why are loadings sooooooo long (+ 10 sec. with a SSD...) ? - After a game over, need a fast-loading possibility (why to bring the player back to the main menu ?) - Create the option to turn off movement animations (like in Lands of Lore from... 1993). More relaxing for the eyes.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good, enjoying the new setting and the open feel of the world with the outdoor textures, the game has crashed once after about an hour, going to try fiddling with the settings until an update clears that up. I will update the review as I play  MODES +  -OLD SCHOOL for the added punishment of having to hand draw your map on paper  -IRON MAN means you can only save at blue crystals  -SINGLE USE CRYSTALS for my fellow masochists  -OLD SCHOOL IRON MAN SINGLE USE CRYSTALS for people who thought Dark Souls was far too easy and wish they could find something with a little more challenge  SURVIVAL +  -Injury mechanic now means you can lose use of an arm, legs, regeneration of health and energy, can be cured with Blue crystals and I imagine there will be a potion i have yet to discover as well  -Food and Potion ingredients can now be farmed with the new farmer and alchemist class allowing for extended gameplay and new playstyles    WORLD +  -The new world is primarily on the island of Grimrock instead of the interior of the mountain in the previous installment. The textures are a little under par for games these days but for 800MB download it's pretty good. within the first hour you'll experience a beach, a crypt and a forest, just to show the diversity of area's on offer so far.  CHARACTERS ++  -Characters have been overhauled and so far i can't complain, more classes and an extra race open up the party formation and can take a lot of thought depending on your play style,  -The new ratling race is more for storage and less combat focused  -Alchemist class grows plants for potions and uses firarms  -Battle mage class is a combination of a mage and a fighter  -Farmer class for food, not much else...  -Fighter class weapon skill focus  -Berserker class health and damage focus  -Knight class health and armour focus  -Rogue class for throwing, dual wielding and bows/crossbows   LEVELLING +  -Stat points are now automatic and depend on your class, I don't mind this as it simplifies the process without taking anything away from the game  -Stats can be improved by having a healthy diet specific to the race of character  -Skills are now all open to every class and have 5 tiers with ability unlocks at certain tiers, for example accuracy skill tier 2 allows for attacking with melee from the back row  EXPLORATION +  -Can feel a little different at first with the new setting but just start wandering and remember to check every wall and every square of the map  -Underwater and you can catch fishy's, though they are our friends, not food (you can eat them)  COMBAT ++  -Melee feels a little slowed down, be it very fractional, less spammy, more impact, makes kiting a little more difficult, still just as fun (might just be my impression as it is very subtle)  -Ranged seems to have been expanded with the addition of guns and bullets as well as what seems like a larger variety of weapons.  -Spell system has been overhauled, you no longer click a combination of the 3x3 spell panel, but draw a line in one motion, I imagine this would be more for touch based devices but it works fine and streamlines the job of casting.  MONSTERS ++ (X2 Pirate bonus)  -Feels balanced for early levels, not to hard to beat, not a cake walk.  -Yet to find a monster being reused from Grimrock 1  -First Boss was quite fun  -Pirate theme, pirate rats  MAP EDITOR  -Yet to try, but can't wait with all the new features in game alone it should be a blast",
            "review_score": "1"
        },
        {
            "review_text": "This series of game is a must play for anyone looking for that old school rpg dungeon crawler experience of yor, but updated with fantastic graphics and subtly dynamic gameplay. This sequel is even more beautiful and expansive than the first. Play it!!",
            "review_score": "1"
        },
        {
            "review_text": "In an industry riddled with companies releasing buggy unfinished games, milking their customers with shallow dlc and indie developers making nostalgia pandering shlock, Legend of Grimrock 2 stands as a shining example of the game done right. Ready out of the gate, working, polished product that knows its strengths and weaknesses, it manages to present an old school dungeon crawling experience made with modern standards and excel at it. For a fair price of 24 dollars you going to get a fulfilling product that provides around 30 hours of gameplay, with free dungeon editor and a bunch of well done community made maps.  Compared to its predecessor Legend of Grimrock 2 is doing well to learn on past mistakes and improves itself in many areas: boss fights are now more varied and interesting, level design isn't as convoluted but still contains many secret areas, leveling and class systems provide more room for experimentation, and the whole open world twist is just a great finishing touch. As with the previous title, each area contains many puzzles and secret areas, so if you're really into treasure hunting you gonna have a good time.  Overall all, I give Legend of Grimrock 2 a heavy recommendation and Almost Human Games deserve some applause for doing so many things right, where others have failed.",
            "review_score": "1"
        },
        {
            "review_text": "Overall it is a nice effort, I wish I could give a neutral score, but in its current form I feel like I do not recommend this, except if you are a diehard fan of the genre. I know there are not much good crawler games nowadays, but... well... meh. Wait for a discount in my opinion. Or even, some roguelikes (or even lites, blasphemy!) might suit you better.    Pros",
            "review_score": "-1"
        },
        {
            "review_text": "more grims, more rocks, and more blueberry pie",
            "review_score": "1"
        },
        {
            "review_text": "It's like the first game but much better and variety.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. You won't be disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: It improves almost everything about the first one in everyway. More enemy variety, more puzzles to solve, and many different levels to explore. The game is much longer than the first with more secrets, puzzles, and epic weapons to find.  There are more classes and races to choose from and the skill system has been improved. It is much simpler for the player to see the effects of each skill point.  Dungeon crawling is satisfying with clever, if not frustrating at times, puzzles along with plenty of combat.   Cons: Unlike the first one, the Grimrock 2 is more non-linear. Progress at times can be hard to gauge because of all the different levels to tackle, as well as some puzzles requiring hints from multiple levels.  Mimics have a tendency to scare the daylights out of you.   In short: If you enjoyed the first one, then you will very much enjoy the second one. Some may find the non-linear nature annoying yet others will in turn love it. You do not need to have played the first one to enjoy the second one, both games have self contained stories.",
            "review_score": "1"
        },
        {
            "review_text": "I really recommend this game. Beautiful grafics, loyal RPG style, challenging puzzles, exciting story and lots of possibilities for your four characters and group. It reminds me kind of Final Fantasy and that classic style of it. In love with this game, I can say. ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent puzzle game, not nearly as linear as the first one. It's tons of fun! Highly recommend playing this.",
            "review_score": "1"
        },
        {
            "review_text": "Very worthy successor to the first one. I put almost 70 hours finishing it on normal and had fun all the way. Highly recommended for fans of dungeon crawlers.",
            "review_score": "1"
        },
        {
            "review_text": "Very good. Much better than the first one and that's saying quite a bit considering how good the first one is.",
            "review_score": "1"
        },
        {
            "review_text": "Simply Excellent! Brings back good old memories of Dungeon Master! It's also better than Legend of Grimrock 1 and features much more varied environments compared to it's predecessor.  ",
            "review_score": "1"
        },
        {
            "review_text": "I loved the original Legend of Grimrock, so as soon as I heard about the second one, I got excited. After a refresh on the gameplay and design of the original, I bought this and gave it a shot.  Over 47 hours later of playing this game, I'm not disappointed. While combat is exploity, and it is hard to truly immerse yourself in a world of blocky movement, the design is gorgeous and exploration is fun.  The customization of characters in the beginning of the game alone showed vast improvement from the original. There are more races to choose from, and more classes than characters allowed. It causes one to really think about how they want their party to look.  Skills as well were improved, giving everyone access to all skills, and reducing the original 50 levels per skill to a simple 5, with check points so you might not even need all five points there.  The puzzles themselves were challenging a lot of the time, to the point where I got frustrated and had to look up answers (I take no shame in looking them up, they were straining). But when it made those difficult puzzles that I solved by myself all the more rewarding.  Highly suggested game, especially if you've already played and liked the original.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down both the best sequel and honestly best ♥♥♥♥ing game to have come out in the last decade.",
            "review_score": "1"
        },
        {
            "review_text": "If you are even remotely an adventuring type, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic dungeon crawler! if you liked LOG1 you will love this one.",
            "review_score": "1"
        },
        {
            "review_text": "In a galaxy far, far away..scratch that... years ago, games required you to be smart or at least to stop and think (I'm talking mid eighties).  There are some recent games out there that challenge that test the grey matter, portal etc. but this title, and it's predecessor, bring that same 'feeling' I had in my early teens dungeon crawling until the early hours.  Grimrock 2 builds on grimrock 1's solid, well executed game in everyway and is a credit to the developers as it's lost non of the previous titles appeal but increased the quality.  Great, simple gameplay with puzzles, suprises and little challenges for you to work out.   Good combat mechanics, sounds, art and the occasional jump scare ..whats not to like!",
            "review_score": "1"
        },
        {
            "review_text": "Really really nice game. Oldschool RPG with riddles all over the place.",
            "review_score": "1"
        },
        {
            "review_text": "I missed out on the dungeon crawlers of old, even though I was playing computer games when they were popular. I heard about legend of Grimrock 1 while watching a youtube play-through of Betrayal at Krondor, which my older sister played when I was young. I really enjoyed Legend of Grimrock, even though I didnt know it was all contained 'inside' of a tower. I had first imagined it being like skyrim, and didn't even know about the grid system. The puzzles were great and I had a very good time playing it.   I have been playing Legend of Grimrock 2 for several hours now and it is truely awesome. It is everything the original was and much much more. GET THIS GAME!!! BUT before you do. realize that this game works on a grid system, and there are no player models!",
            "review_score": "1"
        },
        {
            "review_text": "You like dungeon crawlers? This is the best you can get!  Puzzles are great and the game doesnt hold your hand or think that you are stupid!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent old school dungeon crawler (which doesn't just stay inside the dungeons). Much improved from its predecessor, LoG1. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Best game 10/10. Just play it already. Why are you reading this. Boo. Did i scare you?",
            "review_score": "1"
        },
        {
            "review_text": "People try to take your soul away But i dont her the rat that they all say..  Someone try to tell me i dont belong thats allright im a million strong  You are my party. You are my crowd. This is our island  WE LOVE IT HARD  ITS A CRAZY CRAZY CRAZY CRAZY NIGHT!(Without torches)  ",
            "review_score": "1"
        },
        {
            "review_text": "Everything you can look for in a dungeon crawler &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This game is a master piece 2",
            "review_score": "1"
        },
        {
            "review_text": "After about 8 hours I can say that this game is deifinitely improving on the level of quality set by the predecessor. And that is a huge compliment! I consider the first game as one of the top 10 greatest games I have played in the 2010's for both the athmosphere and the gameplay, and I'm having the same exact feeling right as I'm playing this one!  EDIT: After finishing the game, I was glad to feel like it was a great ride from start to finish!",
            "review_score": "1"
        },
        {
            "review_text": "Great game much better then the first. Must have for Dungeon Crawler fans.",
            "review_score": "1"
        },
        {
            "review_text": "30 hours into it, not even close from the end! I love it!",
            "review_score": "1"
        },
        {
            "review_text": "This game disappointed me. The first LoG is fantastic. The big difference between the two is that while in LoG you almost always could progress to the next level, and the really crazy puzzles were for secret stuff; in LoGII the crazy puzzles are in the way all the time. Progressing in this game required me looking up in the internet all the time. I never once had to look anything up on LoG to finish it. To find all the secrets yeah, but I didn't *have to*. Additionally LoGII gives the impression that you could complete the 'open world' levels in any order but this isn't entirely true. Some have to be completed in order becasue the solution to puzzles are at the end of one section. However, to know this you have to look it up on the internet. I recoomend LoG the first one, but this one, is just a very very crappy sequel. All the effort seems to have gone to making the graphics look good (which my mac can barely handle at the lowest settings), while gameplay didn't improve. If you play it don't use firearms (they're weak) don't use your golden keys willy nilly and get the snake charmer's rope to go down holes.",
            "review_score": "-1"
        },
        {
            "review_text": "So I've got a couple of hours into the game so far, and I wanted to share my thoughts, since I was a bit skeptical at first as well.  Short review:  Pros: - Great outdoor scenery, complete with water that you can wade into, as well as natural terrain that can be walked on. - Underwater swimming with enemies, hidden items, and drowning. - Greatly expanded character customization, tons more possibilites than original game. - Some enemies start to retreat when on low health, and you have to chase them to finish them off. - Enemies prove to be a challenge and take advantage of your mistakes, includes counter-attacks for creating distance and the strafe-n-hit tactic that made the first Grimrock easy. - Many, many new enemies, probably at least triple the amount of last game. - Boss fights! The first one is not too challenging, but then again it is the first boss :3 - Spellcasting improvements; spellcasting can be drawn out instantly or premade like in the first game, and it also shows you what you're casting before you click cast if you've used the spell once before. - Guns! Yeah, seriously, there's guns. Ammo for guns cannot be retrieved, but it comes in larger amounts and does more damage. - Some area transitions involve horizontal movement instead of vertical, staircase movement (although stairs are still present). - The map is connected in a large grid, making it easy to see where certain levels connect.  Neutral: - Limbs can be damaged and unusuable until healing  Cons: - The game is harder to run, I notice a performance drop specifically when saving. Otherwise it's still very playable.  I will update this list as I see more things worth noting :)  More in-depth review:  Before even being an hour into the game, I quickly realized how much further Legend of Grimrock could be taken mechanic-wise. Every single addition to the game that I've seen has not only improved, but expanded on the original core game. Mechanics like swimming, new logic, outdoor enviornments, and full buildings are only a few of the new additions that I've seen in my brief time in Nex.  If you were disappointed with the original combat system with its exploitable strafe-n-hit tactic, then I'm sure you'll be happy to know that most enemies have trained for that. I have a lot of practice with the tactic, and using it in the sequel so far has led to a lot of quick, hard hits from enemies. From quick diagonal strikes from skeletons to jump attacks from imps to evasive rolling from walking trees (treants?), you're going to get smacked before you fully move into the tile to attack.  If you enjoyed the original game, buying this should be an easy choice. It's another incredible adventure with more to come from the workshop.",
            "review_score": "1"
        },
        {
            "review_text": "5/5",
            "review_score": "1"
        },
        {
            "review_text": "If you think that Legend of Grimrock was any good then that's it you don't need to read this review.  New classes,Outside world, New difficulty setup, New firearms weaponry.  The game is richer bigger and better.  At first you will feel like the clostrophobic feeling of the first game is way behind, well don't there's still some caves and castles for you to explore.  After ending the game I had only one wish start the game again with a new team setup. The game is cruel and you will want to bash your head on the wall with enigmas at certain point, but hey honestly if you are in the donjon crawler type of game you want hard enigmas and good figthing, isn't it?  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Grimrock gives you the same feeling as Myst. They both give you a wonderful journey of discovery into a weird but internally consistent world with great puzzles. Overall, it's a wonderful, wonderful experience.  I have my gripes, though. The game is delightfully hard, as in challenging, but also stupidly hard. There are a lot of blind 'I lose' buttons that are going to kill playes the first time, every time. You'll also die a lot because there aren't any hotkeys nor any pause button and you have to click really fast through inventory menus. The game math is opaque, counter-intuitive and unbalanced. Did you know that wizards are worse at being wizards than the hybrid wizard/figther class? Did you know that weapon damage becomes irrelevant to how much damage you deal in the second half of the game? Did you know that firearms are useless? Etc. Etc. Maybe the game can be balanced through patches.  Overall, a really great game with some really big frustrations. Maybe the smart choice is to wait until 2015 or 2016 for it to be patched up.",
            "review_score": "1"
        },
        {
            "review_text": "After failing the first time I took this game on I decided to return to the beach... forty hours laters I can testify that this is one of the best games I've played as an old-timer and Dungeon Master vet (beat it 3x on the Atari 1040ST). The puzzles range from simple to devious and some just plain Hard, yet how can you stop when the chest you want is just a door away, you just need to Open it! Once again great job guys, thanks for the good times (3am fist-pumps are a dead giveaway) and I look forward to the next effort in the series.",
            "review_score": "1"
        },
        {
            "review_text": "LoG2, what more to say:)",
            "review_score": "1"
        },
        {
            "review_text": "The 'modern execution' of this 'oldschool' game modernizes all the wrong things. The combat is real-time but movement is still grid-locked  and  the perspective still first-person, so you  will  be wasting precious seconds spinning in place to get turned the right way while your enemies get free hits in; ruining any sense of 'action' or 'realism' that real-time combat should normally create.  It's the spell interface that really ruins the experience, though. Picking out the correct order of nondescript runes that cast a spell might be (at best) a  cute  mechanic in a better game than this one, but when you're forced to do it in the middle of (already kludgey) real-time combat for every spell you will ever cast, it feels much more like you're fighting the game than the actual monsters.  It's a horrible mix of combat elements on par with the likes of Final Fantasy XIII. Except  that  game was at least playable.",
            "review_score": "-1"
        },
        {
            "review_text": "All the grid based combat of the original, but also outdoors. So far it is rather amazing. The game does a better job at storytelling through experiencing the world around you.  The map is connected (also on your map) and feels a lot bigger. New race options are not that special, but overall this is a real good improvement over part 1. :)",
            "review_score": "1"
        },
        {
            "review_text": "Only in for an hour and already fell in love with this gem... This is what games should be like... challenging but fair. THIS is the game that should remind us all where our modern games come from",
            "review_score": "1"
        },
        {
            "review_text": "Grimrock 2 is a thrilling adventure, it will test your ability to adapt, traverse and decipher its land as you try to win back the freedom which was taken from you.",
            "review_score": "1"
        },
        {
            "review_text": "I have played the game for about 6 hours and I am not convinced that it is as good as many people claim it is.   I find the control scheme very annoying (needing SIX keys to walk around, and needing to right-click on weapons to use them, let alone using magic which requires numerous clicks -- and all of that in real-time). The enemies are kind-of underwhelming, just standing in front of you and hitting you -- unless you ran into enemies that are far too high-level for you, which can easily happen. There are some pretty annoying puzzles (invisible switches, items that are hidden without the game giving any indication of where you have to look, be-fast-and-move-to-the-correct-spot-or-you-die challenges, and puzzles whjch basically require you to die multiple times before you can actually get a glimpse of what you need to do to solve them). The character upgrades are too rare, and it is too easy to make a mistake in constructing your characters (I made an alchemist who uses firearms, but now I find that firearms and ammo for them are very hard to come by, while I have found fantastic bows with reusable arrows that I cannot use). Fortunately, enemies that are defeated do not return, so that's a plus. But overall, I find the fun factor not so high that I am keen to continue.  What REALLY hurts the game is the complete lack of any story. Why are you doing the things that you do? Why do you walk around here? Why not just stay on the beach, build a big fire, and kill turtles for dinner until you are rescued? I don't feel that 'exploring for the sake of exploring' is very rewarding. Ultimately, the whole story seems to come down to something like: walk around until you have collected 20 power gems, and then you can unlock the final door. Hooray!  I played the first Grimrock for a while, and that game feels much better. There is an actual incentive for you to delve into the dungeon, and the atmosphere is suffocatingly claustrophobic. While in Grimrock II you are just walking through woods without rhyme or reason. The atmosphere of this game is just off.  All in all, I am on the fence as far as Grimrock II is concerned. It is not that it is a bad game, it is just not as good as the first one, and I rather play something else than more Grimrock II. So I have to rate it down, partly in compensation for all the up-ratings.",
            "review_score": "-1"
        },
        {
            "review_text": "I really do not enjoy this game, even if I'm tryng to...while LoG is simple and pretty straight-forward, LoG2 on the other hand feels quite chaotic, dispersive and due to the nature of the game (that keep you searching and looking for small details in every corner or wall) gets really dull and boring after you reach the middle of the game, given the amount of mini-puzzles you want to clear, chest you want to open and area you want to visit. Plus, the default party tends to suck hard even in normal mode and it's REALLY annoying to start a new game.",
            "review_score": "-1"
        },
        {
            "review_text": "What to say... The basic of a good game is to guide the start. If a game does not ease me into it, I don t play and I don't like it. I liked the first one very much but I m not recommending this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Just can't get into this kind of combat, make sure you understand the mechanics before you buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Starts off strong but gets very boring very fast.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah I should have read more of the negative reviews of this game before buying it; I got caught up on all the positive reviews. Some one described it as, 'the scope of Skyrim', massive, etc.. So I wasted most of a Saturday on the game. This game is a dungeon crawl through and through. No story, no npcs- just kill stuff, solve a tedious puzzle, and repeat. I wanted to like this game; don't mind the old Might and Magic engine- but why not add even a simple story, some villages, and a couple NPCs? Not enough money, or imagination- something. Could have been a good game, right now a bad way to waste time in a bland empty world..",
            "review_score": "-1"
        },
        {
            "review_text": "I borrowed this game from one of my steam friends because he recommended it. Well, here goes my review.  Movement: I'm not gonna lie. I hate grid systems. The movement feels very restrictive and it just kinda seems like it lurches forward rather than walking forward.   Combat: If I wanted to die horribly in the starting areas of the game, I'd play Dark Souls. Seriously, the fisrt enemies you fight are giant snapping turtles and they nearly killed me, and it only got worse as i went along in the game when I started fighting enemies that were able to attack far quicker than I. Lose half a character's health in the time it takes for him to swing? Classy. Oh, and you can break limbs too. So if a tough enemy breaks your arms (meaning you cant use your weapons) you have to back off and pray that you can use a healing potion to undo the damage only for the monster to break your arms again. Would be fine for hardmode, but I was on easyfor my first run. That apparently donesn't mean much.  Environment: Ok, i have to throw my hands up here the game looks pretty nice. I had to kill the graphics to make it run properly though, as my computer its up to par but thats on me.   Story: It sucks. Four dudes trapped on an island for seemingly no reason. I'm sure it gets better than that but I didn't play far enough to find out. Frankly, I don't care anyway.  Puzzles: 'X marks the spot.' That is the dumbest hint I have ever seen. This was the first major puzzle of the game and I had to look this one up. I thought that meant I had to find an x. Nope. This was one of thos epuzzles that not only made me feel like an idiot, but it's solution was kinda stupid.  Overall, this sort of game just doesn't appeal to me. I can see why some people might like it, but i can't recommend this game in all good honesty.",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely not game for everyone. Enemies are merciless right from the start and you will die many times in this game. Mostly you will have to experience everything through trial and error in order to get anywhere. Enemies have healthpool atleast 2 times bigger than you're characters have and while you are trying to fight them with weak weapons and spells they can take 1/4 health away with 1 attack. If you haven't played the first game of the series and you aren't familiar with dungeon crawlers i recommend you won't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "How is this a 2014 game? This is worse than anything from the early 90's. Graphics are choppy and rough. Character control is stupid, inefficient and horrible. Combat system sucks. I don't understand all the glowing reviews for this game. I bought into the hype, really wish I hadn't. Even the videos and in-game shots are no where near an accurate portrayal of just how crap this game is.  0/10 DO NOT WASTE YOUR MONEY ON THIS CRAP.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, I typically love RPGs having played the heck out of Oblivion, Skyrim, etc. so I was intrigued by Grimrock 2. Apparently there's no roleplaying except for equipping the four characters you command to deal with various baddies - it's just a long dungeon crawl. Now, for 20 bucks this wouldn't be a bad thing except for your movement, which is one square at a time controlled by your kb. Moving the mouse only changes your POV. If you don't have extremely nimble fingers this game is an effort in futility, especially during boss fights since movement is so restricted. It can also be hard on the normal difficulty. Your characters recharge and level up slowly, there's not much armor to speak of so I always felt at a disadvantage. Puzzles can be frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want a game that takes you on an adventure of a lifetime, this one is the way to go, this game is full of puzzles that are sure to make you have to think, albeit, some of them have to make you think 'too' much, it still doesn't detract from the game overall.",
            "review_score": "1"
        },
        {
            "review_text": "This. Is. Great.   Legend of Grimrock 2 combines the wonderful dungeon crawler from the first game, (wich I also highly recomend) but successfully adds levels outside with there own deep feel and wonder to them. The look of the game cant be more beautifully crafted than it is right now. The gameplay is unlike anyother, you have a party of up to four in an RPG elament and must travel through an island riddled with all kinds of creatures...  +Very good sound and visual +Still the same Grimrock gameplay +More of everything!   -Framerate dips a bit when loading/saving and above on land.   10/10 Patiently waiting for sequel",
            "review_score": "1"
        },
        {
            "review_text": "One of the most amazing games of the year. I'm not even that far, the game personally spooks me, but it's simply stunning. The Gameplay, the graphics, the collecting and exploration and overall sense of dread just keeps you going. You could turn a corner and get stuck by spiders, or collect a cool looking gun and get teleported to a dungeon surrounded by undead. The game has tons of hidden secrets too.   It's simply amazing. If you're ok with jump scares, this is good. And these are actually pretty spoopy. Dark hallways,spooly sounds...  It can get pretty spoopy!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much better then the first one. Almost played it straight through without taking a break.",
            "review_score": "1"
        },
        {
            "review_text": "In short: Really great game. If you liked LoG1 (and other games like Dungeon Master) you'll also love this one.  Pro + Improved and more variable monster behavior than LoG1, e.g. frogs which can leap behind you, some will move sideways etc. + Great Puzzles! Be prepared to read notes, combine those hint with the riddles of statues, map fragments and/or environment sounds. + No bugs or similar problem for me. + Nice maps, with different environment styles  +/- Spell and combat can be very stressful :)  Cons - Characterdevelopment is somehow not transparent (for me at least). Some skills are very powerful, some are useless. At least from my perspective. - I'd love to have slighty more items in game available. I really don't like it, when you have only 3 different weapons per character the whole game.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS BRILLIANT! It is the original Grimrock BUT improved upon nearly EVERYTHING!   The world is now broken up into segments of overworld and dungeon segments and a huge map to explore. A little critice i have with the overworld is that there whereas some areas and things where out of place and broke the otherwise flawless emersion, such as the desert. But these areas are few and very far apart. And otherwise the different areas blend seamlessly.  They improved upon all of the enemy designs to make combat waaay more interesting. and the combat areas have become intense. They provide a good space to battle in and at the same time restrain you. The new leverage and water tiles are really cool and added a vast amount of new possibilities with map design. The new classes and the rat and lizard people where great additions.  The puzzles are as expected well made with a few exceptions here and there but that is to be expected of a puzzle game. And the secrets are a blast to discover. and the addition of pirate treasures and chests where neat!  this game is a must for anyone who wants more of the first Grimrock or want a puzzle game with intense moments and an emersive world this game is for you.   It took me around 42 hours to complete this game so if you are short on time this game is maybe not the best buy thou. There is also a level editor for the workshop, sadly i find the workshop to be slightly lacking.",
            "review_score": "1"
        },
        {
            "review_text": "This was the first dungeon crawler I played with such a style of gameplay, and I must say, I'm hooked. It's clunky and awkward to handle at first, but after some time it'll feel like a good book - You'll have a hard time putting it down. Secrets, clever riddles, intense battles and traps abound - This game's a paragon of the genre, and you'd be doing yourself a disservice to pass it by, whether or not you've played this sort of game before.  Here's hoping the developers add some quality DLC.",
            "review_score": "1"
        },
        {
            "review_text": "I can't get enough of this game, and it blows me away that it's not a full-blown $50 title. When was the last time you played a game that weaved quick combat and puzzle-solving together in a way that didn't break it up into separate pieces? Where you had to -think- to solve a mystery or open a door, rather than inserting the blue key into the blue keyhole? Where you've had a genuine 'ah ha!' moment that lead to a trove of interesting secrets, literally scattered throughout the game? Satisfying titles like that are just too few and far between.  The core of the game revolves around four prisoners trapped on an island following the destruction of their ship. As they begin to explore, they soon come to realize being brought to this monster-ridden island was far from an accident. True to the pen-and-paper nature from dungeon-crawlers of yesteryear, the entire game takes place on a tiled grid, and each step you make moves you from tile to tile as you venture across the island. You can develop and refine your characters to become hardened warriors, gun-wielding rogues, spell-casting wizards, and a number of other fantasy classes (and, by the way, you can import custom character portraits and have your party members be just about anyone you can think of). The combat in the game takes place over this grid that your characters are confined to, and becomes surprisingly diverse once you start to build up spells and abilities. The real core of the game, however, lies in its secrets and its puzzles. There are hundreds of them, over a stunning and surprisingly diverse map. I just can't get enough of it. Folks who really enjoyed that aspect in Morrowind and Skyrim would adore that about this game.  If I had to be critical, there's not really much of a story, and for the most part no voice acting whatsoever. I suppose some people might find the grid-pattern of movement annoying, but I found it very helpful with combat. Most of the flaws are completely ignorable for me, with the exception of one or two puzzles being -incredibly- hard. Then again, solving them was also tremendously satisfying.  I think most everyone (sans players who're Call of Duty addicts and multiplayer-only gamers) will find something to enjoy here. I'd recommend it even at full price --which I personally think is a steal.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed the old Dungeon Master games you'll probably love Legend of Grimrock 2. This stand alone sequel has abunch of improvements over the first one. A real gem!  (If your new to this type of game remember movement is the key to survival in battle.)",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! So far even better than the first one, really enjoying it.  Worth every cent.",
            "review_score": "1"
        },
        {
            "review_text": "You liked the first one? The second opus is far better than the first one, and I did enjoy the first very much! I think if they keep on upgrading their work like that they can do a third one, after that new ideas of game must have to come up I guess. Great Job Finland!",
            "review_score": "1"
        },
        {
            "review_text": "This is a much more open and polished version of the first game. The environments are more interesting, the A.I. is much better and more varied, there is a new race and new classes. If you liked the first one then you will love the second one. If you didn't play the first one, don't worry about the story as it is not relevant to the second one.",
            "review_score": "1"
        },
        {
            "review_text": "If you want a way to beat the game on hard with out too much stress. It seems that they built the farmer into the game for this purpose because there is so much synergy to this strategy. I went with a Lizard Knight, Lizard Rogue, Lizard Alchemist. Human Farmer with skilled tech and fast learner. I put the 1 point into alchemy on the farmer (yes not the alchemist, the farmer). The rogue/alchemist took light weapons/accuracy and put their first point into Accuracy 2 for reach. Then straight light weapons until max, then crit until max. The alchemist is really just a rogue who sacrifices his rogue abilities for the herb spawning tech. All 3 lizards take poison immunity, the knight takes fast metabolism, and the others take endure the elements. This means the only damage that can hit the rogue/elem (usually magic [always?] through the front row has to deal with 50+ resist all, and straight immune to poison). Now that all that's out of the way, I let the farmer contribute in the early game with the sling and rocks but by the time I got the first boss I just keep him dead. The farmer is dead 99.99% of the time. This lets me stack all my best armour on the knight, convert all the herbs to health pots (at crystals when I res the farmer he makes pots and gets to partake in 1 sometimes 2 fights until he's dead again). The knight takes armor/athletics and lastly dodge techs. Since only the knight tanks when slots are broken you don't have to worry about multiple characters having slots broken, so it's less use of potions. Also with fast metabolism pots are 2x effective. (Also 3 living party members consume less food, not that it's going to matter.) Now for the poison immunity, when you get to the herder poison mushroom spawner fight, you will be around level 5-6, don't kill all the spawners, I left one alive (the back one where the orb is) and I backed my party on the tile where the bag is picked up. 3 poison immune lizards are 100% immune to the little sapling type mob, and the mushroom head guys that spam poison, those mobs cannot do a single point of dmg ever, except the 3rd mob is a mushroom type melee mob. Luckily for you, you've been paying attention and have a beefed up knight with all your best armour pieces so far. With some finesse and running around you can kill this room indefinitely, as you get higher level you will be able to hold that one tile (where the bag is) without ever moving. These mushrooms drop food (not 100%, but regularly). You will amasse this beautiful stack of mushrooms on the tile right in front of you. When you are convinced you're high enough level. Finish the encounter and go outside to the crystal (not too far) and res your farmer, take him back and have him eat all the food (don't try to carry the food, let it sit on the ground).  With a human farmer and fast learner tech, I was able to get him to level 17 when the rest of the party just got 11. Thats with leaving plenty of food for everyone to spare.   An alternative to this strategy, would be to make the farmer a lizard as well with poison immunity. There is a healing crystal that acts like a real crystal (1-time-use) that drops right in that room. You can wait until you have enough food on the ground and the place under well enough control to res the farmer, eat all the food, level him, and put him in the front line. If you don't have poison immunity and res the human he'll die immediately. If he's in front he'll be subject to the melee dmg in there too, if you intend to keep him alive the rest of the way, he'll need to be up front and tanking. For this reason you should consider giving the farmer things like Athletics/Armor/Conc[3](shielding)/Alchemy etc. I wouldn't worry about the farmer as a damage dealer, it won't be worth the extra mouse effort to click his weapon when you're dealing with the 4 rogue attacks which do more than enough dmg.   Also if you don't want to spend that much time there leveling, just get the farmer to 5 for max alchemy at this stage, and leave him dead through the whole game, doing pots at crystals.   If you want to use a non poison strategy. I recommend a knight/battlemage/rogue/alchemist I would probably make the alchemist a human with 'skilled' tech for lightweapons/accuracy/alchemy so I don't have to sacrifice points in dmg early. Obviously rogue/alch get accuracy 2 first then no more accuracy ever, you know the drill. Once light weapons is maxed you could put the alchemists points in alchemy instead of crit. I recommend rushing Con 3 for shielding on your page. The 25 Prot on the buff will be an absolute must keep active ability.   Good luck.",
            "review_score": "1"
        },
        {
            "review_text": "I love love LOVE this game! It's beautiful and is the only game that feels like a real dungeon crawl. I was a huge fan of the origional and this is a great improvement. Thank you! Five stars!",
            "review_score": "1"
        },
        {
            "review_text": "I am completely taken in by this game. I don't think I've played a puzzler like this since ocarina of time. I'm running Insectoid Barbarian and insectoid Battlemage upfront both +15 protection. Human Rogue in back with exp boost and ratling Alchemist. Alchemist can pump out potions and bombs when tough fights are imminent. I make my first two orbs and put them in their spot. And then...I am completely lost.    I go to the cemetery and it says the directions are in the archives. I go to the archives and find a note that says to 'follow the light' and I have a door slammed in my face by a guy that looks like death. I go outside and talk to a face and it says to go where the sunrises to meet someone other than the death guy. I go in that direction and I'm back in the cemetery &gt; &lt;. I am out of puzzles to solve except this multizone trial and error dealy.   Ahhh. I have to shoot the temple door with my serpent staff which my battlemage has currently equiped, says the walkthrough. Never would have thought of that. Reminds me of blowing a hole in a wall in dungeon 6 of Link's Awakening except even more vague.    One thing that could make this game better is a journal that stores notes from signs read. Aside from that 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game!! Authors - in LoG 3 please add 'empty walls'. Do you remember it from old school RPGs? :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Brilliant in fact,-hours and hours of gameplay but the puzzles....they get to be too much. Don´t want to use guides all the time so this is a great game IF you have a lot of time to spare to figrue them out. I´m about 2 thirds through may finish one day..",
            "review_score": "1"
        },
        {
            "review_text": "Compelling old school grid based RPG dungeon crawler that wont lead you by the hand. Fantastic fun, If you like that sort of thing.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed it so much, recommend playing it on hardest difficulty with map grid, without google help ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much more amazing than the first one, which is incredible considering how good the first one was to begin with.",
            "review_score": "1"
        },
        {
            "review_text": "Im trying my best to imagine a world that works like Grimrock 2.  You're in the dark and you're fumbling for your keys. you finally get them out of your pocket as you squint looking for the keyhole. Bringing up the key, you try your best to find the hole. you cant quite make it out as your eyes strain in the darkness, so trying your best you kinda just feel for the lock. The tip of the key bumps into the side of the door missing the hole at wich point you Wind Up Your Best Baseball Pitch and Chuck That Set Of Keys As Hard As You Freaking Can At That Bloody Door, UNLOCK U DOOR, I KNOW HOW TO KEYS JUST DO UR JOB!  Also, tasty tasty wall pie. it fills you up right.  I'd like to see this world.",
            "review_score": "1"
        },
        {
            "review_text": "Almost as good as the original. More old school fun and more puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "RPG of the year by far. Better than Eye of the Beholder and that's saying a lot!",
            "review_score": "1"
        },
        {
            "review_text": "Supa good epic mystery secret roleplaying adventure game",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "Both thumbs up for this amazing sequel -- well worth the money.  Featuring what most contemporary RPGs lack, an actual bond with your team, LoG 2 is in every way bigger, better and more badass than its predecessor. The addition of surface crawling is cool, but don't get fooled by it -- after some hours you'll be exploring dungeons deeper and deadlier than anything you saw in LoG 1. Graphics are nice, no bugs so far. You know you want it! :)",
            "review_score": "1"
        },
        {
            "review_text": "Hours of Fun solving puzzles while fighting your way through mazes and monsters Definitely worth your money",
            "review_score": "1"
        },
        {
            "review_text": "This is the best RPG strategy game I have ever played. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love the game!!!  this game in particular, it is a great modern take on a classic gameplay.  You move U D L R with W A S D and you rotate with Q, E (default) and all you have to do is just click whatever you see on the screen that needs interacting \\ killing.  Only bad thing i can say about this game is, the way you have to fight\\control your characters. you're primarily looking at the bottom right corner of your screen, doesn't do justice to the beautiful creatures they've made in both games.  Its single player, high replayability since loads of people make their own dungeon runs as well.  tons of puzzles, some \\ almost half of them i wouldn't have figured out on my own without help. so its a good mind game as well. as long as you're not being chased by death while trying to figure out a puzzle.  bad thing is, if you like being a thorough, achievement hunter. then like the first game. NO MATTER WHAT YOU HAVE TO CHECK ALL THE WALLS. EVERY SINGLE WALL EVERYWHERE!?! oh and you can dig the earth now with a shovel. SO YOU HAVE TO CHECK EVERY SINGLE LAND TILE TOO!?! AHAHAHHAHA!?! i don't think i would've had the patience, and the insight to figure out some of the puzzles, secrets etc without having help. especially the super duper secret ones.  I do not recommend it if you have not seen at least a gameplay video or two, so you'll see the old school play style this game is.",
            "review_score": "1"
        },
        {
            "review_text": "WOW! Such an awesome game! This is an excellent sequel. I loved the first Legend of Grimrock, and I was expecting much of the same, but this game was so much more. The world is so big. Every door you go through gives you twice as much space to explore as you expected. Every time you thing you've found everything, another world opens up. The puzzles are great and so clever. This reminded me of playing MYST with all the puzzles and exploration. I highly recommend for people who like puzzle and adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "This game a is a real joy. I haven't played every dungeon crawler under the sun but I've played a few and this one is as good as they come.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It takes everything that made the first one good (old school dungeon RPG, (subjectively) fun combat, immersive world, great graphics) and just added more to it. LoG2 has outdoors environments that still work with the gridbased movement, more verticality and just overall more immersive and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Refreshed the original formula, added new things and improved pretty much everything. A masterpiece for every RPG Fan.",
            "review_score": "1"
        },
        {
            "review_text": "this is a gmea good",
            "review_score": "1"
        },
        {
            "review_text": "I have yet to play Legen of Grimlock (1). To be honest, when I first started LoG2, after about 15 minutes, I nearly uninstalled it. The ONLY reason for this was the controls. I haven't played a grad based game in, well, a very very long time. This took me back to the 'Lands of Lore' days, and even then the controls were not grid based.  BUT.. I decided to press on, and I am happy I did. I love this game. I love how the world is not overrun with creatures, but yet they are there. I love how when you encounter a puzzle you can really take your time to solve it, and you're not worrying about being bombarded by beast, or time restrictions. Sure, a few of them require 'quick thinking' and 'movements' but for the most part, you really gotta sit back and take your time to work it out.  I have to mention drops here too. I have a really hard time deciding what to hold on to... what to discard...Obviously, a pair of tattered gloves can be left behind, but a 'serpent staff', for instance. If all my current weapons are better...... but why do I have this feeling I should be lugging it along? ;-)  So, if you've never played a grid based game before, it might take you a bit of getting used to... but once you do, you'll be happy you stuck with it.  I am really, really, hoping the devs have plans for a LoG3. :-)",
            "review_score": "1"
        },
        {
            "review_text": "Come to the Island of Nex, and bring a friend! Due to it's focus on brain over skills, Legend of Grimrock 2 is a hidden gem of cooperative gameplay. A keen eye and a good idea is all it takes to help each other out - as well as keeping an eye on the party's well-being in combat.  Did I mention gorgeous graphics? Puzzles that actually deserve the name? An open world, in which you can choose what dungeon to tackle next?  All in all: Great fun, highly recommended!  (Regarding my 5 minutes playtime: My wife and I played the game on her account via family sharing.)",
            "review_score": "1"
        },
        {
            "review_text": "It's quite good, I thought I would relive Dungeon Master but it's far beyond that. It looks great.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant old school dungeon RPG with modern polish. I want more.",
            "review_score": "1"
        },
        {
            "review_text": "Getting lost in this huge and varied world is so great. Even in the age of Witcher 3, this game shows that grid-based movement can still be fun. I have a hard time explaining why but here are some possible factors: - Enemies feel more menacing because you can't circle-strafe them, play with aggro range or exploit pathfinding bugs against them like in most free movement rpgs/fpss. So the dungeon feels more claustrophobic and menacing... I definitely don't feel that in Skyrim dungeons. - Mapping out the dungeon square by square and paying close attention to your environment for secret buttons and switches feels great, and it's not the typical modern RPG experience. A free movement game can hardly hide a button somewhere on a wall and expect you to find it, here with the constrained views it works. - The grid system allows for some very smart puzzles, I have to admit I sometimes give up and consult a walkthrough, but I enjoy their presence nonetheless!  And you get to control (read: juggle) 4 characters, so four times the RPG goodness!  All in all, you'll like it if you liked old-school RPGs like Dungeon Master, Eye of the Beholder and Lands of Lore: Throne of Chaos. But if you haven't played those games you should try it anyways! You might very well find that grid-based movement is a bit like pixel art: originally born of technical limitations, it can still bring a unique and interesting twist to a game.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure why this gets very positive reviews. After trying to move around the beach for 20 minutes after the opening requence I wanted to kill myself. This is basically a clunky dungeon crawler graphically disguised. I'm sorry I spent $5 on it. Should have gone out and bought a latte instead.  10/10 would uninstall again.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME GIVES ME HOPE FOR THE NEW WORLD",
            "review_score": "1"
        },
        {
            "review_text": "I can play a party entirely composed of rat-men.  My life is complete.  ",
            "review_score": "1"
        },
        {
            "review_text": "An absolute fantastic game: 1- A whole island to explore, with many dungeons beneath it as well as open spaces! 2- More enemy attack patterns, more weapons, more skills, more classes and races for your PCs... 3- A 30+ hours campaign, with MOD support since day 1. GREAT developers.  If you enjoyed Legend of Grimrock 1, this sequel is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "A very good RPG, kind of in the same vein as Wizardry 8 but not as amazing as that game. You might also say it's like if Might and Magic X was good. The exploration is by far Grimrock 2's strongest point, with a sprawling open-ended world to explore and tons of secrets to find. It can be tense too, as you come to expect horrible things to happen when picking up items, etc. Multiple times I got jumpscared by unexpected enemies. The graphics are even pretty great, especially for an indie studio. Character building and progression isn't bad, though there's some useless skills and it starts to not matter what you level towards the end. Music is great on the menu and in boss battles, but nonexistent otherwise. It works for Myst and Demon's Souls, but I would've preferred some more traditional music to the ambience in this case.  The one thing that really threatens to spoil it is the combat system, which is carried over from the previous game where it also was a problem. Positioning determines roughly 90% of your success, or should I say, whether or not you can find four open squares to move around on. People cheesed enemies in Grimrock 1 with squaredancing, and instead of revamping it, the developers just made skillful squaredancing 100% necessary to have any success in combat. There are more nuances in enemy movement to make it interesting, but if you ever get cornered at the end of a hallway, even the god damn mosquitoes will tear your party apart. I don't care if it's old school, It's fundamentally broken, and anyone who stuck up for it after the first game is wrong. It also sucks that you have to click small icons and make complex actions with the mouse while doing all this movement, when even the 90s RPGs allowed you to attack with hotkeys for your characters. However, combat isn't the majority of the game, and in MOST cases it's manageable without much frustration. It's only when they throw enemies at you in cramped hallways that it stops working well. There were a lot of times where I got gameovers and then easily overcame them the next time because now I knew where I could safely fight.  Anyway, whatever, good game overall.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must try for any lovers of dungoun crawlers out there!!!!! A freaking big fat must!!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you thought Dark Souls was too hard, and you couldn't complete, than good luck with this game, as it kicks anyone's ♥♥♥ on their first playthrough, at least, if you didn't look up anything.  Just look at the trailer to know what it's like, what you see, is what you get really.  I love it though.",
            "review_score": "1"
        },
        {
            "review_text": "This game definitely isn't for everyone, but I liked it.",
            "review_score": "1"
        },
        {
            "review_text": "This is reminiscent of the old mid 90's games that were adaptions of board games. If you wanted a game like Hero Quest on PC, then here it is. And if that's what you expected, that would be great. This was however not what I expected at all. I thought it would be more like Two Worlds or any of the Elder Scrolls series, and it certainly is not. I played up until what I guess was the first boss, and I think that's enough for me. On the plus side, it's got decent graphics for a mid 90's game.",
            "review_score": "-1"
        },
        {
            "review_text": "the puzzles r so awesome that I lost my hair now I look better without hair and there is a new life ahead of me! I am looking forward for Legend of grimrock 3 to lose my body hair. epilation costs much! ",
            "review_score": "1"
        },
        {
            "review_text": "Improves upon the excellent Grimrock in every way.",
            "review_score": "1"
        },
        {
            "review_text": "Another gem from Almost Human Games. Oldschool gameplay at its best.",
            "review_score": "1"
        },
        {
            "review_text": "very good sequel",
            "review_score": "1"
        },
        {
            "review_text": "LoG1 was awesome, LoG2 is just as awesome. Thanks for the great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my life. Love you, Almost Human Games.",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game, got all the achievements, and spent over 80 hours on this gem.  Here's to hoping that future releases will have shops (like the good ol' Dungeon Master II), randomly generated contents (similar to Grimrock Unlimited), better spell selections (no more rushing Fire 5 / Air 3 for meteor storm on all mage characters), and character biographies while creating custom ones.  I still occasionally come back to this game for some quick action and satiate the need to create custom characters.",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a first impressions review, and NOT a full review, if you want a full review, then please read better reviews then mine",
            "review_score": "1"
        },
        {
            "review_text": "Well then, finaly finished the game. It was fun trip with alot of puzzles to solve and battles to figure out how can a persone actualy win in. In a way was my first experience in such kind of games and I am realy happy I got this from a bundle, as I dont know if I would have bought it in the first place. But after playing for just few hours I fell in love in thi game and would absolutely recomend it to anyone. Hope that this review helps someone decide to buy this game, and not to give upp on first monster you encounter, or a puzzle, but finish it to the epic end :P",
            "review_score": "1"
        }
    ]
}