{
    "app_id": 251830,
    "name": "Stick it to The Man!",
    "release_date": "2013-12-13",
    "developer": [
        "Zoink Games"
    ],
    "publisher": [
        "Ripstone"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 16,
    "positive_ratings": 546,
    "negative_ratings": 27,
    "price": 5.99,
    "description": "Hard hat tester, Ray, has a bizarre accident and wakes up with a giant pink spaghetti arm sticking out of his brain! With his awesome new powers he can read minds and change the world with stickers but he’s on the run for a crime he didn’t commit. Can you help Ray out of this sticky situation?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251830/header.jpg?t=1506940366",
    "minimum_requirements": "OS: Windows XP or higher Processor: Dual-Core 1.6 GHz Memory: 2 GB RAM Graphics: AMD Radeon 6310 / ATI Radeon HD 4650 or better DirectX: Version 9.0 Storage: 2 GB available space Sound Card: sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is an absolute delight! It's pretty much a must buy, especially at this price. It's about a 4-5 hour game that will continuously make you smile. Where some of the frustration coming from the gameplay is mediated immediately by the hilarious characters and overall lighthearted feel of the game. It's like playing a comedy act, in a sense. It has an amazing artstyle, unique and very pretty. 'So much art... such beauty' to paraphrase a certain seagull. The printscreens really doesn't do the game justice.  The gameplay consists of a mixture between platforming, point and click and stealth. It's fine, nothing incredible, but it does it's job. It isn't too hard to progress. It does suffer from having the game be in the way of everything else, where you just want to get past these annoying stealth sessions to get to the good/fun part. The writing and voice acting shined a lot brighter than the gameplay did. This made the mood go down a bit when if you're a complete ♥♥♥♥-up you will be stuck at a few points for a while, but as said before, the game will make it up to you with it's intelligent writing, more or less hilarious humor, artstyle, new and intriguing situations.   Buy this game, now, please. Go do it. It's the most I've laughed in a game since Psychonauts and it's really something everyone should play. It's a game with personality, a personality you will like, and that's sort of rare. Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "  Stick It To The Man   is a colourful platform/puzzle game where you use stickers on objects to progress in the game. The art style is cartoony with cardboard figures and looks special in a positive way.    Story   U play as Ray, an average guy that one day gets a mysterious tentacle on his head that grants him the ability to read minds, and so a crazy journey begins to find out why this happened to him.    My thoughts about the game   I had a great time with this game reading peoples minds, and often there was funny dialogue among the different characters u meet in game. I liked the art and colours in this game, and that the objects u pick up is different stickers for different purposes. The game is sometimes challenging with platform sections, that could be frustrating to some people (including me), but its not a hard portion of the game to master.  I recommend this game to all that like puzzle/platformers with a different art style and funny dialogues.",
            "review_score": "1"
        },
        {
            "review_text": "Basically a point'n'click quest in a form of a platformer.  +Great artstyle. +Can get a few laughs... or not +Groovy song 'Just Dropped In'  -Can be boring for some 'cause of gameplay mechanics -Pretty easy -No replay value",
            "review_score": "1"
        },
        {
            "review_text": "I was sold by the Kenny Rogers theme song upon startup but it turns out that this game is incredibly funny and charming. The paper art style is really amazing and the characters you meet along the way all fit the crazy and stylized look. Mechanics enhance the 2D platforming and support the humor of the diologue.  This is a truly funny game (if you like this kind of bizarre comedy) which is something that not many games can say about themselves.   If you liked Psychonauts at all, you will like this game. It has similar themes, style, humor, and even a similar name for the main character. The game is somewhat nostalgic with the paper/cardboard art and is very fun to play (if you don't mind being stopped to hear some minor characters engage in a bit of banter every two minutes).",
            "review_score": "1"
        },
        {
            "review_text": "Fun and creative game! Love it!",
            "review_score": "1"
        },
        {
            "review_text": "'Stick it to the Man' is hands down one of the most hilarious and original games I have played this year. Poor Ray, a bit of a shlub, being in the wrong place at the wrong time, ends up with a telekinetic/telepathic alien stuck inside his head. On the run from a shady government organization he has to use his new found powers to read the minds of everyone around him, steal the thoughts from their minds and then use them to solve the obstacles between him and safety. The writing is some of the best I've seen in a long time, even just eavesdropping on people who have no relevance to your current obstacle is well worth the laughter it brings. There is a trailer. Go watch it, then go buy the game. The kind of cleverness and creativity on display here puts me in mind of Double Fine at their finest. If you miss out on this, your world is a sadder and darker place and I pity you.",
            "review_score": "1"
        },
        {
            "review_text": "I didnt enjoy all the episodes but some where really nice. Most of the stuff was fairly easily to do but at the end you finally got some challenge and at some spots i really got stuck and had to do it over again and again and again. Should be more different stickers to battle the guards i think since it gets repetitive. I would recommend this game since its an interesting concept and i do hope they make another one with a bit of a better story.",
            "review_score": "1"
        },
        {
            "review_text": "Cool and nice looking platform/adventure game. It reminded me, a little, of The Cave but without the multi characters. System specs are very friendly, I can even play this on my medieval laptop. The story is ridiculous but very funny imo (if you like that kind of humour). The voice acting and design are superb.",
            "review_score": "1"
        },
        {
            "review_text": "Stick it to The Man is a great little puzzle platformer that is all physical and all about the mental. The style of the game looks super realistically like a cardboard diarama and your job is to utilize stickers and pull back paper to solve the puzzles. The concept of the game is all about reading minds, solving peoples' personal problems, and an awesome little alien dude who needs to get back home. My only con is how short the game is, providing maybe grand total 2 hours of full game play with little to no replayability. The soundtrack is great though, the graphics are really interesting, unique, and have a nice indie 90's twist, and the storyline is crazy, but great. 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "Stick it to The Man is a great little puzzle platformer that is all physical and all about the mental. The style of the game looks super realistically like a cardboard diarama and your job is to utilize stickers and pull back paper to solve the puzzles. The concept of the game is all about reading minds, solving peoples' personal problems, and an awesome little alien dude who needs to get back home. My only con is how short the game is, providing maybe grand total 2 hours of full game play with little to no replayability. The soundtrack is great though, the graphics are really interesting, unique, and have a nice indie 90's twist, and the storyline is crazy, but great. 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "It's a 2-d something or other. Its a good puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Although it may say that i have 9 hours on record i was idle for the most part of that and takes only 4 hours at the most to compleate. Stick it to the man is a 2.5D side scrolling puzzle game, with asthetic pleasing to the eye and personality bursting out of evey orifice. Unfortunatly most of the characters you come across are as forgetable as the next trying to be humorus only your nan and grandad would titter at.   The puzzles are mediocre at best and dosent take a genius to work out - sure you may get stuck a few times thats only probably you didnt talk to someone properly thus not giving you the prompt to read thier minds.  Overall its a good game with art style to be in awe of for a few hours. although i do recommend this game but not at this price - wait until a steam sale appears and sure enough this will be in there.",
            "review_score": "1"
        },
        {
            "review_text": "For $15 (or less, depending on when you buy it) you get 5 hours of what can only be described as an absolute joy to look at. Puzzles are fun and clever and while most of the humor is pretty lame, it's still very charming. Definitely a good way to spend an afternoon.",
            "review_score": "1"
        },
        {
            "review_text": "Consistently funny, graphically beautiful and rewarding to play, Stick It To The Man is a fantastic adventure in the vein of Psychonauts. Playing as Ray, a well-to-do loser with a psychic spaghetti arm coming out of his head, you read people's minds, solve their problems and explore a gorgeous papercraft world with a ton of great attention to detail. Great stuff.",
            "review_score": "1"
        },
        {
            "review_text": "You live in a world of paper when suddenly it rains. Now you have a hand sticking out of your head, courtesy of Ted, the alien the stereotypical villians were trying to transport. Now they are after you, while you try to deal with that hand sticking out of your head. Good luck. Use the hand to read the minds of nearby people, or use it to remove or add stckers from people's thoughts or your surroundings. The most useful ability in the game is pressing m, looking for the question marks if you get stuck.",
            "review_score": "1"
        },
        {
            "review_text": "HIGHLY RECOMMENDED!. ONE ON ITS KIND!. This is a very rare game, indeed, but not a boring rare game (as VOID or alike), just a full of originality and humor game that it's playable and delivers tons of fun.  Put in a coctel shaker a tad of Grim Fandango, a tad of Jim Earth Worm, a tad of Toejam and Earl, a tad of South Park, a tad of LSD, shake it all with attitude and you get this game.  At a first glance, graphics can seem kiddy and un-exciting but, has South Park bad graphics and story or, they are just different and you end loving them?. Same here. All scenarios and characters are carefully designed and, the overall ambientation is really well made.  Easy at the beginning, goes harder step by step. There are some crazy puzzles, well, sort of!. You usually have to get something to continue the story but, to get that you need to solve a chain of little puzzles in a row first, with no other clues than what your brain-readings say to you but, not that hard. I was stuck just a couple of times.  A drop of platform, a drop of adventure, a drop of puzzle-solving, a drop of humor, a drop of everything fills a cup of fun and originality. While there are some rare games that come with some original idea, some doesn't work and are really boring as VOID or alike and, some are really exciting, as PAPO AND ME or just this one. Giving the bunch of originality and humor, you can find it short. I think the overall sensation is to be starring some cartoon film, ala South Park. Really funny.  Just a warning: BE SURE TO HAVE AN XBOX CONTROLLER ON HAND. I was unable to make this game to work with just keyboard and mouse and, there is no way to re-assign the keys or mouse functions. To me, THIS IS ITS ONLY FLAW.  I WISH A SECOND PART COMES SOON !!! It was a pleasure to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "At long last! The Sequal to Psychonauts 2 has arrived!   What? This is NOT the sequal to that platformer hipsters love? You coulda fooled me...",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful platformer adventure with one of the most creative and imaginitive worlds I've see in in a game as of late. Well illusatrated, fun story. Well worth the money.   As for how I would describe gameplay, Classic 90's adventure meets little big planet with a little metal gear stealth and run. but is very much it's own thing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really nice actually, it has cool concept art and a great soundtrack. The script is excellent with tonnes of humour and the concept of the game is really well thought out and gameplay flows well. Definitely a little gem!",
            "review_score": "1"
        },
        {
            "review_text": "Stick it to The Man! was an interesting, if uneven experience. The story sometimes tried too hard to be funny, and due to the nonsensical nature of the game, the puzzles felt more like just trying and seeing what worked rather than applying any kind of logical reasoning. Still, it was a unique game with an unpredictable story, and a decent way to kill a few hours. Very reminiscent of Psychonauts.",
            "review_score": "1"
        },
        {
            "review_text": "If you played and enjoyed Psychonauts, you will love this game. If you didn't play Psychonauts, still play this game, it's incredibly funny, and it will give you a few hours of laughs.",
            "review_score": "1"
        },
        {
            "review_text": "Very big fan of this short but sweet game. It feels like a mixture of grim fandango and Psychonauts. The game play is part platformer and point-click adventure. The Voice acting is very well done but the style of this game is really what sets it apart from other games. I would Highly recomend getting this game to anyone that is looking for something a little different.",
            "review_score": "1"
        },
        {
            "review_text": "A delightful slice of adventure game goodness that doesn't out stay its welcome. A must have for adventure game fans!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really nice actually, it has cool concept art and a great soundtrack. The script is excellent with tonnes of humour and the concept of the game is really well thought out and gameplay flows well. Definitely a little gem!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a side-scrolling spiritual successor to Psychonauts.   Yes, please.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just full of charm. Its storyline was very silly, what with the alien mind-reading, sticky arm being in Ray's mind. But that was the beauty of it. With this arm, the puzzles were fun to do, and the reading of the characters' minds which was in itself a fun concept to toy around with. The game is dialogue-rich so that contributed to its charm as well.  10/10, no more, no less.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun! I beat it in a little less than 3 hours, but had a blast. It reminds me of Psychonauts.",
            "review_score": "1"
        },
        {
            "review_text": "There have been a number of attempts to get the point and click genre to connect with both modern day gamers and to fit onto consoles in a more natural way. Stick it to the Man is the latest game to try and add a bit more adventure to our lives and does so with some platform elements, a bunch of stickers and a strange alien spaghetti hand.  The somewhat crazy story follows the character of safety helmet tester Ray. One day on his way home a strange canister drops out of the sky and hits him on the head. The canister contains a strange little alien named Ted (Who looks a bit like a cute Krang from the Turtles cartoon). Ted hides inside Ray’s brain and grants him the power to read people’s minds via a giant alien spaghetti arm he now has growing out of his head.  It sounds odd and it is, invoking more than a few memories of Psychonaughts in terms of style and tone. Ray must use his new powers to escape the people who are hunting him and find out what has happened to his girlfriend. This is done via a combination of light platforming sections and using the hand to read people’s minds, find out what they want and then slapping the appropriate sticker into their thought bubble.  The graphical style of the game represents the world in a pop-up book style. Characters are paper thin and everything comes across like a twisted comic book. It’s a style that works really well and it helps to add charm and humour to the already excellent script and characters. Stripping the outside of buildings off like paper to reveal what’s going on inside in a particularly nice touch.  The game is 2D and has Ray move around a set map. Around the map are agents looking to capture him and this is where the platforming comes in. You can use Ray’s alien hand to grab hold of drawing pins and pull him to different places. Using this ability and a combination of stickers that make agents fall asleep or become confused, you have to make your way undetected past the goons to the next area. Being caught results in restarting from a nearby checkpoint so though the controls can be a little bit loose it never caused us any frustration.  The puzzles for the most part are fairly logical (at least within the logic of the world), and we never came across anything that had us stumped or frustrated for a massive amount of time. The only slightly odd puzzles that are likely to stop you dead are when you need to get people to follow you. One in the mental asylum springs to mind where a character repeatedly said that an object would be perfect for her cat but actually needed to be led somewhere else.  Puzzles generally involve reading a characters mind which creates a thought bubble. From here it’s all about grabbing stickers from people’s thoughts and taking them to the appropriate place to use them. This is what you’ll be doing for the bulk of your time and it’s a testament to the design that it doesn’t feel like one giant fetch quest (which effectively all point and click adventures are).   Stick it to the Man isn’t massively long but it offers up an inventive and fun adventure that you can’t help but like. It came as a nice surprise as we hadn’t really heard much about the game before. What we have here is a combination of a good script and some fun play mechanics which create a fairly unique title. If you’re looking for something a little different or want to test out your puzzle solving skills then this could be the game for you.  Overall 8/10",
            "review_score": "1"
        },
        {
            "review_text": "PROS: Very enjoyable, Great game to come back to CONS: Short term replayability is limited, Some levels may be disappointing  I remember playing a game on the Super NES called Plok, when I was younger. That was one of the games I grew up on. I also recall Earthworm Jim on the Sega Genesis as well (one of the games available on Sega Channel). I bought this game because it looked to be about as silly as both of those games. And it was. Contrary to what the negative reviews say, I found myself laughing out loud at some of the jokes. As for the title song, it fell flat for me when I listened to it on it's own; however, as a theme/title screen song for the game it fits in well. The music for the rest of the game (during the levels) was far better though. Overall the experience was enjoyable.   The puzzle solving in this game is unique. It definitely wasn't what I was expecting, but it was by no means unwelcome. However, there are a few levels that, taken as a whole, could have been reworked. These are the levels where there are little to no puzzles. It wasn't disappointing to me because they fit well with the storyline. I also make it a point to go into a new game with minimal expectations, but if I was expecting lots of puzzles those levels might disappoint me overall. The main drawback for me is short term replayability. I'm expecting to finish out the Steam Achievements in maybe another playthrough or two. I got nearly half of them already and I'm on the final chapter during my first playthrough.  Once I'm done with the Steam Achievements, I probably won't play this game again in the near future. However, I will definitely come back to it from time to time.",
            "review_score": "1"
        },
        {
            "review_text": "Short, fun and packs a hell of creative punch for the player. One look at any screenshot should give you a pretty good idea about the game, being a side-scroller with tons of humor, interesting art-style and ton of funky characters.   Definietely a giant, green thumb up.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutley brilliant little game. If like me you grew up in the golden age of point n' click adventures on Amiga/PC and yearned for more, this will more than satisfy those needs. With more than a nod to the classics of old and more modern classics such as Psychonaughts and fantastic sound/design and writing by the excellent Ryan North of Adventure Time fame, I can't recommend this highly enough. Dont over look this gem! A+",
            "review_score": "1"
        },
        {
            "review_text": "Discworld meets rayman meets psychonauts meets monkey island meets good music and good writing plus smooth puzzles and amazing visual style. Done.",
            "review_score": "1"
        },
        {
            "review_text": "Great visuals, and genuinely funny. Gameplay is very straight-forward and brings nothing new to the table. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Got it on sale for 2 pounds. Worth every penny! Right now I am halfway through the game and I really enjoy it! Great soundtrack and love the animation!   Defenetly a 9/10 for the price I bought it for, but for the steam price 14.99 euros I would give it a 7/10!  Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "It can be difficult to put into words exactly how I feel about this, but here goes my best...  I am a serious lover of DoubleFine Production games, they always seem to catch the right kind of amount of humor, adventure, and intrigue that I look for in a game. The craft put into their storytelling is always amazing.  'But Brock,' you say, 'this game is not by DoubleFine at all! Explain yourself!' Well, as I prefaced, this game is a difficult one to pinpoint in my brain, but the one withstanding element throughout the whole thing was this constant reminder of the humor and stylization that DoubleFine creates in their game Psychonauts.  While the story is somewhat lackluster for me in Stick it to the Man, it easily is made up for the sheer volume of interesting character background and stories therein. This game allows the player to enter the mind of most any biological being, dead or alive, and therein the game shines!  There's rich little mini-stories that are perfectly done, and I almost believe that the writers knew about their main story as being straight-forward, so they decided to sprinkle the whole thing with entertaining sub-plots throughout, making an entertaining ride. Anyone who is a fan of DoubleFine-style imagery, give this guy a try!",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining game, sweet soundtrack and wonderfully quirky style! 10/10 would stick it to the man again ;D",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining game, sweet soundtrack and wonderfully quirky style! 10/10 would stick it to the man again ;D",
            "review_score": "1"
        },
        {
            "review_text": "Silly. I loved the weirdness of this game. I rarely finish games but I did with this one. I played it in two days. It was short but great.",
            "review_score": "1"
        },
        {
            "review_text": "This was a fun game, and a great concept. Your character is able to read people's minds thanks to an alien creature inside his head. The art is fantastic, with everything (including the characters) made out of cardboard or paper like a diorama. You can even see the bits of corrugation in the cardboard from the side! You can use your mental powers to find stickers all over the world that you can use to accomplish different tasks. For example, you can read someone's thoughts so they start thinking about something, which appears as a sticker in a thought balloon, which you can now place on them to put them to sleep! It's kind of like a 2.5-D puzzle-platformer (more like 2.75-D, since you can occasionally move in the third dimension), but with true 3D depth in the scenery. Attention to detail is amazing. My only problem is that the game is too short (it took me about 4 hours, including lots of wandering around trying to find things that I had overlooked).",
            "review_score": "1"
        },
        {
            "review_text": "What a hilarious Platform/Puzzle/Adventure Game . I was literally laughing out loud sometimes , about some of the dialogs . Yes , it`s a really crazy and weird game but i love it for that . Not to forget the Artstyle and the Music is beautiful too . And like some other Reviews said it before , it`s so similar to Psychonauts that i love too .",
            "review_score": "1"
        },
        {
            "review_text": "kinda funny :-)  awesome cartoon style, silly jokes, for the sale price worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Cool asthaetics paired with a cool idea. The gameplay itself isn't that great. You might like it if you are into point and clicks.",
            "review_score": "1"
        },
        {
            "review_text": "- Fun !  - Great soundtracks  - Atypical gameplay  - Good graphic design  - Funny story !   Enjoy it! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "There are things I like about this game, and there are things which frustrate me a lot in this game. I enjoyed my time, but I can only recommend the game if you like a style and bizzare sense of humor (it's a pretty short game, you need 4-5 hours to finish it on your first playthorugh).  I like a style and a humor, and first couple of levels are very-very fun. Cut-scenes are fun and the game doesn't show you the same cut-scene if you die. If you replay some level, press backspace for 5 seconds to skip.  Voice acting is very good, and most of the dialogs are funny. And you can hold 'd' to speed up the speech if you are bored.  However, there are a lot of things I didn't like: it can be a problem with my PC, but controls feel clunky to me. I spend a lot of time retrying jumps of moving platforms. And I am not a new person to the platformers genre. Controls aren't rebindable (at least from the menus). Sometimes you think you can make the jump, but the platform is a bit far away. This won't be a problem, but you have goons in this game.  First two or three encounters with goons are good. However, after some time goons are not fun anymore. I just hoped it's the last goon on this level. Good thing you are not forced to do the same section more than once, developers provides you short cuts after you beat the section.  And the last thing: I liked some quests, but a lot of them are illogical. I finished a lot of the puzzles with brute force, and sometimes, couldn't get a logic even after finish.",
            "review_score": "-1"
        },
        {
            "review_text": "Another week, another episode of Was It Worth It? But this isn’t just any episode … this is our super special tenth episode! Okay, fine, it really is just any episode. We promise it’s a good one, though! This week, we played Stick it to The Man, a dark and goofy point-and-click adventure platformer that felt almost like a direct homage to some of Double Fine Productions’ offerings, namely Psychonauts. This game was hilarious and had a charming style that we both enjoyed, although there were a number of problems, ranging from repetition to plain old joke murdering. Want to know if you should spend your money on it? Go ahead and check out the audio or video below!   YouTube   SoundCloud  [soundcloud.com]   Original post  [www.sharctank.com] ",
            "review_score": "-1"
        }
    ]
}