{
    "app_id": 251990,
    "name": "Long Live The Queen",
    "release_date": "2013-11-08",
    "developer": [
        "Hanako Games"
    ],
    "publisher": [
        "Hanako Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Visual Novel",
        "Anime",
        "Female Protagonist"
    ],
    "achievements": 45,
    "positive_ratings": 5656,
    "negative_ratings": 305,
    "price": 6.99,
    "description": "Rule the world or die trying!Being a Princess is not an easy job. Being a Queen is even harder. Especially when you're only fourteen years old, and the reason you've inherited the throne is that your royal mother has just met an untimely end.Now power is up for grabs.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251990/header.jpg?t=1447358661",
    "minimum_requirements": "OS: XP, Vista, 7, 8 Processor: 1.2 Ghz Memory: 256 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "&gt;notice the 'learn about dogs' skill option &gt;i love dogs in real life so i'm immediately sold &gt;spend the next 30+ weeks doing absolutely nothing besides learning about dogs and playing alone with my toys &gt;other leaders see me as  'weak'  and  'unfit to rule'  &gt;they demand that i step down from power &gt;i refuse &gt;a civil war breaks out &gt;i quickly lose and wind up becoming a servant for the rest of my life  everyone's just upset since i know more about dogs than they do",
            "review_score": "1"
        },
        {
            "review_text": "Oh hey, it's the chocolate. I've heard about the chocolate. Better not eat the chocolate.  Wait why are you eating the chocolate  no elodie no  why",
            "review_score": "1"
        },
        {
            "review_text": "For me this game has everything I like (historiographical storytelling, world building through political intrigue, magical girls and a protag who loves pink and clothes). For everyone else, this is one of the best VN you can get for its price on Steam, and is a vast improvement over Magical Diary in every facet. There are a ton of ways to play the game and it's an absolute delight to balance classes and activities to optimize learning... the epilogue might be my favourite part of the game. So much to do and see in this game, cannot recommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "In Dark Souls you die and you born again. In Long Live the Queen you die FOREVER",
            "review_score": "1"
        },
        {
            "review_text": "its like dark souls, except with less anime.",
            "review_score": "1"
        },
        {
            "review_text": "This game is slowly ruining my life.",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that let's me be the beautiful anime princess I've always dreamed I could be 100/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Be Princess &gt;Fully trained in weapons, athletics and military &gt;Enemies tremble before me &gt;Everything ready for Naval Battle &gt;Dies from poisoned chocolate  ...  10/10 would play again. Best death simulator: chocolate eater edition the experience. ",
            "review_score": "1"
        },
        {
            "review_text": "Pfft, ain't no one's gonna kill me. I know all about military strategy and- OOH A BOX OF CANDY! Dead.",
            "review_score": "1"
        },
        {
            "review_text": "Reminiscent of text based games from long ago, Long Live the Queen is a very entertaining strategy game.  You control the heir to the throne before coming of age and game-play consists of choosing which skills to develop before your coronation next year. Many different events will happen as time progresses and depending on what skills you chose to focus on, you will either open up new story paths or in some cases even end up dead. There are many different ways to die, some very unexpected.  Replay value comes from going back and trying to see the different endings (or the different ways to die – yep, I’m still working on that achievement), or even the different story options. You can save any time you want and the game also includes an auto-save so you can go back some to try different strategies. Many times though you will want to start over again fresh, picking different skills just to see what happens.   If you prefer action based or shooter type games, look elsewhere. If you like anime style artwork and unforgiving strategy you will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "played for about an hour just to get shot at a party - 10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Did my best to improve my combat skill, reflexes and agility Died eating chocolate",
            "review_score": "1"
        },
        {
            "review_text": "Saved a grill from tentacles in magical forest, then she became my lover. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Thou who doubt her right to rule shalt burn!  Together we've burned witches, assasinated oponents, crushed enemies' armies and executed anyone who dared to opposite her might.Now she's prepared to become not only a queen, but the living Goddess and everyone shall kneel before her one day.  Eventhough I liked this game I can't give it more points, the game is hard thats good, but too repetitive. Events are coming in same weeks all the time, it's not randomized. Different classes gives you new options and choosing individual options leads to many screnarios, which almost every ends badly. Personally I enjoyed this game and I can recommend it.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantasy JRPG meets Empire: Total War in a VN-esque fashion.  If you ever ventured into one, two or maybe all three of these gaming styles before, I believe it's easy to see why Long Live The Queen is so well rated here. Despite having completely different themes and gameplay, the joy of playing this kind of games comes from the same things: (a) they can be extremely funny when things go wrong; (b) nothing feels better than a well executed plan. So why not mix them all into a single product and see why happens?   This indie 'The Sims: Medieval Days' you're now skimming through searching for funny reviews and considering if the price is worth it, is the cute, adorable –but at times infuriating– offspring of a merciless strategy game with a naive Role Playing Game. (Speaking of which, if you're not self-inserting as Elodie, our troubled protagonist, you're doing it wrong).  It's common to read folks praising this game for its 'complex strategy' but truth be told, it's not THAT awesome. It took me about 5 hours and little more than 4 saves to (successfully) get a crown placed above my head, which was kind of a bummer since things were getting really interesting by the end. That said, the 'strategy' complexity and difficulty of actually 'beating' the game -as in reaching coronation day- is nothing remarkable. The variety of ways you can achieve that, however, is what makes playing this game over and over worth the time. There's a reason you have literally dozens of save files slots, and if you enjoy the game, you'll likely fill most of them, where, depending on your mood, some are likely to end up with exotic names, i.e: 'Save File #16 - Should I execute this maggot?', 'Save File #21 - Survived the chocolate'.  The masterpiece lies within the development and execution of the (a) and (b) items previously mentioned where, You'll die. You'll die in funny, unexpected ways. Characters will say funny stuff before you die. And your epitaph will always make you giggle.  Alongside brilliant characters with the most alluring behaviors which will show you that, Training some skills on the wrong order will prove extremely disastrous. Everyone has awkward, impossible-to-remember names. You'll eventually give up trying to memorize their names. You'll notice it's easier to just call it whatever is easier to remember (Talasse -&gt; Tallahassee)   If there are any negative aspects about this game that I can point out, it would indeed be its short length. Had it been a bit longer, it would make an outstanding awe-inspiring Journey™ instead of just an above-average afternoon play.  Anyway, point is, stop wasting your money with stupid COD releases every year and support this deviant, creative game. Oh, and don't use guides. It spoils the fun.",
            "review_score": "1"
        },
        {
            "review_text": "At first, I was really confused with this game. There is so many stats to up and you got to handle the princess mood too. And the most frustated part is death always nearby so I gotta save often (use all the save slots that's avaliable). But thanks to the 'Illuminate!', it got my hype up since knowing that my princess is a Magical Girls change the course. 1 hours of struggling and at last I really got coronated (Yeah, LONG LIVE THE QUEEN!) but there is still a missing piece.  So I open the achievement and well there is a lot still locked, gotta play it again and again then. After that I tried to read some of the Community Guides and found out you can marry a girl . OMG! It's really have a yuri ending and more magical ends.  10/10 will definitely Megucas.",
            "review_score": "1"
        },
        {
            "review_text": "So what looks like a cutesy anime game is actually a tale of political intregue, backstabbing, domestic politics, war, peace, and learning how to be a proper princess.  It's good!  Better than any game about hexagons.",
            "review_score": "1"
        },
        {
            "review_text": "Politics Souls, 10/10 would sing evil overlords into submission again. Please don't let the promotional art fool you, this is not a lighthearted dating sim. Long Live the Queen is an interesting game about learning to navigate politics in a fantasy setting. The writing is excellent and makes for amazing replayability. I had myself doing intentionally faulty builds, not just to experience the many interesting ways to die, but to see the flavor text on classes and choices that may not otherwise have been open to me. The game was updated ages after release with even more content, much to my surprise, and had me coming back to play it again for even more new stuff. Every choice you have bears some kind of consequence on the narrative, be it on the influence on your mood, your popularity with your people and/or court or changing the narrative entirely. You can cause civil wars. You can be overthrown by your own court. You can have assassins come for your life for reasons you won't understand until you've played through several kinds of routes. The setting is dynamic and it will take many, many playthroughs to learn how everything pieces together, without destroying the narrative experience for your first, single playthrough. It seems like there's always something new to find. Would absolutely recommend to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "If Dark Souls was more Japanese.",
            "review_score": "1"
        },
        {
            "review_text": "YOU THERE! .... No not you ... Yes you! Do you like princesses? Yes? Well you'll love this game as you battle to keep her alive by:  Dancing Learning how to make public speeches Learning how to look good  Do you not like princesses? No? Well you'll love this game as you try your best to unlock all of Elodie's deaths by:  Dancing Learning how to make public speeches Learning how to look good",
            "review_score": "1"
        },
        {
            "review_text": "Killed my aunt, chased off a monster, sunk a fleet with magic, woke an ancient terror and authorised human sacrifice. Best day ever. 10/10, would definitely rule my kingdom with a (delicate) iron fist again.",
            "review_score": "1"
        },
        {
            "review_text": "Watch your tongue you slanderous knave! Execute that man! Send his head as a warning to other powers we are a force to be reckon with! Senpai didn't notice me? Kill him! Implied lesbian? Nonsense not on my watch. You get the idea, you are a up and coming queen and as you progress through the game your decisions effect what's happening, or is about to transpire. Got it on sale for two bucks, but would have gladly paid full price for it. It may look like animu moe ♥♥♥♥, but it's actually addictive, if you want to play like an ♥♥♥♥♥♥♥, you can, or rule with a gentle touch, you can also. Worth a pick up, thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "this is the only game on steam that lets me wear pretty dresses and feel powerful  ♥♥♥♥ i can't believe they killed her again, what the hell?!",
            "review_score": "1"
        },
        {
            "review_text": "My queen was so stupid she thought the best way to survive an arrow to the leg was to push it in further...she died.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen incorporates Dating Sim mechanics in a quest to help a girl survive to her 15th birthday. Of course, this is not any ordinary girl, for she is meant to be the future Queen of her land. You have to help our protagonist with preparing her for potential assassins, cival war, propaganda and foreign affairs by making choices about her education and strategy.  By dating sim mechanics, I mean that you have to choose which stats to builds up and you learn about possible strategies through failure. In dating sims this means failing to get the love-interest. In Long Live the Queen this means dying. A lot.  You have multiple save slots. Use them.  That is the main piece of advice I have to have the most enjoyable experience possible. Otherwise, let yourself go, accept failure as a definite and enjoy a game where you slowly build a strategy over time via hypothesis-testing.  Story-wise, the writing is wonderful. The stats results in numerous dialogue branches, so that you feel like your character is actually changing based on her education and her actions. There's numerous replayability, for you can win (and lose) in many different ways. If you're into Game of Thrones-esque intrigue and royal complications, there's enough to keep you entranced for a while.  On the whole, I recommend Long Live the Queen for those who don't mind trial-and-error style strategy game play who are looking for a taste of experiencing Dating Sim mechanics without the dating.  (Though, there is some dating.)  ",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying this: This game is AMAZING.  The people who are giving downvotes are those who sucked at the game or found it too grindy. Personally, I didn't find the game that difficult. Stuff made sense after playing through a few times, and eventually I knew the game well enough to map out my choices beforehand.   Actually, I did play this game before several years ago when I was a middle schooler and I absolutely sucked at it. I never finished a single route. Now trying again, I can breeze through a path that I had mapped out prior to my gameplay. So it's a matter of someone's intelligence when it comes to puzzles. The game itself is amazing and I can not fathom how the creators was able to put in so many different branches in the storyline. Also, the game tells you the effects your choices have on the events, so you can plan ahead. (though remember that you don't have to succeed at everything. You don't have enough time to master everything. Focus on the things that count.)  And hey, its chill. Save to your heart's content. PLEASE save to your heart's content - you'll need it.  10/10 would wage war and die a bloody death lined with pink frills again",
            "review_score": "1"
        },
        {
            "review_text": "stop eating the chocolates you dumb ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "A princess who’ll turn 15 on her coronation, try to stay alive ! They are Dukes families, some try to conquer. A relative will try many times to kill you cos she has a grudge on … you might punish her. You might learn who killed your mother. You might get a crystal and become a lumen. Your social skills will be judged &gt; « commoner approval »There’s a civil war and a naval war. I’m dumbfounded at how smart the developer of this game is!  You learn skills (read the lesson's content) and you face events which unfold according to your good or bad knowledge of corresponding skills. Save a lot on choices so as to either learn more of a skill some weeks before or avoid a danger making another choice.  Unfolding : Each week you choose 2 skills to learn, on week-ends you choose an activity which affects your mood. Each skill could be well or bad learnt according to the mood.  If a skill is at 50, the 2 others must be at 25 to lean more and unlock the outfit.  Advice on playthroughs  Play until you die, then check on wikia its week to know what you must learn to avoid it. You can notice whick skills you failed with the rising bubbles during the dialogue.. Only once you’re frustrated to go short on the game (40 weeks time of game in all) you can read more thoroughly wikia guide to moods, events/week.",
            "review_score": "1"
        },
        {
            "review_text": "IMMA TELL YOU RIGHT NOW. DO YOU LIKE TO FEEL AGONY AFTER REALIZING YOU ♥♥♥♥ED UP DAY ONE ON THE JOB BECAUSE YOU WEREN'T HAPPY IN CLASS? DO YOU THINK THAT PATIENCE IS VIRTUE AND YOU RUSH THAT YOU ARE CALLING FOR AN ASSKICKING? Well then, you come to the right place.  *Major spoilers ahead* BECOME ELODIE ON HER (DANGEROUS) QUEST TO (SURVIVE 'TIL SHE IS 15) BECOME A QUEEN. DON'T KNOW ♥♥♥♥ ABOUT TRADING? WELL EAT THAT CHOCOLATE SOMEONE SENT YOU AND TRY AGAIN. YOU THINK GOING TO A PARTY WITHOUT KNOWING TO BE FAST AND KNOW PHYSICS OF AN ARROW? BETTER KNOW WHAT HAPPENS ON THE BATTLEFIELD AND TREAT THAT ♥♥♥♥ AND TRY AGAIN. GO WITH YOUR FRIEND AND GET ATTACK BY MONSTERS? DANCE THAT ♥♥♥♥ OUT OR LEAVE HER BEHIND. NOT YOUR FAULT YOU FAILED ALL THOSE STAT CHECKS. DON'T WANT TO BE QUEEN LIKE OR BE AN ACCOUNTANT? ASK YOUR AUNT TO GET YOU YOUR MAGIC CRYSTAL THAT MAKES YOU A MAGICAL GIRL. YOU DON'T NEED NO IRONIC WISH OR A KYUBEY. USE THAT ♥♥♥♥ TO BLOW UP BOATS, RIOTS, ♥♥♥♥♥ES WHO CHALLENGE YOU TO A DUEL, AND MORE. Maybe all the action isn't for you and you just wanna get married, because you are a princess and want a king to be next to y- *SMACK* F*** DAT ♥♥♥♥♥. YOU CAN STAND ALONE AS AN INDEPENDANT 14 YEAR OLD GIRL. YOU DON'T GOTTA GIVE UP LAND, YOU MAKE SURE THAT THEY UNDERSTAND YOU REPRESENT THE NOVAN KINGDOM AND ANYONE WHO WANTS SOME HAS TO STEP UP AND JUST TRY TO TAKE IT....  Or you could forget to study trade and production and eat the chocolate you are sent... that too. I think I wrapped thi- OH WAIT.  IF YOU GET ENOUGH STATS IN THE 3 SKILLS OF THAT SECTION OF THE TREE, YOU GET AN OUTFIT. GET LUMEN'S STATS GOOD ENOUGH? BAM. MAGICAL GIRL OUTFIT YOU CAN WEAR, RATHER THAN THAT NASTY BOARDING SCHOOL OUTFIT. WANNA BE A SPY? GET YOUR INTRIGUE UP, GET DAT CATSUIT. WANNA KNOW A LOT IN MILITARY? HOPE YOU ARE READY, BECAUSE BAM. YOU STOLE NAPOLEAN'S OUTFIT. THIS GIRL AIN'T ONE TO F*** WITH.   Ok, now I am done... any hateful comments? Oh, you in the corner? Come up here and tell us... *SMACK* NO-ONE ASKED YOU. Oh, you say I DID ask you? Let me help you up- *SMACK* YOU BROUGHT THAT ON YOURSELF.  MAGICAL GIRL/10  (Btw, I played this a lot on my friend's account when I didn't have the money to buy it, but now I do and I finally could write that review.)",
            "review_score": "1"
        },
        {
            "review_text": "One of the appealing aspects of visual novels, for some people, is 'mastering' the mechanics: Learning the flags, checks, etc... and using that mastery to obtain an outcome you desire. It's the same sort of engagement you might get from a puzzle game. I think that this game focuses on emphasizing that aspect of enjoyment. The reward for being able to reach new branches of the story is getting to see what happens, and the writing and art is certainly good enough (for me) to make that worthwhile.  When you first play this game a few times, it's just interesting to see what happens based on the choices you make. Eventually, though, you may find yourself more interested in trying to get to the end, and that's where the gameplay changes.  When I first saw this game, I thought that the events that happened to your character each day were just random, so you wouldn't be able to plan your classes very strategically. Well, I was wrong. As far as I can tell, each 'week' of the game always has the same event, but what actually happens may change entirely based on what has happened on previous days. So, there's enough stability to give you the ability to strategize.  At this level of play, the game involves a lot of saving and loading as you explore different choices and different classes. The game seems designed with this in mind: saving and loading is really quick. At any point you can right click to bring up the save/load screen. I never found myself getting frustrated by going back and reloading a save. The game makes it easy to remember what you did in each save by including the week you were on and letting you name the save. It also lets you quickly skip through dialogue you've already seen.  If you like visual novels you'll probably really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "A cute and fun, but incredibly punishing game. A get a little sad each time my young queen bites the dust.",
            "review_score": "1"
        },
        {
            "review_text": "Princess. Check. Sword skills to shame Bariston Selmy. Check. Strategic, tactical and military power to conquer the world. Check. Chocolate. Check. Death by poison. Check.  Take Crusader Kings, FTL and Anime, sprinkle in some princess and throw on a skimpy magician outfit and you have Long Live the Queen. 10/10, harder than Dark Souls.",
            "review_score": "1"
        },
        {
            "review_text": "You're some anime princess who needs to get married to be Queen, Death is Certain",
            "review_score": "1"
        },
        {
            "review_text": "Would not recomend for impatient people even a decent player of civ that can survive for quite a long time without breaks might find this game very slow, unrewarding and make you seem like a big enough failure to think your doing everything wrong when your probably not. Its stressful and isnt worth the ten dollars. Although it has a good enough soundtrack to buy on a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun, ultra-short VN. Kinda rogue-ish, in that you gotta restart each time after you die to see all the variations of all the events/endings (saving is allowed though). Really like the art style, especially the cute badges you get when the princess dies (albeit that's kinda morbid). Soundtrack is really thin, though.  There's cheats if you wanna just expedite the process of seeing everything.  That said, might wanna wait until this game's at 75% off or around $2-ish. The length is really short and the replayability isn't that amazing (grindy, to say the least).",
            "review_score": "-1"
        },
        {
            "review_text": "When you play the Game of Thrones, either you live or you die. Repeatedly. Because of that damn NAVAL BATTLE, DAMN IT LUMAN POWER, WORK!!!",
            "review_score": "1"
        },
        {
            "review_text": "Oddly addicting, considering it's a resource management game about cute anime girls. It also took me an embarassingly long time to beat. I think the best aspect of this game is the collosal amount of replayability it offers. There are so many ways to screw up and so many ways to win that it is just a joy discovering each and every one (not that I've come even close).",
            "review_score": "1"
        },
        {
            "review_text": "A beuatiful game with a grand story and a wonderfully difficult game, would definetly recomend to any stratagey/anime fan.",
            "review_score": "1"
        },
        {
            "review_text": "Need to remove an arrow? Push it in farther.  10/10 Would use as a survival guide.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game, its a story rogue like that is cryptic but offers some different play styles that make the game completely different each time you play.",
            "review_score": "1"
        },
        {
            "review_text": "I think I've never played something as pleasant as well as challenging as Long Live The Queen.  Totally worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "What drives a man of God to wash away the sins of his past, only to blacken his heart with a multitude more? How far can a freedom fighter be pushed before virtue and righteousness are replaced by a lust for vengeance? What does a privileged society do when the foundation of its prosperity is shaken? Long Live The Queen dares to explore these heady themes and many more, giving you glimpses at just how the seemingly smallest of decisions can forever alter our realities, and our hearts. As a young princess, your actions bring turmoil and strife to an ostensibly idyllic landscape. It's immensely fun to stir up trouble, and even more engaging to see how boldly Long Live The Queen portrays a society torn asunder. You'll be haunted by this thematically devastating adventure, and indeed, its phenomenal final minutes, which are bound to be discussed and dissected for some time to come.",
            "review_score": "1"
        },
        {
            "review_text": "You shouldn't have voted for Super Hexagon...",
            "review_score": "1"
        },
        {
            "review_text": "You remember those choose your own adventure books? The ones that had you flipping to each end of the book, killing you in like a billion diffrent ways? Well, this is like that, but with Princess Maker.  You are the princess of magical mystery brittain, who just took over the throne after her mother's passing. You need to train yourself in everything from economics to sword figthing to poisons, for both fun and profit. During your adventures of queen-ing you will be assasinated, stabed, tenticle'd, blowned up, and more, varying on your skills and choices in managing your kingdom.  I won't spoil the big story points of the game, but it's a pretty interesting story. It factors in political intigue, dealing with peseants, and not geting murdered, but the story and the game don't take it's self all that seriously, resulting in less frusturating deaths and more 'whoops, all of my blood is outside of me now! Better try again'.  Also, you get various outfits to dress your princess in. The Millitary outfit is best outfit.",
            "review_score": "1"
        },
        {
            "review_text": "What a freaking hard game it is..., but that is exactly what makes this game so enjoyable. You can bite yourself into it and fight with it until you beat it ..., and what a wonderful feeling the moment you beat this game is (especially if you reach your wished outcome).  If you have the persistence to beat this game you will have a great time. If you don't ... just don't buy it.  If you suck, you die.",
            "review_score": "1"
        },
        {
            "review_text": "Max level wield + resist magic. Uses dazzling spell. Decoration test failed.  Dies to black smoke.  10/10 will reload past save again",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year contender. &gt;better than horrid henery.",
            "review_score": "1"
        },
        {
            "review_text": "The best way to put this game is 'lacking'. While the concept is decent enough, the game isn't long enough to make use of the varied stat building outside of 'Different ending here, different outcome there', and that pales in comparison even to the most simple of Visual Novels that get by on only different endings, especially since the most variation in these comes in the form of....death?  If I wanted to die for different dialogue, I'd go play Dark Souls. I wouldn't get the dialogue but HEY, I'd die a lot. The story is meh...no, almost nonexistant to the point where you won't care about it enough for it to matter. It tries to have RPG like mechanics but really, this is just a royal version of Cute Knight with a lot more stats to level that have no meaning and no dungeon crawling.  I need more than this, and this doesn't offer it to me.",
            "review_score": "-1"
        },
        {
            "review_text": "The game trailer on Steam says it very well! You guide the princess Elodie on her 40 week journey to coronation by choosing, week by week, what classes she will take and what skills she will build. In addition, there are a number of events during the week where you get to choose how Elodie will handle them, which often impacts what skills she can build, or at least how effeciently she'll be able to build them. Some events will always happen no matter what, while many others happen in reaction to the way you handled previous events. Many of these events are deadly.  Within that framework, there's a lot of player choice and immense replay value. It's impossible to build all of the skills in a single play through, and it's very difficult to anticpate which skills will be the most important when you first start out. It will probably take a few tries to get Elodie all the way to her big day without her being poisoned, stabbed, shot, or blown up. Even when you do, though, the game still has more to offer. As the ending screen reminds you, Elodie's story doesn't have to end this way, there are many other options to explore. And with each playthrough taking only a few hours, why wouldn't you at least try, just to see what happens?",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game while browsing and thought to myself 'why not get it?' I looked it up and read reviews about it and they peeked my interest. I decided that I could not possibly live without this game. This game is very fun for a casual, strategic gamer like myself. I recommend it to anyone that is considering this game. It has cute visuals and a strategy/rpg feel to it without losing the casual playing style.   Also, a warning to those who get it and don't want to lose a lot of their progress: save in a new save slot every time before you choose your classes to take. You'll understand as you progress through the game why I said to do that.",
            "review_score": "1"
        },
        {
            "review_text": "I've played much longer than the 4 hours shown, I bought this before it came to Steam and spent so many hours just playing or dying really before I pulled out the old fashioned pencil and paper and began to write down each and everything I tired and different things I learned along the way to get through this game. The end result had over ten sheets of paper with my findings on it... then of course I discovered the online walkthrough but that's another story... however the point is I spent much of my time making strategies and of course dying but it was all in good fun! This game is most certainly a 10/10 and I'd recommend it even to those who are'nt into visual novels it's just that entertaining :)",
            "review_score": "1"
        },
        {
            "review_text": "I seriously wish that there were more visual novel games like this! Looks a bit strange but really addictive...",
            "review_score": "1"
        },
        {
            "review_text": "Well now, this is an odd little game. The first description I heard of it made it seem a little like the RPG side of Crusader Kings II, although I didn't think it looked anywhere near like the kind of intrigue-filled game that is CK2, based on the art style and logo found on the store page.  So I asked about it further, and as I have now had the chance to actually play the game, I can agree that it is in fact very similar to the RPG mechanics of CK2 (particularly the tendancy to have your strong, charitable genius character die when things start going well for you), as well as having the skill checks from D&amp;D and also perhaps some Game of Thrones vibes in there, as well.  So yeah, although I haven't played it much as of writing this recommendation, I think that if you like CK2 or GoT and want something that focuses on trying to stay alive and keep your realm stable, it might be worth looking into this, come sale-time. Although of course, if you have a phobia of Japanese art styles, it might be a little harder for you to get into. (personally I'm not particularly fussed either way, as long as it's not NMS and is a good game overall) It also appears to have a lot of replayability, which is always nice.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game if you want something more casual. It doesnt take high concentration skills and is very simple to play. After a lot of playing though you may find yourself stuck at the same part over and over. I would suggest either typing down your choices and practices to see what youre doing and prevent yourself from doing the same thing twice or *cough* look up guides online* cough*.",
            "review_score": "1"
        },
        {
            "review_text": "You play a princess whose mother the queen just died. In the process of preparing to become the new queen, every character who ever shows up at any point is either trying to kill you or will get you killed, likely in several ways. Buy this ♥♥♥♥ing game, you tools.",
            "review_score": "1"
        },
        {
            "review_text": "'Long Live The Loli' I'm Lolicon. She looks very cute. This game will make you become the manager. You must take care of a cute little girl.  The art and music perfectly good. It's slightly complicated to seek the favor of Princess because she was a girl,but not too hard. She has a little selfish.",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive game! Accidentally killed myself by trying to retrieve a smut poem from the roof of a building. This game looks easy but you mostly just sit there looking at the screen trying to figure out how not to kill yourself. 10/10 for frilly, pink deaths and espionage",
            "review_score": "1"
        },
        {
            "review_text": "This game is so infuriatingly excellent. It's a nice mix of strategy and humor in a visual novel-esque package.",
            "review_score": "1"
        },
        {
            "review_text": "Anime Princess Death Simulator.  Don't judge a book by its cover.  The game involves Princess Elodie (the playable protagonist) learning about the country she’s soon to rule called Nova. You have to guide Princess Elodie through different lessons while balancing her emotions and handing political, economical, foreign and inner affairs.  Oh, you also have to avoid untimely death and make it to Princess Elodie’s coronation, which is no easy task. (There’s a reason there’s an achievement for living through the year of training.)  There’s countless different ways you can go about for literally every event in the game. You can be an elegant and graceful queen; a military strategist who strikes fear into the other kingdoms; a powerful sorceress with a cute outfit; a cruel dictator ruling with an iron fist a la Marie Antoinette— your subjects can even cause a revolution against you if you choose this path!  While you may succeed in some areas, you’ll fail in others. You will have to make choices for the good of the people (such as having an arranged marriage) and others for your life, despite them not being the best or morally right thing to do.  You truly rule like Machiavelli wanted.",
            "review_score": "1"
        },
        {
            "review_text": "The safe word is Oklahoma... And yes you're going to need therapy after this one gets done destroying your feels... Think you've got a handle on the game after a few deaths? Ha haha hahahahaha muahahaha muaaahahaah muuuuuaaahahahah...",
            "review_score": "1"
        },
        {
            "review_text": "SPOILERS.  First game: killed by assassins... ok Second game: killed by poisonned chocolate... ok... Third game: I lost a battle with full 100 military, my kingdom has falled to the ennemy, my father died while fighting the king of ennemies, then i must surrender... then i got killed by my people wich eared that i killed my father and i'm a traitor... not ok  10/10 breakdown simulator 2015  4th game won...by maxing some trees, i think its the fastest ending you can have. In fact you can have many endings... it just depend of what do you want. Still a exelent game, sometimes funny but sometimes highly breakdown...  9/10 she is flat.",
            "review_score": "1"
        },
        {
            "review_text": "Best princess Simulator ever  Ate Chocolate  Died from Chocolates  11/10 would die again",
            "review_score": "1"
        },
        {
            "review_text": "A throwback to those 'choose your own adventure' books; equal parts 'wait, what!?!' and 'awesome!'. :P Figuring out how to change the outcomes (and deaths) is especially satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "You'd be forgiven for having a certain set of expectations about this game based on its art style. They are, however, incorrect. What this is is a punishing game that requires you to manage your little queens time in such a way that she has the skills she needs to survive game of thrones style court intrigue. Some elements of the writing in this game are a little week, but it is very unique and enjoyable. Give it a shot, it is pretty cheap as well.",
            "review_score": "1"
        },
        {
            "review_text": "Become a magical girl, learn to wield a sword, develop a web of spies and grow to be a cunning military strategist, or, more likely, upset the wrong duke and end up a red smear on the ballroom floor. This is a game that is very fun to play but rather hard to win, but multiple playthroughs are rewarding and the script is versatile and enjoyable, so that's not such a bad thing. The key is sometimes as simple as understanding that the cooler and flashier skills aren't all you need; you may be a genius at naval warfare, weaponry and field medicine, but if you've been neglecting to practice your swimming then maybe personally overseeing that battle from the helm of your flagship isn't going to go so well.",
            "review_score": "1"
        },
        {
            "review_text": "Do not be fooled by the cute anime art. This game is ruthless and surprisingly fun to play. Just play it, and you'll understand. (Totally worth the current sale price of $2.49, and I gladly paid $5+ for it)",
            "review_score": "1"
        },
        {
            "review_text": "I lived long enough to become Queen.   It only took several deaths and a couple months 10/10",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR Review at bottom  Gamepay and Story   For gameplay it dose what it's supposed to do as a Simulation/Strategy game, with lots of choices that can make you better or wores. With classes that make you're princess better at whatever you have chosen, But if her mood becomes a probelm you can make it better by letting her play after school. Her mood can help with some classes or make it harder, try to make the best of her moods.  For the story I don't have a lot... Because I haven't beat the game yet. but I got far to at lest see most of it, as a young girl try her best to make things better for the good of all people you see a lot of story as you meet new people and see old friends. But sometimes you see some of the games evil characters who are mostly just ?????.  Main Character   Let's start with our lovey princess elodie, Even if I haven't beating the game I still love this character the most. she has a heart as big as the moon, has love for her people, and has a mind open to what's going on in her world. but I sometimes feel odd about her, When her mood is sad she will have a sad look on her face wich makes me feel in a way sad for her, When her mood is angry she have a ???? off look as if she going to slap my face hard, But the worest is when she is afraid... she will have a face the looks as if i'm about to her in the bedroom (and it dosent help that theres a bed that can have two people in it behind her.....) But still a Very cute and lovey character &lt;3  Achievements   Most of these achievements make you have to play through a lot of the story to get, but some are esay to get, one you can get very early in the game. Thats really all i have to say about achievements, I didn't play this game for them, I just played to see elodie...  Cards and Badges   This game has a lot of cards to get, but it's not that bad... in fact it's fun to get badges in any games! I wish I had a Long Live The Queen Badge, I haven't see any of them yet. The Cards have some pics from the game, I don't always trade, but when I do, I trade cards.  TL;DR  Game of Thrones if it was a visual novel.",
            "review_score": "1"
        },
        {
            "review_text": "You start the game off as a completely ignornant princess whose only noteable skills is being able to talk, walk, and see people. As you slowly progress up skill trees you will unlock more clothes, and become smarter than other people to the point when they will start trying to kill you.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is probably like Maple Syrup. You will either love it or think its garbage. The game has a lot of depth but that depth is unexplained or maybe buried in a manual that I didn't read. The replayability of the game comes from trying to figure out the game mechanics to influence a different set of outcomes for set events.   I played through a couple of times but got bored becuase I didn't feel like grinding events to learn the formulas under the hood and I the non randomized events made it feel like a choose your own adventure book where you have to keep reading the same events over and over again till you trained your character to 'beat' the event the way you want it.  Personally not my cup of tea but i personally love folks who would ♥♥♥♥ over that kind of game since there is a lot of replayability in that you can become Queen via lot of different methods or so I am told and read. If you can pick it up cheap and what I just said doesn't scare you then I recommened. ",
            "review_score": "1"
        },
        {
            "review_text": "Long Live The Queen is a game with a fantastic setup and promising mechanics. It sounds fun on paper, and the writing, art, and concepts for how the game works mechanically are all pretty great; in the end, though, I just found it frustrating to play. I'd still recommend getting it on sale if the theme, premise, setting, and art are all up your alley, because you'll definitely enjoy yourself at least somewhat... but I feel like the game could've been so much more if it had leaned more into the role-playing as opposed to the tired visual novel idea of playing the game over and over again, getting tons of Bad Ends, in order to get even one Good End.  On your first playthrough, planning out classes and trying to balance Elodie's mood seem like super interesting mechanics and if you're into the aesthetic of the game and the stuff you saw in, like, the Steam trailer and screenshots, you'll be thinking it's like the greatest game ever. The writing is great, the way taking classes shows you a brief overview of the progressively more advanced topics you're learning in a given subject is neat, and man, like everything about the presentation of the game itself is fantastic.  You notice as you play along that you're failing like every single skill check. You might even be like 'aw man, I missed this Poisons check? Better bone up on Poisons' — only to find that you'll like never need Poisons again for the rest of the game. (Disclaimer: I have yet to complete a successful runthrough of the game, but have spent over three hours of time in the game according to Steam.) Then you'll die from something out of nowhere that you could've never seen coming and prepared for on your first time through.  'Okay,' you think, 'I'll give it another shot. This is clearly just a mechanics'd up visual novel, anyways, so I guess I should've expected hell of Bad Ends.' On your subsequent playthroughs, you'll attempt to adjust your class schedules accordingly such as to allow you to pass checks for events that you now know are coming up from your previous playthroughs. Then, when you train for a key class, you'll get little-to-no skill points from it because you weren't watching your mood. Or worse yet, you were watching your mood and thought to make your princess as happy as possible because she starts the game all sad and depressed over the death of her mother, but as it turns out some class you wanted to take does barely anything or nothing at all for you because of the mood you're in. You search around the UI and try and find some sort of reasoning for which classes are affected by which moods — and it turns out that there is no such thing (although they [mostly] follow some sort of logic). Instead, you must either figure out which classes are affected by which moods on your own and write them down in a grid on a piece of paper... or just check the top-rated Steam guide for the game.  Basically, in the end, the game becomes more of an exercise in replaying the game over and over and learning from your failures, taking notes on what worked and what didn't, in order to come up with a plan to make a successful run through the game. If this sounds appealing to you, that's fine; I was hoping for a much more role-playing-oriented experience out of the game, myself. Again, I understand that it's a relatively short game once you have the path for 'the right run' down, and the length of the experience comes from the act of replaying it over and over again, and also it's just a more mechanically-dense visual novel, when it comes down to it. These things are all fine, but it's just not quite what I hoped for given the promise of the game from the outset and the great writing the game has and such.  In summary, I feel like the game has a great setup, great art, great writing, average sound and music, and great mechanical premise... but just kind of crappy actual mechanics in the end. It's still worth playing if the theme and setting and stuff interests you, and even more so if you're willing to put up with the visual novel tropes that make several, several playthroughs a must if you want to see a non-death ending... but at the end of the day, I personally wound up finding the core gameplay systems to be frustrating and poorly thought-out.  ★★★☆☆",
            "review_score": "1"
        },
        {
            "review_text": "It's quite hard, as many have already told you. I honeslty wish there was some kind of option to make the game just a little bit easier so that more people could get into it. But that should be just an optional add on so that people who want the authentic experience can still get it. Still, if you're good at planning, you should purchase this game. Managing to survive feels AMAZING.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 game. Ability to become magic girl is unmatched, be a pretty princess today.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone wants to kill you. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I tried a few runs of this game, but it got tiring and predictable. So I took a break from it for a week, and it still felt predictable!   Maybe that has to do with it being a life sim, where direction of the game depends entirely on success/failure of certain events based on the skills you've chosen to train up to when the event approaches. The problem is that it's the same event everytime, so the game is repetitive to absolution.  Don't buy the game - you can watch someone else play it on youtube, but even that gets boring. The writing is terrible, and music isn't anything special, and the graphics are still images with no animation. The drawings are cutsie anime you can find anywhere.  Fun for maybe an hour, but it has no replayability and the game simulates difficulty by arbitrarily failing you at every moment.  Skills range from 0 - 100, and most things require 50+ skill to succeed, so the replayability lies in how you construct your princess and finding out which skills are essential to avoid death in the first place.  So yeah, not worth what I paid.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a big fan of the type of games and don't get me wrong, I'm not bashing the game or say it isn't entertaining (I'll probably play it again, once the bitterness of dying because I don't own a dog while being the equivalent of an archmage subsides).  The thing is, when I pick up a game like this one I expect to have fun discovering the multiple endings it contains, not trying my hardest not to die and then find out which ending I end up with. I understand the concept of the game is to 'live different lives, learning from last time's demise', but when I actually played it just felt like a game of memorization; the story is kind of generic and there doesn't exist much foreshadowing in it. There should be something in the narrative that tells me certain skills might be necessary in the future, but instead it's just a game of trial and error, which becomes tiring after a number of playthroughs.  My biggest gripe is that most events happen out of the blue, and as the story progresses they need bigger and bigger skill checks. The problem with this is that if you neglected said skill (or group of) you're toast; you were practically dead 10 turns ago, but you just have to keep playing until the game decides to kill you.  Seeing the tweaks that have been made to the game, I believe that something could be done to help the gameplay without straying from the concept of the game. For example, starting a new game from a previous death while inheriting a part of your previous skills would make sense, while also giving it genuine replay value (other than having a list of 'things to study by turn X to not die').  This is a game for the hard-core and can actually be pretty entertaining if you enjoy that 'grinding', but I wouldn't recommend it for everyone because of said reasons.",
            "review_score": "-1"
        },
        {
            "review_text": "I started out as such a hopeful little pre-queen. I learnt the things I should, like how to talk to nobles like you care, how to courtsey gracefully and hide your eyerolling, how to stare down a room full of judgemental arses...   Sadly I didn't think, didn't know. And how could I?   How could I know that I, as a beautiful and elegent young princess, would ever need to know how to climb? Or falconry? ...Or reflexes ...divination ...battlefield medicine?!   Oh come on! What the hell do I pay you people for?!   Does no one check for poison these days? What were those scouts doing? Lounging under a tree? Did the carriage pass them at all on our merry way into that ambush? A peasant uprising??? Why was I not alerted earlier?! That's it. FIred. You're all FIRED! I simply cannot work under these conditions!   So many failed skill checks...   Would definitely die again.",
            "review_score": "1"
        },
        {
            "review_text": "Yes.  Yes. Yes. Yes. Yes.  Do not let the graphics fool you. This is one hardboiled life/kingdom simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is the kind of game that takes the visual novel genre and makes it into something that's both frustrating yet fun. Similar to the Princess Maker games from Japan, the goal of the game is to aid Princess Elodie into Queendom so that she can continue looking after the realm. You do this by making decisions for Elodie and deciding which classes she should attend (2 per week) in order to polish her into a tru gem. Of course, it's not as simple as that.  The story has multiple endings and many twists and turns which often evolve in the death of our dear Elodie. Commoner uprisings, magical wars and coups are all parts of what you have to avoid running into whilst hoping that along the way someone doesn't try and trick Elodie into eating poisoned chocolates.   The game is fun with a lot of decisions but can get frustrating after seeing Elodie stumble at the same hurdle over and over again. Gameplay is literally using a mouse to pick decisions but the interactivity of the story makes up for it. The additional clothes for Elodie are a nice touch. If you're an achievement hunter there are plenty of achievements to be found, and as there are different storylines there's a lot of replaying that can be done with satisfyig conclusions. Towards the end when you have almost 100% it can get tedious going through the same story again and again, however.  Overall this game is great in any collection and not just for girls. :) Long live the Queen!",
            "review_score": "1"
        },
        {
            "review_text": "I never really gave any thought that i could be a lesbian princess, guess what, i became a magical lesbian princess. You wouldn't belive that this was set in the same universe as star wars and star trek, well you suck then, clearly you could've seen eowks in the forest fighting vulcans with lasers and phasers. 10/10, a magical experience. No unicorns though, so the story gets a poor score of 1/10.          Jesus ♥♥♥♥ing Christ, you can really make her a lesbian by the way.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine a game that is the apotheosis of all games, a brilliant fusion of story and mechanics and art that leads you to new emotional catharsis when you replay it every year. The game also washes your dishes, files your taxes, and reminds you to call your mother on her birthday.  Sounds like a game worth having, right? But what if it cost $10,000, along with half your hair, both your index fingers, your favorite toe, and the promise of eternal agony in your least preferred afterlife? It's probably not worth it then, right?  Long Live The Queen is a game that is not the apotheosis of all games. As such, I'd judge its non-sale Steam price of $9.99 as too high. But if you buy it for $1.99 during a sale, then I'd say it was definitely worth it.  At its heart, Long Live The Queen is a choose-your-own-adventure about a princess hoping to survive to queendom. It has the added twist that each day, you choose two of 14 classes for your princess to take - classes ranging from Royal Demeanor to Climbing to Military Strategy. Story branches appear and disappear according to your choices, and it is easy to end up impaled by a sword or punctured by arrows or eaten by krakens.  This has reasonable amusement value, one that does eventually wear off; laughter turns to snickers turns to forced grins. Fortunately, by the time I reached the eyeroll phase, I judged my enjoyment of the game up to that point to be worth roughly $2.61. Which meant that I did more than break even on this game. Hooray!  ------------------------------------------------------------------------  Arrow in body Please do not push further in Your organs thank you",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically a turn based 'choose your own adventure' game executed as a visual novel, with some roleplaying elements.  You start as a 14 year old princess, soon-to-be adult ruler of your kingdom. You have to make it to your 15th birthday in order to be crowned as Queen. That's in 40 weeks. Basically 40 turns of learning skills, managing your mood - which alters your efficiency to learn certain skills - and reacting to situations. 40 weeks to survive to be the Queen!  Some elements are always present - your mother deceased recently, and you start out as depressed (thus you're more tuned to learn artistic things than conversations initially), plus your dad asks you about state affairs sometimes. Some come random to bite your cute royal bottom - like a box of suspicious but very delicious-looking chocolates, or an invasion. Certain things - such as magic - should be earned first and then learned by hard work.  Adorable protagonist, nice atmosphere, some UI quirks, jokes and references, little unlockables, gameplay mainly driven by trial and error. It's a rather lovely game if you have the eye for it, but if you don't like CYOA or visual novels you're in for a letdown.    Here is an official video   showing much of the game's UI.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, fairly addictive   Don't eat the ♥♥♥♥ing chocolate",
            "review_score": "1"
        },
        {
            "review_text": "M'lady *tipping intensifies*",
            "review_score": "1"
        },
        {
            "review_text": "Death by chocolate. poisoned but still!  10/10 would eat again",
            "review_score": "1"
        },
        {
            "review_text": "A nice Dark Soul-ish game suitable for one sitting. Main complaint is the lack of diversity in ending, as there is only around one path to end it with too little variation. Many of the traits only have completionist uses, and since I tend to be more casual, this is also not a great quality. Also, the game is short, and I was expecting around at least twice as much main gameplay with restarts. Don't get me wrong, this was a thoroughly enjoyable game with a lot of thought put into the side missions. So if you like being a completionist or enjoy seeing all your hard work end abruptly (which IS humorous the first few times), or if you chust want to chill out to the AWESOMELY relaxing music, then this is a must.",
            "review_score": "1"
        },
        {
            "review_text": "Summary: Princess Maker without dungeons Multiplayer: No Completion: 9 hrs Cards: Yes Cloud: No  The Princess Maker games are a series of time management games that never saw an official US release. Despite the obvious aim towards girls, they are enjoyable enough in their own right to appeal to broader audiences. A handful of indie games were inspired by them, and this is one such game.  In Long Live the Queen, you spend each week selecting classes to raise your stats. Intermixed with the training are story events that take place throughout the game. Interestingly, there's nearly always something new happening every week, and the majority of events require stat checks in order to pass/fail. These checks are not telegraphed in any way, so the only way to know when to expect is to observe them happen, and then jot them down. These events are not random, so you can and must prepare accordingly, as the stat checks climb very high very fast. Because of the high stat reqs, it is ill-advised to spread your points thin, as you would soon be unable to pass anything. This sort of playstyle is a bit... odd. It nearly guarantees failure for any first time player because there's just no way to know when you might get shot or poisoned the first time around, and thus no way to know how to beat it.  A rather odd amount of plot is devoted to political intrigue. The game throws dozens of names of countries and nobles at you, most of which you never see or meet. I find it difficult to care about the politics of other countries when I've never visited it nor met its citizens. The game would rather tell you two countries not getting along, rather than show you two people arguing in court. To help curtail the politics chatter, I would have liked more opportunities to interact with other NPCs. Maybe a gathering location such as a tavern for allies would have been nice.  A few skills seem to be of remarkably little use, such as some weapon skills. There seems to be a heavy bias towards practicing your magic. I wanted to create a warrior queen who rules with justice and might, but it doesn't seem to be an option.  Sadly this game does not possess the dungeon crawling aspect of some of the Princess Maker games. Thus the whole game boils down to your ability to play trial and error, as you aim to survive, and ultimately win. The dungeon crawler would have been a fantastic use of combat-related skills.  Long Live the Queen is enjoyable enough, and I seem to be drawn to these sorts of time-management games. It's a curious exercise in optimization, and despite the high likelihood of dying, is very accessible and easy to pick up and play. I rate this a 7/10. Not bad at all, but could use a few cool touches.",
            "review_score": "1"
        },
        {
            "review_text": "I eventually succeded at becoming the queen by becoming a grand archsorceress who solved everything blasting it away with magic.  Commanding from frontlines? Blast things with magic. Challenged to a duel? Blast the guy with magic. A peasant revolt? Blast them away with magic. Another wizard wants to get ♥♥♥♥ on you? Blast the ♥♥♥♥er with magic. A relative was plotting against you? ...Send assassins.  And in case someone tells you manners and etiquette aren't worth ♥♥♥♥, ask them how they plan to survive poisoned chocolates.  10/10 Best Socreress Overlord simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Became a super spy princess. Died. Became military mastermind and killed all in my path. Died. Became a magical girl. Died. Became a princess who only cared about dogs and singing? Sang my way through politcal hazard and caused my enemies to give up on war through the power of music.  10/10 would become a queen again",
            "review_score": "1"
        },
        {
            "review_text": "Don't get fooled by the ♥'kawaiiness'♥ of the main character. This is a very complex (and hard) game with multiple posible endings. Unless you hate reading, you should buy it. If you like visual novels where the decisions you make have consequences this is a MUST.  And it's incredibly cheap right now because of the Summer Sale, so ♥ BUY IT! ♥  +You get 6 trading cards - Avoid if you hate reading.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Don't let the graphics fool you, they represent a statistical engine that has some rock-solid legs. The developers are pretty well-known for this exact sort of game, and if anything then they've got the formula down to the dot by now.  It's not Democracy 3 level of stats, but couple the stats-oriented gameplay with well-written story that is activelly affected by the stats that your character has, and I'd say that this is one of the competent games in this genre. The price-tag I'm not wholly sure about, I've only played around three hours (on laptop, offline) and don't know how long the game is.  To fans of the genre: you know how there are good games like this and bad games like this? This is one of the good ones. You'll like it.",
            "review_score": "1"
        },
        {
            "review_text": "well... crap.  I remember a very old game for the late DOS era called Princess Maker. I saw this and knew it was an obvious reimagining of the same idea. I never really played visual novels before, but after two hours into this experience I was enthralled. So simple, so stupid, there's no reason I should have enjoyed it as much as I did. Limited ability to fill your wide assortment skill sheets adds for some incredibly demanding replay value as you'll wanna keep seeing what happens differently. If you're a fan of anime drama and comedy like I am, you'll probably love this. If this isn't your flavor, by no means will it change your mind, but it's a ton of fun and a great way to relax. Heavy action games are great, playing online with friends is great, but here it's all about interesting decision making. It's silly and cute to fault and some of the writing is just plain duimb, but that's the charm of it. it's a surprisingly entertaining experience and an easy recommendation for people who like anime comdies and or old PC adventure games.   ...long live this game",
            "review_score": "1"
        },
        {
            "review_text": "I tought this was some cute game full of cute girls. And maybe some cartoon porn. My cute princess was killed in 6 different ways in the 3 hours I tried this game out.  Don't kill my cute cartoon girls. It makes me sad. 4/10  ",
            "review_score": "1"
        },
        {
            "review_text": "this is a nice little time waster. The visual novel aspect is relatively interesting, as is juggling all the different stats. The game tells you what skill checks are being used so you can see how to pass them next time around if failed.   The most interesting part in my opinion is the story branches. Choices made at certain parts of the story will drastically change how things play out!  I've died many times on the way to the ending, and only have successfully completed one run (in which i got quite a negative ending due to mismanagement of my kingdon)  All in all, give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "Great story that will make players to keep trying to get a happy ending.   P.S. interesting music choice for the title screan. Why use a instrumental version of America My Country, 'Tis of Thee for a game about monarchy. America stands for liberty, demorcy, and freedom. Not a pricess taking her mother's queenship.  USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA! USA!   ✰✰✰✰✰✰✰============== ✰✰✰✰✰✰✰============== ✰✰✰✰✰✰✰============== ======================= ======================= ======================= =======================",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with a lot of replay value. It can be hard at first but as you play through it more you begin to learn what skills you need for each run through the game.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, if slightly frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "A nice little game that is more than the anime-style appearance might suggest. It will probably take you a couple of tries to get your princess through the whole thing alive. Although seeing her finding another way to get killed is just part of the fun. Even if you got her through alive and still hold the crown, there are a lot of other secrets to discover in your next try. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a hilarious little gem and death has never been so fun.",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend Long Live the Queen enough. You play as the princess of a kingdom during the year before she ascends to the throne, and you have to survive long enough to get her there. It's essentially a text-based RPG at it's core: you level up different skills every week and as you progress through the game you're met with different checks of those skills. (For example, you can't retrieve an item from the royal treasury without a high enough 'Presence' to intimidate the guards).  The art is beautiful, the story and worldbuilding are very good, and it has a very good amount of replayability due to all the various different endings you can get and ways in which you can get there.",
            "review_score": "1"
        },
        {
            "review_text": "Pink Princess kills everyone with magic. The end. Kind of.",
            "review_score": "1"
        },
        {
            "review_text": "OK...I know you're looking at the screenshots of this game and thinking that it's some paper-thin fanservice-filled visual novel. If you give this game a chance though, there's actually some really cool stuff going on here.  Guiding princess Elodie through the treacherous weeks prior to her coronation ain't easy. There's at least as much danger here as there is in any given episode of Game of Thrones - civil war, peasant uprisings, assassins, wizard kings...you can rest assured that you'll die many times in many ways before you finally see the crown placed on her head, but with proper time/mood management, some trial and error, and good educated guessing, you can succeed.",
            "review_score": "1"
        },
        {
            "review_text": "Very happy surprize, this game is addicting and well thought out. I honestly wasnt expecting this a all around winner and at this low of a price its money well spent!",
            "review_score": "1"
        },
        {
            "review_text": "While it may seem daunting, the game is really very good provided you're into that sort of thing. A largely story-driven affair, I really enjoy my time playing this one. If you've played through visual novels before, a large portion of the game will be familiar to you, with lots of reading alongside static images. The neat part comes from leveling up the skills provided to the princess. Often with games of this sort, I feel that it's largely formulaic. Once you have the parts down pat, the game loses it's interest. Long Live The Queen, however, deviates from this formula by throwing random events in alongside the normal story's progression. While certain events will happen each playthrough, sometimes new things will pop up at inconvinient times because of your skill progression or previous choices; it really keeps you on your toes.   TL;DR: If you like reading and don't get frustrated by retrying often, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I've felt compleded to get 100% completion on, and even after I've unlocked all the achievements and died in everyway possible I still find myself replaying the game trying to see what I can do and the different ways to acheive different endings.   Highly fun, highly frustrating and very addictive Long Live the Queen is a wonderful introduction to the Visual Novel genre and the perfect game for anyone who's ever wanted some Game of Thrones in their Magical Girl Anime.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting and addictive. I could play it for hours. Anyone who likes roleplay kind of games, games that react to your decision or just a cool anime style, this game would be perfect.",
            "review_score": "1"
        },
        {
            "review_text": "They let a 14 year old execute a member of the royal family. Then i was killed by an arrow on my way to my friend's birthday party. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't get fooled by the ♥'kawaiiness'♥ of the main character. This is a very complex (and hard) game with multiple posible endings. Unless you hate reading, you should buy it. If you like visual novels where the decisions you make have consequences this is a MUST.  And it's incredibly cheap right now because of the Summer Sale, so ♥ BUY IT! ♥  +You get 6 trading cards - Avoid if you hate reading.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on a whim because its not very expensive but it was actually shockingly fun. Most especially when I had a friend on facebook at the same time to tell him all of my awful decisions as Queen, like Bludgeoning a criminal to death in the castle courtroom or neglecting all social mannerisms in favour of war XD I think I make a wonderful Queen and I think this game is worth it for the comedy value alone, except not only that but I did find a number of the characters endearing and everything matters so it has a lot of replayability. Love this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "(ﾉ^ヮ^)ﾉ*:・ﾟ✧ being loli princess meguca is suffering (ﾉ^ヮ^)ﾉ*:・ﾟ✧",
            "review_score": "1"
        },
        {
            "review_text": "10/10 IGN would die again...and again...and again...and again.",
            "review_score": "1"
        },
        {
            "review_text": "At first, I was interested in the style of game this was. When I finally got it, I truly found it interesting to play. Now that I've been spending hours on this game, I'm interested on how this game has made me raged so much. You think you're doing things right, and then you eat a box of poison chocolates, or shove an arrow into your body, or fall off a tree. It is also the only game that has made me said 'I think this time, I will try to be a smart and aggressive princess.'",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play, easy to die, hard to get the endings you want.  Recommended if you want a game to pass the time and don't mind restarting everytime you die .",
            "review_score": "1"
        },
        {
            "review_text": "This is a hilarious little gem and death has never been so fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you can't handle the idea of dying a lot then this game probably isn't for you. Personally I think that's part of the game's charm. Finding new ways to die makes 'winning' all the more attractive when you finally manage to dodge every death threat that comes Elodie's way.   If you like this game I would suggest looking into other games put out by Hanako, because in my experience most of them have been fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Not very big, but has a lot of replayability. It was realyl fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game wherein you marry 14-year-old girls to old men so they don't kill you. Wait, no: it's a game where you sacrifice bouncy-haired teens to sea monsters so they don't kill the world. Hang on, no: it's a game where happy boarding school BFFs are pressured into war by dominant neighboring political parties and forced to kill each others' family. It's cute and full of anime dressup magical girl nonsense. It presents a fantastic difficulty cliff upon first loading, but the kind where you don't know you killed yourself until twenty minutes later. And when you do manage to stumble over victory, there really isn't a lot of incentive to noodle around with it any more.  These are all reasons not to recommend this game. That is not what I am doing, because damn it, I watched Sailor Moon as a kid, and played Princess Maker, and had Barbies, and wanted to grow up to be a fairy supermodel rockstar princess. This kind of make-believe, aged gently so as to avoid being insufferably simple, is embarrassingly welcome.  Wonder if I'm too old for princess camp...",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the most excellent death simulator I have ever played. Not only can you die by your own stupidity, you can be killed in battle, drowned at sea, blown apart with magic, or stabbed! This is only a small list of the many different ways that you will die in this fantastic game! If you'd like to find out what true aggrivation is, then play through this game without saving! I promise you that it will go swimmingly! (And by swimmingly, I do mean you'll drown. Sometimes.) Now I don't wish to ruin anything for you, but I must say this; should you think you'll win this game easily, than I warn you, keep some form of stress releaving device nearby, be that a kitten in a toaster, or perhaps something less grim, like a standard punching bag you may stab with a kitchen knife repeatedly.  In all seriousness, this game is fantastic. The story line is very indepth, and every small choice you make makes a larger impact on the overall story. I have yet to beat this game, and doubt that I will anytime soon, and very much enjoy the many hilarious, and sometimes gruesome deaths that I stumble upon. However, the Earl of Lo can suck it, as I hate him with all passion and anger and greed and any other emotion applicable to hatred.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly addictive and fun!",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun, lot of replayability, and clever humor. You have to be on the ball though, cause even if you think everything in hand, you find out you don't. Surprise buy and won't disappoint. ",
            "review_score": "1"
        },
        {
            "review_text": "Long live the queen appears to be a very childish, and little girly, understandably. Though this is only on the surface. Long Live The Queen has you taking the role of a crown princess weeks away from her coronation. As weeks go on, you take classes to make you better in certain skills, eg. Swords, Elegance, Strategy, Trade etc. All of this needs to be carefully planned out. As not having proficiency can screw you over in some sense. Every decision you make on this game can come back to bite you in some way, and even kill you if you are unprepared. Only coming in with a short 4 hoursish of gameplay on the first completion, with possibility for reruns the 6 pound price tag still ends up being worth it.  Long Live The Queen - a suprisingly enjoyable and interesting game offering a quality experience. I can only hope for a sequel. If indirectly managing a kingdom is your sort of thing, then Long Live the Queen is a solid pick for you.  Rating- 7.5 Out of 10  Very Good",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore stragegy, however not sure if this is really worth the price. It's a bit better if you like text-based games, and follow the story closely.",
            "review_score": "1"
        },
        {
            "review_text": "This is both a fantastic and addicting game, i absolutely love it and i'm sure you will never regret buying it, i 100% recommend it =D! Replayability is also a strong point of this game even though it's not randomly generated each time you play, there are lots of ways Long Live the Queen can be played and beaten so you will inevitably play this for a long long time! If you like Anime this is probably the game for you, plus it's story is really well made! Also, this is more of a personal thing probably, but Long Live the Queen is helping me cheer up a bit in a period where i'm always depressed, angry and lonely and i'm smiling a lot more since i started playing this game! Maybe it could have the same effect on someone else with my same problems, who knows =).",
            "review_score": "1"
        },
        {
            "review_text": "Great game, all diagloue based. The game itself isn't very long but you will likely die the first time and it is well worth playing multiple times as each time you can make different choices and start to figure out more of the overall story. It is definitely not possible to figure out everything in one playthrough. Even with multiple playthroughs it doesn't take long. The game really follows the choices you make.",
            "review_score": "1"
        },
        {
            "review_text": "Don't mistake this for a silly, cute magical girl/princess game. ♥♥♥♥ GETS DARK REAL FAST. still fun though",
            "review_score": "1"
        },
        {
            "review_text": "Cutesy 'Princess Maker' meets brutal 'Game of Thrones'! This game is a deconstruction of 'dream to be a princess'. Good luck with that.",
            "review_score": "1"
        },
        {
            "review_text": "A life changing experience; i laughed, i cried, but then the fire nation attacked",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great reimagining of the classic 'Princess Maker' series.  Great slow-paced gameplay where all decisions you make will have an effect on the intricate story. Death and betrayal looms at every corner in this almost rogue-like fluffy-pink game of thrones.",
            "review_score": "1"
        },
        {
            "review_text": "Game is great fun adn interesting game that you can play for a few minutes or a couple hours! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Quite fun, hours of replayability, and an overall interesting story. Anyone who likes games of this genre should get it now! Oh...and she has outfits for all your loli obsessions &gt;.&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Just a great VN, might be one of my favs. Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "je my curiosity got to me and it was worh it. ver nice game simply done and fun to try and get your brain dead princess to become a queen. loved it. GG",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for a mere 2 hours, but already I can see the appeal of it. It is both great in story telling and in gameplay? I would reccomend this to anyone who is out there looking for their new waifu. desu desu kawaii",
            "review_score": "1"
        },
        {
            "review_text": "Addictive, that about sums it up, you'll try something and it'll fail, you'll refine it and it still fails. Then you hit that sweat spot and it all comes together...but what about that path, that option, that missed check....what else is there out there....buy it and see",
            "review_score": "1"
        },
        {
            "review_text": "First play : 'oh it's like princess maker' 5 mins into game: 'oh noes so many options but so little time' 20 mins into game: 'SAILOR MOON TRANSFORMATION- I WILL PUNISH YOU IN THE NAME OF MOON' *breaks into laughter* 50 mins into game: 'ahh i died Dx' *scrolls back and chooses another option* 'oh noes i died again ;---;' ^ forgot to save. gaddam D&lt; Second play: 'I will beat that **** this time with my newly trained skillz &gt;:3' ^HAH *changes storyline* TT",
            "review_score": "1"
        },
        {
            "review_text": "anime is hard as ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the art style fool you, this is quite a complicated and rewarding game where many choices could have massively huge effects later on.",
            "review_score": "1"
        },
        {
            "review_text": "I can dance.  I can jive. Having the time of my life. See that girl watch that scene. Diggin' the Dancing Queen. Friday night and the ligths are low. Looking out for a place to go. Where they play the right music. Getting in the swing. I've come to look for a king. Anybody could be that guy. Night is young and the music's high. With a bit of classic music, everything's fine. I'm in the mood of a dance. And when you get the chance. I am the Dancing Queen. Young and sweet only fifteen. Dancing Queen feel the wave from the violin. oh yeah. I can dance.  I can jive. Having the time of my life. See that girl watch that scene. Diggin' the Dancing Queen. I'm a teaser. I turn 'em on. Leave 'em burning and then I'm gone. Looking out for another. Anyone will do. I'm in the mood of a dance. And when I get the chance. I am the Dancing Queen. Young and sweet only fifteen. Dancing Queen feel the wave from the violin. I can dance.  I can jive. Having the time of my life. See that girl watch that scene. Diggin' the Dancing Queen. Diggin' the Dancing Queen. I can dance.  I can jive. Having the time of my life. See that girl. Watch the scene. Diggin' the Dancing Queen.  10/10 would dance again.",
            "review_score": "1"
        },
        {
            "review_text": "A good game showing you how many ways a 14 year old girl can die.  14/10 ",
            "review_score": "1"
        },
        {
            "review_text": "wow i managed to singlehandedly insult nearly every noble there was  gg",
            "review_score": "1"
        },
        {
            "review_text": "This game is very involved, and as simple as it seems, you could die at any time.  CONS:  1) It's very easy to fail 'tests' as you really don't know what you need to study and what you can ignore. And then, by the time you realize what you should be doing, or are pre-empting your inevitable and impending demise, it throws a curve ball and you die, having not had high enough stats.  ****No voice acting: Not really a con, but I would have loved some voice-action through Elodie, at least. Maybe that's just me.    PROS:  1) Visually appealing: Very nice art style. Simple, clean, and very polished.  2) Interactivity: Highly interactive, without taking itself too seriously.  3) Difficulty: It's not easy, and that's great. It doesn't hold your hand, and it makes you take responsibility for your choices, and actions, from start to finish. Elodie's innocence and ignorance are in your hands.  4) Replayability: Endless.  5) It's got everything: Medieval themes, magic, anime, intrigue, trade, relationships, etc.   FINAL THOUGHTS:  Do I recommend? What do you think?  Hell yes! :D LONG LIVE THE QUEEN!",
            "review_score": "1"
        },
        {
            "review_text": "I've finally been compelled to leave a second review... Adorably addicting: my Achilles' heel. I was surprised how long it took me to die—especially after reading some other reviews—but the chocolates finally did me in.   Sounds about right.  Reminded me a little of Princess Maker 2, except it doesn't take as long and is actually fun throughout. And, unlike PM2, I did not feel empty, unpleasant and generally dead inside when I was compelled to start a new game after not getting an ending I wanted. So there's that, too.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game may seem like a nice, bubbly princess adventure, but don't let that fool you. It's a ruthless, backstabbing survival game painted pink and wrapped in ribbons. Every action will determine whether or not Elodie lives or dies in one of many creative ways. Like poisoned chocolate. -_-",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Art, Nice Music, And Fantastic Outfits. Definitely Worth Buying!  Personally for me I find Super MeatBoy Easier than this.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute delight, blending squeaky-cute anime style with a surprising amount of violence and cutely-stylized death at every turn. This is a game in the traditional 'raising sim' style, though you're more or less left raising yourself, in the role of a princess on the cusp of her coronation to queen. Naturally, political enemies and conspiracy dog your heels at every turn, and you'll have to balance your stat growth and story choices carefully. Even after multiple playthroughs and thinking I'd more or less seen it all, there's actually a ton of content to this game that can be unlocked by various twists and turns of your choices. There are also some points at which it even rewards you for paying attention to the rather copious amounts of setting information that the game throws at you, sometimes (unfortunately) during somewhat easily-overlooked messages on reaching certain levels of skill. Understanding the relationships between the various governments and political players involved can give you a considerable edge in making your choices. Of course, it can be hard to separate the wheat from the chaff, as it's said. Still, it's a fun, breezy, easy-to-play game with a lot more to it than even a single full playthrough might indicate.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun, but very short and severely lacking. I beat it in less than a day. The game is basically like one of those old DOS command lines, but with a GUI. Instead of typing, for example /attack you would click a dialog on screen that reads 'Attack!' The story is mildly interesting, and mildly emotional. The dialogue gives you a good idea of what is going on. You can train Elodie in different skills. In one part of the game (minor spoilers, doesn't affect story) somebody sends you a box of chocolates that is poisoned. If Elodie is proficient in divination she will notice a bad omen and you will have the option of not eating the chocolates. If she has proficient knowledge in poison, medicine, or herbs she will be able to heal after ingesting the poison. If Elodie hasn't been trained in any of these things she will eat the chocolates and die. I really wish the game would continue past coronation. It is very fun and entertaining, some of the battles and dialogue is really intense and gets you going. It stops short, however. It would also be cool if there was more visual feedback. Instead of: 'A fierce battle rages on. elodie makes lots of explosions with her magic and bodies fly everywhere' it would be cool if there were animations that showed these things happening. Sometimes the battles can be difficult to visualize and it takes you out of the moment. That being said the game is very fun to play and I definitely recommend it for those who like command line or RPG games. It is very fun and I enjoyed it very much.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "This game will be mean to you. Serious. If you like to get beaten by a 'simple' game again and again and again and again this will be a good choice. I like it.",
            "review_score": "1"
        },
        {
            "review_text": "OMF I LOVE LLTQ IT'S MY FAV GAME OMG IZ FABU AND LOVE. CHED IS BAE ALSO AND WE PLAY TOGETHER.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen: Being able to order an execution and then playing with your toys afterwords! ;)   I believe many of us would agree, that there should be more visual novels like this one.",
            "review_score": "1"
        },
        {
            "review_text": "Building the stats of your queen is simple but finding all the paths and getting the right balance of stats to survive is delightful.  You're going to like this game if you like Way of the Samurai style repeated runs through a short game to find all the secrets and tricks, and there are several.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, but kinda short, it took me 2-3 hours the first run, with some loading when something went wrong. But after finishing it, i played a new game. And the next morning after waking up, another one. I enjoyed it, and totally worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Even though it's not quite my cup of tea, you can really tell that this is a work of love. The art is crisp, clean and very pretty. Interesting storylines and multiple endings are sure to keep you busy for a few hours at least.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live The Queen could be assosiated with a visual novel, but wouldn't quite fit the bill. The problem is that the events differs little when you chose diffrent skills for the princess, so getting diffrent endings can be quite tedious. Still alot of fun though ;)",
            "review_score": "1"
        },
        {
            "review_text": "This is such a great game, however you will probably have to save after every choice that you make, and a lot of the lessons you can learn are pointless. But overall still a great game of this catagory and I would highly reccommend it",
            "review_score": "1"
        },
        {
            "review_text": "I bring a message from the Princess, she will mention what this is all about. *clears throat* 'Hi there Player. I am Elodie, Princess but soon to be Queen of Nova and you must be wandering why I am sending you all this message.  I want you all to guide me to my coronation! But be careful, evil lurks around every corner, war, betrayal, love, hate and the occassional death upon my being. So all you need to do is guide me on what skills are needed in order to become an idealistic queen, whether it is peaceful or not! I look forward to spending time with you. Please lead me to my crown! From Elodie. P.S. I have currently 39 goals in mind, do you think you can get them all?' That is all she said, so enjoy her journey as you lead her to the crown. Do you have what it takes?",
            "review_score": "1"
        },
        {
            "review_text": "I CAN STOP WARSSSSSSSSSSSSSSSSS............mabey not chocolate BUT WARSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS   i like this game and you should to trust me this is the best anime noval i have played in a long time this is worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so frustrating and great ... If your into something that will mentall break you? Then yes buy the game. Though its eventually .... and I do mean EVENTUALLY rewarding ;U; though I have yet to get that far yet.",
            "review_score": "1"
        },
        {
            "review_text": "It looks pink, fluffy and easy but if you give it a try you will soon see that keeping your princess alive by teaching her the right skills at the right time is very demanding and tricky. Fortunately seeing all the various ways in which she can perish is half the fun because she will die. A lot.",
            "review_score": "1"
        },
        {
            "review_text": "In this simple life simulator you live out one year in the life of a teen princess who must grow up quickly to fill her mother's suddenly and sadly empty throne. There's a lot she'll have to learn, from accounting through decoration to military strategy, in order to even survive the year... and it's all up to you! Romance, intrigue, death and candy, all wrapped up in a pretty pink package! Recommended for everyone from manly men to little girls.  Every week you must choose what to study and how to spend your free time, and deal with whatever events and people fate throws in your face. Make no mistake: you will fail. A lot. You will die. A LOT. But you can always begin anew - or just load a saved game - making different choices and seeing how things work out THIS time. It's fairly addictive, really.  (If you ever played an old DOS game called Princess Maker, you'll know pretty well what to expect.)",
            "review_score": "1"
        },
        {
            "review_text": "I first hesitated a bit before buying this game and really, I have no regret. If you are fond of visual novels, I would recommend that game to you !  First of all, there are these splendid artworks and musics (I sometime paused the game to simply look or listen to them). They create the perfect atmosphere to lose yourself in the story. With every action you make, with every skills you improve, you learn a bit more about the history of the country, the links between the characters or some other facts.  There is then that cool strategy aspect as you have to choose between many skills to study, skills that may change the outcome of many events, help your Princess to analyze a situation... or simply to survive (You ate a poisonous mushroom ? Too bad you never learn about poisons and how to cure them). And to survive is going to be your priority because you will get overly attached to your Princess and furiously ask for revenge each time she dies (and she dies, many times !).  Many pretty outfits to wear, lots of difficult decisions to make and also many endings to discover... Good or bad ones ! If you like to explore all paths in a game and replay it again and again and again to try different strategies and unlock everything, you will love 'Long Live The Queen' !",
            "review_score": "1"
        },
        {
            "review_text": "Good text based, point and click adventure game. Cute graphics and music too. The type of game you play over and over.",
            "review_score": "1"
        },
        {
            "review_text": "I definitely had a lot of fun spending time on multiple playthroughs trying to achieve certain outcomes or even making it to the end seemed to be a challenge most of the time. A text-based game where your input creates the outcome, and sometimes even manage the manipulate some of the events that appear in game. Great to mindlessly waste some time in.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is a game that represents the nature of trial and error. Similar to the classic Princess Maker games that came out of Japan over a decade ago, I find that there is far more depth to this title. There are no random events in this game, as everything is scripted and outcomes are based on the decisions you make as you journey through the story. This does not mean the game is linear and lacks replayability by any means however, as there is a rather significant number of skills you can select to raise.  The flow of the game breaks down into three parts: - At the start of the week, you select two classes for Elodie to take which will affect which skills increase. Skill increases have a bonus or penality modifier attached to them depending on Elodie's mood. - At end of the week you decide what Elodie should do for the weekend. This is what affects her mood, and will therefore change the modifiers for skill increases the following week. - After you decide what will affect Elodie's mood, a scripted event will take place. You are also often given choices to take which adds further variety. These events are where checks are done on Elodie's skill levels, which will determine how events in the story may progress, or potentially how you may be led into an ending.  This event-check system allows for a variety of replayability as one learns the cause and effect of the actions you have made in both developing Elodie, as well as the decisions you make within the kingdom. For some this may be seen as a negative. Without replaying the game several times you will not know the most effective route to take in developing Elodie, and you are likely to fail many times on the way toward her coronation.  The flaw with the skill system exists in that there are too many skills with too few reward. Unfortunately certain skills seem to exist simply to confuse the player and draw attention away from developing far more important ones. Some of the skills may only feature one or two checks within the entire game, while other skills are constantly relied upon, and thus deserve the player's attention more.  The visuals of the game are very simple, but incredibly clean. The artwork is well done and everything is discernable. The UI is simple and works, though unfortunately I personally dislike the use of the right-click. While convenient for bringing up the save/load menu quickly enough, I would have preferred it to act as a back button, however that is personal taste and not a strike against the game itself.  The music is simple midi, but relaxing to listen to. Designed to have a regal sense to it, I find it is appropriate.  The endings are where the game shines. There are many endings, most of them being bad ends. The severity of the deaths Elodie may happen upon would shock anyone who is not already familiar with this title, from being poisoned, to run through with a sword, to being taken out by magic. There are a variety of deaths awaiting Elodie if the player fails to consider the future and does not prepare the future queen for what is to come.  Long Live the Queen is a fun title that I do recommend playing through, however it is not without its flaws, specifically in regard to what I mentioned about skills above. I only recommend making the purchase at a more reasonable price point.",
            "review_score": "1"
        },
        {
            "review_text": "i was gifted this.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game. Be prepared to lose repeatedly because 'oh no, you didn't put 100 points in magic, and ALSO naval strategy!'. Still really fun to click through despite being anime and dumb.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty, but terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Harder than FTL.  Watch out for chocolates and cats.  22/17",
            "review_score": "1"
        },
        {
            "review_text": "Sort of boring and over-complicated. Maybe it's just me, but playing without a guide is sheer misery.",
            "review_score": "-1"
        },
        {
            "review_text": "For the pricepoint, Long Live the Queen is cheaper than a movie and thus worth it.  Starting a review talking about the price is never good, and while this game tries its best to appear to be a nonlinear fantastical rpg story following the trials of a little girl turned queen-to-be, it falls flat on several key factors.  Overall: B- 'A neat game for a few hours.' - I enjoyed it because I got to do crazy ♥♥♥♥ and then die. That's about it.  - The story is mediocre with very few nonlinear branches. There are several true endings (assuming you make it through alive), with very little deviation, though honestly, as far as I played the game, there are really two endings, both decided on a hidden value: your reputation with the common people. This was rather disappointing to learn once I got to the 'end', but there were two bigger concerns that I had.  1) While appearing to be unrestricted in deciding whether or not you wanted to play with your toys all day or finally go learn magic, the game is actually extremely restricted by the scripted series of events that occur. Technically there are several ways to advance through each scripted event and avoid failing, but I found myself forced to pick just one of two ways (such as getting agility or some other skill to avoid the scripted assassinations) which led to the same event conclusion, with little deviation. I never was truly free to just be a socialite with a little bit of combat knowledge - I was pretty much forced to level my combat knowledge just to advance in the story. While disappointing, I still initially had fun doing whatever the hell I wanted and dying before finally buckling up and trying hard.  2) Dying is a main sticking point to this game, and to truly experience all the well written scenarios, one must setup a specific strategy path to get to that point, often beginning from Day 5-10. At one point, I had 12 save files just to reach different types of death scenarios around that one war, only to be unable to advance 11 to the conclusion of the game. For example, I really wanted to sing my way out of this one part, but it turned out I needed 100 rating in voice to get there (among other things), leading to a very specialized decision tree. Of course, this led to me being deficient in other areas and unable to get much further in the game. This was the same for my other 10 paths, with only the 12th decision tree being the winner. This was rather upsetting. Why can't I sing my way to the end?? Blah. (Obviously I'm aware you can, but I didn't feel like restarting my game.)  Significant Opinions:  Music: B - It's a short story game with a few different arrangements. The main piano theme got repetitive on my 120493th attempt.  Art: A - Anime-styled, not really anything amazing. Still gets an A for effort.  Replay Value: C - The main selling point of this game is to die and live. Most of the time you die because you have no idea what ♥♥♥♥ing ridiculous story event comes next. Then you either have to restart the game to get the optimal decision tree to that point, or reload far enough back (read: possibly several weeks) to be able to prepare for that event. It doesn't help that you don't know any of the values required to pass each of the choices in an event. LOTS of trial and error. Paper and pencil are necessary. If you use a walkthrough... it stops being a game due to the spoiler nature of walkthroughs for decision-based games, but I understand if you're frustrated you'd go for it. For perspective, I died maybe 30 times before I went to the day-by-day walkthrough/spoilers, on which it stopped being interesting since I was basically reading the story in order to get through it. In short this game can be frustratingly hard and requires dedication.  ///  All in all, I had fun dying for several hours, so I recommend it. Don't expect more out of it and you'll be satisfied. Would eat OBVIOUSLY POISONED box of chocolates again. Or sacrifice myself to a tentacle monster. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Lesbian relationship with a Sailor Scout/10",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is a fantastic game/visual novel. There are many reasons to love the game, and not many reasons to hate it.  Despite reading the Steam page and watching the trailers/seeing the images, there may still be some confusion to some on what exactly the game is. LLtQ is a hybrid between a visual novel and a raising sim. Visual Novels are easiest explained as choose your own adventure books with images. A raising sim is what it sounds like, a simulation of raising a child. The concept of LLtQ is that you are Princess Elodie, who's mother has just died. You need to take up your mother's mantle, and attempt to survive until coronation.   The game usually takes multiple attempts to beat for the first time, and it is very much trial and error, as the player needs to figure out which skills to prioritize and what decisions to make. The real fun of the game, however, is exploring all of the possibilities after you have beaten the game. There is a ton of intrigue happening around the world Elodie lives in, but Elodie can't learn all of it (or even very much of it) in a single playthrough. Which is why in your early attempts you will most likely die. You will make what seems to be a reasonable decision, but die since you were unaware of the implications your actions had because of some specific knowledge you would need to know in another playthrough. It is almost beautiful how everything that happens in the game has a reason, and how all of the characters have hidden motivations that you need to figure through multiple playthroughs and deductions (as some motives require reading between the lines).  Even after 64.5 hours, I still sometimes stumble upon things I didn't know existed in the game. I can't recommend this highly enough.  tl;dr: Buy the game. It is awesome, and has so much detail.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game for those who enjoy visual novels",
            "review_score": "1"
        },
        {
            "review_text": "Made Elodie become Hitler She died of poisoning Historical accurate/10",
            "review_score": "1"
        },
        {
            "review_text": "Music 10/10 Story 10/10 Gameplay:10/10 Despite its girly appearances, the game involves a lot of strategy, and thinking to help the princess live, gain reputation, and overall being a great queen. You make choices that effect the overall story and there are various paths to discover and explore.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game to just play on a comfy evening. There's a lot of variety in what can happen, but sometimes it feels like you come across the same events quite often, so you eventually start focusing on certain stats each time. That said, it just depends on what you feel is important to maximize first.  Don't expect to survive on your first run.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for people who like text based game's and being able to make choice's that really affect the storyline. Overall amazing game but can be time consuming.",
            "review_score": "1"
        },
        {
            "review_text": "Mastered the dark arts. Disappointed my father and friends. Crushed a rebellion with major casualties. Trained falcons and mastered economics. Death by chocolate. 10/10 would stuff my face again.",
            "review_score": "1"
        },
        {
            "review_text": "I love raising sims. I also love otome games. So this game is like crack to me. It has some solid writing, difficult challenges to get around, and a really entertaining stat system to play with. I do wish the events were a little more random, but otherwise if you have any interest at all in this type of game I can't recommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "OMG GUYS BEST GAME EVER I ALWAYS WANTED TO BE A PRINCESS!",
            "review_score": "1"
        },
        {
            "review_text": "While the format, presentation, and style of the game may not appeal to all gamers, overall this is a good example of the genre. The built in checklists make it easy to keep track of what you've seen if youre trying to collect all the scenes, deaths, and endings.",
            "review_score": "1"
        },
        {
            "review_text": "10/10!  Remember, everyone is conspiring for your death...",
            "review_score": "1"
        },
        {
            "review_text": "Game made me feel like a princess.  Don't worry, I still have my man card... Probably...",
            "review_score": "1"
        },
        {
            "review_text": "Before playing : Omg Yay! A Princess simulator , always wanted to be one eheee :3 ! After playing : Uhh.. yup nu-uu , no way i want to be that anymore , time to marry someone from a poor family. &lt;: + Dying is actually kinda fun . Would recommend for all you dreamers out there also ! :'D",
            "review_score": "1"
        },
        {
            "review_text": "10/10 game I get to live out my dreams of being the little princess and also dying",
            "review_score": "1"
        },
        {
            "review_text": "Personal rating: 6/10 Replayability: Low (even though it seems encouraged due to multiple endings) Budget: Only buy it on sale... If it's very cheap. You will feel like you wasted a lot of money if you pay full price.  Lenght: A full day can get you through the game, if you're lucky.   I find myself very surprised to be writing a review of this game. I never thought I'd end up playing a game like this....   Despite the hideous art-work that in no-way fits the setting of the actual game, this fantasy game is very entertaining, reminding me of old browser games from Japan that I used to play in elementary school.   The game draws inspiration from Princess Maker, but unlike Princess Maker, the game actually follows a story and is actually interesting.   In this game, you must, through careful planning and choices try to reach the date of your coronation, being the princess of this strange fantasy Kingdom. Diplomacy, foreign relations and many other aspects very surprisingly play a big role in this extremely minimalistic and simplistic game.   The game features various endings through an epilogue, and a ton of different possible deaths, and you'd think this awarded the game a high replayability, but it doesn't really. Unless this game is RIGHT up your alley, playing to the end ONCE is more than enough for most people I'd say.   While I recommend the title for people who are into games like this, be warned, it's inappropriately 'cute' in it's artwork, which doesn't fit the setting at all, and do not expect a master-work gameplay-wise. This could have been an android game or a browser game even.   You have to be the kind of person who can enjoy a game for it's gameplay and setting.   ",
            "review_score": "1"
        },
        {
            "review_text": "While I do love this game, I can not in good faith recomend this game, it commits to many of the typical flaws of its kind. Let me list them out and you be the judge.  1. Story is truly linear in how you have to pick certain skills in order to survive, especially early on. 2. You are forced into to many instant loose scenarios and your skills are not taken into account. For example when my country was being raided, I had 100% on military tactics and logistics, neither of these were allowed to be used, which is absolutely flawed and stuipid in my oppinion, if I am a military genius, I should be allowed to command my forces like I am one. 3. To many numbers mean nothing, for example, the game asks you to lower, raise, or keep the taxes the same, without being presented numbers, these figures are meaningless, not only that but kings had advisors to help explain things to them that they did not know. 4. The game does not give you the option of advisors to help assist in decisions of state as a real king or queen would have and in plenty. 5. Your character starts off with all stats being 0, this is absolutely horrible to me, it is saying that your character has never done anything in their life, has no skills, no training, no natural talents until you are teaching them. This is the biggest killer of the game in my oppinion and completely breaks the whole mold of the game. At least give some stats with 5's or a few tens to them even if they can not handle a skill check at least I have something there to prove my character is a person.",
            "review_score": "-1"
        },
        {
            "review_text": "for a short and hard game it enjoyalbe i love it you need to get this if you need to get some angry out XD",
            "review_score": "1"
        },
        {
            "review_text": "Game is pretty fun. It feels like a roguelike with VN settings and interface, and there's a ton of options to explore within the game itself.  I'd recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting premise which is effectively destroyed by the very linear choices that can be made. Often the game is rushing the production of skills needed to not be killed in some events, and as well some skills are completely useless towards any progress. I wish that there was more varied reasons to devote time and effort into some skills, but really this is the sole factor as to the mediocrety of the game. The concept is very interesting, and I commend it on that, as well as the ideas behind the skill checks, but it seems more like a concept instead of a fuly fledged idea.",
            "review_score": "-1"
        },
        {
            "review_text": "This one was overhyped. The pacing is too slow,i played the game for a good hour and didnt die,so i feel like i am missing the point. and these management of skills reminds me of school,it feels pointless and upsets me.",
            "review_score": "-1"
        },
        {
            "review_text": "In Long Live The Queen, you must intricately plan out your classs to take based on your mood and complete certain activities in order to change your mood. there are many skils that can pay off in the long run by helping you defeat foes or keeping such a masterful composure people won't fight you. there is a rivoting story and crucial plot points that greatly affect the story and your relationship with Elodie. There is a lot of planning that needs to be exerted so precisely to ensure that this game is completed perfectly. This game will pull you in and you will create the most amazing princess ever who is capable of facing the harshest demons and the strongest gladiators and mercenaries. Assassins will not be able to harm such a domineering ruler as yourself and you will reing supreme over the world in all its entirety. There are many suitors to marry and many friends to make, many foes to erradicate, and spells to cast. There is truly nothing that can stop a ruler as great as Elodie. as her empire would chant 'Long Live The Queen.' You are truly a magnificent Queen Elodie, may your reaing last forever  Oh Wait... She died from eating chocolate. And she ate it because she didn't have knowlegde in trade... I quit.",
            "review_score": "1"
        },
        {
            "review_text": "Although this game can be really difficuly, it is really enjoyable and fun! It's pretty frustrating at times because it's impossible, or close to impossible to prepare for every scenario. But that doesn't change the fact that this is one of my favorite games on Steam and it was $10 well spent.",
            "review_score": "1"
        },
        {
            "review_text": "You either die a princess, or live long enough to see yourself become an evil queen.",
            "review_score": "1"
        },
        {
            "review_text": "There are no foxes, but its still a great game. Very dynamic and a ton of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would be a kawaii animu loli hitler again. Best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "This game got stats, and lots of 'em.",
            "review_score": "1"
        },
        {
            "review_text": "This game got stats, and lots of 'em.",
            "review_score": "1"
        },
        {
            "review_text": "Best visual novel ever,help Princess elodie to get to her coronations without your death.",
            "review_score": "1"
        },
        {
            "review_text": "this game is so funny lol its worth it i never laughed so hard. poison in my chocolates can a princess git a brake x.x if you like fun games this one is a must buy",
            "review_score": "1"
        },
        {
            "review_text": "You can save your kingdom by singing to a man and then burn your peasants alive when they try to revolt.  12/10 would bipolar again",
            "review_score": "1"
        },
        {
            "review_text": "this game is so funny lol its worth it i never laughed so hard. poison in my chocolates can a princess git a brake x.x if you like fun games this one is a must buy",
            "review_score": "1"
        },
        {
            "review_text": "The name is kinda contradicting the nature of this game, considering the game takes place in an alternate medieval universe where being 14 years old and next in line to the thone means your life expectancy is lower than a box of chocolate.  There are many ways to make your life easier(or way harder), but the most satisfying way is to become a ♥♥♥♥ING MAHOU SHOUJO.  Don't like that guy who looks at you in an uncomfortable way? Burn him! That dog is sleeping on your couch? Incinerate it! That grandma is blocking your way!? Implode her!  So by that time, you'll realize that the other countries want you dead for a very good reason and they'll stop at nothing, trying to murder you with their greatest weapons: chocolates.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why.. but this game gives me certain 'roguelike' vibe. It was my first VN ever and I don't regret playing it even a bit. This game opened the whole VN world for me.  It's kinda difficult at first IMO (might be my inexperience in these kinda games too) most of the characters are pretty personal and I like the theme even though I'm not avid fan of sword and sorcery or medieval stuff.  + for pink headed princess protagonist :P  But Elodie.. It's really common sense not to push arrow, that has pierced your side, deeper..",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Received tentacle porn about me.  &gt;Horrified &gt;Paper magically flies out the window but lands on a ledge &gt;Try to climb out and grab it &gt;Fall out and die.  10/10 would save before the event and pick a different option.",
            "review_score": "1"
        },
        {
            "review_text": "I played this with my cousin. We failed almost everything up to the point where some other ruler started a civil war against up. Destroyed her army and cut her head off. Became hero of the land. Died to chocolate.  19/10 would chocolate again.",
            "review_score": "1"
        },
        {
            "review_text": "Genius mashup of Chose Your Own Adventure storytelling and classroom sim that works really well. Under the cutie-boo veneer is a Dark Souls-like protagonist death wish. The mechanics are solid and the branching choices compelling enough that I started taking pages of notes and diving in again and again. Very fun with surprisingly deep strategy elements.",
            "review_score": "1"
        },
        {
            "review_text": "I have had so much fun playing this! There's a variety of endings based on your actions, and it can be very challenging to get there. You must figure out what's best to learn, and I love the mood system! It really helps learning things you need quickly, or poses more challenge to you. I love the art, story, characters, and music. Over all a great game, that can prove to be a fun challenge to those who enjoy strategy games. I highly reccomend it, especeilly for only 10 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "1st time playthrough - Dies by bandits  2nd time playthrough - Survives a civil war, but gets poisoned.   3rd time playthrough - Masters Lumen and conquers half of the land. Still gets poisoned.   Best death by chocolate simulator. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Holy cow this game is amazing. It's really hard to beat, but the it is still so much fun because I can never seem to stop playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, and I can't say enough good things about it.  The game isn't easy, and it will definitely kill you. Probably more than once. But it also allows for multiple different playstyles. I've successfully completed the game with Elodie as a swordswoman/general, an academic interested in history and statecraft, a lumen wielding paranoid with spies everywhere, an athlete that hates lumen, and a historian interested in the arts. I love that I can craft so many different versions of Elodie and complete the game, though I will say it's much harder to not die if you choose not to become a lumen, and the ending seems far more sinister for an Elodie that isn't a lumen.  Stat raising in the game can be a real challenge, and the best advice I can give is to keep your mood bars as close to the center as possible and only raise a lower high enough to give yourself the bonus you need. Go too far in one direction, and you'll find yourself unable to train key skills when you need them. Also, while there is marriage in the game, this isn't a dating sim, so these really exist to add flavor text to the epilogue. The sweetest options are Briony (though it is hard to keep her alive) and Evrard, though my favorite is 'romancing' Brin and marrying her brother. That one's awesome.  The only thing I don't love about this game are the aesthetics, which have far too many pink hearts for my taste, but the interesting and fun gameplay more than make up for that. And honestly, I've love a sequel where we get to play Elodie again and help her through her first year as queen or one of her children.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive",
            "review_score": "1"
        },
        {
            "review_text": "This game has been a joy to play. It's witty, funny, and has immense replay value. You'll die often and in many ways. Each time you choose a skill to train you're making small changes in how the game's outcome presents itself. Each game can be different.",
            "review_score": "1"
        },
        {
            "review_text": "The only way to win this game is to repeatedly save and reload. Usually any given situation has only one way to actually beat it, and that's only with one(or more) skills maxed out at 100. Half the game's skills have a grand total of one time, ever, where they're useable.  About the only fun I ever had with this game was using the console to max all my skills from the get-go so I could actually take advantage of the few branching events the game presents you with.  Kind of a shame, because the writing's not actually bad, it's just the 'gameplay' that's utterly lacking.",
            "review_score": "-1"
        },
        {
            "review_text": "Addictive",
            "review_score": "1"
        },
        {
            "review_text": "An interesting visual novel and raising simulator. A simple basic mechanic leads to many unexpected plot twists and tangled branches of causality.  The visuals are okay, and the music is quite atmospheric (many different tracks for different themes and events), even though becomes a bit droning after listening to only 2 of the songs for most of the gameplay.  I'm really happy that the game has Steam achievements (and the game has collectable epilogues), because they invite me to choose courses of events I would have never chose otherwise, and thus see a diverse range of events unfolding, get to know different sides of the same characters, and end up with very different endings &lt;3  The magical girl theme is an added silly bonus :D  Oh and you gonna die. A lot :D  Edit: after 4 months and 25 hours of gameplay, finally finished all the achievements, deaths and epilogues :) thanks for the game's creators and the kind players who wrote the much needed guides for it :D",
            "review_score": "1"
        },
        {
            "review_text": "An interesting visual novel and raising simulator. A simple basic mechanic leads to many unexpected plot twists and tangled branches of causality.  The visuals are okay, and the music is quite atmospheric (many different tracks for different themes and events), even though becomes a bit droning after listening to only 2 of the songs for most of the gameplay.  I'm really happy that the game has Steam achievements (and the game has collectable epilogues), because they invite me to choose courses of events I would have never chose otherwise, and thus see a diverse range of events unfolding, get to know different sides of the same characters, and end up with very different endings &lt;3  The magical girl theme is an added silly bonus :D  Oh and you gonna die. A lot :D  Edit: after 4 months and 25 hours of gameplay, finally finished all the achievements, deaths and epilogues :) thanks for the game's creators and the kind players who wrote the much needed guides for it :D",
            "review_score": "1"
        },
        {
            "review_text": "I AM THE TRUE MAGICAL GIRL LESBIAN SUCK IT MADOCA MAGICA  Anyways this game is all about finding the best way to die. And yknow all that fancy royalty stuff. The real interesting gameplay is trying to win with little effort into winning.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥in Chocolates every time. This game is brutal de to the ♥♥♥♥ing poisinous chocolate. 10/10 would bang again!!!",
            "review_score": "1"
        },
        {
            "review_text": "Short, but fun and amusing. Do not eat the chocolates.",
            "review_score": "1"
        },
        {
            "review_text": "do not romance the prince. he will kill you. he will poison your cake and ♥♥♥♥ your cousin. he is a man♥♥♥♥♥ and he is not to be trusted.",
            "review_score": "1"
        },
        {
            "review_text": "Very pretty, no skill required. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "A long time ago long live the queen ruled my existence It was MY QUEEN i couldnt leave my computer for fear Elodie would die I had to leave it open 24/7 or else Elodie would die My friends tried to skype me, but I couldnt leave the window One day my family had enough and shipped me off to a mental hospital I spent one year recovering  I S E E H E R I N M Y S L E E P ",
            "review_score": "1"
        },
        {
            "review_text": "This game is very confusing in a lot of strange ways...  Want to avoid being poisoned? Better have knowledge in trade and production skills!   Want to tip a sea battle in your favor? Better make that climb check or it's lights out, regardless of having maxed skills in military stuff, extra boats because you saw them coming, etc. (That rebellion you quelled earlier makes it impossible to win despite ALL preparations, sorry... guess you should've invested in that printing press and made army recruitment flyers!)   There are too many 'gotcha' moments in this game that come out of left field and just don't match what's happening. Atop that, it's very hard to tell what is important and what isn't. Should you invest in 'elegance' so you don't get run over by clumsy servants and impress your fellow nobles? Does that MEAN anything? Or should you invest in 'flattery' so you can show your false approval for your father's new beau? What good is your opinion to your father, you're 14!  It's very difficult and the skill checks just seem to have a mind of their own as far as what skill is tested and when.   There are, of course, multiple endings but most times folks will try half a dozen times, die, and then just look up a guide to this well-explained (though poorly executed) mess of a Choose-Your-Way-With-Skill-Points mini-novel.",
            "review_score": "-1"
        },
        {
            "review_text": " The Boring Queen   There’s interesting story and beautiful graphic but choices and events should have been more varied to avoid some repetition.   -- 5/10 ",
            "review_score": "-1"
        },
        {
            "review_text": " Short version:",
            "review_score": "1"
        },
        {
            "review_text": "The Queen is a full-blown R-tard. This game constantly insults your intelligence as a player by leaving events to happen based on your character's skills despite your own wariness. I died by poison chocolate, when I called that it was poisoned. If the game had given ME the option to eat the chocolate or not, and I ate it and died, I would be fine with it. But no, because my medicine/poison skill wasn't high enough, she ate it anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "A very good stat-building game. The Queen is cute and you can dress her with an assortment of outfits ranging from black leotards to magical girl suits. However the game is sometimes vague on what skills to invest to tackle a scenario and I ended up dying because I have not met certain skill requirements. The game features multiple endings depending on what scenario you've succeeded or failed, and it encourages multiple playthroughs. I'm still far away from getting 100%  Oh and there are no voice overs.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game seems to be a 'make your own adventure,' but the truth is there is only one outcome at all times, many skills are useless as you MUST get skills in a certain order to survive the story.  Do not buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "Disappointing ren'py sim. Kinda feels like a choose-your-own-adventure - pick the wrong options and the game is finished. To finish the game is pretty much trial-or-error and without the generous save slots, it'd be a rather frustrating affair.  Graphics are, as you'd expect from the genre, limited. Music loops far too quickly and does nothing to inspire. For a couple quid and some rainy-day entertainment then it's fine..otherwise, avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like playing D&amp;D but failing at every single save roll because you suck at training the right skills.",
            "review_score": "1"
        },
        {
            "review_text": "When I think of all the Starbucks I could have bought with the money I spent on this game I get  really  sad. At least I have a sugar daddy though, amiright? Who needs morals when you can waste money on steam games",
            "review_score": "-1"
        },
        {
            "review_text": "I don't really like this 'game's' style  idk either I use a guide and get the best ending or I keep randomly trying stuff and getting dumb endings like 'you were a genius at playing the piano and singing but you slipped on a banana peel and died, too bad xD'  why did I pay $5 for a VN/10",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥ as hell",
            "review_score": "-1"
        },
        {
            "review_text": "The game is way too short. I was able to beat it in 2 hours and 30 minutes. Also, it's very tedious to prepare for certain events in the game. They throw curveballs at you constantly, forcing you to save and reload in order to not die horribly. Therefore, this game doesn't have a lot of replay value. After my first playthrough I had absolutely ZERO desire to play it again. Despite what I said though, I can't call it a bad game, so if you're still interested, do yourself a favor and buy it when it's on sale like I did. Don't pay full price for this game, otherwise you may feel swindled.",
            "review_score": "-1"
        },
        {
            "review_text": "Very short game... This is what you would call a discardable game for the most part. The game has no randomization element, if you play the same game the same way, you will always get the same results. The game does adjust the story depending on the choices you make, but the storyline is very similar every time you play it even with the alterations based on gameplay decisions. This game might be fun if you like to experiment with different paths to take during the game, but there's no variety if you decide to continue playing the game the same way each time.",
            "review_score": "-1"
        },
        {
            "review_text": "A game of idiots created for idiots.  Brainless creators with the rotten core that's based on stupid reasons and childish logic. Not Fun, but Annoying, Boring, Shallow and Foolish. Not worth with any penny. Don't waste any penny with it.  It's so far away from strategic game and so far away from 'Good' game. ",
            "review_score": "-1"
        },
        {
            "review_text": "I expected a game like princess maker. A game where you can decide the fate of the princess you are raising (no, princess maker is not a girls-only game). But here all you try to do is try to prevent the princess from dying from chronologically scripted events. And the events that happen when you see them for the first time require just total random luck to survive. You need to have trained her for a certain skill - which you only discover after you die.     To sum it up: The graphics aren't great  The gameplay is dull - You trained a skill required to live, you continue. You didn't train it, you die and can start over. Replayability is very poor due to you already knowing what's coming - or die to another random new event when you get further because you didn't raise your 'horse handling skill' The sounds are dull The dialogues are boring  It is overpriced for what it is. I bought it based on the positive reviews on steam. I won't do that again! I would suggest you not to buy it either, sorry.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really challenging game that makes you think about every little aspect of what you're doing with very real world consequences to everything you do.",
            "review_score": "1"
        },
        {
            "review_text": "best japanese princess game i've ever played, 11/10",
            "review_score": "1"
        },
        {
            "review_text": " This game is just the best.",
            "review_score": "1"
        },
        {
            "review_text": "I'm afraid I cannot recommend this. The story, art and setting are good but the gameplay just isn't fun. Writing down everything you need to do each week quickly becomes a chore.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun game with hours of play time and replayablity. Plus the princess is waifu material. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Manged to get the 14 year old queen killed at least 10 times in a few hours. 8/10 Would get poisoned, shot, cut down, drowned, evaporated again.",
            "review_score": "1"
        },
        {
            "review_text": "Started a civil war 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is part visual Novel, and JRPG. The gameplay is making choices and reading the events that unfold as princess Elodie survives multiple trials and events leading up to her coronation as Queen of the country. The first thing you should know is that it is unlikely that you will survive the first time around and I highly recommend saving regularly.   In this game, the story progresses week by week with an event occuring each week and a choice of classes to raise certain stats. How elodie handles the events and choices are determined by the stats; for example if she receives a necklace from a neighbouring lord; if she has enough points in court manners she would know that wearing it would mean she is pretty much willing to marry him and you get a choice in how you want to proceed. If you don't have enough points however, she will obliviously put it on and feel great because some nice guy gave her some nice new jewelry. These events and what happens in them will then effect future events and then the story progresses based on the stats you raise and the choices that they give you.  Raising the stats is also part of the gameplay, you have a mood meter which tells you what mood she's in and depending on the mood, she would learn certain stats faster (e.g. When she's depressed she is more into animal handling and improves the stat much faster while she will learn conversation skills slower). Her mood can be effected by the weekly events and you can make changes to her mood through choosing how she spends her weekend.  The game has quite a bit of depth to it and finding new story paths or to just find out what happens if you pass a skill check is quite enjoyable. The music is quite nice at times though there isn't that much variety and the amount of art is a bit lacking for all that happens, however it has a very involved gameplay and story which is fairly engaging.  Yes, it is a fairly challenging game and you pretty much win by remembering what happens and replaying it, but the amount of story and lore behind it and the sense of success when things go well makes replaying it still quite enjoyable (the function to skip dialogue helps too).  I wouldn't say this is the best game ever but its a decent game and I enjoyed it. Its definitely worth a shot if you are into visual novels or maybe into rpgs.",
            "review_score": "1"
        },
        {
            "review_text": "Underneath the cutesy graphics is a brutal tale of intrigue not unlike what could be found in a regular game of Crusader Kings 2. While it is perfectly possible to lead young Elodie to be crowned without finding out the darker portions of the story, it is in repeatedly trying out different skill builds and unlocking different paths through the story that the complexity of the games shines.  But unlocking the dark secrets can be very tedious. The thing is, the game is in effect just algebra. There is no element of randomness in the game. Either you have trained enough to pass the skill check or you have not. Each event is triggered by some flag that was previously set earlier in the game. Each choice or event will affect the mood of Elodie by a fixed amount. In fact, much of the game is in mapping out exactly how many points are needed to pass, when particular events trigger, and their effects on Elodie's mood in order to maximize the skills trained.  I recognize that eventually, I will have figured out 'optimal' skill builds and choices for each particular ending I want. But ultimately? I consider this game to be no different from a well-loved book. And I would recommend it to anyone who would like to read the story of a little girl forced to grow up too soon.",
            "review_score": "1"
        },
        {
            "review_text": "Each time she dies you get ♥♥♥♥♥♥ at yourself, swear to do better, then die in another itteration a week later because she does not know enough about divination, or has no idea how the economy works, or can't shoot worth a damn, or whatever. Then you try again",
            "review_score": "1"
        },
        {
            "review_text": "It's like a nightmare. With tons of poisonous chocolate.   10\\10 would die again, And again. And again.  ps: Seriously, who the ♥♥♥♥ made this game? Satan himself? Prepare your videogamer a^us for a big sized death train dild0. Dark Souls is relaxing compared to this.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good life simulation game.",
            "review_score": "1"
        },
        {
            "review_text": "i tried to be a kind ruler over the novan empire and use my lumen powers for good but then i was killed by a kraken",
            "review_score": "1"
        },
        {
            "review_text": "Amazing addicting. You will die alot and you will play over and over again",
            "review_score": "1"
        },
        {
            "review_text": "Truly Excellent Writing / Storytelling with Finite but Crucial information all the way, Playing this is like Game of Thrones Regent Simulator, with Limited controll of the world but maximized perspectives on Training and Geo-Political Strategy.   -- Training a Young Queen is a cool concept, as it's like taking part in the active training of an Eye'Sadai or Sorceress or Warrior, or Tyrant.  -- IT would be nice to see some New Characters and Alternate Stories , and very worthy of full DLC. You've got my Five Dollars for each new Full story / Character expancion you wanna make!   Could do the same thing for a Forign Nation, as to take controll of their part during the same world's geo-political shifts. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm a magical-teen-princess-to-be-crowned. I love it,",
            "review_score": "1"
        },
        {
            "review_text": "Pretty intersting use of moods altering learning ability.",
            "review_score": "1"
        },
        {
            "review_text": "Even though you are likely to die randomly, I very much apreciated this game! Very well made and lots of endings avaiable. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly amazing. Died 5 bazillion times. It lacks randomized replayability though.",
            "review_score": "1"
        },
        {
            "review_text": "I am amazed at how much content is packed into such a simple idea. Definitely broadens my interest in other types of visual novels instead of the usual '2-4 choices and you're done'.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game really interested me when I was looking at it, and even reading the reviews I descided to give it a try.  After trying it I am... well, dissapointed. What everyone else says is true, you have no idea what kind of skills you may need at any given time, and since you have no advisors of any sort, you just fail things left and right.   I keep trying to find a good game to compare this too, and I think I have one. Its like those 'unfair mario' games, where you literally have no way of knowing what will kill you or not, and the only way to win is by repeating it, over and over and memorizing exactly what happens. This game doesn't change if you keep playing it the same events happen at the same time, so its the kind of game you can literally open a walkthrough and follow to the letter to get the exact ending, there is no skill involved.   I know I put everything into things like trade and military, leadership things, you know, things that would help someone lead a nation, and I die over and over because I dont have running... and keep failling a forced duel. So I try again, push toward what I need to not die there, oh, look, mass war, your military stats arent maxed, you loose again.   It requires such a specific set of skills at specific times I dont think there is anything but one perfect way to finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "Such a fun game! Personally, I enjoyed every play through, even if it meant I died by chocolate, an arrow, or being drowned; hey it happens, right? 5/5",
            "review_score": "1"
        },
        {
            "review_text": "'It's like Princess Maker but with more death!' - Anon  'The pinnacle of shojo gaming.' - Legion  This game may look pretty but it's tough and you gotta min-max your way just to survive.   It's a lot of trial and error but at least the cutesy graphics can give some ironic humor...  If you like dying then it's got replay value and thank god for a skip button.  Keep an eye out for those chocolates. Good luck, you'll NEED it.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Engaging and very entretaining. Choose your own adventure styles. Many routes to stumble upon. Suitable for dudes too.",
            "review_score": "1"
        },
        {
            "review_text": "The first non-pornographic VN I have ever been able to play for longer than five minutes, which, given my general disdain for the genre, says a lot. I've heard people jokingly call it Loli Dark Souls, and they aren't wrong. Death comes relentlessly, often in cruel and unexpected ways.  Color pallate is gay as a pink christmas tree, and if you're a grown-♥♥♥ man and anyone ever sees you playing it, you're gonna get some funny looks. Tread lightly, it's a long slippery slope down from here, with nothing but despair, sticky dakimakura waifus and cheeto-dusted manga at the bottom. Abandon all hope ye who enter here.  N I G G A D A T S K A W A I I",
            "review_score": "1"
        },
        {
            "review_text": "In all my life I've never been so torn up by something. How can something so seemingly simple be so impossibly difficult? If Ender Wiggin had to play this after the weird space torture games, I have no doubt he would look back fondly on those trying, but relatively easier times. Why the heck do I keep eating poison chocolates?!? I hate everything! It's so humiliating! I wouldn't be so mad if I could make it further in before losing so completely, but I feel like it jams a stick in my back and mops the whole dang world with me.  11/10 for pushing me to limits I didn't know I had. This is my everest, my Comet 67P/Churyumov-Gerasimenko. Both have been beaten and I will not rest until I conquer this demon-spawn.  Other notes: The music is fun and changes with the mood pretty well. I like the pictures. The story is exciting; normally I don't care, but I really want to find out what happens.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an interesting one as i really couldnt decide if i would recomend it. In the end i decided thats i would recomend this game for several reasons. This game has a really interesting concept which i love. As far as i could see the story heads in the same direction everytime but as it goes whatever skills you learned along the way will help you. You can improve two skills per week and you can increase/decrease how fast you learn a skill based on your mood. This game has alot of replayablility as i found myself restarting and improving different skills based on what i had seen in the previous playthrough. I really did like the story although i did find it to allitle shorted then i would have liked. Overall Long Live The Queen is a great game to play to past the time although i do understand that not everybody will love it. Still i give this game a 7/10 and would recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "“I Took an Arrow in the Knee”",
            "review_score": "1"
        },
        {
            "review_text": "I have run two playthroughs so far and look forward to many more. Some of my mistakes were obvious, in retrospect, while others are baffling. I tried to craft a tomboy animal loving princess my first time. My second was a magical girl. Where will it end? With me telling everyone I know to try this game!",
            "review_score": "1"
        },
        {
            "review_text": "You can play this over and over again and never have the same ending. Each approach you take has its advantages but also its disadvantages but there is no absolutely right answer.",
            "review_score": "1"
        },
        {
            "review_text": "I spent 40 mintues trying to figure out how to become a wizard and the second I master magic I get killed at my friends birthday party. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got this game during a steam summer sale cause I wanted to waste money. It was actually decent enough, and it was quite funny. It's like kingdom-ruining simulator, except for weeaboo's. Thankfully I am resistant to weeaboo influences, so it was alright.  would buy for 5 euro",
            "review_score": "1"
        },
        {
            "review_text": "I'd have never see myself and this game click together, but this game is very amazing. I'm going to start getting the achievements soon, but yeah... Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Executed every single person brought before me. Slaughtered tons of people when attacked by bandits Died to arrows WENT OUT LIKE A CHAMP.",
            "review_score": "1"
        },
        {
            "review_text": "11/10  Become a magical girl princess and burn to death anyone who disagrees with your internal or external policies.",
            "review_score": "1"
        },
        {
            "review_text": "This game is addictive, fun and hard. I died. A lot. I've only made it to the end once...And considering there are a bunch of different endings, as well as ways to die there is a lot of replay value! It might not be everyone's cup of tea though.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun choose your own adventure story. Doesn't take too long to beat, the consequences of your options aren't always obvious, great writing, silly art.  Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Finally I can live my dream of becoming an anime princess that, due to her lack of knowledge about arrows, pushes one inside of her because she thinks it will help her wounds.  10/10 'Terrible' - IGN ",
            "review_score": "1"
        },
        {
            "review_text": "This game was SO fun! It was a little frustrating but that made the finishing the game all the more rewarding. I kinda wish the story went on forever, and I'd definitely buy a sequel.  It's a visual novel, but it's actually appropriate believe it or not. The game is strategical, requiring careful calculation and analysis, and it has a high replayability because there are just so many ways to die!",
            "review_score": "1"
        },
        {
            "review_text": "This game was quite interesting to me. Like all games, it really depends on how involved you choose to be with it. Although the interactions and dialogues are mainly text based, they still allow you to create a very clear picture in your mind about the kingdom of Nova and what is happening.  A couple of warnings though, if you already struggle with paranoia, you might want to avoid this one. Quite a few events are aimed at your life (as you can see from the achievements).  Maybe if they had included adjustable difficulty (like easier to gain skills, and such) it might have widened the age group for players, but through trial and error most gamers should do well.  The controls and dialog options are good, and having the option to skip animations or certain dialogues becomes helpful (after you are trying to survive through the same sections over and over &gt;.&lt;)  It is also very interesting how many different paths you can take with which skills to choose from (and the outcomes). No two playthroughs have been similar.  Hope you enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Learn skills necessary to become a queen and try like hell not to die in the process, especially from those damned chocolates!  It's a visual novel/life sim combined with a rogue-like.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting - a strange theme at first but you grow into it",
            "review_score": "1"
        },
        {
            "review_text": "It's a weird little puzzle game, honestly. You have one in-game year to decide what skills are important to build up, which relationships are best to cultivate, what decisions are best to make for your kingdom...while trying to NOT DIE. Which you will do. A lot.  The only conclusion that I have come up with after playing this game is that I would not make a good princess.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes it really hard to be a 'good' person, but in a bunch of really interesting ways. You're forced as a leader to do a lot of morally questionable things for the greater good. Definitely made fro multiple playthroughs and save scumming as there are 13 sets of 8 save slots. From a feminist standpoint there is a lot of good to be said about the game as well. The outfits immediately spring to mind. They are exquisite and give you bonuses to certain skill sets, but they are also reasonable as actual clothing. For example, the outfit for intrigue is a catsuit which when I read that I rolled my eyes but it's not at all what you imagine. It's a sleek, black spy outfit with a monacle. Basically there are a lot of instances where they could have gone awry in the design but they haven't. It seems ridiculous to have to praise a game for not sexualising a 14 year old girl but the reality is that I was genuinely surprised and delighted.",
            "review_score": "1"
        },
        {
            "review_text": "Similar in vein to the  Princess Maker  of Japanese 'life-sim' games released in the early 1990's,  Long Live The Queen  tasks the player with planning the daily activities of a queen-in-waiting as she prepares to ascend to the throne of her realm. Time management and prioritization becomes key, as you have limited opportunities to train in certain disciplines that all raise skills. These skills play a crucial part in vignettes that determine the ultimate fate of your royal charge as she must contend with warring factions, political intrigue, assassination attempts, and more. Failure to meet skill requirements often have consequences on which of the myriad endings you will reach and can even lead - often - to your character's untimely demise. In fact, this game becomes something akin to a 'Choose Your Own Adventure' novel in that you will, provided you don't use an online guide, have to play through the game multiple times and experiment with different training combinations just to survive through to the ending. This can be a point of frustration for many players, I'm sure, but the patient player will be rewarded with a surprisingly entertaining and, given the cutesy anime graphics, mature storyline.  Game of Thrones  this isn't, but nor is it a 'magical girl' anime game; despite the 'magical girl' costume that can be unlocked. Ahem.  If you're looking for a way to kill a few hours with a down-tempo game, I wholeheartedly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "i'm queen you're all being sent to the dungeon",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game very fun and hilarious does get a little repititive but when you finally beat it, it feels pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "killed by an angry ginger man 2 times 10/10",
            "review_score": "1"
        },
        {
            "review_text": "For those unfamiliar to Visual Novels, this can be a really good starting point.  Like all Visual Novels, this game is essentially a book with images, with choices you have to make around the corners. Technically, you can fit The Walking Dead into this genre - they have some action, and a somewhat unique background story (For Visual Novels). All Visual Novels generally focus on a great story, and this is no exception.  What makes Long Live The Queen unique is the stats system. Every week there would be a different event(s) which need you to check if you can pass the requirements to make your choices work (such as Climbing a wall with enough stats into Climbing). To help players, the Mood system is added, which gives bonuses or penalties to certain stats for each mood your character is currently in.  Playing as Elodie, the would-be Queen, and customize her to focus on aspects to ensure she lives through her coronation. There is no real need to excel at everything - that is practically impossible - but at what you want. For the more casual players, Elodie can just do what she wants, and hope she lives until her coronation, or for the more intense players, Elodie can be specifically trained to prepare for certain scenarios.  This game has a good story, well planned routes, decent art and really worthwhile gameplay. Highly recommended.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Executed murderers? Check. Dodged arrows? Check. Declined a marriage, which would probably end a war and save the kingdom? Check. Won this war afterwards? Check. Died because of poisoned chocolate? Check.  5/5, will play again.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing little game. Manuever Elodie (you) through the perils of Court, War, Rebellion, and Espionage on your way to being crowned Queen. Survive and you win! Die in some of the most gruesomely ways possible and see cute death cards that are collectible! It is quite an enjoyable game and will take many hours from you if you let it!",
            "review_score": "1"
        },
        {
            "review_text": "All I can say about this game is that losing is fun, and winning satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Less of a game,and more of a series of trails and errors,I still find a lot of charm in this game.  As you grow the Queen and lead her through struggles,conflicts,and her own self-realization,the nature of the game tends to grow on you.  I enjoy it,but it's definitely not for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "I used to be a Princess until I took an arrow to the back, fell from the tower, poisoned by candy, blasted in the face by my aunt and of course drowned in the ocean. Being a Princess is hard, everyone is going to kill you, EVERYONE! In fact the safest way to survive this game is to not even start it. Just go make a sandwhich, maybe catch up on your reading. Still if you are intent on your own death you'll find plently of ways to meet your end.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. It's tough enough, but loads of fun. I wonder if there will be a sequel to it? After all, the young queen has to grow older. It would be interesting to see what else might happen to her based upon the choices she made in her youth. I'd recomend this game for anyone who likes to have fun with sim games. This is definitely a sim game worth having. It reminds me a lot of the old Princess Maker games, and I really loved them.",
            "review_score": "1"
        },
        {
            "review_text": "The metascore is misleading; this game is a clear 80-85, not 69. Exceeded my expectations by 10 fold. You can really easily underestimate - misjudge this game just by looking at it and even just playing it. Just give it some time and try not to get frustrated by not knowing what attribute gives you bonuses for your talents and I guarantee you will be surprised of how well thought and awesome this game is.    No, this is not some etchie anime crap or just another boring life sim or RPG, it is something so much more. It is hard to review without spoiling, but once you make your choices and try to actually get success on your talent tests, it is really satisfactory. You can be a good queen or a really evil one, be a spy, warlord, kick ♥♥♥ magician, talented empress, animal master and so forth... again... hard not to spoil.   Just try the game out, give it some time and be patient with the skill system, you won't regret it, I never did... played 18 hours and only have gotten to 48% of the content...",
            "review_score": "1"
        },
        {
            "review_text": "I usually do not like anime, but this one is good, more choclate to everyone!",
            "review_score": "1"
        },
        {
            "review_text": "It's so addicting. Great game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games. I have played countless times and still can find a new ending. It humorous as well as challenging, taking me about eight hours to actually when my first game.",
            "review_score": "1"
        },
        {
            "review_text": "Not a lot of gameplay, just select two classes to gain skills, then pick a location to change your mood which affects skill gains. Sometimes you have to make decisions and you often get skill-checked every turn for various things.",
            "review_score": "-1"
        },
        {
            "review_text": "(Spoilers)This game reminds me that no matter what choices I make, in the end I will fail at every decision I make and I will end up killing myself with an arrow.  But seriously this game is good and if you’re a fan of visual novels you should get this game.",
            "review_score": "1"
        },
        {
            "review_text": "I recently completed the game 100%. It was a lot of fun, in my opinion. I used walkthroughs to help me complete the last few achievements and epilogues I was missing, but I still found the new bits of story I'd missed to be entertaining to read. I'm almost sad that I've completely finished it now and I may revisit it again in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with an exciting approach to stories in game. It's the most fun I've ever had being a 14 year old girl!",
            "review_score": "1"
        },
        {
            "review_text": "Princess Maker 2 without that weird ability to marry your daughter.",
            "review_score": "1"
        },
        {
            "review_text": "Had lesbian relations with my Dad's wife, who is also my sister in law. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the adorable little anime girl on the title screen fool you, this game is not afraid to kill you. A fantastic choose-your-own adventure style RPG that pits you against all of the obstacles a young developing princess in a fantasy land might face. You'll need to be able to keep up appearances, please the nobles, know when someone's trying to assassinate you, and possibly even fight in a war. Well worth a few hours at least, possibly much more if you want to see all of the possible endings. The only downside to this game is that the menus can be a bit cumbersome to navigate.",
            "review_score": "1"
        },
        {
            "review_text": "This game has caused me to become depressed, paranoid, and insane.  This game is the perfect distillation of the phrase 'heavy is the head that wears the crown'.  I cannot cease placing this particular crown upon my metaphorical head.  10/10 would reccomend",
            "review_score": "1"
        },
        {
            "review_text": "Alright I am a princess! I must learn to dance, be elegant, keep the people happy! I must learn to fight as well to SURVIVE! Aaaand I'm dead by chocolate again.  10/10!",
            "review_score": "1"
        },
        {
            "review_text": "A great addictive short game. Beautiful art, nice music, great system and high replay value. You will always be curious to try and select different options, learn different skills just so you can come up with a different outcome of the game. You will die ALOT in this game, but that's the fun part ;)",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to Long Live the Queen, the world's hardest game featuring Princess Elodie, the world's most ♥♥♥♥♥♥♥♥ member of the royal family.  Upon months of studying field medicine and war she will proceed to shove an arrow into her vital organs.  Upon mastery of all things poisonous and harmful to the human body, she will immediately eat a box of poisoned chocolates given to her by a total stranger.  And when she finally becomes the world's greatest trader/doctor/general she'll still die to some hocus pocus ♥♥♥♥♥♥♥t she neglected to read 'cause she thought it wasn't very important as a queen to know.   On top of all this, what she does at the weekend can make her go from suicidal (not much change there) to murderous. Who knew that walking around in a garden would make you a cocky prick or that sitting on a chair makes you suicidal. Thankfully, if she is even slightly happy or angry, she'll refuse to focus on her ♥♥♥♥ing subjects 'cause she's too busy slitting her wrists or fingering herself in front of a mirror.  Though who can blame Elodie for seeking out death on a regular basis? On top of her mother dying, she was an armada of neckbeard Nobleman breathing down her neck trying to get their cheeto covered fingers into her panties as well. It's a lot for a 14 year old to take in all at once, but do not fret. You will be able to SHARE her stressing life and experience with her, the joyous feeling of every single decision you make building up into a massive threat that demands your head on a plate , fearing that the mistakes you made last week will be the death of you the next.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't managed to be crowned once 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Dark Souls of visual novel choose-your-own-adventure games, with a good story. An interesting idea.",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop playing. Please send help.  Game should be called, 'It don't matter if you're an expert on poison, cos you'll eat those damn chocolates anyhow.'",
            "review_score": "1"
        },
        {
            "review_text": "there are so many different paths to explore. not too bad for a simple RPG like this.",
            "review_score": "1"
        },
        {
            "review_text": "Despite what it looks like this game is brutal.  G.R.R Martin may have wrote this.  So unforgiving. I will probably end up dead for the umpteenth time.  But the game is great.  10/10 would die from poison chocolate again",
            "review_score": "1"
        },
        {
            "review_text": "OMG THIS GAME SHOULD BE CALLED LONG LIVE THE STRUGGLE!!!!!",
            "review_score": "1"
        },
        {
            "review_text": " Long Live the Queen  is a surprisingly sophisticated game that has plenty of charm and intrigue. I don't play very many visual novels or anything resembling a choose-your-own-adventure style, but  Long Live the Queen  knows how to breathe very intricate mechanics into its nice setting.  The game plays almost like a standard visual novel. LIsten to people talk, click on choices, and watch the narrative unfold. Something you have to do is schedule your classes and activities in order to boost skills. Your skills will determine how well you pass certain skill-checks throughout the story. Even though the game amounts to nothing more than clicking, everything feels meaningful because they add more depth to the plot directions you take.  There are a lot of different endings and a lot of ways to die. I was surprised at how many different routes and outcomes I found by accident.  The narrative and characters themselves are fun enough for this game's setup. There are plenty of nods to tropes you'd see in visual novels, Magical Girl genres, and medieval politics. It knows when to be wacky while still making you feel paranoid about whether you've made any of the right decisions.  At around 5-ish hours with the game, I'm still not done finding everything. That's partly due to how the game will rely on lots of trial-and-error, and it really does take time to figure things out on your own. You're given a ton of save slots for covering your tracks, but even then, you need tons of patience. If you like trying to figure out the intricacies between the scheduling and plot actions, you'll have a good time here.  For $10, I can definitely recommend this to anyone looking for a lighter narrative-focused experience. It could have easily been more pandering with fanservice, but it remains a pretty modest and sophisticated adventure.",
            "review_score": "1"
        },
        {
            "review_text": "You can be a wimp, a lady, warrior, little finger or a magic ♥♥♥♥♥.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "I LOVED Long Live the Queen. This could quite possibly be the best strategy/indie game on steam. I HIGHLY recommend you get this game. FYI: DON'T EAT THE CHOCOLATE!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A game I was drawn to by the wonderful art-style and seemingly simple premise, LLTQ is much deeper than I expected with quite a 'learning curve'. There's a lot of depth to the back-story and characters if you're the kind to go wild for flavour text, or you can pick it up for a 'quick game' and speed through it in half an hour. Lots of re-play value, would really recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Death awaits everywhere",
            "review_score": "1"
        },
        {
            "review_text": "Whats your favorite flower? mines Chocolate.  11/10 Store deaths are a good death",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the better games I've played lately. The story is really well done and the game mechanics keep you on edge constantly, forced to choose which skills to invest in and what moods to keep, never knowing what is around each corner. I've already played through 5 times and have yet to actually come out with a good ending, but it only wants to make you play it more. Everything has a purpose, and even if it seems like a useless skill it could decide the very fate of the game. You feel like a real ruler, having to stop and ponder the possible outcomes of every decision you make. From investing in Composure instead of Military strategy, to who you dance with at the Gala. Well worth the money for the hours and hours of addicting gameplay. Love this game and would love to see more like it.",
            "review_score": "1"
        },
        {
            "review_text": "I manage to win a sword fight... while wearing a tutu.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Basically made Elodie into Joffrey. Died by poison. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Impressed friend by almost making it to the end without dying on my first try. 10/10 would play again. Plus the main character is so Kawaii. xD",
            "review_score": "1"
        },
        {
            "review_text": "ロリ版All You Need Is Kill",
            "review_score": "1"
        },
        {
            "review_text": "I haven't done it yet. I haven't gotten to my coronation. I've had the game two and a half hours. I'm on Gameplan Mark 4. Sleep is eluding me. I cannot rest until I have become Queen. I have a sheet of notes and only a vague idea of how to implement my strategy.  I'll probably die of eating chocolate again. Let's be real. That chocolate is made by Death itself to snatch you away from friend and family before your time. (Yes, friend. Singular.)  Somehow I've avoided almost every romance (/arranged marriage/assorted courting and flirting) in the game. Then again, I don't pay much attention to diplomacy in this game, so maybe there's a reason no one wants to marry me. Ha, ha. I even OFFERED and they didn't take me up on it! Their loss; I can command an army or navy at fourteen and cure any disease or injury! FEAR ME, MORTALS!  Also did I mention I can use magic? I CAN USE MAGIC. And a sword. AND A SWORD MADE OUT OF MAGIC.  Please, buy this game. Especially while it's on sale. Excellent game for two bucks - you have 19 and a half hours, go forth and do the thing.  Good luck, fellow heirs apparent. God save you.",
            "review_score": "1"
        },
        {
            "review_text": "This game was SO fun! It was a little frustrating but that made the finishing the game all the more rewarding. I kinda wish the story went on forever, and I'd definitely buy a sequel.  It's a visual novel, but it's actually appropriate believe it or not. The game is strategical, requiring careful calculation and analysis, and it has a high replayability because there are just so many ways to die!",
            "review_score": "1"
        },
        {
            "review_text": "Dying Simulator. Tip: DON'T eat an apple, pie or anything tasty.",
            "review_score": "1"
        },
        {
            "review_text": "Ate chocolate and died. Ign confirms 10/10",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥ Just stay the hell alive!!! PLEASE",
            "review_score": "1"
        },
        {
            "review_text": "The requirements for survival and skills needed often don't make any sense and feels too random, and a lot of skills turn out to be useless",
            "review_score": "-1"
        },
        {
            "review_text": "I came across this little gem of a game while on youtube and saw it's unique and interesting tactical feel. I have to admit that I do love this game quite a bit but it can be quite frustrating for first time players. You will have to die a few times before finding the right combination of skills to make it to Coronation day alive. A feat I am still working on mind you but it is kept interesting the more situations I am able to unlock by having the right skills. All in all I would recommend this game for any hardcore strategy game players  LONG LIVE THE QUEEN!!!",
            "review_score": "1"
        },
        {
            "review_text": "Long Live The Queen is a novel style game. Poor princess Elodie just lost her mother the Queen. It is 40 weeks before her 14th birthday and her coronation and it's your task to get her through this time alive. Every week you choose two subjects for her to study out of a quite extensive collection. Depending on the mood of the princess which you can adjust at the weekends she gets boni and mali on certain subjects.  Every week the game throws events at you, a part of them are prescripted and happen always at the same time so you can plan ahead as you complete more playthroughs. Other events are triggered by the princess' actions and her actions are influenced by what you teach her. Those events include assassination attempts, a civil war, an invasion, deciding on court cases, visiting friends, a parade and speech, a lesbian wedding and so on.  Teaching the princess the right things is the key to survival since depending on your skills new options become available and certain pitfalls can be avoided while others suddenly may open. Learning also unlocks new outfits which boost your learning stats.  The goal is to choose the right subjects to learn to guide the princess unharmed through those 40 weeks full of trouble. And it's fun to see how the events play out when you go into them with a different skillset as last time. It's satisfying to survive past the point you died last time and find another new way of dying (there are eleven, gotta collect'em all). A playthrough doesn't last long and can easily be played in one session.  The graphical style is good but nothing special and the character art is a nice cute anime style. The music is simple and fits the moods, but again nothing special. Overall the game is easy to play yet quite a challenge to keep your princess alive, to find all ways of dying and to find all possible ends.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, not an anime fan but it is fun!",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is an interesting game which follows a girl named Elodie as she tries to live to see her coronation day. The game is heavily strategy focused and requires extensive attention to detail so that you may appropriately spend your time studying different subjects. I have four hours in the game and haven't managed to beaten the game yet; I highly recommend taking notes because there's so much to take in. Some skills are more important than others (ESPECIALLY LUMEN, which you'll unlock through gameplay), but every skill plays a part in some way, and a lack of any of them can lead to your death if you're not careful. That being said, this game is incredibly focused on strategizing and doesn't really encourage free choice at times, which is probably the biggest downside to this game.  On the topic of choice, it's really interesting to see the impact your choices have. Elements of both the game and Elodie's personality will change as a result of your choices. Characters can die if you don't study certain skills enough. You can become a cruel person by killing people. Even your mood or personality will affect how certain weekend excursions influence your emotions. Your choices will even affect which dialogue paths are presented to you, too. The game's incredibly well-thought out in that way, and I applaud the developer(s) for taking the time to do that. It's smart game writing, in my opinion.  As for the game itself, it's eh. Like, the game has some annoying bugs (especially when it comes to saving, since the game likes to forget which keys are bound to what, which makes typing save file names a huge chore). Also, the visuals aren't very high resolution, which makes the illustrations rather pixellated when you try to resize the game window or make it fullscreen. (Then again, my laptop screen's rather large, so this would affect that as well.)  Overall, despite the bugs and the somewhat unfairly unfair gameplay, Long Live the Queen is worth buying. You'll become so interested in the story that replaying the game in order to figure out a successful story path will keep you playing. The choices intermingle with the game's lore so flawlessly that it makes each playthough interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good. Lots of alternate story paths. Took a long time to beat, lots of replayability since I'd like to know the other story paths as well. It draws you in. Even the bf got interested ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Don't let this game decive you. It looks like your typical cute, cudley Anime game on the outside, but inside? Pure frustration fuel. You can die at a moments notice, even with max skills for the checks. But it is fun. For added fun, never save for the proper Rouge-like experince.",
            "review_score": "1"
        },
        {
            "review_text": "Read reviews before playing, saw that dying from poisoned chocolate was a common ending. 'No way am I going to let that happen' says I.  First playthru: Died from poisoned chocolate  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with an engaging, fleshed out, impressively branching story with awesoem replay value",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game a total of 115 hours. The art is adorable and the music is so beautiful! Seriously I've gone and spent weeks playing the songs on piano they're that amazing.",
            "review_score": "1"
        },
        {
            "review_text": "this game is super amazing",
            "review_score": "1"
        },
        {
            "review_text": "This games REALLY likes to throw curve balls at you. It makes you second guess every decision you make. It takes you down the dark path of paranoia making you suspicious of loved lones. It turns you into a tyrant who rules with an iron fist who the people dare not take up arms against. Woe to those who think they can take your throne. Survive bandit attacks, assassination attempts, and civil war only to meet your demise at the tentecles of a giant squid.",
            "review_score": "1"
        },
        {
            "review_text": "Looks can be decieving. This game is a medieval political sim, with magic and anime mixed in for maximum cuteness, and then you get poisoned chocolates and die in your own fluids.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly annoying and frustrating game! If you lack patience to actually learn and remember the fairly simple mechanics of the game or if you dislike to feel like an idiot and/or fail constantly, then this game is not for you.   With that said it is addictive, I am pending between anger and frustration constatly and still I countinue to try.  I will admit that if there had not been guides available I would have quit much sooner.   I like the idea, I like the format. What I dislike is the random element. For example:   You can fail a battle with 300 military because you should have had climbing and magic?    I hesitantly recommend this game, if it is on sale.      ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun way to pass the time, and such a cute game with all the outfits. You will die...a lot, but you get achievements when you discover all the different ways which actually becomes fun trying to change your choices around to not only live and become queen but also die in different ways and see how different the story can change per choice. I really enjpy this game and continue to play.",
            "review_score": "1"
        },
        {
            "review_text": "My very first review on Steam, although I'm a long time user. I played this game few times already, and it's very fun trying to get Elodie to survive to coronation. It's mostly lighthearted, although there are a few darker moments, and you can actually become a benevolent ruler or a cruel evil queen. There are lot of paths that can bring you to victory, and it's worth trying see them all :)",
            "review_score": "1"
        },
        {
            "review_text": "Got stabbed, shot by an arrow, drowned and poisoned. Then I learned how to dress and act like a proper lady.   I really enjoyed my runs in this game and will come back to die a few times more every now and then. All I can say that it was a really good experience, closest to drag I most likely will ever get.   LONG LIVE THE QUEEN!",
            "review_score": "1"
        },
        {
            "review_text": "In this game you can rule the country while simultaneusly riding away from a squid monster with your soon to be lesbian girlfriend, while expecting a hostile invasion the next week. You can repel said invasion by blasting off magic beams at your enemys navy.",
            "review_score": "1"
        },
        {
            "review_text": "super cute game that's annoyingly frustrating at times especially when elodie keeps eATING THE ♥♥♥♥ING CHOCOLATES",
            "review_score": "1"
        },
        {
            "review_text": " Makes your choices well and you will still die anyway.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun nearly every time I play it. It can be frusturating though. I've probably played it 50 times by now without a guide and I still haven't beat it. I keep getting arrowed or stabbed. And that sucks. Overall, I enjoy the challenge and the story is great.",
            "review_score": "1"
        },
        {
            "review_text": " A Paladin’s Steam Review: Long Live The Queen. Long Live the Ok Game.",
            "review_score": "1"
        },
        {
            "review_text": "I spent days just finding one path to staying alive. It was very diffucult, but still very fullfilling.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME ",
            "review_score": "1"
        },
        {
            "review_text": "addictive",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic silly VN.",
            "review_score": "1"
        },
        {
            "review_text": "It could seem a really silly game, but everything you do has a consequence and can make you die in the next round or become a Queen. That's why you end up trapped in the story to find every posible solution.",
            "review_score": "1"
        },
        {
            "review_text": "Disturbingly addictive. My friends were in shock that I got all the acheivements in the matter of around 6 months while also writing a graduate thesis. Let's just say my late nights were more often then not losing track of the time while trying out new angles in the game. Fantastic replay value, and twists and turns that literally dropped my jaw. Love the game, and if you like story and mathematical strategy, you may too.",
            "review_score": "1"
        },
        {
            "review_text": "Cute choose-your-own-adventure type game with branching story paths and some trial and error replayability.  The art and music are very good for this type of game.  This is probably one of those love it or hate it games, but you should know by looking at the screenshots which one you are.",
            "review_score": "1"
        },
        {
            "review_text": "I made her the greatest military leader this land has ever seen, crushed countless rebellions and threats, but died because she didn't know that if an arrow gets shot into you that you should NOT shove it deeper into your body.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Extremely good game, Addiciting as hell. Be warned you will die many times :L",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ING SAVE ALOT SIMULATOR",
            "review_score": "1"
        },
        {
            "review_text": "you like own a kingdom and ♥♥♥♥ and it's hella cool controlling your mood in order to help benefit your kingdom and ♥♥♥♥.  it's kinda confusing sometimes but that didn't stop me from binging on it for like 7 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth the $10 price. Clever and cute storybook strategy game wherein you guide the princess through her adolescence to her official coronation by helping her with her studies, personal activities, attending parties and royal decisions. The game also features an interesting learning system that takes the princess's mood into consideration. This game has a dark sense of humor and lovely artwork, including outfits you can unlock for achieving study goals. These outfits grant useful buffs to use during the story and they are also cute. The repetitive music is the only nitpick, but it's an easy fix: Just turn it off and find a fantasy game soundtrack that you like on YouTube and play that in the background instead (I found this simple modification to improve the experience). Because this is a *strategy* game of surviving court intrigue and war, re-playability is high.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wondered how you'd fair as a cute little princess? If so, this is the game for you. You must face all the challenges that a young princess must over come such as, deciding to learn magic, how not to get shot by an arrow, being a field medic, keeping up diplomnatic relations with your neighbors, not getting stabbed, not dieing, who to kill, spying on your neighbors, and if you make an oopsie, dealing with a rebellion! Take your chances and become the cutest little queen! Oh do remember two things, don't die, and dont eat the chocolate.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute blast to play, but be warned, you will die a lot before you finally survive to your coronation. Every choice has reprecussions, both good and bad. Assassination, betrayal, sacrifice, they are all tools in your hands as you try to survive in the hostile political environment.  ",
            "review_score": "1"
        },
        {
            "review_text": "Best use of a farm animal: hunting dog saves you from one of the silliest deaths imaginable.",
            "review_score": "1"
        },
        {
            "review_text": "Fist try: crushed the rebellion, but my weakened kingdom fallen to foreign invasion. Second try: prevented rebellion, but got poisoned Third try: got assasinated N-th try: returned magic to the land, got hapily married, brought golden age to the kingdom. What I want to say is: brilliant! Absolutely brilliant game! Definitely worth trying to figure out who is plotting what and how to save everybody just to see that unambiguously happy end (after much death, grief, restatrs and bittersweet ends).",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is a surprisingly addictive and challenging visual novel. You play as fourteen-year-old princess Elodine, whose mother, the queen of Nova, has just met an untimely end. As a result, Elodine will be crowned queen in one year. That is, if she can survive that long.  Survival is your top priority in this game and is much more difficult than it first appears. You will die. There are a total of eleven possible ways to die and plenty of opportunities to meet your demise. You could face anything from a civil war to assassinations to foreign invasions. My first death involved chocolate.  The gameplay is deceptively straightforward and simple to pick up. Each week you must decide which classes Elodine will take to increase the skills you want her to have. What skills she does or doesn’t have will determine her options during events and often the outcome of your choices. On top of this, her emotional state will affect how receptive she is to learning different skills, and bonuses or penalties are awarded accordingly. Learning skills she has a bonus for will help her learn those skills much faster, but penalties can actually make studying certain skills pointless until you change her mood. There are eight moods you must balance, each negating another mood, along with a hidden cruelty stat that can help or hurt you in the right circumstances.  Reaching the coronation is satisfying itself, but how you survived the year will lead to different endings. By the time my Elodine managed to become queen she was a cruel, power-hungry monarch. The ruthlessness that allowed her to survive had many consequences, not just on her but the people around her as well.  If you’re interested, there is a demo available at the Hanako Games website for Windows, Mac, and Linux which is long enough to give you a good idea of how the game plays. Save files from the demo will transfer to the full version, so you won’t lose your progress either.",
            "review_score": "1"
        },
        {
            "review_text": "If you like to do hard choises this game is YOUR GAME! you have to keep this princess alive and the same time keep your kingdom. And belive me its hard. Your goal is to keep her alive to she gets the crown on her head. And you have enemies everywhere. One wrong pick and it can be your death. But, if you pick good stuff and pick the right stuff you will make her continue live. Ive lived long once but still not enought to get to the goal. its not esay , it makes you go crazy but i will continue! one day i get her to her CROWN!",
            "review_score": "1"
        },
        {
            "review_text": "Its is actully really fun and interesting , even though somtimes it can be annoying as thier is no way to avoid death   But overall a great fun indie game",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!! It's so hard though!",
            "review_score": "1"
        },
        {
            "review_text": "Ever wonder what it's like to be a magical girl in charge of a kingdom where everyone is trying to bump you off and steal your rightful throne? Now's the time to find out. Good luck surviving to meet your coronation day!",
            "review_score": "1"
        },
        {
            "review_text": "nice music and pictures this is awesome!! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A fun unique game with an interesting humouros plot and a great variety. The cutsey astetic is refreshing and interesting. Definetly worth the $10 A fast favorite",
            "review_score": "1"
        },
        {
            "review_text": "This title suprised me, like really suprised me! This was so much fun and so many emotions were going trough my head while playing this. Totally worth the price, try it out and cry tears of failure and happiness!",
            "review_score": "1"
        },
        {
            "review_text": "Crying cause i'm not a good queen",
            "review_score": "1"
        },
        {
            "review_text": "was surprised how much time i've invested in that, took me almost 9 hours to complete :) still, very enjoyable casual game, i had loads of fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "A game that may anger you, but has a very diverse and complicated story line that branches out depending on how you act. The game itself is very replayable.",
            "review_score": "1"
        },
        {
            "review_text": "I thought this game was going to be a waste of four bucks… But no its fun as hell!! Help this little girl become queen in 40 weeks. You will be raising her stats in different areas, and new story paths will unfold for you. Oh and don’t get you’re self killed! There are soooo many different ways to die in this game its fun on its own.",
            "review_score": "1"
        },
        {
            "review_text": "On the surface, Long Live The Queen is about princesses and pink hair and paper doll mechanics, but once you begin Elodie's journey, all of the simplicity and cutesy VN regularities fall away, and you're left with an engaging, action packed, emotional experience brimming with possibilities, humor, and depth. Your choices shape your fate, and the school/home interface is a brilliant way to bring about new aspects of the story.   Overall, this has been my favorite VN to date, and I still haven't unlocked every possible outcome. A+++ Steam needs more games like this one!",
            "review_score": "1"
        },
        {
            "review_text": "If you like Pink haired waifus who try not to get themselves killed, this is the game for you. Also, it has a lot of cute outfits.",
            "review_score": "1"
        },
        {
            "review_text": "This is Long Live The Queen, the exciting Novel/Choose Your Own Adventure game.   In this game, you play as Elodie, a crown princess that is about to come to rule. The game is composed mainly on choices the player makes. Every in-game week, you select what skills you wish to study, studying a skill increases Elodie's knowledge in that range. The skills range from court manners to horse caring to military strategy, and later to magic. The game has a somewhat strategic twist to it, because events in the plot can be effected by Elodie's knowledge in specific skills. The game allows you to 'fiddle' with Elodie's emotions that allow you to increase or decrease the results of your studies. Your choices will either lead Elodie to her queenly rule, or to her utter demise. Though it can be frustrating when the lovable princess dies, you learn from your mistakes and prepares you for the future. Plus, you can use that anger as motivation to make better choices in your next save file.   I have to note that the game plays out more like a digital graphic novel rather than a full-fledged game. But if you're a fan of games with interesting stories, shocking twists, interesting characters, and the ability to shape the plot with the single act of skipping a history lesson, I suggest you pick this game up.",
            "review_score": "1"
        },
        {
            "review_text": "Difficult and fun, not childish at all. It's a hilarious version of Faster Than Light",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is part visual Novel, and JRPG. The gameplay is making choices and reading the events that unfold as princess Elodie survives multiple trials and events leading up to her coronation as Queen of the country. The first thing you should know is that it is unlikely that you will survive the first time around and I highly recommend saving regularly.   In this game, the story progresses week by week with an event occuring each week and a choice of classes to raise certain stats. How elodie handles the events and choices are determined by the stats; for example if she receives a necklace from a neighbouring lord; if she has enough points in court manners she would know that wearing it would mean she is pretty much willing to marry him and you get a choice in how you want to proceed. If you don't have enough points however, she will obliviously put it on and feel great because some nice guy gave her some nice new jewelry. These events and what happens in them will then effect future events and then the story progresses based on the stats you raise and the choices that they give you.  Raising the stats is also part of the gameplay, you have a mood meter which tells you what mood she's in and depending on the mood, she would learn certain stats faster (e.g. When she's depressed she is more into animal handling and improves the stat much faster while she will learn conversation skills slower). Her mood can be effected by the weekly events and you can make changes to her mood through choosing how she spends her weekend.  The game has quite a bit of depth to it and finding new story paths or to just find out what happens if you pass a skill check is quite enjoyable. The music is quite nice at times though there isn't that much variety and the amount of art is a bit lacking for all that happens, however it has a very involved gameplay and story which is fairly engaging.  Yes, it is a fairly challenging game and you pretty much win by remembering what happens and replaying it, but the amount of story and lore behind it and the sense of success when things go well makes replaying it still quite enjoyable (the function to skip dialogue helps too).  I wouldn't say this is the best game ever but its a decent game and I enjoyed it. Its definitely worth a shot if you are into visual novels or maybe into rpgs.",
            "review_score": "1"
        },
        {
            "review_text": "Best $10 I've spent in a while.   For a visual novel, LLTQ has a TON of replay value. It plays a lot like Princess Maker, but a fair bit more dangerous, because you can (and likely will) die before your fledgling queen gets her crown. The different skills Elodie can learn provide a huge number of variables for the game to interact with. There's different ways you can win, but trying one path (excelling at social events) will make it difficult to excel at another (repelling an inevitable invasion) due to the fact you have a limited time to train her.  This is definitely a strategic game, but not at all action-oriented. You make choices and read the results, and adjust your choices accordingly, at the next scene or the next play-through. It isn't nearly as random as some of the negative reviewers seem to think, though. Events do happen at more or less predetermined times, either by time of year or in a chronological series, but WHICH events occur are going to depend on Elodie's skills, current mood, and previous actions.  If you're ok with point-and-click play, lots of reading and cute anime graphics, then definitely pick up this game. :)",
            "review_score": "1"
        },
        {
            "review_text": "I could not recommend this game more highly! It is a fun and serious game all in one. Just be prepared to die....",
            "review_score": "1"
        },
        {
            "review_text": "Parenting-a-high-maintenanced-daughter Simulator   'Prepare to Die' - Long Live The Queen a.k.a Dark Souls' True Sequel",
            "review_score": "1"
        },
        {
            "review_text": "This is a great fun game. Really tricky but ever so fun! Just when I think I have the perfect balance of skills Princess Elodie faces a new challenge and I manage to get her run through with a sward or poisoned or something.  The graphics are simple and cutesey but it seems to work for the game. Very strategy centric like a stats card game or something like Risk.  Good fun, cute game, nice diversion over Christmas.",
            "review_score": "1"
        },
        {
            "review_text": "If you love silly adorable death scenarios and playing a pretty, pretty princess; or just analyzing stats and skills and emotions like mad THIS GAME IS FOR YOU. Im never really good at (or a fan of) these types of games but theres something about Long Live The Queen that keeps me rooting to finally not be a Pissant Princess. (That, and the Badge is desireable, too ;D)",
            "review_score": "1"
        },
        {
            "review_text": "Very cute and charming game. Can be played as a puzzle game, making calendars and manipulating your mood to get skill bonuses to pass various checks in order to get the 'best' ending. However, I found it more enjoyable to just play it like an old 'Choose your own adventure' book and see where the story takes me.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game! Challenging, exciting, and great artwork too.  The only thing is that I wish it was a bit longer. But other than that I would definetly reccomend this :)",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly deep. While there is a ton of different events and branches you can go down, the biggest limiting factor of the game is that they always play out in the same order.",
            "review_score": "1"
        },
        {
            "review_text": "So much fun.  Strategical, time-based, magical involvement, character development, lots of death.  Don't be fooled by the cute-ish image, it is hilariously dark. And difficult. I've died so much, it's ridiculous DX",
            "review_score": "1"
        },
        {
            "review_text": "If you want to be kawaii in a magical princess kingdom, then you boys will love it!",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty fun and quite addictive, although I had referred to guides to decide which skills to focus on first.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting strategy game, required multiple, MULTIPLE plays. I didn't mind though, as some of the outcomes are so unexpected it keeps you from getting bored. Definitely a case of 'don't judge a book by its cover' if you are on the fence due to the cute look of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Reqiures a lot of thought, very puzzling and mind bending. Lots of fun too!",
            "review_score": "1"
        },
        {
            "review_text": "I had been waiting for this game to go on sale for a month or so... and I pounced on it the second it did. I installed it today and ended up playing for 8 hours (according to Steam) until I reached the ending. The mechanics of the game are simple, you have skills and a dynamic story, however, the story itself is a true with endless branches, and the relationships between skills and story points is so deep, the the game seems to have unlimited variety and possibilites--though not all of them end in victory, or coronation, rather. If you like quirky games with clever humor, obviously with some Japanese influence, and enjoy a good story--along with plenty of cuteness, Long Live the Queen will have you occupied for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Underneath the cute girly exterior, underneath the simplicity of each action, is a game of political intrigue that could rival Game of Thrones in its brutality. Don't be fooled by appearances here; Every encounter could be leading to your downfall. The beauty of the information thrown your way is that, through subsequent playthroughs, you'll be equipped with more information than before. And sometimes, what you've learned leads to unexpected results. Give this game a shot, it runs even on weak computers and is an excellent time killer.",
            "review_score": "1"
        },
        {
            "review_text": "First off, don't look up this game... or at least don't wiki it. Second, this isn't an action game... but it's a very relaxing game... er... kinda... til you die. Third, in this game: You. Will. Die.  I'll admit, I had seen the trailer for this game when it first came out on steam and I snickered. 'What a silly concept... but it's interesting. Heh, I hope it does well.'  Eventually the game would get its first Steam Sale. So in the morning, nursing a hangover, I picked up the game and thought 'Meh, why the heck not. What have I got to lose?'  Apparently an entire weekend. (And more to come)  I got caught up in the game pretty fast, although my background is very varried. I like RPGs, RTSs, Rhythm, adventure, 2d side scrollers, I could go on and on. On occassion I like grabbing weird gems like Long Live the Queen and boy did I not regret it.  I'll say this now, this is a hard game to explain. Trust me: Saying 'You play a Princess and your goal is to live.' is going to be one of the weirdest things you'll hear from a guy's mouth.  The game itself goes at your own pace, and is a lot of reading. Well, to the extent that you can skip dialogue, but you'll want to read it because it may or may not come into play in decision you make in the game. The game itself has great replay value. The way you die feels like an ending, and even when I became Queen (twice so far) you feel like you could of done better. You can save at anytime, which was a huge plus for me as I work alot, and you could place the game in 1 minute, then go about your business. (I do not recommend this, because you might forget what's going on) If you do pick up this game, all I can suggest is: The first time you play, play it with one save file and play it up to your first death. (If you got to the end on your first time around, bravo! I've yet to meet anyone who lived their first time playing)  ***SPOILER (For one of my deaths)*** Some context of how contagious this game could be: The first day I played it, I more or less posted my first death on FB. But I described it as such: 'So I bought the most interesting game ever... Oh wow, it's 11:30 already. Anyways, so far I've died from an ambush. I got shot by an arrow. Because my character lacked knowledge in medicine, but remembered, it is good to push an arrow all the way through... She died because she hit vital organs on the way out. I'm playing a game where I'm a princess, and the goal is to live to the end @_@;; WTF'  That post apparently got my coworkers to look into it... buy it and try it out.  'Dalis - YEAH DEAD SNAKE AND NO ONE BITTEN ♥♥♥♥ YOU SNAKE  Ryan - ♥♥♥♥ YEAH. PRINCESS COMPOSURE  Dalis - BOOYAH'  Now imagine a bunch of grown 30+ year old men and women celebrating these achievments over a game where you're a princess. We got SO many weird looks, but this game became more awesome when we got our other coworkers and friends to play it. ;)  Give it a shot, really! The game itself is very enjoyable. :)",
            "review_score": "1"
        },
        {
            "review_text": "'Long Live The Queen' is a fusion of visual novel, choose your own adventure, stat-based roleplay, and a hint of the roguelike death factory. The game concept is simple: by chosing training, social events, and in-game choices you try to guide Princess Elodie to her coronoation following her mother's most untimely death. The pretty graphics, cute outfits, and anime-esque drama is just the pink icing on a dark chocolate cake of strategy, deceit, moral choices, and of course lots and lots of death. Getting the Princess to coronation is a tough job, and you might need to murder a few relatives, marshal magic, lead an army, or simply lie like crazy. On top of the fast play and fun is a complex world of politics that's equally intriguing. If you like a story-driven choice game and don't mind a high body count, this may be for you!",
            "review_score": "1"
        },
        {
            "review_text": "On the whole, I enjoyed Long Live The Queen quite a bit. The decisions are based on your skills, and your skills are based on what classes you've taken on your path towards the crown. A logical train of thought further enhanced by accounting for the MC's emotional state. Not sure if I'd call it a gripe, but it can be hard to tell when a important decision is coming up or what you need to not fail the choice. However, for me, that led to one of the more oddly entertaining aspects of the game: dying. There are ways to ensure your demise, and decisions that you can make that lead directly to your death. In short, loved the game, good replayability due to the impact of your decisions on what happens in the story, and for the most part, believable characters.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely hilarious and addictive. You play as a fourteen year old girl, trying to survive until her corination. There is death, beheadings, poisoned chocolate, and arrows that you shove into your intestines because, well, you're not really that bright.   I would suggest this game over and over again. It is not easy, but it is a nice, slow paced game that is fun to play and changes, within certain reasons, each time you play it.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is an amazing game. There are so many routes to discover and even a slight dating sim aspect to it. The amount of endings is crazy. I fell in love with the story and world so quickly. It is very strategic and not a fast paced game. It isn't for everyone, but a lot of people would like it.",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good once you get over all the pink",
            "review_score": "1"
        },
        {
            "review_text": "Useful info: This game does not support 1080p resolutions. I play at 1024x768, it seems, and you can't change resolution, it seems to auto detect.  Now onto the actual review: This game is simple, however, it gave me the nice 'just one more turn' effect that few games do, and I ended up playing for hours on end. There are a lot of ramifications and you end up making conscious decisions the more you play. You die a lot, and you learn by your mistakes for the next turn. Took me several tries to finally become Queen.  I recommend to casual players, it's very different from usual games and a nice change of pace.",
            "review_score": "1"
        },
        {
            "review_text": "Short, toned down, repetetive, no animations, no voice, looped monotonous piano songs. And yet, it involves little lovely princess that everyone and everything around want to find dead, during diffirent playthroughs when you think you have everything under contro-BAM!enemyfleetisatshoresandyoudidntevenprepareyourarmyguesswhatyouredead. For those moments I thought it was worth playing, just because you sung beautifuly to a hostile guy in order to steal his heart doesn't mean you can hold a proper conversation with him due to no talking skills, this and whole lot more random stuff that happens when everything is going fine but then spaghetti starts flowing out of your sweet princesses' pockets resulting in her unavoidable death soon after. I guess it's just appealing in its own way, and it definitely won't be for everyone, some will see in this game only things mentioned in first sentence, while others will enjoy the contrast of cute little protagonist girl bleeding to her death. :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is not only cute and suprisingly challenging (have not made it to her Coronation once yet) but it's gameplay system is really interesting and allows for a lot of experimentation once you start playing it a few times and remember which checks go where.",
            "review_score": "1"
        },
        {
            "review_text": "Ever play Princess Maker? Imagine that, except the Princess is raising herself and instead of the 'bad ending' being that she grows up to be some patriarchal idea of a fallen woman, the bad ending is when she's run through with a sword. Or impaled by arrows. Or breaks her neck coming down a flight of stairs. Good luck surviving to coronation!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like teaching someone how to be better? How about making sure they don't die? Magical girls? If you answered 'Yes' to any of these questions, then buy this game. It's pretty good, d00d.",
            "review_score": "1"
        },
        {
            "review_text": "A Duke challenged me to a duel. *Burned him to cinders with my magic* Then said 'I Refuse!'  10/10  All honesty Game's hard not to die lots of times but once you start understanding your choices, it's pretty kick a&lt;3&lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly addicting game. Great graphics and pretty interesting storyline. I'm sure I'll spend many more hours playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Despite a lower metacritic ranking, Long Live the Queen is the kind of game that is just plain fun. I wouldn't get it at full price, but it's worth picking up at a discount or as part of a bundle.  Elodie is the soon-to-be Queen of Nova, and with that comes wars, rebellions, politics, and magic jam-packed into a visual novel. The decisions you make in how to train her, as well as how you behave in conversation, shape how the game turns out and whether she survives to her coronation. If you're looking for grand strategy, this is the wrong game - Long Live the Queen is more about enjoying the story and making decisions rather than using foresight and presence of mind to 'win'.  Despite being a game so heavy in decision making, the biggest complaint is these choices (almost all of which have skill checks associated with them) come with no warning, and a bad choice is sometimes instant-death. Which skills become handy is anything but obvious. For instance, my magic-heavy Princess could not complete the game the first time because I was short on either the decoration or the swords skill. I mean really, I couldn't finish the game because my ability to decorate wasn't high enough? There are also a lot of skills that go unused depending on choices, but there's little one can do about it because, again, the game gives little warning about these events and what is necessary to complete them. That being said, there is also a great level of satisfaction to correctly anticipating danger - who thought court manners and composure could save your life?  However, with proper use of save files, you can greatly reduce the stress of the game and have a lot more fun with it without worrying about starting all over again. As well, I recommend a second/third playthrough using the debug console to set your skills where you want them just so you can see the kinds of choices available and focus purely on the story.  As for the story, there are perhaps too many characters coming in and out. Elodie is a well established character, but everyone else seems to flit in and out of existence. Some characters such as her mage mentor and father make regular appearances, but not her supposed best friend, any suitors chosen, or any of the massive slew of lords and ladies. That being said, Elodie is adorable, and it's hard not to like her. She can be lighthearted or ruthless, as one's skills selections and choices will fling her in all directions of the personality spectrum.  If you've ever played 'Magical Diary', Long Live the Queen is in a similar vein - it's a visual novel with a plethora of possible outcomes dictated by the choices you make in-game. Unlike Magical Diary however, Long Live the Queen is almost merciless in how it treats its titular character, which is odd given it's almost too feminine nature. Nevertheless, despite all criticisms, it's a good bit of fun, though I would recommend looking elsewhere for something more 'serious'.",
            "review_score": "1"
        },
        {
            "review_text": "So, I have to admit, I never right reviews on games. So when I do, you had better listen up.  This game is incredible. Certainly story-driven, but there are so many different paths to take in the story that you'll end up spending hours desperately trying to unlock that mysterious one secret path you never quite leveled up the right skills for. You may think you can just copy and paste your strategy, add a little here, take away there, but by the time you adjust your class schedule even a bit, you're already down a new, interesting path based on the consequences of events.  This game is amazing and well worth the price. Get it. Now.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Kind of short, but it has some decent replay value. Definately worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "What is Long Live The Queen? - A text-based choose-your-own-adventure style RPG.  What I liked about Long Live The Queen: - Decently-long (1-2hr) branching story with many different possible endings. - Large number of interesting skills which affect the story in surprising ways. - Mood-management system adds satisfying level of complexity to training via boosts and negative modifiers. - Visual feedback system for skillchecks helps hint at storyline branches and missed opportunities, ehancing replayability.  What I didn't like about Long Live The Queen: - Game events proceed in the same sequence each time and only branch based on player actions - more randomization might have been fun. - Hidden skillcheck levels and complex multi-tier skillchecks for certain encounters leads to a lot of trial-and-error to find successful combinations. - The precise effects of the mood system on the skills bonuses must either be learned by trial-and-error or through the help of a third-party wiki/guide. - Art and sound assets are fairly limited - a few characters do not even have profile pictures. - The character art is highly anime-stylized - it would have been nice to see a wider range of facial characteristics to help differentiate characters from one another.  Overall: I enjoyed the game enough to play it through several times. At first it felt fun to try different skill combinations and choose different story paths. However, eventually trial-and-error tedium took away some of the fun and I found myself resorting to using a wiki to figure out how to get the results I wanted. It would have been nice if the game gave the player more information, such as the skill levels required to pass certain checks and the precise effects of different moods. As a budget title this game is worthwhile, but be warned that it can also be frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "It's an average RPG of living like a princess, with a story in which your choices menans a lot to survive.  The cons are that the music is repetitive and the story is always the same.  But, that was the objective of the creators, I guess. To survive the story. Also, its seems a game made with love.  It's entertaining.  Buyit for 3€ or less, you will like it :)",
            "review_score": "1"
        },
        {
            "review_text": "A challenging, funny and slightly twisted game.  Don't get scared off because it's pink or about a princess!    Listen to a storyteller with a kind, slightly condecending voice mention how you oh dear, got stabbed by a sword, what a pitty. Try out all the different ways to die!  An anime style game a bit like a visual novel, but with a lot more choices and more than a little tactics, tryal and error. Choose between, combine and master lots of different skills. Will you focus on courtly behavior or learn all you can about military? How about history or trade? In a land where magic is mistrusted, will you avoid it or learn more about it? There are lots of possibilities and your skills will detemine options and situations later.   Notice how your mood changes your ability to focus on the lessons. Make sure to find activities to adjust your mood in the wanted direction.  I recommend this game for anyone who wants to explore and develop their characters and their personality",
            "review_score": "1"
        },
        {
            "review_text": "It's the Dark Souls of point and click games. Prepare to get #shrekt",
            "review_score": "1"
        },
        {
            "review_text": "Long Live The Queen is a political strategy game. It seems fairly simple at first, but it's actually quite deep. Be prepared to die. A lot. One bad thing about this game is the music. It gets incredibly annoying for extended play sessions. Mute it and bring your own music. One other thing. When I purchased the game I assumed that it was going to be a random beginning every time. Well, it's not. There are no elements of randomization whatsoever.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Already have my money worth out of it on a single playthru, and there are 100s more plays potentially in the game. Fun Fun Fun!!",
            "review_score": "1"
        },
        {
            "review_text": "Spent half the game dodging marraige proposals from guys twice my age, then had to fight the Kraken. I don't know which was scarier.",
            "review_score": "1"
        },
        {
            "review_text": "Very cheap, but very fun. Much more than i was expecting from it.  The definition of a stats based rpg.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Killed by chocolate",
            "review_score": "1"
        },
        {
            "review_text": "there is a class about falcons. 11/10 would learn about falcons again.",
            "review_score": "1"
        },
        {
            "review_text": "This game was surprisingly really good tho...",
            "review_score": "1"
        },
        {
            "review_text": "The true successor to Dark Souls",
            "review_score": "1"
        },
        {
            "review_text": "A most wonderful and intriguing game with a deceptively simple gameplay which in truth hids an ingenious and subtle strategic challenge. The player is required to prepare the main character so as to have her, the princess, survive through all the dangers lying between her and the day of her coronation. The challenge lies in the fact that such dangers are various, hidden or sudden and even the most scrupolous and rigid princess trainer can meet failure by the hands of dirty underhanded traps. This is to add to a scripted plot which will have you face a great variety of situations which will spell doom for those who will simple and single mindedly specialise too much only in certain education branches. Every situation, every trap that lies ahead, requires planning to get through and one must be ready to make sacrifices or to be flexibile along the way so as not to perish. The first run of the game is the most fun and bloody and frustrating of course, with the player discovering the scripted plot and its dangers little by little, but it is the most satisfaying too, due to the sheer joy one feels when (though it would be better to say IF) beating the game and finally reaching the coronation ceremony - it doesn't matter how, if by civil war bloodshed or by enforcing your royal divine right through magic or both, you will just feel relieved and super badass for playing it right. Subsequent runs of the game keep being entertaining due to the amazing number of combinations of choices to explore so as to unblock all achievements and unveil all the hidden subplots of the game, which I found really well crafted and enjoyable.  In conclusion, the pretty girly graphic is but a cover for a truly magnificent and genial gloomy, grim plot worth of the best fantasy books. The setting itself is pretty solid too and one cannot but marvel at such a precious gem this unfortunately pretty unknown game turns to be.  Last but not least, a note of caution and a piece of advice for new players: beware whom you trust.",
            "review_score": "1"
        },
        {
            "review_text": "Don't judge this game by it's cover, it's not what you're thinking. If you like games like Monster Loves You! with muliple paths and endings you'll like this game. I find this game relaxing with a slow pace and it's easy to play a round or two then stop. Just needs the mouse to play.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game for a fairly quick run through. I still haven't beaten it but I would say the game lasts around an hour or 2 if you know what you're doing. I beleive there are many different ways to win. The goal is to make it to your 15th birthday and become Queen, but people are trying to kill you along the way. You try, through trial and error, to increase your skills as the princess to overcome those attackers and assassin's. Everytime you die you start over from the beginning, but you're suppsoed to use what you learned from your last run through to make better choices this time around. Like I said, it's a fun game for a quick run through. Very basic and text heavy, not much in the way of gameplay. It's mostly menu management. So if you're into that sort of thing and strategy then I think you will enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I always get killed by the chocolate because I keep forgetting what skills to level up, but its still an interesting game. It sucks most of the events are timed and not random though.",
            "review_score": "1"
        },
        {
            "review_text": "I finally fulfilled my dream of being a military obsessed princess 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you ignore the fact that this game is super casual and is meant for girls or guys with softcore hentai fetishes, it's super good. It's simple, and the speech checks are varied throughout the game, meaning that focusing on one skill won't win the whole game for you. There are unexpected events in the story which make it interesting the first time you play, but the story doesn't change so you can know what is going to happen and what needs to be prepared for. In terms of replay value it's not great, but it's still fun to go back a couple of times to see what would have happened if you had picked different skills or chose different speech options. Fantastic game, but the appearance of the game repels all the friends I've recommended it to. Fixing the alt-tab so that it doesn't cut off the bottom half of the screen when returning to the game would be nice. I would like to see a game like this, by the same company but with more visual elements and a different theme.",
            "review_score": "1"
        },
        {
            "review_text": "while playing this game, a friend had an upcoming birthday. all i wanted to do was visit that friend. i never asked for this",
            "review_score": "1"
        },
        {
            "review_text": "i keep ♥♥♥♥in dying someone prove u can win this",
            "review_score": "1"
        },
        {
            "review_text": "Yeah this game... Really.. Nice?",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wished to be an underage princess, this is your game. A++",
            "review_score": "1"
        },
        {
            "review_text": "I had her become a magical girl and she conquered without learning anything really applicable to being a queen. Just how to blast her ♥♥♥♥ing enemies with magic and how to dance like a champ.   Tried to make her actual queen material and she died.  Lesson learned.",
            "review_score": "1"
        },
        {
            "review_text": "What I wanted was a royalty sim/RPG, what I got was a protracted puzzle game with multiple, unintuitive dead ends, forcing you to play in a very specific way to achieve very specific results while avoiding very specific deaths.  Not really a bad game, mind you, just not a game I'm quite keen to continue playing.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a really fun game, and quite addicting to see where the story changes, but you're going to be hand in hand with the Trial-and-Error twins the entire run through, and would probably be saving constantly to avoid any choice you didn't want",
            "review_score": "1"
        },
        {
            "review_text": "many options, very challanging.",
            "review_score": "1"
        },
        {
            "review_text": "There is a picture of a cute little anime princess on the menu splash screen. The game, though, is not cute - it's actually rather heavy and full of political intrigue and tough decisions, and it is surprisingly difficult. You have a year or so to prepare to be crowned queen, but you have to survive assassination plots and foreign military invasions as well as navigate the treacherous waters of court etiquette. But what do you focus on? Where do you need to succeed, and where is it 'safe' to fail?  I don't know. I can't seem to keep myself alive long enough to see myself crowned queen.  But I like this game - or, rather, 'visual novel' - enough to keep trying. There is lots of replayability because there are umpteen little decisions to be made which can influence the outcome significantly. I haven't played through a visual novel of this sort before, so this has been an impressive introduction, and definitely (for me at least) worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "The most adorable princess killing simulator.  5/5",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is far more fun and challenging than it looks.  Essentially, you select what classes Elodie, the young queen, takes each day, or what recreational activities she otherwise does. Not having enough training in one area will get Elodie killed. A lot. Be prepared to die, a lot. But it's not punishing; each death just makes you want to try again and again, and before you know it, it's 2am and you've forgotten to eat.  Give this a try!",
            "review_score": "1"
        },
        {
            "review_text": "This is deceivingly difficult, but it's so rewarding to get ALL the things. You'll keep playing.... even if it's rage inducing...",
            "review_score": "1"
        },
        {
            "review_text": "Magical girl outfits and tentacle monsters. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "Unleash your inner princess!",
            "review_score": "1"
        },
        {
            "review_text": "The game is reminensent of a choose your own adventure book with several diffrent paths you can take to success, failure, or your ultimate demise. It's well executed and extremly simple while offering a great deal of replayablity despite the major story elements not being random. I don't see this as a game you'll be sinking hundreds of hours into it but its definatly worth at least $5 to $10 USD. If you're on the fence about it I'd suggest waiting for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "In this interesting visual novel role-playing game, your princess has to survive 40 weeks till corronation. Please, what is the worst thing it could happen to your princess? Not much...expect she could be shot, slashed, sliced, choked, poisoned, drowned at sea, choked with magic, blown herself up with magic........ Meet the Dark Souls of visual novels...when it comes to difficulty and dying often. X)",
            "review_score": "1"
        },
        {
            "review_text": "Do you like teaching someone how to be better? How about making sure they don't die? Magical girls? If you answered 'Yes' to any of these questions, then buy this game. It's pretty good, d00d.",
            "review_score": "1"
        },
        {
            "review_text": "If you want get bored less than in five seconds or you are fan or visual novels, play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy this game. It's a great time sink.",
            "review_score": "1"
        },
        {
            "review_text": "Survive = Failed Beat the game = Failed Read Guide = Succeeded Retry = Succeeded Beat the game = Failed    10/10 Best Girl Murder Simulator",
            "review_score": "1"
        },
        {
            "review_text": "Kind of neat but gets annoyingly repetitive before long, because it's so easy to die and the events of the game seem to play out pretty much the same each time. Like one of those choose-your-own-adventure books where every other choice is death, and there are only one or two genuine paths through the story.",
            "review_score": "-1"
        },
        {
            "review_text": "Queen Says  Long Live The Me!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Hello! Here a Review in English. Excuse for my bad english. This review i apart from my personal opinion and will analyze the benefits of this Game:  Positive: + Good Soundtrack + Very easy to learn all + Simple game Mechanic, with deep, very deep game System, what wants you dead XD + Lol you can die through everything i learned the hard way. + You can dig many hours of gaming. when you wanna do all achievements (for me it was too tiring XD) + many Chars (wow background stories too) + You can play different ways. So every playthrough can be different + No crashes and errors. + You have to think alot, when playing without a guide.  Minor Negative points: - Not much action, well its a visual Novel Game (with Managementsystem) - Can be challenging or frustrating, when dying a lot - You have a lot to save!   I give the Game a solid 75%. I am not really into Visual Novel Games. But i like the idea, behind this Game. So i give it a solid + and -. My personal opinion is, when you love the + points go for it. Cause it can be sometimes boring for alot of ppl....",
            "review_score": "1"
        },
        {
            "review_text": "It's really quite special. Ignore the Magical-girl wrapping paper, this is Game of Thrones, complete with it's own white walkers.  Additionally, Linux support is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is probably best played by the sort of people who meticulously &amp; lovingly craft their ideal Pokemon team by breeding multiple generations of them &amp; keeping track of all of the stats &amp; traits &amp; numbers &amp; figures &amp;etc. instead of just, y'know, blazing ahead with the first five things they catch.  If you, like me, are not one of those meticulous craftspersons (you will know this because you somehow always had a Pidgeotto on your team to fight the Elite Four, for no reason other than that you caught it near Pallet Town &amp; just sort of hung onto it), you'll probably love fumbling your way through this game into different, wildly amusing death scenarios. It's a lot of fun! But once you get serious about making Elodie live to become queen-- or, at least, to survive the forest adventure, just that one time-- do yourself a favor by finding the wiki &amp; taking a ton of notes.   Beating this game requires a certain level of precision on the part of the player not usually enjoyed by those who like running around and bashing things with a sword. If you are a thing basher, please, learn from my mistakes. Save yourself inevitable hours of headache &amp; frustration by taking notes.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very well done visual novel in my opinion. There are so many choices that change the outcome of the game! This is the firse visual novel I had ever played and I'm quite glad it was. I don't think I would have liked this genre very much if I hadn't. The only problem I had, and this is because this was the first visual novel I had played, was that it wasn't randomly generated. But all in all, this is a wonderful game and I would most certainly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "It's just like being a real magical princess who has to study everyday and arrange marriages with boring people for the good of your country. You get to decide if you want to execute people too. What more could you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "I like the Princess Maker franchise and so I had high hopes for this one. It doesn't seem bad at first, but the math soon unravels. I don't appreciate failing a skill-check on my maxed out skills. There isn't really a sense of agency here, despite the dense presentation that promises an admittedly absurd (but par for the genre) level of control.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Made her the best strategist and fighter she could ever be; however, it all didn't matter when she stuffed her face with poisoned chocolate.",
            "review_score": "1"
        },
        {
            "review_text": "Ever want to see a princess get horribly murdered over and over in increasingly terrible ways? This is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Staying alive in this game is harder than in dark souls.",
            "review_score": "1"
        },
        {
            "review_text": "Literally the only downside with this game is that it's almost TOO difficult, which is good, but bad, but a bad good, and a good bad :3                  Don't Trust the Chocolate...",
            "review_score": "1"
        },
        {
            "review_text": "this game is fantastic and i highly recommend it to any stratagist or even casual players as it differes greatly depending on your choices.",
            "review_score": "1"
        },
        {
            "review_text": "Because I know all of you want to spend hours working on a play through, only to have that work ripped out of your hands by one poor choice, forcing you to start all over again.",
            "review_score": "1"
        },
        {
            "review_text": "When I purchased this game with other titles in a Humble Bundle, I didn't exactly know what I was getting into. In fact, this game had me so curious of what it was that I decided to play it first out of all the games I'd purchased.  I can honestly say I never expected this game to be so addicting. It's a visual novel with an excellent story to tell in many different ways. The ways to play are practically limitless. This is one of those interesting pick-up games that you never expect to like until its got to dragged into an addiction to see what would happen next if you changed something as small as how you handled one situation. (The difference between life and death in one choice)  The visuals are pretty, the writing is excellent, and the overall gameplay is engaging. I'd recommend to anyone who enjoys a good, changing story; or just anyone who's looking for something casual to play.",
            "review_score": "1"
        },
        {
            "review_text": "Uh. . . The Queen didn't live very long. . . Anyways. This game is pretty fun. You could say it's a management game in away, in the sense that you manage the protag's skills, mood, and decisions you make as Queen-to-be.  Basically you're sent back home to the castle and you have to start taking private lessons with your tutors to increase your skills in things like your knowledge of Medicine, Economy, Military, Faith, Royal Demeanor, Conversation, Expression, Animal Handling, Weapons, Athletics, History, and Intrigue. All of those are just the categories, there's like three sub-categories you can choose within each of those, so you kind of have to experiment what you think would be more useful before something happens; which is why it's nice they give you more than enough saves.   The significance of those skills is that if you have one of them high enough you can make decisions or it'll help you decide on what decision to make before something happens. It'll also make your situation better, like I maxed out my Military skills (Strategy, Naval Strategy, and Logistics) and I won a civil, pretty straightforward.  Then there's the mood system, where it adds a bonus when taking a class of a certain category, which just means you get more skill points in said class. Each mood has a set of bonus categories and a penalty to others. The penalty just does the opposite of what the bonus does, meaning you don't gain as many skill points in that category as much as you would normally if there wasn't a penalty  If you train a skill category far enough, you'll get an outfit; which boosts that category you got the outfit from. It adds some skill points when equipped, not too much but it can help.  The story, I'll leave that to the individual to decide. Eveyone has different likes and dislikes about things and I figure my opinion on such wouldn't hold much weight.  If you do buy this game, prepare to make mistakes and die a lot. You'd probably have to be pretty carefully about what skills you train to not die.   (feel free to correct me if I said something wrong) ",
            "review_score": "1"
        },
        {
            "review_text": "I have died so many times, and in so many ways.  I keep going back for more...  I still can't believe I unleashed a monster. Damnit. And it was going so well, too...  10/10, still playing. Going to avoid that monster this time.",
            "review_score": "1"
        },
        {
            "review_text": "Crying cause i'm not a good queen",
            "review_score": "1"
        },
        {
            "review_text": "Played it, expecting a ''Meh'' game. Surprisingly enjoyable to play!",
            "review_score": "1"
        },
        {
            "review_text": "Rather than long life of being a queen, I found myself playing a choose your own death. Generally, you die either because of a stray arrow or lack of diplomatic ability. The real fun is in choosing which one you die from for the 500th time. Costumes are cool too.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "I remember seeing promo material for this game and being pretty excited. And it is a very enjoyable, if sometimes frustrating game.  Pros: LOTS of options and story branches, I've barely scratched the surface Very dynamic  Cons: It's extremely easy to get caught in loops where you are fostered towards bad endings (Save often!) --now the game does have options where it shows you where/why you failed/due to what skill check but it's often too late when you get to certain parts of the game. If you can't raise your stats enough before dealing with successive events (or potential events) then you have to go a long ways back and re-evaluate your skill choices.  Overall I do reccomend picking this game up and giving it a try! I will probably be playing it for months to come!  ",
            "review_score": "1"
        },
        {
            "review_text": "Nice Princess Maker simulator",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game. Can get a bit tedious and repetitive with having to restart if you die but all the different options and choices are nice.",
            "review_score": "1"
        },
        {
            "review_text": "Danced with my maid causing all the nobles to go silent other than a twelve year old's nervous laughter  10 out of 10 would dance with maid again",
            "review_score": "1"
        },
        {
            "review_text": "The game starts out sweet and simple, to the point. You train her your way, and it's fun to see what expression she has next.  But then she recieves chocolates and eats them, without a choice for you, and you've trained her to know poison, but of course, she eats them anyways. Then if she doesn't survive you have to start an entirely new game and train her in poison. Then she is battled for her kingdom and you forgot to train in military.   The game basically teaches you which choises to pick later on so you can get farther, but I usually end up dying anyways.   10/10. This is fun for time killers, or just anything. I love it so much!!",
            "review_score": "1"
        },
        {
            "review_text": "Died By chocolates...twice...10/10, Luckily for me i managed to beat the game in only 4 hours unlike others, The game itself wasn't hard once i realized that (Game Mechanic Spoiler warning) the only skills that really mattered were swords, reflexes, medicine, military, and 100 everything in lumen. Overall, a interesting and fulfilling story and experience with a nice degree of challenge and fun game mechanics, i highly recommend this title and i give it a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, more fun than it looks. The cute art and music keeps you cheerful, the gameplay is very simple but keeps you thinking cause you have to be 10 steps ahead of the game. Decent strategy is needed for an A+ playthrough. Have fun getting to it though. Dying is ridiculously easy(but that's ok the impending sense of doom adds to the atmosphere).  Overall, 7/10 get it while it's on sale, it's worth playing but can get tiring in the long run.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely yes! 9.0/10  i have a magical pinky costume and studying magic(s) i am the ruthless queen i am married to a ♥♥♥♥♥♥♥♥♥           or maybe.. ended up in a Yuri Route",
            "review_score": "1"
        },
        {
            "review_text": "Was actually a surprising amount of fun, I took a lot of time exploring the various endings I could find on my own, before eventually hopping over to some guides to finish up. Relatively good value, and a very fun game in general.",
            "review_score": "1"
        },
        {
            "review_text": "An anime RPG about a Magical Girl princess where you die more than there are character deaths in Game of Thrones. 10/10 would unleash the Kraken again.",
            "review_score": "1"
        },
        {
            "review_text": "Really Interesting Game! It's very challanging and it requires a lot of puzzle skills! I'd reccomend it to anyone who likes a challange and visual novels!",
            "review_score": "1"
        },
        {
            "review_text": "Maddeningly addictive and very well-designed. I'd probably recommend this to anyone I care about and then some.",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was fun and interesting at first, but it quickly got frustrating to the point where I just didn't want to play anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Strongly recommended! This is basically a Princess Maker clone, but just as entertaining. The goal is to survive for 40 'weeks' (or turns) without dying. Make it, and your princess becomes a queen. You get the option of training your princess in various skills like weapons, economics, intrigue, magic etc.",
            "review_score": "1"
        },
        {
            "review_text": "you either die horribly or live long enough to see yourself become a queen.",
            "review_score": "1"
        },
        {
            "review_text": "Needs some grinding / learning by dying (learning by dying a LOT), but once you get the hang of it, you just can't help trying out all different options in order to get your princess just to live one day longer that her previous attempt... Very nice! recommend also their following game, Black Closet.",
            "review_score": "1"
        },
        {
            "review_text": "You like Dark souls? If so get this game, no i am not kidding behind all the cutie flafy drawings lies a cruelty and savagery that i am sure has inspired the author of the thrones series for future books.   You are responsible for quiding and ensuring the survival of your character until her coronation, a moody sheltered princess with no idea of how the world works and what dangers lurk in a medieval fantasy realm.  Death will come for you repeatadly, hidden in chocolates, wild creatures, chocolates, evil plotters and did i mention the bleeping chocolates?  If you have anger issues(or Wrath issues like yours trully) get this game at a sale as you will not be able to complete it due to ,argsgagag grAAAAHHH, interruptions but it will be fun. Anyhow sale or not get it. the schaudenfre alone makes it-ohh candy thank y-glaarch(death rattle), ",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Long Live the Queen is a charming little game about training your recently orphaned princess in the basic facts of life... Namely, you live or you die.  Through lessons on military strategy, history, diplomacy, charm, advanced negotiation tactics, and a myriad of other subjects, you can seek to fortify your princess against the powers that wish to see her demise. But no matter how carefully you plan, you'll learn most from lots and lots of trial and error... RE: Lots and lots of strange &amp; unusual deaths.  Choosing what subjects to emphasize in the training of your princess will allow you to live to see another day, or bring you to an unseemly end with a volley full of arrows, a rejected proposal, or even a box of chocolates.  Everyone seeks to control you. Most everyone wants you dead. Your father is totally useless (naturally).  The verdict: If you enjoy the cutesy anime art style and the many humorous ways in which your little pink princess can meet her maker, give it a go! The painstaking planning of her lessons the game requires to keep her on the throne and out of the grave is enough of a challenge to make even the most patient of gamers rage quit after the 100th death-by-ridiculousness in a row, but if you're in it for the adorably morbid fun, I think you'll be more than satisfied.  Good luck, and watch out for the chocolate. It gets me every time.",
            "review_score": "1"
        },
        {
            "review_text": "Im a princess irl but now i get to play one in this game and go from a princess and bloom into a queen. 10/10 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I was surprised by how much I enjoyed this game. I died several times before I was finally crowned, but it was far from frustrating because I could tell there were tons of different branches of the story to explore. I'm sure I've got many more colorful deaths to experience before I'm through.",
            "review_score": "1"
        },
        {
            "review_text": "Nice idea, well implemented, fun story, nice interaction between mood and training, but in the end the clearest example I've ever seen of 'Do it again, Stupid' gameplay.  You play the game until you die or reach a point where you fail in something you consider interesting. You then load back several saves, or restart, trying to add the training necessary to pass the check you couldn't pass. You reach that check again. Maybe you didn't train enough; try again. Maybe it's immediately followed by a *second* check you didn't know about; try again. Maybe you erred in your new training schedule, or choose a wrong weekend activity and throw your mood off far enough that your training speed is suboptimal, and you die to some check half-way there because you hadn't trained *its* compulsory skill far enough; try again. Maybe you trained *too much*, and now you don't have enough time to train to meet some future thread you don't even know about. Maybe there are two different skills you could train to get past this this point, and you chose the one which depends on other skills which turn out to be useless; try again. Maybe this thing looks interesting (or critical) but isn't *actually* critical and there isn't enough slack in your training schedule to allow training; try again.  I might finish this over the holiday season, but it'll be by maintaining a spreadsheet in a second window and iteratively refining a training and activity schedule over and over again. Or just reading more spoilers than I'm interested in reading for a game of this sort. AAAARGH! ",
            "review_score": "-1"
        },
        {
            "review_text": "dont be mislead by the adorable princess - this game is hard as nipples and i am obsessed. so far i got stabbed, magic electrocuted, poisoned, murdered by bandits and drowned. i also became an evil witch and murdered my own father. a++++",
            "review_score": "1"
        },
        {
            "review_text": "Super cute, even when killing your poor princess. I look forward to seeing what the developer brings out next!  (I wanted my princess to dance her way to the top. So I made her afraid. +15 to dance!~)",
            "review_score": "1"
        },
        {
            "review_text": "Survive = Failed Beat the game = Failed Read Guide = Succeeded Retry = Succeeded Beat the game = Failed    10/10 Best Girl Murder Simulator",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Get ready for a major brainteaser if you're trying to complete it. Took me around 8-10 deaths before I had a perfect playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "A very well drawn game with good music. The choose your own storline is a bit complicated at som parts but all in all, very good!",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game to play during a summer school class. It has high replayablity due to the different endings. Even though it looks like a child's game, it's actually quite challenging to figure out how to get all the endings without messing up somehow. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game with tons of replay ability!",
            "review_score": "1"
        },
        {
            "review_text": "A really good VN style game that may appear childish but don't let if fool you. Lots of ways to forge the princess into any kind of future queen you want, lots of ways to fail and die horribly too.  Long live the Queen! Unless she dies of chocolate poisoning or something.  learntoswim/10",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game on a whim and started playing out of curiousity. Before I realized it, I had basically blacked out for 20 hours in my complete commitment to seeing the most ridiculous ways I could die. Plus I'm now hearing the terrible music in my sleep. In general, the game has really high replay value, as there are so many different ways to shape Elodie and so many different paths that emerge as a consequence. And it gets a little easier the more you play, kind of. Maybe.   *Mild spoiler*: cruelest Elodie is the greatest Elodie (+1 cheerful for dungeons!) and one specific cruel Elodie led to the greatest of all epilogues.",
            "review_score": "1"
        },
        {
            "review_text": "A very engaging and enjoyable game. Tons of replay value and I really enjoy the art and the characters. Played 8 hours and have hardley any achievements, and since I love getting achievements, I'm 100% positive (atleast for me) there will be tons more enjoyment to be had out of this game.   Highly recommended,   10/10  Edit: I still have my eye on this, will play again, along with the rest of my backlog..",
            "review_score": "1"
        },
        {
            "review_text": "I am so powerful I will vaporize you with my magic! I fall in water and die because I never learned how to swim...",
            "review_score": "1"
        },
        {
            "review_text": "Haha this game, ah little Elodie is just really cute. You are a little princess trying to grow up to become the queen of her own country. Your job is to make sure that Elodie takes the classes that will be able to make sure she gets there which is definatly not as easy as it sounds. There are a looooot of problems that you have no idea are in place. Soo good luck, and long live the queen.",
            "review_score": "1"
        },
        {
            "review_text": "If I had to describe my aesthetic using one game, Long Live the Queen would be it. (some spoilers)  Pros: +Badass magical girl simulator +Actually difficult at times, especially if you're going for all the endings +I did one playthrough where I became an evil tyrant and killed everyone with a kraken and the next playthrough I saved everyone by pacifying the evil guy with my beautiful singing, like there is an ending for everyone +Cute marriage options, including a few ladies  Cons: -Honestly I can't even think of any -Even dying is hilarious in this game, there are achievements for it and everything -Literally zero bad things to say",
            "review_score": "1"
        },
        {
            "review_text": "Summing up this game:  If you mix up just a bit of Princess Maker with Game of Thrones, you'll get Long Live the Queen.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game, for what it is. Nothing beats killing everyone who opposes you while looking cute as hell!",
            "review_score": "1"
        },
        {
            "review_text": "Money Well spent, i love this game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun sim. Collecting all the achievements and unlocking all of the different endings and stories is very satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of game where once I finally figured out the steps needed to keep myself alive, I procceeded to discover all possible methods of dying. You know, for funsies.  I spent far, far too much time playing this silly little game, but at least it was worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed playing this game. While I couldn't keep track of all the lineage, the game did make itself clear by only mentioning characters as they were important. The multiple achievements are sure to keep you entertained for a number of hours as you try to make sure this princess actually lives 40 weeks...or not. There are achievements and cute images for each death she may experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game is deep and amazing and I love it.",
            "review_score": "1"
        },
        {
            "review_text": "one of my favourite games &lt;3 wish i had more to unlock in it but I think i did everything. i get nostalgic just thinking of the hours i spent up late at night last winter playing it. the music is kind of hypnotic too, maybe thats why i got so immersed",
            "review_score": "1"
        },
        {
            "review_text": "Super fun time waster. Try to win. I dare you.",
            "review_score": "1"
        },
        {
            "review_text": "Restored order in the realm with sword and blood, executed all rebels, saved country from civil war. I AM THE QUEEN! - Died by chocolate 10\\10 would die again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. +100hours playing and my little, sweet, innocent Elodie................. CAN'T BECOME A ♥♥♥♥ING PRINCESS. Stupid EloDIE, she continue to DIE. And I really can't do anything for that. She is so cute, but also so stupid. Even a box full of chocolate is a threat for her. But I will not give up. ONE DAY, MAYBE NOT SO FAR AWAY, I WILL BECOME A BEAUTIFUL PRINCESS. I SWEAR!",
            "review_score": "1"
        },
        {
            "review_text": "I died more times in this than I did in Dark Souls 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Solid game!!!   Hours of replayability, and so, so many things to do. Different ways to go about things, different ways to get several of the achievements, and the all-piano soundtrack is goregeous!  I do have to complain about the lack of variation in the graphics and character portraits. Joslyn only has his one portrait, and he's a major character. Also, the backdrops are pretty limited. Some more art would have been nice.  Overall, a very charming game! I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I still dont understand why knowing meditation has saved my ♥♥♥♥ more than swords or running.",
            "review_score": "1"
        },
        {
            "review_text": "This is the Dark Souls of Visual Novels.  You will Die... over... and over... and over... but if you take the time to learn from your multiple deaths you just might find a way to an ending that dose not end with you arrowed, bled out, choked, drowned, skull cracked, life drained, monster food, magiced blown up poisoned or stabed. and you may even have fun.  Good luck, and Long Live the Queen",
            "review_score": "1"
        },
        {
            "review_text": "It lacks the dungeon rpg elements of Princess Maker 2 but it's still quite fun!",
            "review_score": "1"
        },
        {
            "review_text": "If you can read and if you have a soul, you should play it. I can't help but loving this game and coming back to play it again and again, each time finding something new and amazing. One of the games you pray there were more of (still hoping for a sequel, pls Hanako?).",
            "review_score": "1"
        },
        {
            "review_text": "I died more times in this than I did in Dark Souls 10/10",
            "review_score": "1"
        },
        {
            "review_text": "When I first discovered that game, I had no intention of buying it. Luckily, there was a sale a few days later so I gave it a try. And oh boy, I was not disappointed. The first few hours were nothing but trial and error, however, after a few deaths I managed to survive until my coronation. From then on, it was nothing but exploration. And this is exactly what makes this a strong game. It allows you to train various skills which may unlock new paths. The pace at which you learn these skills is influenced by the mood of our heroine, said mood can be achieved by your actions and your weekend activities. Moreover, you can change Elodie's clothes and this is NOT only for fanservice, as those costumes yield benefits for your chosen skills. Combine this with the freedom of choice (in some cases you need specific skills to actually HAVE a choice) and a world full of plot twists, intrigues, alliances, sea monsters, civil wars, poisoned chocolates and several pink, fluffy, chubby deaths await you.  PROS + Lots of choices + Dozens of more or less usefull skills for your crown princess + Mood system allows for specific 'archetypes' + Different ways to beat the game, thus different endings + Some kind of morale system, allowing you to either be a merciful queen or a tyrannical overlord + Quite cute, if you like the manga style + Release the kraken  CONS - Heavily based on trial and error, especially at the beginning - Some achievements are really hard to get (although saving on a regular basis and taking notes will help) - Relatively short (I managed to get all endings and achievements after ~ 20 h)  Still, I defenitely recommend this game due to its many paths and secrets, the artwork and the fun I had watching my princess getting killed over and over again.  08/10   ",
            "review_score": "1"
        },
        {
            "review_text": "Each time this game throws you a curveball. It's truly a learning experience i'm enjoying every step of the way.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminded me of several princess maker games that I've used to played. Similar mechanics but you started as a grown up already in this game while  those started out from the infant stage.   This game might not have as much plot as those princess maker games and will probably take lesser time to complete as well. But that difference can be observed by their price difference alone. A Princess maker game would easily cost higher than  6000 JPY back in the days where as this is less than 20 bucks. A really nice addition to your game library when you have some spare cart space.   The downside of this game is probably the lack of a Gallery Mode that is common to most galgames. You can't replay past events other than through your own save point or even listen to some of the wonder sound tracks selectively.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games I've ever played.  Great story. Thanks Hanako Games for this awesome game !",
            "review_score": "1"
        },
        {
            "review_text": "Slightly addictive. I'm working hard to try and get all the endings and its really difficult to not just walkthrough it all because there are so many variables. If you like stat-based choose your own adventures with a very, VERY dark story where you will most likely die or doom your kingdom or both? This is the game for you",
            "review_score": "1"
        }
    ]
}