{
    "app_id": 251910,
    "name": "Solar Flux",
    "release_date": "2013-10-24",
    "developer": [
        "Firebrand Games"
    ],
    "publisher": [
        "Firebrand Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Puzzle"
    ],
    "achievements": 32,
    "positive_ratings": 217,
    "negative_ratings": 69,
    "price": 6.99,
    "description": "Travel across the universe and save dying suns from extinction in this unique and challenging puzzle strategy game. You are the last hope to bring salvation to a perishing universe as you collect and deliver fragments of plasma using your omni-directional ship.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/251910/header.jpg?t=1447358660",
    "minimum_requirements": "Минимальные: ОС: Windows XP Service Pack 3 Процессор: AMD Turion X2/Intel Core 2 Duo Оперативная память: 2 GB ОЗУ Видеокарта: Nvidia 8000 series or better DirectX: Версии 9.0c Место на диске: 300 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is addictive and fun if you like strategy type games, and its very nice visually too. I'd like to see more casual games like this or simillar, I'm enjoying it so far. It has a lot of levels each one a different challenge, please consider giving it a go, I did and I have enjoyed playing this little gem, I also found it Quiet relaxing too. It is a nice change from other more tedious and aggressive type games.",
            "review_score": "1"
        },
        {
            "review_text": "I completed all of the Solar Flux puzzles in just under 3 hours. If you are into breaking records and completeing all acheivements then you will be playing much longer. I would recommend buying this game if... A) You like puzzle games. B) You like outer space. C) If it is on sale for cheap.  Pros - Creates a nice atmosphere of suns, planets, etc - Gameplay is smooth on either the mouse or the gamepad - Not too frustrating but more relaxing (breaking current records may get very frustrating) - Great concept for a puzzle game  Cons - The music was not as atmospheric/ambient as I would have hoped for (This was corrected by turning the game music off and playing my own soundtrack) - I felt they could have expanded on the space theme. Suns, planets and black holes were great but I felt the time bombs didn't fit into the setting at all. They should have replaced them with an exploding comet or something found in outer space  Overall this is one of those good little games to pick up during a Steam sale.          YouTube™ Video:  Solar Flux: Cerberus completed&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "So addictive, with a stunning soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "Solar Flux has got to be my new favourite puzzler. Each mission involves you attempting to save dying suns from oblivion either by feeding them plasma to either increase their power, or to reduce their power to prevent a supernova. Your ship has minimal thrusting power and so you must rely on the gravitationaly pull of nearby planets and asteroids to slingshot around the sector as you collect the plasma. In addition to this, whenever you shoot your collected plasma into the star, a solar flare is formed, which you can ride along to get an extra boost. The closest game I think Solar Flux reminds me of is Captain Ludwig for IOS. Both have a very similar physics system (look it up if you like, Ludwig's also a pretty good game). Apart from collecting plasma, you've also got to worry about your shield strength - which depletes whenever you are positioned in the sun's lght (you can hide in asteroid shadows to replenish this). There's also the fuel meter to keep an eye on, use all your fuel and the ship will be dead in the wat.. um space dust. This is wheere the game adds the replayability. Much like how angry birds challenges you to use the fewest birds, Solar Flux rewards players for minimal fuel consumption, indeed many missions are possible to complete without using a drop! The satisfaction from zero fuel usage you get is pretty good.  Overall, the game is a great little puzzler, easy to learn the basics, but still with plenty of challenge. Adding to that the minimalistic visuals and great space ambience music, Firebrand having done an excellent job of porting an already good tablet game to the pc.",
            "review_score": "1"
        },
        {
            "review_text": "Nicely done, great gravity and newtonian physics. Puzzles are very interesting and the challenges just gets better. A great game. Highly recommend to your inner astro physicist in you :)",
            "review_score": "1"
        },
        {
            "review_text": "this is a really beautiful space/physics/strategy/puzzle game thats worth every cent even at regular price($10 as of now)",
            "review_score": "1"
        },
        {
            "review_text": "50 - 50 for this game .. idea is simple and fun to enjoy .. but controls r annoying .. u have to keep the cursor behind the ship to push it .. not point where it should go ! ..  recommending it yes .. but if u get it on sale !",
            "review_score": "1"
        },
        {
            "review_text": "50 - 50 for this game .. idea is simple and fun to enjoy .. but controls r annoying .. u have to keep the cursor behind the ship to push it .. not point where it should go ! ..  recommending it yes .. but if u get it on sale !",
            "review_score": "1"
        },
        {
            "review_text": "  Fun and free so its good",
            "review_score": "1"
        },
        {
            "review_text": "Meh game, nothing stands out, just your typical gravity/physics based game (strikes me as a browser flash game honestly). Levels got repetitive. Not saying it's bad, it's just not worth 10$, you can get better games for 10$. Wait for a sale or price drop if you're thinking about buying this.",
            "review_score": "-1"
        },
        {
            "review_text": "i'll never have the patience to finish this. It requires such precise control that i either rage or get bored.",
            "review_score": "-1"
        },
        {
            "review_text": "Not Recommended",
            "review_score": "-1"
        }
    ]
}