{
    "app_id": 252030,
    "name": "Valdis Story: Abyssal City",
    "release_date": "2013-10-30",
    "developer": [
        "Endlessfluff Games"
    ],
    "publisher": [
        "Endlessfluff Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Metroidvania",
        "Action",
        "RPG"
    ],
    "achievements": 77,
    "positive_ratings": 1934,
    "negative_ratings": 345,
    "price": 10.99,
    "description": "Assume the role of Wyatt in this Action/Exploration Platformer as you explore the ruins of a holy city that was lost many years ago. Battle various types of demons, angels, and a new threat known only as the “Ferals”, using swordsmanship, martial arts, and sorcery.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252030/header.jpg?t=1544621869",
    "minimum_requirements": "OS: Windows XP, Vista, 7 or Windows 8 Processor: Processsor 1.7 Ghz or higher Memory: 1024 MB RAM Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " 'Go on warrior, your story shall be written in the corpses of your enemies.'",
            "review_score": "1"
        },
        {
            "review_text": "Ever since I got into ametuer game design myself about 5-6 years ago, I always wanted to make a game that combined some of my favourite genres: Platformer, Action/Adventure and RPG (with a little touch of Fighting a la Smash Bros). Monsters, bosses, weapons, party members, stores, collectibles and TIGHT combat controls. Obviously, since games are hard to make (let along by yourself) that never happened. But I would happen across Valdis Story, which I think is the closest I've ever seen a game be to my 'dream game.' Side scrolling action platforming at its finest since Symphony of the Night! If you liked SoTN or any of the other Metroidvania games (including Metroid itself) you will highly enjoy this game just like I did. Fun bosses, high skill cap and rewards the skilled with bonouses from bosses encouraging you to learn the bosses' patterns and improve yourself. After you beat the game your first time, why not play again? On a harder difficulty? And its not just the numbers that get harder with the difficulties either, some bosses mechanically change in terms of how they are fought (albiet minorly, but still) and the best part is, THIS GAME ISNT EVEN DONE YET. There is more to come! It's good enough as it is, but knowing that there are other characters and items and possibly bosses planned in future updates just makes me rock hard. GG EndlessFluff. You did good.  VLADYN AND GILDA PATCH UPDATE:  The final two characters have been added and a total of 4 new bosses with some new and remixed areas make the game still pretty fresh for those of use that have played it a bunch until this point. The game supports 16 different saves now to compensate for the new characters allowing you to essentially have 4 saves for each characters if you want.   Vladyn is SUPER FUN to play, he is now my favourite character taking the place of Reina. He is the only primary ranged character is the game and it makes everything so different and fresh. Gilda is really complex but can be VERY rewarding if you play her correctly. Many bosses are weak to a certain element and all of Gilda's attacks utilize each of the elements in a substantial way meaning you can really exploit bosses weaknesses if you play it right. For example, Magus takes MAD damage from poison, up to and probably beyond 250 PER TICK, which is a LOT of damage believe me. She also starts out with a double jump when everyone else needs to wait a while until they get access to it allowing her to grab some items and equipment early.  The new bosses are all very challenging and interesting and the new areas have interesting mechanics as well that I felt added to the challenge in a good way rather than being cheap.  All in all, this update added a LOT of great stuff and I am still VERY happy with my purchase. GG EndlessFluff. You did good. (again)",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy Metroidvania games then this is definitely for you, the game is really fun to play!  Story is alright, nothing mind blowing but it kept me interested. I personally had the most fun trying to figure out all the different boss patterns, and it feels pretty satisfying when you do finally manage to kill one of them after a certain number of retries. Don't expect the higher difficulties in this game to be easy, they are actually quite tough(which is a good thing!)  I got used to the default controls fairly quick and ran into no issues with them. That said if you don't like them both keyboard and gamepad is fully rebindable. (Worth noting that I played through the game with a wired Xbox 360 controller.)  I did run into one minor bug at one point during a cutscene before a boss battle took place and had to reset to my last save (there is always a save shrine near the boss area so it wasn't a big deal.) But other than that I experienced no other bugs whatsoever.  The soundtrack for this game is really good, my favorite has to be the music that plays during the Frozen Crypts level, it's sooo good.  Overall, good game, good soundtrack, solid controls and tons of fun!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Metroidvania game I've played. I still have to try the 2 newer playable characters ... so I'll come back a third time to this game in the future... and maybe a fourth time after that.    Strangely the second time I played the game (maybe 60h out of my 90) I used the keyboard. The controls are really responsive (maybe a bit hard to adapt to) both with keyboard and controller.   Lots of secrets and cool possible builds per character with the alignment system and different weapons.  9.5/10 would rage quit again after finding out my build is trash for optional end game bosses.",
            "review_score": "1"
        },
        {
            "review_text": "A 1080p60 video review of Valdis Story: Abyssal City:          YouTube™ Video:  Valdis Story: Abyssal City (2015) Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Alright, I BARELY scratched the surface with my single playthrough with just ONE char; Wyatt. I'm a little bit burned (or burnt) with the game so I'd like to pause the other 3 possible chars.  Here's the TL;DR version: - I LOVE the art style, the animations or sprites! - I LOVE the music and sfx too, it's really good and I think I'd never feel tired of it! - The controls weren't exactly perfect, I had trouble with the jumping and edge detection/box collisions. It wasn't BAD just fell so many times because the char wouldn't grab, or it just jumped before or after, sigh.. - Combat, well it's dynamic, it's engaging and hard! mobs will give you a though fight, most times! haha. I played it entirely with a xboxone gamepad, tho when I first tried it I didn't have one so used one of those generics with the x360ce emu driver and worked fine, all you have to do is remap a few buttons and you're golden :)  Steam says I've played for about 23hs which seems little compared to the other games or that it felt much much longer, I left a bunch of survivors to save, crew members to rescue, map to uncover and a whole lotta items to pick up and upgrade, which leads me to the AMAZING amount of customization that you can create and adjust to your preferred play style.  Most achievements (if you're into those) are to be unlocked in hard and posterior difficulty modes, plus they're divided by chars too, so you'd be doing these for quite a while! :D  Ok, think I have most things covered up. If you're into platforming, Castlevanian/Metroidvania genres, you're up for a challenge and also enjoy a good story (yeah, it has an interesting plot too) then Valdis Story Abyssal City is for you.  Endlessfluff Games took such a long time and did great effort while creating this jewel, that we gamers owe to them to spread the word and give them support and deserved praises so they and others know there's an appreciative market niche here for these awesome kind of games!",
            "review_score": "1"
        },
        {
            "review_text": "People love to call games 'Metroidvania' any time you have to backtrack, like it's some kind of accomplishment. VS:AC goes beyond this and actually captures a lot of the fun that I had playing Symphony of the Night. But on top of that, it adds in combat that is a little deeper. I've only played one of the characters you can play as, but the skill tree looks to be pretty thoughtful, and I wonder how they differ over the different options. Also, the magic system gets a big thumbs up from me: initially I thought 'This seems complicated, I probably won't use it,' but the game forces you to delve into it, and I'm glad that it did. It is a bit overwhelming at first, but once you get it, it becomes second nature. I'm not sure how long it is, but I'm enjoying it a great deal up through now.  FOLLOW-UP -- Having returned to this game a over a year later, they have finished adding in the other characters and the devs have done an awesome job of substantially differentiating the four playable characters from each other in fundamental ways. A+",
            "review_score": "1"
        },
        {
            "review_text": "While I enjoyed the older Metroid games (especially the GBA ones), I would not consider myself a devotee of the 'Metroidvania' genre; Dust - An Elysian Tail was the first game I played in years.  But still I enjoy it when a game does so many things right like Valdis Story:  The melee focused combat is highly rewarding as you learn to master the 'Skill Cancel' ability and start to weave in magics to your combos. The exploring in the sunken city makes you backtrack for upgrades but never feels like it forces you to do so. While it does not look as gorgeous as Dust did, it is still charming with fluid animations and diverse looking zones.  The story starts of a bit weak, but the more cities you discover and lost crewmen you find the more compelling it gets. I like that the male protagonist (you can also play a female one and unlock others) is no knight in shining armor but more of a brutal anti hero - with a warm heart for his crew.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favourite games. The art, the style, the gameplay and the story came together to make one hell of an experience. Well done.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best sidescroller action rpgs of all time in my opinion. The character customization is phenominal. The music, art, and story are all very well done. This game is fun and challenging, and it rewards you for honing your skills and learning to play better. My only complaint is that it isn't co-operative, because playing this game with a friend would be an epic experience.",
            "review_score": "1"
        },
        {
            "review_text": "8/10  The Good: - Combat is like a 2D Devil May Cry, done well - Metroidvania aspects just enough to cure the itch - Equipment progression based on gameplay decisions rather than flat upgrades  The Bad: - Poor enemy variety - Platforming sections may not be for everyone  Love Metroidvania? Join the club. Valdis Story is currently easily my favorite of the PC Metroidvanias I've played in recent years. It features excellent, tight combat mechanics that feel somewhat like Devil May Cry thanks to the mobility and attack options from the game's spell system. The world is mostly a joy to explore and new travel skills are given at just the right pace to keep the player interested in exploring more. Furthermore, there are two characters (with two more upcoming, but in very slow development) and some impactful storyline changes that can add a lot to the replayability of the game.  One of my main complaints about the game is the lack of enemy diversity, It's not a huge issue, and the game does change it up by giving existing enemies new abilities as you level up, but one of my favorite things about Castlevania SOTN was that just about every zone had its unique monsters that each added to the atmosphere of the zone. In this game, it just feels like you're fighting those angelic monk dudes all the time except in different places. Also, the game has a number of difficult platforming sections which can be very frustrating to some players. Thankfully, not all of them are required.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is true gem, that sadly went mostly unnoticed. Closest thing i can think of to compare it with would be Valkyrie Profile or Alundra on PSX: melancholic RPG/Platformer with a huge immersive world.",
            "review_score": "1"
        },
        {
            "review_text": "Damn good metroidvania style game, with a challenging array of bosses and satisfying combat. I give 3 bannas 2 chimp licks and an Evanglion.",
            "review_score": "1"
        },
        {
            "review_text": "Beat the game only to realize I could play through again with a different stat loadout, character or weapon. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "A metroidvania with deep RPG system and heavy emphasis on combat. Very easy to pick up or to put down, and has very high replayability with all the characters, weapons, and combat styles you can experiment with. Skill floor isn't terribly high, but the skill ceiling sure is.",
            "review_score": "1"
        },
        {
            "review_text": "Castlevania: Symphony of the Night feeling anime side scrolling hack and slash. Pretty great.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. All I can say. This game is so much fun, combining all thats fun about platforming, hack n' slash, with really challenging enemies and boss fights. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A Kickstarter success story. It's wonderfully designed, has tight controls and different chracters, difficulties and play styles. I must say I'm impressed.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the Metroid-inspired Castlevania games or action platformers in general then this is a good choice. It may not be quite as huge in scope as Castlevania or Metroid but still of compelling length.  Just know that Valdis Story can be unforgiving at times, even on the lowest difficulty. There's also some disappointing platforming sections that are poorly designed but they don't detract enough from the overall experience. The leveling is fun, there's big and varied skill trees for each character, lots of weapons and equipment to find and upgrade with different stats, just a whole load of stuff that any fan of progression-based games will enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent visuals with vibrant envioroments and enemies. Great music with lots of spirit. Abusively difficult bosses. A very good metroidvania with interesting DMC like combat where exploration is awarded. ♥♥♥♥, it's so hard. ♥♥♥♥♥♥♥, ♥♥♥♥, ♥♥♥♥ why would you make this game so hard? It's like dark souls ♥♥♥♥ed metroid and had this cruel demon hate-child. At least it doesn't punish you as stupid as DS does. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! The controls take a little getting used to, but everything else is incredible. The art, music, level design...all of it is great. I'd don't often take games through a second play through, but I definitely will with this one.",
            "review_score": "1"
        },
        {
            "review_text": "The game was absolutely mindblowing for how good it was.  And then they added the True Anemone final boss, which is so bad I have trouble even recommending the game.  5/10",
            "review_score": "1"
        },
        {
            "review_text": "Fan of Metroidvania? Get this. It's everything I loved about Super Metroid, from fluid complex combat, to power ups galore. Tons of loot to be had, and the backtracking becomes faster and faster as you get new abilities. Not to mention the zones are small enough that 5min will get you through to your new items and out.  There are FEW issues here, but some of them are daunting (keep in mind, I played through on God Slayer, the highest difficulty).  1. Difficulty of certain MOBS is ridiculous. Flying skulls are horse ♥♥♥♥ early on, and the spider mini-boss is ridiculous to fight. This isn't because of the upped difficulty, these mobs are just terrible to deal with. 2. Some of the 'puzzles' (read: platforming on a time limit) are a pain. Imagine you're playing this game on normal, and the puzzles are on God Slayer difficulty.  That's it though. This game is awesome. I seriously can't think of any other issues, and can't wait to play through it again with Vladyn when he is released.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome metroidvania gameplay, satisfying combat and platforming, unlockable equipment and abilities and customisable skill loadouts. Definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "This is the 'metroidmania' game that I've been searching for. This is my new age SOTN.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people call this a 'metroidvania' which I think is a fair tag. It is a fun game with some frustrating platforming and tough boss fights that you can usually win the first time, but if you want the 'high' rank you need to probably retry them a few times. I definitely recommend this if you're a fan of old fashioned side scrolling games.  I feel like I'm playing the SNES version of Wanderers of Ys all over again.",
            "review_score": "1"
        },
        {
            "review_text": "Fan of Metroidvania? Get this. It's everything I loved about Super Metroid, from fluid complex combat, to power ups galore. Tons of loot to be had, and the backtracking becomes faster and faster as you get new abilities. Not to mention the zones are small enough that 5min will get you through to your new items and out.  There are FEW issues here, but some of them are daunting (keep in mind, I played through on God Slayer, the highest difficulty).  1. Difficulty of certain MOBS is ridiculous. Flying skulls are horse ♥♥♥♥ early on, and the spider mini-boss is ridiculous to fight. This isn't because of the upped difficulty, these mobs are just terrible to deal with. 2. Some of the 'puzzles' (read: platforming on a time limit) are a pain. Imagine you're playing this game on normal, and the puzzles are on God Slayer difficulty.  That's it though. This game is awesome. I seriously can't think of any other issues, and can't wait to play through it again with Vladyn when he is released.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a rewarding Metroidvania game, look no further. This game has great combat mechanics, awesome maps, and a story that was better than I could have ever hoped for.",
            "review_score": "1"
        },
        {
            "review_text": "Valdis Story is simply beatiful. Combat is fun, the graphics is well made, the animations are fluid, the dialogues are well written, sound and music are very nice (you may love the music that plays when you visit the second town in game). The skill tree, the items and the various equipment all adds some variety to the game. Monsters and bosses have all their special abilities and attacks that you need to observe and understand first before you can overcome them. This surely makes Valdis Story a bit more difficult than other similar games, as for the first half hour you will probably die and reload often. But after you get in touch with the controls (a bit messy, in the beginning) and understand how to attack effectively, how and when to evade with proper timing, how to use the correct spells... then all becomes acceptable, the real fun begins and the only difficulty you will have is in stopping playing: you will feel addicted in exploring, chasing monsters, collecting items, unlocking previous passages and doors... If you loved Castlevania SotN, then you are recommended to take Valdis Story as soon as possible.  9,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Brings the magic of classic platformers back. I think you can roughly think of this as playing Zero on the Megaman series, since most of the action is melee. But it goes way beyond that.  The characters have smooth animations, the bosses are unique and have interesting treats and the puzzles are in a varied range of difficulty. Some things might be frustrating, but hey, those are the rarest items you're striving for, keep that in mind!  Very few maps have some trap elements which were present in famous platform games, such as Castlevania or Megaman. One of these, for example, is when you are hit by a monster and there simply isn't any type of air recovery, which means falling. Sometimes falling can mean going down one of two maps, which means going through the monsters again... But, hey, those parts ARE supposed to be hard, the player IS SUPPOSED to pay attention!  All in all, Pros: + Fantastic Graphics + Fluid + Rewards player skill rather than grinding + Rewards for good boss fights + Has a fair bunch of secrets/missables for replayability + has two characters to choose from and two more to come, all of them unique in playstyle and customizable  Cons: - Not a walk in the park game, beware! - If you skip some of the dialoque, you might never have a chance to read it again, so pay attention - Occasional framerate drop in some very specific setups (city waterfalls, _one_ specific boss)",
            "review_score": "1"
        },
        {
            "review_text": "I just beat this game for the first time and I'm already in love with it. The fact that there is still 3 more playable characters for me to play as means I'm no where near done with it either. The story, the characters and the play style. It's so rare to find a game where I love all 3. I pray to the makers that there will be a sequel to follow up on this story. The play style is mash up of devil may cry meets metrovania. The characters are fleshed out and the story has me craving more. If any of this sounds appealing to you by all means pick up this game. It's more than worth it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a 2D metroidvania-like game with crafting, skill trees and RPG stats. There are 2 characters to choose from (4 when you beat the game for the first time) and each of them of them have very different play styles and abilities, with multiple unlockable weapons for each of them, which changes the play style even further, and on top of that, every character has different magic powers. Also lots of boss fights, and not bullet sponge bosses, ones that will make you retry multiple times the first time you fight them. And no bugs, like, at all, nothing messed up the game, which is rare for a game made in the last 5 years (how f***ed up is that?) The main story took me 8 hours to complete (HLTB says 11 hours, so I must be a good person at this)   (Bought at $9.74)",
            "review_score": "1"
        },
        {
            "review_text": "Astonishing game with high replayabiity value. Each character is unique and adds a different perspective to the story. If you like beating the bosses SSS'es, wandering on a huge map, killing with style and skill, and nevertheless an amazing story with magnificent artworks, this game was made for you. Can't wait for the sequel. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "2D DMC with upgradable abilities also fun as HELL.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting gameplay and challenging bosses. Four characters for quite a bit of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a hidden gem.  It came as an absolute surprise to me since I bought this game on a sale without much research. But then I started it up. The menu music combined with the stunning handdrawn art immediately gripped my attention. Once in the game it felt responsive but limited until mechanic after mechanic were introduced and slowely everything in the world made sense. I felt in control at all times. I made the mistakes and I got the credit for achieving something but it's no DarkSouls. The game is forgeving in that you won't loose much progress by dying, since you'll just respawn in the same area, but unforgiving in that every enemy will punish sloppyness. Timing and propper use of your skills are of the essence. This combines perfectly with the rpg elements in the game. They are limited but during the game your character gets stronger, you get more skilled, and new movement mechanics add up giving you a real feeling of 'owning levels'. Now the story was rather enjoyable as well eventhough it didn't really matter to me but the endless fight between Heaven and Hell is always exciting and because the game has it's own lore for every element of that battle it was always interesting.  The use of magic felt a little weird at times though since I often triggered my dash instead of my spell but I loved the melee so much I didn't bother to get skilled at using magic. I felt like the itemcrafting wasn't explained at all but this didn't hinder me in the end (normal difficulty).  For some reason this game just clicked for me. It has rewarding gameplay in the line of DarkSouls, the looks of Bastion, and music like an older Final Fantasy.  note: I've played this game as warrior/guardian on normal.",
            "review_score": "1"
        },
        {
            "review_text": "really enjoyed the side scroller. the story is kind of meh. and you will get lost in the maze of the map very easily and some areas you can't get out of and can't complete because you're not suppose to be in them yet. Really frustrating when that happens as the only solution is to reload.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of metroid and castlevania style games than this one is perfect for you.",
            "review_score": "1"
        },
        {
            "review_text": "Plays good, looks good, sounds good. Quite hard. This game reminded me how bad I am at platformers.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a surprise to me, i bought it on a whim when it was on sale, and it ended up being one of my favorite games of the last 5 years.   Valdis Story is a Metroidvania style game (platforming 2d rpg), with an excellent battle system, and the upper levels of difficulty feel just right, every time i died i learned from it and got better, I never felt like i was cheated .  There is a crafting system in this game, and it's simple and easy to use, without much grinding.  To me the best part of valdis story is the bosses, they are difficult, but so much fun, and so satisfying when you finally beat them.  con - poison sucks man (drains health and mana)",
            "review_score": "1"
        },
        {
            "review_text": "An excellent metroidvania style game. Great options and character upgrades to play the way you want, different playable characters, challenging boss battles, and a great artstlye. A game that shows how even smaller Kickstarter projects from lesser or unknown developers can lead to high quality games.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. The game play is a mix between castlevania and viewtiful joe combo style combat. This game can truely be recognized as a metroidvania. The combat was very well done and the platforming, i felt was really well done. This includes backtracking which some of you may dislike but it reminded me what makes a metroidvania, the exploration and backtracking. Plus with different power-ups and helpers.   I only wished all the characters were playable so that i clock more hours into this amazing game. The spell system can get a bit annoying as you can only equip 4 spells to each direction ala smash bros style, and there are certain spells that is required to go through new areas such as a fire fist which breaks walls and the obvious double jump. This forces the player to keep them on as the player can get constantly annoying in doing so. Other then what was said above, i highly recommend this game to anyone a fan of this genre.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game if you enjoy the 2D Metroivania-style games. The game has a strong emphasis on exploring and backtracking as well.   The story where the game picks up is in media res. A war has broken out between angels and demons with humans in the middle. The protagonist will find themselves lost in the middle of an underwater city after their ship crashes. As players progress, you learn more about the background of this war and the characters swept up in it. Players will also learn about the city and its secrets.   The game could be considered action/adventure with RPG elements, akin to Castlevania. The combat system is based on a melee combo system with spell casting and standard blocking. Spells can be interchanged in combat through a paused menu system. Players level up based on experience and receive skills points to invest in skill trees. I found there to be a slight learning curve with combat and some controls but it quickly grows on you as you face challenging enemies and bosses (used a gamepad).   The characters and environment appear to be hand-drawn and are very well done. The soundtrack is well thought out and adds to the game atmosphere. My only complaint is the sub-par map. As a result, you will need to pay attention to where NPCs tell you to go and you'll do a good bit of backtracking.   Overall, a great game. I grew up enjoying games like Castlevania and Valdis Story: AC does an excellent job breathing this genre new life. Combat is fun and challenging and the enemies rarely are complete pushovers. There are even platform puzzles based on time-switches that are fun to take on and really test your skills are maneuvering the controls of this game. A great buy and an even better one on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. The game play is a mix between castlevania and viewtiful joe combo style combat. This game can truely be recognized as a metroidvania. The combat was very well done and the platforming, i felt was really well done. This includes backtracking which some of you may dislike but it reminded me what makes a metroidvania, the exploration and backtracking. Plus with different power-ups and helpers.   I only wished all the characters were playable so that i clock more hours into this amazing game. The spell system can get a bit annoying as you can only equip 4 spells to each direction ala smash bros style, and there are certain spells that is required to go through new areas such as a fire fist which breaks walls and the obvious double jump. This forces the player to keep them on as the player can get constantly annoying in doing so. Other then what was said above, i highly recommend this game to anyone a fan of this genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most fun I've had in a metroidvania in a while, while its story isn't as good as dusts its combat is much more fun, and it has more replayabillity overall I found this very fun",
            "review_score": "1"
        },
        {
            "review_text": "I have more than 100 games in my Steam library, nearly 200 really. But only 1 Perfect game. Valdis Story: Abyssal City. I think that alone speaks volumes on the quality and polish of the title. I shan't elaborate too much on what I think this game does right, since others have articulated it in a lot more detail. But suffice to say, if you're looking for a Metroidvania-style action RPG, this is the cream of the crop. 4 characters, 9 assists, myriad playstyles, 16 types of armour, 14 types of accessories, 5 weapons per character and their upgrades, makes for near endless replayability and a whole lot of fun!  If all the reviews still don't sell it to you. Here's another thing then. I first stumbled on this game when a friend installed it on my computer. Where he got it, I have no clue. I played for free for one playthrough and liked it so much that I bought the game. It is THAT good. If only developers were like the folks behind VS: AC, we wouldn't need reviews no more, and we'd probably be in heaven.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who enjoys fighting games and metroidvanias this was right up my alley. The combat, controls, and bosses are really finely tuned. I never feel like I was cheated when I die and know intuitively what I did wrong to firm up my next attempt. All in all, a great game and totally for the $15, a must-buy if it's on sale. Great job, guys!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome I love the character designs, and the overall artstyle on a whole.  The boss fights are awesome, and can get very intense, the ledge jumping can be a bit annoying, but is a small thing compared to how the action handles overall. I would reccomend this game to anyone who loves side scrolling action.",
            "review_score": "1"
        },
        {
            "review_text": "IF YOU LIKE ACTION PLATFORMERS WITH RPG ELEMNTS (METROID , CASTLEVANIA, ZELDA II) BUY THIS GAME. I WOULD ALSO SUGGEST PLAYING THIS GAME WITH AN X-BOX CONTROLLER BECAUSE IT DEMANDS PRECISE INPUTS.  This game is very simmilar to metroid and castlevania. it follows the same baisic principles of using power-ups to to traverse new areas. The rpg meachanics allow plenty of character customization. The game's world is interesting, but the cliff hanger ending is mediocre at best. The soundtrack is absolutely divine. (hehe) The orchestrated pieces and a lot of epic flare to this already stylish game. The game took me about 8 hours to complete, but you can double that time if you beat the game with both of the playable characters.",
            "review_score": "1"
        },
        {
            "review_text": "WOW this game is good",
            "review_score": "1"
        },
        {
            "review_text": "To make this review simple and not too analytical, this game is fantastic. It is at times very, very frustrating, but it is a challenging game. You will eventually get past parts through trial and error and will have to push yourself to get better. I am glad I picked this up. There are some optional boss fights, so if it sometimes seems almost impossible, just level up some more or progress through the story and try later. Really, just don't give up on this game. I have rage quitted once, and have wanted to many times before but had not. Regardless I keep coming back to the game. The art design is wonderful and it is a pleasure to find new parts of the world. I don't see enough games like this. Pick it up if you are up for a challenging adventure with many bosses.",
            "review_score": "1"
        },
        {
            "review_text": "game rarely gives you any sense of the direction you're meant to travel in, causing you to backtrack through lower level areas you've already explored trying to find a door or ledge you missed, constantly levelling up to the point that you can 1 shot enemies by the time you reach your objective.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've been using Steam for years, and this is actually the first game I've ever written a comment for. I cannot recommend this game enough!   It quickly became my favorite, even before the amazing update. Tight rewarding combat system, good story that doesn't take away from the action, and a great leveling system as well. Collectibles, upgradable weapons and armor, everything you would ask for in a Metroidvania style game. Oh, and not to mention the music! By far some of the best video game music, at least for me, since Chrono Trigger. So much more I could say, but I'm sure many other people can say it better.  This is on the Humble bundle weekly sale, which prompted me to write this comment. Super cheap and a steal at the moment! (That's how I got my copy years ago.)",
            "review_score": "1"
        },
        {
            "review_text": "If you only play one kickstarter game this year. Make is this one.",
            "review_score": "1"
        },
        {
            "review_text": "Really solid platformer, not usually my type of game but I really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "- Superb combat - Superb platformer that as made me swear a lots of time - Lots of epic bossbattlle sometimes more than 30 min nonestop - Good story where there is no good and evil - Very good music ! ( would buy it )  9/10  One of the best game of 2013",
            "review_score": "1"
        },
        {
            "review_text": "Really really good metroidvania.",
            "review_score": "1"
        },
        {
            "review_text": "Got through my first playthrough and I love this game. Gorgeous art style with great animations. Combat is very repsonsive and customizable, with lots of varieties for different situations. Talent and skill points further add to the replay value. Even at full price this is some of the best money I have spent with a game. This is a Kickstarter and Greenlight game done right. My only gripe was that the movement is geared more for combat than platforming, which made some of the platforming puzzles harder than it should have been, due to having to correct for touchy movement and falling off a ledge. All to do it again.  Excellent game, worth the money. If you are a fan of the Metroidvania genre why haven't you got this yet???",
            "review_score": "1"
        },
        {
            "review_text": "I'll keep this short and sweet. Valdis Story is a fun game, but the combat system is more complicated than it appears to be at first glance. This isn't a bad thing at all, but the game isn't quite done yet, so I've not yet put much time into it. Once the other characters are fully playable, I will definitely be coming back to this and putting forth the effort that this game demands and deserves from myself and others. You should check it out, for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I will say this on the matter: of you thought Metroid needed more of a collect-em-all feel, or if you wanted the metroid feel with a sword, then do not hesitate to grab this game.  My gripes: -Momentum is not maintained between rooms. When you run into a new room, if you're just holding down the direction, you will just stand at the entrance to the new room until you re-register your movement. (I think they hard-coded a room entrance with a wall jump, just to make it not immediately drop you...) -High level boss trigger items are available as craftable items, but don't have optional triggers. This being said, a difficult boss may very well be standing between me and my next objective. -Low-level bosses sometimes de-spawn when doing other stuff in the story line. I was looking forward to trashing one specific boss, only to find the room totally empty when I arrived again later.  If you can stand my gripes, fire away at what (in my opinion) feels like the younger brother to Dust: An Elysian Tail.",
            "review_score": "1"
        },
        {
            "review_text": "- Superb combat - Superb platformer that as made me swear a lots of time - Lots of epic bossbattlle sometimes more than 30 min nonestop - Good story where there is no good and evil - Very good music ! ( would buy it )  9/10  One of the best game of 2013",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Metroidvania clones I've ever played. There's some issue with collision detection, but not bad enough that the game is rendered even slightly unplayable. I'd love to see a sequel with multiplayer support.",
            "review_score": "1"
        },
        {
            "review_text": "It is challenging and fun!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Probably the gaem i've worked the hardest on this whole year",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Great music, fun combat, challenging bosses, lots of corners to explore for treasure. This is a pretty solid Metroidvania style game for anyone that enjoys that type of entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent Metroidvania game reminiscent of the GBA/DS era-Castlevanias. An xp-based level system, stat allocation, a crafting and equip system, a deep magic and skill system, and a focus on fast combo-based gameplay combine with challenging bosses, speed challenges, and hidden areas to explore to make this a must-play for any fan of the genre. To top it all off, it has an outstanding OST that is a joy to listen to.",
            "review_score": "1"
        },
        {
            "review_text": "From me this would come highly recommended, its Avatar The Last Airbender meets classical platformer games with good story, rpg elements, rough fighter action, and a constant flow of events.   The only negative thing I would say about it is that, there is no multiplayer which is fine, but there is no  coop which is not as fun.",
            "review_score": "1"
        },
        {
            "review_text": "A very refreshing and entertaining game. ",
            "review_score": "1"
        },
        {
            "review_text": "Tough at start, but gets better with time a practice, Great for people who like 2D-platformers or RPG game.",
            "review_score": "1"
        },
        {
            "review_text": "Excelent metroidvania game, worth of the full price.",
            "review_score": "1"
        },
        {
            "review_text": "  One of the most fun Metroidvanias I've played in forever, with enough customization for several replays, a neat setting and story and enough challenge to be just right.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to find a good game nowadays, between unfinished ones, unpolished others, and all the overpriced cheap version of other good games. But, sometimes, in the middle of the game industry jungle, you happen to find a true treasure.  I had this in my library for quite some time now, and I finally took the time to play it. I don't regret it at all, because this game is just perfect.   - The graphics are very nice. I'd have been perfect with some more detailed artwork during the last cutscenes endgame.   - The music is totally awesome. It suits the game perfectly. My only regret is that you cannot buy/download the soudntrack here.  - The gameplay is perfect... With a controller. I've tried but it's definitely too hard to play without it.  - It has a classical story but deep enough for this kind of game.  - It has a very nice replayability and with those tough optional bosses, boss rank and hidden treasures, you'll have more than enough challenges to keep you interested after your first playthrough.  - Considering how much time I've played, how much I enjoyed it and how much time I still want to invest in it, the base price for this gem is totally fair.",
            "review_score": "1"
        },
        {
            "review_text": "I f***ing love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. More intense than a circus.",
            "review_score": "1"
        },
        {
            "review_text": "Best soundtrack in a game ever.",
            "review_score": "1"
        },
        {
            "review_text": "The best game of 2013 that I discovered in 2015. Possibly the best metroidvania title that I have had the pleasure to explore. The best combat in any 2D platformer - and by far better and more engaging than in the vast majority of contemporary action games. Valdis Story deserves way more attention than it has received.",
            "review_score": "1"
        },
        {
            "review_text": "It's damn good.  The writing and supporting cast are good. Really down-to-earth good.  Combat becomes increasingly fluid as you increase the complexity and variety of attacks in your combo by mixing up light and heavy, ground and aerial, melee and magic skills. The rating of your combo improves based on length and variation and awards an exp bonus.  Some bosses are very hard, but their patterns are deliberate. Study them, bring the right magic. A patch sometime last year began saving your spell layout even when you adjust it after a savepoint - this makes a world of difference when you're testing and adjusting your strategies.  With four playable characters, each with many unique build paths depending on stat, spell, weapon, and item allocations. Stat and spell resets are available in-game once per playthrough at a special merchant. Save before resetting points at level 20 and you may quickly test all max builds. However, different allocations will also greatly affect boss strategies in early-to-mid game if you're going for speedruns. Your character building decisions are meaningful at all stages of the game.  This is my most highly recommended game for 2013-14.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. More intense than a circus.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Metroidvania style games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Beat it after 28 or so hours of playing. Such a fantastic game. Didn't get a 100% run on Hard mode, but hoping to do so on Veteran Slayer mode, with a completely different character, which has completely different gameplay. This is to say this game has incredibly good replay value. What a great story, what great immersion, what a great feeling of progress as you go on through the game. If you can spare the $15, you won't be disappointed :).  EDIT: Over a year since release and the EndlessFluff are still working on fulfilling their promises of new characters with completely unique playstyles. Vladyn is in the works, so be ready.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty dope ♥♥♥ game",
            "review_score": "1"
        },
        {
            "review_text": "game reminds me of the megaman x games in the way it play",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Metroidvania style games ever.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best, if not the best, Metroidvania games I've played on Steam. Great level-building system and RPG elements and a fluid combat system combined with vibrant art-style and a multi-layered world. The game perhaps plays like a mixture of Castlevania SOTN, Dark Souls, and Maple Story. It lends itself to many viable approaches and builds and the battle mechanics are perhaps the deepest I have ever seen in a Metroidvania-style game. Would second other reviews on boss and enemy animations needing better cues for their attacks.",
            "review_score": "1"
        },
        {
            "review_text": "If you love 2-d Castlevania, Metroid, and the Megaman X series, this is the spiritual successor to all 3.",
            "review_score": "1"
        },
        {
            "review_text": "I probably jumped the gun with my previous negative review, as I was playing on Veteran difficulty and got angry at an area where I couldn't turn back and lost my health potions before a really hard boss. I played Veteran because found Hard a bit too easy when I played it, but that is because I didn't play against the bosses yet. In retrospect, I should have played on Hard, but hard seemed too easy at the time and the game eventually fustrated me to an instant uninstall.  Realistically, Valdis Story is probably one of the better Metroidvania for purchase on Steam, ot at least the closest game to the 2D 'semi-difficult SOTN-Style' Castlevanias outside of the Rogue-lite Rogue Legacy and colorful and slightly easy and very short Guacamelee.  The combat is a mix of being great due to combos and magic, and fustrating due to the skill cancel and enemy/boss attacks that can stun-lock you and drain tons of health.  -The skill cancel allows you to dodge or drop quickly while in mid-air by pressing down, and then the ability to dodge if you press left or right after activation. This key mapping is fustrating in platforming as you accidentally may press down on your game pad and is cumbersome in combat, but at least it is remappable to alleviate some fustration.   -I like the fact that the same soul can be mapped to different directions Smash Bros style to offer you different magic abilities, but I have many times accidentally used Smite (Dark Magic Button + Right) while after making a Platform (Ice Magic Button + Down)  -I eventually unlocked a Team Assist attack, much like Marvel Vs Capcom 2, but the Assist was weak and had a 10 second cooldown, and it sometimes misses - I was better off using normal attacks.  -While combo's are cool, i'll admit that I miss the combat of Castlevania's where the game was about managing your 'single attack press' and avoiding hits which caused knock back with temporary invincibility, but not stun-locks into combo barrages.  Perhaps in the future I will reinstall when I'm in the mood for a Metroidvania again and play on a lower difficulty. I stopped at the Guardian Temple which is where I became completely annoyed, though it looks like I was relatively far into the game. I recommend looking at a few negative reviews before you Add to Cart, though if you play at Normal Difficulty and are decent at this style of game, then you may enjoy it..provided you remember to remap your skill cancel key.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer, always makes me feel like a badass. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A solid metroidvania, with awesome art, good music and decent story",
            "review_score": "1"
        },
        {
            "review_text": "Great art and style. Story is intriguing and as far as I know, pretty unique. The gameplay is fun .",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying I am the only one in the universe to ever play this game no one else so dont let them fool you!!!!!!!!! This is a fantastic game great music, great action, great atmosphere, great level design, great sound effects, great character design and easy mechanics. Has stupid a generic story that is nonsense when you play it you will know what i mean i beat this game atleast 4 times so that should tell you that this game is short but very enjoyable considering that there is only two characters at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "It does what Konami and Nintendon't.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, great combat (kinda confusing story)",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvania yes 2d Devil May Cry yes Underrated gem",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but terrible support from the company. Gets intense as a 2-D action-RPG. Don't expect the devs to issue the full roster of (incomplete) characters anytime soon. Been waiting almost a year now for them and no word whatsoever.",
            "review_score": "1"
        },
        {
            "review_text": "I have 116 hours on record (lol, I accidentally left the game on a few times)  I have played this game quite a bit though, and it is a very nice game, reminiscent of Symphony of the Night imo.  The combat is smooth, responsive, and tight. This is the main focus of the game so this should be the strongest point about the game, and it is. The skill trees are pretty nice. I went for a 'Holy Tank' build but you can be a 'Rogue' type or a 'Wizard' type as well, so there is room for customization. The story/dialogue is decent. The graphics are crisp and look great. For 15 dollars I would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. It has some really challenging hard boss battles. Also some challenging combat. It can be easy to get your ♥♥♥ kicked real fast if your not anticapating what enemeies can do. Some people are ♥♥♥♥♥ing about hard it is, well they must suck at playing games. This game has a beutiful style, all the charcters and art look great. Sound is good, music is good too. The only negative thing I can say about it is there is alot going on with this game (story, combat/magic, upgrade wise) and it takes a little while to understand how to actuly play when the game first starts. But if your not a rage quitting idiot then it can be figured out easily. ",
            "review_score": "1"
        },
        {
            "review_text": "It plays very similar to Dust: An Elysian Tail. An action platformer game that contains RPG elements. The character levels up and you can distribute points into your skill tree and stats. The art is awesome and combat is quite fluid. Depending on your playstyle there may be an empasis on combos, critical hits or magic and etc. There are multiple characters to play that tells the story differently.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game and couldn't recommend it more to people who relish the metroidvania scene.  In my eyes, it is a wonderful mixture that hosts the exploration and mood setting brilliance of Castlevania: sympony of the night, along with the stylishly fluid combat of the DMC genre.   The art, animation and ESPECIALLY the music (I recommend buying the ost) craft a colorful, cute, but ultimately dark world that draws you in with every new area and challenge.  The story itself is a tad bit 'ham-fisted' in it's approach, but the brilliance comes into play with the world building they set in place. The bits of off hand dialogue, the back stories of the lost crew, and the item descriptions give you a sense that this is just a small story in the Valdis universe.  The Gameplay (which is controller applicable) is responsive, easy to memorize, and offers a high skill ceiling and low skill floor. It's entirely possible to simply hack your way through the entire story, but what if you add magic you your combat? passive buffs? skill canceling and dash mechanics? assisting characters? focus mode finishing moves? Then there comes the rpg mechanics where you can legitimately tailor your combat style to your liking. Wanna go pure strength base berserker? wanna specialize in healing magic and agile combo moves? wanna go full mage but also dabble in protection and guards? You can play through the story a MULTITUDE of times with each of the four characters and still have more builds to try out.   I've played through the game once with each character and have loved it even more with each go through. Like most Metroidvanias, the first playthrough can be daunting, clumsy, and exhausting to get through. However, the subsequent playthroughs will put your knowledge, dexterity and style to their upmost potential and ultimately give you the most fun when you're slicing your way past hordes of enemies and S ranking bosses. I found myself sitting at work and theorizing about strategies to counter tough bosses, make better character builds, and maximize my exploration and puzzle solving.  My only outstanding drawback for the game is the platforming sections. In most parts, its alright and more of an obstacle than anything else. However, it can become INFURIATING when trying to 100% the map completion or get through the multitude of time trials that count as puzzles. Luckily though, the vast majority of it is optional.   If you enjoyed the likes of Catlevania:SotN, DMC, Salt&amp;Sanctuary, etc. Then it is definitely worth your money",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good metroidvania that suffers from limited warp points, smallish map, and tiny variety of enemies.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game castlevania style with very good graphics, controls perfect and full of rpg element for all fan of action rpg side-scrolling !!!",
            "review_score": "1"
        },
        {
            "review_text": "a good Metroidvania style game with slick visuals and rockin' tunes!",
            "review_score": "1"
        },
        {
            "review_text": "Valdis Story is a fun little Metroidvania style game, with a fairly solid combat and levelling system. The visuals are incredibly pretty, and the music is decent as well (though not amazing).  The problem with this game is that it implements a few story branches that will majorly affect certain 'safe zones' getting cleared of NPCs. Often there is no clear way of knowing how your actions will or won't affect what happens later. Nothing is TOLD to you, you just have to get there by luck and a little bit of knowing what's going on. Finding your way around can be a total pain as well. You have a map, but you can't switch the map to scan other zones for unexplored areas. You have to physically go to those zones to check for things you've missed. The other problem is that the story is ultimately a little muddled and I'm not given any reason to truly care about any of the characters - not even the protagonist. There is nothing that makes anybody particularly memorable or loveable. They exist, and you can talk to them, but there's no reason to care about them. During the final moments of the game, a few characters even appear and 'assist' you in killing enemies, but there's no reason for their appearance and you can't talk to them. They feel like an afterthought thrown in to help serve the ending scenes.  It's a fun little game; it's not amazing, but it's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Just get it! Especially if you enjoyed playing Metroid Fusion for GBA back in the day. The further you progresses the more abilities you get and more areas you can explore! Along with that, the bosses are quite challengeing! I don't think I've beaten one on my first try yet! It's really fun because they aren't impossible to defeat. Once you recogrize the patternes and excecute everything right you can take them down! It really feels you accomplished something.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one if not the best Metroidvania game on Steam. Valdis Story I picked up on release due to curiouslity, and I was extremely surprised with what I played. The game has four unique scenarios following the main protagonists of the game which will give you a good amount of play time. The gameplay feels so smooth, and responsive so you can pull off good combos on enemies. The bosses provide challenges, and require you to level your character or try new tactics. The art style looks pretty good, and the environments are very calming along with the good OST. Metroidvania fans should pick this up without a doubt.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best 2D action/platform available in the market. Can't believe it is an indie game&nbsp;! Good level design, creative visuals -yet very anime inspired-, very interesting ennemies, challenging but fair. A true gem, the new Cave Story&nbsp;!",
            "review_score": "1"
        },
        {
            "review_text": "This game is an incredibly entertaining time killer. Story is pretty solid, generic, but solid. Gameplay is fantastic, with lots of unlockables and tons of variety as far as building your characters. Castlevania/rogue legacy type gameplay, with lots of hidden things to unlock. Strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG beat-em-up games I've ever played. I just have loads of fun playing through this game, and it runs so smooth you just feel BA when you fight.",
            "review_score": "1"
        },
        {
            "review_text": "Traditional Castlevania/Metroid gameplay with a lighthearted feel. It's fun and very challenging on the highest difficulties.",
            "review_score": "1"
        },
        {
            "review_text": "My question is where is the 2nd one for this game? Should be another one for sure I think",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful for people who like classic Metroid-Vania type games. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "love this game, reminds me of castlevania symphony of the night. If you enjoy metrovania games than you will enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "buy this game its so fun",
            "review_score": "1"
        },
        {
            "review_text": "Great metroidvania style game, I have played it almost non-stop since I bought it. If you love Metroidvania games and do not own this yet. I advise you to buy it while it's still on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game and it goes to show that you dont need a huge AAA game teasm to make a good game. This game is smooth and is fun to play. I havent had anything bad to say about it so far. I would like the resolution to fit 1920x1080 but what its at now is good enough. I cant wait for the new characters to come out and am very thankful that they are scheduled to be free.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun game, one fo the first metroidvania games that is actually continualy fun. The graphics are awsome the gameplay is smooth and fun, the rpg elemnts are rather deep and the story is quite origional. Fun &amp; challenging bosses among other things. Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "If you like any kind of metroidvania game (Castlevania: SOTN, Aris of Sorrow, Etc.) I would say this is a must play. Combat is fluid, lots of customization, and some very enjoyable platformer puzzles. Well worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "A hidden gem, hours of challenging fun",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand how this isn't a bigger thing. It grabs some of the best elements of RPGs and Action games and really brings them together in a way I havn't seen anywhere since the old castlevania games. As you progress through the game your character feels like it is really changing without that OP feel you get from a lot of indi RPG devs and the game provides a wonderful challenge. Its one of those games where it is technically possible to play the game perfectly and you activly want to get better at all the skill cancels dodges and parries. The bosses are diverse and will bring new chalenges and mechanics every time. Its just really freaking good.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked castlevania symphony of the night then check this out.... Enjoyed what time I got on it so far can't wait to finish!!! Might have to skip hanging out with the girl to play!",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvania with exp level ups and swtitch combat. The art is fantastic and combat is frustrating and satisfying. Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "A very enjoyable platform/brawler rpg. There are a few minor issues with the game such as a sub optimal mini map and overly utilized buttons, but it is enjoyable to play. Also incredibly challenging if you set it past the lowest difficulty. (I've only had two bosses I haven't needed to do retries for outta like 9 so far)",
            "review_score": "1"
        },
        {
            "review_text": "Takes a while to get to grips with, but so far its been a real blast to play. The combat is satisfying and enemies require thought and quick reflexes. Due to this bosses can be quite difficult, but personally I'm actually kind of appreciating that. Music and visuals are also pretty decent. For a studios first effort the game is very good, and all in all, if you enjoy metroidvanias you will most likely enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to tell yourself 'Man, I really over came that challenge with skill and had a tonne of fun while doing it?' Well don't play this game. 90% of the bosses scenarios and enemies feel like you are simply up against unfair borderline cheating. Did you dodge that super blade? Nope! Did you grab that wall? NOPE! did you enjoy yourself? NOPE! This is seriously on the edge of I wanna be the boshy, except the controls feel like they simply do not care what button you are pressing at key moments. if the game wants you to take a hit when you are hitting the dodge button YOU ARE going to take the hit. Does the game decide you can't wall just out of the poison? Well guess what it doesn't matter how many times you hit that button you aren't jumping out of the poison. Aditionally this should have come with a quick reset button.(Edit) It does come with a reset option HOWEVER you must 1 go to the main menu 2 hit retry 3 make sure you have the gear you want to use, because if you change your gear mid fight, it doesn't remeber it. 4 Dodge the obnoxious fast Boss risking losing an S ranking becuase you need to pause instantly to change stuff.  All that aside you CAN have fun with it, however I do not suggest going in blind. look at strategies, look at how other people do, and then try it for yourself.  ----------Summary------------ If you like the 'I wanna be the -' Games play it, you may enjoy it. If you like Punishing grueling teeth grinding games Play it! If you want a 2d version of darksouls Give it a whirl! But if you want a game that you can simply enjoy without developing a brain tumor, stay away.   (side note) this game doesn't lead you anywhere, you can miss VERY important things by going straight to the objective. This is a great part of the game. Punishment is the key word here and I suggest you are ready to be punished like a masochist before playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you are fan of Castlevania games so you will love Valdis Story!",
            "review_score": "1"
        },
        {
            "review_text": "Great side scroller with decent challenge and nice RPG elements!",
            "review_score": "1"
        },
        {
            "review_text": "A few hours in and really liking this one; a very well done metoidvania-style platformer full of abilities and equipment and magic and fun things.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "If you love Castlevania : Symphony of The Night to Playstation and Super Metroid to Super Nintendo then this game's for you.  It's a combination of the jumping and searching for secrets from both of them in a huge world and lot's of atmosphere and cute graphics. It might not be the most awesome game in the world with the most advanced graphics, but it's functional with a great gameplay.  Definitely worth a the money, so i just say...  Buy &amp; Try!",
            "review_score": "1"
        },
        {
            "review_text": "What an awesome metroidvania game. If you like the genre you owe it to your self to play this game. I am not even close to being done with my first play through and I already want to start another file with the other playable character. This is a game I wish I would have purchased right when it came out. Don't wait for a sale. Pick this game up NOW!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The hard version of Dust: An Elysian Tail",
            "review_score": "1"
        },
        {
            "review_text": "+: The art style is absolutely gorgeous. +: The combat is smooth and moving around is a breeze. -: The controls can be rebound, but with the rather large set of buttons to use, it can get confusing at times, especially when you have to remember which magic spell is bound to which directional activation.  Overall: Really interesting and fun game that just takes a bit of getting used to the first time around.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't enjoyed a 'metroidvania' this good since Symphony of the night. It may not be as long as SOTN per playthrough, but replaying the game as each of the 4 characters is a rewarding experience because they are all different enough from each other.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't even played this game too much yet, the only thing I don't appreciate is that there is not a soundtrack for purchase. Im havin' a great time listening to the 'abandoned gardens' bg music. Takes me back to my early game day's playing OoT getting all wound up trying to force myself into the shadow temple.",
            "review_score": "1"
        },
        {
            "review_text": "This game I guess you could say is a 'metroidvania' platformer, but more spefically the feel, level themes, and music really remind me of Castlevania: Symphony of The Night. However, the fighting style is a lot more involved in this game and allows you to use a variety of different spells (you can equip four a a time). The controls are mostly smooth and allow for quicker combat than you usually have in these types of games (although I occasionally had a hardtime parrying attacks).   My one main complaint about the game is that the story seems to left a lot unexplained, like, a couple more sentences at the beginning of the game would have made more sentence. It's not to say they left it all together, there's a lot of talk about gods and goddess, angels and demons and our angry hero who hates all of them, but you never really get a sense of who the characters actually are, which makes me wonder why the even bothered with the dialogue. I would also say that the bosses at the end of the game are quite a bit harder than ones you'll fight previously...if you make to the end of the game prepare for a couple of very frustrating fights. Additionally, a global map would have been very helpful, not ones that were partitioned with the three seperate stations. In a game like Castlevania where you have to revisit things and travel long distances, it always helps to keep track of where those things are- it was a little difficult in this game.   Despite my complaints, I still enjoyed the game overall and would recommend to anyone who enjoyed Symphony of the night or enjoys atmospheric 'metroidvania' style games.  ",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game is great. I hate the term 'metroidvania' but that's exactly the genre, and it's really done well here. You get a large area to explore, find upgrades that grant new powers to access new places, and face intimidating bosses. 4 characters give a layer of replayability as well as versatility, and each has skills and status points to upgrade each time they level up, offering numerous ways to play as each. Most importantly, the combat is fun and well paced, utilizing skill cancels, dashes, parrying, plenty of magic spells, and several weapons for each character. Also, the music is some of the best original video game music I've heard in awhile, probably since Symphony of the Night. Frankly, if you like SOTN, then buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I greatly enjoy this game and would happily recommend it. The combat is fast and percise. Combos and juggling are easy and satisfying. Movement is solid getting around is never a problem. Skill Tree is is small but each skill make a noticeable impact. There is one issue I have with this though.  My main complaint is about bosses. Most are good, but several are pretty cheap in the name of difficulty. The problem is they aren't difficult by themsevles but have infuriating gimmicks that makes the fight more of a ragefest than fun. Mostly things like passive healing or calling allies or calling allies, becomeing invulnerable, and passive healing at the same time. Which is just artifical difficulty boosting. Actually the final boss is so annoying that I have never bothered to beat the game.  Edit: I did just beat the boss but did not enjoy it   Other than that though great game, thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Good ♥♥♥♥ing Game",
            "review_score": "1"
        },
        {
            "review_text": "This is a fine example of what a great new 'metroidvania' game can be. Grab it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Valdis Story is one of the best metroidvania games I have ever played. There are multiple characters to play through the game with, and each has their own styles of play. They can be specialized in different ways depending on what stats and skills you focus on as you level them up, and each hero has multiple weapons that change their move set as well as damage output. The combat and skills are balanced in such a way that there are several powerful builds for each character that change how you fight and use their skills.    The boss fights are challenging and rewarding as there is a rating system that will reward you (with stat bonuses and unique items) for taking them out fast and with minimal damage taken. The combat evolves as you get more skills and equipment. The only major complaint I would have for it is that there is no abilitease at the beginning, so the combat seems fairly basic at the beginning.   The art style is solid and well done throughout the game. It may not be everyone’s cup o tea, but I would still say anyone could at least enjoy the game, and the animations are well done.   Combine the character selection/customization, challenging and rewarding boss fights, well designed and animated sprites, and a well laid out world and you have an excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely fantastic metroidvania with a very fun combo based battle system. 4 playable characters with their own individual skill trees and unique weapons give a lot of replay value to this underrated gem.",
            "review_score": "1"
        },
        {
            "review_text": "I love the music, the art, and the setting, and I usually like Metroidvania games. But try as I might, I cannot bring myself to enjoy Valdis Story. The controls are horrible and unintuitive. Your character doesn't get any invincibility frames when you take damage, so large groups of enemies (which are everywhere) can easily juggle you to death if you slip up and get in a tight spot. This is supposedly not a problem because you are temporarily invincible while you dash, but I've found plenty of situations where it seems like that just doesn't help.  Bonus experience for your character is doled out based on the rank you obtain while fighting bosses. Bonus experience is vital in Valdis Story because, while you technically can grind, normal enemies give so little experience that it will be an incredible slog to catch up. Getting good equipment often requires the completion of time-based puzzles, several of which are incredibly frustrating because the controls suck.  To give this game a fair shot, I restarted after learning more about it so I could gather more bonus experience from bosses. I will admit the gameplay can be smooth, but even when I was doing really well in the first part of the game, I still hated the controls and fought against them the whole time. Obviously, it's possible to completely master the game and get an S-Rank on all bosses, and I know some people will enjoy this game enough to get that good. I won't deny that it has the makings of a great game, I just feel poor design decisions mar it too much for me to recommend (or even finish myself).",
            "review_score": "-1"
        },
        {
            "review_text": "What could have been an amazingly beautiful game is faulted deaply by absolutely horrible controls (both keyboard and gamepad) and faulty animations that trigger continious flailing movement (and stun lock) at all times. Over halfway (60%) complete now and just not having any fun with the continious movement issues, never played a platformer with this poor of movement design. Challenging, engaging gameplay yes, poor movement design and controls yes, would I recommend this game, no, absolutely not until the game is even remotely enjoyable to play with smooth motion, not the continous jerky, faulty, and frustrating movement. Such a shame, it is an amazing game elsewise.",
            "review_score": "-1"
        },
        {
            "review_text": "I suppose I am not a true fan of the 2d Castlevania scroller, except the most recent one I played. I haven't played the genre much, so this is coming from not a true fan I guess, because some of the things that I didn't like I'm sure a big time fan would love.  The map system didn't show where objectives were. Just played Dishonored where they give you markers as to where to go. Much better design so you don't reach level cap like way early.  Level cap at 20. I really hated that, because it lowered the incentive to kill things. The amount of time to figure out where the specific drops were, combined with no more experience progression, pretty much ensured the last boss would be nuts.  That's the other thing I wanted to mention. Bosses are insane. You pretty much have to play over and over and over again to figure out how to beat it. Real annoying.  I could invest more time to figure out how to beat the last boss, but I'm done using my time to play this game, it just isn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "(I was pretty ♥♥♥♥♥♥ off when I wrote this, but I can't say my opinion has changed)  This game seems to have fun combat and platforming until you get stunlocked a million times. How could anyone say this game was designed so well? Enemies stunlock you all the god damned time in congested groups, or even just ONE of them. The jumping 'puzzles' are overly precise and not really based on skill, seeing as I seem to get a different jump height every time I walljump. Plus, the wall spikes and such have massive hitboxes. The enemies will even stunlock you midair while platforming with ranged attacks, usually offscreen or too far away to hit. The bosses can go from super hard to super easy in a heartbeat, from one to the next. The Yeti is a prime example of that. Enemies are recycled CONSTANTLY. I don't seem to be doing anymore damage than before after leveling strength, or upgrading a weapon. The skill trees have some really lame filler skills that you have to buy or else you can't get the better stuff. A bunch of somewhat interesting characters are introduced, and then discarded from any importance immediately. You can miss some items because an area is blocked off. Platforming is not very fluid because a lot of it is based on grabbing ledges (Why is this a problem, you may ask? Platforming is a big focus for the game, and even IT is clunky and slow), and sometimes you don't grab ledges for no reason. Sometimes your character will stand completely still for no reason during combat (not stunned, possibly a glitch). The controls with a controller AND on keyboard are awful. Sometimes the character will swing more times than you press the button. Speaking of buttons, the hitbox for ground pound buttons doesn't even cover the whole button. Everything is a lame jumping puzzle and you end up having to fall down 20 times to get all the chests that they put under them. Sometimes these chests are anti-climactic, getting Cloth or something. Most armor pieces in the game are terrible and not worth getting or using. The camera is panned too high up, and too close to the player. Some artwork is WAY WORSE than others. Some bosses have weak attacks, and your attacks even weaker against them; this just ends up being grindy and boring. Blocking isn't very useful. The story lame and cliche. Farming isn't fun for upgrading, and never will be. Magic is overly weak.  I think I sequence broke once or twice just by abusing wall jumps and ice pillars.  On the upside, the graphics were nice, the combat was somewhat satisfying, and the music was great (albiet VERY LOUD in some spots compared to many others).  Overall, this game is pretty okay, but extremely frustrating. I would not recommend this to anyone with anger issues, or standards for a good RPG. Disappointingly flawed, 55/100",
            "review_score": "-1"
        },
        {
            "review_text": "Unresponsive and VERY poorly thought out controls, badly designed levels, very few enemy types (all of which are 100% predictable), NPC interactions limited to 'hi, go here for next quest.' I give this a D-, because I reserve F's for games that are nonfunctional due to bugs/DRM.  Here's a limited sample of the frustrations: Many of the games actions are mapped to keyboard button combinations - for example, s+d, s+w, s+up. You can figure the individual keys, but can't configure the fact that it's a combination rather than the MUCH simpler and more intuitive single button press. There's no justification for this, other than the developers being LAZY as this is console port and they 1-1 mapped the buttons from the original.  Many of the boss fights involve the following - boss punches the ground to use a shockwave attack, boss punches forward, boss makes stuff rain from the sky, repeat. I've encountered this pattern (with very similar, if not identical sprites) on at least 3 bosses and I'm nowhere near the end of the game. If you don't grind levels - and you level VERY slowly - most boss attacks deal 10%-50% of a full life bar when juggling, damage over time, and what not are added in.  Loads of enemies have ice attacks that freeze you in place and want you to wiggle (&lt;- -&gt; repeatedly on keyboard) to escape getting endlessly rejuggled. This game LOVES to juggle you with no control given to the player, no or limited combo break opportunity, and no chance to escape. Just put the controls/kb down and let it do whatever.  The game does not have money. Instead, the merchants - of which there are many - want to barter for a very particular set items. The game has ~50 or so things that can drop for barter, making trying to get anything from the merchants a ridiculous chore. The game lacks any sort of in-game tracking for targeted trades. You either need to write down the trade requests or consult a FAQ.  Quest givers give you an indication where to go ONCE. Asking them where to go a second time results in unhelpful small talk. The in game map does not give meaningful directions, though mercifully it does tell you the current quest goal.",
            "review_score": "-1"
        },
        {
            "review_text": "I like Metroidvanias, but this is more a beat em up bullet hell with bolt on RPG elements.  I didn't find these elements very well explained - like many RPG systems it's assumed you know how often a crit occurs and thus how good boosting crits are compared to everything else. The magic system is interested but again not very well explained, and all the controls felt very stodgy on the PS3 controller. There is weapon crafting too but the weapons I had didn't feel very unique or characterful.  This is the other RPG element that doesn't really work. as the character you meet all stand in place and lack movement and personality. That includes both the team mates you pick up and those you meet in the world.  The missions too lack variety, and a lot of the world is about collecting keys to open a door to punch more people, there wasn't a big hook to the story to push you onwards, and the plot assumed you already cared enough to move on.  Returning to the controls, with gamepad, the controls feel messy, with four spells activated using up, down, left combos when they could have just been mapped to the L and R buttons. This makes combat more fiddly than fun, and as it does end up like a bullet hell at points the lack of precise controls undermines this.  In addition, you don't feel each hit you make, other games give opponents howls when you finish them off and big reactions when you even hit hem a little, but this really doesn't make that connection between player input and good chunky sounds. I really didn't feel the combat was either graceful or powerful.  It felt like a game where the RPG elements had been borrowed but not really understood or expanded in a flavourful way (which is bizarre given how the angels vs demon aesthetic suggests creative minds at work) while the combat doesn't feel particularly precise or rewarding. So I do not recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I was stuck in a first cavern. When I returned - all my progress (level 5 or something) was lost and there was no explicit warning about it. It's year 2014 dammit, you can't just take away stuff from players.",
            "review_score": "-1"
        },
        {
            "review_text": "Now I'm all about gameplay and this game has some really ♥♥♥♥ing mediocre controls. They're alright overall and ♥♥♥♥ing garbage when you really need them for some of the platforming and dodging. The whole combo system doesn't make sense, the more you hit ♥♥♥♥ the higher the combo but the combo tiers/exp rewards differ sometimes when you get the same combo length. There are also only a couple of good boss fights in the game but overall they're tedious as ♥♥♥♥ to take down with each one having their own obnoxious gimmick. The bosses themselves aren't exactly the worst ♥♥♥♥ to kill, it's when you get scored at the end of a boss fight that makes it obnoxious as hell. You get scored on how long it took to defeat it, how many times you got hit/how high your combo was, and how many bars of life you needed to defeat the boss. Trying to get that 'S' rank on a boss is hard as ♥♥♥♥ and annoying as ♥♥♥♥ to do. ♥♥♥♥ING DESTROYING CRYSTALS TO STOP A PASSIVE REGEN ON A BOSS ONLY TO HAVE THE CRYSTALS RESPAWN 30 SECONDS LATER FOR YOU TO RUN AROUND AND DESTROY AGAIN IS NOT FUN, IT'S TEDIOUS AS ALL ♥♥♥♥. Now I'm all for hard games that are actually, you know, hard. You get a feeling of mastering the game with your own skill. Valdis Story fights are mastering a cheesy gimmick and hoping that the controls don't ♥♥♥♥ you over when you have to dodge, jump and run around platforms. It's incredibly aggrevating.   A few of the enemy designs are also annoying as hell to deal with, and you have to deal with them a lot. Like there are these floating ferals that can cast a wave of spells on the ground and if you get hit once, you're in for the whole ride. Man i wish the controls were better. Then the same enemy also has a shield they will deploy once they hit a certain threshold of hp, making them invinicble for about a few seconds. and the do this twice. this completely halts any action on this one specific enemy. I can forgive them if they just had it do the shield ♥♥♥♥ once, but twice? come on.  The soundtrack for the game is well done though and overall the game looks very pretty.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately, I cannot recommend this game to anyone but those who love old-school hack-and-slash platformers. The game calls for fairly rigorous platforming almost right off the bat, which comes across as tedious rather than fun. The second boss you come across has a strategy of boxing you into a corner and pinning you there. IMO that's more mechanics abuse than strategy due to stun locks and jump mechanics limitations. It is a perfectly winnable battle, I just don't enjoy that type of gameplay. I can only imagine it gets more 'fun' from there.",
            "review_score": "-1"
        },
        {
            "review_text": "Expected more from this game coming off of Hyper Light Drifter (got it as a recommendation)... should have watched the vids, game is super thin. Semi-fun to play, but mega meh.",
            "review_score": "-1"
        },
        {
            "review_text": "As a lover of other Metroidvanias, this game frustrates me to no end. I'll try to sum up my complaints in a manner that is meaningful to those looking into this game.  First of all, I feel like a distinction needs to be made. This game is not a Metroidvania at heart. At heart, it is an action RPG with (minimal) exploration elements. Valdis Story's focus is on combat, and that's fine because combat is one of the things that it does quite well. The problem is everything else feels like it is tacked on. It feels like the combat system was developed first and then the rest of the game was developed around it.  The map, for a metroidvania game, is awful. It is always scoped in on the area that you are in and there is no way to see any of the other areas you have been to or how they even connect. I would even be willing to forgive that, were it that the map actually showed anything useful at all. It is only comprised of boxes that represent the rooms of the area and the entrances and exits of each. It doesn't show anything else useful, like treasures you missed, or locked doors, or anything along those lines. Some of the rooms are color-coded, but there is no key, so the player has to try and figure out what color means what - the only thing I worked out was that green rooms were save rooms. The map leaves much to be desired.  The platforming controls are terrible. The combat controls are good, but the platforming controls are bad. The jump feels really stiff and floaty and the wall grabs and wall jumps take a lot of time to get used to. This really wouldn't be a huge deal, but the game likes to throw platforming sequences at you where you need to be precise. I also don't see why the developer decided to throw some of the later abilities - double jump, an ability to make a platform to reach tall spaces - into the spells category, so every time you need to use them you have to mess with your spells and make sure you have enough MP.   The boss fights are the thing that kept me coming back, because some of them are fairly interesting, but they get cheaper as the game goes on. You should pretty much expect to get completely wrecked by never-ending stunlock combos the first few times you try a boss, because you have no invincibility frames upon getting hit. I think the developer intended for the player to use the cancel you are given to dash out of these situations, but there are times when that is impossible - try it in big attacks and you will simply waste a cancel while still being caught in the move. If you try to dodge one of the many enemies placed on the edges, you'll end up slamming down into the pit that you were trying to clear. Not to mention, if you don't get a good grade on the boss fight, you miss out on stats for your character - why they thought this was a good design decision, I have no idea. It only benefits those good or lucky enough to attain those grades and further punishes players who are struggling.  Most of the collectibles feel pretty worthless, because they are either crafting materials that only feel important when you want to make something and don't have enough, or sets of armor or accessories that aren't as good as what you have because they don't fit your build or playstyle. There are health and mana upgrades, but they are mixed in with the rest of the lackluster collectibles.  The story feels really contrived and generic, and there just wasn't enough there to make me care about who I was playing, or why.   If you're looking for a game with decent combat and a cool cancel mechanic, I'd recommend picking this up. But if you're looking for a true Metroidvania, I'd at least look a little harder before buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "A good effort at a side-scrolling action RPG but suffers from some critical issues. Combat is meaty but limited and often you get rushed with no chance of attacking until half your health is gone. The platforming is floaty and weak at times, which leads to incredibly frustrating battles as maqny enemies (and even some bosses) can knock you out of the sky with a single hit. There's a weightlessness to everything that makes Valdis Story hard to love and sometimes a chore to play. If you want a retro-style game experience, complete with clunky controls and often unfair failures, I'd say give it a go. If not, be prepared to take a lot of hits and deaths that don't feel like your fault.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm very excited for this game, but there seems to be some kind of visual issues with its current version. A bunch of random icon art is showing up instead of the opening screen, and then -- after some button pressing -- I see a pretty clear character selection menue followed by a black screen and sounds of water crashing upon the shore (the audio seems to be fine). I assumed there was some sort of error with the first download attempt and tried a second time to the same result. I'll come back in a little while and see if it works then, but in its current state I cannot recomend the purchase.  I just recently (1/13/15) re-installed this game, and it now works wonderfully. Will write a more comprehensive review when i've beaten it.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: -Nice graphics -In a Metroidvania style -Different characters actually play differently  Cons: -Very demanding platforming -Very little of the level is shown at a time, further hampering platforming -Unpredictable movement patterns make navigation and combat frustrating -Awkward control setup overcomplicates the demanding combat -Story relies too much on invented words, and is largely discarded after opening cinematic  I wanted to like this game, because Metroidvania is an underserved niche on PC, but I really bounced off this title. It's clear they've put a lot of work into the combat mechanics, but they remain pretty baffling and hard to use--dodging, for example, is not a single button press, but requires you to activate 'skill cancel' (bound by default to 'down'), then press left or right. 'Skill cancel' is a function which is intended to let you interrupt various moves, so that you needn't be hit by being stuck in a long animation. That sounds good in concept, but it has a cooldown, and the main animation that got me stuck in the first place was the 'dodge' animation, so the cooldown meant I couldn't cancel that animation. 'Dodge' got me stuck because it would sometimes allow me to pass through enemies and get behind them, which was a critical tactic in tight corridors, but other times (I think it was if they blocked while I was dodging?) it would take me right up to the enemy and then freeze me in place for the rest of the dodge animation. The interactions with ledges were similarly frustrating--by default, once you get the ability to grab ledges, you'll grab on whenever you can, and you can then climb up, drop down, or spring away in the opposite direction, all with directional presses. Unfortunately, it's very finicky about whether it thinks you can grab a ledge or not, and the height of 'you can jump and grab this, but failed to on this try because you jumped from the wrong point of the slope next to it' and the height of 'you can't jump and grab this' differ by only a few pixels, so it's often down to just trying a few times and then giving up. In a metroidvania, it's important that the distinction between 'you can reach this now' and 'you can't reach this without additional equipment' be usually pretty obvious, so you don't waste a lot of time trying to get to things you can't possibly reach, and that's very much not the case here. It's also fairly common to run across a boss fight as rather a surprise, and if you die during the fight, your only options are to retry the boss fight, or go all the way back to your last save point, which are few and far between, so if you find yourself underlevelled, it's a tough call whether to keep trying the boss or to redo a lot of lost ground and grind to try to power up a bit. Boss fights are graded; I generally had to redo them a couple of times while I learned the patterns, and then squeaked by with a 'D' grade. It also appeared that XP awards for bosses were reduced if you got a poor grade, although I may be mistaken about this, because that would be pretty backwards--if you were underlevelled and barely made it through the fight, surely you need a boost of experience to make things a little easier, whereas if you're cruising through the fight barely breaking a sweat, you probably don't need much help in the levelling department.  I haven't brought up the story yet, which is partly because the game doesn't bring it up much either. There's a long opening cinematic, consisting of text over still images, but it still doesn't give the player control over the speed at which this advances, which is a minor pet peeve of mine; and it relies on invented nonsense words to try to create a sense of exoticism. Actual line from the opening cinematic: 'We've been searching for Gernot for many months now. He's the last living Hyogokun Knight in Myrgato's Dark Army.' We have no points of reference for any of these names, so it's virtually meaningless to the player. But this story is almost entirely discarded after this opening cinematic, so it doesn't make that much difference. Once you're playing, all that's really addressed is that you're looking for your crew, you're ostensibly at the bottom of the ocean but that apparently doesn't preclude the typical forest/ice caves/crypt etc. fantasy settings, and the enemies you keep having to fight are classified sometimes as 'angels,' sometimes as 'demons,' and sometimes as 'ferals,' although the distinction between the three is obscure. It's fairly generic fantasy nonsense, and if it were more of a focus in the game it'd be aggravating, but as it's all treated as window dressing for monster bashing, it's reasonably inoffensive.  The music is kind of similar. It's not actually bad music; it's kind of generic bombastic fantasy fare, but it's well made. Unfortunately, it blares at full maximum-drama intensity at all times, with no sort of modulation at all, which is very quickly tiresome.  In short, then, the movement and camera and controls felt off to me, and that really drove me off the game. The artwork is nice, but focussing on it led the designers to zoom far in on the characters, which hinders the exploration and platforming that are the core of the gameplay. The music is well done, but misused in the game. The story is bland but mostly out of the way. There's basically nothing here that's compelling.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels very cheaply made with tons of abilities that will leave you scratching your head. Im going to have to google what the stuff does again becauase I forgot and theres so much to remember. Still it has nice music and graphics... just let down by being dumb.. maybe it gets better later, If it does I may well alter this. But yeah theirs better ones out there so missing on this isnt a big loss.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked this game at first. The idea, story, and gameplay are all great at first. After a while the graphics get to you. They aren't quite 16 bit and they're blurry. If you do 2x to try and improve them it just looks bad. The game should look much better than it does honestly. However that's not the part I really don't like about it. Given everything about the game I would rate this highly except for the squishy factor.  You start out super weak. You remain super weak throughout most of the game. It's crazy how OP some of the enemies are with powers that just destroy you in seconds. One bad hit can mean 80 damage and death. There's no blinking, no temporary invincibility when you take damage, so you just keep taking damage which just compounds the more enemies that are attacking you.   Bosses and sections of the game are super trolly. Some areas you're supposed to jump gaps on tiny moving objects while enemies are shooting projectiles at you. They aren't on the screen, so you can't do anything about it except hope that it doesn't happen because blocking doesn't work that great. As you progress you get better armor, items, and skills that make it easier, or so you would think. Only the bosses and enemies get more OP and more troll as you go.   I haven't yet finished this game because every time I pick it up something about it pisses me off. I always forget why I stopped playing and I always realize it's because the game is made to make you try again and again and fail over and over. This isn't the kind of game to have that play style and it just becomes a huge turn off. Maybe if leveling up didn't take forever, grinding wouldn't feel like some epic task that takes days. No matter what, I just realize this game all around was half ♥♥♥♥♥ in many ways.",
            "review_score": "-1"
        },
        {
            "review_text": "good combat but ♥♥♥♥♥♥ game design.. dont buy this ♥♥♥♥!",
            "review_score": "-1"
        },
        {
            "review_text": "As a giant Castlevania fan, I had to try this one out. Don't get me wrong here about what I'm going to say, it's not a bad game, not a good one either though. I like the artstyle, the boss fights and the combo system, but the platforming and especially the unnessessary part of getting over tideous rooms over and over again, even after clearing them, because you need to activate something to open the door is just infuriating. I hope the developers take all the criticism I have seen spreat among the reviews and improve on it, because I really think they got the talent to pull off a way better product.",
            "review_score": "-1"
        },
        {
            "review_text": "3/10.  Wanted to like this game, had high hopes, but this game was a resounding disappointment. Lets start off with the game setup. The art is nice, so is how 'open' it is and there is a lot to collect. The story seems interesting and there are a lot of bosses.  Now the bad. The way the game is setup is with this giant map with tons of different vertical platforms and interconnected levels. There is also no real map, markings, information, quest markers, or anything. Quests give you no information, besides potentially tell you a direction to go in or maybe a specific area to get them, or maybe even neither of those. Don't mind that the map doesn't have the whole world, nor does it label anything. This leads to wandering a round and wasting hours on end with no idea what to do. This has led the community to create a map, and tons of people posting how they are lost because of no direction or information given by the game. Then, since every level has tons of different platforms and is super vertical, but has doors, levels, magic walls, it is impossible to get to half the stuff. I get some people love the 'metroid' style but it basically is just backtracking, having to remember a wall you saw 3 hours about that you now have a power for. You never know where to get anything, or what to do with it.   You collect a bunch of team members but they don't seem to do anything nor does the game tell you what to do. You have tons of inventory spots, and levels of abilities, but the game doesn't give you any information about them either. I played for hours and still had tons of empty spaces in my inventory. The item system works by you basically collect a bunch of random mats that drop and you trade in a bunch for one thing. This means to get 1 thing you need 15 different types of mats, and if every single one hasn't dropped you don't get it. So instead of actually getting things, you're left with 1/2 the required amount needed of mats in your inventory without getting anything new ever. I used the same chestpiece for the whole time, because nothing I picked up was better.   Then theres the terrible platforming. The controls are way too finnicky and floaty. Sometimes you guy will grab a ledge, other times he won't. Sometimes he will wall jump, sometimes he wont. If you use the analog when you jump you will slide off. Then there is the dash and the ground slam. They are done by using the directional buttons, instead of a button, wich would make more sense. This means tons of times when you want to jump, just because you touched down, you will slam down to the ground. Or you will suddenly dash without wanting to, just because of their terrible control scheme. Other times your guy won't jump soon enough when you press it, or he will just slide off the ledge. The controls are anything but tight, which you would expect for a game like this. Then, in annoying poorly done fashion, if you get hit there is the terrible 'I must be interrupted and go flying backwards for no reason' which means while you are jumping or on a ledge if you get hit all and fall back or off a platform, which is frustrating when it shouldn't be.The game utilizes way too many timed mechanic puzzles just to open doors or get chests. Every area has, unlock 3 things in a row with 0 margin of error just to get an item you won't use, or a single mat.   The combat is pretty bad too, because each hit stuns you, you can get constantly chained and juggled by 2-3 normal enemies who just with continually hit you with no cooldown while you keep getting stunned. Not to mention they do tons of damage. In 1 group of regular guys I lost 2/3 my health in 2 second stun chain, which is soo dumb. The dash in combat is super finnicky too. There are guys that you can't walk past, who have shields you can't attack from in front. If you try and jump over they just slash up in the air and with the questionable hitboxes you will get hit no matter what. This means you must dash past them. But you can only dash once because for some reason it needs a cooldown. If you aren't exactly right up next to them you won't go through them. This means youll stand in front of them and they will just be able to hit you because you can't get past them for some reason, and dashin is dumb.   Then there are the boss fights. Most of them are more annoying than they are fun. You never know when they are coming. You suddenly enter a room and the boss fight started, meaning if you don't have potions you are screwed. You cannot leave the area either if you don't want to fight. And since you only can restore potions in the 1 save checkpoint per giant area you will unlikely be able to do it. Some guys use almost instant kill attacks that you can get caught in like a fire pillar.Many people on the discussion forums talk about all the different annoying cheap boss fights that weren't fun, so there are many ones. I fought a stupid annoying boss that you can't hurt until you climb a bunch of platforms while doddging homing swords, to destroy a crystal, so you can then hurt him, but your magic and weapons do very little damage, and once the crystal heals itself it then will heal the boss. This means I made almost no progress and there was nothing I could do about it. Each time I would do about 1/20th of his health after he was healed.   Then theres the spells. Instead of being easy to use, they are triggered to holding R trigger and ALSO pressing a directional key. So you have to remember which spell is related to which directional preference, also, since they are directional, this causes problems with movements and dash/slam. Many times I would go to cast a spell and it would make me move off a ledge, or instead of casting it would make me use a cancel/slam. Also, there are different types of spells :light/dark/fire/ice. The problem is is some do no damage to enemies and others are weak to some. This means in each area, you have to figure out what each guy is, and what they are weak to, then switch your spells to them on the wheeel, which isn't easy to do as its finnicky when using the quick/change ability. Add to it that some abilities you need to get up to ledges or through doors and it becomes annoying. You somehow level up abilities but that isn't explained nor didn't seem to happen much. You level up, but only get to add 1 attibute point total, and the abilities in the tree you choose from are boring, like 10% more health, crits deal more damage, you deal more damage in 5 chain hits, etc, and the higher level abilities can only be gotten once you get a level, but ALSO once you get 2 different abilities that form a tree to that ability, meaning you will have to waste points in things you don't want to get something later on.   The way the open-endedness is done is just terrible. Sure there is tons of things to unlock and a big map to explore, but the levels have 5 ways to go, are super vertical and annoying to navigate through, there is no real fastravel (besides btw 3 villages), no markers/waypoints, no maps, no information about anything at all. For this main quest, I was supposed to go into these 2 different areas, but one of them required a key that I didn't have. Why would the main quest send me to somehwere I can't go. Apparently I was just supposed to wander around a ton or fight some random boss or do something random to get that key. The other area had this annoying healing boss I did no damage to. From watching videos some guys did tons of damage with the same spells that I used that did none, but my spells were level 1. So apparently either this video guy was too high level or I was supposed to level up my spells, but how I don't know. I either had to grind levels or find some random area/ optional boss that helped me level them up. There are new weapons and abilities to get, but you need to find the random chest/puzzle/optional boss/teammate instead of natural progression.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful game falls short of expectations. The artwork looks great. (1/5)  There are many problems that CANNOT be overlooked in this game.   1. The controls. The dodge button is really difficult to proc and it is the same button you use to 'cancel' an attack. They should have just had a dedicated button to 'dash' and another button to cancel. There are so many keys on the keyboard and buttons on a gamepad like the XBOX 360 PC Controller that it baffles my mind why some of the button combinations are so god awful.  Another thing, the block and Magic button, when pressed simultaneously, it brings up a screen to rebind your magic. Here's a tip, GET RID OF THIS GOD DAMN BIND. IF we wanted to change up our magic combinations, we should just go back to the menu in our inventory instead of this 'fast' changeout of magic skills. The problem is if you are blocking an attack then attempt to do magic, sorry, you go to the magic skill screen to swap skills. It's very annoying, breaks the immersion, and impacts the ability to fight.  2. Jumping onto platforms should not be this difficult. The character model looks like they'd be able to 'latch' onto a ledge, but they don't. It is VERY unpleasant to miss a jump, then get chain attacked by mobs.  3. Combat. If you are surrounded my a bunch of mobs, they WILL chain attack you and juggle you, to the point where you cannot fight back and you're dead.  4. Combat &amp; Mobs. This is an RPG with not enough mobs in a damn map to kill in order to actually GET sufficent EXP out of them. Furthermore, there are NO consumables, so you're dependent on save points to regenerate HP/MP, kill maybe 2-3 mobs, and then head back to base to regenerate. Although you get potions later in the game, they only proc when you're DEAD. Running back to base when you've got 50 HP left is NOT fun. This was incredibly short sighted on their part.  There is NOT enough mobs to get Experience from, which greatly hinders your ability to get levels and blast through bosses. You end up staying in 1-2 areas killing a few mobs over and over again. It hurts the immersion and the feel of the game.   5. There is no 'up' attack. You jump up and do a horizontal attack in one of the two directions. There WILL be mobs either flying or directly above you attacking you and you have no way of attacking them unless you use magic.  6. Puzzles with Timers. There's very little time to get to through to the area with the activated door, and you have to rush to the area spamming your abilities. Timers are something like 6-12 seconds, average is 6 seconds. In my opinion, they should have just had switches activate and gotten rid of the time. The game attempts to add too many obstacles to a game that already has issues that hinder progression as seen by the terrible and broken keypad interface.  Closing Statements: The game looks incredible; however, it's just that, it only LOOKS good. The game is hindered by it's control system, consumables (potion system), and the way the characters gain experience. It feels like I must spend 20 minutes grinding an area for 1, maybe 2, levels before progressing to another area to take down enemies. The story looks good, which is sad because it's being ruined by essential components in the game.  The lack of healing items and regenerative abilities. The lack of experience gain from enemies. The lack of enemies in general, and when they are plentiful, they all attack at once and juggle you to death. The lack of consistency in jumping and grabbing onto ledges. It's 50/50 The implement of timers is poorly done. The timers should be increased by 2/3 times. It really a component that is not necessary in this game. The poor use of buttons/key combinations for skills. They need to fix the dodge and quick magic skill menu.   Just stay away from this game. Your time and money is better spent elsewhere on a game that works as intended.  An alternative RPG game like this genre is Y's Origin. It's a much better and consistent Hack and Slash with great replayability due to it's 3 playable characters, each with a different twist on the story.",
            "review_score": "-1"
        },
        {
            "review_text": "If I didn't have extremely autistic levels of completionism I would have dropped this game after halfway through. Even completing it was an exercise in sadomasochism. The controls are basically an awful cluster♥♥♥♥ and you'll find yourself dash cancelling and casting spells with even the slightest motion of an analog stick and most of the bosses' difficulty is centered more around being a damage sponge than having any sort of interesting attack pattern. The final boss is a textbook example of how not to script a proper boss fight.  I wouldn't give this game to my worst enemy out of fear of being jailed for crimes against humanity.",
            "review_score": "-1"
        },
        {
            "review_text": "God this is horrid its buggy the slowdown is awful if two things are on the screen the controls are meh at best and honestly the story kind of sucks",
            "review_score": "-1"
        },
        {
            "review_text": "First off, I played this with a gamepad. Secondly, I  want  to like this game, but it won't let me.   I want to enjoy the beautiful vistas, the amazing Secret Of Mana style music, the huge bosses and the metroidvania environment, but I can't because I'm continually being punished by the game. This is a metroidvania version of I Wanna Be The Guy. If you like that game, you're going to love this one since it's built on the same principles:  * EVERY enemy is a cheap, multi-hit air-combo juggling spam-fest. If you fight more than three enemies at a time and they crowd you, it's better to simply put down your controller and wait for them to kill you. If you survive the encounter, your bad healing ability will have you wait five minutes before you can fight the next batch of enemies only to repeat the cycle. I can understand elites in a game, but when every single unit has the health and skills of an elite that invariably juggles you in the air until you die on NORMAL difficulty, then that's a problem.   * Pitfall screens, so you're up three stories in a dungeon, you get hit by one of the enemies, you fall two screens down and have to climb back up. This is not fun, this is punishing.  * This has been said a lot, but the jumping mechanics and mantling are really bad. Unless you hit just the right part of a wall, down you go again. Combine this with the level design that seems geared towards you falling into pitfalls and you have a really bad result.  * This is especially infuriating when you have to do timed jump/run puzzles where your inability to properly walljump punishes you by having you redo the puzzle again. And really, these puzzles are insanely complicated in some instances.  * Boss rooms aren't marked on the map, why is this a problem?  Well, here is a typical flow of a quest in this game:   1) Get a hint from someone to go somewhere.  2) Navigate annoying pit-fall maze with juggling enemies that forces you to stop every ten minutes to heal. 3) Get hard to get treasures with jump/run puzzles  4) Save somewhere in the middle of the dungeon 5) Navigate even harder pitfalls and environment hazards, get killed a few times. 6) Get more treasures through puzzles, defeat more enemies, level a bit 7) Stumble over boss room and realize boss is impossible for your current level.  At this point, you can't quit the game. Either you defeat the boss and progress, or you lose ALL progress you've made since point 4 in the list above. Again, this is punishment,  not because you're bad, but because the design decisions are bad.    So after having played ten hours and gone through the same cycle over and over, I realized that  I wasn't having fun , I wasn't enjoying the scenery, I wasn't pondering the story. I was just focused on exploiting the AI and how to not get killed and that's really not my idea of fun in a game.  And really, considering the fantastic world this game throws at you, it's a huge shame.",
            "review_score": "-1"
        },
        {
            "review_text": "good game with good fighting style,cool boys and girls in there,and replayable RPG upgrade tree  however,it detonated my video card,make it nuke my city off the map(joke  It's unfair to say this,but I think a 2D ACT game shouldn't consume that much resource,you can quiet enjoy this game if you have a good pc and dont care about overheat or something.But for me,no",
            "review_score": "-1"
        },
        {
            "review_text": "On the surface it looks promising enough (Metroidvania games are pretty hard to screw up) but within an hour of playing it you'll start to sour on it. First you realise the controls are ♥♥♥♥ing horrible. Then you realize you have no idea where you're going or what you're doing. Then all at once you realise... you are playing what I've come to call a 'bad game'. The story is straight up high school edgelord 'what if angels and demons are both bad guys' kind of writing, which is perfect inspiration to go find all your old notebooks and burn them for safety's sake. In this game you play as some cretin who is a mixture of demons and angels or some crap (see Diablo III) and you go around a confusing map fighting pallet swaps of enemies for 6-8 hours and then you uninstall it. I guess there's other characters and difficulties you can unlock if you don't have anything better to do, and if this happens to be the only computer game your circus ringleader lets you play, because you are a dumb ♥♥♥♥ing idiot clown. Bonus points for a late area where you're constantly poisoned and the entire screen has a lovely bright neon green filter on it, which is great if you're the kind of person who is dissatisfied with the amount of migraines you suffer while playing your video games.",
            "review_score": "-1"
        }
    ]
}