{
    "app_id": 252050,
    "name": "Construction Machines 2014",
    "release_date": "2014-03-28",
    "developer": [
        "GameCask"
    ],
    "publisher": [
        "GameCask"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Building",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 38,
    "negative_ratings": 272,
    "price": 4.99,
    "description": "Become a boss of a construction company. Demolish old houses, flatten the ground, fill foundations with concrete and build new buildings - this is what you do. Sit behind the wheel of different construction machines - from trucks and diggers to huge cranes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252050/header.jpg?t=1555359707",
    "minimum_requirements": "OS: Windows XP SP3 / Vista Processor: Core 2 Duo 1.8GHz or AMD equivalent Memory: 2048 MB RAM Graphics: 256MB GeForce 9600 GT or better DirectX: Version 9.0c Storage: 650 MB available space Sound Card: DirectX compatble Additional Notes: game will NOT WORK on Windows 7 64bit",
    "recommended_requirements": "OS: Windows XP SP3 / Vista Processor: Core 2 Duo 2.5 GHz or AMD equivalent Memory: 4096 MB RAM Graphics: 512MB GeForce GTS 450 or better DirectX: Version 9.0c Storage: 650 MB available space Sound Card: DirectX compatble Additional Notes: game will NOT WORK on Windows 7 64bit",
    "reviews": [
        {
            "review_text": "I don't know where to begin. Right now I don't know if I can recommend Advanced Warfare because of how buggy it can be. Sometimes it will connect to a match and either take longer than usual and the match has already started (even though I join before the lobby has connected) or it'll freeze whilst 'synchronising settings' and then quit due to connection failure or something. When playing online, I cannot tell you how ANNOYING it is to be mauled by some ♥♥♥♥♥♥ weilding a laser. Oh, and it's not just the odd one, I mean I faced an ENTIRE TEAM full of them at one point lol. They take no skill because you can literally use it like a bloody lightsaber!   The singleplayer is... typical COD. No innovation. I mean, Black Ops II had a branching storyline for God's sake. I skipped Ghosts altogether due to the rather rubbish reviews for the PC version. But, seems like Sledgehammer Games are afraid of being risky and adventurous with a story. My brother, who hardly plays games full stop, decided to give this new COD a crack, and casually breezed through it in a few nights.  On top of all of this, the game likes to quit completely and recommend 'Safe Mode' due to DirectX errors. I have like every version of DirectX that I need (and the game will go ahead and install the ones it needs anyway...). My PC is good enoguh to run this, but even on 'Optimal' it still has errors. I'm talking 8 GB of RAM, Core i5 4690K, GTX 660. However, this isn't the first game as good ol' Need for Speed: Rivals does it too. I'm not the only one. But, what can I do?  Also, if I crank up the settings up to maximum and play the story, the textures are aweful! Flat and no visual substance whatsoever. Plus, it runs like poop. Oh, but do 'Optimal Settings' and things are fine. I don't get it.  I've had fun with this title, when the connection is good and stable. But I can't quite recommend this in the condition it is in. Activision need to promote the idea of 'bug checking' and 'ensuring EVERY verison of our game is up to scratch' and not, yet again, leave us PC players feeling left behind.  11/10 would construct again",
            "review_score": "1"
        },
        {
            "review_text": "Horrible game bad graphics could even get past the sign in part kept getting some kind error and i meet all of the requirements . DONT BUY THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "8 out of 42 players like this game.  Graphics are okay assuming you have high end SLI'd GPU's.  Controls aren't good enough to be considered, ARCADE; this game should not even be under the category of simulation.  40 pound rocks can make the Bulldozer flip over; no exaggeration.  No speed range. There are only 2 speeds: Fast and Out of Control.  Running over 40 pound rocks can cause you to loose what you just scooped up from the ground; no physics at all.   I am seriously thinking about reporting this game to the Better Business Bureau; it should be banned from America.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is ♥♥♥♥, ♥♥♥♥s up your desktop and the $15 would have been better spent burning for heat",
            "review_score": "-1"
        },
        {
            "review_text": "I am really disapointed. For a game thats is called construction machines there is really very little constructing going on. Ive come half way through the game and all i have been doing so far is loading and unloading and pouring some concrete that took less than 60 sec to complete. The missions are really short, however this is a good thing, the machines in the game are so bad it would be torture to have longer missions. The title is great, everything else isnt. The gameplay feels akward and like an early beta, controls are akward and not acurate at all, even driving around feels strange.   Shame, with a little more work, this game could maybe even work.",
            "review_score": "-1"
        },
        {
            "review_text": "So now I have given the game half a chance and played it for a while, I do have to say that giving the game further time didnt help it at all just frustrate me further. The controls are poor at best, they have not even used common controls. The camera angles that you operate from are far from anything decent so the number of times I have had to remote camera just to see how close to an object is rediculous. Having a camera anglethat can be chase view with the ability to pan and tilt etc would have made it better. The game is really buggy and it feels unfinished or unpolished so to speak, but I would have to say vehicle control, camera views and gameplay really needs some work.",
            "review_score": "-1"
        },
        {
            "review_text": "I would like to recommend this game - equipment simulators are often sincere, dedicated to their simple premise, and deliver on a lowball promise to replicate the experience of using these machines. It's not flashy, or dramatic, but much like model railways, there's an enduring interest in simulation.  Certainly, all the stuff you expect is in this game - a variety of machines, even a first person view as you run around your machine, check it out, and jump in your vehicle, steer, drive, operate the bucket with simulated levers. Doing jobs earns you money, which you spend to buy better equipment, so it has a nice progression/career system.  In the case of this game, however - the technical settings let everything down. No support for 4K means the game is now effectively dead for all machines of the future. I'll be happy to review my review if they ever fix it, but until then, gaming moves on, and the developers have chosen, through inaction, to let Construction Machines 2014 stay behind.",
            "review_score": "-1"
        },
        {
            "review_text": "It stinks 0/10 would not not recoment terrible interface do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "In short, a polished turd. The control system is horrible, with touchy WASD control and no option to use controller input. Combine that with an awful camera system which doesn't even let you pan or zoom - pretty frustrating as the camera is always in an inconvenient location. Even Demolition Company allows these basic things.  Despite its appearance, this game does no better job handling physics than other similar titles. Bulldozers bounce around the map and drive like go karts.  I think the developers spent more time on the glossy UI than they did on the core of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Would not work on windows7 64",
            "review_score": "-1"
        },
        {
            "review_text": "Error/Loading/Burn my PC/Wasto of money Simulator",
            "review_score": "-1"
        },
        {
            "review_text": "Lags very bad ... Trying to view where to go is so hard to do I just get mad at it because can not do what the career mode want me to do because game not allowing me to or I can not see it, ",
            "review_score": "-1"
        },
        {
            "review_text": "Yea What Wally_Town Said",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't play this game so much cause i don't need.  This is my first look :   Hardest controls -2 Can't(I mean really hard)grab or lift something,which is heart of game. -5 Not bad graphics +2 I found an avatar looks similar to me +1 :D  If you wanna become estranged to construction machines then this is ur game...  Ups i forgot the map ... Don't even look at it.",
            "review_score": "-1"
        },
        {
            "review_text": "Yea What Wally_Town Said",
            "review_score": "-1"
        }
    ]
}