{
    "app_id": 252010,
    "name": "Oniken: Unstoppable Edition",
    "release_date": "2014-02-05",
    "developer": [
        "JoyMasher"
    ],
    "publisher": [
        "JoyMasher"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Retro",
        "Platformer",
        "Action"
    ],
    "achievements": 32,
    "positive_ratings": 589,
    "negative_ratings": 123,
    "price": 3.99,
    "description": "When a global war nearly decimated humankind, an evil military organization called Oniken takes advantage of the situation to dominate and oppress the few remaining survivors. Even though any resistance to this organization seemed hopeless, a small rebel movement organizes strikes against Oniken.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252010/header.jpg?t=1479914662",
    "minimum_requirements": "Минимальные: ОС: Windows XP Процессор: 1.0 GHz Processor Оперативная память: 512 MB ОЗУ Видеокарта: 32MB VRAM Integrated Graphics Card DirectX: Версии 9.0 Место на диске: 100 MB",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7 Процессор: Dual Core Processor Оперативная память: 1 GB ОЗУ Видеокарта: 64MB VRAM Dedicated Graphics Card DirectX: Версии 9.0c Место на диске: 100 MB",
    "reviews": [
        {
            "review_text": "Oniken is a 2D run and sword action game. The controls are simple, attack, jump, duck, berserk and up + attack to throw a grenade. It is all so nice. The attack distance is good and can be boosted with power ups you find. You can hang from things. This game really goes the extra mile to make you think you're playing something for the original Nintendo, while most other games going for the nostalgia feel don't have actual 8 bit graphics and music. I feel such a buzz playing this game unlike other 'retro-ish' games that miss the mark with modernized graphics and sound.  The cut scenes are nice to look at, but the real fun of the game is the game play and the enemy variety. You'll see a lot of enemies and tackle them in different ways. For modern gamers the game might be seen as difficult due to the fact if you die, you restart the section of the level. Die at a boss, restart that entire section. You'll get better! Lose all of your lives and you'll have to restart the level. Each level mainly consists of 3 sections, each with a mini boss of some sort. Since the save file allows you to just jump to a level, if I die on the first section of a level, I just go back to the menu and warp to the level I was on. Kinda makes lives on the first section of each level pointless. You have a hefty health bar like Mega Man, so the game is pretty forgiving. Pits are of course instant death.  The level variety is a mixed bag. Some levels are just bluntly walk to the right, others make you scale to the top and still others put you in a jet ski with a scrolling screen. There are a few sections that feel open where you're free to make your own path, which feels good. Some levels are needlessly difficult with a lot of action happening, but if your a veteran of old Nintendo games, you should be used to it. If not, then make an angry video about it.  There isn't that much replayability for the game, there are a few hidden items, one per level, and there are achievements for beating a level without dying. The game saves your high score for each level, but really, once you've beaten the game, there's no reason to come back to it.  Again, this is an awesome game well worth $10, it is so awesome that I'd buy any other game this studio comes out with. They hit the nail on the head. If you aren't into old school Nintendo games, avoid it.",
            "review_score": "1"
        },
        {
            "review_text": "Oniken is one amazing game from the times where games taught us about persistence and strength. It's not hard just to ♥♥♥♥ you off, it's hard but very rationally logical. It challenges you and progressively teaches you to master the gameplay. You finish the game feeling awesome for actually accomplishing something, which is a feeling many players hadn't had in 20 years.",
            "review_score": "1"
        },
        {
            "review_text": "No naive sudden death traps (for the most part), no floaty controls, only legit challenge for reactions and wits right here. True NES-style, doesn't feel like cheap flash copy/paste. Bad guys are vile, good guys are badass, story doesn't take itself too seriously but remains loyal to 80's cheesy action flick/videogame style. Music also works for what it is. What else do you need? Worth every cent if you are up to some side scrolling action.",
            "review_score": "1"
        },
        {
            "review_text": "This game is kicking my ♥♥♥ and I love it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is uncut dope. Awesome graphics, great gameplay, and good replayability if you are into achivements or speedruns. My best time for Oniken is 23:19, I reccomend anyone looking for a hardcore platformer to pick this game up.",
            "review_score": "1"
        },
        {
            "review_text": "To those of us that remember the true difficulty of the age of the NES, this game will seem like stepping back to when we were kids staring in front of the huge TVs with our controller in hand, getting upset at the slightest misstep killing us. This game stays true to its form and its homage. A warning though, not for the faint of heart, as most might lose something (be it keyboard or controller).",
            "review_score": "1"
        },
        {
            "review_text": "Still trying to get to the last stage of Mission 4. I've ragequit three times so far, but I know that once I beat this fire-breathing snake out of a tree by helplessly swinging my sword from a snapping tree branch, I will feel like a god - if only just for one beautiful moment.  And then I'll probably get a laser to the face and have to do it all over again.  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "The absolute best 'retro' style game on Steam. I have a lot more than the apparent 3 hours put into it, but on Offline Mode. This game genuinely looks and sounds like an 8-bit game and plays like a NES game. On first play through of each level, it feels difficult but never frustrating. Once you've died a couple of times though, you should be able to play back to that point without dying once; it's incredibly fair. Due to being able to choose your level once you've reached it, the difficulty on normal mode isn't quite NES levels but it makes up for this by having 3 or 4 sections to each level that could be considered individual levels (often with a boss in each section). Controls, particularly with a gamepad (though keyboard is fine for this game), are great altogether. Some levels feel like Ninja Gaiden or Vice: Project Doom, while there are segments that feel more like Shinobi III (the jet ski sections specifically) but with 8-bit graphics. Really an incredible job done on it. Recommended at any price.",
            "review_score": "1"
        },
        {
            "review_text": "You need to help 'os brother indies'.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I finally beat this game. This is a very VERY well done retro, 8-bit style platformer. The best way for me to describe it is a hybrid of both the original strider with the NES version of Ninja Gaiden. It is very hard, but not cheep, and the controls are precise and flawless. There are six levels with three sub-stages per level, and honestly, I completed the first three levels without any real trouble. It's the later three levels where the challenge really shows. The secret to beating them is, (like most of the platformers of the day) lots of repetition and memorization of patterns. Even the hardest stage, (which in my opinion was stage five) will become easier after enough play, so don't get frustrated and discouraged. Just play, die, and repeat and you will see that the stages gradually become easier and easier until you can beat them. As for the story: it is very CORNY, but in a charming and (I think) intentional way. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is Ninja Gaiden meets Castlevania in a Contra-esque setting. Presentation is spot-on. Appropriately difficult, hardcore nostalgic fun. A must for the NES generation.",
            "review_score": "1"
        },
        {
            "review_text": "Finally got to play this today... and its decent. Definitely has the feeling of a NES game, but a good one. I don't know why people are saying it has the 'trappings' of one, it seems fairly well designed - though I would've done a few things differently in the way of level design. Despite this, the mechanics are fairly solid and so far nothing feels unfair - its def not a game to run through blindly though. Caution is your friend, and if you're not used to that, or don't enjoy that element - its not that punishing, but I can see why people wouldn't like it. Visuals are great, I love seeing how much can be achieved with so little, and whilst it does commit to the NES style, it is just a style and doesn't follow the restrictions too closely - which can go either way for you. Overall nothing too negative to say about it. Enjoy it, ignore the unreasonable hate.",
            "review_score": "1"
        },
        {
            "review_text": "This game is way too good for it's price. It's a crime I didn't stumble across it earlier.",
            "review_score": "1"
        },
        {
            "review_text": "I just bought it, and I must say it's the most fun I've had a while, this year (I know it's only been a month since 2014). The game is difficult, like your good old NES game, but keeps it fair.",
            "review_score": "1"
        },
        {
            "review_text": "I wish all these NES-style games supported easy mode. Recommended only if you're okay with that level of difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "You basically play Kenshiro with a sword and it's more or less M.D. Geist the video game. Great if you don't mind pixel graphics and simple controls.",
            "review_score": "1"
        },
        {
            "review_text": "So much fun with this hybrid of Ninja Gaiden, Fist of the North Star and Terminator mix!",
            "review_score": "1"
        },
        {
            "review_text": "A fun and tightly controlled combat system with a Fist of the North Star meets Rambo story creates a delightful playthrough. Not terribly difficult but it always keeps you on your toes. This would have been a classic in its time and it goes to show you that quality games don´t need AAA graphics.  It´s worth the price!",
            "review_score": "1"
        },
        {
            "review_text": "A better NES game than most NES games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is, simply put, a masterpiece that will transport you back to the glorious era of 8-bit platformers. From the story to the soundtrack, obviously not forgetting the awesome gameplay; everything is just perfect. A must-play for any true gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging old school inspired platformer along the lines of classic Ninja Gaiden .Very challenging and built around pattern memorization. It is on the short side but there is decent variety within the levels and boss fights.",
            "review_score": "1"
        },
        {
            "review_text": "Although there were a few rage quits, I've finally managed to finish this game and I don't regret buying it (especially because I've got a fine price discount). Hmm I guess it's because ever since I was a kid I always enjoyed to suffer a good beating by games like Megaman and Ninja Gaiden. Yes, it's quite challenging and it might take a while until you figure out some patterns and avoiding damage to keep your sword power available for the berserk mode. The graphics are nice and the soundtrack is quite awesome too, besides of that there's none of that password crap from the NES. I'd only like to make a suggestion to improve the gameplay: Just like Silver Surfer, you've gotta keep on pressing the button to shoot while you're riding that vehicle, so it wouldn't hurt if it'd have an auto-fire feature (tendinitis aware). Overall, I think it's an interesting platformer and I recommend to the fans of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Oniken is a great action platformer that faithfully recreates those old NES games we all know and love. There are many indie games that have a retro aesthetic, but Oniken is one of the few that actually feels 8-Bit, from the color pallette to the music and pixellated cutscenes.  Beware if you're easily frustrated, Oniken is certainly not an easy game. While it's not as punishing and unfair as many NES era games, (I'm looking at you Ninja Gaiden) there is still plenty of old-school difficulty. You'll definitely have to play stages a few times and memorize enemy placement and attack patterns. While the mechanics are fairly simplistic, they are solid and responsive; and the game never overstays its welcome. All in all Oniken is a great game and I would highly reccomend it to fans of retro games and 2D platformers in general.",
            "review_score": "1"
        },
        {
            "review_text": "A better NES game than most NES games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a love letter to ninja gaiden shadow for the gameboy!",
            "review_score": "1"
        },
        {
            "review_text": "It looks, sounds and plays just like a classic NES game. A basic, short and challenging memorization based action platformer without enemies constantly running into your screen like in Contra or Ninja Gaiden. Achievements, a boss rush and hardcore mode add some replay value and challenge to an already difficult game. Recommended for the NEStalgic gamer.",
            "review_score": "1"
        },
        {
            "review_text": "I get that they're trying to recreate a difficult NES classic, but there's a point where this difficulty just becomes mind-numbing repetition and frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "There is no reason to make you replay a whole stage, just to try again at a boss. Just because this game is inspired by NES games, doesn't mean you need to bring their ♥♥♥♥ features along as well.",
            "review_score": "-1"
        },
        {
            "review_text": "Yes, it does feel very authentic. Like an authentic mediocre NES game. Not bad, but also not particularly good. Controls are precise, in a minimally programmed sort of way. Innate controller support didn't work but nothing that Joy2Key can't fix. Enemy/boss patterns lack variety, so difficultly wanes quickly after a try or two. Cutscenes and pixel art are the strongest points in the game.  Bottom line: not worth full price (hence the 'no' recommendation). I got it in a humble bundle. Wouldn't pay more than a buck or two for it alone, even as a retro-lover.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, Oniken certainly feels like an 8-bit era game... but not necessarily in a good way.  The game is full of cheap deaths, enemies tend to pop out of nowhere, levels rely on memorization through repetition, powerup content is luck-based, and the checkpoints are scarce and unforgiving. Died during a boss fight? Well, enjoy replaying a substantial portion of the level again until you're sick of it.  I get it that most of this is done on purpose. And some people will be fine with it. Some will call it a challenge and a throwback to the past. The thing is, it's not the 80s anymore and we're not forced to play this one single random game we've managed to get ourselves this month, which lasting appeal relies solely on the fact that it's unfairly difficult.  As a throwback to the past it's certainly good, in a bad way. If old-school action-platforming repetition and memorization is your thing then I guess you'll have fun with it. I surely didn't.",
            "review_score": "-1"
        },
        {
            "review_text": "not my kind of game",
            "review_score": "-1"
        },
        {
            "review_text": "Might be good game, i just dont know. Cause the ♥♥♥♥ doesnt work.  It says it works on linux but how is it? It just doesnt. Well i need to wait that i buy new computer and then get windows.  Edit: It works on windows, but still it doesnt work on debian. So until it works on debian this review says dont buy the game. If the steam page says it works then it should work, but it doesnt work for ♥♥♥♥s sake.",
            "review_score": "-1"
        }
    ]
}