{
    "app_id": 252310,
    "name": "Syder Arcade",
    "release_date": "2013-10-24",
    "developer": [
        "Studio Evil"
    ],
    "publisher": [
        "Studio Evil"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Shoot 'Em Up",
        "Indie",
        "Action"
    ],
    "achievements": 40,
    "positive_ratings": 533,
    "negative_ratings": 92,
    "price": 6.99,
    "description": "Killing zombies never gets old, but sometimes you just need a break. Get back to some serious old-school gaming with Syder Arcade! Syder Arcade is a love letter to Amiga games of the ‘90s, no coins, no upgrade grinding, just your tenacity and a motherload of alien invaders.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252310/header.jpg?t=1479999450",
    "minimum_requirements": "OS: Windows XP Service Pack 3 Processor: Pentium D, 3GHz or equivalent Memory: 2 GB RAM Graphics: ATI or NVidia card w/ 512 MB RAM (Not recommended for Intel integrated graphics) DirectX: Version 9.0c Storage: 1 GB available space Sound Card: Any sound card",
    "recommended_requirements": "OS: Windows 7 Processor: Core 2 Duo 2GHz or equivalent Memory: 3 GB RAM Graphics: ATI or NVidia card w/ 1024 MB RAM (Not recommended for Intel integrated graphics) DirectX: Version 10 Storage: 1 GB available space Sound Card: Any sound card",
    "reviews": [
        {
            "review_text": "Retro side (and sometimes top down) scroller at it's best! It's fast, lots of enemies, bigger intelligent enemies, 3D backgrounds, Amiga like music, computer voice,  dozens of graphic modes  (e.g. C64 or Amiga HAM mode) from earliest homecomputer to current modern graphics.  Great! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a throwback to all the R-Type wannabe games from the 80's and 90's. The music had that perfect 'Amiga 500' feel to it, and the game's style in general made me think of some of the old shooters from that era as well.  You get 4 different types of ships to choose from with different movement, fire, armor, and special weapon capabilities. Each one gives the levels its own particular flavor of challenge to it. Instead of being a straight up 'Fly to the right infinitely while destroying bad guys who attack in predictable patterns' style of shooter, they offer you the chance to flip between left and right so you can turn around and shoot those ♥♥♥ holes that come at you from behind.   Much like R-Type there's a multitude of in-game powerups you can pick up which you find after destroying enemies or waves of enemies, and there's also a plain looking white box style powerup that apparently adds to your special weapon charge. (though I'm not sure how that works exactly because it seemed like I was able to fire my special pretty often).  Also if that's not enough nostalgia for you, there's a variety of in-game graphic filters so you can pretend you're playing it on a 4 bit greyscale screen, 8 bit greyscale, Vic-20, C-64, ZX Spectrum, Amiga HAM (Hold And Modify mode), EGA, CGA, and modern graphics (I may have left something out though).  It's challenging without being too frustrating, it's got just enough bullet hell without forcing you to become the zen master at dodging everything, and the graphics and music complete the experience.",
            "review_score": "1"
        },
        {
            "review_text": "  HARD   Nice retro side scroller. Nothing more to say.      Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphics, nice music, nice shooter game. Its a cross between Raiden X and Asteroids. It's very difficult and quite addicting. The only thing that would make this game even better would be a coop option. I also like the fact that you don't have to grind all day for upgrades like most games.",
            "review_score": "1"
        },
        {
            "review_text": "Really does feel like an old sega genesis/arcade machine game. The colors, the sounds, the scoring system, and the fast death gameplay that makes you want to keep popping in another quarter. If that doesn't sweeten the deal, it has commodore 64, Apple 2, 8-bit, and many other color renders to bring you back to the good old days.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. It's my goto title when I need a schmup fix. I'm not very good at shooters, but this one lets me play at a level that I can actually enjoy. The gameplay feels good with a controller, it's kind of a slow paced 'bullet heck' title with a strong nod to Defender. The music and graphics are great, although the foreground and background elements sometimes blend together, so it can be hard to see what's going on.",
            "review_score": "1"
        },
        {
            "review_text": "Pure arcade. And short one. It has achievements though, so there is some kind of replayability other than 4 different ships to play with. Graphics are nice, soundtrack too. I don't use 'like-in-the-old-times' filters, so I cannot fully appreciate them.  This game is best played with some kind of gamepad - I use PS3 controller, almost unplayable on keyboard when compared to gamepad.  I can recommend this game, but probably not for full price.  And finally, guess what - it runs on Linux ;-) Although I had to use LC_ALL=C %command% as described by developers here in Steam discussion. ",
            "review_score": "1"
        },
        {
            "review_text": "What can i say about Syder Arcade. Its a side scrolling schoot em up that you will be happy to have in your games library, side scrolling shoot em ups can be terribly badly done, when done wrong.  However, when done Right !  Well this game doesnt do it wrong, its fast paced and fun plus you can flip your ship and go in the other direction to get the rest of the baddies, plus it does bring back some nostalgic feelings and fond memories of back in the arcadey days. As for would i recommend this game, Definately, id recommend this game to anybody who is intrested in arcadey side scrolling shoot em ups 'schmups' as believe me you wont go wrong with this game Overall Score : 4.5/5 Thats my review and hope it helped you to make up your mind.. #####!!!!!GO BUY IT NOW!!!!!#####",
            "review_score": "1"
        },
        {
            "review_text": "If you love arcade space shooter game. You'll want to try this. If you are like me, this game does not have long game life.  Good time burner if you don't want to think so much.",
            "review_score": "1"
        },
        {
            "review_text": "Basically, it's a bullet hell 2-dimensional-2-way-opposite-zombie-free-space-shooter.  GET THIS GAME. Why? Because this game is nostalgic for gameplay, powerups, shooting, 4 different space ships(3 to be exact and a alien bug-fly-insect.), music and the over all feeling dying in a massive bullet hell you could not survive. Well the game may get repative some point, but you gotta just respect the game because it has that arcade feel and AMAZING graffics and effect for an indie arcade-space-shooter-bullethell-zombie-free-game.  The community threads about in-game bugs is a thing so expect some bugs here and there.  Overall: Den oudda den. 5/5.",
            "review_score": "1"
        },
        {
            "review_text": "One of the better shmups I've played for PC. This one isn't nearly as polished and intricate as Jamestown, but it's solid. I enjoyed the campaign on the default difficulty, then tried playing on 'Pure', which at first seemed ridiculously hard...but after you get the hang of it, it's winnable (and quite fun). The default ship is a good one, and your super weapon gives you a temporary shield, so you can panic bomb.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge fan of Shoot'em ups and i'm also in love with this game! It's one of these game that i play when i'm depressed or something, that is just always cheering me up even while playing on hardest difficulty.  Too bad there are no explosions that cause epileptical attacks, just like the good old times!  Oh... and the bosses are a bit boring. They should be harder or more intense, especially the Alien bosses. And the first wormhole should have laser cannons that cannot be destroyed, so he's shooting at you all the time from all sides, not just with these squares flying out of the wormhole.",
            "review_score": "1"
        },
        {
            "review_text": "Got this in a steam daily sale (£1.50) and love this shooter nice old school feel and the DEVs are from a commodore Amiga background... (Same as me hehehe) witch this game reminds me in game play , A very good challange.",
            "review_score": "1"
        },
        {
            "review_text": "Controls: 5/5 (two hands one keyboard works perfectly fine) Graphics: 4/5 (a bit to colorful for my personal taste, but still very nice) Story: irrelevant but it’s nice to haven one!  Surprisingly a very good game. Got it for 75% off, but it is, as far as I got till now, a very enjoyable experience. I’m not into SHMUPS that much but here form controlling to story, everything is working and enjoyable.   If you are into SHMUPS, buy this, if your are unfamiliar with this genre, this might be a good first try. If you get it reduced, it’s a must have! ",
            "review_score": "1"
        },
        {
            "review_text": "Syder Arcade....   Oh man... where should I start?  This game is a space shooter (duh) full of nostalgia flavor. You have a pretty decent selection of ships and campaigns. Every ship has its flaws and benefits. Another characteristic of this game is that you can turn your ship and attack enemies backwards. Not every mission is 'k', kill enemies, go forward, kill boss, win', sometimes you have to defend larger ships from enemies spawning everywhere and their bullet hell, adding more variety to the gameplay. BTW, it has catchy OST and awesome graphics. If you had any kind of computer back in 80-90 like amiga, C64 or IBM pc there's an option that let you change the visuals like if you were playing in one of these computers (it was interesting to play a game in 3D in a CGA pallette). And last but not least, you have global ranking.  Do you like R-type or Gradius, love dodging 3149134790 bullets like in Touhou/Ikaruga?, then you should give this game a try!",
            "review_score": "1"
        },
        {
            "review_text": "What a cool shmup, loved the level where you are in the heat of the battle, defending your battleships. Very nice graphics. Also has some retro modes: C64, ZX Spectrum, Amiga graphics, and much more.  This shmup has a twist, it's like the old Defender, you can flip your ship and go to the opposite side.",
            "review_score": "1"
        },
        {
            "review_text": "Oldschool shoot´em up, fantastic music and replayable (Survival mode included) ... waiting for Ikaruga :P",
            "review_score": "1"
        },
        {
            "review_text": "Nice retrotastic ShMUp break fromthe grind of FPS/RPG/platform crap they ply these days.  Not sure what ZX Spectrum these people ever played, but that was NOT the graphics of the 48K/48K+/128K/+2/+3 or even the Sam Coupé.  Still worth the price, though.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  loved this game when i was a kid the music and everything explodeing :D so i brought it thinking how cheap it was and man am i happy i spend the money &lt;3  big thank you for steam having it.  if you love arcade when you was a kid you will love this you can even set the graphics to look like your old consoles back in the 80's and 90's all the way to really good special effects.  BUY!!!!",
            "review_score": "1"
        },
        {
            "review_text": "surprisingly good side-scrolling space shooter. actually has element free roaming to it as you switch your ship facing L / R to face enemies from both sides.  can play in EGA colour mode too 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good shmup, very polished, solid feel to it, good music.",
            "review_score": "1"
        },
        {
            "review_text": "If I had this game 30 years ago, I would have saved so many quarters...",
            "review_score": "1"
        },
        {
            "review_text": "Great game, much fun to be had!",
            "review_score": "1"
        },
        {
            "review_text": "After a few minutes with this, I can honestly say this would be a great game if they didn't try to force you to go in a certain direction. Let me fly in the direction I want - don't flip me around when you feel like it, that's my choice. Fix this and it would be one of the best sidescrollers I've played - don't ; and I'll never play this again.",
            "review_score": "-1"
        },
        {
            "review_text": "I Love this Game! This aint your Daddy's Defender! Great graphics, Great tunes! Old school feel, with the new school look.  Just pure Awesomeness!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Shmup I've played on Steam. It's what I wanted out of Sine Mora. It is most certainly an oldschool amiga style shoot-em-up but it has a such a polished system that it plays very modern. The graphics are beautiful, the soundtrack is great, enemies are fun to shoot. Your ship works like a Viper in Battlestar Galactica in that you can flip directions on a dime meaning that in many levels you will be going both left-to-right and right-to-left. This basically doubles the size of each map and forces you to focus on stuff coming from all directions not just in front of you.  If you enjoy shmups or bullet hell games I highly recommend this game. In addition to being well made the development team is very active within the Steam forums so any problems you have will be quickly addressed.  Buy it today, you wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Bought solely as a shoot-em-up to use with a controller. Doesn't detect controller buttons properly.",
            "review_score": "-1"
        },
        {
            "review_text": "Game part is not bad. but briefing part is extremely annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "Simply put, becomes repetitive super quick.",
            "review_score": "-1"
        },
        {
            "review_text": "Defender as a euroshmup. All the enemies take way too long to kill, the movement is wierdly sluggish, and the second level is an escort mission. Oh, and up/down on the d-pad are inverted for some insane reason. Avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "i like this alot for the money i spend (2,49 euro) i would not buy it for more coz thats whats it worth no more  some startup problem first time it did not want to remember my settings but after a few restarts it did and now it works fine  i suggest a xbox controller i played with keyboard (directions and switch side i go) and weapons on mouse works but a pad is preferred ofc  i find its gameplay addictive to bad its a very short game (thats why 2,49) plays like an oldschool shump   good to kill some time you have different difficulties and some cool powerups its no r-type but its fun grab it on a sale  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful side-scrolling shooter, one of the best i've ever played, with a gorgeous graphic, funny enemies and old-school difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and pretty bullet hell shooter, the introduction of the flip mechanic (with enemies coming from oth sides of the screen), keeps the game fresh and sets itself apart.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun! I just wish there were more content. Also there are some typos on some of the intro screens, like 'trough' instead of 'through'",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun. Lots of retro gaming action. Semi-challenging learning curve. You will die a lot.  Regardless, it didn't really need to be 3Dl; it would have been fine just being a 2D sidescroller.  I will come back to this game and play it hardcore once I finish earning card drops from the Steam Summer Sale.",
            "review_score": "1"
        },
        {
            "review_text": "Easy and fun to play. If you like old school shoot'em-up games, I recommend this modernized version.",
            "review_score": "1"
        },
        {
            "review_text": "I was looking for an old school space sidescroller shooter- and that is exactly what this is. Decent music, creative level design. If you like to play games where the screen is filled with bullets and you are just dodging and holding down the trigger, this is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece. Classic arcade shoot'em up technically up-to-date. Hybrid gameplay: R-Type, Ikaruga bullet shooter, Defender sidescrolling etc... Smooth cool graphic and GREAT GAMEPLAY!",
            "review_score": "1"
        }
    ]
}