{
    "app_id": 252330,
    "name": "Slender: The Arrival",
    "release_date": "2013-10-28",
    "developer": [
        "Blue Isle Studios"
    ],
    "publisher": [
        "Blue Isle Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "First-Person",
        "Survival Horror"
    ],
    "achievements": 21,
    "positive_ratings": 4468,
    "negative_ratings": 578,
    "price": 6.99,
    "description": "You're on your own. No one to come for you. No one to help you. No one to hear you scream. Slender: The Arrival is the official videogame adaption of Slender Man, developed in collaboration with Eric &quot;Victor Surge&quot; Knudson, creator of the paranormal phenomenon that has been terrifying the curious-minded around the world since...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252330/header.jpg?t=1548194589",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 Processor: Dual core CPU @2GHz (Pentium D or better) Memory: 1 GB RAM Graphics: Intel HD 4000, GeForce 8800, ATI 1950 or better DirectX: Version 9.0c Storage: 2 GB available space Sound Card: 100% DirectX 9.0c compatible audio device",
    "recommended_requirements": "OS: Windows 7 Processor: Quad Core Intel or AMD Memory: 3 GB RAM Graphics: GeForce 260 1GB or AMD HD4850 1GB DirectX: Version 9.0c Storage: 2 GB available space Sound Card: 100% DirectX 9.0c compatible audio device",
    "reviews": [
        {
            "review_text": "I recommend this game for kids. Miraculously, it reflects the concept of friendship. Through family history of fire and mountain. Warns against strangers! Beautiful landscapes, houses and beach. Charlie is a really good man, ALWAYS everywhere and is protected by the darkness. The music is pleasant and relaxing. Although the dramatic end, my eyes were teary.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ so much bricks I could rebuild the great wall of China.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "REALLY scary. Although it's pretty easy to beat, you will still have to change your pants a few times. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Slender The Arrival is a worthy successor to Slender The Eight Pages. More beautiful, immersive, still scary, the title gives chills and cold sweats the most courageous of you. Unfortunately, the player becomes accustomed too quickly their graphics and sound effects. In addition, the life duration is low and lack of variety in the objectives prevent him to rank among the essential of survival horror. Absolute fans of the genre can still be tempted.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it, installed it, started it, played it, got jumpscared, quit the game, uninstalled it, got refunded. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "God dammit Slenderman. You're hard to love, but you're harder to hate.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game! Scares the ♥♥♥♥ outta me every time! Dont think it wont be scary becuse its rated T. Would recomned to any fan of horror.",
            "review_score": "1"
        },
        {
            "review_text": "Before playing this game, I've heard and knew a bit about Slender Man and other related stuff, but not much. So that said, I was curious to give this game a go, especially since I love horror games and giving myself a good scare once in awhile. Let's just say that this game did not disappoint. Although it was a bit of a short game as I clocked in around 2.5 hours, completing it in two sessions, I've got no regrets about purchasing or playing the game. It was a good experience I enjoyed, which is what matters. And if I must say so, I was quite a fan of the soundtrack for this game, which I also purchased as well. I find it goes well with the game itself and definitely adds in that scare factor. It can also be creepy as well. I was impressed with the graphics. And controller support was a nice bonus too, as I was initially unsure if this game had it or not. And finally, I think this game has a pretty good story as well, which is an important thing I look for when I play video games. This game definitely has my curiosity of Slender Man intrigued now as I'm pretty sure I'm going to be looking more into this Slender Man stuff more. All in all, I enjoyed this game and I'd recommend it, especially if you want a good scare. And keeping in mind, I played the entire game in a pitch dark room with headphones.",
            "review_score": "1"
        },
        {
            "review_text": "you've had the courage to buy it but the question is: Will you have the courage to complete it without screaming?.  from the creators of the eight pages .. again the March 27, 2013 a game on October 28 now available in steam, the famous and highly anticipated sequel to the first installment: slender: the arrival.",
            "review_score": "1"
        },
        {
            "review_text": "I play this game whenever I get lonely and it always cheers me up.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "+buy the game on sale +install the game +play the game and saw Slender uphill (He won't hurt me :P) +play 8pages and scream like a baby +uninstall the game and promise to never play a horror game   'bonus gameplay' launch the game and don't press any botton just stay there then collect tradable cards :D",
            "review_score": "1"
        },
        {
            "review_text": "Nice game overall worth it when its on sale !",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good but so scary!!!! But I hate the generater bit ITS SO HARD",
            "review_score": "1"
        },
        {
            "review_text": "*Note: this review was written before the 2.0 update and many issues have now been fixed*  This is one of those odd games to review. You see initially i was having an enjoyable experience and wondering why this game got lower scores but now that i look back i see some of the outstanding issues. At the beginning of the game I was pretty freaked out, you know, taking my time looking around every dark corner. This was good, the opening prologue level was probably my favourite part of the experience. But after the end of this level that's when things start to fall down. Slowly as you progress through each level the fear factor actually decreases. With brighter lit enviroments as you progress the game it took away some of the worry that i had since i no longer needed to worry about what was in the dark.(BTW i love darkness in games but when you make it so dark it's impossible to navigate i have an issue) Not only does the scare factor drop with the lighting system but when i first watched the Chaser from a distance i was more laughing than scared since the animation was jerky and the AI seemed to be in a state of pants-on-head ♥♥♥♥♥♥♥♥. This strikes me as odd though that an enemy that you will spend a lot of time looking at has crap animation while the Slenderman(the creature you'll want to spend the least time looking at) has proper and well designed animations. The other creature, Charlie, seemed to have near-non existant animations and when he was sitting still it looked more like a something from Doom where it's a 2D images worked into a 3D enviroment. The sound design feels well done with creature and enviroment noises adding to your already tense state. But i stopped for a minute when I heard the sounds from Slender: The Eight Pages. I guess it's supposed to be a callout to the last game but this is a new game and i'd like to hear improved versions of these sounds. Speaking of the last game, I did enjoy the Eight Pages remake level, which did a good job of calling out to the last game while still keeping a sense of originality. Now here's the big one besides the ending, the glitches. Now I only had one real gamebreaking bug but in horror games even if a bug isn't game breaking it can still absolutely ruin the immersion for a player. For example, the first time I played the Eight Pages level I had 7 pages and was freaking out ,worrying about the Slenderman but then I saw him and was baffled when he was about to kill me and then just left. I didn't see him like a ♥♥♥♥♥♥ and walked right into him and ♥♥♥♥ all happened. And I know this isn't supposed to happen since I tested the level other times. Other Slendy bugs were dying from him even though he was nowhere to be seen, him teleporting inside other objects and a weird one where he hovered above the ground. My gamebreaking bug was when I was caught by the Chaser and waited to die but the camera just sat there fixated on the Chaser's face like it had grabbed me. After a few minutes the Chaser started running away with the camera following it's face from the front. This continued for about 7 minutes before i gave up and had to restart the level. We now come to the ending. Now I feel like I could spoil the ending here and not ruin it for you at all but I won't for the sake of fanboys everywhere. What you should know is the ending is a major cliffhanger with nothing being resolved. It just kinda ends. Maybe I could have overlooked this but with the game being obnoxiously short it makes it un-compensatable. It feels like after the ending was actually once a level just a leading to the next level and they were just like, '♥♥♥♥ it we can sell it like this' and then just folded in.  So all in all, PROS: -Nicely designed enviroments -Atmospheric SFX and music -Very well directed opening -Small enclosed enviroments(buildings, etc...) -Scary and well designed creatures -Interesting secret level -Some genuinly scary moments  CONS: -Embarrasingly short -Buggy creature animation -Poor AI -Massively well lit sections -Repetitive objectives -Too much audio taken from S:EP -Many glitches and bugs -The door opening mechanics -Extremely aggravating to get the secret level -Unsatisfying ending  I wish there was a maybe button on Steam because that would suit this perfectly since there are good sequences but it is overall lacking so I'm afraid I can't recommend this unless it's on a decent sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I got stalked by a man in suit and then a disfigured midget joined him.  2spooky4me.  I quit.  11/10 would quit again.",
            "review_score": "1"
        },
        {
            "review_text": "Great remake of an old game. Even more terrifying now because he has little helpers to try and find and slaughter you also....",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i have played, scary brah.",
            "review_score": "1"
        },
        {
            "review_text": "Comparing it to how Slender was originally, this is amazing. Same concept with a lot more spice in it. However, if you're comparing it to today's standards of horror then you won't enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "this game scared the ♥♥♥♥ out of me, by far the best horror game out there.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun for solo play or with friends. Being an Oculus Rift owner, I was hoping that the game would be better suited to the Rift, but sadly there are a few annoying issues. The biggest issue with the Rift support is the massive world scale. A lot of objects feel way too big, such as the vehicles. The second issue is how sparkly everything looks, especially in daytime. I think this is due to some film grain effect.",
            "review_score": "1"
        },
        {
            "review_text": "Not certain if it is worth the full $10, as it a fairly short game, but it is certainly worth playing! It has some truly great atmospheric tension, mixed with some perfectly executed jump scares. A short, but fantastic experience that I would love to play again sometime.",
            "review_score": "1"
        },
        {
            "review_text": "Much Anxiety, So Stress, scare, wow",
            "review_score": "1"
        },
        {
            "review_text": "This game Is VERY VERY scary at first it wasnt but it gets better trust me and even to its scary its fun anyone who gets games like this buy it!",
            "review_score": "1"
        },
        {
            "review_text": "fun and scary!",
            "review_score": "1"
        },
        {
            "review_text": "Do like going on hikes? Do you like night hikes? How about screaming? How about screaming a lot and kicking your feet and flailing around? If so, Mr. Skinny, this is your game!",
            "review_score": "1"
        },
        {
            "review_text": "One Word:  Fantastic  All I'm going to say.",
            "review_score": "1"
        },
        {
            "review_text": "Ok... Slender, you better go EASY on me for praising your game next time I play it! Slender: The Arrival is about the best indie-horror game I've seen out there. I mean, seriously, a full sequal to Slender: The Eight Pages, a storyline, easter eggs (in-game secrets and literally [don't ask!]), AND hidden collectables that form a big mystery?! All I know is: I'm going to be playing this long into the night... and, at the same time, be screaming like a little sissy girl.",
            "review_score": "1"
        },
        {
            "review_text": "It is very well made, and some of the scares and the atmosphere creeped me out quite horribly. I'd reccomend this for the horror enthusists out there!",
            "review_score": "1"
        },
        {
            "review_text": "Very short game but fairly entertaining and horrifying XD Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid game. Short but effective. The tension builds at a steady pace right up until the end. I loved how time would pass as you progressed, going from day time to night. Was a nice touch, as was the audio. Graphics are slightly dated, but still gorgeous.   Of course it has its flaws. Maybe its intentional, but a save function would have been nice. The mine thing felt slightly out of place and a tiny bit forced (to me anyway). I ran into a couple bugs I found related to clicking letters and pausing while they were still open on the screen. Unpausing would cause the screen to go black and stay black. Happened most often at the very end of the prologue going into the next chapter. Not a huge deal, just annoying.  Overall, its a pretty awesome game and I hope to see more from the devs.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game and would recommand it to other people.  Rules for the game. Rule 1: Never turn around.  Rule 2: Hear a sound dont go to check it out.  Rule 3: Dont stare at slender. Rule 4: Never let your guards down just because its quite does'nt mean something is'nt watching.  Rule 5: Enjoy the game.  Rule 6: Be aware of your surrounding's.  Rule 7: Dont try to give charlie a hug.  Thats all",
            "review_score": "1"
        },
        {
            "review_text": "Rating: 8/10  Slender the arrival. Better then the original slender with new ideas and the spooky enviroment, this game really gets your heat pumping with it's jump scares and spooky atmosphere. this game is fun to play if you enjoy spooky games with jump scares and disturbing images.  pros: &gt; spooky atmosphere is very effective &gt; fun to play with friends watching &gt; great spooky ideas to scare the player.  cons: &gt; some images in the game are disturbing",
            "review_score": "1"
        },
        {
            "review_text": "You play as Lauren, a young woman searching for her friend Kate after her mysterious disappearance.  PROS:    Great atmosphere    Excellent graphics    Scares on top of scares    Good story   CONS:    Short    Sometimes unclear where to go   Overall, this is a very good jump scare game that adds to its creepiness with the great atmosphere it builds. The Slenderman and that other little monster are excellent at popping up and making your heart skip a beat just when you think you're safe. The game is really short, but I think if it was any longer it would lose a lot of its scare value.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't knew what to expect, but the game surprised me in a positive way. Did included the horror i was looking for, and it really felt at some points like i was playing the first game from parsec again, and man i love that game! Did had some graphical glitches though, but nothing game breaking.",
            "review_score": "1"
        },
        {
            "review_text": "It's kinda like  Where's Waldo?  only this time the snappy dresser looks for you... and wants to eat your face.",
            "review_score": "1"
        },
        {
            "review_text": "This game...I very much like this game. Slender: The Arrival is a basic survival horror game that relies heavily on jumpscares. But that is not a bad thing. I found myself being caught off guard at moments when I believed Slender nor his Proxies were going to show up. The way this game has impeccable and building atmosphere definitely adds to the stress and pressure the game puts out, also while increasing the creep factor. The way it has subtle story telling, and links itself in a major way to its predecessor, Slender: The Eight Pages, is amazing. I would definitely recommend this game to Slender fans and horror fanatics alike. 8.75/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun, scary, challenging..   Pro: Has that good oldschool horror where things jump in your face.  Con: The challenge is insane.. On easy I still die almost instantly, I won't give spoilers. But I find certain levels at certain times almost impossible to complete.. :/ seems more like luck based game, less skill wise.   But it is definately 9/10 rating.",
            "review_score": "1"
        },
        {
            "review_text": "Start game see title screen quit game 100/10",
            "review_score": "1"
        },
        {
            "review_text": "It is a wonderful horror game. Based on Slender: eight pages, this game enhances everything include visual presentation, sound effect, special effect...etc. If you like eight pages, don't miss this one.  Attention: This game adopts JUMP SCARE technique heavily, if you can't accept, then skip this one.   Players in this game have to achieve certain goal, collect eight pages for example, in dark environment, and the freaking Slender Man will WARPS around to hunt you. When you wander in dark forest, you don't know when it will appear, all you can do is complete the goal as fast as possible and pray, you will be nervous all the time. When you see it, the screen will distort with freaking sound, a creepy man with no face, unusually slender body that definitely not a human, stand still in darkness, it will freak you out, and you can't look at it too longer or stand still too, run for your life, otherwise it will capture you. The tension, the uncertainty, the pressure to complete goal under creepy atmosphere, all of these make terrifying experiences outstanding, it works perfectly to scare people.  The more you approaching the goal, Slender Man will warps more close to you and more frequent, you will be capture easily one step before achieving the goal, you may retry many times to walkthrough a episode, it somewhat difficult and it's on purpose, 'How long you can last' is the core intention for this game, but sometime it may cause frustration, repetitive gameplay due to diffculty may ruin your terrifying experience, I suggest play it on easy if you are casual player or want to keep terrifying experience FRESHLY.",
            "review_score": "1"
        },
        {
            "review_text": "Play for 15 minutes  Delets game  10/10 would sh*t myself again",
            "review_score": "1"
        },
        {
            "review_text": "quite boring..good for a few jumps but besides that it is lacking in story and mechanics",
            "review_score": "-1"
        },
        {
            "review_text": "7.7/10 - One Of The Scariest Games You Can Play! Top Horror Contender!  This game is pretty impressive; it uses elements I really don't like such as dark areas to explore and the use of flashlight.   These are both usually recipes for failure but this game executes these features really well. It's still cumbersome to navigate the maps and find the clues though, so if you are easily frustrated with that like me; be prepared.  The controls and graphics are definitely the best part; the maps are brilliant in color and lighting which really sets the mood and creates a fear factor.  I'd pay $10; usually on sale for $2 which is a steal!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Slender Man Slender Man all the children try to run Slender Man Slender Man to him it's part of the fun Slender Man Slender Man dressed in darkest suit and tie Slender Man Slender Man you most certainly will die Slender Man Slender Man his branching arms are for collecting  Slender Man Slender Man his face is empty of expressing  Slender Man Slender Man he won't let you say goodbye Slender Man Slender Man you most certainly will die You most certainly will die. You most certainly will die. You most certainly will die. You most certainly will die. Slender Man Slender Man sometimes hums a lonely drone Slender Man Slender Man he will wander around your home  Slender Man Slender Man blends in well within the trees Slender Man Slender Man in the fog he's hard to see Slender Man Slender Man dressed in darkest suit and tie Slender Man Slender Man you  most certainly will die",
            "review_score": "1"
        },
        {
            "review_text": "You and everyone in the house will crap in their pants when you play this. So what are you waiting?",
            "review_score": "1"
        },
        {
            "review_text": "Nice game! Many little stuff and a bit of replayability because some things are random. A cool game for every 'Slender fan' but other players won't have as much fun.",
            "review_score": "1"
        },
        {
            "review_text": "WHY AM I DOING THIS TO MYSELF JESUS CHRIST.",
            "review_score": "1"
        },
        {
            "review_text": "amzing game, not that scary but the action in it will get your hart raceing at the higher difficulties",
            "review_score": "1"
        },
        {
            "review_text": "Slender the Arrival is a decent game for its price. You're sure to have a few jumpscares, and a bit of a challenge on hardcore mode. The game has an interesting storyline for you to unravel, but it isn't forced upon you to do so. A few drawbacks are of how short the game is, and I personally didn't find it as scary as the original Slender. Also, it just didn't seem as intense as the original. You learn your surroundings quickly, losing the feeling of being lost... which is key for a Slender game. However, for the restricted time the developers had to create this game, I say it is respectable enough of a game to purchase.  Rating: 6.7 out of 10 by my perspective.",
            "review_score": "1"
        },
        {
            "review_text": "It can be pretty scary, if you're into pale, eyeless chicks or faceless Barney Stinson. It can also get pretty sexy, if you're into tentacles and distorted sounds.  8/10 Because it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is trash. Past the bugs the game looks alright, however the gamplay mechanics are horrid to say the least. Don't touch this game unless it's free one day. Even then, it still might not be worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "More annoying than scary, also its way too short. Beat the game in 40 minutes. 10 bucks for this game is highway robberey, luckily i only paid 2.50 for it. The atmosphere was fantastic though:  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Scary Greenlight Game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Made me cry. And for all the horror fans who are thinking about buying it. DO. Its amazing, the graphics, the gameplay. I guarentee you, you'll probably have a heartattack, or get scared the living ♥♥♥♥ outta you.",
            "review_score": "1"
        },
        {
            "review_text": "Slender: The Arrival is a, game that made me almost hide in my room, and cry. It is so scary. But it is so fun.",
            "review_score": "1"
        },
        {
            "review_text": "I was very exited to finally get this game.BUT... i cant even tell you how much of a let down it was to open it up, and get to the house when it starts to get dark, and find out that the lighting was broke and literally nothing could be made out in the dark (even with the flashlight). i dont often wish for my money back, but in this case i feel that ive been robbed. this game is 100% S**T and unplayabble,",
            "review_score": "-1"
        },
        {
            "review_text": "an amazing game, brings chills to the bones !!! best time to play ? freaking midnight babeee &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Great game for fans of the eight pages and/or slenderman shadows. Only downside is that it's short. If you find this game in a weekly sale or any minor or major sales, I would recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Best.horror.game.ever",
            "review_score": "1"
        },
        {
            "review_text": "This game has lots of bugs and odd fps even on a high end pc.. 40-60fps its not that bad i guess..  Game should of been a bit longer but it did have a few good times while playing the game, I would have to give this game a thumbs up !(y)",
            "review_score": "1"
        },
        {
            "review_text": "This is a truly AMAZING game! I play many good games, but this is one of my favorite. Great graphics, scary music, a creepy atmosphere, a storyline, and (SPOILER ALERT) a disturbing easter egg tie in to create a terrifying but engaging experience that won't let you put the game down until you've beaten it several times (and also won't let you sleep at night).",
            "review_score": "1"
        },
        {
            "review_text": "Best.horror.game.ever",
            "review_score": "1"
        },
        {
            "review_text": "This game got lots of positive review well i can say you can all f--k off and go play chess, this game blows, horror game with hardly any horror elements in it ,if you can call jump scares and static visuals scary thats your problem. Personally i hate this game, cheap death's .GENESIS chaper is impossible i can't finish it at 8/9 page slender man goes ape ♥♥♥♥ and wants to stick his tentacles up your ♥♥♥ cus you can't see jack ♥♥♥♥ when hes very close . This game should be free",
            "review_score": "-1"
        },
        {
            "review_text": "umm when i try to download the game in my libary it says it does but it doesnt download anything it had a empty folder and doesnt even start up what do i do???",
            "review_score": "1"
        },
        {
            "review_text": "so i was exited to play this game until it started and then i could not control the camera it kept spinning in the air and i could move but couldnt see where to go",
            "review_score": "-1"
        },
        {
            "review_text": "scarry as hell so GREAT game has lots of good jumpscares LOTS...slender the arrival best game ever",
            "review_score": "1"
        },
        {
            "review_text": "i know i would like this game but i cant past the house in the very begining if the game. When i walk in i cant see anything the house is pitchblack.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS ♥♥♥♥ IT STUFFED ALL OF MY OTHER GAMES UP DONT BUY THIS GAME ITS NOT WORTH IT",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this ♥♥♥♥, ♥♥♥♥ this game, don't buy it. It owes me a new pair of underwear. ~Tyler",
            "review_score": "-1"
        },
        {
            "review_text": "Slendy Can't Catch Me :D Slender The Arrival is Sooooo Scary &lt;3  100/10 :D",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome, has everything a horror game has, I haven't finished it yet but I love it, it does what it must, I get scared easily by this game XD",
            "review_score": "1"
        },
        {
            "review_text": "+Atmosphere +Graphics and design +Some kind of script -No animation for slendrerman.This can made a game scariest. -Too short -Gameplay(collect 8 pages,turn on 8 generators etc)",
            "review_score": "1"
        },
        {
            "review_text": "Walking in the dark while collecting pages simulator... 6.7/10",
            "review_score": "1"
        },
        {
            "review_text": "Great for the price, really got my heart racing, alot more content and graphics from that crappy original game.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥in scary",
            "review_score": "1"
        },
        {
            "review_text": "This got me stuck in a few parts so I had to look a game play up! But it's a good game if you're into Slenderman and other creepypastas! :P",
            "review_score": "1"
        },
        {
            "review_text": "Each level took me about an hour but I did it! I only died twice because the pages were pretty hard to find. I really liked this game.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS AMAZING GAME SO SCARY! I also have the whole camera translated I couldent make out most of it but they did mentioned something abou Kate turning into proxy. EVERYONE NOSE THAT KATE WAS THE ONE WHP BURNED CR I HATE YOU",
            "review_score": "1"
        },
        {
            "review_text": "Buys game Downloads game Opens game Plays game for 15 minutes Gets freaked out Closes game Closes steam Logs out of steam Has nightmares for weeks Paranoid for weeks Scared the ♥♥♥♥ out of me...",
            "review_score": "1"
        },
        {
            "review_text": "I threw up. Then, three weeks later, I climbed out from beneath my dirty laundry and tried again.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME I NEARLY ♥♥♥♥♥♥ MYSELF TRYING TO FIND THE OTHER THREE GENERATORS. Pretty fun though. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "good game scariest horror game :D",
            "review_score": "1"
        },
        {
            "review_text": "this game is AWSOME because: It has some of the best graphics you'll ever see Promises hours of horror gameplay Has awsome chalenges And Final: You'll learn more about Slenderman mythos",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game and still enjoyable to this day. many parts are exciting and you are always on the edge of your seat. enjoy :)",
            "review_score": "1"
        },
        {
            "review_text": "unoptimized, but its a good horror game, great atmosphere, relies on jumpscares most of the time but its a good buy to get on sale because of how short it is. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "been waiting for this game for a while, although im not very good it makes me jump a lot :) love this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Day 1: Arrived in forest, full of optimism. I'll just find my friend and everything will be fine. Day 1: *screams* Day 1: Makes emergency trip to clothes store to buy new underwear. Day 2: Plays Slender again with friend controlling mouse, and I controlling movement keys. What can go wrong? Day 2: *screams* Day 2: We make emergency trip to clothes store to buy new underwear.  11/10 - Would brown pants wth friend again.",
            "review_score": "1"
        },
        {
            "review_text": "a rather short game, but the graphics are quite beautiful and the plot is gripping. I would only recomend purchsing while on sale",
            "review_score": "1"
        },
        {
            "review_text": "I had This game since the beta and I can say this is a great game that I would recomened others to play, especially with the Oculus Rift DK/DK2 if you have one.",
            "review_score": "1"
        },
        {
            "review_text": "awesome horror game and im glad it was my 1st horror game i bought on steam \\m/ 5 stars homie yeeeee lol",
            "review_score": "1"
        },
        {
            "review_text": "It's the original Unity Slender game with some extra crap thrown in.   Not spooky. Repitive, paper-grabbing garbage.   2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Gotta say its a big improvement. I mean the original 8 pages was 'Eh'. But when u think about it...this game bring more than just the tall menace into it. Now there are surprises that might even surprise u a bit. So basically what i'm saying is this...'It's better than the dull Slender 8 pages'. Now there is more of a story ^^",
            "review_score": "1"
        },
        {
            "review_text": "Very innovative gameplay, but TOO short, too little things to do, and an unclear story! :( Still though, it's worth the try! You get the feeling of being chased, of being completely on your own, there's no one else in the game besides you, and the evil creatures chasing you! I think it would be an awesome MOBILE game!",
            "review_score": "1"
        },
        {
            "review_text": "After trying to finish this game for several years I finally did it. It's good, takes about 9 hours (spread over three years) to complete. A+",
            "review_score": "1"
        },
        {
            "review_text": "Was walking towards the second to last generator when Slenderman appeared literally right in front of me. 10/10 would ♥♥♥♥ myself again.",
            "review_score": "1"
        },
        {
            "review_text": "Be brave but you still scared.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if u like to 360 no scope into death while finding drawings made by the most artistically gifted tall mofo u will ever meet. Also youre friend is dead, spoiler alert.",
            "review_score": "1"
        },
        {
            "review_text": "A horrible copypaste galore of jumpscares and random ♥♥♥♥♥♥♥t.  The prologue of this game is actually the scariest part, seeing that you don't know what to expect if you haven't played it before. But after that, the game just takes you back to a remake of the old 'find the 8 pages while running from slender' game.  It should be needless to say, but this is only remotely scary one time because you don't know what to look out for. But as the gameplay escalates after finding more pages, it immediately turns into tedious ♥♥♥♥♥♥♥t.  You may be looking for the final 8 page several times just to have slender magically teleport from behind you right in front of your face and block your only way to get to the last part. This is not scary, this is not thought out gameplay. This is just complete ♥♥♥♥♥♥♥t when you suddenly have to trek around the map until luck decides that you may pass to the last part without getting randomly instakilled by something you can do absolutely nothing about.  I had hopes that the game would turn into something with more and better gameplay after the 8 pages part, but it's the exact same formula repeated yet again. Except find the stated number of the new type of item while avoiding slender and yet another extra monster at the same time.  It's not funny, it's not scary and it's just a randomized game of tag where you are chased by a no-clipping hacker with teleport. Stay away from this unless you really like jumpscares and copypaste gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "A horrible copypaste galore of jumpscares and random ♥♥♥♥♥♥♥t.  The prologue of this game is actually the scariest part, seeing that you don't know what to expect if you haven't played it before. But after that, the game just takes you back to a remake of the old 'find the 8 pages while running from slender' game.  It should be needless to say, but this is only remotely scary one time because you don't know what to look out for. But as the gameplay escalates after finding more pages, it immediately turns into tedious ♥♥♥♥♥♥♥t.  You may be looking for the final 8 page several times just to have slender magically teleport from behind you right in front of your face and block your only way to get to the last part. This is not scary, this is not thought out gameplay. This is just complete ♥♥♥♥♥♥♥t when you suddenly have to trek around the map until luck decides that you may pass to the last part without getting randomly instakilled by something you can do absolutely nothing about.  I had hopes that the game would turn into something with more and better gameplay after the 8 pages part, but it's the exact same formula repeated yet again. Except find the stated number of the new type of item while avoiding slender and yet another extra monster at the same time.  It's not funny, it's not scary and it's just a randomized game of tag where you are chased by a no-clipping hacker with teleport. Stay away from this unless you really like jumpscares and copypaste gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "A scary game that is pretty cool the first time you play it, but when u keep expecting whats going to come, its pretty boring",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game. Probably the best horror game on the market. Very close to perfect but it still need some bug fixes and author should re-consider the end in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Why do people like this game? Took me all of 2 hours to play this on my first play through. I didn't find it scary or tense. Maybe it's just me. (sigh)",
            "review_score": "-1"
        },
        {
            "review_text": "VERSION 2.0 Review:  Slender The Arrival has certainly had shifts in quality between updates, and I am pleased to say that v2.0 is literally perfect. First off, the new levels are TERRIFYING. And I mean Amnesia terrifying, Homestead and Memories (the two new levels) are very memorable and are a great addition to the game. The Arrival looked amazing upon release, and yet v2.0 makes it look even better. There are better textures and models in some areas, and Genesis now looks fantastic rather than being a carbon copy of The Eight Pages with some of The Arrival's entities. The biggest flaw to S:TA before v2.0 was the gameplay; it was ridden by bugs and problems such as the overly frustrating mine level, terrible interaction physics, and the simply god awful fire sequence. Everything has been fixed in 2.0. The interaction is now smooth and comfortable, the mine level's main NPC (the source of the frustration) has been perfected, and the fire sequence is now an intense but fair climax.   Some gamers may be turned off by the ten dollar price tag for a 3 hour game, but guys, come on. A group of inexperienced indie developers worked their asses off for this and they deserve the money. Not to mention, this is one of the horror greats in gaming - I liked it almost as much as the Amnesia games. This is also the first game by Blue Isle Studios, and for an indie game group's first game this is amazing.   Overall it's an amazing game with a great story. Give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Paper Stealing Simulator 2013  Two years later still unparalleled  10/paper would 10 again",
            "review_score": "1"
        },
        {
            "review_text": "im a logical human this game is enjoyable but not scary...treat it like Kim Kardashian, nobody wants to be near her, just pretend she doesn't exist",
            "review_score": "1"
        },
        {
            "review_text": "Play Slender they said... It won't be scary they said...",
            "review_score": "1"
        },
        {
            "review_text": "scariest game ever ",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I didn't enjoy this game. It's only 2 hours long so don't pay more a buck and a half for it. This game should have been free. It isn't that the game is scary in that it makes you sick to your stomach. The graphics are so bad that they hurt your eyes and make you feel woozy. This kind of game is supposed to scare you not make you feel like your going to vomit. Plus it has almost no story and I have no idea about the characters or the idea of the game itself. If you want to play a truly scare game that has a story and great thrills then play outlast or FEAR. This game sucks and I think I would have been better if I hadn't play it at all. It's a good thing this game had trading cards or I never would have played it.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;played for 10 minutes &gt;reached house&gt; &gt;saw garage's lights were flicking on and off &gt;exited game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is insane. I can't bring myself to play past the forrest. It's dark, the heartbeat rythm going on and the thought that the Slender Man may be rite there on the next turn while you're trying to find all 8 pieces of the letter or whatever it is that was left behind. It gives me the full bodies chills. From either the point that it's that creepy or the fact that I know that the paranormal is there and it does happen and based on personal experiences with the paranormal. Umm. I'll try to get through it but I need a couple boxes of Scooby Snacks to help me along for courage to do so. If I could rate this game with a star system I would say that it far surpased stars to the point of being Super Nova. If you like being freaked out, creeped out, or just to have the feeling of your blood running cold then you need to get this one. Good luck and watch out for The Slender Man.",
            "review_score": "1"
        },
        {
            "review_text": "Game Dosen't Function Well, Blackscreen In Fullscreen, Windowd Works, Alot Of Bugs  In Unplayable state what a ♥♥♥♥♥♥ gane,,,,,  1.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I dont like the game much, because od the bad graphics, yes I know that the games arent about perfect graphics but this really needs them.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Game won't run, a waste of money even when it's on sale. So I tried contacting the support team for Blue Isle, because forum solutions didn't help, they seem to be too busy drowning in the money from this game to help me fix it. I regret this purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "WOW this game is a massive piece of ♥♥♥♥. There is absolutely NO indication on where you are supposed to go or what you are supposed to do. The story is half ♥♥♥♥♥ from what I could see. The graphics, The shading and the textures are all HORRIBLE, Every time anything at all happens you get punted back to the main menu for (SOME STUPID REASON). This piece of crap is so poorly designed and executed that it literally looks like no more than three people worked on this game at any point and time.   I found a missing child poster that put me into some horrible looking mirror world where textures appear and dissapear like magic and I kept teleporting around for some stupid ♥♥♥ reason until I eventually found myself in a lock room that slender appeared in which ended that dumb ♥♥♥ whatever the hell it was supposed to be thus putting me in the main menu instead of back into the actual game.   So THEN I select a mission from the menu where apparently slenderman was hunting for me and I never even saw him all I ever heard were a bunch of ♥♥♥♥♥♥♥♥ noises as I explored the house until I died and had to sit through a long ♥♥♥ bunch of nothing until the game said that I somehow had died and now every time I try to start the game up I see clouds followed by static followed by being punted back to the main menu. Needless to say this game is no longer installed. WHY steam continues to allow unfinished pieces of ♥♥♥♥ like this to be sold is beyond me. This game isn't worth a dime!",
            "review_score": "-1"
        },
        {
            "review_text": "this game is very good",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, it's short but it's still pretty scary ...",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "spooked my pants",
            "review_score": "1"
        },
        {
            "review_text": "No DK2 support, dispite they say 'Steam VR Support' on their sales page.  Other than that I have no idea how this game is.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is scary as hell a must play",
            "review_score": "1"
        },
        {
            "review_text": "YOU WILL BE SPOOKED  BY A SPOOKY SKELINTON IN A SUIT  2spooky4me",
            "review_score": "1"
        },
        {
            "review_text": "5/10 needed more memes.",
            "review_score": "-1"
        },
        {
            "review_text": "Reall scary stuff love it!",
            "review_score": "1"
        },
        {
            "review_text": "Slender is a great horror games the supress any overrated games like FNF in terns of the horror feeling,'Jump scares' and nightmers. I can't walk in the forest at dark anymore. Very short but a must have game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Poo came out...I need an adult",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of mystery, wonder and enought jump scarys that challenge movies like Parnomal Activity and The Conjuring but it also has some call back to Slender The Eight Pages in the first 5 minutes of game play. This game starts off right when your friend Kate (eight pages) has invited you to look after the house but when you enter you here a scream in the forest and see a dark figure in the distance, you must find out what happened to your friend kate and what is the dark slender figure following you. Enter Slender The Arrival",
            "review_score": "1"
        },
        {
            "review_text": "Slender: The Arrival I would say is pretty damn spooky!  What can I say about it other than its tracking down Slenderman himself in finding the pages and searching for kate. The girl that was stalked by Slenderman. Its eerie, interesting but a very quick game. Best part is that it also includes the original eight pages level on top of the rest of the game.  - Spooky - That is it. All I can give it. The sounds... O.o",
            "review_score": "1"
        },
        {
            "review_text": "It is a somewhat cliched horror game (Collect x items, push x buttons without getting caught) but it does manage to be pretty scarey none the less.   Worth a play if its on a good sale.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game ♥♥♥♥ my life i cant sleep im buying this games as a gift for my friend best game ever 666/10",
            "review_score": "1"
        },
        {
            "review_text": "This is my top favorite PC game, next to Five Nights at Freddy's. It's dark, challenging, disorienting (in a good way), and most definitely terrifying.  So if you happen to have a spare ten dollars (or the equivalent to it), lying around, why not give this one a go?   ",
            "review_score": "1"
        },
        {
            "review_text": "Slender the Arrival does it's best to give you a creepy experience but it just keeps falling flat. It is a very nonintuitive game. It's standard first person shooter controls (without the shooter) and places you in the creepy woods of a park. One of its main shortcomings is that it lacks the ability to deliver the story properly. We are supposed to make assumptions about everything. Assumptions that are probably wrong. I kept finding clues about a person and assumed that person might be me. Then it took reading some backstory in a walkthru to discover that I was a completely different person baguely mentioned in one of the notes. The first few times I played it I was throughly creeped out and some of the presentation helped with that. It uses a method of 'steady-cam' view that looks like you are filming this which can also be viewed that you are someone else watching this person's footage (a la Blair Witch Project, CLoverfield, or Paranormal Activity). What you find does heighten the tension and when odd things are seen it really creeps you out. But then it feels like a grind. Where am I supposed to go next you ask. Oh over there. Wait I think I've found everything. Do I go back? Where to next? There is a decisivve lack of direction and instruction. It gave me a goal but the goal was so vague that I didn't know whether I was finished nor did I know if I was finding the right things. I wandered around doing nothing SLOWLY for a half hour and then quit the game. Why? HEre is the biggeswt problem. There is no save feature. It saves once you finish 'THE CHAPTER'. I was stuck in the 'prologue' for days. Every time I tried it I had to start from the beginning. So by the 15th time I tried finding all the clues or whatever I was not afraid of the woods nor the creepy things. So far all I've seen are creepy things but none of them are harmful things. Don't get me wrong. This game has figured out that in horror you can't just in-your-face all the horror like Dead Space or Doom 3 etc. But it has to be subtle. But it hasn't fuguyred out pacing, story, furthering the adventure. It also relies a lot on camera glitches and sound effects and music. THose things are very important in horror. But in this case I am never sure if these elements actually appear in the game world or just in the game 'providing atmosphere' like I'm being followed around by a 40s radio SFX guy banging pots together and breathing heavily. It reminds me of the scares in the movie The Ring where Ehren Krueger hit us over the head with loud noises and in your face weird cut in pictures to scare us and when you got to the end all you could say was 'Huh?' I would be interested if this studio tried it again with horror as this was an improvement over its predecessor but it still isn't there. The controls and gameplay are still lacking. Your RUNNING mode isn't much faster than your WALKING mode. You can neither jump nor go in water so you feel like a child in one of those wheelie guides. The story needs a bit of polish. There needs to be a definite indication who I am and what I'm doing and how far I've gotten with it. Because leaving it up to my imagination is unacceptable in a game. How am _I_ supposed to know when I am done with a chapter if I don't know what I'm supposed to be looking for, etc. This will keep you entertained for a couple playthroughs until you give up and look through the readthroughs. (which don't really help as the items keep moving around) You want to get really scared, go for Five Nights at Freddy's.",
            "review_score": "-1"
        },
        {
            "review_text": "This game does a fantastic job of getting under your skin and scaring the everloving ♥♥♥♥ out of you. If you like a good scare, both from mood and from jumps, hit it up.",
            "review_score": "1"
        },
        {
            "review_text": "Sound is everything in this game. Its amazing how chilling it is because of the sounds they used. Everything else about it was honestly lame and jump scares.  Ran into bugs. One crash 5 mins into the game, and a major crashy issue at 7/8 pages which ported me to the next level... unless that is a feature (time limit or something) im not sure.  Buy on sale for a one nighter.",
            "review_score": "1"
        },
        {
            "review_text": "Now, I'm going to be honest with this game, I think that blue isle studios had a great concept going at first with a new slender game but, when the game was first released to the public full version, it disappointed me to see what they had, and I just left it to one side. Then about a year later, i buy the game for myself and i decide to go through it to you know, get some scares out of it, and I didn't realise how much had been added to the game since! The game is now a LOT better to play through and is a lot more story based around the slender games which I think they finally did a good job with. They finally realised how to make the game better.",
            "review_score": "1"
        },
        {
            "review_text": "I accidentally played the piano and I ♥♥♥♥ myself  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Slender: The scariest game out! i am making a youtube series and the jumpscares are killing me slowly! over all the update adding new chapters adding new hell to my life! get it is epic!",
            "review_score": "1"
        },
        {
            "review_text": "Made 4 guys scream like little girls  10/10 would crap pants again",
            "review_score": "1"
        },
        {
            "review_text": "I hid behind a car and saw the Slenderman standing on the other side, then he disappeared.  5 Stars",
            "review_score": "1"
        },
        {
            "review_text": "Slender: The Arrival is a horror game based on the popular (and free) Slender: The Eight Pages. The game is relatively short (should be less than 2 hours for most people), and divided into several different chapters that each feature different gameplay. Fans of the original will notice a substantial visual improvement, and effective use of sound. This game understands how to execute a horror experience- make the protagonist defenseless, and build up tension before a single encounter.  The longest chapter is a recreation of the original Slender gameplay of collecting 8 pages, with them and their corresponding landmarks randomly distributed, with each further discovery angering a hostile presence in the woods. Simple enough, and it's absolutely chilling. Collecting the pages is reasonably guided inside a large area, but still confusing at first.  The sound and dim lighting crete a constant sense of unease, and when -something- appears, it caused a feeling of dread deep in my gut. Even knowing that it was silly to be surprised multiple times, I'd still jump. Twisted tree branches seen outside my flashlight often seemed like gnarled arms reaching out to me. There's something about games like this, and the Amnesia or Penumbra series, that strike at something deep and primal in the subconscious.   Every chapter after the first and second was not as impressive, and only one of them stood out to me. For gamers concerned about value for their dollar, this may be an issue. The story, told mostly through found letters, is pretty incomprehensible, and although good horror never shows all its cards, there's not a lot to grab hold of here.  Personally, though, I think the quality and intensity of the experience is worth the low asking price. A solid recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Confusing mix of Slender Man mythos and other stuff. 6 short, disappointing chapters consisting of either walking around reading notes, or running around, dodging Slender Man and some other Monster while trying to find a certain amount of items. One chapter its 8/8 pages, the other one you have to turn on 6/6 generators, another one you have to close 8/8 windows. The 'monsters' don't look scary at all and the game becomes increasingly worse after the interesting prologue. Many things are left unexplained. For instance how much chalk the woman writing the notes must have used, writing her thoughts all over the place. And I mean LITERALLY ALL OVER THE PLACE. Is the protagonist going crazy? Is the stuff real? Why is there another 'monster' and is it who I suspect it is. And lastly and most importantly: Do I even care? I think not.",
            "review_score": "-1"
        },
        {
            "review_text": "This game will more than likely make you sh*t yourself. No joke. Besides that amazing game.    10/10",
            "review_score": "1"
        },
        {
            "review_text": "Play this game long enough you will get your virginity back.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game! Still holds onto the Eight Pages feel to the game making it a complete intriguing adventure along the way. With brand new obstacles and new things to find other than pages, what's not to love? For a Unity game, I give this a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "im no like this game",
            "review_score": "-1"
        },
        {
            "review_text": "Well i haven't played much but i still need new pants",
            "review_score": "1"
        },
        {
            "review_text": "best horror game better than the 1st slender : 8 page. n very very very suspend",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me not want to look at a window at night.",
            "review_score": "1"
        },
        {
            "review_text": "i hate the unnecessary jumpscares, but yeah i scream like a little girl 9/10",
            "review_score": "1"
        },
        {
            "review_text": "how to be a ♥♥♥♥♥♥ simulator!  100/10   2 scary",
            "review_score": "1"
        },
        {
            "review_text": "It's a very great game! Although they need to make a sequel for it. The ending of the Steam version makes me wonder what happens to Lauren (The player's character). ",
            "review_score": "1"
        },
        {
            "review_text": "Scary horror game 10/10 I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Got it at sale, good for small money. Wouldnt pay the real prize.",
            "review_score": "1"
        },
        {
            "review_text": "I can refund the game, but not my pants.",
            "review_score": "1"
        },
        {
            "review_text": "It's okay, takes a long time for something to actually happen.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Good graphics. Doesn't have a woman who f#cking pants so loudly and annoyingly like the original 8 pages. Realistic environment. *Spoilers* Slenderman has a little boy/girl, who assists him in murdering you, by jumping on you and stabbing you.  Cons: Slenderman is extremely easy to avoid, isn't as hard as the original 8 pages. Veeery long and boring walks to all these different places. Gets veeeery boring after an hour or two. Jeff the killer is in this game. Eh, 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the scariest games I've ever played. When the original Slender came out, I nearly poo'ed myself, then it was re-released with higher production values into what is 'Slender: The Arrival'. The mechanics of the game are fairly shallow and it really has almost no replayability, once you know the scares and story, but it is definitely worth the single ride. Play at night with the sound up and lights out. You'll be hard-pressed to find a more intense horror experience outside of Alien Isolation ;-)",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. It's got amazing sound and atmosphere. The different levels are great, as well as the easter eggs levels. This game is, at times, terrifying. At other time, it is enraging. This game is a great addition to the Slender series. I had many heart attacks playing this game. I feel like this game is worth more than it costs, but I'm glad that it doen't cost too much. The achievements are very challenging. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "ehh not the best game but scary as ♥♥♥♥ tho so i love it  ",
            "review_score": "1"
        },
        {
            "review_text": "Need more horror games like this.",
            "review_score": "1"
        },
        {
            "review_text": "i beated outlast and amnesia and im still scared playing the 2.0 version",
            "review_score": "1"
        },
        {
            "review_text": "Ran into a little girl in a building and didn't know what she did or why she didn't attack. *Goes to give a hug and realizes its Charlie* *Gits gud by Charlie and throws headset out of being startled* 'HOLY ♥♥♥♥'      10/10 Charly es bes at noe skopen ur mum n blazin et faget.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like tall men with long arms, spooky stuff, and a hot night out in a park? If you answered yes to any of those things, then this game is for you! Just collect one of eight pages right now and receive a free hug from Slender. Additional spooks may apply. Please consult your doctor before playing with Slender. Side effects may incude static, death, and pain.   'Like Call of Duty but sp00ky. 8/8 GOTY' - IGN.",
            "review_score": "1"
        },
        {
            "review_text": "I hid behind a car and saw the Slenderman standing on the other side, then he disappeared.  5 Stars",
            "review_score": "1"
        },
        {
            "review_text": "without a doubt the best slender title out there!",
            "review_score": "1"
        },
        {
            "review_text": "well i have played the original and now this and i still gets me every time.... if your a fan aof jumpscares and suddeen moments of panic then this is the game for you! no weapons just collect or activate what you need and avoid slender at all times dont stare at hime just look away and RUN!",
            "review_score": "1"
        },
        {
            "review_text": "What I liked about it: -since my laptop can play on the 'Best' setting, the graphics were phenominal. -The story is immersive, and the backstory is the same. -Inspired me to type a novel about it, which writing isn't my thing. -Introducing the aspect of a proxy. (I felt this was the scariest part, if not the best part of the game) Now for the bad things: -You had Marble Hornets people on this project (No, this isn't even that bad, but I expected there to be Kate as a proxy, which was sort of a buzzkill.) -Obviously we get to play as CR, but my question remains WHO THE HELL IS CR?! All you've given us is the level 'Homestead'. -Hardcore mode. -We saw Kate as a normal human, but what the hell made her shorter, and more flexable? Did Slenderman have s*x with her? Overview: Very good game to play in the dark if you want to get scared, and also a wonderful game to explore around. 8.7 out of 10. Gg, Blue Isles!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game......its short, but good. i think that it would be an exact 10 out of 10 from me if the owners added a little more gameplay. But overall, i give it a 9 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Good game! defenitly pick this up",
            "review_score": "1"
        },
        {
            "review_text": "Super terrifying, but incredibly fun and passes the time by nicely.",
            "review_score": "1"
        },
        {
            "review_text": "Created by the same team behind the originial, experimental, slender: the eight pages game, Slender: the arrival is a full, nerve shredding experience, which may as well have a reward for depriving me of sleep. Both from playing, and also from not being able to sleep afterwards.  While it is a very short game, there is plenty to find, after hours of playing around I still have not got all the notes. There may even be secret areas I am unaware of.  Since it's arrival on steam there has been new content, which fills in some loose gaps in gameplay, while adding to the experience.   It has a great atmosphere, nice graphics, is really scary and has a decent story.   The one problem; it could explain more. I get that it's trying to create a sense of mystery, and it's up to you to find out the lore behind the game through fidning notes lyting around, but it could at least explain your charecters role and their backstory more immediately, we are playing AS them, so why not know what they do?!  Other than shortness and a few optimisation issues, it's a great game, and seeing as it's the first commercial release by it's creators, it's a great effort!  If you love horror, go for it!",
            "review_score": "1"
        },
        {
            "review_text": "WHAT.A.GAME. it was great but chapter 3 is so hard i had to cheat to get through it! also there is a lot of lack in the story so im going too make a ferther detailed version of the story in video. but over all they are gonna put it on xbox360 and add a new chapter so ill buy it for someone.",
            "review_score": "1"
        },
        {
            "review_text": "Slender: The Arrival builds on the previous game tenfold. There are actual places to explore, objectives to meet, and collectables scattered throughout the game. It does bring on the terror many a time, and is sure to be a great experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game really has nothing going for it. Give it a try if it's ever free but it's definitely not worth your money. Maybe this is due to the fact that I've played through plenty of games that do what this game tries to do but far more successfully, such as Amnesia or Outlast. Or maybe it's that everything is extremely predictable. Or perhaps it's the fact that on a first run you'll beat this game between 1-2 hours.    Those issues aside the main issue lies in the enemy(s) your running from. Neither of which leave you feeling the urgency to run. Slenderman himself is laughably predictable and easy to evade while the second enemy you encounter both runs slower than you and can be stunned indefinitely with just your flashlight, so the entire time never feeling like much of a threat. I think the scariest part of this game happened when the level broke due to a glitch and had to be restarted.",
            "review_score": "-1"
        },
        {
            "review_text": "It's scary, what do you expect :?",
            "review_score": "1"
        },
        {
            "review_text": "I think the creators of this game might have got the name slightly wrong. I have managed to play the game in 5 minutes chunks. The game itself is nice; the setting is a quaint nature area outside a brick home. I manage to walk around this area watching the sun set, and really enjoy it. Sadly as night sets in creepy things start up and the game must be closed soon after. I think that if they were to rename the game Nature Simulator 2014 and maybe add some DLC that cost say $5.99 where maybe we got 10 minutes until the creepy darkness set in, they could really have something good, not that I’m unhappy with my 5 minutes of sunlight, just a simple suggestion.",
            "review_score": "1"
        },
        {
            "review_text": "It's Slender. Play this at night, headphones on full volume in pitch black. You won't sleep for a long time. Pure unadulterated horror.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah Yeah ive only played a few hours of this game.  But lemme tell you i got a ton of laundry to do now, cause i literally ♥♥♥♥ my drawers like 15 different times in this game. Do yourself a favor and the person your trying to scare s h i t less and get some loud ♥♥♥ speakers and surround sound.  But this game.........I be walking along you know enjoying my sweetroll and stroll through the woods at night. (who the ♥♥♥♥ does that?) Well ooviously your dumb ♥♥♥ deos, but thats besides the point.   Then this ♥♥♥♥ comes out of nowhere and is like IMMAEATYOURFACEOFF!!!!! BLAHAHAHAHAA!!! I drop my sweetroll and go screaming through thhe woods without the slightest idea of where the hell im going.  To my dismay this D i c Khead eats my sweetroll and then chases my ♥♥♥ making me collect pieces of paper, or whatever like its some kind of sick game.   (Again who the ♥♥♥♥ does that?)   Well obviously the slenderman does.   Why? because hes a prick, without a face, and hes wants to eat your face off with his tenamacles and ♥♥♥♥.  Little to my Dismay i took an arrow to the knee and trip off a cliff. For whatever reason this dude who can magically cath you no matter how fast your run or where you go cant get me now.  Whats my secret you ask? oh no. theres no secret. My ♥♥♥ is unconsious at the bottom of a cliff, so yeah you do the math.  Then i wake my ♥♥♥ up (still very much alive) in the evening with a little bit of light. So what would you do? Go find the nearest cop or hick with a gun right?  f**k no, i go into a deserted mineshaft looking for some more horror action.   'Merica!  But yeah this game is scary as ♥♥♥♥. (to an extent) Unless your a ♥♥♥♥♥. then its REEEEEEEEL scary.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played Slender: The Eight Pages, I was like 'The game isn't scary it's just jumpy!'. But when Slender: The Arrival came out, everything changed. The game is considered as a real Horror game and it deserves that title. It's the atmosphere of the game. It's so creepy that I excpected jumpscares around every corner, but there were none! Then I heard footsteps following me but there was no one there. The only levels where I felt safe in was the Eight Pages chapter since I knew that only Slendy will come after me there. The game is really recommended for all the horror fans out there!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a great sequel to the original 'Slender' preview. Combining fear of the dark with fear of the unkown, Slender: The Arrival creates a thrilling and terrifying experience that stands out from your average haunted asylum or abandoned house of BS. Anyone who likes horror and mystery should absolutely buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Very Scary",
            "review_score": "1"
        },
        {
            "review_text": "Slender: The Arrival is awesome, not the best grphics but it worth it. I strongly suggest it if you like slender the eight pages and you want to know the extended version of the eight pages. I recomend it because of its story and scary moments, sometimes panic. But just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "this is the most scary game i played so far it it pretty scary i think you guys will be scared to also this comes with 3 objectives  -cellect 8 pages -turn on 6 generators WARNING new slender girl -get to radio tower to end slender",
            "review_score": "1"
        },
        {
            "review_text": "The perfect game for every stay up late at night child with an insane sence of what is fun in life. This game has a stench of insanity from the very depth of its core and should not be overlooked by those who play scary games for thrills.",
            "review_score": "1"
        },
        {
            "review_text": "Very short, but its definitely interesting, particularly if you follow the Slender Man on the whole. The horror does wear off once you have an understanding of the mechanics, but you will be rather on edge at the beginning. Its not ALL jump scares like some people might say, but they are a bit more common at some parts than I'd like.   I'll give it a recommendation, but only if its at a discount. The game game only lasts about 4 hours. If you want to try to get 100%, look for the secrets, or speed run it, then you might be able to get another hour or two I guess. The length isn't really too much a problem, but its important to know when looking at the price tag.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great improvement to 'The 8 pages' but be prepared that all the levels are pretty much the same objective, and only has about 6 levels. If you were a fan of the origional slender, than you should like this.",
            "review_score": "1"
        },
        {
            "review_text": "The game is based on a campaign instead of the main 'find 8 pages' idea, from the first game. The campaign contains a lot of various 'missions', like finding eight pages, but in different environments with different encounters. A huge part of the game is also the story and exploration. I asume you already know the stories about Slender or just the main idea behind Slender, but in The Arrival it's a new story. You will find yourself searching for notes -not just to get further in the game, but also because you want to know the new story in this game.  All in all: This is my favorite horror game of all time. The atmosphere, the story, the graphics are all amazing and the special effects and sounds are superb. Definately a must have if you like the Slender concept as much as I do.  Some of the reviews may tell you that this game is only based on scares and 'flicking switches'. I disagree with that. The game is much more than scares. It's the atmosphere, story, the drawings on the wall, and the footsteps outside your house that makes this game a must have horror game.",
            "review_score": "1"
        },
        {
            "review_text": "I have never legit been scared by a game yet, but this one succeeded. I can never get past chapter 2 though, and it is challenging which I really look for in games. The graphics are decent enough, the overall game play and ambience is terrfying and yet fun. The story is interesting and more indepth. And seriously, I swear Slenderman is a cheater, teleport hacks or something! :P",
            "review_score": "1"
        },
        {
            "review_text": "tried to exit the game..turns out thats not such a great idea!..5*****",
            "review_score": "1"
        },
        {
            "review_text": "Oh my gosh! My friends and I have played this and it has terrified us. Lol!",
            "review_score": "1"
        },
        {
            "review_text": "If you have a 32 bit OS/System the i wouldnt recomend this game, I had 32 bit windows 7 and the main menu lagged. However after upgrading to 64bit windows 7 I was able to play the game no problem, It is a great game with a good number of jumpscares to keep you on your toes. ",
            "review_score": "1"
        },
        {
            "review_text": "Bought it, installed it, launched it, played it, 5 minutes in, its getting dark, house is empty and scary, nope.... nope nope nope nope... nope not tonight. I'll try again tomorrow &lt;- repeat",
            "review_score": "1"
        },
        {
            "review_text": "WTF !! this game is not the slender you remember...... this is some creepy as hell ♥♥♥♥ !!!!!!!!! i actually find the game to be so scary that my progress so far has grinded to a hault. I ran through Outlast cracking jokes the whole way....... But this, this is a whole new experiance in terror.........",
            "review_score": "1"
        },
        {
            "review_text": "Spooky game. Not highest quality graphics or anything, but entertaining nontheless",
            "review_score": "1"
        },
        {
            "review_text": "Slender: The Arrival is a horror game based on the popular (and free) Slender: The Eight Pages. The game is relatively short (should be less than 2 hours for most people), and divided into several different chapters that each feature different gameplay. Fans of the original will notice a substantial visual improvement, and effective use of sound. This game understands how to execute a horror experience- make the protagonist defenseless, and build up tension before a single encounter.  The longest chapter is a recreation of the original Slender gameplay of collecting 8 pages, with them and their corresponding landmarks randomly distributed, with each further discovery angering a hostile presence in the woods. Simple enough, and it's absolutely chilling. Collecting the pages is reasonably guided inside a large area, but still confusing at first.  The sound and dim lighting crete a constant sense of unease, and when -something- appears, it caused a feeling of dread deep in my gut. Even knowing that it was silly to be surprised multiple times, I'd still jump. Twisted tree branches seen outside my flashlight often seemed like gnarled arms reaching out to me. There's something about games like this, and the Amnesia or Penumbra series, that strike at something deep and primal in the subconscious.   Every chapter after the first and second was not as impressive, and only one of them stood out to me. For gamers concerned about value for their dollar, this may be an issue. The story, told mostly through found letters, is pretty incomprehensible, and although good horror never shows all its cards, there's not a lot to grab hold of here.  Personally, though, I think the quality and intensity of the experience is worth the low asking price. A solid recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "I am making this review while Slender is paused in another tab and I am utterly terrified I have five pages in the second level and I and so surprised I made it this far because this s*** is HARD!",
            "review_score": "1"
        },
        {
            "review_text": "I just cant take it anymore  10/11 would cry again",
            "review_score": "1"
        },
        {
            "review_text": "There are few good VR games as of now but this is one of them for sure. Playing this game without VR it's alright but with the DK2 the game actually makes the game scary. I think VR makes all horror games a lot better honestly. If you have the DK2 you need this game and if you don't but you like Slender Man games you still need this game.  It's short but it's fun to play in the dark alone.   JUMP SCARE ALERT   -- If you play this game in VR and you have heart issues don't walk into the burnt down house before you get into the woods. You will die --",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Trying out this game to test a new surround headset was not a good idea.",
            "review_score": "1"
        },
        {
            "review_text": "I think that this game is fantastic and there should definantly be a sequel or maybe prequel.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME PlAYED AT MIDNIGHT RELEASE. Now the horror is back and scary",
            "review_score": "1"
        },
        {
            "review_text": "Really well designed and interesting game to start playing, the repetitive nature of the game makes it hard to continue playing but well worth the cheap price of the game.",
            "review_score": "1"
        },
        {
            "review_text": "While the game was a bit shorter than i expected it to be the immersive game play the story and the searching for all the stuff you need plus dificult senerios that you have to handle and the scares and uneasyness this game gives off i strongly recomend it to anyone who is a fan of horror games or even jump scares",
            "review_score": "1"
        },
        {
            "review_text": "The is by far the best slender man game out of em all!",
            "review_score": "1"
        },
        {
            "review_text": "its slenderman i cant review this",
            "review_score": "1"
        },
        {
            "review_text": "I haven't logged too many hours on this game, but very fun, and a game of choice when me and my friends are drunk and want to play a scary game together... haha.",
            "review_score": "1"
        },
        {
            "review_text": "Scary, yet amazing! Love it!",
            "review_score": "1"
        },
        {
            "review_text": "awsome game! ",
            "review_score": "1"
        },
        {
            "review_text": "Good sh*t. But sometimes become hard and slender teleports to fast and don't let you think.",
            "review_score": "1"
        },
        {
            "review_text": "Anything with slender man in it is great to me. I love the fact that he just seems to stare at you and be right there when you least expect it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you want to know how scary this game is you better try it wahaha",
            "review_score": "1"
        },
        {
            "review_text": "Seriously doe if u really want to get scared play this game ALSO THERE ARE LOTS OF BİG FRİCKİN JUMPSCARES",
            "review_score": "1"
        },
        {
            "review_text": "I recommend playing at night. All lights off and headphones that can get very loud.",
            "review_score": "1"
        },
        {
            "review_text": "*Starts game* *Enters house* Oh, this isn't so bad... *Screen flickers* OH $H1T! *Force quits*",
            "review_score": "1"
        },
        {
            "review_text": "Ran into a little girl in a building and didn't know what she did or why she didn't attack. *Goes to give a hug and realizes its Charlie* *Gits gud by Charlie and throws headset out of being startled* 'HOLY ♥♥♥♥'      10/10 Charly es bes at noe skopen ur mum n blazin et faget.",
            "review_score": "1"
        },
        {
            "review_text": "Was kinda scary a little bit. Pretty slow though. Mostly was just meh but I liked the idea of Slendermin. Probably wouldn't reccomend but I'm not positive on that cause there were good parts. There were bad parts too though so not gonna reccomend it. ♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "As much as I love the Slender Man myth, this game is just a buggy cash-in on the concept.",
            "review_score": "-1"
        },
        {
            "review_text": "Very mysterious and eerie. No matter how much you think you anticipate something hiding around the corner, it doesn't soften the blow at all. This game is seriously scary and challenging too!",
            "review_score": "1"
        },
        {
            "review_text": "After the new update this game is worth the orice of it. Im beated the game under a little more than 1 hour on EASY. The game contain 9 levels: The prologue The eight pages Into the abyss Flashback Memories Homestead Escape The arrival Genesis (remake of the original eight pages with greater graphics) +1 Secret easter egg level  Oh and theres a story....IN A SLENDER GAME! And its not a bad story so go search for scrapbook stuff!  Also there is some easter eggs in the game so if you maxed everything you can found them.  I bought the game on halloween sale and it was a pretty good buy.  So if you are interested in an action orianted MILD horror game this is a pretty good choice. (Sorry for my bad english.) ",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a review you've come to the wrong place, if you're here to cook a pie then read on ! Napoleon from the final puff pastry  You will need:  Ready flaky pastry - 1.5 kg five eggs Flour - 150 g&gt; Sugar - 400 grams Milk - 1200 ml Vanilla sugar - 1 n. Cognac - 1 tbsp. l. Shelled walnuts - glass sequence of preparation: dough defrost naturally at room temperature (defrost time indicated on the package). Cook the custard: grind the egg yolks with a mixer or a whisk to a conventional incandescent and vanilla sugar, flour and brandy to enter the mix. The mixture pour a trickle of milk, stir and cook, stirring constantly. Divide the dough into the desired number of pieces that will later Korzh. Roll out each piece on a board sprinkled with flour. Bake in the oven for about 10 minutes until golden color on a dry baking temperature of 200 degrees. Fluff the cooled cream cakes. If desired, each layer sprinkled with chopped nuts. On top of the cake lightly press smeared with cream and sprinkle all sides crumbs. Add layer cake in a cool place overnight.",
            "review_score": "1"
        },
        {
            "review_text": "I have plans for you, Kate  10/10",
            "review_score": "1"
        },
        {
            "review_text": "i ran away from my computer when i saw slender great detail. 10 10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, amazing atmosphere, deep storyline that needs alot of research to be completed. Alost 100 hours put into the game I still have things to explore and test, from map glitching to eastereggs, things to do remains abundant with the occasional and brutal scare. The only downside is the missed opportunity. With the amount of work put into the game, and the crazy development cycle, the main game is just too short. Perhaps it could be better if, considering how Lauren calls the shots but the path she takes is inevitable, the game wasn't so damn linear. The outcome of Lauren should change based oon the decisions you make and the paths you take. I congratulate you, however on the inspiration to start game development of my own (mainly because I'm pursuing the things the game could have done better).  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Good sh*t. But sometimes become hard and slender teleports to fast and don't let you think.",
            "review_score": "1"
        },
        {
            "review_text": "wow such dark very scary so light am i hi am i hi",
            "review_score": "1"
        },
        {
            "review_text": "With the original game being nothing more then a mess of bad graphics and cheap jumpscares, it was pretty amazing to see how much this improved in every aspect. Plot was pretty vague but interesting, and at least it actually had a plot. I hope they make a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "For what is worth, Slender: The Arrival has its moments of tension and scaryness. However, most of the game is just too damn dark (imo) to even enjoy it. This fact breaks the tension by a mile... that and the original was just a better idea overall.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like tho get scared ♥♥♥♥♥♥♥♥ this is for you. Would play again 5/5",
            "review_score": "1"
        },
        {
            "review_text": "It might be short but holy moley it's scary buscuits left, right and centre. Clocked it on easy and can't wait to play through again for the acheivements that I've yet to unlock. If you want something that'll get your heart racing, make your skin have goosebumps and make you sweat at the same time, get this. It'll freak the ham baps out of ye",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and Outstanding remake of the original 'Slender the Eigth Pages' with improved Graphics (simply Amazing) - Huge Open areas: Forests - Mountains, and something else horrible to explore. ;)   - You get the feeling of being alone - 'Isolated' in a place where no one can hear your scream and no one is around to help you.   - Exciting and Good Storyline with an incredible Plot!  Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "I played the original slender when it was just an internet game like many others, and it became a quick party piece to scare the crap out of everyone.  This game? Matched it and I was glad to buy it off the creators website before its major release. Amazing how something so simple can catch that elusive scare factor.  A little short? Maybe. But blimey it makes you want to turn and run away...which I may have done at one point.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ my panties",
            "review_score": "1"
        }
    ]
}