{
    "app_id": 252430,
    "name": "Dusty Revenge:Co-Op Edition",
    "release_date": "2014-02-17",
    "developer": [
        "PD Design Studio"
    ],
    "publisher": [
        "PD Design Studio"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Beat 'em up",
        "Platformer"
    ],
    "achievements": 18,
    "positive_ratings": 70,
    "negative_ratings": 100,
    "price": 10.99,
    "description": "Revenge will consume you, but redemption will push you to your breaking point.Play as Dusty, a multi- weapon wielding warrior ready to face loads of outlawed criminals, dangerous creatures and the ruthless evil villain that rules them all.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252430/header.jpg?t=1450692381",
    "minimum_requirements": "OS: Win XP, Vista, 7, 8 Processor: Intel Core 2 Duo Memory: 4 GB RAM Graphics: Discrete Graphics Card with 512mb, OpenGL 2.0 DirectX: Version 9.0c Storage: 3000 MB available space Sound Card: Open AL Additional Notes: Not recommended for play on Intel systems with integrated/shared video memory",
    "recommended_requirements": "OS: Win XP, Vista, 7, 8 Processor: Mid Range Intel Core 2 Duo Memory: 4 GB RAM Graphics: Mid Range Discrete Graphics Card with 512mb, OpenGL 2.0 DirectX: Version 9.0c Storage: 3000 MB available space Sound Card: Open AL Additional Notes: Not recommended for play on Intel systems with integrated/shared video memory",
    "reviews": [
        {
            "review_text": "Dusty REvenge: co-op i'll start off with the bad. P.S. This is my first review.  Cons. This game has alot of problems from the Shaky cam; to the framerate dorp when your playing with another person, and finally the voice acting. Last but not least the fact that you need to download openAL just to get the sound working. But strangely i have to recommend this game if you can get passed that like i did.  Pros The Combat is really good but not too easy where it's just buttion mashing. The cutscenes and art in the levels look really well done. There's about 20 combos you get by leveling up. Some good quick thinking plaforming. Suport characters that are really useful. Boss rush. Which i record myself doing         YouTube™ Video:  Dusty Revenge Boss Rush Part 1&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Really a fun experiance fast pace awesome combat.",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually enjoy these kind of games but this one really stood out and even though I only had 20 minutes or so to game I ended up spending more than an hour and was late for work as a result. It's hard to describe this game. A sidescroller tekken? I was having an amazing time trying to figure out all the combos and have not had any problems with hit boxes or the bosses. I really like the style too. Thumbs up from me.",
            "review_score": "1"
        },
        {
            "review_text": "Didnt really enjoy this game, I guess it isnt bad its just the controls are very laggy, and the actual fighting mechanics in the game are pretty poor to say the least. The bosses are forgettablle at best, along with the other creatures throughout the game. The story isnt bad for what it is, and the actual graphics are pretty and colourful, alot of work has gone into the art in this game. The achievements are to easy, taking no effort on my part to complete although I still have one to get and this is the hardest, the boss rush. Collectables also play no part whatsoever. Overall I was expecting something more..... 4.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "YAY THEY FIXED IT.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope",
            "review_score": "-1"
        }
    ]
}