{
    "app_id": 252450,
    "name": "StarDrive 2",
    "release_date": "2015-04-09",
    "developer": [
        "Zero Sum Games"
    ],
    "publisher": [
        "Iceberg Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Space",
        "Sci-fi"
    ],
    "achievements": 34,
    "positive_ratings": 967,
    "negative_ratings": 758,
    "price": 22.99,
    "description": "StarDrive 2 is an exciting and evolutionary step forward for the StarDrive franchise. In this eagerly anticipated sequel, the core mechanics have evolved to incorporate a turn-based strategic layer, featuring spectacular realtime battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252450/header.jpg?t=1466665144",
    "minimum_requirements": "OS: Windows Vista / 7 / 8 / 8.1 64 bit   (32 bit NOT supported !) Processor: 2.5 Ghz Intel Core 2 Quad Q8300 or equivalent Memory: 4 GB RAM Graphics: 1 GB nVidia Geforce GT460 or equivalent, 500 MB ATI HD4850 or equivalent DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX 9 Compatible Audio Additional Notes: Minimum Resolution: 1366 x 768",
    "recommended_requirements": "OS: Windows Vista / 7 / 8 / 8.1 64 bit   (32 bit NOT supported !) Processor: 3.5 Ghz Intel Core i5 or equivalent Memory: 8 GB RAM Graphics: 1 GB nVidia Geforce GTX660 or equivalent, 1 GB ATI HD7850 or equivalent DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX 9 Compatible Audio Additional Notes: Minimum Resolution: 1366 x 768",
    "reviews": [
        {
            "review_text": "I just finished watching a live stream of the dev playing the game and learned a lot from it. I still have my reservations about the game, however Zero is patching the game to address some of the concerns I've had about difficulty.   Truth is if you play the game 'smart', you can win. Having said that, I tend to turtle. I like games with a slow burn to them. I don't like getting into wars very early. Maybe that's where my frustration comes from. I would still like to be able to refine AI behaviors much more and tune them to my preferences and hopefully we'll see the implementation of that.   Regardless, Zero seems to really care about the game and the community. I believe he'll do everything he can to make it fun for everyone. Those that want an easier game, will probably get it, and those that want the challenge, definitely already have it.   Bottom line is, the game is worth it. I don't want to turn anyone away from this with an overly negative review. My original review had nothing good to say about the game and that's very very wrong, the game is worth the price tag and definitely worth your time.   Previously published negative review: There are a great many things to like about StarDrive 2 but unfortunately the incredibly unfair and difficult AI outshine anything good this game currently has to offer.   The main problem comes from the fact that the AI seem to be able to 'cheat'. They always have these impossibly massive fleets that more than out match yours regardless of how advanced your race is. Diplomacy is laughable. It's always completely one sided, the AI will make you an offer but will almost always reject your counter offer even though it's more than a fair trade. If you refuse to trade with them on account of you getting a terrible deal out of it, be prepared for them to invade you almost immediately.   The problem is two-fold because the difficulty setting does NOTHING for the AI difficulty. The only thing it does is change how hard diplomacy is. Because of this the difficulty setting might as well not even be there. Even if you are able to get a race on your good side, and you give them everything they ask for and more, they will inevitably declare war on you for seemingly no reason and they will always win that war because they're somehow able to match your forces 3 - 1 or more.  This is not even taking into account the amount of 'random' enemies that spawn very early into the game and destroy any progress you make. They never stop. You can't destroy their bases because you aren't given enough time inbetween each attack to amass a fleet large enough to destroy them. The worst is when your main fleet is blown to bits and they go after your freighters. You can't defend your freighters because an enemy engagement with them is an automatic combat failure. They're just destroyed. So your colonies starve and die out. If you create more, the AI that's camping your home world will just immediately destroy it. You can't send reinforcements because the game forces you into a combat screen with no way to send more ships to help.  This is a huge problem because your fleet could be RIGHT NEXT to your home world but the attacking fleet manages to get in just right so the only thing fighting on your side is the orbital station around your world. So you just have to let them destroy it while you sit there unable to do anything about it.   The combat 'fun factor' suffers for me because if they decide to attack my lone scout vessel two feet away from my main fleet, I have no choice but to waste a good 30 seconds entering combat and making it retreat when it would be so much better if I could just have my main fleet join the battle.  In short, the current state of this game is frustrating. The negatives I mentioned here would be completely manageable if not for the freaking AI steamrolling you 10 minutes into the game.",
            "review_score": "1"
        },
        {
            "review_text": "The most addictive 4X game I've played since Master of Orion 2. The shipbuilding is amazing, and the space battles are absolutely beautiful. It has many different minigames, including unique missions and research, giving plenty of interesting choices along the way.  Only minor problem I have with it is that the ground combat is a bit wonky to see what you're doing and control properly, and doesn't quite live up to the rest of the game in terms of how it looks. Also, the unique missions seem to be pretty few in number, since I tend to get the same 2-3 ones every game I start, but this will hopefully be addressed with mods/dlc in future.  Well worth the money, this game is tonnes of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Love it.  Pros: Ship customization. Create a ship design, build it and send it to conquer the galaxy or die in a fire which ever comes first.   Good diplomacy with the other races. Expand too quickly, other races notice and do not like it. Don't have a very powerful fleet to defend yourself, other races will see you as weak and may declare war. etc etc, I have seen some stupid AI and this is not as far as i have seen in diplomacy a stupid ai  SOOO much nostalagia of old MOO2 I created a cybernetic race and named them the Meklar Consortium in honor of that classic. Was suprised to unlock an achievement. Awesome Zero, just awesome.  Quests in Space: interesting things abound in the galaxy. Keeps me from declaring war on the Pollops for lack of things to blow up.  Cons: Sleep deprivation   In all a must have for anyone who liked Any space empire game. I cannot list all the games that come to mind that this trumps.   DLC Edit::: The Zero Sector DLC was a good investment. I am enjoying a new game right now. The larger galaxy size, division of the galaxy into sectors, streamlined ground combat, new techs, sector control all great additions. Still 2 thumbs way up",
            "review_score": "1"
        },
        {
            "review_text": "The game is very Masters of Orion-esc. I have played stardrive and many many other 4x games. Probably my favorite Genre. Honestly i was on the fence about this one. I didn't know if i wanted to spend the money and jump in, but after watching some lets plays, I had to try it.   The Good:  Stardrive ship customization. Probably the biggest thing here. You can literally make any ship you want and make it work, Its based on these little squars blocks outlining your ships interior and its 4 quadrents. Each quadrent having a different gun facing and its own hps.  The 4x-ness- spying, diplomacy, trading, combat. Multiply paths to victory. Side missions and quest. Which i might add can be harder than some of the AI players.   The fact that there is ground combat. So, This is also a negative but still the fact they they at least have something representing ground combat is good from the point of future development.  They game iteslf is Turnbased, but the combat is real time in an instanced battlefield. I really like this! One thing I didnt like about Stardrive 1 was that a battle would be really messy and meander all over the place. Some might like that, but for me having an actually formal engagement really made this fun for me. It also opens up battle arena that is also in the game. So less persistant RTS and more Gratuitous space battles.  The look and asthetic is well done. Hard to believe they have such a small team working on it.     The bad:  Some things are half done or not fully fleshed out. Ground combat needs a lot more love, but it is still enjoyable for me.   There are some bugs here and there that need fixing  Many racial weapons/tech/ship layouts are unbalanced or non existant. I.e Kulrathi have their own melee weapon and defensive skill for ground combat, and they have tech that furthers this in the ???? tree for research. Pollops and Squids have it also, but races like human Vulfar chukk are kind of out in the cold. Not to mention an optri cruiser has almost 2x the space to put modules on it than the vulfar. I know that this is being looked at but for now its in the negative column as it directly effects the game in a big way.   The game to me seems more like a beta, but I am a purist that believe games are not launched until they are ready and polished.     Conclusion: ok so I would not have recommended this game when it launched, but in just a few days the developer released so many big changes in under a week that I had to take the plunge. Sure, is it not finished and buggy. Yes, but I would rather have a game where the developer is constantly updating it to make it better than a ok game that gets and update every 6 months to a year.  ",
            "review_score": "1"
        },
        {
            "review_text": "The game has its bugs but for the last 10 hours it is really fun to play, recomend it to those which love games like MOO and SOTS 1/2 Good diplomacy (except oertes) best ship design  Fun and easy to play Turn based ground ship combat  It still needs a little work and polishing,smashing bugs , but i think it will be best 4x game for me in 2-3 months :) ",
            "review_score": "1"
        },
        {
            "review_text": "Master of Orion II remastered. If you liked that game you will like this one. Dificulty still has to be fine-tuned, but all in all the game plays and looks great, and is about as close as you can get to a modern MOO2, great job, and worth its price.",
            "review_score": "1"
        },
        {
            "review_text": "I see a lot of negitive reviews on here because the game is hard.  This is not a hard game. The AI also DOES NOT CHEAT. It will unsettle most of your 4x game habits. You will not get 50-100 turns of peace to quietly build resources &amp; infastructure and expand to your hearts content. You have to prepare for an attack immediately. It may not come, but it most likely will.  It is different than most 4x in that your in danger from turn one. I start every turn with the question, can i fend off an enemy fleet this turn if a wormhole opens up on my homeworld. If i answer no, then build ships. This game heavily rewards players garrisoning units (half command points and no maintanance).  The AI is AMAZING! Any game you have ever played where the AI decision making could be exploited and you thought to yourself, I shouldn't be able to do this. The AI is actually very cunning. It will wait for you to launch attacks outside of your teritory, so your ships are low on fuel and have trouble returning to defend. It will steal from you, it will backstab you.  There is no science victory, there is no diplomatic victory. You have one goal, domination. You can turtle, but only to counter attack. Yeah, expect the AI to have garrisons.  I highly recommend this game. You will have to practice at it to get better. The in game tutorial is excellent. The tooltips are excellent. Do not give up on the game if you start losing. Start another game and instead of building that nice to have thing that gives +1 to whatever, build a ship. =)",
            "review_score": "1"
        },
        {
            "review_text": "First: I own Stardrive. But this is about Stardrive 2. This game is very good. Period. As an old 4x gamer I can say this for sure. Haters gonna hate. Now the review: I've tried almost every 4x game published during the time between MOO2 and Stardrive2. I've been waiting for too many years for this. Almost every game I tried had some things attractive and were lacking in other areas. Never found one 4x space game that fullfilled my expectatives. There was always something. I admit, for me the canon is MOO2 and I must say Stardrive 2 is the closest game to it that I found during years. You can notice in everything around the game. The races, the research, the design, freighters... etc etc. One special mention for the ability to move the colonists around. I was showing the game to a friend and he almost cried when he saw it ;) But Stardrive 2 has its own potentialities: RTS Ship Combat, complex ship design, TBS Land combat, the humour, surprises... you have to play it to feel. And of course and not less important a polished and beautiful UI and solid and very good graphics.  If you like 4x space genre, you must own this game. Its the best by far in years.  When I think that this game its basically the work of one man, as a coder myself I only can think wow! Thanks Zero.",
            "review_score": "1"
        },
        {
            "review_text": "This game is exactly what I was looking for, it hits all the right elements for a deep strategy turn based 4X game. I am extremely pleased with it's depth (the tech tree is HUGE!), the various races and flavor text are engaging and often a bit humourous, and I have no doubt it will have a ton of replayability as a result. It's possible this game was once a bit buggy based on older reviews, but I can happily report that as of yet I have encountered no bugs at all, zero! This is the game that Endless Space should have been (but was too buggy to ever work right). The only thing lacking at the moment is more modding in the workshop. This game could potentially have a very long life with additional DLCs and more modding options, but even in it's current state it offers incridible depth and is extremely satisfying to play once you understand it's nuances. If you are at all fruustrated starting out, just go watch a Let's Play video or two on YouTube and it will quickly allow you to understand the game dynamics so you can dive in and have a blast. This game is worth it at full price and an absolute must purchase if you can ever see it on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Lovely game! True descendant of Master of Orion 2 BUT much much better!! I thought i would never see that but it's true. This one is much much better than the new 're-imagined' 'master of orion' that has actually no core mechanics of original master of orion 2 and just simplified boring another 4x for younger candy crush generations that can't concentrate on things for more than 10 seconds. This is complicated game but in a very fun and logical way and not in a tedious and unlogical way like Distant Worlds (thought it's almost ok for me game). Those who hesitate which game buy, try this one on evening with lights down and you not gonna regret, the music, graphics, events are so space magic.   Another thing, i see that many people are not happy about this game but i got this game only with sector zero expansion. So i never played it without expansion. So may be vanila game without expansion sucks, i don't know BUT i do know that the game with expansion is very fun and very enjoyable! Those of you who didn't try expansion, should try it and you wil change your opinion cause game is really fun.  Update: Game has mixed reviews. I found that unfair after i played it. I never played without expansion, so may be vanila game sucks, i don't know. But i do know that game with sector zero is very good, especially compared to other 4x out there. So the fact that game has mixed reviews is totaly unfair at this point. And it's a factor that don't allow new players to buy this game when they see that game has mixed reviews. I did't wanted to buy this game either.   I played stardrive long time ago and i hated it. So it was abandonded by dev who wanted to focuse on next one 'to make a great game from the start' I remember i was p_issed off and decided never to buy game again cause i thought it would same result. NOW after i played this wonderfull game, Stardrive 2, i understand that it was the only right desicion from developer's side, cause he couldn't focuse on this one (stardrive 2) if he had to use his time and resourses on that sh_itty game stardrive 1. So i am thankfull to developer that he abandonded old stardrive 1 to make this great game Stardrive 2, so that he gave us a lot of fun with this game (ofc i understand it has some minor bugs and so on but he works on them).   So as i said above i wasn't gonna buy stardrive 2 cause of stardrive 1 and another fact that stardrive 2 had only mixed reviews. We all know that mixed reviews make players to ignore games. The only fact that made me to buy this game was the 'new' master of orion from wargaming. After i read reviews on new 're-imagined' master of orion, i found out that developers decided to dumbify/simplify it for younger candy crush style generation players. They even tok away core game mechanics that made original Master of Orion 2 so great game for many years. So in their forum i read one commentar that Stardrive is true descendant to MoO2. And i decided to give a chance to Stardrive 2 though i had doubts.   After i have started to play stardrive 2 the only thing/person i was really pi_ssed of on was me cause i was angry that i haven't bought this game earlier)) This game is indeed true descendant to MoO2 but much much better at all aspects that i can see at least (the only thing that i am not totaly sure is ship combat, i like turnbased but must admit i like combat mechanics in this one a little bit more cause it makes it more alive for me to see and maneuver in real time, move defence ships forward, faster ships around etc - makes more fun than turnbased - i thought i would never say that;) But don't start eternal turnbase combat vs rt discussion - it's not what i am talking about here;)  So those of you who didn't play with sector zero expansion try it and you not gonna regret.   So those of us who are happy about game are too lazy to write review and that's why this great game has mixed reviews though it's a great game and fans of space 4x like MoO2 deserves to discover this game and have fun with it. So we need to give them such chance. To do that we need to write reviews on this. Good people, do not be indifferent or evil wil take over ;) Go write review on this lovely game!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. While I would reccomend it to people I have no friends who enjoy 4x games. The game was super hard when he released it but as I'm to understand the AI was given only what the player had. And since they can't build their own ships they have to use ones made by the developer and players.  Thankfully he's put in something for those who want to play a bit more casually by stopping the constant attacks by minor factions but I didn't mind the crystals or the pirates. It was the Master's.  All in all this is an amazing game. Good graphically, decent ground combat, ship building. Though if you're looking to get your butt destroyed then play this game on normal or above with the minor factions attacking you all simultaeneously. I'm not that much of a glutton for punishment.  Love the tech. All hail the tech. Diplomacy actually takes into consideration the empire's tolerance as well. Nice touch~",
            "review_score": "1"
        },
        {
            "review_text": "Worthy game, in the master of orion 2 spirit. And the ship design is one of the best ever. Very impressed of this game, specially since its one man developed, Thank you Zero! but overall its a solid game. 8/10. DLC released it was epic. :)",
            "review_score": "1"
        },
        {
            "review_text": "First of all, my recommendation only applies of u get the DLC 'Sector Zero' aswel! The DLC includes various patches for the general gameplay which u won't get through the base game (bad decision of the developer for the fans, a good one for profit)  This game is the spiritual new Master of Orion for me... even the MoO remake from Wargaming doesnt feel as much as the original ones like Stardrive 2. This could prolly change, as the new MoO is still in early access - but at this point: Stardrive 2 + DLC is the more polished, complete game :)  It looks OK - not that pristine tripple A quality, but it has a decent art design - but it contains a lot of the MoO features u're missing today, like mixing citizens from different cultures, creative research, ship design on a modular grid system and most important: Custom race in the style of MoO2 :)  I can really recommend this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Now with the DLC game generally feels greater. Let's hope that development will continue and game will be polished until final release.  If you are not satisfied with it try use some mods.",
            "review_score": "1"
        },
        {
            "review_text": "My Original Review had this tagged as a game to avoid, however i am pleased to be able to re-write this review and recommend this game.   The only reason for the change would be due to the authors rapid response to complaints and required work with the game.  To help out people planing to buy this game i have my Rig posted below :   Amd Phenom x 6  16Gb DDR @ 1600 Ram SSD Boot drive  Win7 64   The above results in good clean gameplay 90% of the time however very large fights can result in slow downs , or if you use ' carrier spam - More on that later '   The Good :   - Fun  - Large scale combat based 4x type game - Ship design is hella fun - Random events add spice to the game - The AI is challanging for experianced players - No 2 games will be exactally the same - All races are almost fully fleshed out - Ships look fantastic, get the paint job pack if you want additional eye candy - Runs relitively well  - You can make some very interesting ship designs , and the AI using the same side later will start using them ( helps you make a better mouse trap )  - If you ever played Masters Of Orion 2 the first 2/3'rds of the game are very similar  The Bad:  - AI can be psycotic , ' I the ai has 10 planets, you have 3 if you expand any more ill declare war , I the AI finds your breathing offensive war time , I the ai find i don't like your face hole , guess wot? , war!  - The slowdowns at end of combat can be frustrating, and can be up to 5 minutes, however you can Alt + tab out to do otherthings or talk to your family, get a coffee etc maybe its a feature ?  - The Tech tree is not finished and it constantly feels like things are missing ( currently only 2 engine types )  - Ground Combat is painful slow and boring , some of the ground based weapons don't even do any damage and is still awaiting a fix from past 2 patches  - Tracking / using ground forces is cumbersome, lift a platoon into orbit to fight on LV426 and the colony wont ' make more ' troops until its dead ? , if you put the platoon on another planet its still ' assigned ' to the last colony??? , but there is no ' ground forces ' overlay type interaction. - Due to the above its usally easyer to simply pound a planet into the stone age , land 1 troop take over and ignore ground combat entierly  - Lack of Ship hull types, there are only 5 per side and you can't add more hull types, which is a shame given the level of customization you can go to on each ship.  - There is currently a bug with assigning escorts to civillian transports that breaks the game  - No Incrimental save system, which would be good given the bugs  -   The above should help you decide to get the game now or later , the DLC's are good but a bit expensive for what you get, however as this guy is basicly a 1 man team why not give him some extra $$$ towards completing this game?   Having said that this game is worth the buy, but a little expensive currently for its current state if you have patience may be worth holding off 6 months and buying it then.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. I was shocked to see it had mixed reviews and realized I didn't post one.  I keep coming back to it over and over again because it's easy to fire up and play and there are so many races and types of ships to build it makes each game a new experience. Originally I thought of it as a modernized clone of MOO2 (till I learned it a little better) but... I hate to say it.. I mean I really do because I'm a big long time fan of MOO2 but I'm starting to think this game is actually superior to Master of Orion 2. It's just got more of everything that is great about MOO2 in a slicker and friendlier UI. I can't believe it was made by one guy. I guess sometimes one persons vision is better than an entire team of developers with conflicting ideas. I was looking to get the the new Moo early access remake and... ya know I think I'll just keep playing Stardrive 2. Expensive voice actors don't really make a great game, it's gameplay that make them great. Great gameplay is what makes us play various games for over 10 years like MOO2. It's not the fluff of cut scenes or voice acting. It seems Zero understands that.  I think this game gets some negative reviews or is called 'incomplete' by some people is that they expect the game to have some kind of splashy story and a easy 'story mode' setting.. and that is not really what this is. This game is about terrific 4x gameplay in the vein of old style gaming (like moo itself). You will not win every game and that is a good thing because it puts the pressure on an makes you take risks. As far as bugs go, I haven't really noticed any serious ones but I play it on Linux so maybe it's more stable. In all the games I've played maybe it's crashed a couple of times.. big deal. (I've seen major titles that are waaay worse,)   Pros: * Great ship design. * Tactical ship combat is really good. * The UI is friendly and well thought out. * Planet management is fairly easy. (compared to Moo2) * It has a lot of cool races each with their own unique ships that is more than how they look they actually affect what weapons you can research and equip so various things work better on various races. * Customizable galaxy with random things to discover in it. * Sidequests that open various new technology and can impact your builds. * It's very challenging. (I play on hard or brutal mode usually) * Plays great on Linux. * High replay value.  Some things it could improve on: * No DLC! - Seriously zero take my money. * Occasionally (on my hardware) the game slows down on 100-200 ships shooting it out. (w/ thousands of missiles or fighters especially) * Ground combats pretty basic. (tho better than MOO2) * Spying could be abit improved. * No Stat system or charts to see how your doing. Sometimes you feel a little blind. * No peaceful solution. You have to kill everyone. (tho diplomatic win is kinda meh..) * No real ending. You just win. (I wasn't expecting much but nice victory screen or stats would be nice) * Some of the larger ships are not symmetrical and have more space on one side or the other. It's an oddity..   Haters be dammed.. this game rocks. If you like 4X, it's a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Easy is OK, but still even easy needs balancing espec. in the beginning. But besides the difficulty issue it is the best MoO2 clone so far, meaning it is 70% a copy of MoO2 in modern graphics. This I mean in a positive way.",
            "review_score": "1"
        },
        {
            "review_text": "The game is quite good. Good concepts, lots of strategic elements that need to be paid attention to. ",
            "review_score": "1"
        },
        {
            "review_text": "Having played and enjoyed Stardrive 1, I've been looking forward to Stardrive 2 for quite some time. On my first few playthroughs I was slaughtered quickly... but I learned what needed to be done, and got better. This will likely be your path as well, but if you stick with it you'll find a fun game you can drop quite a few hours into. It has that 'one-more-turn' feel that I love. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "i must say this game is very entertaining and fresh with good support and new features and fixes being added at a good pace this is easily one of my favorite games to play 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm enjoying Stardrive 2 like no other 4X space game since the original Masters of Orion. It's brilliant.   Difficulty  I'm playing it in 'easy' to learn the ropes and have disabled the random space creatures and pirates from attacking. This option helps avoid early fledgling empires from being crippled by an early attack by the random spawns in the galaxy. I reckon the difficulty for 'easy' is about right now - since a few minor patches to adjust the easy difficulty level. Great support from the development team hear. I wouldn't be put off by it being to hard.   Why i like it so much       The complexity is about right. There appears to be loads of depth across the different aspects (economy, tech, fighting, expansion, diplomacy, espionage etc.) but no single aspect is hard to understand or control.     The ship battles are brilliant. They give you enough control but don’t require excessive micro-management, they are pretty and you get a good feel for what weapons and ships work, and what don’t.     The ship designing is excellent and not too time consuming. I usually get put off with designing ships because it's often too tricky to make the link between what you design and seeing the effect of those designs. Not here: as stated above, you easily get a feel for what works. Furthermore, you get plenty of information about how much power, ammunition, engines (etc.) you should be adding so you can ensure you don’t deploy something that just won’t work.    Diplomacy seems to work. I can easily understand what something is 'worth' and can make effective decisions around what to trade and what not to... Again, the game provides you with the information you need.    Sense of humour. The game doesn't take itself to seriously.    Ground combat. I think there should be an 'auto' option (i don’t think there is one), as long term I’d want to auto fight ground combat IF it occurs frequently. Hmm. That sounds negative. I like the ground combat mini game, it does it's job, but it's not what I *personally* want to spend my time on. Overall though, it's a positive inclusion.    Exploration is fun! There's plenty of variety and strategic resources etc. that no game will be a like. The strategic resources are all worth having and give noticeable bonuses.    It's stable. I’ve not had any stability issues.    It's not 100% perfect yet. There are a couple of minor annoyances such as not being able to see the plant population cap when viewing your planets list - its a rare case where you don't quite have all the information you need. Also, sometimes your planet will say 'starving' because it thinks it's short of 0.5 food, but actually it's not having a negative effect.  I hope this review helps! ",
            "review_score": "1"
        },
        {
            "review_text": "After having seen the troubles surrounding Stardrive I &amp; II, I was still curious and picked up Stardrive II on sale.  Long story short: don't let a lot of acid and bile on the forums stop you from trying this. The series has a troubled history, but denying yourself is only punishing you. I don't know what really happened, but people get REALLY pi**ed off on internet forums - we know this - you'd think they spent their life-savings, their left hand and a firstborn child on it or something, rather than a handfull of quid (I picked it up for a little under seven).  Its not perfect, but it has all the solid staples of a good 4X, is very pretty in parts and has some unique selling points of its own - the ship designing is fun and effective for example, and the turn system is different.  It *is* a bit too obvious what television programmes the developer likes to watch though... Gold-pressed Latinum? MalFillion? Breaks the fourth wall a little.",
            "review_score": "1"
        },
        {
            "review_text": "Still searching for the perfect 4X in space? Ya me too. There's lots to like about this game but the game still has a few warts.   Pro's:   1. Ship design and ship combat. Personally from a Realtime perspective I don't think there is a current game that does this better. If you like TBS combat look elsewhere but I think this game makes a valid case for the transition to realtime combat in space 4x.  2. Race diversity. I think the species that are in this game add a fair bit of flavour. I know the moo races will always have a special place in my heart but these are pretty good.   3. UI in general is clean and bugfree.  4. Planet management is decent and not overly tedious.  Cons:  1. Ground combat.....ugh.....its hex based ground combat. Why or why after making the wise decision to go realtime for space would the developer go with hex based combat? It's so tedious and not fun. Fortunately its not a major part of the game.  2. Diplomacy is rather weak in general. This is a flaw in many 4x games except for a few. This game is strictly centered around winning through attrition. One path to success. The game feels a bit linear in the approach in this sense.   Overall. I'd recommend the game but it leaves me wanting. Combat is great but Diplomacy/victory conditions are just as important and the ground combat is the bitter pill to swallow in between.     ",
            "review_score": "1"
        },
        {
            "review_text": "Early review:  As many of you MoO2 is the standard I still judge 4x games up against. Most of them fall short. I enjoyed SD1 - but it was incomplete.  I started my first game of SD2 on normal, and it was hard! Hard in a good way! It felt awesome to have a game challenge me like this. But it didn't break me. It was hard in the right way. I'm still in my first game now 6 hours into the game and enjoying it immensely!  I've played most space 4x games out there - and this is so far my favourite. Brilliant work by the developer.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game i really strongly recommend. Think of master of orion 2, and add all the new jazz modern pc games have to offer. What you get is this game, and if you liked the original moo2, you're gonna love this.  Now i've read the reviews before buying this game, and in most of the negative ones people cried about the game being too hard, about the ai cheating, about them dying the instant they meet anyone. I played the original master of orion a lot, and i must say that i had no problems holding my own. Yes, the pc is overagressive if he has a larger fleet. But as others have said in ther reviews, it is usually just a load of junk. Having a few decent ships, it was no issue to shoot that junk down and have enemy sue for peace.  There is one slightly irritating issue, although it's hardly keeping me from enjoying the game. The GNN and ground missions have text written letter by letter. I assume it's because my pc isn't top-notch anymore, but it takes ages for the text to appear, much slower than my reading speed anyway. And after a click it's gone. Now what i've seen in other games that used this letter-by-letter style is to use the first click to complete the text, and second click to move on. This avoids frustration in fast readers / slow pc owners.  In any case, if you liked the master of orion series and the original star drive, this is the perfect blend. Highly recommended.  EDIT: After playing all the way through a game twice, I find it really worth the money. However there *is* one issue with planet management I see in late game - there are just too many structures I want to *build on each new planet*. Right now I avoid colonizing additional planets just because it would bring low benefit for much clicking - which is a wrong choice strategically.  A very nice solution I've seen in one of the fan-made old civ games is - *templates*. Imagine there are cca 4-5 templates defined (template 1, template 2, T3, T4, T5) and *the player choses what this template will build*. After that a planet can be assigned to 'build' 'template 1' and will start filling it's queue with stuff that is in template 1's queue.   Now the obvious advantage of this approach over ministers is that player has complete control over what his planets are building, while *saving tons of clicking*. Plus when a new building is unlocked, there's nothing easier to add it to template 1 and have all planets using it build it.  Example of this template approach can be found in an old fan civ game 'C-Evo'-&gt;menu-&gt;macro management-&gt;city types.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked MOO2, you will probably like this game. It may be because I'm running OSX, but I haven't experienced most of the bugs people are complaining about. The few that I have seen were fixed with a few mintues of googling.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with good replayability. Awesome support!",
            "review_score": "1"
        },
        {
            "review_text": "So far, a really good second part. I already liked the first one but this part is more fun :-) Also I like the music. Good work there, too :-) *Thumbs up*",
            "review_score": "1"
        },
        {
            "review_text": "I satt down around 12Am.........now its 07:21 i I REALLY HAVE TO SLEEEP... GOD DAMN ITS GOOD",
            "review_score": "1"
        },
        {
            "review_text": "I haven't seen a game with this much genuine content since fallout or metro 2033, dare i say half life. It's about time space RTS games got some original creators. Everything in this game is so smooth and intuitive, clearly made by someone who enjoys the expierience as much as i do. this really blew me away, and i don't write reviews. I had to try to stay quiet when i was defending earth from enemy battleships with my sqaud of 10 corvettes lol. two thumbs up definatley",
            "review_score": "1"
        },
        {
            "review_text": "i have to say im surprised , it is a really solid game the UI is simple yet very similar to other 4X games (which is a good thing , makes it easier to understand) - somewhat more polished then some 4X games out there i would love to have more planets on the star map (the current maximum is 100) but if you play on spiral the distance is big enough to make the game a little longer the AI doesnt seem to have a special advantage over me (so far) so thats a plus Colonizing and managing colonies is simplistic which is fun since you dont have too many statistics to follow Ship design is easy but i wish we had more Styles per class (IE several types of cruiser) like we had in MOO2 its even somewhat moddeable - so it would be fun to watch what awaits us in the future  and since i mentioned MOO2 , this game remindes me of MOO2 so all you MOO2 lovers out there , you can give it a try  the price is a little high i know but its a fun game so far , if you have some money to spare this is a nice choice",
            "review_score": "1"
        },
        {
            "review_text": "My empire is made up of samurai space-bears, my head scientist is a hyper-intelligent elephant, the neighbors a star system over are four-eyed, green tigers, and our greatest war hero is an owl with a bandana and a railgun.  Either this is the most unique setting I've seen for a 4x in a long while, or I've been doing LSD at the zoo again.",
            "review_score": "1"
        },
        {
            "review_text": "StarDrive 2 is basically Master Of Orion 2 (MOO2), one of the best space conquest games of all time. It does a very good job in helping you relive those glory days before the marketdroids at the game companies came up with the stupid term '4X'.  Anyway, StarDrive 2 is NOT stupid, it's in fact a very enjoyable game. However, where MOO2 fell short - diplomacy - is where I find SD2 to have a similar weakness. Just like in MOO2, there's always one or two races out in the galaxy that are hellbent for war, and really just don't care what you think, and they're going to build up a huge fleet and come dig up your entire planet's lawn and pave it with concrete - after they burn down your entire civilization and erase all memory of it from the collective universal consciousness, of course. An alien's gotta' have his priorities, ya' know!  That said, if you loved MOO2 despite it's flaws, you'll like SD2. It's worth it, and just like MOO2, this game will suck away your real life time faster than the Millenium Falcon doing the Kessel Run.  7/10 parsecs.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game - a good successor to MOO2. In fact, I think the developer is a huge Star Trek fan due to many 'similarities' - which is fine. Hope for a star trek mode done by some experienced modders.   stability = 9/10 look &amp; feel = 10/10 space battles = 9/10 ground battles = 5/10 ==&gt; one day maybe as in X-COM - the perfect mixutre system management = 8/10  additional missions = 7/10 Overall 9,5/10 - if you loved MOO2   you´ll enjoy this one - support the developer who did it, a great piece of work. So invest your money, it´s worth it.   As a client I´m satisfied with this product.",
            "review_score": "1"
        },
        {
            "review_text": "I am and will always be a great fan of Master of Orion 2. It was my first CD game and I treasured it and spent days playing it. I have seen many iterations of developers trying to recreate what made it special. Though this game is not identical it certainly is very very enjoyable and I look forward to playing it :)",
            "review_score": "1"
        },
        {
            "review_text": "First game, lasted only 30 minutes due to starvation and pirate fleet attacking my underwhelming fleet. Second game, Did better as the Vulfur (wolf guys) and started to capture planets and systems but met the humans, was promply eradicated.  Third game, made a tiny map to think it would be easier to expand....I was wrong. Forth game, made a medium sized galexy and set it to 4 races, they gang banged me into a corner but I proudly held them off. Was killed later by crystals. Fifth game, started to learn the basics of the game at that point and got into the groove of it. Managed to control half the map till pirates started to attack my homeworld from the edge of the map, couldn't get there in time and soon whole race died.   Eventually I'll be able to win one game but even still, I'm having a blast playing it. Sure, it may be a dumbed down version of it's first title but thats good for someone like me. I feel this game appeals to both hardcore 4X gamers and those just starting out. For me, its a must buy and sure, there may be other 4x titles out there but that doesn't mean this isn't a great game either.   P.S. I know I don't have a lot of time in the game. It's due to my college work but I will be spending a lot more hours in StarDrive 2.",
            "review_score": "1"
        },
        {
            "review_text": "Pleasently surprised, I'd bought this game when it was on sale, but never installed it. Finally installed it with 1.1e's patch release, significant improvements over Stardrive 1 (which I'd just played a few min before jumping to SD2). Admiditly haven't dug into it very much, but My main complaints about SD1 have been fixed. Interface is slick, easy to use and the new turn mechanic and space fighting is vastly improved!  Definitely worth the money, closest thing to Master of Orion II I've seen yet! also some great pop-culture references, and homages to existing Sci-Fi universes (Crystaline Entity, Crazy Eddy's cars etc etc etc)",
            "review_score": "1"
        },
        {
            "review_text": "If you are a Star Trek or Civ V fan you will probaly enjoy this very much. 5/5 :]",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that can truely call itself the new Master of Orion!  That its this good while still in development is a great sign and I can't wait to see what updates come next.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun game. While people complain that it is bad because it isn't like most 4X games, they are wrong because it is trying to be something else. It is more akin to Total War in space. Saying Total War is bad because its not Civ is not good review. If you are looking for real time space battles where you design your own ships, have good visuals, and decent strategy map then I highly recommend it. Ground combat could use some work, but you can just auto resolve all of them and focus on space.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun game. While people complain that it is bad because it isn't like most 4X games, they are wrong because it is trying to be something else. It is more akin to Total War in space. Saying Total War is bad because its not Civ is not good review. If you are looking for real time space battles where you design your own ships, have good visuals, and decent strategy map then I highly recommend it. Ground combat could use some work, but you can just auto resolve all of them and focus on space.",
            "review_score": "1"
        },
        {
            "review_text": "A great evolution from the previous one, Stardrive 1 had its unique gameplay in a 4x game, with mods it shined! Now Stardrive 2 is a masterpiece, bringing back memories from old classics like Master of Orion. A great game for those who want a chalenge, the A.I is solid and will put you on your knees, struggling for survival. The best on the genre.",
            "review_score": "1"
        },
        {
            "review_text": "The amount of content that is taken from previous games makes this both a attraction and kind of a hum drum. If you played the older games in the past you are looking for a modern version of them. This feel more like a remake than a new 4x.   I like alot about the game, and if you are looking for that feeling of MOO2 but more modern this gives you some of that. There is no multiplayer. And Ground combat is lacking... Bugs in the game make i difficult sometimes...  Arena seem to harder than expected, or I just lack understanding of how it works.  Overall it is worth the money, and if you are looking for a quick get away / reminder of the past it is great, but don't expect to have a full blown balenced 4x. Its just not there yet.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blatant ripoff of Master of Orion 2, but in a good way. It's more like what Master of Orion 3 should have been. Also borrows slightly from endless space with a dash of x-com. Pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "Getting better. Really like the shipbuilding, combat and heroes.",
            "review_score": "1"
        },
        {
            "review_text": "I will start by first saying I am allitle Biased. I loved stardrive one, it was easilly my favorite game durring that period and I sank hours into it. When I heard that they were making a StarDrive 2, I thought it was going to be a money grab. I was a little dissapointed. I am glad to say that I was pleasently wrong.   Looking at StarDrive 2 on its own merrits, I enjoy it a lot. To me the best part of the game is the customizable ships. While some parts are more simple then Stardrive 1's but it works. What they did with the randomish quests and story elements really reminds me of playing Masters of Orion Two with a updated UI and real time space battles. I would recomend this game to people that are a fan of space combat games or Masters of Orion. If you are looking for a clone of the first game this is not the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I read alot about people saying this game is too hard and how the AI is too agressive. Well, to be succesful in this game, u need to understand how ship design works. its not that hard to figure out and its alot of fun, the best ship designer in any 4x out there hands down.  If someone says the AI is too hard on easy setting he has obviousely not understood some of the crucial mechanics! (many of those reviews have less than 10 h gameplay which kinda says it all)  Now to my experience: Pros:  -The game mechanics are strongly inspired by moo2 and it could easily be considered the first true succesor -The graphics are pretty and the alien races have alot of character to them -Shp design is super fun and meaningful, way more compelling than any other 4x -The AI is pretty good which is a huge deal since its a SP only game and thus will add to replayability alot  -The game is, unlike many other games, in a polished shape in terms of gameplay and stability. It hasn't crshed a single time for me -The developer is passionate about this game and working dedicated to make it better  Cons: -Ground combat can be tedious and auto resolveing it can lead to bad results -Compared to SD1, ships are smaller and the designer is more streamlined -No MP yet (i think there is a fair chance that we get it later though if the game is succesful)  8/10 Could become a perfect 10 with more content, mods and MP",
            "review_score": "1"
        },
        {
            "review_text": "Best 4X stuff since  Master of Orion 2 !  Great 2D art, huge space battles, fun races to play or fight. Some strange bugs but the  dev is at work  to fix them.  The parts that are  modable  at the moment are very easy to mod, waiting for more to come on that end. Made my first ever mod of anything for this and it is dead easy.  I have the feeling i will stick with this game for quite some time.   If you are in to some of these:    space   strategy   diplomacy   not to easy games   funny aliens   lasters   sifi references   slavery   mass murder   trade treaties    peaceful coexistence    wormholes   backstabs   clicking the 'turn' button    Go buy it! ",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy the game, but it's almost a copy of Masters of Orion! seems the name and faces of oppenents are changed , the skills are somewhat the same with different meanings, although building of ships is different. You get heros, and allowed only 4... and seems the AI is bias towards you, because no matter how fast you build, you are always outnumbered. Your enemies seem to always attack your weekness even not knowing what in your territory. It seems as they always have your armada outnumber as well. Not saying i want it to be easy, but would like to have it as equal to get a honest fighting chance. Traiding seems to be boring, it seems if your opponent don't get the upper hand in the deal, there no trade. So what good is that! Even if you trade with them, a few turns later they are asking for tribute, if you deny , then war! Useless! For the price, the graphics could have been better, i paid for the digital deluxe, and i was able to put color on my ships, however there only 4-5 selection you may choose from. Sound track is ok, after playing it for awhile, you need to turn off because it becomes overbearing. The game runs smoothly, i played without any crashing, so I give that a thumbs up.  Just wish there was more to it, explorating is a joke, your ship can only go so far, and its a small universe too! If your playing the biggest map, unless you find wornholes then build a gas station to go futher, there no need, the AI has taken up the stars for your rivals. It seems that thier plot of space is always larger than yours! Recommend for thoes who never played Masters of Orion, but for thoes whom played that gave, no! ",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot going for it. The ship design is excellent.",
            "review_score": "1"
        },
        {
            "review_text": "This review is actually negative, but I still recommend the game... I never liked real-time 4x games, but SD 1 really changed my mind. I really loved SD 1, I think it was absolutely the best space 4x of last years. So I bought SD 2 without any thinking and even not reading the description, I just knew it will be fantastic, and feel that I never was so wrong...  I have found that game is TURN-BASED, and I think this was worst decision ever, sorry. You have to find another name for the game if you changing so much, because SD 2 feels absolutelly different and destroying all the magic which I felt in SD 1. In SD 1 I have seen universe which is alive and realistic with all those ships slowly moving to new stars. But, must say it again, I had to read before buying and this is why I can't blame developers, just very sad that so great game will not get proper sequel and I have to play SD 1 again or wait for something else.  Other than that game looks nice, but not polished enough (especially UI), in time it may become a good turn-based 4x space game...",
            "review_score": "1"
        },
        {
            "review_text": "StarDrive 2 has the same vices as StarDrive, though to a lesser extent. There are peripheral areas of the game which feel rushed or unpolished, not for lack of effort as I understand it, but lack of manpower. Unlike SD, the mechanics and overall gameplay is SOLID. I liked SD but there are segements of that game which were flawed.  Diplomacy is much more responsive and worthwhile in SD 2. The different factions in StarDrive have a lot of character and its something you actually want to engage in.  Not feeling the need to slow down time to a crawl in order to micromanage every detail of a star-spanning empire, is great. While I miss combat actually happening on the stategy map, turn-based allowed the rather spartan and unwieldy management aspects of the game to flower.  It can almost go without saying that StarDrive's defining aspect; ship design and combat have been developed, honed and polished to outshine any other 4X. It moved ahead in leaps and bounds, and it is fun, fun, fun. The are more options and everything is really slick. On top of that, there are special technologies and components you acquire outside of the actual scientific tree through various means. Some are stellar, others feel gimicky - which isn't a bad thing. The only addition I don't like is the proto-molecule device which is underwhelming - not because it underperforms, but because it is pretty superflous and there is a sizable build-up to actually getting it. Also because the mechanics which underpin it are perhaps the one weak point in SD2's fleet combat  It highlights the one real complaint I have with shipboard weaponry in the game. Ships can carry massive Subspace Artillery and Mass Drivers which by any yardstick should be able to get the job of bombarding a planet done. Instead ships have to carry a seperate arsenal of otherwise useless weapons, which take up precious space, in order pummel planets into submission. It is extremely arbitrary, especially one one considers that tactical and strategic nukes are available form the very start of the game - long before any sort of ground-based counter is available. A doom fleet in orbit, armed to the teeth with kinetic weaponry and only able to 'blockade' is a sorry spectacle. Maintaining planetary defenses on more than a few planets seems prohibitively expensive, even of it wasn't useless because most of the AI strategy is based around landing troops anyway.  At times playing on defensive boils down to playing wack-a-mole with invasions fleets amongst your holdings. That will probably be alleviated somewhat by wormhole junction forts and other defensive options in the 'Sector Zero' DLC.   Planetery invasions were unwieldly (in capital letters) in SD1, and while massive focus has obviously been put into tactical ground combat in StarDrive 2, it feels tacted on and doesn't really add much to the experience at this point in time.   Overall though, the game is fun which is to say that what it does well, it does really well. The feature set it touts is there and it is solid. It is the little things where this game looses ground. I dwell on the little things a lot, but that is nitpicking. This game deserves a much better rating then it has.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so thoughtfully put together and skillfully crafted. It's a remarkable addition to the genre and an absolute blast to play.",
            "review_score": "1"
        },
        {
            "review_text": "i think its a fun game... recent patch has made normal AI a good game...  just different that the last star drive...   remember to build many units...",
            "review_score": "1"
        },
        {
            "review_text": "So far, pretty fun.  I enjoy the turn-based breakdown of this game. In the first Stardrive, it was not uncommon for me to forget about one of the many moving parts of my empire and accidentally stagnate somewhere. The turn breakdown helps me keep track of everything and manage my empire more effectively. All the old familiar faces are back, plus one new race. To be honest I hoped there would be more and a little more variety in the AI personalities, so far everyone just wants to go to war with me.  I like the inclusion of extra events going on in space, it's just hard to go and investigate some of the phenomena I encounter when everyone around me wants to go to war.  There are some bugs though. Mostly sound bugs and they'll destroy your eardrums if you're not careful! I have my audio set at 4 freaking percent and the music played when I discover a new technology could wake the dead! The sound effect of a fleet exploding is also ear-splittingly loud and the beam weapons used by the crystal shard ships are also set to deafening volumes. I noticed many of the space battle sound effects are turned up far above everything else in the game.   I also noticed a bug! Sometimes when I complete a space battle, the game freezes while loading the turn.  So far, yes I'd reccomend the game. It's fun and can be pretty challenging. (First game I played I spawned in the center of the galaxy with no colonizable planets nearby and was surrounded by warlords who want my stuff.)  TL/DR: IF YOU DO WANNA GET AND PLAY THIS GAME TAKE YOUR HEADPHONES OFF!!! That's my only warning! Some sounds will break your ears! Otherwise is great game! Lots of fun! I will be updating this review as I play!",
            "review_score": "1"
        },
        {
            "review_text": "Ill start with $30 is a little pricey for all the faults this game has.. HOWEVER it does have sever good things going that should make this game be on your pick up list.   -Ship Customization is amazing. Many different weapons and upgrades. At times almost too much! I found myself designing ships and thinking 'OH! I want that on here too!' lol -You dont have a real restriction on how many ships can be in combat at one time. One play through I found myself sending what I thought was a large fleet with several Titan size (Largest ship available) ships into a star system to encounter an enemy fleet. When we got into combat I found I was out numbered like 6 to 1. This DOES cause problems performance wise. I have a very good PC and still had bad issues. It wouldnt start till all the ships began firing.  Some weapons like the cluster cannon shoots a projectile that bursts into several peices before impact. When 40 ships are all firing different projectiels performance just plumets.   I realize this sounds pretty negative, thats my only real issue with the game. Past that you have several interesting side type quests that spin things and keep you wanting to just run 'one more turn. The modding community for this game isnt large but I have seen several on their forums that make this game even deeper as far as features go. Which is crazy! With steam allowing refunds now for games played under 2 hours I highly suggest you check it out. Its work it ",
            "review_score": "1"
        },
        {
            "review_text": "Okay so when I first purchased the game many months ago and played my first rounds I was not impressed. Now that the bugs have been fixed and the content is sharper this game is really fun and has great depth. There could be a few things to make it even better like the UI screen of the planets where you can see trade ships and commerece ships flying around just to make the world come alive even more. I am sure the developer will be adding that later becuase I have seen so many changes and additions over the past year and all of the have been great.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, except for the command points they kind of ruined that game for me.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so when I first purchased the game many months ago and played my first rounds I was not impressed. Now that the bugs have been fixed and the content is sharper this game is really fun and has great depth. There could be a few things to make it even better like the UI screen of the planets where you can see trade ships and commerece ships flying around just to make the world come alive even more. I am sure the developer will be adding that later becuase I have seen so many changes and additions over the past year and all of the have been great.",
            "review_score": "1"
        },
        {
            "review_text": "I found this to be a fun an interesting game. very simalar to MOO2, but with some modern twists.",
            "review_score": "1"
        },
        {
            "review_text": "One thing I find odd about some of the negative reviews is the fact that these fellows have 80+ hours of gameplay... Obviously, we've got some sort of love-hate relationship going on here. Anyway, the game has it's bugs and problems so if you consider yourself impatient, don't buy it. One additional thing I recommend is trying out one of the mods on the stardrive forum.&nbsp; A well done 4x game that can be rough around the edges.",
            "review_score": "1"
        },
        {
            "review_text": "Before everyone takes a steaming dump on this game and complains about zero being some kind of fraudster you might like to compare this game to paradox's newest release and see that they borrow from this game in many ways.  This game will kick you ♥♥♥, and make you wonder why. Then, after a few tries you will get the hang of it. Try to keep pace with the 1 big and donminating AI and you should be in with a chance.  As for the galactic map, works well. -Tech tree is very interesting and options would be more restrictive if you didnt just trade it all back with AI. -Ship design rocks balls end off story. -Unique heros are quirky and fun. -Economy is hit and miss. sometimes i have loads of cradits and in other games i have f-all - and that before i build my fleet up.  I watch quill18 play STELLARIS and thought, thats almost identical to stardrive2, with a paradox twist (which is to over complicate things). If you are into the same kind of experience and less paradox skull ramming then you wont be dissapointed with this game. Once you know how to build your ships that is.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this game is completed by the DLC. Although a bit of a questionable move, I can understand why the developer has chosen to go this route.   The DLC makes the game much more fun, the addition of the hex tiles means sensor range is more sensible now and the construction ships offer an additional gameplay mechanic with more resources to control. The new ground combat is much better and more suitable for 4X games.   Please don't be put off by the learning curve, even on normal it will take a few games of getting your ♥♥♥ wiped on the floor by the AI before you learn how to take them on. What's great is that everyone will develop their own strategy naturally.  My one gripe is the AI. Now I like diplomacy in 4X games but you HAVE to keep in mind that the AI is also trying to win and there can only be one winner. As soon as the AI thinks you're weak, they will take advantage. My advice is to avoid AI until you can defend yourself but be warned, from mid-game onwards the AI will produce fleets that will literrally take up the whole screen before the battle starts, so build a fleet you think will be of adequate size, then make it tenfold.  Also, try not to use the default ships as they're a bit lacklustre, make sure you take the time to experiment in building your own ships.  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Stardrive 2 requires holding down the 'Control' key when clicking the 'Play' button in steam when using a 4 K resolution TV or monitor. This brings up a menu allowing the user to select custom resolution, and choose full screen or windowed mode. Failing to do this the user will get a blank screen with a mouse cursor and music playing in the background. Nothing to click on. Hopefully the developer will address this in a future patch.  The game looks visually stunning on a 4 K resolution Ultra HD TV. The sound loops are pleasant and unobtrusive.  Stardrive 2 is a generic 4x turn based game with research, exploration, expansion and extermination or assimilation. The implementation is good, the game is fun, and there is a lot of customization possible.  This game is well worth a look, especially if it is on special discount. It may not be the 'Best' in the genre, but it is pretty ok and is worth investing some time to play.  6 / 10",
            "review_score": "1"
        },
        {
            "review_text": "I augmented Tyrannosaurus Rexes to act as soldiers for the human empire.  11/10.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game that balances accessability and complexity in an enjoyable way. I love the feeling of exploring the great unknown, and sometimes blowing it up :) My hope is that more modding support is added as it is also a great framework for a lot of gameplay possibilities.",
            "review_score": "1"
        },
        {
            "review_text": "Daniel pretty much fixed everything that was bothering me in the first game, but I do hope he keeps fixing and updating the game post-release. The only thing that REALLY bothers me at the moment is the lack of proper long term peace treaties and alliances in the otherwise vastly improved diplomacy screen. It gets a bit samey if my only option to win the game is to wipe out everyone else, and having to constantly renew the numerous short term non-aggression pacts and trade treaties gets a bit annoying after a while. So, please add more long term diplomacy options (only available with good very good diplomatic relations of course) and I will be extremely satisfied with the game.",
            "review_score": "1"
        },
        {
            "review_text": "StarDrive 2 is the most fun ive had for a long time with a strategy game, the ship design mechanic is its best novelty and this really allows you to combat any threat that comes at you (and there are a lot). It really makes you feel proud when one of your designs obliterates your enemies, or some fancy tech you researched saves your ♥♥♥. This alongside the customisable races gives an extreme level of diversity and really makes you the ruler of your own empire, not as though you've simply been given to you to take control of. The game itself is fun and enjoyable and I recommend it highly, however although graphicly the game is simple, theres a lot of hidden calcualtions and which really slow it down, as I do not have a powerful PC i thought this game would work well ( SOASE works fine with huge fleets) however this does not. As a word of warning to those with 'Family Pc's' it will run, but slowly.",
            "review_score": "1"
        },
        {
            "review_text": "Yeh its actually pretty good. I was kinda put off by some of the reviews and streams but after i put some hours into it i can say most of those complains are a l2p issue. My only complains would be the relative small size of even biggest galaxy maps and the uninspiring ground combat. And i actually find it rather easy on normal and thats on my first playthrough :p  Shipbuilder is one of the stand out core features and as far as i can tell diplomacy is pretty good too, that combined with the tactical space combat is great fun to tinker arround with. Also i cant share the concerns about the limited techtree ( pick 1, discard 2 others), it actually rewards good desicion making and gives more weight to diplomacy and/or spying.  Thou gota put more hours into it to see if its well balanced all arround and how the 'endgame' unfolds.  So far i got the 'One more turn' illness alrdy ! Too bad the only way to finish a game is to wipe the floor with all other races it seems.  If u own Stardrive 1 alrdy and got the discount, yeh pick it up.   And protip: reading the tutorials and tooltips definitly will help your expirience",
            "review_score": "1"
        },
        {
            "review_text": "This is the MOO2 sequel you have been looking for. With Space Hulk added in for some reason.",
            "review_score": "1"
        },
        {
            "review_text": "Yesh yesh, if you love 4x, this is fine, some weird bugs, but enjoyable game anyways.  The shipyard design is lovely, 1000ish of choices...and the voise in my head...game on, take another system...oh my. 6/10 on a bee scale. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Its not a hard game, you just have to get the hang of it. All of those people saying the enemies are too hard are probable just bad at ship design. One said there wre unstoppable alien ships at turn 30. In my last game i had the strongest military in the galaxy with only one small fleet because I designed my ships from scratch. Its a great game. Now all I am waiting for is a few bug fixes and I will be even more happy with it.",
            "review_score": "1"
        },
        {
            "review_text": "TLDR: Get it for $10 or less until the develpoer fixes some things.  Sound: 7/10 Not bad music, not great but random enough to not be repetitive. Some of the tunes are catchy. Need better beam and cannon weapon sounds IMO, maybe more rocket sounds. Gameplay: 8/10 Bugs need fixing and balance needs working. Interface: 7/10 Some real good ideas here but some tooltips are  way  off. Graphics: 8/10 Pretty darn good! Not many better ones graphics wise out there. Replayability: 10/10 So many options between races and the ability to customize said races. (like Endless Space) Different techs and ship builds to try.  Okay so here goes the long version. Is the game fun? Very. How would I describe it based on other games? A  very  good mix of Sword of the Stars and Endless Space, but single player.  A bit more detail on the gameplay... there really needs to be some form of diplomatic victory. I was actually very surprised to find out the only way to 'win' the game is to annihilate everyone else. There aren't even alliances so to speak. I mean you can make another race love you to pieces by throwing gifts at them constantly or making real good deals with them but in the end you  MUST  turn on them and kill them. I really like the 'masters' (not oging to spoil it) aspect because it's something new. Other than that it's another new 4X space game that is made very well. A lot of people complain about the ground combat, it is somewhat buggy but not terrible. Think Heroes of Might and Magic for the ground combat and you get the idea. Minus the hero. Now ground combat... what's the point exactly? Other than doing some side missions along the way you never need ground units. You can nuke the planet from orbit and given the right wepons there won't even be any fallout or anything to deal with before you sprout a new colony there. You  can  take over the enemy colony through ground combat and keep their workers and such but it's better to just grow your own over time so you won't have conflicting race issues killing the happiness.  Balance wise.. it's kind of sad when you figure out your best bet is to slap on as many Disruptor Cannons((turret version) which are pretty low tech) as possible and the only thing really better is the 'ultimate weapon' I won't spoil. You'll want a few beams to take out 'pest' ships like fighters but other than that... Disruptor Cannon spam FTW.  For the bugs, oh boy.. Here's an example. There's a construction ship you can build and (without tech) it can deploy into one of two things. Either a refuling station which is kind of obvious or a listening post which is basically a large area stationary scout. Now when your ships run out of fuel they automatically make a bee line at half speed for the nearest planet or refuling station right? No no, apparently the listening post will also fuel your ships and never run out either soooooo.... what does the refuling station do again? Maybe I'm missing something but I can't see how this is intentional. Another bug I have often is the inability to refit ships. You can select a ship you have and select an updated model and send it to the nearest planet for refitting but I have a bug often where it just won't let me refit them, instead of doing anything when I hit the button to refit it just unselects them and nothing happens. Reloading the entire game fixed this once but not always.. Another problem I ran into that was extremely frustrating was I got into a ground combat at my planet where, right in front of my starting line, was an incline which blocked line of sight completely for my  stationary  defense turret, making it completely useless because it couldn't even fire on the square in front of it. The LOS issues are real bad due to random(I think?) terrain layouts being seriously against you.  The tooltips need some major work too. There's a structure you can get through tech that deploys from a construction ship and acts as a 'space highway' to move your ships around faster. Only the problem is the description leads me to believe you deploy two of them and it's a 'start and end' scenario and you can redirect them (selct a new end point I guess?) based on the tooltip but that's not at all how they work. How they  really  work is you deploy them all over the place and they have an 'area of effect' that your ships move super speeds through. Which actually works out better I think but redirecting them does absolutely nothing so there's no point and the tooltip is way off for what it actually does. By far the biggest tooltip issue I have is the readout of how much power your ships use up per second, it is so far off it's amazing. Weapons have a power 'requirement' and an amount of power they 'use when firing' and the first appears to be spot on, it won't let you make a ship loadout that doesn't have the power to use what's on it. The second however is terribly off, you basically have to look at all your weapons individually (which there can be 30 some odd on a titan) and add them all up to see if your power output is going to cut it. Sorry but I don't really think math problems (even simple ones) should be part of designing a ship loadout when it's supposed to be calculated for you. For instance I can have 4 beam weapons that all consume 100 power when they fire and the information will tell me I'm generating +300 power per second more than it's using and the 'time until power is fully drained' is 'infinite' but no, not at all no. What really happens is two of the beams will fire and I'm out of power for a few seconds and by the time the other two can fire the first two are off cooldown. So that needs some serious tweaking.  There's some more issues I can't really remember at the moment but the game has them for sure. Is the game worth buying? Heck yeah it's really fun, there's some good humor in it and it's a solid 4X game.... or will be once it's fixed. It's very playable, you just have to figure out what the issues are as you go and work around them. Currently there is no way to achieve the 'ending' that I'm aware of, it seems to have been glitched out in the last patch, sad. However, the game is certainly not worth $30 right now. Get it on sale for under $10 or wait until you see someone make a review saying it's fixed or something.  On a final note, T-Rexes with lasers strapped to their heads are amazing, this is the only point in ground combat.",
            "review_score": "1"
        },
        {
            "review_text": "By far my favourite go-to 4X strategy unwinder, with the advantage of being one handed / mouse controlled. Beautiful planets, pleasingly customizable start conditions and satisfying space battles evolved from your tactics and artistic flair in ship design. Most reminiscent of Firaxis' S.M. Alpha Centauri in pure application of strategy. Better than Endless Space.   It's fun. Not perfectly easy to start out as a newb with, but IMHO superior at scratching the itch that Civ 5 left nagging, and with far fewer visible bugs than that title. DLC adds functionality. Thank you, Zero. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Exelent mix master of orion and space empires",
            "review_score": "1"
        },
        {
            "review_text": "Great game! incredibly hard AI with the new update but it is fair as well for the player. finally a game that bites back! Loved Stardrive the original and been waiting so long for this to come out and i am so glad i have it now! everyone whos anyone should buy this even if its your first time playing a sci-fi RTS strategy game.  Pros: Great AI Great balance for the game, it doens't feel too easy or too hard! Research tree was a great touch and supremely glad about it :) Cons: one ever so tiny con i am surprised i am mentioning it! i always liked the ability of having engines that were able to be just being specialized in sector speed or in game battles like Stardrive one.  like i have said this is an amazing game and i always have loved this series i hope they keep the work up like am sure they will! :)",
            "review_score": "1"
        },
        {
            "review_text": "Patch H has really messed this game up. The AI does not respect Core Space. I've started several games and the narrative is always the same. Opteris colonizes beside me, sends a colony ship to Sol system. If I try to block it, its war and it sends wave after wave of fleets 7 and 8 ships strong. Even if I manage to build a fleet of ten ships it always has more. If I allow it to build the colony then soon after I get a message telling me that I am in its space and need to vacate. In which case its war and I have fight wave after wave of superior ships.  The AI seems to muster resources quicker that I can ever manage. In all, these are 15 to 45 minute games with the outcome always the same. It does not seem to suffer the same penalties for building ships as players do. The only weapon that was somewhat effective, the mass driver, now is useless because of the newly introduced aiming penalty.   One of the missions right off the bat is to colonize three systems for which you get 500 bc. However it seems that colonizing three systems really pisses the AI off and so it makes a bee line to my cololnies to take care of business. Doing this takes away valuable resources that could be used to build fighters. However not colonizing only postpones the inevitable.  It is obvious that there is no fog of war for the AI as it always goes for the weakest colonies and when it knows it has the advantage it swoops in and destroys everything.   I like a challenge, but so far have not been able to find a way to stay alive against an enemy that knows all, builds faster and gets all the tech before me. Yes I've traded for tech. Other players have mentionted how the Ai does not attack with updated ship designs. I have not found this. For me it is always a case of fighting outgunned and in the end completely outnumbered.  I like where the game is going but hope some of the AI related issues get worked out. I feel that backing things off to give players time to figure things out a little more would make the game that much more enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "its aight but its not for everyone",
            "review_score": "1"
        },
        {
            "review_text": "great game, yet it is buggy (alot of stuff that can crash your game), long loading times and also the diplomacy system could use some improvements",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game for a  One Man  Dev team. Could things be better yes, more victory conditions than combat, better AI for those who might want it. Less hardcoded stuff for modders to fiddle with.   but the positives IMO  -huge amount of different modules to play around with in ship design -nice variety of weapons - Turn based instead of RTS (this is a personal preference obviously )  - Nice variety of positive and negative race modifications to select from - nice forced choices with research (a large costs racial option to get rid of the 'choice part') -nice variety of alien species each with their own distinct personality (you can turn that off and make them random) - on the last point each species has unique ships and the size and shape of those ships vary species to species - acceptable diplomacy options would like more options here but serviceable atm  my vote try it out if you get it soon you can get the game for only 21$ way less than any normal 4x game",
            "review_score": "1"
        },
        {
            "review_text": "this game is immposible to play when you're high",
            "review_score": "1"
        },
        {
            "review_text": "one of the best game out there",
            "review_score": "1"
        },
        {
            "review_text": "Had to change my review to positive after updates made certain parts of the game more bearable. Much of my previous criticism still stands: The UI is poorly done and confusing to operate. Several game elements (like boarding and land battles) are just tacked on and useless.  That said! I do admit that once I found my way around all the problems I was able to get some good fun out of the game. Captures something of the MOO spirit - enough that you can just sit back and enjoy it for a while.",
            "review_score": "1"
        },
        {
            "review_text": "I've played Masters of Orion 2 (One as well, but 2 a LOT more) it's, in my humble opinion, the best 4X game ever.   After that, I've played many, many more: Galactic Civ, Alpha Centauri (Rants about Civ ripoff) Sins of a Solar Empire, Endless Legend, etc, etc ,etc. None gave me such a new or enhanced experience as MOO2.   Then: Stardrive. WOHAAAA! Great! it's like MOO2, but with everything better: Cooler ship design, better tech thingies, more exploration, tactical combat, flavorful events. Terriffic!  The downside, and for me the number one reason to never play again (Please, make a patch, expansion, DLC, ANYTHING): there is only one way to win: total conquest. So after hours of playing I have to destroy my friends. No economic, diplomatic, cultural, 'who has the most bunnies' or anoher origional victory at all.   So I own 60% of the planets, the biggest fleet and most technical advancements (Ok, I was playing 'normal', sue me) and have to spend hours conquering planets. No fun at all.  One small thing when you're make a patch: Please give an end-of-turn warning when a planet is doing nothing or convert the excess labor in coins or anything. It's frustrating to discover after 5-6 turns you forgot to give one planet new construction orders.  When the victory thingie is solved, it will be a A+ recommendation from me!  With kind regards,  Sebastiaan. ",
            "review_score": "-1"
        },
        {
            "review_text": "I don't think I'm even going to bother to write a 'helpful' review here.  Instead, here's a little story.  Once upon a time, there was a very nice EA game called Stardrive. It promised to be so many good things to so many people, and to be a spiritual successor to MoO2, one of the greatest 4x games of it's time. Our young hero read many reviews that said 'THIS IS AWESOME, IT HAS SO MUCH POTENTIAL!' and, not realizing at the time that 'potential' almost always translates into 'don't buy this ♥♥♥♥' in non-review english, he decided to buy it.  Many hours passed, and because our hero likes starting 4x games more than finishing them, as well as designing ships, some great fun was indeed had. Soon though, cracks began to appear in the happy facade of his new game - memory overrun bugs would kill games part way through, unfinished tech trees robbed our young friend of satisfaction, and AI issues began to make things feel dull and drab.  'Why have I spent so much time playing this?' he lamented, 'If only I'd realized earlier that there is literally no lategame here, instead of starting a thousand different games and only playing the first bit?'  He had to suppress a sob. 'And why did it take me so long to realize that there's only one tactic you really need to use in this game? I'm supposed to be good at games, how could I have been fooled by the shiney ship design, when all I had to do all along was jam my ships full of cheap, first level missiles in order to ruin all?'  In the end, he was crushed. Where was this potential the other reviews had told him about? Where were these promised features that never materialized?  Distraught, he turned to the forums. 'Hi guys, I just noticed a few things about this game, and had a few questions.' He detailed his experience, and his input, and made a few simple queries such as 'How do I make my fighters actually land back on my ships?'  The response that await our hero was unexpected. No sooner had he posted than a wave of drama, anger, and malcontent rushed forward, flowing out of the screen of his ♥♥♥♥♥♥ laptop, and engulfing him. The force was so great that it nearly capsized his desk, and caused him to be lost in the swirling vortex of it's black waters.   'SUCKER, THIS ♥♥♥♥ING GAME IS GARBAGE AND BROKEN AND THE DEV IS A MASSIVE ♥♥♥♥♥♥', and 'ABANDONWARE, NOOB, DON'T BUY IT', and 'STFU YOU GUYS THIS IS THE BEST THING EVER AND ZERO IS MY BUDDY AND YOU'RE ALL ♥♥♥♥♥', and 'BUT THERE'S ONLY ONE DEV, SO IT'S OK THAT MOST OF THIS SUCKS', and finally, 'Hello, I'm a moderator. The dev has essentially done all he can with this engine, and has dropped development in favour of StarDrive 2, which will be everything that was promised and more. Check it out, you'll get 33% off since you bought this game! Also, check out my mod which fixes some of the problems with the game you already own!'  Somehow, he managed to swim free from the maelstrom, and hit the vitriol release valves built into his computer room. As the drama-fluids slowly drained away around him, he vowed to write a negative review, forget about the experience, and never be involved with sequels or games with 'potential' in general ever again.  Then, years later, he fatefully stumbled across StarDrive 2 in the Steam store.  I must resist the urge. Resist the shiny. Resist the 33% off.  Our hero fought the good fight for a time, but all the positive reviews speaking of 'potential' (no, you fool! you say) and improvements over the last attempt by the dev began to haunt his every waking moment, invading his thoughts at work, while playing MoO2, and eventually, even began to snake into his dreams.  One night, awakening in a cold sweat from dreams of turn based glory, galactic conquest, ship design, and fighters that could actually land rather than being doomed to spend eternity floating through the cold vacuum after launching, he fell to the dark whispering, and clicked BUY.  The next morning, he realized what he had done, and was filled with sorrow. 'My god! What have I done? Even with 33% off, this game is 66% overpriced for what it will likely contain.' In shame, he did not play the game for quite some time, during which drama raged, DLCs were released, and countless empires could have risen and fallen.  I must resist!  the despaired internally,  I cannot allow myself to be drawn to gaze into the abyss of abandoned 'potential' yet again, for when you gaze into it, it gazes back into you.   But one day, the urge was too strong. 'What's the worst that could happen? Besides, I already bought it.'  Our hero, despite having grown wise with the years, foolishly decided to try the game.  'Gee, this isn't too bad. The new turn system is ok, and the ship design is slightly less ♥♥♥♥ed.' While not 'complete yet', the game was indeed a bit of improvement over the first iteration, and once the promised features of the first game and the new promised features of the second, combined with some of the new DLC, were all in place, it could truely be great. Several hours were spent playing, and our hero slept easy.   For some time afterwards, the game was forgotten, buried deep in the far recesses of the Great Steam Library, under an opaque pile of other games that fit the tag 'space' or started with 's'. While on a grand re-organization, our hero stumbled on it yet again.  'Hm, I only have 9 or 10 hours on this, and there's lots of easy looking achievements to get. I don't remember it being all that bad, really.' And so, he began to play again. 'This seems to be loading slower than normal. And appears to have more bugs than I recall. And wait... this is all hex based. Did the developer do me a solid as a former customer, and give me the DLC for free?'  Perplexed, he turned to the forums, and it was immediately evident that something terrible had happened to the denizens within. The place was nearly empty, the remnants of spam and flame wars splattered on the once stunning marble pillars being the only indicator of what may have happened. Through judicious exploration using his trusty torch and noble search feature, most of his questions were answered. There were indeed bugs, and some issues, and the DLC had indeed been given out for free, though apparently by accident.   One question remained, and so he shouted out in the dark to anyone who may still have lingered to hear: 'Hi everyone. Been playing this again, it's pretty ok. I noticed that I seem to have gotten the DLC for free, which in my understanding is a bug. I was wondering if I now just *have* this, or if it's going to be patched out. Is there much point in me starting a new game right now?'  The question echoed around the empty halls of the Forum for some time, before a quiet answer was given. 'Hello, I'm a moderator. The dev has essentially done all he can with this engine, and has dropped development in favour of....'  The last thing our hero remembered before his vision turned to darkness and his torch sputtered out was a howl, full of fury and pain.  'ZEROOOOOO!!'  ------  Ok, so I took a little artistic liscence on the last bit there. No one ever answered my question, presumably because the forums are just as abandoned as the game. Nor was there an agonized howl cursing the dev - I missed all the drama this time around.  I've hit a word limit, so please see the comments for some more serious thoughts.",
            "review_score": "-1"
        },
        {
            "review_text": "Up until today, I could deal with all the minor bugs I encountered. Some weird graphical glitches, screen lay-out that sticks around when you switch to a different screen, ship modules that seem to float around on their own in space ... all of that I can either ignore or 'fix' ingame.  No big deal. I love the basic game, having fun playing it.  Today I surrendered to the never ending barrage of bugs and threw in the towel. I leave it up to you to decided if I'm overreacting or not:  - This campaign is going better than everything before. I understand better what is needed to survive this galactic battlefield! Not waiting to be attacked, I went agressive ASAP and managed to defeat the main fleet of those damned psychic slavers. Blockaded their homeplanet and invaded their second planet. First invasion of their homeplanet failed. No worries. Second wave of two full barracks is on the way.  - Bug 1 enters the batlefield. I can't invade the homeplanet ...  - Everytime I try, the game freezes during loading the combatscreen. Can only get out by ending the game by using taskmaster. After trying a few different infantry set-ups (maybe just 1 item is bugged?) with no succes, I stop trying. Having to get out of the game with taskmaster, starting again and reloading the campaign gets annoying after 10 times or so.  - I quickly build a fleet of Corvettes with Nuclear Bombs and kill all defending troops. No luck, still can't invide. I then kill all the population. Planet is now a nuclear wasteland instead of a very productive production facility. I colonize it anyway, no bug is going to stop me from domination!  - Struggle with a few of the usual minor bugs. Also a new one: apparently my hired special characters don't like flying through purple clouds en route to their assigned systems. They're stuck ... they also refuse to fly back and take a detour. I decide to leave them, maybe they'll decide to get unstuck after a while.  - Discovered what hides in the pink wormhole ... hint: it's big and it hurts.  - Having a lot of new shiny tech, I decide to do a big fleetwide upgrade. Bug 2 arrives. My planets refuse to build anything. What??? I can select the build, I can even pay the price so it's done in 1 turn, but it will always stay just 1 turn away from completing ... no matter how much turns I wait.  - Tried different combinations of ships and modules. Only thing my planets like is building the original explorer ships it seems. Try to scrap some fleets, still no luck.  - Bug 3 moves in for the killing blow. During all this testing and trying, two of my fleets happened to pass eachother on the galaxy-map at exactly the same time. Now their fleet-avatars are stuck together and they can't leave. They also can't merge and become one fleet .... they're just stuck.  I give up. Doesn't matter how good a game is if the bugs never let me enjoy a full game. You decide if you can (or want to) deal with it, good luck.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to love this game but it won't let me. Numerous bugs, bad UI, rare crashes, half baked ground combat. This game is unfit to be called a finished product. A good beta maybe. Needs polish, lots of polish.   You can tell that love went into this but it did not come with an equal measure of design skill. Fleets will frequently overshoot their targets without engaging/parking. Ground battles will sometime bug out, switching control of you and the AI's forces. Real time space battles are unforgivably disorganized and nearly impossible to command in any meaningful way without 10+ minutes of pre battle formation micro management that you have to do every-single-battle. Save your formation? Nope, F U. Simply clicking on a ship and telling it to 'fly here' is absurdly difficult when large fleets are present. Planetary production Governors? Nope. All micro. Insta scroll game text with a click? Nope. Get used to watching the letters crawl across the screen like a legless orphan eating crayons. Enemy transports will bug out in/near wormholes, becoming permanent, untargetable fixtures until their race is annihilated. The music is awful and may as well not exist.   In it's defense, smaller space battles are fun and pleasing to the eye. The random events/missions scattered about the galaxy are fun and interesting. Ship designing is lots of fun but probably poorly balanced. A colorful cast of aliens, even the 1 world minor races, Art and writing fluff did their jobs at least.   Really, if everything worked properly and had a decent UI, I'd say StarDrive2 is slightly above average. But in this state? Unacceptable.",
            "review_score": "-1"
        },
        {
            "review_text": "I read the reviews and thought 'okay, this looks good.' I plunked down my quarters and I got to say this is a very frustrating, boring game. I understand that AI's have to cheat to compete, but good lord this is ridiculous.  Issues as I've found them:  a) The tutorial, though appreciated, feels like it's setting you up for an easy fail. It's basically a dad who, giving you encouraging words as you learn how to pedal a bike, stops holding on just as you start down a grand canyon trail. I got through it thinking I could handle...and then 10 turns later all my bases are starving, no functioning economy and two at-war races. What the heck?  b) The news feeds. They type out so slow. To further agravate hitting space, which one would hope brings up all of the comment being typed skips to the next comment. While 'cute' the poor design of the interface does little more than irritate.  c) The tech trees. Illogical. Unfunctional. While I like the idea that when one choses a course to follow other avenues close off but why the heck can't I research both fusion engines AND fusion shields? Explain how one would exclude the other and not actually make the other easier to pursue? Once gone, the only way I can pick it up is through dubious trade with other species? Grrreaaaat. Also...the tech time to get each technologie increased after each successive advance...why would somethng that needed 8 turns to calculate need 12 turns later all things staying the same?   d) Resources. At 'Normal' I couldn't get more than 3 viable colonies. At the same time trying to fend off sudden war declarations AND, after barely expanding to three systems discovering I'm surrounded by alien races each with 15% of the available star map. That initself was the most discouraging revelation of this game. Trying hard and getting a third colony going only to find that the AI has 10-12? I reaaaaaally want to know how beyond AI boost. I have no idea how to produce a military that could defend my meager colonies let alone strike back.   e) Random bugs. I'd send a colony ship to a planet and it'd not colonize. I'd have to send it to somewhere else and back again to a planet to do so. Had same issue with warps. Couldn't use a wormhole and would have to travel somewhere else and back again to do so.   Feel like I'm missing out. Will try again...but I really ain't feeling the love here.  Would not recommend. Not even a small bit.",
            "review_score": "-1"
        },
        {
            "review_text": "After a few hours of play through I have to say that the game has a ton of potential. That potential, at least without the expansion (which I haven't purchased) is not realized. If you are a fan of Master's of Orion 2 you'll feel right at home. The graphics are obviously better and the combat has been reworked, but otherwise the races have been borrowed from heavily and the technology tree is nearly copied in its entirety. All of this wouldn't be an issue were it not for the staggering amount of bugs that are still present in the game. I've not managed to get even a single play through to last more than an hour or two without running into a bug that causes the game to lock up. These are issues that are being caused by normal game play and I, like other reviewers, am amazed that they never game up in beta testing. In fact, they make the whole game feel like it is an early release as opposed to a fully completed product. Hopefully they will continue to work on fixing the bugs, but until then I wouldn't pick the game up unless it's massively on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "i played this game for awhile, and at the beginning it was fun. that is, untill i ran into the bugs. like the game sticking on 'end turn' around 800+, ending my game.  or hostiles attack my home planet so i send my fleet and it gets counted as a merchant fleet and is instantly destroyed, ending the game.  and those aren't even the most urking of the problems. the worst problem is when i select a custom profile, edit and save, and it saves as the race's default. which is really stupid, cause i cant even edit my custom profiles for races, and i cant revert the race profiles to origional.  4/10 untill these bugs get fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "I spent a lot of time looking forward to play this game. It's a shame that it did not live up to my expectations. It's too simplistic and there is not enough depth. Many of the game mechanics also feel either incomplete or even broken. It's a shame because this game looked really good in previews.",
            "review_score": "-1"
        },
        {
            "review_text": "Bugs with command points require restarts or game over as 1 turn will net you -10k cash. Auto-combat results in AI victory unless you have overwhelming advantage yet same battle can be won without losses manually. Terrible Spy warfare results in endless pop ups on the right every turn; you stop their spies and they suffer no negative dipo score, yours get found and you lose massive dipo score with them for 300 turns. AI will non-stop every turn send spies...  Random Events were interesting at the start until them suddenly become over powered. So much so I have played 5 worlds and have finally had enough.  As this game is already released. Avoid. As I don't see these problems being fixed.  *EDITED* 'pop ups on the left every turn;' became 'pop ups on the right every turn;'",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay in StarDrive 2 is too forced into a style that the developer wants instead of a style that I would like to play the game.   If after a certian number of turns you have not made contact with any other players then a wormhole spawns between your homeworld and another players homworld. This often results in an AI fleet invading my homeworld is short order. The developer has responded saying that this is a feature designed to prevent turtling. My take is that if I want to turtle I should be able to do so!  I would still like to turtle so I make contact with another player, but maintain peacefull/minimal releations with them. After a while I get a notice that my citizens are wanting to go to war with the AI player. Since Im just starting to build a navy I decide against it. A few turns later a large fleet of 'rebels' bent on going to war show up at my homworld to change the government. My fleet of now 2 ships gets steamrolled by the rebel fleet 3 times larger than my fleet.  Let me play the game how I want. If I want to turtle and play 'simspace empire' for a while I should be able to without being forced to play aggressive.",
            "review_score": "-1"
        },
        {
            "review_text": "Very similar to MOO2 but the tech tree is too severely limited and new types of weapons are called for so they can be scaled down and fitted into your cruisers and battleships. Diplomacy is also limited and trade for new tech is nearly impossible due to the restrictions placed on you by your population\\'s approval ratings for each transaction. The races are almost identical in their attributes so it\\'s better to modify one to your liking ( if you can). You can\\'t construct any ship past Titan size and outpost ships are very badly needed so you can stake out some good systems while you build your military and logistical infrastructure up. The battle with the \\'Master of Orion\\' (actually the Guardian) is intense but the reward is paltry, only one tech advance and no rich planetary system to exploit. Troop battles during invasions look like a bad rendition of \\'Pong\\' and they should more in-depth and intense. The pirates sprinkled through the game are pretty sad and are unable to withstand a concerted attack,they should at least be equipped with better weapons and bases. Speaking of bases, the orbital facilities around your planets are good for command points only because no matter what thier size is they are quickly overwhelmed and planetary defenses such as beam weapons or missiles are sorely needed. It\\'s not a really bad game but it failed trying to step into MOO\\'s shoes and I\\'m glad I bought it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "15 dollar game. Great potential, but unfinished. The game has great polish in some areas, while other areas feel like loose threads.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy. Another unfinished game by Zero, the one man show developer. Some use it as an excuse for him. I do not. The game could be great, but it will never work properly because one person will never be able to fix it before time and money runs out. You will regret your purchase if you by this.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this game. The AI cheats like crazy, it isnt even fun.",
            "review_score": "-1"
        },
        {
            "review_text": "You know I really really wanted to like this game. It's actually really really good. Except it's so darned buggy that I twitch every time I play it. From enemies spinning off the screen endlessly to never be seen or heard from again while I have to retreat or give in (which sucks as you lose your star base), to not being able to click the OK button when a random ship that was undefended gets attacked.  I'd like to give it a great review... but it really has some massive bugs to fix.",
            "review_score": "-1"
        },
        {
            "review_text": "I propose to not buying this game, because there are so many annoying bugs.  It never crashes, but very often (at least after *each* fight) you have to wait 1-2 Minutes until you can continue playing. At the moment, I own about 10% of the Universe, but after an usual fight I have to wait 68 seconds until the (mandatory) fight statistics are displayed. After confirming those annoying statistics (they are interesting only the 1st 5 times), the game requires again about 30 seconds to load.   Its really annoying that after 1/10 of the game play time it's almost imposible to play the game if you do not just want to ... wait. wait. wait. ... wait.  It's really annoying: there is a cool, big tech tree - but no precise descriptions, so that one has to start reverse engineering and try to find the differences.  Additionally, one can not research items on the same level.  This way I'm playing long time and suddendly I see that I made a wrong researching decision and so I have to hope I can get the missing item on another way. Or once more to realod an old game.  It's really annoying that the tech tree does not list numbers and facts and that my engineers forget how to research another item on ab already researched level .",
            "review_score": "-1"
        },
        {
            "review_text": "Unbelievably poorly done in comparison to the streamlined well thought out way Stardrive 1 played. I'm sorry to say that I am not only disappointed with ths game, but, were I able to, would get a full refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Loved the first Stardrive. The sequel is a good game.    But.... So many things just feel wrong with it.  Its a great game. Just dont expect a true Stardrive sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game on release because I was a massive fan of Stardrive 1, i know that Zero abandoned that game for his reasons but it was still a solid game, made more so by mods :)  But this game I just cannot play anymore, I left it to be fixed as on release it was incomplete and buggy, but still kinda fun.  The main problem is, even if bugs are fixed, this game will never take off. why? because Paradox released a game called Stellaris...  Forget this game, go check that one out. Also, im sorry Zero, you are certainly talented, but making your OWN games may not be the best thing for you",
            "review_score": "-1"
        },
        {
            "review_text": "I was convinced by a friend to buy this based off them saying it was just like Master of Orion 2. It isn't. You have to be participating in every aspect of the game at all times or you cannot win. You can't get a feel for this game in 2 hours so if you plan on getting a refund if you don't like it then don't bother buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "He left his first game unfinished, take the brand he created and milk it. Gameplay is horrible, bunch of bugs and not joyable.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the only game I have every want my mony back on, Full off bugs!!!!!!!!!!! patch dident fix anything, they only change the number. dont buy.!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This is the only game I have every want my mony back on, Full off bugs!!!!!!!!!!! patch dident fix anything, they only change the number. dont buy.!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "My tagline for this game is 'StarDrive 2: You've Already Lost'  The tutorial is insufficient to help you avoid getting smashed by the AI. By no means a gentle learning curve. Maybe this kind of game just isn't for me, but I enjoyed Spaceward Ho back in the old days.",
            "review_score": "-1"
        },
        {
            "review_text": "I regret spending opening price to purchase this game. It has so many bugs that I wonder of the devlopers acually played the game before releasing it. I have fleets disappering, invisible enemies, freezing and crshing on minimal settnigs, and that's just the tip.  The game itself introduces nothing new. it is essentially a reskin of its predecessor, but actally feels more limiting rather than less. Planetary governors have been removed, forcing you to micromanage every planet. Heroes were added, but barely rate a footnote. Espionage no longer has individual agents with their own names and rankings, Ground combat is clunky and frustrating, fleets will hover around, miss, or otherwise loose targets which you had ordered them to find, board, or engage, Diplomacy is socompletely unbalanced that it would require a separate review.   And then there are simple things, like persistant scenario memory, that further frustrate me. You spend time setting up the ideal scenario for your game and then for whatever reason choose to restart and have to do it all over again. There is no apparatus to save races or campaign settings.  All and all, I was too frustrated to have fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Game feels unfinished and is still buggy.",
            "review_score": "-1"
        },
        {
            "review_text": "I could say alot of stuff why this game fails but I think to sum it up, it comes down to ability and motivation. Between SD 1 and now this SD 2 you can see obvious short commings like left out features that seem to be more due to the lack luster polishing efforts of the Author.  The DLC brings more bugs that break the game at times than fix and add very little in the way of game play over all. Theres no Multiplayer even though the community begged for it, he even took it back to turn based, so itslike he tried but ended up in the too hard basket.  Over all its hard to say a good thing about the game mainly becuase other games offer the same all this game has left is the ship creation which even that seems slighly watered down compared to SD1. Only reason I gave in and bought the game was because it was 75% off on sale. You can play it and maybe even enjoy it but your going to have to use accept that its like buying an alpha in ways with probably no hope of bugs being fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game, but so much about it rubs me the wrong way...  The ground combat just needs to go, I hate it and its no fun to deal with. I wont even do the little side quests because I know its gonna just land up with more ground combat.  The research system can seriously go ♥♥♥♥ its self with its you can only pick one ♥♥♥♥♥♥♥t, ♥♥♥♥ you I had to cheat and make the trait that gives me all the techs when I reach a new teir free because this ♥♥♥♥♥♥ me off so much.  The AI, is just down right stupid and interacting with them is totally pointless. Even after all the patches to it has only elevated high functioning mentally disabled. Its painfully obvious that it needs to cheat to even stand a chance against a player since they dont have to deal with globally hostile encounters.  The onyl reason why this game is even a challange is because you are constantly under attack trying to do anything to advance yourself  The original game was better than this all we have here is improved visuals and that does no impress me one bit.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played a lot of 4x games(Master of Orion, Master of Orion 2, Ascendency, Master of Magic, Fantasy Empires, The Civilization Games, Heroes of Might and Magic 1-5, Galactic Civilizations, Imperium Galactica II, and probably a bunch more that I don't remember right now), and the reviews for this one seem a bit more enthusiastic rather than accurate.  It borrows heavily from other games but to the point where it feels derivative of them rather than being a synthesis of them. Moreover it is so blatant about it that it feels like it is flirting with the breaking the fourth wall not something I am a huge fan of.  The game has a lot of potential in the ship design and strategic aspect of space and ground combat and the level of depth that it allows you to manipulate your empire.  I will say that it was better than MOO III in general fun and striking a balance between allowing depth and getting carried away with it.  My big gripes about the game are as follows.  Technological advance doesn't yield significant upgrades until you get very very far along in the trees. I almost always had better luck researching a few basic (tier one or two technologies), the pumping everything into producion ships and troops and conquering the galaxy without ever doing more than cursory reasearch.  The AI literally cheats on basic settings, I have tested rich homeworlds on small maps with optimized industrial output and the AI will invariably massively outcolonize me and outproduce me (in terms of fleet and fleet size) very quickly in the early game. You can still win by being clever or cheesy in your builds, but the fact that it literally plays by a different set of rules on default settings really really bothers me.  The technologies are poorly balanced to create a stable empire. The game forces you specialize each of your planets because of prohibitive maintanence costs (making one planet that has all upgrades and buildings your empire is capable of will put a big dent in your wallet). Basically I find myself skipping almost all of my unlocked buildings on most colonies just because of what it costs to maintain them. The way various technolgies interact and overlap with each other just makes a lot of them feel useless or redundant or only of use on a very small proportion of your colonies.  I do think the game has a whole lot of potential and with some patches or balance changes could be more fun. Essentially my complaint it that it forces you to play in one of a few very specific ways if you want to avoid getting wiping out quickly on default difficulty. It felt more like how well can I implement this strategy which I know will be the only viable one for this map/race selection rather than what type of empire would I like to build this time. It feels like the game has mechanics for amazing strategies and fun but makes it impossible for you to implement them before you have already taken control of the map.   Bottom Line I just didn't have fun playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoy this game, but it's incredibly buggy and the moment you start to have large scale space battles, it lags like hell. If you can get through that, it's a decent game.",
            "review_score": "-1"
        },
        {
            "review_text": "Even with all of it's flaws and potental inprovements that never came, Star Drive 1 is 10x better than Star Drive 2. I would buy some of the mods as DLCs for one but number two was in my book just a waist of time and money on everyones part.",
            "review_score": "-1"
        },
        {
            "review_text": "I was really hoping it would be a great 4x game like it's StarDrive, but instead it's more like a space turn based strategy.",
            "review_score": "-1"
        },
        {
            "review_text": "Play star ruler. Seriously. This game sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is an interesting sort, in which it makes it look like the game has a lot more in it, than it actually does. This game is just outrageous in so many ways it's hard to pick one that I dislike the most, but I'll try anyway.  Pros: + Looks nice +/- Factions look different + Interesting to create new ship designs, even if it is just like trying to pack as much useful stuff into a suitcase that's two sizes too small + Allows for a bit of customization to the game.  Cons: - Every faction plays exactly the same. If you removed the faction picture and name, you couldn't tell the difference.  - Everything takes a ridiculous amount of time to do. Building ships, researching new technology, even moving a fleet from point A to point B. It takes 30 turns just to build the most simple building, and trying to erect a fleet quickly to stop enemy ships that just suddenly decided they hate you? 13 turns a piece. The smallest ships available are around 8 turns. Seriously?  - The ground 'battles' are little more than a game of chess... Unless they bring more advanced tech than you. Then you lose.   - The AI is practically unhindered and when you go to trade technology, they have 4 for every 1 you have.   - The tech tree is extremely limited, instead of a web, you have to pick one out of three and if you decided you needed something else down the line, too bad. Maybe try getting it from those stingy AI. Good luck with that.  - The 'galaxy' is extremely small. A real galaxy has billions of stars but this one only has 100 maximum. Trying to expand your empire? Too bad, AI got there first. Seriously, you can't sneeze without hitting another race and they'll declare war on you for the most trivial things.  - The game is lag-infested, crawling with bugs, and just feels plain unfinished. The character models on ground battles are poorly done and everything just feels very choppy.  -Confusing UI that just seems to get in the way most of the time.  I'd have to give this game a 4 out of 10, the game isn't abysmal by any standards, but it's certainly not good enough for long time enjoyment. If you have time to kill and money to waste, then try it out. If I had to describe Stardrive 2 in a sentence, it would have to be a 'Pretty looking waiting simulator where pretty much nothing happens. Also the skip turn button will be your best friend. Just waiting for those crazy turn costs to tick down... Really really slowly.'",
            "review_score": "-1"
        },
        {
            "review_text": "I picked this up after watching the trailer thinking that it looked like it had my favorite aspects of the old Space Empires games. In a way it does, but in every single way this game is lacking in depth. It wants to be a grand 4x I think, but falls completely flat.",
            "review_score": "-1"
        },
        {
            "review_text": "This review has changed from a thumbs up to a thumbs down.  Why?  Well it should not have been released in the first place, it was a EA game really they just forgot to tell us, the only thing is its a abandoned EA game, just wait for a massive discount in a sale as its gone nowhere.  Update: Yup looks abandoned and unfinished just like his first one, avoid this Dev.",
            "review_score": "-1"
        },
        {
            "review_text": "Stick to professioanly developed games for this one. The creator Zero is literally a zero when it comes to doing anything but making you play the way he wants you to. There are entire scripts that all make it so you HAVE to play it a certain way or a wormhole opens up in your home system connecting you to the enemies home system. You can look it up if you don't believe me.  The creator is amateur at best when it comes to handling anything bug related and all the races play the same. They all have the same upgrade and the same effects for their weapons.   With all this though the true reason to not get this is becuase of what the creator did to everyone who got the first one. Completely walked away from it to make the second and it is the same game. Charged people twice while promising the world. Just buy a game from EA. Even they aren't as corrupt or immature as the zero who made this.",
            "review_score": "-1"
        },
        {
            "review_text": "With about 20 hours into the game I am done with this game, this should be considered a first impression rather than a review as I don't feel that I have enough time played to call it a review. I will give it the caveat that my system meets the minimum requirements listed, but not the recommended.  For me this game is riddled with bugs, I have started 6 games, each of them encountered a game ending situation that wasn't due to game mechanics but rather game engine issues, three times combats that wouldn't hang up the game, twice fleets caught pinned to a planet and when I would retreat it would retreat me to where I started the combat initiating the fight again, and once due to my save file loading me into a frozen game (it wasn't frozen when I saved and logged off for the night).  When it works it is an interesting game, however I am looking for a long game played over multiple session not a game that I have to either save constantly in case I need to reload for bugs, or start over.",
            "review_score": "-1"
        },
        {
            "review_text": "StarDrive 2 is a game where core mechanics are mostly superb, but it lacks features required to make a truly good 4X game.  Quite frankly, this game focuses way too much on 'exterminate'-part of the 4X, which makes it seem shallow compared to it's peers. This is not a game where you try to win with a peaceful empire by intrigue, colonization, science and diplomacy. While these parts are certainly a part of the game, they have habit of getting into one another's way. Given that, the game's focus tends to be in ship design, logistics and space battles. But most of all, this game lacks diverse content that is usually a requirement for any 4X game. The game's pacing also feels like it's not been thought out, with research, exploration, and conquest all working on their own pace, instead of supporting each other.  The good parts of the MOO2 are there, no doubt, and they will suck you into the game for a good 10 hours or so, before the flaws start to shine through the gaps in the awesome. The alien species that seemed varied at the first sight, start to all feel more same-y with only a slight twist after a while, the short tech tree is past future-tech at the point around third of the galaxy is explored -- I haven't even met all species before the tech tree is done, and I am quite certain this problem will just seem all the more clear if you like to play research-centric species, which I do not.  On the other hand, the random-ish events and whatnot give some background into the galaxy, and fill some gaps nicely. The worlds slowly turning into core-worlds, ski resorts built into tundra worlds and beaches of the ocean worlds all give nice flavor to your empire's worlds. Designing ships is also fun, and quite likely the best part of the game. Only thing I would love to have in the design is more options later on, but in the early-game, there were more than enough. The problem there comes only later on, when you can just cram some full of long-distance weaponry and near-impenetrable shields, at which point any opposition just gets obliterated.  The diplomacy mechanics of the game are also good, which is a pity, since every alien you meet will want to murder you, however peaceful they claim they are (they usually don't). The only empire I have ever managed to hold peace with, was the one trying to constantly steal my technology, to the point where I wanted to murder them instead. And this is the problem with the alien species. While they seem like really cool ideas with built-in shout-outs, you will soon see a certain pattern there. There are Cthulhu-esque theocrats that want to murder you for not worshipping their gods, wolf-like evil warriors who want to murder you for the evulz, space-bears that want to murder you for honor, mind-controlling molluscs that want to enslave you out of boredom, robot hive-mind that want to murder you for lebensraum and plant-like 'peaceful creatures' that quite likely just wanted to enjoy the gentle optics of my laser beam arrays on my ships. The tendency of everyone trying to murder you, combined with AI's suicidal optimism and overconfidence about their odds about winning a war tend to lead them declaring war on you just to get horribly murdered instead. And while this was fun the first time, it grew old fast. There simply aren't any aliens that like to win the game, instead of giving you excuse to fight to showcase the game's combat mechanics.  The space combat itself seems OK, and ship designs seem to really matter. The AI seems to just move towards you guns blazing though, regardless of its ship designs. The UI is good enough, if sometimes a bit annoying, especially if you like to use fighters, since selecting ships is sometimes not as straightforward as it should be.  The absolute worst part of the game is ground combat. It seems like an afterthought and the UI makes it constant misclickfest at it. It is skippable, but the automagic resolution doesn't do as good job as you would with some equipment, so it becomes just a chore to be done before you can continue on the fun parts of the game.   In the end, the focus on the extermination and conquest strip the game of many of the strategic elements it should be capable of. The space and ground combat lack good enough AI to actually showcase the best parts of the game -- the ship design. The replayability also suffers when every game ends up in a war with only slightly varied opponents. That being said, the game's strategic mechanics are excellent, and most of the bigger problems COULD be fixed with patches. Even with all its flaws, this is probably one of the best space 4X games after Master of Orion 2. The problem is, I still rather play MOO2, which currently costs quarter of this game's prize. If this game would cost 10€, I would recommend it, but for this cost, it just doesn't offer enough.  tldl: If you can look past some flaws and/or have infinite money to spend, this is a good grab. Not worth 20€, probably not even worth 15€ at 1.1 patch. If you can get it sub-10€, get it. ",
            "review_score": "-1"
        },
        {
            "review_text": "There are plenty of other reviews that can get more specific, and this one won't get high enough rated to influence any decisions anyway. So, I'll keep this short and simple.   It's the standard almost great experience, with one fatal flaw that gets denied to the death by 'true fans' and will never be fixed. If you liked MOO2, you'll love. Otherwise, I recommend Star Drive 1. It has everything you'll enjoy about this one, with none of the stuff that will leave you feeling like you had a bad experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Slow Start, Slow espionage, really slow diplomacy, lack of any Defaul population job managment, overly simplistic battle controls.  All in all its a great game if you are a moder or use mods an change just about everything about the core game.  Also great is you LOVE to micro manage things, just need a execute population button an it be perfict....   I liked some of the ship building, was well done, the races having personalitys was well done an the tech advancement was alittle confusing at times but ok over all, thats were it stoped though, the rest of the core game needs much love.",
            "review_score": "-1"
        },
        {
            "review_text": "Since Master of Orion II I have experienced a few notable contenders that have tried to recapture the same magic. Sword of The Stars, Endless Space, and now StarDrive 2. StarDrive 2 is the closest direct copy with (semi) modern visuals with the majority of its gameplay lifted strait from MOO2. Corn/Hammers/Beakers with Civ style buildings make up the majority of colony management. This is an exact replica only slightly tweaked by the maintenance cost of buildings forcing actual choices (that the AI is unprepared to make). Design wise this comes off as a fan patch that makes sense in the context of MOO2 but has no life of its own.  The stolen content is the best part of the game.  Anything that was not mathematically or superficially lifted from the original is incredibly unpolished. The entire experience is like a house built with only a photograph as a reference. The AI does not know how to design ships or manage its empire, The new ground combat is a tedious slog of looped animations, and the 'real time' space battles (though nice looking) are not decided by player commands just the ships you carefully designed. It is reminiscent of gratuitous space battles except because you designed decent ships you can take on 5x the chaff that the AI is stuck with.  I can not recommend this game to anyone who has never played Master of Orion II and even then not at full price. On the outside it looks and feels exactly like the MOO2 you may fondly remember while running on modern hardware. It scratches the itch in a way that irritates as much as it satisfies. At the time I write this the developer is making severe content and balance changes and this game may become a late blooming gem like Sword of The Stars one was. However, the developer ditched fixing StarDrive to make StarDrive2 and the problems above may just get dropped for StarDrive3.  *Breaking news* $10 DLC to address gameplay shortfalls of an unfinished early access game. Buy now! Buy later! Buy until StarDrive1 is finished in StarDrive4",
            "review_score": "-1"
        },
        {
            "review_text": "The Game is glitchy as hell and the developers don't seem interested in patching it.",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable due to several game-breaking bugs. Shouldn't have been released in the current state. Utter waste of money. Uninstalled. :(",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to recomend this game, and I really hope in not too long a time as the game is polished I will be able too.   At the moment it just feals like it could have done with a while longer being tested and the bugs and balances worked out. It's got a really nice narrative, the races and interactions with the AI seem to have had alot of effort put into them which is lovely. The ship system and tech works really well overall other than needing a little balancing and work.   Unfortunatly there are many little bugs that make it difficult to play, especially late game ships seem to constantly over shoot their target, anomalys appear that can't be ineracted with, admirals become practically useless as their ships can't be upgraded, multiple occasions have had my own fleets engage themselves (litterally end up fighting a replica fleet), severe lag with massive fleets that the AI will envitably create in a long game.   As I said though I hope in afew weeks I will be telling all my friends to give it a go.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems that you build up a fleet, You think your doing good because your keeping the pirates at bay, then an AI makes a steep demand, you refuse, you go to war they send a small fleet which you smash, followed by a MASSIVE fleet which uterly destroys your now tiny fleet, they take over each of your worlds one at a time while you struggle to build a couple ships for a last stand... sound familiar?",
            "review_score": "-1"
        },
        {
            "review_text": "Hello!  i really must   WARN  you of these moneygrabber developers; after neglecting this game's bugs and missing core features in the game forever, instead of finally patching it to the degree it should have been from the start,  THEY RELEASE A DLC THE NERVE and then they push you to buy the dank 4ss dlc by implementing a trailervideo that is shown in the main menu all the time! Nice going, the devs had time for implementing that yet are incapable of giving the ai even the most rudimentary set of intelligence in spacebattles, that is not 'gung-ho charge frontally' or a sensible fleetmerging strategy.  and just watch the dlc trailer.  it literally says 'BUY BUY BUY!' 'GIVE US MONEY!' in the trailer.  way to go zeroSum &amp; iceberg  ______  the game itself in the current state is passable for a game in late betastage at best. Core features are mostly intact, the shipdesign aspect is quite fun and the techtree is o.k. too as it lends plenty features from classic MOO and other 4X space gameseries.  The ai however is dumb as they come and also cheats. In spacebattle, they just charge you straight with predefined shipdesigns, a tactic which is quite easy to counter, particularly since the weapons are STILL unbalanced. Diplomatic interaction is random and rudimentary but working. The best here are the beautifully animated race pics with race-custom textreplies. Audio and visual presentation are solid albeit far from top-notch.  _________  if you see the devs, make sure to punch them in the face",
            "review_score": "-1"
        },
        {
            "review_text": "I HAVE GOT THE GAME AND I CANT EVEN ♥♥♥♥♥♥ PLAY IT I HAVE SPENDT HOURS TRYING TO FIX THE ISSUES WITH ME HAVING NOTEXT IN MY DROP DOWN BARS ON MENUES OR VLAUES OF ANYTHING ON RIBBIONS AND I HAVE MESSAGED 'CUSTOMER SERVICE' IF YOU WILL CALL THEIR SHT ULTIPLE TIMES WITH NO RESPONSE SO ♥♥♥ THIS ♥♥♥♥ ZERO SUM AND THANKS FOR STEALING MY ♥♥♥♥♥♥♥ MONEY AND ♥♥♥♥♥♥ ME RIGHT AFTER WITH YOUR SHT CUSTOMER SERVICE AND BROKEEN ♥♥♥ SHT",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥. Do not buy this game. Every single aspect of this game is THE MOST INCONVIENENT THING you will ever do. GO BUY STELLARIS.",
            "review_score": "-1"
        },
        {
            "review_text": "Love it, a great improvment over SD1. Don't believe the butthurt comments, if you like 4x you'll love this - if you don't like 4x but like a good game in general, you'll like his aswell.  a few random crashes though (it autosaves all the time so, meh), but I'm sure they'll get fixed soon enough.  EDIT: don't trust this guy, he was still all bu♥♥♥♥ailed and glassy eyed over the all the new things(which are few), game is a buggy mess and dull. Needs much more polish.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10 robo bug titan is not even cant play game without breaking out in hives beacuse of this   For real tho m8 respect the dev but they REALLY need to fix the ai and make the ai actually play by the same rules as the player so that every play through I dont feel cheated I only began to realise this after my third playthrough. I will change my recommendation when this is fix but for now it will remain",
            "review_score": "-1"
        }
    ]
}