{
    "app_id": 252630,
    "name": "Eldritch Reanimated",
    "release_date": "2013-10-21",
    "developer": [
        "Minor Key Games"
    ],
    "publisher": [
        "Minor Key Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Rogue-like",
        "Lovecraftian",
        "Indie"
    ],
    "achievements": 15,
    "positive_ratings": 1556,
    "negative_ratings": 210,
    "price": 9.99,
    "description": "Eldritch is the original imsim roguelike: a first-person action game inspired by roguelikes, immersive sims, and H. P. Lovecraft.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252630/header.jpg?t=1555631495",
    "minimum_requirements": "OS: Windows XP DirectX: Version 9.0c Storage: 150 MB available space",
    "recommended_requirements": "Graphics: Dedicated graphics card",
    "reviews": [
        {
            "review_text": "I don't think I've had this large a change of heart on a game in a long while. Going into Eldritch, I lost hope almost immediately. A combination of mediocre voxel environments, cartoonish bad guys, goofy sound effects, and stab-happy gameplay just didn't really jive with the whole Lovecraftian aesthetic it claimed to be rocking. Thirty minutes in I'd realized I'd come across pretty much every item I was going to see. An hour in and I'd conquered the first world, having at no time felt threatened by anything I faced. I entered world 2 for a few minutes, finding more of the same. Apart from my grudging admiration for the simple-yet-effective 3D minimap the game uses, I came to the conclusion that there was nothing here worth playing any further for. Bored and angry, I set the game aside for a while, wondering why anyone would publish so straightforward and sloppy a first-person shooter and decide to slap a Lovecraft theme on it.  Coming back to it on a whim, I re-entered world 2 and dug a little deeper. Suddenly, things were different. The difficulty spiked up nicely, adding opponents that required actual strategy, that I couldn't just flail wildly at and never worry about again, that left me feeling more than a little nervous. And then I died, though I'm not exactly sure how. I rushed back in, suddenly stripped of all my magic armaments and life boosts, and last less than half as long. Eventually, I figured out what's going on, learned how to dodge the traps, realized that stealth and discretion are actually necessary to survive, and on I went to a fun, twitchy, jumpy run through the rest of this Eternal Darkness / Spelunky / Minecraft hybrid. It's not terribly deep; as I said earlier, you find the vast majority of the items you'll ever see in level 1, and while the monsters do evolve over time, there's not a huge amount of variety here. Oftentimes, new monsters will simply be beefier and shoot faster, but there's enough weirdness thrown in to keep the game fresh. Also, be aware that this is in fact a roguelike. Dying sets you back to the start with just short of all your progress erased, but thankfully this is a game which rewards knowledge every bit as much as it does lots of ammo and a pair of stealth boots.  Don't go into this expecting any kind of dignified cosmic horror experience. It's sloppy, it's fun, and it's got some nice retro vibes to it hearkening back to the first person shooters of yore. If you're not sure if Eldritch is going to be for you, gauge your reaction to the phrase, 'Cthulhu vs. the Ninja Assassin.' If that mental image doesn't ♥♥♥♥ you off, well hey, here's your chance to see it in action.",
            "review_score": "1"
        },
        {
            "review_text": "A game that presents you with everything you need from the start, and casually waits for you to learn its rules. It's a really refreshing time, and a pretty player friendly entry point into the roguelike/immersive sim genre. Levels are procedurally generated, but work from established tile sets that lead to familiar feeling levels; despite their randomized nature. It never feels unfair. The progression curve just feels really great. Definitely check this game out.",
            "review_score": "1"
        },
        {
            "review_text": "It's sad to see that this gem was lost in a dark heap of indie games, part of which isn't subject to comparison. I very much like H. P. Lovecraft's works, so, this game is impregnated by the interesting themes for me. Fishman,Cultist,Lizard,penguin...dark atmosphere,magnificent and atmosferic ost,difficulty,speed... Speed in this game surprises me, not because I am playing from first person, just because the speed of gameplay is increasing by in process of your skill growing. Try to beat this game with clamping Shift and jumping all the time, it's interesting feeling I say. This game taught me that dynamite is my best friend, and that dynamite can always open a passage for you everyplace where you want to go. Oh god...somebody making weird sound...IN MY HOUSE! Okay, this review ia over, I have to go and worship the great ǫ͜͏g̶̶̢̛a͠ḑ͡i͞n̴̡͜... In conclusion, this game is worth the paid, and I want to see MOAR games like this in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the visuals fool you. This game is creepy!  You don't need to be stealthy, but believe me, caution it's your best choice.   What's around the corner? Don't be afraid to take a sneak peek. It's better you find the monsters before they find you. Enemies can hear your steps and follow you all the time. They even can open doors, so you'll never be safe. Also, you'll do everything to don't die. Every life matters.  All in all, Eldritch it's a game to be played slowly. Keep in mind that there's not much action here. Instead, there's a lot of tense moments and a great feeling of satisfaction when you can finish a stage alive.  How long can you survive in this hostile world?",
            "review_score": "1"
        },
        {
            "review_text": "SIMPLE EFFECTIVE DESIGN ALL AROUND!   The GUTS  simple effective graphics that are cute AND creepy excellent sound design gameplay that ebbs and flows, combines thoughtful stealth with risky action limited inventory makes small decisions about what tools and spells to bring with you very meaningful controller support the difficult and compact randomized play experience offers replay value ",
            "review_score": "1"
        },
        {
            "review_text": "Engish: My friend is found Pirate Version on small russian site... I'm try to play this «new strange game» on his notebook... and I like it! Soon became a enormous fan, I bought it on Steam, translate, read all news, etc! So, I recommend it to you with great certitude! It is worth the money!  Українською: Мій друг випадково помітив піратську версію гри на невеличкому російському сайті... Я вирішив спробувати пограти у «новеньку дивну гру» на його ноутбуці... і чорт забирай, вона мені сподобалася! Незабаром я став запеклим шанувальником, придбав гру на Steam'ові, переклав її на українську, слідкую за всіма новинами, тощо! Тож, я щиро рекомендую вам цю гру! Вона варта витрачених грошей!",
            "review_score": "1"
        },
        {
            "review_text": "Eldritch is a great game   Gameplay is tough, but fun: initially pretty hard (and terrifying), but becomes easier once you're familiar with the enemies and level layouts. Plays a little like a 3D version of Derek Yu's Spelunky, but that's a poor comparison. Involves a nice blend of action with stealth (required on the later levels). Roguelike elements - level generation, item placement etc. makes each run feel fresh. Graphics are really nice, particularly the enemy models, and the atmospheric music and sounds are perfect.  Whilst the main levels are pretty short, it'll take you some time to actually finish them. The new game+ mode is challenging even for veterans. The two 'bonus' levels offer a great amount of additional playtime: a super-long level and a challenge level, that you will be playing again and again to get that 500 souls achievement. The inspiration from lovecraft is a nice touch, especially since I'm a fan of his works (although the relationship to his original literature is pretty weak).   Overall: Excellent game, fun with a lot of replayability.   Also contains achievements that are damn near impossible. I'LL 100% IT ONE DAY, MARK MY WORDS.",
            "review_score": "1"
        },
        {
            "review_text": "For the sounds of the Fishmen alone its worthy of a purchase.",
            "review_score": "1"
        },
        {
            "review_text": "A rather enjoyable 'roguelike' that pays good homage to its Lovecraftian roots, though a little overly cute at times (Those Shoggoths dawwww) and a little tedious when treking about blind. It is still a lot of fun and a great Lovecraft game in an empty sea of games that should be made based on Lovecrafts works!",
            "review_score": "1"
        },
        {
            "review_text": "Heard a familiar gurgle. Jumped gleefully out of my hiding spot. Expected a fountain. Ran into a Shoggoth. It screamed. I screamed. Climbed back. It jumped and followed me. Tried to build walls around it. It escaped and got tired of me, ran after the Fishpeople.",
            "review_score": "1"
        },
        {
            "review_text": "Eldritch is one of the finest examples I have seen of a game that has both simplicity and complexity harnessed in exactly the right measures. The result is a game that is both infintely enjoyable and completely understandable, which is a real rarity. When you couple that with the incredibly well-executed theme, and the sheer polished feel to the whole thing, Eldritch has earned itself a slot on my shelf of all-time-favorites.  The concept is simple: get to the bottom, stay alive, retrieve the thing. But along the way, so many things can go so horribly, horribly wrong that the sense of satisfaction when you finally put your hand on your goal(s) is profound. Each world playes by its own rules and demands different approaches, while everything is at the same time built upon a consistent, understandable basis. Amazing. This is rogue-like done extraordinarily well.  And, it's got Shoggoths. What's not to love.",
            "review_score": "1"
        },
        {
            "review_text": "Only buy this on sale. It's insanely fun however short af. Not worth $15",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere and sound design are all that are needed to reccomend Eldritch, and that's without even considering the fantastic simple gameplay mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Tense, atmospheric, and to the point.",
            "review_score": "1"
        },
        {
            "review_text": "Considering ive only played 6 hours of this, you might think i am not qualified, but i can tell you a good part about this game from this point.  Below will be pros and cons.  First, to say, this game is WAY to expensive for what you get. It is a great game with trading cards, and there is hardly anything WRONG with it, but charging 15 dollars?!?!? Binding of Isaac has way more value and is 5$ when its not even on sale.  But the gameplay of this game is very smooth, and sometimes nerve wracking. The environments are actually destructible, and you can build on them, considering you have dynamite or a spell. The enemies aren't 'Lacking' anything, but they sort of just come at you and attack, if you want revolutionary AI, well, sorry.  It also performs great, and I KNOW, when i first played this it was on an old moldy potato. (I am upgrading)  Pros and cons:  Pros: +Great performance +1 +Trading Cards (Which, are, btw, really cheap on the Market) +1 +Full controller support (Believe it or not, it really is good) +1 1/2 +Nice environments and a somewhat creepy atmosphere +1 +Cool weapons and spell system +1 +Random generation +1 1/2 Bonus +2 because it is a good game.   Cons: -Really expenive (Really, wait for a sale, at LEAST 50% off) -2  1 Its a fine game, you just dont get 15$ worth -Atm, it seems you are paying for THIS game, which is fine and not buggy as far as I can see, but ya never really know -1/2  I would say, 8/10. I DO recommend this game, but not at full price. (And then again, i NEVER recommend a game at full price, WAIT, 4, A, SALE XD)  ",
            "review_score": "1"
        },
        {
            "review_text": "Eldritch is a first-person adventure game in which you explore Love-Craft inspired dungeons. Eldritch is like mincraft in graphics only. The game provides a fun adventure, and it's constant updates provide extra levels. Althoug hmany would consider this a rogue-like, I would say it's more like a lite-rpgfps. I will recommend this, but don't excpect too much.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this from a humble bundle. At first, I was iffy on playing it, but in attempting to get my card drops, I found it to be pretty fun. It's not super easy to understand, but the gameplay is fairly solid and definately worth picking up if it's on a good sale.   Solid 8/10",
            "review_score": "1"
        },
        {
            "review_text": "You wouldn't think a voxel-based game could do horror well, but it is quite frightening. Excellent music and sounds create an atmosphere that keeps my heart racing, ever fearful of what may lurk around the corner.",
            "review_score": "1"
        },
        {
            "review_text": "An FPS adventure which will keep you on your toes.  Difficulty curve grows a bit oddly in the main game, it's an issue which has been taken care of in Mountains of Madness (MoM) -expansion's content. Also, the main game in normal mode is beat quite fast. That being said, 'New Game+' mode is for those who won't be satisfied after their first playthrough.   The main game consists of an usual playthrough and a more story-driven, a tad more difficult one ingrained within the game world. I won't go any further on that, since one will come across it and eventually decide the way they will continue on: rest assured you will find this to be an enjoyable aspect. MoM's progression is more straight-forward on the other hand, it's flavour coming from challenges thrown at the player as ventured forwards.  Another thing worth mentioning is the soundtrack. Not many other games have so brilliant ambient sounds, consisting of droning electric guitar walls, to create such a gloomy atmosphere. If the graphics and gameplay won't bring up Lovecraft, the soundscape of the game will.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended. The game has its flaws, but they are overshadowed by its successes.  Before I begin, you should know that I do not play many first-person shooters, and almost no horror games to speak of. Eldritch is not a 'horrror' game per se, but seeks to encourage a similar atmosphere and as such was a newer experience to me than it might be for many others.  Eldritch is a strange combination of Lovecraftian horror and first-person-shooter that somehow managed to blend its disparate elements together very well.  Anything with a Lovecraftian atmosphere should attempt to mimic the tone and atmosphere of its inspiration - the entire point of which was to make the reader feel not only helpless and hopeless, but utterly insignificant. First-person-shooters, on the far end of the spectrum, are most often about empowering the player to often absurd levels, though recently the trend has been to take a more 'realistic' disempowering approach.  If you're willing to jump into the game with your eyes closed - which is easy, as the trailer gives off the entirely wrong atmosphere - the game can begin as very disempowering, and even very unsettling. The use of FOV, lighting, background noise and uncanny help to establish a horror setting early, but still leave the player plenty of room to maneuver. The feeling of uneasiness is sadly fleeting for most of the game, however. Once you learn how the stealth system works and how the enemy AI reacts, most of the game is actually fairly easy. The 'eldritch abominations' usually die with a few whacks from a knife or shots from a pistol, and an easily-locatable backpack item lets you revive as many times as you have enough artifacts (in-game currency) to afford. Towards the end of the game, presuming you have the presence of mind to find the three special (useless) equipment items, the tone shifts toward disempowerment again. Some enemies will either be very strong or downright invincible, and once you're no longer able to slip past them like a whisper or revive yourself after death, the feeling of uneasiness returns as you realize that it will only take a few mistakes to end the game. Usually, that is not a terrible consequence, but because dying in Eldritch results in having to start over from the beginning, it (often) means losing hours of progress. This was a good design choice, I think, because it makes the closing of the game difficult and forces the player to adopt extra caution in their movements.   This game is not the strongest example of first-person-shooting, exploration, Lovecraftian horror or even unease-inducing atmosphere on Steam. But it does each job well enough to blend into something interesting and, to my eyes at least, unique.",
            "review_score": "1"
        },
        {
            "review_text": "You wouldn't think a voxel-based game could do horror well, but it is quite frightening. Excellent music and sounds create an atmosphere that keeps my heart racing, ever fearful of what may lurk around the corner.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun little casual roguelike. Its alot of fun, right, simple, fast. Good simple stealth mechanic. It requires a little patience and skill but it never sets you back too far you when you die. And a few extras levels added by the developer for fun after the games release.  Ignore the simple visuals and give it a try. You can't help but like it. Definitely for $5.",
            "review_score": "1"
        },
        {
            "review_text": "Game is presented like a roguelike - its not, there is nothing like enough item veriety in the game to justify that title, but it's still an entertaining game. if you like lovecraftian worlds and like a slower pace of action game this comes recommended",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game heavily inspired by the works of H.P. Lovecraft. It is frustrating but it's worth it if you like FPS games, rougelikes, stealth games, or the Cthulhu Mythos.",
            "review_score": "1"
        },
        {
            "review_text": "Stole a fishperson's boots and got fireballed to death 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's goofy as heck but it's kinda fun and kinda cute. Also packs a spook or two!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't felt this insane since Sherlock Holmes: The Awakened, it's like I am actually stabbing these Shoggoths for real. This game would make a great party game for when you decide that all of you have had way too much to drink and begin realising that maybe macro isn't such a bad kink, you whoop this out and before you know you'll be vomiting blood in each other's mouths and start sacrificing your dogs to The Old Gods, and summon Chthonians for cheap vore porn.  And that's when your father walks in the room and asks if you and your friends want snacks.  Goddammit dad we're busy here geez do you know how to knock urgh parents right.",
            "review_score": "1"
        },
        {
            "review_text": "AAAARGH! Can't beat the 3rd world. In true roguelike fashion this game seems to take pleasure in cutting down any player who dares to grow confident in their amassed weapons, magic, and knowledge. Damn you Shub-Niggurath!  quite addictive tho, you keep trying again.  and dying.",
            "review_score": "1"
        },
        {
            "review_text": "Fun roguelike first person shooter. The art style is unique, probably love it or hate it. I personally enjoy the old school graphics but what I really enjoy is the solidly responsive controls. I also like shooting up shopkeeps and stealing their entire inventory bwahahaha. The game can be somewhat easy or somewhat difficult depending on what spells and equipment you encounter. Fun overall!",
            "review_score": "1"
        },
        {
            "review_text": "Best Rogue I have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Cthulhu mythos first person game set in a lo-fi world with stealth action and plenty of ways to die. Procedural levels, devious enemies, fun mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "One of cool games in my inventory. Like my friend once sad 'You like Minecraft. You like FPSs. You like puzzle games.' and he gave me this game with hope ill like it. Game is really great, and once you get into it, you can really enjoy. Choose the way you want to play it, stealth or run n' shoot (btw i prefer stealth). Story is preety cool and all who buy this game, don't forget to read all of the books inside :D. Game is really great, 9/10! (-1 becouse story is kinda short when you run trough game, took me 5h to complete the game.)",
            "review_score": "1"
        },
        {
            "review_text": "Its odd that a voxel based game is still able to freak people out, but its certainly true of this one! Fairly simple game play but enjoyable thus far, lots of sneaking around and exploring with the occasional being devoured by horrors from beyond the stars!",
            "review_score": "1"
        },
        {
            "review_text": "i have no idea what this game is",
            "review_score": "1"
        },
        {
            "review_text": "Stealth based quake 3 style bunny hopping easy to hop into amazing art style roguelike with great weapons and great music  10/-2390239032902309239032",
            "review_score": "1"
        },
        {
            "review_text": "From playing about halfway through, it seems like a 3D Spelunky-type game. Fun, but not as polished as Spelunky.",
            "review_score": "1"
        },
        {
            "review_text": "Stealth based quake 3 style bunny hopping easy to hop into amazing art style roguelike with great weapons and great music  10/-2390239032902309239032",
            "review_score": "1"
        },
        {
            "review_text": "Great game. RL with stealth.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, old school, dungeon crawlin', Lovecraft inspired, retro feelin', god killin', sneaky stabbin', bomb flingin', six-shootin' fun for all the family",
            "review_score": "1"
        },
        {
            "review_text": "At first glance you may not expect the Lovecraftian atmosphere to be highly present, but it is. In particular, the mumbling of the cultists and the creepy breathing of the mummies sends a chill down my spine. You have to hide, observe your surroundings, and plan your next move if you want to survive.",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't have a lot of depth, it's not always that scary, but chances are if you think you might be into it you will enjoy it. In that case, buy it. There are horror elements, and it CAN be scary. Those first few hours and every time you enter a new area, it is actually pretty creepy.  It's got elements of Dishonored, Deus Ex, Minecraft and a few more and they jell better than you may expect them to.  Just know it's not really a brutally difficult survival horror game.  It's a game that wants you to mess with its mechanics and see how you can exploit it, see how you can find a different way of getting around an obstable.  That lack of real depth does make it very accessible however, and the base gameplay is still fun. My only real issue with the game is the level generation doesn't always make the route the the exit easy, sometimes requiring TNT to bust your way through.  Note: If you are not finding it difficult enough, my best suggestion is to die and then try that same level again. Thanks to fountains and slowly accumulating resources, things do get easier as you keep playing. Each of the three areas you can unlock (possibly the expansions) is balanced for you having succeeded the previous one and accruing items from that. This does mean difficulty doesn't really raise more than slightly, although this may differ by your playstyle (Those ♥♥♥♥ing statues in the second area are brutal). Even just not having the Compass you get for free in the first area makes the game significantly harder.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of H.P. Lovecraft's mythos, or just enjoy some simple Roguelike exploration, Eldritch is 100% for you. Four worlds as of the time of this review, each one based upon various stories and beings within the Cthulhu mythos (including the infamous Mountains of Madness), brought to you in a Minecraft-style first person perspective. Randomly-generated procedural labyrinths, some rudimentary resource management, mystical powers, irritable shopkeepers, dungeon exploration, death traps, invincible Shoggoths... it's all there, watching. Waiting.  Welcome to the Library.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of H.P. Lovecraft's mythos, or just enjoy some simple Roguelike exploration, Eldritch is 100% for you. Four worlds as of the time of this review, each one based upon various stories and beings within the Cthulhu mythos (including the infamous Mountains of Madness), brought to you in a Minecraft-style first person perspective. Randomly-generated procedural labyrinths, some rudimentary resource management, mystical powers, irritable shopkeepers, dungeon exploration, death traps, invincible Shoggoths... it's all there, watching. Waiting.  Welcome to the Library.",
            "review_score": "1"
        },
        {
            "review_text": "so fun you'l have a great time plating it",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would NOPE again.",
            "review_score": "1"
        },
        {
            "review_text": "It's neat. It isn't STELLAR but it's far from bad. Just get over the IS MIENCRUFT block ♥♥♥♥ and you're good to go. You don't even build anything.  '9/10 its okay' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game so far! this game is pretty interesting and appears to be quite in depth. One downside though, is how easy it is. As i've only played this for a small amount of time i cant really provide much information. But on my first runthrough, i completed the first book and ended up with 263 of the currency (alot) A destruction amulet, a lockpicking kit, a revolver, some tnt and 8 bullets. I also have 5 keys, but they are now useless due to the kit. Overall, a brilliant game and i'm looking forward to more of it! Also, bunnyhopping is in this, i'm unsure if this is intentional but its really usefull to run away from things, unfortunately it makes a LOT of noise, so use it wisely!  EDIT:   as i've progressed, i've seen the game get harder, if ease was a problem, it isnt later on :D I love the enemy design and how the dev expanded on it, making more worlds!",
            "review_score": "1"
        },
        {
            "review_text": "There's cultists that could be bashed by rocks, fishmen that could be bashed by rocks, weird sand men thingy that could be bashed by rocks but it will revive again so why bother, shoggoths that DEFINITELY COULDN'T be bashed by rocks, and statues that's immobile and doesn't do anything but spoiler: if you look away from it it will hurt you, but if you look at it again it will just pretend to be immobile boring statue, and  it couldn't be bashed by rocks.",
            "review_score": "1"
        },
        {
            "review_text": "This game is 15$? i got it on sale 4 0.49$ XDDDDDDDDDD. anyways this game is a really good game. I'd suggest you wait until its on sale because 15$ is ALOT for this game. The only thing i would say to the creators is to make more maps and add new weapons and different thingzzzzzzzz ~YoMama2015/2016/2017xddddddddddddd",
            "review_score": "1"
        },
        {
            "review_text": "F*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues f*ck the lizard statues.   PROS",
            "review_score": "1"
        },
        {
            "review_text": "If you don't mind the graphics, it's a really fun atmospheric game.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game. Choices dramatically impact gameplay, randomly generated areas keeps things fresh, and there is a surprising amount of depth in a game with only a handful of items.  Definitely worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "I'll keep this short and sweet: This is a rouge-like shooter with Lovecraftian themes. If you enjoy either of those things then purchase this. Purchase it right now.  It may look silly, graphically speaking, but this is NOT an easy game. It is harsh and unforgiving. And kind of terrifying when you get into it. So if you're looking for something casual then look elsewhere.  Graphics: 10/10 - They fit it perfectly, so far as I'm concerned. Audio: 9/10 - There's the occasional audio glitch for me, but it's nothing too terrible. Gameplay: 9/10 - I am a coward who wishes there was more carry-over between deaths. Story: 8/10 - It's delivered in the old school survival horror way (i.e. you find journal entries of deceased explorers). There isn't too much there, but it isn't needed.  Overall: 9/10.  Purchase this game while it's still half-off!",
            "review_score": "1"
        },
        {
            "review_text": "Put in a solid 7 hours and barely touched the extra ice world. I'm usually not into Roguelikes but I loved the style, atmosphere and figuring out what each item does.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. Scarier and more Nerve-Racking Than It Looks, Plus the stress of getting out of a dungeon with your collected loot is quite high considering once you die you lose everything unless its in a chest.  Pros: Old School 'Dungeon Crawl' Experience complete with NPC-controlled shops and some neat loot and creatures. Challenging  Cons: This can be seen as a con to some, but lack of thorough explanation of the game. Meaning: The game doesn't baby you and tell you what each thing does and how each monster behaves. You have to figure it out for yourself. That's not a bad thing, because discovering how it works and developing your own playstyle is fun an rewarding. But to some this will cause a challenge, but then again this game as a whole is a challenge. Enjoy. ",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of my favorite rogue-likes out there right now. It's simple, yet a ton of fun. And between the stealth, weapon types and different spells, you can play through it a few different ways. This one is worth the cash.",
            "review_score": "1"
        },
        {
            "review_text": "Lovecraftian based rogue 3d procedurally generated FPS survival action horror. SAYING ALL THOSE WORDS TOGETHER IS SO AWESOME YOU SHOULD JUST GO BUY IT. Trust me. ",
            "review_score": "1"
        },
        {
            "review_text": "Catch it when it's on sale for 50% or less. It's really short, the AI's aren't too intelligent, the story is shaky at best, and the variety of everything is pretty limited. Even so, it manages to have a good atmosphere, simple but strong control set, and is an admirable game for just one guy to have put together.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but spooky First person horror thingy .hugely addictive loving every moment apart from the 'totally not weeping angel lizards' - 2/10 game of the year",
            "review_score": "1"
        },
        {
            "review_text": "punch all the penguins",
            "review_score": "1"
        },
        {
            "review_text": "Spooky music, Minecraft graphics, Silly yet kinda creepy looking monsters, lots of action, stealth, magic and rpg goodness!  ",
            "review_score": "1"
        },
        {
            "review_text": "About halfway through my most recent playthrough of Eldritch, I realized I'd stopped playing it like Doom and started playing it like Thief. That was a very cool achievement for a roguelike (albeit one that plays more like Spleunky than Nethack). The game has consistently surprised me, from the enemy variety to the well-crafted 3d random level generation. Even the voxel art style isn't as obnoxious as I'd expected. I'm not sure how Eldritch will hold my interest in the long-term, but it accomplishes a lot with a little and I really respect that.",
            "review_score": "1"
        },
        {
            "review_text": "Strangely addicting! Terrific sound design, outstanding atmosphere, and despite what the screenshots may imply, this is a good looking game, as well. Can be beaten in 6 minutes, but I played for 15 hours and still haven't completely exhausted its depths. HP Lovecraft fans, grab this.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it looks like something from the 90s, but who cares? It is a well-crafted stealth/action game that introduces new elements at a measured pace. It forces you to make important decisions with your weapons and tools and to improvise based on what you have on hand.  For example, there's a corridor that's lousy with statues that teleport behind you and beat you up when you look away from them. But they have to notice you first. It would've been nice to have the invisibilty spell, but I did have the block-creation spell and something that let me dig. One hole in the wall and careful line-of-sight blocking and I was on to my goal and feeling quite pleased with myself. ",
            "review_score": "1"
        },
        {
            "review_text": "WHAT THE EFF ARE THOSE GIANT GUM DROP MONSTERS",
            "review_score": "1"
        },
        {
            "review_text": "An FPS/Roguelike inspired by H.P. Lovecraft's tales? Sold!!! And is very well done too!",
            "review_score": "1"
        },
        {
            "review_text": "i enjoyed this game for a bit  then there were weeping angel lizards.",
            "review_score": "1"
        },
        {
            "review_text": "If you buy this game (and you should), be prepared for the day you decide to throw TNT at a wall to see what's behind it, and find a group of Deep Ones, Cultists, and various other nasties, before they all decide to converge on you. As they get closer and start dealing damage, you start to jump around, punching like a madman because you just started and the only thing you had found so far was the TNT, avoiding hits and cultist fireballs like a gazelle on meth, until you pause and look at all the dead bodies of your enemies. After you loot them and walk away, feeling pretty good about yourself and all your new Artifacts, you jump a chasm too early and fall to your death.   (Review was based on a true story)",
            "review_score": "1"
        },
        {
            "review_text": "I was introduced to this game through Steam's family share and enjoyed every minute of it, start to finish. I would definitely purchase it for myself and play it all again, if it weren't for the price.   So I sit and wait patiently for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little big game. Provide a decent challenge for stealthy play types, and a challenge for speedrunning or guns blazing. Fun and creepy (at times)  It is definitely worth the price when on sale. It is only worth full proce if you intend to play it to the end.",
            "review_score": "1"
        },
        {
            "review_text": "Next generation graphics, IGN rates 10/10 because ♥♥♥♥♥ shaped hands are in style.",
            "review_score": "1"
        },
        {
            "review_text": "Not scary at all, but it is fun. Azathoth is terrifying though. ",
            "review_score": "1"
        },
        {
            "review_text": "Rogue like fps/rpg dungeon crawler with Cthulhu sign of. You gather items you use againts monster. Prey to gods and try to get to end of a place you will go too. And read some books, books are cool.",
            "review_score": "1"
        },
        {
            "review_text": "amazing!!!!! i love this game soo much alot of fun worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "I was really surprised by this game. Great concepts and mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "I have a particular interest in first-person realtime roguelike dungeon crawlers. If you've stuck around for that 8-word (or 5 combo-word) genre description, stick around for more because I'm gonna tell you what I think Eldritch does right and wrong by that genre.  I want to sing some praises of the game. Character Control - Lean (left and right), crouch, slide (run/crouch), mantle (ledge climb). As simple as these four mechanics are, I feel they are essential for making a player feel like they are actually interacting with the environment instead of just... sliding through it with WSAD and jump alone. Third person action games are practically all Prince of Persia with the amount of climbing you do, but first-person games rarely attempt much. I appreciate Eldritch's effort here.  Interesting Enemies - There are a couple that really force you to play differently, and one in a way that I had never seen in a game before. Others provide some fun flavor that's just enjoyable to interact with.  Stealth - Most roguelikes don't feature any meaningful stealth mechanic. Thanks to the character control, Eldritch is very rewarding of careful, thoughtful advancement through its mazes. Since your character has little HP and healing is not terribly common, remaining in control of how you advance is essential to a sense of agency in a game that is otherwise random.  Here are some Meh issues -  Uninteresting Enemies - Most of the enemies have a boring fireball attack as their only offense. They are also highly predictable when pursuing you.  Shops - Too sparse and expensive. The 'bank' system which allows you store the game's currency from life to life isn't easy enough to access to make spending money worthwhile, which is a shame because some of the items really improve the experience.  Length and Difficulty - After 5 hours and only 8 deaths, I beat Eldritch. After you learn the enemy behavior, deaths only result from stupid mistakes or unlucky coincidences, so it doesn't give that broad sense of growth and education that good roguelikes have. The game also allows you to collect orbs to unlock 'shortcuts' to the later dungeons (there are 3 to unlock), but to actually beat the game you have to collect all the orbs in a single life anyway. So the shortcuts are only practical for practice, not for actual progress. The result is that the length of the game feels artificial and tedious, rather than hard-earned and rewarding.  The Ending - Getting to the end of a roguelike typically takes a lot of effort and it's nice to feel like your effort is tracked somewhere or you have some incentive to... do better or something. Eldritch says 'you won and it's anticlimactic,' in not so many words.  Feature Light - The game feels a little hollow, probably as a result of lacking variety in the game mechanics, enemy, and level event variety. This makes me appreciate the control mechanics even more.  Anyway, I'm glad I played Eldritch. It's made me aware of problems I'd have never considered for my own interest in the genre and it had its moments of excitement and inspiration. I'll definitely continue to play Eldritch as they release more updates.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It plays like Doom, looks like Minecraft and leaves itself open to play as you see fit. Randomized levels make every restart fun and as creepy as the first play through. And you will restart a lot! This game is tough!",
            "review_score": "1"
        },
        {
            "review_text": "It's like a first-person Spelunky. But stealth horror. Or action horror. It's so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "To think that I impulse-bought this in the last Steam sale... If I had only known I would enjoy it more than any of the big budget games I had been looking forward to I would have saved my money and bought a bunch of copies of Eldritch instead! If you're looking for a stealth-based, rogue-like with a heavy emphasis on 3D platforming and atmosphere, it doesn't get better than this. Most people look at a few screenshots, write it off as a Minecraft cash-in, and move on. The poor fools! They don't even know what they're missing!  One thing is true: the graphics are nothing special. They capture the very minimum of their subject and the surroundings. There are some nice color palettes though, and the blocky nature light is cast makes it very obvious if you can be seen or not. And although the textures are unimpressive, the random level design is just as fun to look at as it is to traverse. Thankfully the audio is spectacular. Echoed moans, gurgles, gasps follow you wherever you go and always make you wonder what's just below your feet. The minimalist soundtrack is just as compelling. Obviously it's not a toe-tapping good time, but it certainly puts you on edge and makes you feel... Well, weird.  'Weird' is really the name of the game here. This isn't meant to be made into a reaction compilation on your Let's Play channel. It focuses on the 'Weird Tales' aspect in favor of a more frightening experience. For those of you who have been waiting patiently for a Lovecraftian game to mean more than fishmen and tentacle monsters yelling 'Boo!', this won't impress you. Also I'm really sorry and you must be REALLY used to disappointment by now.  This kind of highlights the weakest part of Eldritch: Lovecraft's world is alien and incomprehensible, but rogue-likes are inherently games about monotony and understanding. To beat a rogue-like means minimizing risks, self-mastery, and knowledge, but Lovecraft is about inescapable, cosmic realities, where knowledge comes at a VERY high cost and these horrors can never be beat, only kept at bay.  Eldritch's greatest strength, the genuinly alien nature of the random levels, the strange monsters that can't always be killed, and the crushing atmosphere instantly undo the game the moment you know how to avoid all the traps and deal with all the monsters. The first playthrough is magical: learning all of the powers, items, weapons, traps, monsters, seeing all of these non-sensical worlds realized... It's all so daunting in a very Lovecraftian way. But when you start farming world 1 for artifacts, or you start gearing up for the harder worlds, it's already too late.  If you're someone who knows Lovecraft as that guy with the strange tenticle fetish, or you're someone who can put the Lovecraftian label aside and just take in the very dreary tone and solid rogue-like mechanics, then I'd pick this game up without hesitation. If you've been patiently waiting for the Mythos to finally be realized in a computer game, than you'll have to keep waiting.",
            "review_score": "1"
        },
        {
            "review_text": "Like others have said don't let the Minecraft graphics fool you, Eldritch is an amazingly fun complex experience that is equal parts Survival Horror as it is stealth game. The rouguelike elements make the game feel fresh all the time and the enemy types are a real treat for H.P. Lovecraft fans. At sale price it is a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Ran from a shoggoth, ate rotten meat, stabbed a cultist, fell into a spike pit, and finally got killed by falling ice spikes. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Spooky music, Minecraft graphics, Silly yet kinda creepy looking monsters, lots of action, stealth, magic and rpg goodness!  ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It plays like Doom, looks like Minecraft and leaves itself open to play as you see fit. Randomized levels make every restart fun and as creepy as the first play through. And you will restart a lot! This game is tough!",
            "review_score": "1"
        },
        {
            "review_text": "This was a really fun game I got for a very cheap price on a sale. I played it for 7 hours. I beat the game, and I think there was a hard mode or something I played for a little after that. I found the game pretty dificult, but I'm not great at video games.If you get this on a Winter or Summer sale or something, I would definitely get this, but if you're good at these types of games you will probably be able to get through the game pretty quickly and it might not be worth $15 (the current full price).",
            "review_score": "1"
        },
        {
            "review_text": "Fun for a low graphics game! Simply fun! The first time you play it you aren't quite sure what each monster does, most are harmless... Some... Like those... stupid lizard statues! Just... If you see a lizard statue... You know what? You'll figure it out. Totally worth the price of admission to this fun ride of a game. If you like Cthulhu-esk H.P. Love Craftian adventure, then this is a must have in your collection. Fun, Hard, and if you're good, fast paced!",
            "review_score": "1"
        },
        {
            "review_text": "While the game sadly peaks at the second level it is a great game overall. The levels are themed and are gradually more challenging but, aside from the bonus level, it only has 4 stages. The game is short, but it is also sweet. Being first person adds a lot to the scary factor to the game. While most times you'll only be worried about dying, the second stage has some very interesting features that make you nervous while you aren't watching your back.  Try to get this game on sale. It isn't worth $15, but it is certainly worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "H.P. Lovecraft themed dungeons in a roguelike package. Great gameplay and fantastic replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Eh, its alright. I think the biggest part is the atomsphere thats given when playing. Worth a bang or so.  (Not very productive reviewz)",
            "review_score": "1"
        },
        {
            "review_text": "Just got this on sale for £2. tons of fun and a quite surprisingly creepy atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Eldritch is a neat little First Person Action game with procedurally generated levels and a heavily HP Lovecraft themed setting. The player must simply navigat from one end of each stage to the other, fighting off various tentacled, disgusting, gibbering flavors of 'Oh god, kill it, kill it, kill it!'. Along the way, you find weapons and equipment and meat to aid your trek. The game strikes a good balance of risk versus reward through the gameplay. You can't take many hits without dying and healing gets a bit sparse later on, so caution is a necessity at all times, but without a good amount of excess exploration, you'll quickly run out of supplies. Monsters also drop items and respawn indefinitely, but charging out to kill things is always a bit risky. It helps to set a nice atmosphere that, while you have a lot of power over the obstacles you'll face, it doesn't take many mistakes to see you fail. It's a game that greatly rewards patience and caution, while swiftly punishes recklessness. This balance is highly reminiscent of Spelunky in the best ways. While the difficulty starts out a bit insultingly easy, it quickly ramps up into a perfect sweet spot of hectic tension. The selection of items and spells, however, could use a little work. I never really found myself deviating from the set of items I was using and quickly equipping myself with them each new playthrough. For this type of game, always having access to one's preferred loadout, seems a bit off. As a suggestion, perhaps equipment should wear out over time, forcing the player to make do with what they can scrounge up, which seems more suited to this type of game. As for the spells, I think there just need to be more that can compete with the utility of Materialize. I mean, come on. The musis is good, and doesn't interfere with the profoundly important cocktails of squaks and hisses emanating from potential nearby threats. The graphics are, well, modest. It's not exactly going to push the limits of anyone's system , but you can tell right away what everything is supposed to be. Well, not the monsters, but that's not really because of the graphics. One complaint I have to make is that the particle effects have an annoying linger about them, especially the one coming from the player's left hand at all times. I frequently found myself jumping, thinking I had seen something out of the corner of my eye, only to realize it was an errant particle from the trail I was leaving, which was a tad irritating. On the whole, there isn't really much content here, but what there is is very well made and fun to play. I highly recommend this game to people who enjoy Spelunky and other similar games.",
            "review_score": "1"
        },
        {
            "review_text": "This 'pre-alpha' has great content. Hours of gameplay comparable to full titles out there. More animations would be nice. The sound and visual effects are great. If you like Call of Cthulhu, creepy ambience, cute monsters snoring as they sleep, stealth elements, randomised levels and horror themes (it's not scary!). This game would be great to see with co-op. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I love Eldritch but the funny thing about it is that I was at first disappointed (I initially thought there would be more backstory/adventuring involved, but I had little understanding of the type of game it was at the time, so that’s on me and in no way should it throw anyone off from enjoying it!).    It’s only after putting 12+ hours into it that I now realize how great it is as far as rogue-likes are concerned. Sure, there’s perma-death but you’ll keep the cash-monies you had in your bank chest upon resurrecting/exiting then restarting. Also, if you’re new to this game the Mountains of Madness, Asylum and Halloween/Pumpkin additions were added after its release, for free!   There’s a good bit of strategy involved if you wish to beat the 3 missions (MoM, Asylum and of course the library the game takes place in). Pickaxes, dynamite and even a charm that gives the gun the ability to fire bullets that break the environment (all of which do it Minecraft-style) can be utilized to your advantage. You can even pick up different kinds of packs, like the med pack that can revive you upon death as long as you have 50 gem thingies (‘artifacts’ as the game puts it) to spend, and boots that can grant different abilities, like high jumping and speed.   Be warned, though the enemies may look ‘cute-ish’, they can be, and often are, downright deadly! And In keeping with the lore of Lovecraft and the retro/blocky graphics, the enemies look great in that classic, cheesy 50’s era way.   On a final note, though Eldritch is certainly humorous at times, it’s still a horror game at its core and it certainly does justice to the godfather of modern sci-fi/horror, the man and legend that started it all, H.P. Lovecraft --- R.I.P. good sir, you live on through us all!! ",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderfully charming yet intense game! It is one of (if not the) best rogue-like first person dungeon crawler I have played. Excellent game worth hours of fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. It has a sort of minecrafty asthetic to it even though block placement isn't really a part of the game. To be totally far, however, there are a few items that actually will allow you to place/destroy blocks.   This game is set in the Cuthulu mythos, but it doesn't really have much to do with any actual lovecraft story. Lovecraftian monsters and archetecture just fill out the level design.   If I had to pick a game to compare this to, I'd have to go with spelunky. This game really does feel like a 3D spelunky. You start on the top floor of the level and have to progress through traps and enemies in order to reach the bottom.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I play it with my cousin alll the time. I just wish it had more content such as more items and levels. However it was fun nonetheless, and I would recomend playing with a friend or relative.",
            "review_score": "1"
        },
        {
            "review_text": "So frustrating in a good way!",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the charming graphics fool you, this game can and will make you paranoid as hell. There's nothing quite like trying to navigate a series of hallways or rooms while the slimy bubbling of an unseen shoggoth follows you around constantly.   Pros:  Randomly-generated level layouts Secret rooms and item caches Frustrated Deep Ones Smooth controller play Some player customization Moody music Sneaky boots Eating beetles Penguins  Cons:  Equipment resets on death Accidentally setting off dynamite while hitting pumpkins Opening the door with the shoggoth behind it Not seeing the lizardman statue in time Walking into exploding eyeballs Falling onto a spike trap Jumping over a spike trap into another spike trap Killing yourself with a dropped item Penguins",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty fun game. Spooky though. Hard to win, at least for me.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a wildly addicting trip through Lovecraft madness, if you like Rouge-likes and dont have ELDRITCH, what are you doing? go buy it! You can kill Fishmen, cultist, and other Eldritch horrors. If thats not enjoyable then i dont know wwhat is.",
            "review_score": "1"
        },
        {
            "review_text": "i dont even know how or when i got this but its really fun. except the graphics kinda suck. but thats ok",
            "review_score": "1"
        },
        {
            "review_text": "Wat was dat der Dæmons name???? Nyarlathotep? *dueling banjos plays*      On a serious note this is a First Person Shooter based off of the writings of Howard Phillip Lovecraft. You start as a Librarian of sorts, in a mysterious library with books littered about teeming with information. You find out that you are bound to this place an act as a gaurdian agaisnt the terrors of the Old Ones. There are some books that give off a shimmer and act as a portal to another dimension inhabited by Cultists, Dæmons and other Horrors that could plague the mind and soul. You have a chest that can store Artifacts which act as currency, the Deep Ones seem to cherish them and some will act neutral to even barter for them. Exploring these non-Euclidean realms takes a toll on ones perspective, they are never the same and have no definite structure. If you perish you simply re-awaken in the library, any Artifacts stored and items left here will stay, yet anything collected will be gone. Entering once again into these worlds that seem wrong, a strange tingle or sense just behind the nose, a scent of sorts. In the many works and studies these scholars or gaurdians what have you, a theory of pineal gland enlargement and extra-sensory perception is documented. Another book, going through them its never the same and there are so many! I went down through at least three gateways, faced what seemed to be, as best as I can describe it through my recent studies is a Shoggoth. I was terrified! At first it didn't make much sense, those Deep Ones could just be mutants or an actual bipedal, semi-intelligent race that evolved along with Humankind. That could be possible, right? But this, this was different. At first I struck out wildly with my dagger, nothing but violent screams and lashing tentacle like appendages. I could see its gnashing maw and those unearthly eyes that seemed to see infinitly deep into my very being. My mind broke, I could somehow understand but to only comprehend I must let go of my sanity. I pushed away, firing my pistol wildly into its oozing form and managed to safely get away...or so I thought. Tekeli-li Shoggoth, Tekeli-li Shoggoth. I tossed a bundle of dynamite I found towards its protoplasmic form and missed my mark, it detonating meters behind the creature. Stell'bsna wgah'n shagg tharanak shugg syha'h. Things are different now, I haven't been here before but was there anyways. How pages have I read so far? Am I reading or am I acutally inside them? Honestly I can't remember if I dreamt that after reading some of these books or it acutally happened. But there is a dagger and pistol on the counter that I don't recall having earlier. Was I asleep? Where would I sleep? Geb agl ehye'bthnk c fhtagn ee. They can't reach me through these books can they? I have all the lights on in the library that I could find, I remember reading something about right angles, the way perceived space effected time, and how time could catch up to you....hunt you down itself. ph'nglui mglw'nafh Cthulhu R'lyeh wgah'nagl fhtagn. Very familiar it is now. No I understand. No, it is alright I will continue. There are many things to do now. Mana-Yood-Sushai h'fhtagn....syha'h...syha'h.....syha'h",
            "review_score": "1"
        },
        {
            "review_text": "You will learn to hate everything but the Fishmen.",
            "review_score": "1"
        },
        {
            "review_text": "Simple endless fps-fun. Good atmosphere, strange enemys and interesting story. You gonna hate it sometimes, but you will come back.  Besides Heavy Bullet imo the best rogue-like shooter.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game worth it but not for full price buy it at steam sale",
            "review_score": "1"
        },
        {
            "review_text": "When I saw the trailer I though, Another Voxel, Minecraft-Like spin off but I was wrong, this game is a dungeon crawler randomly generated with not scary, but unfomfortable atmosphere filled with monsters and abominations. It has destructible enviroment and simple stealth mechanics that could be used to avoid or kill enemies.   It's challenging ill give it that, but it's often frustrating because if you die you lose everything that is not stored in a bank. A mod support would be really nice.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of writing this I have unlocked the third book.  This game is...well...H.P. Lovecraft certainly rolls in his grave over it.  The enemies are scary...at first. After playing about a minute on a floor you get so used to them you're willing to run around and stab everything without any kind of fear. The only real enemies I ran across that stayed a danger were 'unkillable'-The Shoggoth and the Statues. The Statues act like carbon-copy Weeping Angels (which is scary, sure, but they don't activate unless you walk in front of them) and the Shoggoth is...just...It's a giant slime thing that can't be killed. Trap it in a hole and boom, safe.  TL;DR:  Pros:  - Enemies start off scary and dangerous  - Minimal issues with gathering resources  - Stealth actually WORKS.  Cons:  - Enemies quickly become repetitive and boring.  - Resources can be very scarce or be overabundant between floors.  - Stealth is really, REALLY pointless when enemies start gaining flight.  - Dagger too OP.",
            "review_score": "1"
        },
        {
            "review_text": "This rogue-like survival horror is enjoyable to the end. The ambience, the music, the beasts, the graphics (which surprinsingly benefits the game), all the Lovecraftian feel, the funny bits... I didn't expect so much pure fun for such a low price (I bought it at the deal price).  Behold the calamitous Azathoth!",
            "review_score": "1"
        },
        {
            "review_text": "I had no idea that a comically low-poly game like this could make my palms sweat within the first five minutes.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good and challenging, however it could have few more inventions. Still I would honestly recommend that game.",
            "review_score": "1"
        },
        {
            "review_text": "I beat this game after 2 hours and I see no reason to play it again. It just has too little content, there's no character progression, there's barely any items to use. You will find daggers and guns (specifically a revolver) everywhere, I used them the whole game. While there is very few additional weapons, they are one time use for example bottles and dynamite. The problem here is that you can only have 2 weapons on you so if you want to pick up a dynamite you have to get rid of either the gun or the dagger and that is not something you want to do. Since the gun has limited ammunition and the dagger has no range.  There's just so little stuff in the game. You will have pretty much the exact same experience whenever you start a new game since you will use the same weapons and there's no class/leveling system or anything to make your character unique.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun for a couple minutes but definately not worth full price. Had to force myself to continue playing it just to complete it.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a huge fan of metroidvania style games. I like a challenge. But games like Eldritch are damned annoying. If you die, you lose all progress except for any levels that you unlock and money that you've stored in the bank. Any cool items, spells, weapons or 'experience' upgrades are lost. So you might as well start over each time that you die. Oh and good luck finding that sweet combination of items, weapons and spells again: everything is re-randomized upon death. I died a couple of times not because of the difficulty of the monsters, but because of typical accidents that occur in FPS games: one step too far and falling off a ledge, dying instantly, for example. Or mis-judging the range of a monster's hit-box. This game is brutally unforgiving and falls into the same old mis-placed nostalgic hard-on for 'old school brutality' which was nothing but a shallow, cynical design by the developpers to get kids to spend more quarters. Not because of some mythical love of the gaming 'craft'. Pass on this if you have precious little time to waste. Get this game if you want to maintain your 'old school' gaming cred.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a big fan of rogue likes but wanted to give the game a go because of the lovecraftian theme.  It's an ok game, not my cup of tea though. I'm on and off rogue likes, this one I ended up just getting annoyed at too much. I suppose being a casual gamer these kind of games I should avoid but regardless I gave ot a try.  But the theme is great, really nice, the game is cheap on sale as well and includes controller support, trading cards and achievements so there is still a lot to do and get out of it.  I got through the game eventually, got my moneys worth.  Depending on how much you like and can take of rogue likes you should/ should not get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Boresome procedurally-♥♥♥♥ dungeons, zero atmosphere, little depth and lacking variety in everything. Avoid, even if the idea of a lovecraftian rogue sounds extremely appealing to you.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage, lacks features or depth. AI is a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "A little too simplistic; nice atmosphere and level generation but rather boring to play.",
            "review_score": "-1"
        },
        {
            "review_text": "A great atmospheric game, ruined by awful gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I don't really know what to say : I loved it, but it's far too ♥♥♥♥ingly short, and there's a severe lack of items, ennemies etc... buy it if it's on sale, but don't think it's like the binding of isaac in term of replay value. Oh, yes, I almost forgot : the graphics are cool, I love them.",
            "review_score": "-1"
        },
        {
            "review_text": "Eldritch is more of a fever dream than a game. It’s an absurdly unfair feeling first person randomly generated dungeon crawler which neither looks the best or feels very good to play. I never understood where I was going or why. There were so many enemies that felt like there was no way to handle without taking damage, and in the rogue spirit damage is a very serious thing. I gave the game a good hour of play and just did not enjoy it. I would definitely pass on this..thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Too hard. Easy to get lost and you lose loads of progress when you eventually die and have to go through the whole lot again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is turd....",
            "review_score": "-1"
        },
        {
            "review_text": "No thanks. The game wasn't bad to start, learning some things about how the game worked, killing a few bad guys and praying to a few Old Ones. It wasn't flashy but it was somewhat enjoyable. I'd explored for about half an hour, no hint of a save point but that hadn't bothered me because I'd still yet to take any damage from the dozens of bad guys I'd encountered. I actually wondered if I had it on easy mode and if I should ramp up the difficulty. Then I a find a bad guy in a room....BOOM I put a bullet in his face. Follow it up with 4 more and still nothing. Then he spanks me with a one hit kill. I ressurect and have lost the gear I found so far. It felt cheap and it felt stupid. OK I learned that maybe that particular bad guy was to be feared but I wasn't going to drudge around a mediocre game to have more surprises like that thrown at me. Putting this one in the never-to-play-again pile.",
            "review_score": "-1"
        },
        {
            "review_text": "The lovecraftian lore is neat, but the actual gameplay is a bit lackluster.  Level design is good. Sound design is good.",
            "review_score": "-1"
        },
        {
            "review_text": "I guess it's a perfectly fine and fun rogue-like, but for me I just need something more to motivate me to keep going. This game doesn't have that. I would've liked some sort of plot to follow or something. The game is just to shallow in that way.",
            "review_score": "-1"
        }
    ]
}