{
    "app_id": 252750,
    "name": "MouseCraft",
    "release_date": "2014-07-08",
    "developer": [
        "Crunching Koalas"
    ],
    "publisher": [
        "Crunching Koalas"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 23,
    "positive_ratings": 210,
    "negative_ratings": 25,
    "price": 6.99,
    "description": "Ever wondered what a cross between Tetris and Lemmings would look like? Well, wonder no more, 'cause... MouseCraft is here! MouseCraft is an A to B puzzle game where players help Schrödinger, the crazy cat scientist, in completing his mysterious, mice-powered invention.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/252750/header.jpg?t=1511369654",
    "minimum_requirements": "OS: Windows XP SP2 or later Processor: 1.4Ghz or Higher Memory: 512 MB RAM Graphics: OpenGL 2.0 compatible video card with 256 MB shared or dedicated RAM (ATI or NVIDIA) DirectX: Version 9.0c Storage: 1200 MB available space",
    "recommended_requirements": "OS: Windows XP SP2 or later Processor: 1.6Ghz or Higher Memory: 1 GB RAM Graphics: OpenGL 2.0 compatible video card with 512 MB shared or dedicated RAM (ATI or NVIDIA) DirectX: Version 9.0c Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "Its good looking puzzle game. Its just too easy. For 80 levels i had to think a little bit harder about maybe 4 or 5 of them.  + simple game mechanics have great potential to create something amazing (maze + tetris like pieces with different functions), + you can to do it yourself in built in level creator (huge plus for implementing this), - to unveil its true value this game should have Steam Workshop!!! I would love to see what puzzles were created by other people!!!  I had some fun with this little game, but if you are looking for something challenging - it is not the game you are looking for.",
            "review_score": "1"
        },
        {
            "review_text": "Got it in a bundle, $5aud... very impressed :D kids/misses love it   No microtransactions or gated content, which is what you should be expecting when a game is not free  8/10",
            "review_score": "1"
        },
        {
            "review_text": "this game has a really cool story! 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "76/100",
            "review_score": "1"
        },
        {
            "review_text": "This puzzle game is a cute, casual timewaster that I'd rather play on a mobile device than a computer. The learning curve is also sharp - the tutorial levers are beyond obvious, but the first real level had me truly stumped on how to get a perfect for 5 minutes. If you enjoy cute puzzles, pick it up in sale. I got it 50% off but still feel like I overpaid. It is satisfying to crunch the robots though.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended, with an additional 'Very' if you know what a Lemming is and if you still wake up to the crunch of Tetris blocks dropping from your room's ceiling.  Here's a new batch of rodents to scratch your puzzle itch. And you can't drop 4-pieces for a Tetris.  There's this mad scientist cat Schrödinger running experiments FOR SCIENCE, all of them involving three mice making their way through a puzzle-maze thingie. It's your job to make sure at least one mouse makes it safely from its little wheel to a faraway piece of cheese. That's the core premise. Your mice are blissfully stupid and just walk in a straight line until they hit an obstacle they can't jump over, which causes them to turn. You're given a couple of 'tetris' pieces, and must drop them into the right spot to create a path to the exit. Mice don't jump very high- one block, that's it. Mice also can die from a long drop, or being squished by a tetris piece. It's a dangerous lab for sure.  One thing that MouseCraft does absolutely great is establishing the puzzle formula and then adding to it. As usual the first few levels are really easy, and once you've got the basics down, more and more elements are added. In order to make it into later levels you need a certain amount of glowing blue crystals, which your mice can pick up on their way. Enemies (robot rats) start to roam the levels. Blocks can be destroyed with pickup bombs, slippery ice blocks and bouncy jello blocks are added to your arsenal. And more often than not there is a simple solution to a level, but in oder to rescue all three mice and collect all the goodies, you'll need to think around corners a bit. At around level 12 I found myself starting to really think, instead of just recognizing a standard challenge 'that has been done in other games'. It's a solid puzzler and it seems to deploy its collection of blocks, timing, environmental hazards and the greed to score 'perfect' to great effect.  It's also a downright cute game. The 3D models are nicely animated, from the sweet little mice to the downright hilarious Schrödinger, who always keeps an eye on the experiment with gleeful joy or puzzled amazement. The sound effects are okay, but not outstanding; the music however, really can get stuck in your head. It's all really whimsical and cartoonish; my only gripe is that the mice themselves just lack the personality of their Lemmings ancestors.   Controls are simple and easy. Blocks are picked and places with a single mouse click, and the interface allows quick restart and even has a 'fast forward' button to speed up the slow pace of the rodent odyssey. You also get an 'active pause' that freezes time but allows you to still place blocks- all you need is there in the form of friendly large buttons.  Despite the child-friendly presentation (no violence at all, even a dead mouse just turns into... a cartoon mouse ghost) the puzzle difficulty starts to ramp towards the end of the first 'map' (20 levels), and the game boasts a total of 80 levels- so I haven't even made it to the halfway mark and can't say how tricky things will be later on. It's probably too hard for children, who may still enjoy watching someone play the game. It has this thick cute charming feel.  80 levels are a good amount of content, too, especially when you're the kind of player who MUST have all the perfect scores. And if 80 levels are NOT enough, you can make your own with an easy-to-use level editor. With Steam integration in place, you can easily make your own contraptions and share them as you see fit.  The price is probably a bit higher than one expects from a 'simple puzzler' these days- but the overall quality of the game easily justifies the price tag. You get a really polished, solid brain-twister here, you can make your own levels, and did I mention how insanely cute the mice are? Really, give it a go!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty fun and challenging puzzle games. I just think it takes too much time to 'get to the point' but, when it finally does, the level design is really something. Mechanics and quirks are pretty interesting, although not that much original. All in all, its worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "DON'T LET THE RATS DIE!!!",
            "review_score": "1"
        },
        {
            "review_text": "Terribly disappointing. Mobile game, nothing like tetris except similar shapes.",
            "review_score": "-1"
        }
    ]
}