{
    "app_id": 253110,
    "name": "The Cat Lady",
    "release_date": "2013-12-04",
    "developer": [
        "Harvester Games"
    ],
    "publisher": [
        "Screen 7"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Story Rich",
        "Indie"
    ],
    "achievements": 25,
    "positive_ratings": 3446,
    "negative_ratings": 246,
    "price": 7.19,
    "description": "The Cat Lady follows Susan Ashworth, a lonely 40-year old on the verge of suicide. She has no family, no friends and no hope for a better future. One day she discovers that five strangers will come along and change everything...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/253110/header.jpg?t=1540795654",
    "minimum_requirements": "OS: Windows 7, 8, 10 Processor: Intel or AMD CPU Memory: 512 MB RAM Graphics: DirectX compatible card DirectX: Version 9.0 Storage: 2 GB available space Sound Card: DirectX compatible sound card Additional Notes: Keyboard",
    "recommended_requirements": "OS: Windows 7, 8, 10 Processor: Dual-core Intel or AMD CPU Memory: 1 GB RAM Graphics: NVIDIA or AMD ATI video card with 1GB of RAM (Nvidia GeForce GTX 260 or higher/ATI Radeon 4890 or higher) DirectX: Version 11 Storage: 2 GB available space Sound Card: DirectX compatible sound card Additional Notes: Keyboard",
    "reviews": [
        {
            "review_text": "The Cat Lady is a game for the mature audiences only. The game deals with dark materials like suicide, death and many more things. But will you want to play it ?  In The Cat Lady we play as Susan Ashworth, she's a 40 year old woman who lost everything she cared about. She has no friends and she decides to take her own life away. But after committing suicide she is given another chance to make things right. She has to confront 5 people so she can live in peace.  Now I was following the project ever since it first launched on Desura, but I've never got the chance to finish the game until recently I decided to sit down and finish it and let me tell you this game is quite the experience.   The game is a very dark game and is not suitable for the young audiences and should only be played by adults. The whole time playing I felt unsettled of the very dark nature. The game's script is it's strongest feature which grips you until you finish the game and see how the entire story wraps up.  The game is a simple adventure game. You can go to two sides either to left or right and you can collect items and interact with the environment. The game is fairly simple and there's not much else I can say about the gameplay since it is fairly simple.  The graphics might not look great, but they're really good. I loved the whole black and white art style and it really settles the mood and makes you feel uneasy the entire time playing. The graphics are accompanied by a great soundtrack. While it's not the best soundtrack it helps build the atmosphere.   The voice acting is this games weakest part. The entire game has different audio quality ranging from pretty good to abysmal. But that's not that big of a problem.  The game ran incredibly smoothly from start to finish, until chapter 4 where there is a massive frame drop for a certain sequence, but it only happened in that part.  The entire game took me 7 hours to finish and I loved every minute of it. The game does have a bit of replay value because this game has some player choices that do affect the outcome of the story, but it's pretty minor stuff.  Some of the puzzles might seem hard, but for the most part it's really simple stuff nothing really cryptic.  Overall if you're not easily disturbed, I highly suggest giving The Cat Lady a chance as it's one of the best games I've played as of recent. The incredible story and characters will grip you till the end credits and you will love every single moment of it.  Final Rating: 9/10 A must own   If you liked this review please give it a like and if you disliked please post in the comments what you disliked about the review.  For more reviews follow Snort's Review curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "Started this game hoping for a depressing horror experience, ended with tears &amp; snot and a greater will to live 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Loved it! At times a bit slow maybe, specially at the start. But...  1. Awesome atmosphere 2. Interesting storyline  3. Sick and gruwesome 4. Did I mention sick? 5. Great voiceovers 6. In depth characters 7. Did i mention sick? 8. Low budget , but made in a way that it is just very artistic. Really well done.  Felt more like an interactive story for most parts as a game. ( like a story told with a picture book, not a movie.) But the game part was pretty decent too. Some nice puzzles. Not too easy, not too hard. Finished the game in one breath.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "Only on the 2nd chapter so far and this game is a must play for any adventure fan tired of the usual adventure gaming tropes. This sure as heck strays away from that.   At first I found the interface clumsy and annoying but after getting used to it it's just fine and simple and doesn't get in the way of what really matters in this game, the story, the setting and the dialogue. A steal for 10 dollars and I just wish games like these did better financially because it is well deserved indeed.",
            "review_score": "1"
        },
        {
            "review_text": "If your feeling extremely depressed in your life, whether it's contemplating suicide or wanting to hurt yourself. PLEASE play this game, it helps a lot. Always play this game over and over again if you have a single thought of suicide, this game will show you the life of someone who is suicidal overcoming their depression... I won't say anymore about the game, seriously play it its worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Where do I begin ... I randomly bought this game because it was very cheap (sale) and because the theme looked interesting to me. I normally never play games like this, but I can say I was positively surprised.  This game isn't for everyone, its subjects are dark: depression, suicide, murder, cancer ... It's for people who want to enjoy a good story about these kind of things. Even if you've never been in contact with them, the game is very good at explaining how a depressed person goes through life. The game can be quite confronting towards people who've suffered from any of the topics above, but it's still an interesting experience.  STORY: really good. At chapter 1 I was interested, but I wasn't blown away or anything. At the end of chapter 2 I was completely hooked though. I thought this game was going to give me a nice, regular story about depression, but I was wrong. It throws things at you you wouldn't expect. Well the game is tagged 'horror', so I guess I should've expected the story would become even darker &amp; sicker than it already was ... Quite linear story, but you can make some choices that change the plot a little bit.  GAMEPLAY: Oddly satisfying. You play through each of the 7 chapters and have to explore your environment to gather items and to find out more about the characters. This game works with a kind of puzzle system: find X, so you can get to Y, so you can finally do Z. Quite obvious puzzles, but here and there you might have to think. Also, there's a good balance between watching dialogues (that you can alter; really fun) and getting to play yourself.  ART: I honestly love the art of this game. The game often presents itself in a white/black-ish style, which I guess is quite logical regarding the subjects of this game. Now and then, there's also some colour to be found which emphasizes certain items/events in the game. There are some areas that could've been made better, but the most important areas in the game look really good, so no problem.  SOUNDTRACK: Just absolutely fantastic. Really makes the game a much better experience. The music changes from pretty calm, to eerie, to sometimes even agressive ... all depending on the situation you find yourself in. Also, pretty cool (and eerie!) sounds/noises are used, like cracking stairs and doors, screaming women, the typical jumpscare sounds you'll fall victim to everytime (or maybe the total opposite).  ATMOSPHERE: By far the most amazing thing about this game. Nothing much to say about it, you really just have to play it yourself to feel it.  So yeah, really good game. Love it a lot, despite not expecting it would be this good. Again, not for everyone, but if you want to give this game a fair chance and open yourself up to it, you'll find yourself dragged into this game and just want to keep playing. At the end credits, you'll just find yourself staring at the screen, asking yourself what the ♥♥♥♥ you have been playing (and most of all; why you enjoyed it so much).  P.S: some people have unanswered questions after playing the game. Apperently playing 'downfall' would answer some of these questions (though I can't confirm as I have not played it myself).",
            "review_score": "1"
        },
        {
            "review_text": "This game is excellent! Dark, depressing and bloody. The story is disturbingly wonderful. The art style is gorgeous. The music is beautiful. Fans of adventure games of any genre NEED to play this.",
            "review_score": "1"
        },
        {
            "review_text": "An exceptionally well-written adventure game about torment, depression, self-destruction, suicide, the burden of existence, the will to power, the meaning of life, and the eternal nothingness of death. Fun!",
            "review_score": "1"
        },
        {
            "review_text": " Gripping and thought-provoking",
            "review_score": "1"
        },
        {
            "review_text": "  SPOILER FREE REVIEW      Introduction   An Indie horror game done right. More or less created by one man 'Remigiusz Michalski'. Yes this game has a little budget, yes it shows up. But yet, this game is excellent. The horror elements don't rely on jumpscares. To put it in perspective, this game is more silent hill than resident evil. It messes with your head because of the Incredible atmosphere, ambiance. When playing you'll feel weird, sad, disgusted, and once you'll leave your PC it will stick with you for the rest of the day.    Gameplay   The game as a 2D sidescroller, with puzzle elements. Think 2D myst / broken sword / etc but horrific. Puzzles are not difficult, they shouldn't put you outside of the horror mood. There is no puzzle worth taking hours to solve. At the exception of the very beginning at the hospital. I admit it, I had to look at a guide, but it didn't ruined my experience of the game. Aside from that, there is no moonlogic, crazy inventory puzzles, unnecessary back and forth to push a certain button to unlock a certain door somewhere, etc. The game mostly play itself. I had no trouble whatsoever playing with a keyboard, although it might be problematic if you want to play with a controller, I haven't tested but you might need to use joytokey or tweak it a little. You're not really playing the CatLady for its innovations in the game mechanics field. You're here for the mood, the story. And that it nails.     Visual   Ok this is the tricky subject. The Cat Lady is weird, and it shows up through its visuals. You may not like them, but they' don't ask to be liked. On the contrary, visuals are here to carry emotions, to express the anxiety, if they disgust / put you off then the author has done a good job, don't you think? But still if you absolutely want to be technical, there is little graphic options, the API is outdated beyond any hope, characters's sprites have a low resolutions. Some assets are iin 3D, some are in 2D, it's a mess. It's not coherent, it will unsettle you... But once again, that's what the author was aiming for.     Audio   The OST enhance the atmosphere of the game considerably, whether it is fully instrumentals, with or without lyrics, clean music or full experimental distorted sounds. it's done just right. There is few foley sounds and they may sounds cheap if you listen carefuly. But the minimalist approach goes hand in hand with the horror game style. Dialogs are fully dub, once again if you really listen to them you might hear some static every now and then, but nothing game breaking.    Writing (english version)   The writing is descent, it does its job correctly, no cheesy lines, not too much text, just the right amount.  It is obviously dark and depressive, but not only. The author understood that writing a 100% depressive has much less impact than writing a believable world. A realist one, with multiple characters, personality, anxiety, memories, everyone has its own cross, you'll understand and get close (or not) to the characters of this game. Overall good choices in writing even if I wanted to nitpick I guess some phrases are weirdly put, but it's not like I've got a good enough level of english to complain about that. The scenario tackles some heavy subjects. One of the principal being suicidal depression (as shown in the trailer). So be ready to deal with dark subjects. But weirdly enough .... I would recommend this game to depressed people, not all of them. But I think it should be easy enough for most people to identify as the main character and to take lessons from the game. At least it can be cathartic, and it can help to have a game talking honestly about subjects like that, no taking gloves, plain honesty. I can't really tell more about that without spoiling the story... So to cut it short, I'll just say there is multiple dialogs with multiple choices and therefore multiple endings, giving the game some replayability value.    Conclusion   Look at the trailer, if visuals don't make you vomit and you are looking for a visceral atmospheric horror game. Go for it !  And once you've done that, you may also want to take a look at his previous game 'Downfall', or maybe 'Silence of the Sleep' by Jacob Reeves.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 -Really mature and morbid at times. It will make you feel uncomfortable. It is a horror game afterall. The story is really well done. I love the art work and soundtrack. The voice acting is great also but sometimes it distorts alittle bit kind of like heavy breathing on a microphone at a loud volume. The puzzles are not really that hard to figure out but not super easy either. This has to be the best point and click adventure game I ever played. Hope to see more games from this company in the future. Looks like they put alot of effort into it. A side note for anyone that has this game set your graphic filter to max nearest-neighbour to get the clearest picture possible with your monitor.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best emotional adventure games I have ever played &amp; I'll explain why in this review.    You play as Susan Ashworth who has serious depression, Mundane, Whiny &amp; suicidal about life where to the point she kills herself by overdosing on sleeping pills but that's where the game starts because while your in the underworld you meet a strange woman who gives Susan an offer to live happy again but the only way Susan can gain true happiness is if she kills 5 strangers that will randomly try to hurt or kill Susan (I don't know the reason why to be honest but that woman awarded Susan Immortality so I can't complain about that). At 1st Susan thought it was a dream but in chapter 2 your talking to the psychiatrist about your miserable life or whatever dialogue you choose to show Susan's childhood, you try to leave the doctor's office after your done with your session with the doc but Susan noticed that the Doc's door was locked &amp; then the doc stabs her to death so after you go through the underworld again you try to kill the ♥♥♥♥♥♥♥ who stabbed you to death (The game gives you 2 choices you can either kill The psychotic Doctor or you can leave the madman's lair forever.  In Chapter 3 you just came home looking like ♥♥♥♥ after you had to experience the horrors from chapter 2 &amp; you try to relax (In chapter 3 the devs decided to put in a calm meter &amp; angry meter so whatever meter gets the highest it affects the way Susan sleeps) but I understand what this part of the game is telling me because I used to have serious depression so I understood why Susan was struggling with stuff like cooking a burger perfectly for example (I forgot to mention that chapter 3 tells a poem while you're doing Susan's home life). So after you go through Susan's Home Life you then meet a random woman named Mitzi Hunt who tells you that she is the reason why your alive (That's why I was in the hospital so a part of me wanted to punch her but Susan didn't) &amp; she wants to stay in your apartment, Susan tries to convince Mitzi that her home looks like ♥♥♥♥ but Mitzi is too enthusiastic to the point of Susan giving up on excuses but what happens next is that Susan gets really cautious when she sees that strange woman again right next to Mitzi which lead to Mitzi explaining that she has a brain tumor so her final wish was to find a horrible person that caused her extreme pain (If you must know Mitzi was dying &amp; she wanted to meet an important person).  Alright I just got through 2 paragraphs so I will try to explain what happens next, Alright so after The Big C happened you suddenly get transported to a Pest Control Guy's house (I don't how it happened to be honest) where he plays with the tied up Susan but then a nurse comes in getting all ♥♥♥♥♥y because her husband the pest control guy was playing with Susan's ♥♥♥♥♥ so the nurse poured the strongest bleach in Susan's face (That ♥♥♥♥♥ Is Going To Die For That). So what happens next is that one of Susan's cats Teacup tries to release the blind Susan from her trap so after Teacup releases Susan she tries to find a gun since she is blind, She finds a gun and she ended up shooting herself but the weird thing is your transported back to your own apartment where you talk to Mitzi again, Mitzi then asks Susan To get some Wine because Mitzi wanted to bond with Susan better which lead up to Mitzi explaining the name of her Brain Tumor which is called Glioblastoma (She also explains that she doesn't have much time left to live), She explains why she wants to find that horrible person (The Horrible person's name is The Eye Of Adam, He is a Suicide Preacher who convinced Mitzi's boyfriend to kill himself) &amp; after your done talking to Mitzi the cats start crying for help so Susan goes outside to see what is going on but then the pest control guy shows up &amp; Susan is suddenly transported back to the house where she got the Bleach Treatment (If you must know Susan kills both The Pest Control Guy &amp; The evil nurse with deadly gases &amp; a shotgun, All of this ♥♥♥♥ I told you happens in Chapter 4).  In chapter 5 Susan &amp; Mitzi are having coffee &amp; pancakes together so Mitzi decided to ask Susan how she got depression in the 1st place &amp; Susan gets really defensive about the subject so Susan walks away from the conversation, What happens next is some random person starts knocking on the door &amp; *Drum Roll* the 4th stranger the flower delivery guy tries to murder both Susan &amp; Mitzi (After Susan gets murdered by the random stranger she is teleported back to the underworld to solve some puzzles so she can return to her apartment) so what happens next is Mitzi &amp; Susan are both in the bathtub taped up so They both try to struggle free but nothing works so before they are both dead Susan tells Mitzi her depressing &amp; abusive relationship with her husband but what really triggered her issues was the death of her baby daughter (It's really sad but I think the 4th murderer is Susan's secret admirer from her past). Alright so after Susan discusses her horrible past with Mitzi the murderer comes back to take Mitzi away but he releases Susan then Susan discovers that Mitzi is being hung to death but Susan manages to save Mitzi &amp; the cats are murderers this time (They ate the 4th murderer).  Alright I'm almost done so bear with me here &amp; I'll try to explain the last 2 chapters, Alright so in chapter 6 after the incident in chapter 5 both Susan &amp; Mitzi adventure out to find The Eye Of Adam so they end up talking to a single mother, talking to an old woman who likes dogs, Susan tells a story about a dead woman called The Cat Widow, talking to an old man &amp; yeah it was a lot of exploring (I can't explain all of it). Alright so Mitzi &amp; Susan think they hit a dead end when they couldn't find a clue but when they return to their own home they notice a note on the door by The Eye Of Adam to meet them at the Old Man's Place at midnight so they were both surprised that the old man was hiding something. Alright In Chapter 7 both Susan &amp; Mitzi go to the old man's house to finally see who The Eye Of Adam is, but it is delayed because Adam releases a deadly gas to kill everyone (The old man gives Susan a shoebox but inside that box is one gas mask so you the player either save your immortal self or you save Mitzi, next Susan goes to the underworld one more time to confront the strange woman who I believe is one of Susan's demons that caused self hatred &amp; other horrible feelings &amp; you decide whether to follow what the strange woman says or you refuse her orders) but depending on what you choose you then face the final stranger who is a sadistic internet troll who sits on his wheelchair paralyzed but I liked how the devs explained how bad internet trolls are because Adam was encouraging Mitzi (Well Susan too if you decide not to save Mitzi from the gas) to kill him but his final act of cruelty was to kill himself while taking a soul with him &amp; it encouraged the player to convince Mitzi that revenge is not the answer because Adam will get a bigger punishment which is a nursing home without a PC (Without a PC Adam will not preach Suicide anymore).    Pros:  1. Good Story  2. Good Puzzles  3. Interesting characters  4. Good Message At The End  5. Good Music  6. Good Art  7. Simple Controls  Cons:  There are no cons I can think of (Well there are a few programming issues but the devs fixed them) so I think this adventure game is perfect and overall I highly recommend this game (Damn this review was long but I hope I explained the game perfectly). Before I go there is a fun fact about this game, one of the achievements is a reference to one of Jeff Buckley's songs so I thought that was cool of the devs.         YouTube™ Video:  Jeff Buckley feat. Elizabeth Fraser - All Flowers In Time Bend Towards The Sun&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "9.1/10 - Best use of 4 buttons ever!  This game is really amazing. The story is not for the faint of heart. Suicide, death, murder, ♥♥♥♥, kidnapping. The list goes on. I have never been so captivated by a side scroller. The story is intense and the game is brillant. It's a must play and own.  I would pay $20+ for this game. At least 9+ great hours. It only costs $10 though. Usually on sale for $5. So grab it at that price.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible experience. Superb story and voice acting with lots of interesting and challenging puzzles that never get frustrating, plus you can always look up a guide if you're stuck - I did. The attention to detail is spectacular, and the art style is like a mix between David Lynch's Eraserhead, a Tool video from the 90's and Monolith's Condemned Criminal Origins. It's quite lo-fi, so if you want nice graphics this may not be it, plus the whole game is controlled with just the direcitonal keys. This is a bonus for people who can only play with one hand, or even just one finger, making Cat Lady very accessible.   Plus the soundtrack is great and the moral of the story is touching, though I didn't try all possible endings. Oh, and it's one of the few entries in our great hobby/community that openly and unashamedly deals with mental illness, suicide, and other related topics. And incredibly so.   A true 9/10 and glad I got it!",
            "review_score": "1"
        },
        {
            "review_text": "This proves that gameplay isn't the overall basis. I have been searching for a an intriguing story-line and this game just nailed it. Does not deal much with actual monsters but with people's mental disorders society has made them.  Great soundtrack too. I wonder why big companies can't produce these kind of games...Kudos to The Cat Lady.  Guess what vegetable I was thinking of while writing this.",
            "review_score": "1"
        },
        {
            "review_text": "It's very upsetting and intense for a sidescrolling point and click game, or any game, but also very moving and intelligent, not just gratuitous violence. It's an enthralling nightmare and I had to see what happens next. The atmosphere is so bleak and the music and sound effects and voice actors did a great job of adding to that and heightening the drama. The story felt like a journey through hell that I'm glad I took despite the depravity and violence, you feel like there's a reason to endure it with the main character, that you're searching for a catharsis on the other side and you want it for her as much as for yourself. It touches on places in the human psyche that are real.",
            "review_score": "1"
        },
        {
            "review_text": "Really interesting game. SUPER dark",
            "review_score": "1"
        },
        {
            "review_text": "I first played  The Cat Lady  through torrent, a long time ago. I downloaded it on a whim, but as I played it felt like it was made for me. I got it on Steam, through means I don't remember anymore, after I had become active here and realized how convenient Steam was and how much better for the devs who made things I loved if I just bought their games. I always told myself I'd go through it again, and this Steam award thing, for which I've nominated the game for 'I'm not crying, there's something in my eye' gave me the perfect excuse but I just couldn't bring myself to do it.  I started the game up and just began remembering every little detail from the voices of the characters, the ruined beauty of the game's world, the twists and turns the story takes you, the little moments of characters just being themselves and being more memorable and lovable and genuine than I've come to expect from video games. This game did make me cry, and I kind of feel like I want that to exist in my memories as an experience I'll treasure. I'm telling myself now that one day, when I'm ready, I'll revisit it, but even if I never do, this will always be one of my favorite games of all time.  For those of you who haven't played it, please do. For those of you who have, 'Tomato.'",
            "review_score": "1"
        },
        {
            "review_text": "! Trailers are misleading. It has some horror elements, violence and gore but it's actually a game about depression, hope, friendship and other related aspects as well as about modern suburban lives gone somewhat wrong in general.  The best adventure I've played on Steam so far besides Primordia.  + Great - deep, thoughtful and clever - writing + Great characters + Great voice acting + Lots of mono- or dialogues, all fully voiced + Lots of dialogue options and some critical point choices can be made to alter the way things turn out. Can't tell how far it goes yet as I've done one playthrough only, but from the looks of it there are at least two different endings) + Great ambiance + Nice music (louder and more calmer tunes) + Good puzzles  + Interesting style and design (I especially liked the thoughtful use of colored objects in contrast to otherwise gray ones, possibly working as a symbol for the darker and brighter sides of life and how the protagonist may see them) + Easy controls: WASD or arrow keys and ENTER. Objects of interested are highlighted when you get close to them. I prefer this over tediously examinating every pixel on the screen with a mouse as it otherwise often works in adventure games.  - Minor bugs and design overlooks (voice acting and text not always being identical word for word, voice acting in a few instances repeating the same lines even though the text is farther, voice acting sometimes cutting off prematurely, one or two lines the game skipped even though I didn't want to, a few text misspellings, voice acting sometimes including atmospheric recording noise - couldn't tell how to avoid it though, I'm no sound engineer, but it's sometimes easily noticeable especially since the game itself has little sounds, for most parts its walking sounds and random ambiance sounds mixed in and put on loop).  - One severe bug/technical oddity: You cannot save more than 50 savegames. If you try to save more slots the game will tell you saving was successful, but it actually isn't. Overwriting older files isn't possible (the game will simply create duplicate files, shown in the game with same naming). And since the game has many dialogue options and some critical point choices one is encouraged to save, load and test around with his possibilites unless one knows very sure he is gonna do multiple playthroughs. Could be fatal if someone decides to do a one-night walkthrough and only notices very late that his +50 savegames don't actually exist. Can be avoided by simply deleting/moving some of the savefiles one has (C -&gt; Users -&gt; Your Name -&gt; Saved Games -&gt; The Cat Lady)  ? The game is about depression. Those who suffer from it may struggle with some aspects shown to it though, because some of the situations and happenings in the game will hardly ever happen this or in a similar way in the real life. It's not totally far-fetched, but it could be seen as an overdramatization of the otherwise rather sober and to the outside world unspectacular hardships to overcome it. Ultimatively I think there is no way it could have turned out the great adventure game it is had it sticked too close to dry facts of reality though. If one   wanted   to he could break the whole game apart arguing this way, but what good would that do? For a game I think it did very well in showing some aspects of depression and how to possibly deal with it.  ? The violent situations in the game are possibly morally questionable. The game tries hard to make you not sympathize with any of the people that die by your hand and to drive you with your back to the wall (expect for one situation where you can apparently kill someone for 'minor' reasons), but in the end even the worst sociopaths in our society have a history and there are reasons why they become who they are. Criminals are not born. They are made. Every man and woman once starts as an adorable child everyone wants to hug and cherish. One must ask at which roads in life things turn as wrong as they do that people turn into mass murderers, rapists and egomaniacs. No one starts his life with the 'goal' in mind to become a criminal. Of course the game can't overindulge in these aspects without drifting away massively from it's narration, I guess, but there were instances where it possibly would have served enough to simply knock out someone rather than kill him.",
            "review_score": "1"
        },
        {
            "review_text": "This is the darkest and most twisted game I have ever played. And I loved every second of it. To be honest, the previews didn't excite me at first and I thought this was another cheap and ugly indie game with no good story what so ever, but oh was I wrong, I quickly fell in love with the game and this might be one of the best horror/adventure games I've ever played if not THE best. A truly masterpiece, not for everyone though due to it's mature and dark content.  The only downside of this game would be some of the voice acting which was kind of embarrassing a lot of times through the game, but the great music kind of made up for it most of the time. But as I said, I didn't expect much out of this game at first so that's not really a big deal for me personally. Needless to say this game was totally worth every cent and second of my life.",
            "review_score": "1"
        },
        {
            "review_text": "All of the following are rated on a scale of 1-10: [Plot][10][Atmosphere][Over Nine Thousand][Soundtrack][10][Visiuals][9][Controls][9.5][Difficulty][7]              VERY DISCONCERTING, and left me in tears of emotion while in movie scenes.. Startlingly brilliant for a point and click sidescroller. The atmosphere and tension was well done, and the SOUNDTRACK THO! HOLY MOLEY that was good stuff. LOVED IT.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this is my first ever review in all my years here on steam. So this might add as a bonus. I didn't think much of this game before I purchased it, but I saw a recommendation for it online and bought it on a sale. It took a while before I was browsing through my library and started playing out of boredom.  I got completely hooked.  The eerie atmosphere and psycological journey that takes place in the main character(as well as in some of the players as well I believe) is telling us about a dark world which we all encounter some time in our lives. Of depression, of sadness, of hopelessness. And to find out that you actually can move on to something better.  The dark atmosphere is creepy and some of the gore is even more so. But it all reflects back to a perfect balance between despair and madness(if you like that sort of thing, which I do). There's also a heroine-feeling to it, to try make something better and to punish the ones responsible.   The story is dark, but quite genious. I once got asked a question; 'What game would you like to forget and play for the first time again?' I would say 'The Cat Lady', 'Braid' and 'Bioshock'. (not choosing one, sorry :) )  So hats off for the developer, as I played this game somewhere in May 2015 and I'm still thinking about it now, wanting to play it again for the first time, Januari 16th, 2016.",
            "review_score": "1"
        },
        {
            "review_text": "This game really surprised me. It starts out strange but as you continue on, you become immersed in the story. I had chills going up my spine in certain chapters.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite games. It has a deep storyline, and multiple gameplay paths you can choose from. The art and atmosphere are incredible. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "While the interface and the animation can be a little bit clunky, the story is engaging.",
            "review_score": "1"
        },
        {
            "review_text": "It's the best horror adventure since Amnesia. Didn't expect much of it but was blown away by it's madness.",
            "review_score": "1"
        },
        {
            "review_text": "This game has not the best gameplay ever, controls are a bit dull and not dynamic, but it surely has the most shocking story. I love Susan's quest for redemption. This game shows her changing journey from a depressed woman, to an avenger. This game isn't as shallow as many other indie wannabes want to become, instead on its own simplicity it gets the sympathy from the player. I strongly recommend this game and I truly hope you, as a player, enjoy the experience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I played in 2013. Tha Cat Lady is a fantastic sidescrolling philosophical/adult adventure with a really good voice acting, a perfect soundtrack and a story extremely engaging.  Definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The darkest adventure game I've ever played. It deals with some really heavy stuff... cancer, depression, suicide and of course... death, but what's really impressive is that while also doing all that it manages to remain a really a gripping game, that keeps your attention until the very end. The Cat Lady is all about interpretation, there are dream sequences, some storylines remain completely open and overall a lot of weird ♥♥♥♥, where the explonations aren't fed to the player, and that's the beauty of the whole thing. The Cat Lady is an adventure game, although not of the point&amp;click type, you control everything whit the keyboard (just a few buttons actually), it seemed weird at first, but it worked perfectly here. The puzzles are mostly easy, so the game is basically closer to an interactive movie like The Walking Dead game, but since the story is as good as it is, I don't see a problem with that. The atmosphere is... Silent Hill-esque... rain, darkness, thick fog combined with misery, torture and lots of gore. I wouldn't exactly call this game horror, but there are quite a few scary moments, mostly achieved by the fantastic sound effects and music. If it wasn't too obvious until now, I say it here: I was blown away by this game. I didn't expect it, I wasn't waiting years for it, it just happened, I'm definitely looking forward to whatever the devs are doing next though.",
            "review_score": "1"
        },
        {
            "review_text": "* Update at bottom  When I fired up The Cat Lady, I knew that it would be weird, but I had absolutely no clue as to exactly how  insanely  bizarre that it would be. I also thought that it would be just some short little art game. I was quite wrong there as well.  Actually, it ended up being pretty substantial...I think that I spent around seven hours or so going through it, maybe a bit longer. It completely exceeded my expectations. When I started out, I was feeling so-so about the game, and kind of irritated by the main character (mostly because I've never been chemically depressed or suicidal, and thus probably don't have the proper level of sympathy to immediately identify), but by the time I was done with the second chapter (of seven), I was going, 'seriously, what in the actual **** is going on around here?'   I was hooked. Seriously, this is the  creepiest  game I have ever played -- EVER. More creepy than the first F.E.A.R. (which was really excellent, especially before everyone knew what to expect in subsequent games), more creepy than Amnesia: The Dark Descent. Really, the weirdly rough art style added to the whole feeling, and I had spine shivers on multiple occasions, which pretty much doesn't happen to me. No cheap jump scares...just actual dread and fear. And then, the whole thing regards life motivation in the face of the crappy, eternal, often oppressing weight of existence and modern life.   Oh, and the  music ...best, most-fitting music in a video game, period. I seriously want the soundtrack...it's the first game where I would've considered getting the deluxe version to own the soundtrack, and they don't do that with this one. Aargh.   In any case, it was a spectacularly horrifying game, and if you can handle a continually dark, violent, ugly and super-weird experience, I recommend it highly.  ___________  Update: I mentioned the music...it is included with the game for FREE. That gives you an even better reason to purchase this game. Totally worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Just finished it, it was really worth my time.",
            "review_score": "1"
        },
        {
            "review_text": "2spooky.  But no, seriously, this game is fantastic. Well, I say 'game', more 'visual novel'. But even so, I had a great time with it. Sort of. It wasn't fun. It was... interesting.  I got it for £1 or so in a bundle. I regret doing so. This game is worth way more than that.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy playing a dark and psychological game play, The Cat Lady is for you. Playing as a woman named Susan Ashworth who embarks you on a gallant journey through suicide, murder and friendship, the game really takes you right underneath the cracks.   The game play was slow at times, and parts of the voice acting could have been better, but if you let that slide, you'll enjoy the rest.",
            "review_score": "1"
        },
        {
            "review_text": "When I saw the trailer and those weird graphics the first time I heard about this game I was like 'The hell is this?' but I still gave it a chance and thanks god I did that and played the game. The story will leave you speechless and the characters, every of them are so interesting! This game will make you rethink about your own life, be sure of it. And I guess it's not a bad thing. Oh and, be ready for the feels!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what to say. Dark atmosphere full of sadness is so great. I like graphics, animations, storyline and OST. But I found gameplay a bit boring for myself.",
            "review_score": "1"
        },
        {
            "review_text": "the cat lady is a video game about suicidal depression, it's pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite graphical adventure games. What this game does perfectly is prove that an amazing story can't only be told through flashy, high-end graphics and AAA voice acting.  If you're a fan of horror/thriller games that make your skin crawl and that aren't afraid of going all-out on taboo, morbid subjects in order to tell a good story, this is definitely for you. Worth it even when it's not on sale.  Not to mention a couple of antagonists were voiced by a popular youtuber who, put it this way, fits absolutely perfectly for the roles...  Highly recommended. The game looks like it was written in an ancient Flash engine but don't let that fool you. Never judge a book by its cover.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't about graphics nor controls. It's about living the story. It has   Rita Tickle   too! &lt;3  10/10 Will tell my   neighbor   to   ♥♥♥♥ himself   again!",
            "review_score": "1"
        },
        {
            "review_text": "Battleing with depression is never easy, this games has tought me a lot. I just wish there where more games like this out there.  Great story, great artwork, great soundtrack. But above all, great ending. Highly recommend it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Holy Schnikies! Play this! .. what ever happened to just 'Reccoment to friends' .. well, it doesn't matter, everyone should play this. It has been ages since a game ate my brain to the point where I lost track of time. Support a starving Indy Dev today! (and always!!)",
            "review_score": "1"
        },
        {
            "review_text": "The game is cool! However I have stuck for the moment but I will be back for more! Nice story!",
            "review_score": "1"
        },
        {
            "review_text": "The premiere depressed English lady simulator.  100% accurate and true to life. Especially the part where you kill people in your spare time.",
            "review_score": "1"
        },
        {
            "review_text": "I am pleased to report that the fatal error that was occurring has been fixed! The developers solved the problem in just a few days, and for that I would like to thank them. You do not often see such diligent support from devs, but in this case they have done right by everyone, so that is awesome.   So the cat lady is indeed an amazing game. It is a story driven 2D point and click style game. The puzzles I have encountered so far are not too difficult, and if you do happen to get stuck there are many resources online that you can get hints and tips from. So in that sense the game is not frustrating.   The real emphasis of this title is on the story, and damn is it an interesting one. Let me say this, if you have ever experienced a deep depression you will almost instantaneously relate and connect to the games main character. It is clear the writer or writers of this game know what they are talking about. They have crafted a deep, dark, and in many ways outright creepy story. Hands down one of the best stories in gaming I have yet seen.   I supported this title on green light and I am very happy to see it on Steam. If you grew up on point and click style adventure games, and you enjoy dark stories, then you owe it to yourself to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for the emotional journey! The Cat Lady is exceptionally well-written and acted. Kudos to the artist-- the grittiness, colors, layering, and touches of surrealism are perfect. I will be buying your next release (Downfall) as soon as it is available.",
            "review_score": "1"
        },
        {
            "review_text": "Play this game if: you are looking for a great character-driven story. you enjoy solving puzzles. you like unconventional/unique art styles. you like 2D scrollers.   Do not play this game if: you are impatient and cannot sit through lots of dialogue. you are looking for in-depth gameplay. you are looking for a fast-paced horror/survival game.  Other thoughts: I love this game. It tells an interesting story, offers some challenging puzzles, and it doesn't hold your hand and guide you along. It's great to see a game with an unconventional protagonist! The plot is driven by emotion all wrapped up in gorey horror wrapping paper. The gameplay is fairly boring: directional keys + enter to select. If you're playing this game, it's mostly for the story/puzzles. Susan moves pretty slow and you'll be doing a lot of back and forth to solve puzzles, so if you aren't patient it can be a little maddening. The graphics are very low quality (basically clip-art at times), but I honestly think it adds to the story and makes the game so unique.",
            "review_score": "1"
        },
        {
            "review_text": "Stunningly good!  It is not just a game, it is a piece of art.  It seems to be a piece of dark art at first; but be patience and you will find out!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Recommend this game for everyone who are at least a bit open-minded. I, personally, am definitely going to play it a few more times in the future. (BTW, love the British accent in the game)",
            "review_score": "1"
        },
        {
            "review_text": "The Cat Lady a.k.a. The Five People You Meet in Hell  TL;DR -&gt; Well worth the cost (and probaly even a few dollars more)  As someone who has gone through several of the situations that the protagonist goes through, as well as being extremely introverted, let me just say that the story really hits close to home. It is a truly emotional journey that can easily drudge up the past and really force you to connect with Susan on several levels.  Playing the game won't make you depressed, on the contrary, it will almost make you feel epowered in a way.  For those of you who haven't gone through any such events, you should still play this game. The gritty, dark and quite realistic (with the exception of several key factors) story is just a real heart-felt journey that will occasionally cause you to stop and think about the trials in life that several people have to deal with. TL;DR? -&gt; Sometimes you'll feel sad for the characters and sometimes you'll feel downright ♥♥♥♥♥♥ off at others.  As for the game itself? Each aspect seems to compliment eachother. What I mean is for those of you who have seen the GRAPHICS and immediately thought that the designers were just lazy, let me just say that the art would NOT have worked any other way. This particular style of art works extremely well with the story that is being told. It's not lack of ambition or design resources, it's intentional and rightfully so.  The SOUND was something that I struggled with to accept. Some of the voice-acting was very well done, but quite a few of the characters seemed really forced, such as Doctor X. Often times you can hear that it was just a case of standing too close to the microphone while other times the dialogue just didn't really sound convincing. Sometimes I felt this worked to their advantage as it added a more realistic tone, but it was quite situational. Overall, I didn't feel like this really took anything away from the game.  The MUSIC, however, I found to be really enjoyable all the way through.  The CONTROLS? Not much to be said on that point since you only use the arrow-keys and Enter. Very easy to play and drink coffee at the same time with is a wonderful little bonus.  The PUZZLES in the game aren't of the Myst-type calibre, but are enough to keep it from feeling more like a visual novel. Some of them you will just end up solving without even realizing it's a puzzle while others might take you awhile to piece together. I, personally, found none of them to be truly frustrating.  The REPLAY VALUE is there, but unless you didn't save very often or didn't focus on nailing each achievement, you might cap it off with 2 playthroughs.  Overall, I would recommend this game. Well worth the couple bucks.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes you emotionally invested in the story and its characters right from the beginning and the very dark, brooding atmosphere really helps set the mood. It's an evocative journey you go on with Susan, you really feel for her and her struggle. Would recommend to anyone and everyone, even people who don't ususally like this style of game.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I got this game as a gift from someone. The first time I knew it, I though this game will be a horror game. And personally, I don't too like much horror games. So, I didn't hope much from this game.  But, I gave a chance to this game and I found this game is really different than I had though. The story is (personally) good for me. The gameplay itself is decent because you need to find clues all over the places and solve the puzzle. This game is not a horror game anymore; you won't find any ghost of something else, just some strange (and a bit supernatural) events.  The graphic is doing the job right. It succeed to bring the atmosphere; you'll only find black-white color scheme will rarely other color along the game. But, there is something I dissapointed for. The graphic option isn't give me much costumization. Your graphic option will be depents on your resolution. For low-end computer, you can play it on smaller resolution only, because your graphic quality is bigger following your resolution (i.e. bigger resolution, you'll get more AA). If this game can separate the resolution and graphic quality options, then I'll be pleased.  Finally, this game is recommended for you, since you are tired of other games and want to find some unoccassional game.  Score: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "It is a good story in wich you can play. Maybe the art can be weird but it is what the game needs. Very good game to play and great story.",
            "review_score": "1"
        },
        {
            "review_text": "An indie horror game, point and click game which to be honest got me by surprise.  But it's a good game I would recommend to anyone who like narrative games (And.. maybe also mystery and horror)",
            "review_score": "1"
        },
        {
            "review_text": "Ok, let's be real: The story to gameplay ratio is REALLY, REALLY, skewed and the controls are clunky. This can get really frustrating at times. BUT! I really liked the story and the characters, the atmosphere is well-done, and the designers gave suicidal ideation and depression a very compassionate and realistic depiction. The ending screen made me well up. Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "I've finished the game once and I'm going to play it again to try to get the 'golden ending'. So good. I was really frusterated in the whole part in the hospital when you have to figure out how to get out. I think the puzzles are very good and love the soundtrack. The story is also pretty good and I love the underlying message to it that's slowly presented to you in the game. I was also a fan of the artwork: dark and beautiful.   I keep recomending this game to my friends who love a good storyline and/or dark games.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely captivating. Simple gameplay, but great presentation.",
            "review_score": "1"
        },
        {
            "review_text": "A game that represents life itself",
            "review_score": "1"
        },
        {
            "review_text": "Creepy as hell game. It's all atmospheric. I still feel the creep-factor, even after finishing it. The puzzles are challenging, but not impossible.",
            "review_score": "1"
        },
        {
            "review_text": "Got this for my birthday from a friend and I LOVE IT.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I play for the reason of Dark atmosphere of everything you think will get better gets much worst. One of the best 4 Endings and the overall game is SO GOOD. However its short and i did get it on sale. So if you see this game on sale Buy it! Its Like taking a handfull of drugs and trying to sleep, Turns out you can't because those were not sleeping pills but sugar ones, Good luck playing.",
            "review_score": "1"
        },
        {
            "review_text": "So far it seems like it is an interesting game with an interesting premise that will probably hit home for a lot of people (me included). The main con I've found is that it just doesn't seem to be optimized at all. The framerate is terrible (which, for a 2D game on a powerful computer shouldn't even be a thing), and this makes the game even slower and sometimes unplayable. My guess is it just has terrible code (my hubby's a programmer so maybe it's just because that's usually the first thing I assume).  TL;DR It is a good premise, I just wish someone took the time to make it run properly.",
            "review_score": "1"
        },
        {
            "review_text": "A really dreary, atmospheric story that just gets weirder as you progress through the game.  I got to experience things like the consequences of suicide, the perils of being on suicide watch, or having an abusive significant other.  All in all a really great and meaningful game.",
            "review_score": "1"
        },
        {
            "review_text": "Holy hell! I love this game and I am only 4 hours in. It's not action packed, but it is so much better due to the interactive story and dark plot. A must have for everyone out there with a dark streak.",
            "review_score": "1"
        },
        {
            "review_text": "Great game - dark rich storyline, and totally unique. Hope this company do more games, and maybe spend a little more money, but its up there as one of my favourites despite its budget looks.",
            "review_score": "1"
        },
        {
            "review_text": "The multiple styles of graphics and the design is really interesting and textured, but some parts could be improved. Storyline-driven, and excellent there. I greatly enjoyed it. As a person suffering from several mental illnesses the feelings conveyed are really relatable and I -love- that you don't have to actually go out and take down bad people, more that you begin to value your life and act in self-defense.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game very much. I would have liked an option to move past some long periods of dialogue when replaying a part to attempt a different option. However, I felt engaged through out the entire game, and look forward to playing it again to attempt to get all of the achievements. I have already recommened this game to several friends. I actually got this game as a gift based strickly on the name, and was please to have enjoyed it so much!",
            "review_score": "1"
        },
        {
            "review_text": "Before I start writing, let me just say that this review  may   will  get a bit emotional. Instead of talking about the storyline (which is phenomenal) or the character development (you're going to love Susan Ashworth and Mitzi Hunt more and more as the game goes on) like so many other reviewers have, I'm going to talk about the impact my first playthrough had on me.  I've been struggling with suicidal ideations these past couple months. Now, I don't think I would ever actually go through with it, but just being alive has felt like a huge dead when my anxiety and cynicism have been getting in the way of moving forward. Things in your head can get kind of cloudy when that happens, you know? Trying to root myself in escapism as I tend to do, I decided to try and find a decent horror game on Steam for less than $10.. and then I stumbled across this. Finding a horror game with a suicidal protagonist isn't exactly a one-in-a-million chance but when I read the synopsis it immediately stood out to me, so I bought it.  The beginning seemed pretty typical at first. Some supernatural stuff, a creepy old woman who may or may not be the Devil, a bit of subliminal messianic imagery. You know, Silent Hill kind of stuff. I thought it was interesting, but not spectacular.  Then Chapter 2 happened.  Without spoiling too much, I'll mention that a good half of Chapter 2 involves filling in (most of) the blanks about Susan Ashworth's past. Stuff like her relationship with her mother and father, how she starts her mornings, what she does when she needs comfort after a difficult day, etc. Thinking nothing of it, I decided to match the answers as closely as I could to my own personality. As I did, the game proceeded to slap me right across the face with relatable feelings and put my misery into perspective. It made me stop to consider what I thought about myself, and how I had ended up in such a sorry state.  Pretty much every chapter of the game wound up being like this. I don't know if Remigiusz's intent was for people struggling with depression to see themselves in Susan, in fact I kind of doubt it after writing this out, but that's what happened to me. As her mood started improving  my  mood started improving. The game never quite stops being morose, but at the end of it all I'd re-evaluated my own outlook on life and realized that hey, I should care about myself. Even the biggest tragedies are only temporary if you work towards that light at the end of the tunnel. I'm still not the most upbeat person in the world, but after playing this game I honestly do feel like there's a point to it all.  I don't mean to come off as so dramatic, I just  really  like this game.  TL;DR: Clogged a toilet and yelled at a nurse. Also that guy who made Salad Fingers is married to himself. ALSO giant zombie cat.  ",
            "review_score": "1"
        },
        {
            "review_text": "A blackly exquisite gem of a game. The story is in equal parts compelling, shocking, beautiful and disturbing as well as very human in places. It is also quite original and keeps you guessing til the end. The atmosphere is often as surreal as are some of the situations the main character finds herself in. No doubt the noir-ish style of the art work and animation which at first seemed to me to be a little um, rubbish or cheap at first soon proved its worth in this respect.  It is by design a fairly adult themed (suicide, depression, mutilation etc) point and click style game with excellent voice work but the other element that really stood out for me was the control interface. It is simple yet feels natural in its elegance - even for this type of game standard things like inventory management, movement and interaction became quite fluid after a few minutes play time. And that is using a keyboard.  Similar to the way an arcade racer feels when played with a gamepad in that you can become more absorbed in experiencing the game because there are no complex controls in the way that would take your mind away from the atmosphere as you take moments to wrestle as much with an awkward camera view or an evil unchangeable control method.  This game does not suffer with terrilble controls. Quite the opposite. Personally I sometimes try to persist or adapt if I really want to try and enjoy a paticular game, but in some cases, the occasional unchangeable control method or camera angle spawned from the depths of Hades can be the greatest enemy encountered of all by the player and so the entire experience is destroyed, the story unfinished. (rant over lol)  Even for this fairly basic style of game, the control method here should receive as much credit as any moody art assets, music or voice work. If you be a fan of the genre, and like the type of game, its a definate win - win scenario. Try it, you wont be dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "A beautifully done horror point-and-click game that will get you thinking long after the game is over. Highly recommend this game to anyone out there especially if you want to get mind♥♥♥♥ed.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game. All the 2012 awards well deserved. Can't help but feel that is more people had played it, then The Walking Dead wouldn't have had such an easy time in the 2012 Aggie Awards...  A bit slow in the beginning, but when you start on chapter two there's no way back.  Strongly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I love adventure games, and this is the greatest one I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Great mood. Very unique and really cool. Definitely worth a look if you have any interest in Adventure Games, even though it is quite linear so far.",
            "review_score": "1"
        },
        {
            "review_text": "I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, ya get to kill some people.",
            "review_score": "1"
        },
        {
            "review_text": "The Cat Lady succeeds in engrossing you where so many AAA titles have failed in the past in a way in which baffles and confuses me even an hour after finishing the game. It's one of those rare experiences akin to Gone Home that has a snowball effect when it comes to character and plot development, taking you on a rollercoaster ride of emotions that seems to only build on itself faster by the minute as it comes to what I considered a timely conclusion.  Another aspect of this game that reminded me of Gone Home was how it managed to make me somehow relate and feel connected to the protagonist, even though I myself am a 27 year old male with a fairly positive outlook on life and the character is a middle aged woman with rather sad case of depression (for good reason as you will find out later in the game). Adding to its ambiance is an exceptional soundtrack, that while being a bit rough around the edges is so in such a way that lends itself to the art style of the game.  The way in which the plot revealed her background story kept me intrigued, and is delivered in such a way that you are thrown into a situation wondering 'what the hell just happened' but don't have to wait too long to fill in the gaps and arrive at the 'Aha!' moment.   The game is obviously not without its quirks, many times I was presented with duplicated voice loops and the setup utility/screen resolution options are largely useless, however none of these problems ruined the atmosphere for me. I personally would have like the use of the mouse in the save menu and did have the game crash once during my play through.  In summary I would recommend this game to anyone that considers a great video game experience to be more than just a sum of its parts, what the developers have managed to do with an outdated game engine, low res graphics and a keyboard only control scheme has somehow evolved into one of the best gaming experiences I've had in my life.",
            "review_score": "1"
        },
        {
            "review_text": "Picked up this game in a bundle. I haven't played many games in this genre or style, but I was thoroughly entertained and enjoyed this game from beginning to end. The dark feelings and dark art style fit together very well to put you in the characters state of mind.  Not a bad game for achievement hunters either. Fairly simple to achieve 100% requires a few saves between choices or a few play throughs.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed the story of the game, it's definitely got adult themes but they're not shoe-horned in there to be edgy or shocking, it has to be there with the story being told. It's got some fantastic ideas in there, I was skeptical about the main character however, but it may be me being a bit picky because of the range of quality in the voice acting that sometimes hit or missed for me. A couple of scenes or conversations made me think that maybe some lines needed re-writing but in truth, that's my only problem with the writing here. Susan Ashworth, as a character, as much as it pains me to say this, was not someone I as rooting for but I'm being picky. I did on a few occassions say outloud to my laptop 'Why aren't you saying this?!' I'll refrine from plot spoilers but, as it is with every adventure game with a dialouge option, they won't say the bleeding obvious. A lot of hard work has gone into this and I can see that in the characters and level design. I just wish the quality of mics were even across the board, it sounds like some people did either their lines over skype or right before they went to bed.  The game play is around puzzles and logical/lateral thinking and there were a few I were stuck on but as I don't play a lot of them, I was surprised that the puzzles were fresh, solvable and quite original which made me want to see the next puzzle there, the next thing I had to do. All in all, the game has its moments where you feel tense and excited and it was a good experience. It's full of ideas, it's full of life, funnily enough, for a game about death. For me this is why I kept coming back, your experience with the character may vary but she wasn't totally unbearable to me but never had her moments where I laughed.  The sound design on this game is an incredibly mixed bag. The music is great and you'll want to listen to more of it, it'll build and it'll be effective but then just cut out when they need it to and it abruptly stops. There's one sound that plays for multiple effects, but hey, you don't play this for the sound do you? The sound is a mixed bag but the graphics and attention to the levels and story is where the most focus has gone I feel. Although hard work must have been made to record and mix all those lines of dialouge, I don't feel like it's on par at times with the game world they've created.   All in all, this is a good game, buy it. Even though I have a few negative points about it, there more production points than gameplay points. The way the game plays is solid and it never gets boring or repeats the same idea over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "It's got a pretty disturbing atmosphere from the very beginning and keeps you on an eerie point. Having some issues here and there with achievements and save nitbits but overall seems really good judging from as far as I'm going.",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric, unique and compelling.",
            "review_score": "1"
        },
        {
            "review_text": "T H E C A T L A D Y    . . . Suicide is not the end.    Imagine your life in it's darkest moments, trapped in a bleak, meaningless circle of dead ends and false hope. You wake up every day, only to realize it will be the same as yesterday. Only to realize that the life you have been living for the last ten years means nothing anymore. You have no friends, you have nothing to motivate you, and you have no one to care about you. Happiness now seems like a dark puddle you sometimes see your face in on a rainy day, stripped of any emotion.   You think to yourself:   This is it. I am not worth anything to this world. Thanks for nothing. Goodbye.   So, that evening, as you prepare for your last night on this planet, you reflect on your past - who you've hurt, what you regret, the mistakes you made and wanted to change. You come to the conclusion that the world is not meant for you. You are not meant for it. Dying is now your only friend. It tempts you, haunts you, sings to you. You give in once you see the sleeping pills. All thirty four of them. Swallowed. In moments you can no longer see the dim lights of your apartment. You fade, in a blur, out of reality. A moment later, you vanish. You have killed yourself. No one will miss you. No one will care...     . . .But. What if you were offered a second chance? A chance, not to exact revenge on the people you hate most, but to change your very life and it's purpose. What if someone offered you the keys to fulfill what's been missing in your life. To truly find the happiness you once held, long ago, in those brighter, long forgotten days.   What if your most darkest, ugliest hatred gave you immortality? In exchange for death?      You think this over. Question the morality of the offer. What have you got to live for anyway? Why would this... 'person', so to speak, even give this type of chance to someone as pathetic as you? As worthless and miserable and unforgiving as you? After all, YOU were the one who took those pills to end the torment and suffering, to be free of the hostile pain that has swelled inside you for so long. Why even bother? Considering the fact that you are already dead, and that you probably won't be given another chance like this, you don't have a choice. Immortality does have it's price. But that's not why you accept. You hunger to kill these five people, to end their reign of terror upon the mortal realm, to make them pay for the horror they have caused others... People like you.    You accept this strange woman's offer, doubting everything she even says, but somehow knowing that killing those five people will somehow solve everything that has plagued your life. You feel eagerness tingling inside you for the first time in years - a yearning to actually do something good, something that will help the world and regain your sense of purpose. You feel reborn again. Finally, you have a purpose. A reason to continue living. A call to action.    Now it is time to find those five people. To confront them for who they really are. You are to become. . .    T H E C A T L A D Y  ",
            "review_score": "1"
        },
        {
            "review_text": "At first I wasn't sure about the game, but after I kept playing it I realized it was an amazing game. You want to find out what happens, what outcomes will happen based on what you do, what new adventures you can go on around your flat. The game is relatable, interesting, sad, but one of the best games I have ever played. The soundtrack is beautiful, while sometimes the sounds that the characters make freak me out, it's great overall. I'm going to be playing this game over and over again, because the story is too damn appealing to deny for too long. If you haven't played it, you really should. It's, by far, the best game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Not too shabby, but definitely flawed. An emotional exploration of depression. 8/10.  The Cat Lady is an introspective adventure game that follows a suicidal woman given the burden of immortality by an eldritch queen of maggots. The protagonist, Susan Ashworth, is forced to rid England of an array of serial killers, herein referred to as 'parasites,' so that she can be given the opportunity to die. The journey to end their lives has our heroine interacting with a constellation of characters who embody philosophical insight on the human condition, and the plight of the chronically, fatally, and/or mentally ill. The puzzles range from boringly simple, such as showing the player a pattern and asking them to repeat it, to artificially confusing, as in the infamous tornado summoning ritual from Castlevania II. Still, many puzzles balance level design and game mechanics well enough to produce a fun challenge. The art is good; although I may have my issues with the way the director chose to balance monochrome with color, the game overall encapsulates a memorable, pretty aesthetic.  The cast is effectively written and admirably layered. In The Cat Lady, we see various aspects of Susan and a handful of supporting characters. Even the parasites, who are disappointingly one-dimensional, offer iconic personalities and well-constructed allegory.  However, the one-dimensionality of the parasites brings me to a critical flaw of this game's rhetoric: in order to achieve sympathy for depressed people, the director throws psychotic people under the bus. Instead of purporting the validity of mentally ill lives, the game separates mental illnesses into good (potentially self-destructive) and bad (potentially externally destructive), suggesting that people with mood disorders belong to the former category, and that people with violent psychosis belong to the latter. Bear in mind the ableist demeanor of the game should you choose to buy it.  All things considered, I recommend this game. It may have its flaws, but its pros do outweigh its cons. If you suffer from depression or a similar affliction, I doubly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mental trip. It really tries to get into your head and it's great at setting the mood to freak you out. There's a lot of shocking scenes.  I want to know if there's more games out there like this.",
            "review_score": "1"
        },
        {
            "review_text": "Super adventure game with lot of choices which infulences game",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Great story, nice puzzles and some creepy scenes.",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' like others in it's genres, isn't so much a game as a story. That being said this is one of the saddest/best told stories i have ever seen, if you at all are intrestested in games like broken age, I highly reccomend playing this game, one of my all time favorates.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. My only complaint would be that it's only for Windows and runs surprising slow on some systems. I would recommend that everyone play this game, the story is amazing and the attention to detail regarding mental illness is incredible. 10/10, would feels again.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely sad and sometimes creepy game. Great replayability. Hours of fun, just do NOT play Chapter 6 after dark. No spoilers but MISERY!!! Creeped me the hell out.",
            "review_score": "1"
        },
        {
            "review_text": "I found out about this game while searching for adventure games for my girlfriend. There were not a lot of reviews but it seemed like a very interesting title. By random chance i bought the game for only 1€ and boy, what a steal that was. The game has a really inspired set of characters and a morbid story combined with a great, dark atmosphere and interesting art design. It easily kept my attention through the end and multiple endings are reason enough to play through it more than once. The only problem are the technical issues that ruin the experience a bit (the framerate and sound get choppy for no apparent reason from time to time (I have a powerful desktop PC that runs BF4 on ultra without hiccups)) but it's nothing game breaking and it didn't ever stop me from playing the game. The first playthrough took about 6-7 hours. I recommend this to anyone who likes adventure games, morbid tales or just wants to try something a bit different... My score for the game is 8.1/10.",
            "review_score": "1"
        },
        {
            "review_text": "Most disturbing screams I've ever heard in a computer game.  something out of something",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game story telling at it's very best, this is a game where you will care what happens to the characters, brillant but gutted it's over.",
            "review_score": "1"
        },
        {
            "review_text": "One of the wierdest games I've ever played that kept me wanting to play. It's very linear and has more dialogue than actualy gameplay, but I found myself playing nonstop for 2 hours straight. Worth a try if you're getting bored of the normal.",
            "review_score": "1"
        },
        {
            "review_text": "I found out about this game while searching for adventure games for my girlfriend. There were not a lot of reviews but it seemed like a very interesting title. By random chance i bought the game for only 1€ and boy, what a steal that was. The game has a really inspired set of characters and a morbid story combined with a great, dark atmosphere and interesting art design. It easily kept my attention through the end and multiple endings are reason enough to play through it more than once. The only problem are the technical issues that ruin the experience a bit (the framerate and sound get choppy for no apparent reason from time to time (I have a powerful desktop PC that runs BF4 on ultra without hiccups)) but it's nothing game breaking and it didn't ever stop me from playing the game. The first playthrough took about 6-7 hours. I recommend this to anyone who likes adventure games, morbid tales or just wants to try something a bit different... My score for the game is 8.1/10.",
            "review_score": "1"
        },
        {
            "review_text": "Strangest game ever, but in a good way. The story is dark and twisted. The humor is twisted also. It's got all of the classic horror elements... Moths, bare light bulbs dangling from fixtures, black and white/noir environments, maggots, etc. The dialogue is pretty varied, but always interesting. The puzzles and events are not annoying or tedious, and are entertaining enough as well. The story seems pretty linear. Choices don't seem to lead to long-lasting changes, they just trigger different cutscenes and replies that shortly follow, but it's fine.  Overall it's a really good game. The art style is... Interesting, a mix of photos/photomanipulation/drawing. It does a good job of creating environments that look both real (because of photos of real objects) and fake (due to odd arrangements and manipulation) at the same time, which is often disturbing.  The only major weak point is the character animation, which is a bit odd at times - sort of contorted cardboard puppet-like stuff going on. Usually it's pretty good and this is not too noticeable, but during long dialogue scenes with lots of back and fourth it can be a bit much. The UI is also a little weak, limited to up down left right and enter, which usually gets the job done. However, character movement sometimes interferes with item selection, which can be annoying.",
            "review_score": "1"
        },
        {
            "review_text": "It's all about being scared and petting cats. I think it's got the best Kinect integration ever and when you meow into the mic, all sorts of great things happen.  I decided to edit this review to get a badge, not because I care. Sorry for wanting badges.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a real masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Holy Mother of Satan! This is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "A rather dark and dreary adventure game in which a shut-in cat lady must rediscover her will to live... or something. The art and sound are very unique, capturing the dark atmosphere perfectly. The puzzles are tricky enough to get you to think, but not so vague as to make you frustrated and bog down the narrative. If you enjoy a well-written foray into the darker parts of the human mind, The Cat Lady is well worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Taught me that Americans are the only ones that pronounce garage normally. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I ruined my burger 10/10 Altso extremely good story and game play!",
            "review_score": "1"
        },
        {
            "review_text": "The Cat lady is a graphic adventure that will plunge you into the mind of a suicidal woman named Susan Ashworth.  The way this game conveys the feeling of anxiety, loneliness and depression to the player can just be classified as masterful. All the choices made by the developers are just so right that they must be mentioned: the music, the art, the style of the gaming mechanics, the horrifying images and demential scenes, and the whole setting of the game itself, are just wonderfully executed. There are even some quite funny as well as interesting touches of humor that will make you at least smile sometimes. Overall, this game isn't an AAA production, that's for sure, but it doesn't really need to be so. The creators of The Cat Lady clearly know how to adjust the correct screws in order to unscrew your own mind and submerge you into a greatly reproduced dark atmosphere. Let's just say that it will sometimes probably tear your mind a little with some really crazy stuff. Transmitting emotions through a videogame is not an easy task, and that's why it must be praised when a little piece of art like this is found. I definitely recommend playing The Cat Lady, but only if you like deep stories in the form of graphic adventures. FPS-only players might (most definitely) find this game boring. Anyway, if you are like me and enjoy a slow-developing, deep story, prepare for a few good hours of gaming. And I won't say anything else, because playing and experiencing the game for yourself is the best way to understand what I'm trying to say (and I don't want to spoil the best parts, either). Final appraisal: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "First time I get to play a game where female heroine is 40 something years old and dealing with depression. Won't forget the amazing storyline and atmosphere of The Cat Lady for a long time.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has absolutely blown my mind. I expected a decently written game, but was not prepared for the depth, gorgeous presentation and fantastic soundtrack. It handles mature themes and depression in a respectful and delicate manner, therefore I highly recommend this game to anyone!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played this game much but I've seen playthroughs on YouTube and it's absolutely gorgeous and has such a deep meaning. The animation style is fitting for the game, and it has an amazing soundtrack. This is one of my favorite games, and I went through all the trouble to get Crossover for Mac working just to play it. Anyway, it's an awesome game and if you love sad, kinda messed up games then The Cat Lady is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game... Have played it more then once...",
            "review_score": "1"
        },
        {
            "review_text": "this game, though simple, is extremely entertaining. i lost sleep and concentration just from the anticipation of what would happen next. it's a game i wish there were more of. it's dark and hits home. and god damn it, this game made me feel feelings. and the visuals really surprised me. again, simple, but charming. the drab colors and monochromatic schemes made the game feel unsettling, which really made the few bright colors stand out in your mind and set a definate mood. also, as a long-time david firth fan, i was happy to see him playing the voices of the exterminator and gladys. really loved the soundtrack as well. there would be times i would stop progressing just to finish the song. i would strongly reccomend this to anyone looking for an unusual horror experience who doesn't need jump scares to thrill them.",
            "review_score": "1"
        },
        {
            "review_text": "Runs good on an old laptop. I couldnt finish it.",
            "review_score": "1"
        },
        {
            "review_text": "The Cat Lady is one of the most meaningful games I have encountered in a long time. The main character, Susan Ashworth, is easy to connect to. Despite her age, past, and living conditions, I believe anyone could find a connection with her. Especially those who have stuggled with depression and suicide.   A game that explores the deeper meaning of an end, the effects it has on others, and brings it all together in a way to show a worth of a person's existence, good or bad. Each person is a piece in this life, as every character in this game has a point of being in it.   Some may complain about the graphics, audio, or physical gameplay. I, myself however, believe it adds to the charm of it. Pops of colour are surprising and comforting, as well as they can be disturbing. The Cat Lady has many elements which make it a worth while game to devote some time to. 8 Chapters can be completed in roughly 8 hours, making this game easy to complete. It has multiple endings to discover, and the truest ending leaves the biggest impact.",
            "review_score": "1"
        },
        {
            "review_text": "Game with amazing story line! Fantastic music, art and atmosphere. Dark and twisted game for horror lovers. Some moments are kinda sick, but it's charming in some way.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best indie games I've played in ALONG time. The soundtrack is just amazing. It goes so well with every aspect of the game and I'm downloading it right now. The story is absolutely amazing. They represent suicide and depression so well in this game. Now, this game is very gruesome, but I don't really think this game was made to be PG-13. The character's in this game were so well-written, and the voice acting was fantastic for an indie game. I honestly just can't praise this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, fascinating, beautifully dark game. It deals with themes of depression, suicide, and murder, but there's always hope, and that's what this game centers on without falling to too much cheesiness (save in certain instances.) I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "sick ♥♥♥♥ all the way through. come and see",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. The story, the whole feeling of the characters and the personas they have is definitely why I really enjoyed this game. I really want to play it over because there is many stuff left to do and achievements to get but yeah, I love Susan and Mitsu. Very great chracters. I was soo into the story and it was very sad at the ending but I won't spoil it. I recommend this game for those into a good story with that eerie feeling to it/point &amp; click adventure. i would love to see a part 2 to this game, it really taught me alot about what many go through with depression and suicide. This game can teach you to I think for anyone who relates to the story of Susan but she's a great character. This game gets a 10/10 from mi :D",
            "review_score": "1"
        },
        {
            "review_text": "Hands down one of the best games I have played. Its intense, dark, and beautiful. The story and character development were great as well!",
            "review_score": "1"
        },
        {
            "review_text": "I've nominated 'The Cat Lady' for the “I'm Not Crying, There's Something In My Eye” Award because it is one of these games I can not forget because of how emotional it is. Don't get me wrong: This is heavy stuff. Depression, murder and much more disturbing things are part of this game. But it's a one time experience, not comparable to any other video game story I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game! If you are unsure check out my first video on The Cat Lady:         YouTube™ Video:  The Cat Lady Episode 1 - Chasing Animals&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "One of my top 10 games, i love it. buy it now",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliant game with exellent artwork, beautiful soundtrack, and an entralling story. i highly recommened playing, but it may leave you shocked and disoriented.",
            "review_score": "1"
        },
        {
            "review_text": "The Cat Lady was an amazing game. The choices you make in game affects the ending you get. Gorgeous art and unique story. Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "The Cat Lady - 9/10   I have over 200 games on Steam but none seem to keep my interest for that long, but The Cat Lady has! Every night I've been making myself a nice cup of coffee, sitting down then progressing further into the dark story. Voice acting is fantastic, especially between our main character and her room mate (Mitsi) It feels like I'm watching a really good thriller but I'm controlling the actions.   The art direction is really good, the music is great (I especially like the main menu music when you first boot up the game)   The story is really what grabs you, whilst most games revolve around the gameplay whilst there story is lacking, The Cat Lady is the opposite in that it is the story that takes the front seat, This isn't to say the gameplay is bad, the gameplay is similiar to a point and click although you use the keyboard keys to move your character in a 2d fashion (WASD being the main keys)  This is where my one complaint comes in, and the reason I scored this Masterpiece a 9 rather than a straight up 10. The controls do feel clunky, pressing down (or S) brings up your inventory, this feels sluggish and not as snappy as it should be. I really wanted to sit back in my chair with my nice hot coffee and play this using my pad... The game should be perfectly suited to a pad, move left and right, select objects, open inventory, but whats this? No controller support?  I'm sure it would of been a simple thing to implement partial controller support, even a slight vibration feature on the pad when something jumps out (or even to reflect your characters heartbeat in the more tense sections)  I know there is 3rd party software out there to be able to map keys to the pad but this would of been a nice inclusion from the start.  But enough of my grumbling because that minor complaint is the only thing I can think of, This is one of the finest adventure games I have had the joy of playing since Grim Fandango &amp; I look forward to future releases from this developer  + Fantastic Story  + Dark moody atmosphere + Great Voice acting &amp; music  - Lack of controller support - Slightly clunky Keyboard controlls  Overall 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story development, more of an adventure story than a game as it isn't too interactive but the story is good enough to keep you playing.",
            "review_score": "1"
        },
        {
            "review_text": "wow, just wow!....  this game is just amazing. the story, the gameplay the darkness, the twist and the music.  i havn't enjoyed a game like this for a long time! i even enjoyed hunting for the secret achievements.  the only thing you should worry about if u are hunting achievements and have to save a lot that you only have 50 save slots. EVEN if the game shows up 'save successful' msg. so make sure you copy paste to another folder or so.  save location is there C:\\Users\\USERNAME\\Saved Games\\Cat Lady  ENJOY this awesome game!  p.s. dont hunt on first gameplay it might ruin your experince with the game :)",
            "review_score": "1"
        },
        {
            "review_text": "A story about a poor woman in desperate times. But soon things change but are they for the better?  A truely dark game with sad elements but it gives relief in the end, recommended for everyone who is in to good story, deep atmosphere and a suiting style.  ",
            "review_score": "1"
        },
        {
            "review_text": "This little game is worth it's weight in gold. Great story to it, quite challenging at times and simple to play. It's all about the design, atmosphere and story in this game, so if that's you're cup of tea then I would recommend 100%!!!   Susan is such a tragic character, who is so easy to relate to, especially if you have ever suffered from any form of depression. I appaud you Harvester Games for creating something so heart wrenching, and often frightening as The Cat Lady.",
            "review_score": "1"
        },
        {
            "review_text": "My favourite game ever. No question. Not only the rich story or the representation of serious depression and related issues, but the style itself it wholly unique and charming in it's grotesque way. Your choices aren't obvious and the puzzles are easy enough with just enough challenge to make sure you never loose your temper.  It's relatable and tugs on your emotional strings if you let it. Morality ends up being questioned more than once on not only what effects your character, but what effects other characters.  The horror elements are well done, one or two jump scares that use music and music to their advantage, but even so they're well added and give their maximum effect, however most of the horror lies in the blatantly obvious, it's creepy and the horror is right in front of you the whole time rather than hiding in jump scares or cheap tricks.   All in all it's a brilliant game with real characters I became attached to easily. The story is one I'll never forget because it effected my life for the best.",
            "review_score": "1"
        },
        {
            "review_text": "Deeply disturbing and melancholic, but absolutely brilliant. Best horror adventure I've ever played, and one of the best adventures.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes dialogues are too long and boring, but overall it was a good game. Would recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't typically write reviews about anything unless it is something REALLY amazing.  First off, I got this on sale for 2.50 and it is worth so much more than that. If you like surreal themes, horror, and adventure, this is for you. I don't become scared or disturbed easily, but at times this game deeply disturbed and moved me. However, if subjects like death, suicide, and illness are currently too much for you, you may not want to play this. After a while I was afraid it may be too dark for me, it touched home too many times to count and made me a little uncomfortable. But, I felt compelled to push through the game because…well, I was enjoying it too much for the discomfort I was experiencing to stop me. It actually became a deeply personal thing to finish the game.  It is a work of art, both grotesque and profoundly beautiful in meaning. It became so much more than a game, even by the end of the first chapter. You will find yourself sucked into this world and embracing it in no time at all. I only hope for more like it in the future.  From what I can tell, there are different outcomes for the actions you choose, so no doubt I can play this again with different results, which is a huge plus. The controls are easy. Visually it is both simplistic and complex, you have to pay attention to your surroundings and really think. I love that this game challenges the player in so many ways.   For the price it is well worth it, I say give it a shot! You may be as surprised as I was.  ",
            "review_score": "1"
        },
        {
            "review_text": "This was actually more fun than I expected, since I just bought the game while it was on sale with no other information other than the summary. There's definitely some dark elements to the game (more than one would expect from a game called 'The Cat Lady'), I mean the whole premise is a woman trying to commit suicide, and the proceeding events. Really interesting story, some fun puzzles that aren't brain-burstingly hard, but difficulty enough to make you run around the scene a few times before figuring out what to do. Lots of dialogue, but the story makes it not so terribly monotonous. One really annoying part is that the text cuts off when selecting what to say, so there are times where you don't know what attitude your character is going to respond with, but for the most part you get the gist of what it is. I don't think I would have paid full price for the game--although I am somewhat cheap--but I definitely feel like I did get my money's worth, and I played it twice through. Good RPG. Not so much scary, but creepy. Recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Cons: the UI and graphics aren't particularly great.  Pros: Everything else! It's deeply twisted and violent (my type of catnip). The horror isn't dependent solely on jumpscares - ofen there is a nice tension that is developed for that. The mature themes were interesting and well written. I found the story pacing was well done also.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked this game. The art style is different and the voice acting is not the best... but its still a good game, nonetheless!",
            "review_score": "1"
        },
        {
            "review_text": "This game was a huge surprise. The Cat Lady is a graphic adventure that managed to conquer itself, change, tell a creepy, original, sometimes sad story, and kept me sitting more hours than I was aware of.  Its a piece of art.  At first I didnt know what the heck was happening, and at many times you will probably feel confused until you begin to get it. The atmosphere is great: most parts of the game are almost completly pictured in grey shades, with only a few colorful elements here and there, and all of a sudden there are moments of full color that bring great emotion and poetry.  Big yeah for the music.  The sounds (rain, wind, sudden events) are great, yet you will notice that sometimes some sounds and voices are badly recorded. But that did not spoil the climax for me. I am very happy I played this game to end. Puzzles are adecuate (I did not find them hard obstacles to continue enjoying the story). There are even moments you can choose some actions but I dont know how much that affects the end (I guess not).  This is an original graphic adventure with an original and very intuitive way of interacting (you just use UP n DOWN / RIGHT LEFT arrows to bring inventory or interact with people and things).  I highly recommend this game.  PS: there is a big surprise for the ones that played Maniac Mansion back in the eighties, like me. I couldnt believe what I was seing. Thank you so much.",
            "review_score": "1"
        },
        {
            "review_text": "I first saw this game played by CinnamonToastKen two years ago... I finally got it this year and yes, it is awesome. It's a really good game. The story is beautiful and the graphics are good for a crappy computer (mine). If you're into story games like me and not really all for a lot of action. This is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy awesome, One of my new favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "The only dissapointing thing about this game is that my play through ended after only 8 hours! I loved it, for so many reasons, like how well it's written, the voice acting, the soundtrack, the story, and just how it makes you feel for Susan and all the others. It gets inside your head and it's great! At times it can be bordering on terrifying - not in a necessarily gross and gory way, but the atmosphere, how you're never sure whats going to happen next. I love the journey Susan goes on and how the game portrays the feelings of depression and suicide in a realistic manner. There's a sequel in the works I hear, I will be purchasing it right away! ",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed every minute of it.",
            "review_score": "1"
        },
        {
            "review_text": "THIS is the most cinematographic and scariest game of my life! highly recommend! cheers to people who felt this lowest (in positive sense) grade of life and were able to wrap it in media of videogame!",
            "review_score": "1"
        },
        {
            "review_text": "A story about a poor woman in desperate times. But soon things change but are they for the better?  A truely dark game with sad elements but it gives relief in the end, recommended for everyone who is in to good story, deep atmosphere and a suiting style.  ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome story portrayed in really disturbing way. The resolution is low but it sort of gives the game more than it takes. Some voiceovers are not that great either, but it didn't mind at all. What matters is the setup and atmosphere. The whole game reminded me old times of Broken Sword and other adventures that I played when I was younger. If those games were horrors of course. I had a few stucks in game but it's solvable if you use brain :-)",
            "review_score": "1"
        },
        {
            "review_text": "Let me make it clear, I recommend this game ONLY to people looking for a dark and horror'ish adventure game. I almost didn't play it through, I quit in the first chapter because the game is just SO dark and heavy.. and not the game I was looking for at the time. But then our family dog died and my thirst for just a game like this came over me, I played it through and I loved it! The characters feels so real, the monsters is horrifying and the story is a masterpiece. Play it if you dare.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I am a Cat Lady but I'm sure everyone can enjoy it as well! ;) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Cat Lady is easily one of the more interesting games i have played through. It is a dark story following a 40 year old woman with a love for cats that commits sucide but instead of just dying she finds herself in an odd realm with a rather trippy and dark journey ahead of her. To start, the story was really beautiful and dark, you are easily able to feel for and understand the characters and the strifes they are going through as they happen or are revealed. The game is very good about steering you in the right direction as far as knowing what is interactive in the world, by literally pointing to it as you pass by the item, and the areas are well set up to where getting lost or stuck is never a worry. There are a fair about of puzzles so if you're not at least ok at puzzles, this game might not be for you, but really they are not all that bad. The puzzles help with the lack of interaction and reaffirm that it is a game and not just a story being told to you. The controls are very simple, on just about any keyboard, you can easily play this game with one hand. This aspect actually helps you to simply relax and enjoy the brilliantly dark storyline, since you are not having to worry about complicated controls. The only problem I really had with this game was the save system it was, to put it blunt, BAD. When you wanted to save multiple times through the game it had to be a brand new file there was no overwrite action but overall that's not really a problem as long as you have the patience to name you save files accordingly, not that i ever did. Overall it was an amazing game. The cat lady is a very good game for anyone who likes dark stories and puzzles. I highly recommend this game to everyone, especially if you want a break from all the heavy action games and relax with a good story.",
            "review_score": "1"
        },
        {
            "review_text": "Very slow at the beginning, but if you can hold your horses i mean really really tightly then the game gets you addicted and you won't want to stop playing. Best $3 I spent on a game! :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely incredible....few games can bring me to tears the way this one did.   If you like creepy, story rich, horror games, this is for you. I like the gameplay, it's simple, but oh so satisfying. It's also a great game if you're thinking about committing suicide. Seriously. You can gift it to a friend who is struggling also. It contains a wonderful, powerful message while still being gruesome and horrible at the same time. It's so great.   10/10.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly genuine story about human relationships, depression and our relationship with death, disguised as a psychological thriller. The game features a new and fresh take on the adventure gameplay model, an expansive soundtrack and a distinct graphical style that adds a sense of eerie surrealism when seen in all of its twitchy motion. Easily one of the best games in the genre that I've played since Maniac Mansion came out. Oh and there's a bit of fanservice for fans of MM in here too ;)",
            "review_score": "1"
        },
        {
            "review_text": "This is way better than what i was expecting, The atmosphere was creepy and dark and the storyline was great. There was alot of emotion put into this game and characters. It made you feel like you were part of the story. Setting in a dark room while playing can really get you into the game. Highly recommended for people who like a Silent Hill type setting. You will not be dissapointed! Hope they make a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "What a strange game. While it is not nearly as disturbing, horrific or shocking as many say it is, it's still really good. The worst part about it is that it can occasionally move at a glacially slow pace, and lines of dialog are unskippable (it's a HUGE drawback). Other than that, the story is incredibly good and worth seeing all the way through. Multiple endings give it some replay value, but many people probably won't want to do so again. Definitely recommended on sale, or at full price if you like point-and-click adventures.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics: 8.5/10 (The monochrome combined with the near sprite like images and limited movements actually works pretty well)  Audio: 9.75/10 (The soundtrack is amazing, fits atmospheres and situations superbly. The ambient noise is also perfect. My only complaint is the repeated dialogue or annoying screaming)  Gameplay: 8/10 (The game is mostly simple button pressing, but I was surprised at the challenges the some of the puzzles provided me)  Plot: 9/10 (Excellent, plenty of honest and heartwrenching moments, combined with some interesting ideas and concepts. It takes a very honesty approach to life, suicide, death, and passion.)  Characters: 8/10 (We get to see the past of not just main characters to better empathize and understand those that we commonly disregard)  Verdict: This game is an absolute must play, I guarantee it'll affect you emotionally in a pretty strong way, and in a way that's done honestly and realistically instead of overly optimistically. Presentation and puzzles are also extremely worthwhile   Overall: 9.25/10",
            "review_score": "1"
        },
        {
            "review_text": "If you can forgive some ropey VO work, this is a mature tale about depression and loss, and contains extremely dark themes. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Wish there were more like it.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Decent Story - Good art and music - Clever script and dialogues  Cons: - Poor Gameplay. crap controls and game interface. - (Linux) few bugs and the game blocks everything from alt tab to keyboard volume controls.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't too sure what to expect when I got this game; when I first started to play it I wasn't entirely sure if I liked it or not, but it ended up really drawing me in.  The gameplay is simple, yet the story and character development is incredibly powerful.  It's dark and depressing at points, but you'll be glad you saw it through to the end.",
            "review_score": "1"
        },
        {
            "review_text": "A woman of the age of 40, that goes by the name Susan Ashworth, she yet to live again. Given a second chance, she can turn her life around and maybe save others? This game is pretty depressing and sad, but also a great horror game. You will recieve a amazing experence and perhaps some new feelings as well. With some disturbing moments in the mix, it gives tou a mixed feeling about... well everything. I personally really enjoyed the game, no matter how creepy it was.  10/10 - Amazingggggg!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Unique, flexible and almost tailored to each player...it's a game that can be played multiple times, without boring.  Draws you in and pulls you along for the ride. Just Buy the Game. You will NOT regret it.   ~Sam",
            "review_score": "1"
        },
        {
            "review_text": "Haven't got too far in it yet, but it's a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Most emotional ♥♥♥♥ I've ever played...",
            "review_score": "1"
        },
        {
            "review_text": "A very creepy messed up horror point and click game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game. It has elements of magical realism and the character development is very good for the protagonist. The pacing was also very good. There wasn't a time where it felt like it was dragging on. The gameplay itself is very simple. There were never any bits that were too complicated which is a plus considering the game is focused on plot and character development. Definitely worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "The Cat Lady.  This game is not just about the Cat Lady. This game is not just about Susan Ashworth.  This game may be about you.  This game will leave you thinking about your life, how you view it and how you value it. I don't know, the hangover's just great that I'm lost for words.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best stories I've ever taken part in, dark and disturbing, just the way I like it",
            "review_score": "1"
        },
        {
            "review_text": "much good walking with arrowkeys, adventure, mystery, horror, find object game, its sort of cozy with all the characters and you will likely be so pulled into the story that you won't remember your own IRL existance. The Cat lady is not really a scary POP up game but more a very disturbing imagery game that may or may not scare you! (depends how much of a horror veteran you are) But because of its story and cozy characters its sucha experience that makes this game a very GOOD game =) its very well executed  Only con acording to me is that some times you wont figure what to do and it can take a while untill you do... one might go insane like me trying same things over and over when the actual answer was somewhere else!",
            "review_score": "1"
        },
        {
            "review_text": "So twisted sick yet so beautiful.  I enjoyed listening to the weird but nice music as well.  Bought a couple more copies to share to people.  10/10 one of the best games I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Good Plot,Good Spookes,And Alot of creepy awesome ♥♥♥♥! 100/100 10/10 5/6 1.9/2 :P",
            "review_score": "1"
        },
        {
            "review_text": "Agh! Loved it.  A couple of bugs here and there where it seemed I was playing through treacle when trying to move around, and also a couple of crashes (which lost me a huge chunk of save data) - however this didn't at all stop me from taking a big old deep breath and cracking back on with it, simply because I enjoyed it so much! I'm also a big fan of text based and point and click adventure games (I blame Monkey Island for the obsession), and psycological horror titles (more blame? Silent Hill...) - so mixing up the two themes made The Cat Lady sound really appealing to me. The story is incredibly dark, the art style is incredibly complementative of that darkness, and as is the audio score. It all gels so well! The voice acting is pretty good too! I even got totally suckered into a handful of jump scares aswell - generally didn't want to put it down. It kept me thinking when I wasn't playing it, which is also a sure sign it's a winner for me. I'm terrible when it comes to adventure games, I forget it isn't real! Haha! The game is a lovely length too. I was expecting it to be quite short actually, and it may well be if you know what you're doing from having played it already, but the puzzles are freaking taxing (not a bad thing!! A great thing!!).  If you're a fan of point and click, with a huge dollop of psycolocial horror in the mix, please give this a go. Tryin to scour more of the same now I'm all out of my daily dose of grumbling Susan!",
            "review_score": "1"
        },
        {
            "review_text": "Old school point and click adventure, similar to Sierra classics like King's Quest. Decent story, although extremely dark and morbid. Fun to play in the dark with the speakers turned up.  May be a stretch at listing price, but a great pickup if its on sale for $5 or less.  PS: There was a CTD issue in the very beginning of the game on Linux that was solved by downloading a 64-bit library instead of the 32-bit one that ships with the game. I'm unsure if this is still an issue, but you should be able to find the library on the forums here if necessary.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game when it was on special and a enjoyable game, if you have patience as some things you have to do take some time and thinking as well. I liked how the game deals with depression, also how a person can just want to give up like Susan in the game as she does not feel like there is anything to live for until she get's a second chance at life and a new flat mate who is trying to get along with her. Sometimes you will be thinking what will I do next, and should try and see if anything is missed or explore further in the area. It is a game I would recommend, as the subject it deals with is a tough one and depression can be hard to deal with and the game showed the true facts of it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is gritty, gruesome and disturbing. So much about it is tough to watch play out. I got to a point where I had to step away from this game because it was affecting me so much. Fast forward nearly two years and I picked it up again. And I didn't regret it. Though dark and depressing at times, it's a wonderful little horror game that pulls off being both creepy and heart-wrenching. The voice acting isn't the best, but that's a small downside. The art, despite not being very pretty, fits the game well and adds to it's eerie charm. If you are looking for a good horror game with a good story, I would recommend this. Don't be put off by it's art style and the side-scroll format. This is a gem of a game and well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "This is really fantastic. Great cinematics, writing and music. It's like a point-and-click adventure, but only allows the keyboard for movement and interaction with objects and inventory.",
            "review_score": "1"
        },
        {
            "review_text": "A tablespoon of a little weird, a teaspoon of sick and twisted, and some dashes of oh-so-odd with a splash of deep sadness and a pinch of yum-yum vegenence, and you've got The Cat Lady. Loved it, loved it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game!  At the start of the game it does not seem all that great but over time the story just drags you in by presenting questions with sanity breaking answers. There are multiple times where it gets gross and scary to some extent and this is where the game is at its peak potental as its not just a blind scare, its also a puzzle during these times where you have to solve the situation to progress, this works REALLY well!  The art style is also to be recognised as it sets the atmosphere perfectly, although the odd scene does not seem right in terms of the game structure for example the main character looks a lot more sharper in detail compared to another character for some odd reason this however, is a very minor problem and it does not ruin the experience.    This game is a shining example of how indie games should be made, its fun, interesting and very well made. You would be a fool to not experience this story for yourself.  The good + The game will take hours to complete. + The story is amazing. + Every dialogue is voice narrated!  The bad - Sometimes certain in game objects/character resolution does not make sence to the rest of the current scene. - No controller support (Although there is no real need for it). - The voice acting is not brilliant, but not terrible.",
            "review_score": "1"
        },
        {
            "review_text": "It may have simple graphics and doesn't use a mouse. But it is very very good. It is a psychological messed up adventure game. Even the art is disturbing. I tore through this game an dintend to go back to get the 'perfect' ending.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the few games that i would call a masterpiece. Mechanically and Graphically it is rather underwhelming, with a really low resolution and clunky gameplay. This is not the reason to play the game however. The real genius lies within the games story, characters, visual design, art style and powerful message.  This game deals with depression in a rather unrelenting and brutal fashion, depicting a middle aged woman whos tragic past has emotionally crippled her and made her trapped inside her gloomy English flat with only her cats for company. This game will definitely deliver some powerful emotional punches and portrays reallistic, morally grey characters who seem very real. A lot of people reccomend that this game is not for people who suffer from depression, but speaking as somebody who goes through deep bouts of depression fairly regularly, this game did not deliver any ♥♥♥♥ sandwhiches that i hadnt already been served and actually was quite nice to know that there are some people (albeit fictional) who feel the same way as i do, and the game left me with a positive message that was very uplifting.  In terms of visuals, this game is unlike any other. The entire game is viewed from a side on perspective which allows us to see all of the things going on at one time, and especially during conversations this is a very effective way to present the game to the player. The art style depicts a very gloomy and unpleasant world, but it pretty much looks exactly like London in real life, so the depressing cramped flat where the character lives and the filth all over everything is not very far from the truth.   The acting can be hit and miss (although what can you expect from an independant game) but many of the voice actors (mainly the women who play Susan and Mitzi) deliver very good and emotional performances. There was also a nice appearance by David Firth as one (well, two) of the several serial killers encountered in the game. Some of the music seems a little out of place (i personally think that the final section of the game would have worked better in silence) but that is easily forgiveable as the music is BRILLIANT.  Basically, this game is extremely good in terms of story and characters, but in terms of gameplay and graphics it does fall short. If you want to play something based around dialogue then definitely pick up this game. If you would rather have a more action oriented experience then this probably isnt for you.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved this game. I'd recommend this to people wo are into more psychological game type settings. It handled real world problems well and gave me 'keep on keepin' on' vibes.",
            "review_score": "1"
        },
        {
            "review_text": "In the very beginning I thought it might be awful, but I stuck with it and it turned out to be one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "I had acquired this game through a game bundle, otherwise I don't know if I would have bought it.  The game was certainly dark. Spooky but not really scary, although I think it would have been scarier full screen, for stream purposes I had to keep it windowed. One Chapter creeped me out so much I referred to a guide.   The music was nice, and the dialogue wasn't bad. I streamed the game, and some in chat kept mentioning the voice acting and lack of pop filter with the voice actors.   The visuals are definitely more on a rough, artsy side.  The sounds and visuals help create a creepy and dark environment.  The dialogue was real, sarcastic, and a bit tongue in cheek.  The puzzles aren't too challenging, there was a bit of back and forth to locations to find items.  I did have a couple problems with not being on the right spot to use an item, which resulted in some time being wasted.  It took about 10 hours for me to finish, but honestly, it is about an hour, hour and a half per chapter.   If you find yourself leaning towards happier games, I wouldn't recommend this as it heavily influenced by the topics of depression and suicide.  If you like adventure games with a story and puzzles. I think you'll like it.  Overall I do recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has nothing to offer when it comes to gameplay. It's pretty much walk around, look for interactive spots and try things out while trying to apply common sense. It's not hard by any stretch of imagination, any puzzle can be solved relatively quickly. It's even simpler than any point n click game I've ever played since you're literally only moving horizontally and can't miss anything you could interact with.  But that's obviously not the point of this game. It is more of an interactive, relatively short story that has some replay value due to plenty of different outcomes from all the choices you have. Some are rather irrelevant, some are quite important to the story.  But what hooked me up the most is the ever shifting atmosphere of the game. You have so many moods in it; very depressing moments, surreal sceneries, delight, happiness, humour as well as some jump scares and gory scenes. The soundtrack is just on par when it comed to mood induction. There were some scenes that even brought a tear to my eye especially the golden ending.  I'm not one of those intellectual snobs that babble about this game for how deep or shallow it is, but I do enjoy the philosophical aspect of it that made me appreciate a few things in life I haven't given thought before.  The controls feel strange at first, especially handling the inventory, but they're so simple that you can get used to it in no time. And since it only requires 7 keys (arrows, enter, escape and space) you can use joy2key or similar tools to map the controls to just about any controller you want if you don't like keyboard controls.  The only actual complaint I' have up is the awful sound mixing of the voices. Not the voice actors themselves, I think they've been great choices, but their mastering, or sound levels. I have no idea about correct terms here, sorry. But there's NPCs whose voices seem to be just raw footage. And then there's some that are just awfully loud compared to everything else. Others seem to lack any trace of bass, which hurts. And the antagonists of chapter 4 have really weird sfx on them.   All in all The Cat Lady is a very bittersweet story that I gladly recommend to anyone who's not an audiophhile and in the mood for gloomy entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "Picking up this game, I was incredibly disappointed by the first 1 and a half chapter. The pacing was slow, the voice acting awkward and the characters so cliché it was awful to witness. However, I still found this particular pick of protagonist so interesting. Most horror games either have this handsome, yet troubled young man or maybe a gorgeous, yet a bit disturbed teenage girl to play as. So why pick a horribly depressed mid-40ies cat lady, out of all people? I just had to find out. I decided to continue playing and I grew to love the game. The dialogue between the characters (especially Susan's inner monologue) was brilliantly written - while the game continued to be slow paced, the plot started to pick up throughout chapter 3 and this all turned out to be a fine, refreshing piece of horror with some remarkable endings. Some might find the graphics a bit simple, some would even call it rough, but the more I played, the more I realized that it fit the story perfectly.  The puzzles were satisfying - not too challenging (sorry to upset the puzzle lovers here), yet it left you thinking for a bit and unlike some horror games, the puzzles were relevant to the story. I must admit, the greatest part of the game was how this little piece of game contained so many life lessons. How I learned the different perspectives of life. That you can be in the worst place of your life, wanting to end it all, yet you may be able to get through all this pain and find that one thing that makes you want to give life a second chance after all. All in all, it was a raw experience that I'm glad to have been a part of and I'm so glad I gave this game another go. 7 out of 10 from me.  ",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game and i have to say it was very interesting.  The visual style is unsetting and ugly to look at, but adds to the deep feeling of distress and the over all macabre nature of the games themes. The disturbing story is morbid but somehow beautiful and powerful at the same time.  It deals with unpleasant subjects, especially death but tells it in a very real way, like no game I have ever played before.  Would recommend if you're a fan of pathological, morbid story telling.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game while it was on sale and it was a fantastic use of five dollars. This is one of the first games I've stayed up all night to finish in years. Its that good. The story is great and emotional, the setting is creepy in all the right ways and the soundtrack is amazing. It may not look the prettiest or have super amazing fantastic graphics, but that is just part of its charm. I highly reccomend this game to anyone who is a fan of story heavy adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "Dark, story rich &amp; brutal.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game A LOT!",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Blew me away. Could not put the game down. I had to find out what was going to happen next, because there is no way of knowing what is coming your way.",
            "review_score": "1"
        },
        {
            "review_text": "There's some good and bad. Really cool story with great music. The art goes for retro, but is still done well in shadows and colors applied. Animation is a hit or miss, sometimes it's alright when watching characters move about and other times it seems like they used a rag doll program to make some characters move (it was pretty silly). There isn't much to the game play, no point in click you just use the arrow keys to move and interact with everything. It's a little tedious sometimes to the point that I just ended up using a guide to get to everything quicker. What's really bad about this game? There is no sound options which bugged me for personal reasons, and the saving is disgusting. Purely horrible. I ended up watching a 'lets' play because somewhere a long the lines I would save at the beginning of a chapter and it would load me back later to my last save in the previous chapter. I became frusterated and just went with a lets play video because I was close enough to the end anyway. There was also this moment when meating the pest control guy that everything slowed down immensly like some odd lag bug. I'm not sure if it was just my game or if other stuff like this has happened, but bugs are still in this game. I reccomend it because it's a pretty great story, atmosphere and I want people to support the artists. But watching a decent lets play (with nobody talking through them) might result the same results of enjoyment I had with the game.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't sure what to expect but it is a complete masterpiece! It's a different kind of horror game than I am used to. The story is very interesting and shows the depth of depression of the character.",
            "review_score": "1"
        },
        {
            "review_text": "I don't often write reviews for games after I play them, but this game deserves some recommendation. When I first got the game, I played 5 minutes of it and it just seemed slow and not too great. THOUGH that was most definitely not a bad thing. As I continued to play, it began to explain its self. I stopped worrying so much about the awkward gameplay and more about the story and the world. I got ridiculously immersed even though the gameplay was confusing and some processes took me a long time. It throws you in a world you know little about, but enough to guess and question. So learning the story as it reveals is extremely satisfying. The story offers deep perspective, it is very unpreictable, immersive, emotional and it does a very great job at making a real world setting sinister, creepy and without jumpscares, horriffic while remaining realistic. Which for a sidescrolling game like this one, I imagine would be awfully hard to do. Not to mention the artstyle. It is so inconsistent in textures - between realistic and pixelated - but it somehow manages to create the perfect aptmosphere that's easy to look at. A unique and admirable artstyle. The games story and art makes up for the slow and at times awkward gameplay by far.   I RECOMMEND THIS GAME IF:  You would like to get immersed in a twisted creepy depressing story. You like puzzles. You like simple, though quality games. You're a fan of psyhcological horror games.  And I recommend it to anyone else who's interested. It is well worth $10 for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Sad game for mature audience. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ THE CANNIBAL WOMAN AND HER ♥♥♥♥ING ACHIEVEMENT!  Now that I got that out of my system, onto the review.   Graphics: I didn't care much for the pixelated visual style but after a while it grew on me. Story: I really enjoyed the story, at times it got weird with the whole Cat Avenger angle, but the depression, the hopelessness, avenging wrongs, murdering evil doers, it all came together into a mind-♥♥♥♥ type of game. Multiple paths for multiple achievements are always welcome.  ++++",
            "review_score": "1"
        },
        {
            "review_text": "This game was very good. The game play is simple and the story is really good. The only downside I found was there are lots of long scenes that make it feel more like a visual novel than an actual game.",
            "review_score": "1"
        },
        {
            "review_text": "I really loved this game - one of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best stories I've ever taken part in, dark and disturbing, just the way I like it",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, distressing, moving, immersive, bizarre, supernatural, suspensefull game. I'm really glad I found it and I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play and a very good storyline",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, that's 100% true even if I am writing this review for a badge; give it a shot if you haven't already absolutely worth the 10$",
            "review_score": "1"
        },
        {
            "review_text": "So.... I`ve played this Game one minute ago. And I`m ... stunned. I got not much negative to say about this creation. The art-style is a bit stuttering, but this doesn`t bother me I think it`s a harmonious combination between art and storytelling. So the drawing style fits perfect in the whole concept. The game is less about horror and it tells more a deep, emotional story which is authentic to the feelings we all went through in our lives, some of us more than other.  I my opinion the story is a lyric parable to things we are facing on our way in live. I see it specific in the parasites. On the other hand the game got a guiding principle. Particularly people with similar problems are more attached to the themes.   So the game got a methascore 81/100. In my opinien this isn t enough, I see the reasons why some points had to be taken, but never 19 Points.  I would give this game 91/100.",
            "review_score": "1"
        },
        {
            "review_text": "A very special game... Surprising and interesting.  First, the technic is horrible. The UI is not intuituve, the game doesn't scale to your screen nicely, ... It really looks like a 'first' game.  Second, the game is easy. Like very easy. As a point&amp;click game, you will have no trouble to find objects and mix them to solve the 'puzzles'. Don't expect any challenges.  So, why do I recommand this game ? The STORY. The story is really what makes this game so good. The game is about death, suicide, life, solitude, ... Not easy right ? But the cat lady story is subtle, intense, interesting, mature. It will make you think about your life, some of your friends or familly.  So the cat lady is a game you will play for the story, as an interactive novel or something like that. Definitively an experience.",
            "review_score": "1"
        },
        {
            "review_text": "Really fantastic game. The story, music, and art are all phenomenal. Worth its price for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I know that often people will say that you have to go from beginning to end before you can judge something; however, I believe that mostly applies when you plan to give great praise to something. However, after 4 chapters of Cat Lady, it's obvious that it does not merit great praise because, no matter how great the ending might be, the middle is so poorly written that, much like its suicidal protagonist, nothing could save it.  Chapter 1 does a great job by first pulling in the audience with impeccable pacing, score, and cinematography. Although the narrative is weak; dialogue is used sparingly enough to allow for the other pieces to be at the foreground of the gaming experience.  Chapter 2, things change. The visual and auditorial aspects of the game get pushed aside to make way for the disinteresting, uncomplex, and seemingly endless dialogue. With narration coming to the foreground, the game shifts from a pleasurable experience to a very tedious one filled with boring conversations for any audience member whose spent more than a few seconds thinking about life, whatsoever.  Chapter 3 puts further emphasis on the narrative and, once again, to the detriment of the game. Character development is stereotypical and the narrative is contorted, at times, just to keep the story going in a particular direction. For example, although we saw the character go through some emotional breakthroughs in the previous chapters, she somehow instantly slips back into severe depression over the most miniscule of inconveniences. In Chapter 3, she has a complete emotional breakdown which escalates into suicidal thoughts. What for? Bad coffee, a burnt meal, and criticism from her neighbor for deciding to play the piano at 2am in the morning... That's all it takes, apparently. So, despite any judgements regarding the protagonists emotional realism, she just comes across as immature, inconsiderate, and selfish. And I have a hard time sympathizing with that...  Chapter 4. The protagonist continues to complain with same incoherent thoughts and the game basically goes nowhere.   So, all in all, is this game a good game? Well, in my opinion, after 4 chapters played, it's a complete disaster as far as writing is concerned.",
            "review_score": "-1"
        },
        {
            "review_text": "The bar is set pretty low if this is considered one of the best adventure games of the past 5 years. The writer and voice director bit off more than they could chew, aiming for a sophistication and intelligence in storyline and dialogue that they may not have the skill to reach. Credit for the attempt, but it wasn't a success. Speaking of voice acting, you could tell that most of these were done by devs or friends of devs, really giving their best effort. But it was clear right away they weren't hiring professional voice actors, save for a few semi-pro actors giving middling performances at best. In a story not well-served by the art, they really needed to nail the voice-acting at least. But so many of the performances were ham-fisted and unnatural. Just seems like a well-done amateur effort, through-out. Not a professional one.  Edit: To be clear, btw, regarding storyline and dialogue, the game aimed for greater heights than most videogames, so credit for trying something most couldn't achieve, though it still missed the mark. The faults in writing were more on the end of the amateur dialogue, which wasn't helped by even more amateur performances. Games CAN shoot high and actually hit this mark, though it's rare. Telltale's Season 1 of TWD is one example, as is their TWAU. This one doesn't come close, though. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "This is interactive fiction for clinically depressed teenagers and the occasional nu-metal soundtrack hints to the real demographics of this game.  There's not much of an adventure game, the mechanics and UI are quite basic and so are the few puzzles. The storyline that should in theory hold this up is, while captivating for a couple of chapters, gets quite cliché and silly towards the end. It's a story that would very much like you to think it has a deeper meaning, but comes out as quite banal reflections on regret and redemtion.  I would have loved it if it went further in it's narrative concept, but as it is we are left with a brooding protagonist without much at all to say.  From the glowing reviews here, I had expected more.",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried to like this game, I was expecting a really good indie horror/psyche study experience. I know it's more of an interactive novel than a game, so I won't really mention any of the gameplay other than the fact that it sometimes is clunky and that can detract heavily from the game. It's not very well optimized. Other than that, the game does what it is supposed to do very well, which is give you a solid mindset from the point of veiw of a depressed 40-something woman. The main character and her writing are very well done, and the rest of the story reflects that. The only problem with the spectacular writing for story and the main character is that it really points out the flaws and lackluster writing/voice acting in every other character. It really seems like all the characters are secondary thoughts, plot devices to only move the story further. Other than that, it's just a slow moving bummer. The story, like I said, does what it sets out to do very well, which is to show a clear and accurate look at depression. The story moves slow enough that it feels like time is meaningless because you will always have to deal with the troubles in the game. I opted to kill myself (by stopping playing the game) early, so I honestly can't say whether I know if the ending is better than the story and pacing. I can appreciate art, but theater of pain can only hold me for so long, and this game tried to hold me for longer than it was worth.",
            "review_score": "-1"
        },
        {
            "review_text": "To be fair, I have only started it, so I can only speak for the beginning, but if the beginning is anything like the rest of the game, it is slow, it is really slow and it doesn't feel as though it is rewarding when you do things, I spent 10 minutes and the game really hasn't grabbed me so I have sopped playing it, I really wouldn't reccomend :/",
            "review_score": "-1"
        },
        {
            "review_text": "Very creative concept with excellent voice acting and atmosphere. Many will like it for that artistic value alone. I did.  But on the gameplay side, the 2D view and the really simplistic controls just made the game too boring for me. There didn't seem to be any skill involved except for deductions involving the use of objects collected in the scenes. It was just too boring and linear for me. I put it down after just a short time so maybe it gets better later, but who cares? The game play was bad and that interrupted the pacing of an otherwise very interesting and original story. I leave it to others who have more patience, no thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "The Visuals are great, the music is fantastic, but the story and pacing are off. I found the main character had 2 speeds : 'Rage' and 'Eeyore'.  When the protagonist DID behave amicably it seemed contrived. I felt like I had to 'get through' the game, but there are enjoyable parts.  I would really like to reccomend The Cat Lady but I can't say the experience was 'finished'. There were fun parts but they did not outweigh the long winded monologues that had to restate their (non essetial) opinions several ways. Synoyms are great but hearing the same story 7 times with different words is not 'convincing' it's annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "Partway through the second chapter the game froze and I had to reset. It was at that point that I discovered the lack of autosave. The main character moves far too slowly for me to have enough motivation to play through chapter one again.",
            "review_score": "-1"
        },
        {
            "review_text": "played twice. on linux. every time i agree to deal with the parasites, the game dies :/",
            "review_score": "-1"
        },
        {
            "review_text": "It was fun to watch someone stream, but the steam version needs serious work. It defaults to something like 800x600 fullscreen. Meaning your entire desktop will be shrunk and shoved into a corner, making you put all your windows back in place when you're done. Why something with such a microscopic resultion isn't windowed by default is beyond me. And looking at the discussions tells me that this isn't the only issue. The steam version of this game is apparently worthless. Go buy the original nonsteam version instead.",
            "review_score": "-1"
        },
        {
            "review_text": "What seemed to be a great story got crumbled by subpar voice acting and boring dialoge that leaves the player in a state of depression.   As you start the game you get a brief summary about the main protagonist's life 'Susan Ashworth' who is basically a depressed woman for unkown reasons, yes nothing is explained as to why she is depressed. It's just happened to be and you as a player should accept it. That's all well and good. As you apparently 'Die' you get sent to a realm that is between 'Life and Death' and you get to meet an Old Lady living alone in the woods. Here is where your NIGHTMARE begins. No I don't mean Susan's nightmare, I mean YOURS. you will be stuck in a 12-15 minutes boring ♥♥♥ dialoge that could have been toned down to 2-3 minutes. Susan and the Old lady keep going and arguing about points that are irrelevant to the story. 'You must do this!', ' But I can't!!!' 'But you must!!!', 'I am willing to! But that's not me!' Over and over and over they keep talking about the same point until you get literally depressed. And the voice acting is subpar at best. The old lady and Susan talk in the same ♥♥♥♥♥♥♥ monotone wavelength of sound that after a few minutes gets ♥♥♥♥♥♥♥ ♥♥♥♥ing boring.  The controls : Another downside to the game. You are stuck with the keyboard's arrow keys. Yes no mouse. Just arrows and other keys. Why didn't they make it that you move with the WASD keys!? Who the ♥♥♥♥ uses arrows for movement!?  The Resolution : You are stuck at 800x600 resolution 4:3. apparently you can stretch it to fit your 16:9 monitor but you will still be stuck with two giant black D**KS to the sides of your screen mocking you through your gameplay.  Final Recommendation : If you can get past all those faults in the game, you will probably be left with an above average story. But other than that. No, don't try and don't buy this game. There are others in it's genre that are worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "I have never said anything negative about any game purchace I've made on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game! It is a total waste of money. The gameplay is terrible and I wish I could get my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really bad, don't bother.",
            "review_score": "-1"
        }
    ]
}