{
    "app_id": 253370,
    "name": "Axis Game Factory's AGFPRO v3",
    "release_date": "2013-11-19",
    "developer": [
        "Axis Game Factory LLC"
    ],
    "publisher": [
        "Axis Game Factory LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Includes level editor"
    ],
    "genres": [
        "Animation & Modeling",
        "Design & Illustration",
        "Education",
        "Software Training",
        "Utilities"
    ],
    "tags": [
        "Utilities",
        "Design & Illustration",
        "Software Training"
    ],
    "achievements": 0,
    "positive_ratings": 233,
    "negative_ratings": 128,
    "price": 7.19,
    "description": "Axis Game Factory’s AGFPRO v3.0 – for PC, MAC and LINUXWe just released version 3.0 of AGFPRO &amp; Premium - there are a TON of new features, assets and functionality that have been added, giving users the ability to create amazing game levels and maps like NEVER BEFORE!!Major features to AGFPRO 3.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/253370/header.jpg?t=1539644374",
    "minimum_requirements": "OS: Windows XP SP2 or better Processor: Intel Core 2 Due / AMD Athlon x2 or better Memory: 2 GB RAM Graphics: Nvidia Gefore 6600 / ATI Radeon X800 (shader model 2.0+) or better DirectX: Version 9.0c Storage: 700 MB available space Sound Card: N/A Additional Notes: On 64 bit machines the following must be installed Microsoft Visual C++ Redist (64)",
    "recommended_requirements": "OS: Windows 7 or better Processor: Intel Core 2 Quad / AMD Phenom 2 x4 or better Memory: 4 GB RAM Graphics: Nvidia Geforce 470GTX Titan / ATI Radeon 5850 or better DirectX: Version 11 Storage: 700 MB available space Sound Card: N/A Additional Notes: On 64 bit machines the following must be installed Microsoft Visual C++ Redist (64)",
    "reviews": [
        {
            "review_text": "Software is great! Love how easy it is to use! It's more of a Unity map maker than anything else though. And the Zombie DLC, sadly, can't be sold for commercial purposes. Either way, I simply love this software!",
            "review_score": "1"
        },
        {
            "review_text": "Great Product. I got the 15$ version, and I just use it for fun.   Pros: -Very easy to learn, PLUS the developer has plenty of helpful tutorials on youtube as well. Also, customer service is great and if you're having any difficulty with anything, you will get a response quickly. -Graphics look great on my PC -Alot of objects/materials/vegetation come with 15$ version, and if you want more I've seen the developer post more asset packs on the forums -I had no problems setting it up on my PC -Inexpensive (I got the 15$ version since I'm not a developer)  Cons: -Seems to be missing some minor features (testing the game if FPS or adventure mode is limited), but the devs have promised to release more content/features in the future.  Overall, I would highly recommend the product if you find this kind of stuff interesting. Try the demo out for yourself, and make sure to check out the tutorial videos if you decide to try the demo. They are easy and will help alot!",
            "review_score": "1"
        },
        {
            "review_text": "To be honest this is only useful for creating maps and even though it may be useful for maps you can make better maps on unity than this. It is missing alot of things which is another downside to this if you to make a game don't start with this there is no free limits this is all looks and everything has its boundries. You cannot Make Custom Characters, 3D Models, Custom Sounds or weapon this is just unacceptable this software has alot more potential to it. As a consumer I would rate this 6/10. Would not reccoment this!",
            "review_score": "-1"
        },
        {
            "review_text": "OK so first off, know that it is NOT a game engine. you can NOT make a stand-alone game. I honestly can say that Axis Game Factory is kind of a mis-leading name, because this is a Map/Level/Enviroment Maker. It'd be better if it was called Axis Enviroment Factory or something along those lines. Other than the name though, I don't understand people who paid for this, not realizing it's only a map maker, then downvoting it.  If I am going to pay $20-$110 for software, I am going to do research about it. I knew going into this that is was just a map maker, and I didn't read the reviews, I visited Axis' website and read about all it's features. So if you feel cheated or scammed, maybe do more research. I honestly think a dev should not have to put NOT A GAME ENGINE in big bold print. It seems like they have on the steam page though.  Anyway to the software. As I said it's a Map, Enviroment, Level, Terrain, whatever terminology you'd prefer, maker. It's good for beginners in 3D map making like me. I dabbled in top down RPGs and hand made my graphics with ms paint. It took forever. I downloaded Unity and found it difficult to make Terrains or textures. With Axis, I can make Terrains with ease, then transport them to Untiy4. You need UnityPro in order to move things from Unity to Axis though which sucks but it really doesn't affect me.  I just wanted Axis for the terrain, and I am not dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "Axis Game Factory is a great peice of software. In terms of terrain editing, it is absolutely brilliant. It is cheap, and the quality of the models included could be only bought on the Unity Asset Store for twice the price. Yes, the name is a tad misleading, it's not a 'factory' as you don;t make standalone games with it, but I feel it is meant to be used with other game making tools such as Unity (which by the way is free) to create a very good game. The in-built players such as the FPS player or the RPG player are EXTREMELY helpful, as you can visualize how your terrain will look in your game without having to spend time programming your game. The players are extremely smooth and function very well, as does the rest of the program. The customer support is very helpful, and has helped me solve numerous problems. The only downside I would say is that the UI is a little tricky to use, but once you get the hang of the keyboard shortcuts and watch a few tutorials you will be creating gorgeous terrains in no time.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent tool for rapid landscape creation in Unity with little to no 3D modeling experience required. Highly recommended for those interested in Unity development!",
            "review_score": "1"
        },
        {
            "review_text": "Axis Game Factory is one of the best pieces of software I have ever used! Why spend the time in Unity trying to create an amazing map, when you can use Axis to do it for you, with it's on the fly editing and amazing editor, you can create a level in uder 5 min, without the hassel of doing it with Unity. I highly recomend this to anyone who is developing with Unity. It saves time, and very Powerful! Matt McDonald was very kind to help me resolve my problems, he contacted me on skype, and we went though everything step by step. If you have any problems, the Devs are very happy to help you resolve them.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great stand alone replacement for Unity's terrain editing tool. It's fast with a slight learning curve, but once you get how the grid system works, it becomes more intuitive. The support for AGF is vigilant! I posted an issue in the forum on steam and was skyping with the owner within minutes. New update was released that solved the problem and now the import into Unity 5.1 is flawless.  One cool thing to note is that it is possible to do the heavy lifting of terrain editing in AGF, and then still edit it once in Unity if you need to move prefabs around once you start designing your game.",
            "review_score": "1"
        },
        {
            "review_text": "Great for Unity users!",
            "review_score": "1"
        },
        {
            "review_text": "Plagued with constant freezing and crashing. Not worth it. The only reason I bought this was because it was in the Humble Bundle I purchased.",
            "review_score": "-1"
        },
        {
            "review_text": "Axis Game Factory's AGFPRO v2 is actually very very awesome to use and fun. Me and a couple of my friends bought this recently and Join into one session so we can all build stuff up together. there are many obects to use and tons of stuff to keep yourself busy!  I do recommend to give this software a try :D ENJOY!",
            "review_score": "1"
        },
        {
            "review_text": "Loving this software and learning more and more every day. Went back to view the tutorials a few times to take notes, and was fortunate enough to get a one on one breakdown with the creator himself while he had some downtime. I am currently working on a game with Zombie DLC now, and have also purchased the Fantasy Side Scroller, FPS, ARPG, Platformer, and the new Geovox is a very nice addition all in which are universal with one another with the compatibility. Great software, great support, win-win!",
            "review_score": "1"
        },
        {
            "review_text": "So AGF got back to me so fast that I think that I owe them a apology and a thumbs up its the least I can do so I am sorry.   AGF is good people I do recommend this software.",
            "review_score": "1"
        },
        {
            "review_text": "With this you can make a good looking game in 10 min or less",
            "review_score": "1"
        },
        {
            "review_text": "Nice enough program, but I've had far too many MAJOR issues to give this a good review. The platformer character controls like crap, for starters. Very annoying to work with. Additionally, more often than not, the program will randomly turn off assets when I reload a scene. With this, it deletes ANYTHING in the scene that were associated with the deactivated asset bundles. Turning them back on does nothing, either, as they are completely deleted. Too many levels that were almost completely deleted due to this. I do not recommend this game based on all of this.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing makes great games though I wish there was an inv and health bar but you can add that in unity   9/10",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best purchases in my life. I am currently new to Unity3d/game development in general and I was really disliking the terrain editing that was built in. I was searching around for everything, I even checked out Terrain Composer etc but nothing really felt ... to grasp what I was wanting to make for my game's environment. I saw AGF, and it just pretty much clicked in my head. This is it. I bought it, the big shibang. So many assets, an easy to use tool set, and my god, the voxel sculpt dlc is amazing. You can create large environments with this. Like Skyrim large, and create it with ease. The ONLY thing I can say that needs work, is the importing of other assets you can export from Unity, or if its already in a Unity package format. Other than that, beautiful work Matt!",
            "review_score": "1"
        },
        {
            "review_text": "I happend to find and purchase this today from the Bundle Stars bundle and all I can say is that I'm impressed. I've got zero experience with game development and I'm not really looking to use this as a tool to do anything extensive. My main reason for buying this was for my tabletop gaming group. I think what you guys have with battlemat is understated. I think that it's a gold mine waiting to explode, with the dawn of online gaming on websites like Roll20 and other forums/websites like them.... Battlemat shines and I look forward to using it with my crew. At 10 dollars it's an invest that will keep giving back.  I hope in the future you guys release new miniature sets or hope to expand on Battlemat heavily because I think it's a winner.",
            "review_score": "1"
        },
        {
            "review_text": "A Great software.  I'm quite new to game development, and this is a great product that teaches the basics of game development and really convienient. It's well documented on the website with a few video tutorials to get you started. It has a lot of presets that you can use to create your game!",
            "review_score": "1"
        },
        {
            "review_text": "I Cannot praise this software enough, if you have ever wanted to design a game but don't have the relevent coding skills Agf pro is for you. you can drag &amp; drop enviroments into the level editor to make your own unique take on whatever game you want to design. &amp; if you get stuck Matt &amp; Tammy Macdonald who created this software will help you out they are always about on the forums &amp; deserve your support i wish all game devs were this supportive. 5* software from awesome game devs.",
            "review_score": "1"
        },
        {
            "review_text": "Horrible controls, next to no help or tutorials/guides out there. If you're a beginner, don't waste your money, even if it's on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "it's a good game making software i am having lots of fun making games for me and my friends with it and when my game broke the person who helped me was nice and very helpful overall i think this game dev. software is worth it",
            "review_score": "1"
        },
        {
            "review_text": "Really nice toolkit !  I still can't use Unity 5, Matt solved the issue in minutes pointing me to the v2 loader that works with Unity 4 by the way, the Scene Loader from the v2 can flawlessy load levels made with AGF 3 !",
            "review_score": "1"
        },
        {
            "review_text": "Anyone looking to get into game development should definetly try AGF. I really enjoyed using the terrain editor and the construction mode to make my own unique maps. Also, the abundance of DLC allows you to make everything from zombie to first person shooter games. This is the perfect piece of software to get into game development.",
            "review_score": "1"
        },
        {
            "review_text": "a pile of ♥♥♥♥♥. would rather use mspaint",
            "review_score": "-1"
        },
        {
            "review_text": "Did not get the dlc stuff when i downloaded it please fix this",
            "review_score": "1"
        },
        {
            "review_text": "A useful tool for beginner game developers.",
            "review_score": "1"
        }
    ]
}