{
    "app_id": 253350,
    "name": "Tiny Barbarian DX",
    "release_date": "2013-12-03",
    "developer": [
        "StarQuail Games"
    ],
    "publisher": [
        "Nicalis, Inc"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Local Multi-Player",
        "Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Platformer"
    ],
    "achievements": 53,
    "positive_ratings": 172,
    "negative_ratings": 31,
    "price": 22.99,
    "description": "Steel yourself for a relentless display of might and muscle…brawn and bravery…magic and mayhem! Inspired by heroic fantasy fiction, Tiny Barbarian DX combines engaging 2D platform action and combo-based hack-and-slash combat with retro-style pixel art and a loincloth-stirring chiptune soundtrack.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/253350/header.jpg?t=1508696081",
    "minimum_requirements": "OS: Windows XP Processor: Dual-core processor (Intel Dual Core 2.0 GHz or AMD Athlon X2 5200+ 2.6 GHz) Memory: 1 GB RAM Graphics: OpenGL 3 Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Tiny Barbarian is an indie gem. The gameplay is hard enough to be challenging and engaging enough to keep you playing until the end!  The music is top notch and the art direction really help make this game stand out.  I have put a good 7-10 hours into this game before it made it onto Steam.  I would recommend this game to anyone/everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Somewhere in a desert wasteland, a tiny barbarian hangs crudely nailed to a tree. He contemplates the shifting of the sands, the hungry gleam in vultures' eyes, and the sweet brutal revenge he must take. Break free in as dramatic a way as possible! Your adventure begins!  Within 15 seconds of playing, you'll have savaged the local wildlife, defiled ancient ruins, and most likely ♥♥♥♥♥♥ off about a dozen evil warlocks just by being alive. A few steps later you'll already be discovering secrets as you bash through cracking rocks to uncover coins, gems, and... meat! Collect treasure for score, and replenish health by eating strange meats you find hidden in crevices, or even just laying on the ground! Fearsome barbarians eat whatever they want!  Battle wizards and their beastly minions! Punch rocks until they turn into diamonds! Hack away at vicious armored soldiers intent on slaying you and taking away your totally sweet loincloth! Discover wondrous and deadly ancient mechanisms! Tame ferocious beasts! Flex your guns and pecs indiscriminately! Dangle from chains 1-handed like a true badass! Handle explosives with little to no care whatsoever! Dodge snake-based traps, the most fiendish kind of traps known to man! Experience love, lust, and loss! Followed by triumph! Possibly followed by even more lust, the most important emotion!  All this excitement (And more! So much more!...eventually!) is packed into an experience just under 2 hours long, with 3 more adventures (episodes) to follow once they're finished and released by the developer. All future episodes will be available to you for free by buying this game (Episode 1), with the second coming very soon as of the time of this review (and I use the term 'review' loosely!).  If you can't wait that long because you're an impatient prick or have Restless Gamer-Finger Syndrome, this game includes an endless Horde Mode that strands you atop of a pyramid and pits you against an endless army of goblins, skeleton archers, and trolls! (Or possibly very large hairy barbarians, I can't tell, but they bleed all the same!) You might rage at the constant potshots the archers take, I find myself losing most of my health to them, but YMMV.  Enemy variety is alright, we'll probably see different enemies in the upcoming episodes. I'm more annoyed that there aren't that many enemies hanging out in the main game's levels. However, the ones that are there are strategically placed for a challenge, and Horde Mode has all the mobbing you could want.  Enough combat moves are available to keep you alive, but face it, all you really need is that badass Elbow Drop! Snake getting grabby? Elbow Drop! Need to deflect a barrage of arrows? Elbow Drop! Vulture trying to eat you? ELBOW DROP IT OUT OF THE SKYYYY!!!  The other moves are your basic slash attack, a useful 3-hit combo that sends enemies flying, an overhead swing useful for crowd control and deflecting arrows, and a midair spinning attack that multihits (I find it hard to pull off, the timing is weird). Check the Steam Community Discussion page for more info on the attacks. The main game is easy enough to play through with just the basic attack and occasional 3-hit combo, the extra moves are more for Horde Mode survival.  What else, what else... oh right, buy this game! The music fits the bill, the levels are well designed so they aren't monotonous, secrets aren't terribly hard to find thanks to the level design 'hinting' at them, boss fights are entertaining, there are nekkid ladies, and that's about it. It's a simple and fun game that I'm sure is far from simple and fun to make, so throw your money at the developer so he can crank out those other Episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Nifty little homage to old Castlevania/Goldenaxe/Sonic 2 era games (and those are the ones i recognized it cribbing from). Only has two levels right now, but they're both about an hour long, minimum. It's also extremely generous with checkpoints, and dying only sets you at the start of the current room.  That said, the ledge/chain/vine grabbing control is a bit jank to do on a 360 pad.  PS. ♥♥♥♥ Castlevania Birds.",
            "review_score": "1"
        },
        {
            "review_text": "Simple story, simple gameplay mechanics, but fairly hard game. I had some trouble at certain points on certain stages, but overall the game is pretty solid. Nothing too special, but solid. Best thing I can say is that it's sweet and short. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic platformer. I dare say I haven't had this much fun with a platformer since I was a kid.",
            "review_score": "1"
        },
        {
            "review_text": "Being a huge fan of Conan stories, 'Tiny Barbarian' is a game I really wanted to like.  What immediately captured me was the art style, the soundtrack and the varied level design. And then it all fell apart...  As soon as the first enemies came, I slowly but surely came to detest the game. The combat mechanics always felt somewhat off, like I was never in total control. I would jump over that thrown spear and slash that guard, but then the next time I'd get hit, and I wouldn't know exactly why. Often times I felt the hitboxes were unfair. The bit that did it for me were the infinitely spawning enemies. Where the already extremely dissatisfying combat became even more so, and I gave up.  I really like the theme, so maybe I'll give a go sometime in the future, but for now I'll stay away from it.",
            "review_score": "-1"
        },
        {
            "review_text": "You get to hit stuff... with a sword.",
            "review_score": "1"
        },
        {
            "review_text": "It's a real shame that I have to not recommend this considering that it's got a great first episode and has solid game play, good music and graphics. At the time of writting this, there are only 2 episodes out and because of how different they are from each other, I will review them separately.   Episode 1: The game begins with a very familiar and simple play style, small weak enemies come in low numbers and attempt to hit you. You can make quick work of them though. As you progress through the level, more difficult enemies are added and more challenging environments are present. There is even a few areas where you get to ride a beast like thing, it's pretty fun. Numerous well designed boss fights are included. Although it really starts to ramp up the difficulty at the later areas of the level, the game never feels unfair and with frequent checkpoints and 6 hits for a life bar, the difficulty is just right. More of this would be excellent. The final boss in this episode is pretty tough but reasonable enough. Although this episode is short, it's great and it got me really excited for more episodes. It really did impress me. If I had to give it a score, I'd give it a 9/10  Episode 2: And than suddenly the game does a complete 180, changing everything about the design that made the first episode so good. At first, it's a slow paced platformer with very few enemies. In fact there aren't many enemies at all in this episode, at least ones that give points and are stationed through the level. As you progress through this level, you will face more difficult platforming sections, most of which will either send you to the beginning via vertical drops or instantly kill you through large areas of pitfalls.   This episode also features riding an animal, this time it's a bee. This creature does not like to cooperate though. If you fall off, it will fly around you avoiding you as much as possible, though it stays roughly in the same area that you lost it. This can make it a huge pain just trying to progress through those areas as one hit will send you flying off the bee. Later on you have to use the bee in automatic screen scrolling sections where flight is mandatory. It's a mini bullet hell out of no where and the short range attack and instant kill from falling off the edge of the scrolling screen makes it infuriating. Oh and I forgot to mention that despite some bees being somewhat friendly, all the others will try to kill you and they spawn infinitely at the sides of the screen while you try to fly tightly crowded areas of spikes.   The only other main enemy in this level are apes, these guys are very annoying. When in high numbers, these pests can cause a lot of trouble. They jump around the room and throw what I hope to be rocks at you. These rocks are high speed and perfectly accurate, if thrown while you are in mid-air, they are almost guarenteed to hit. There is also a giant ape boss, which is very difficult. Ironically enough, it captures a blonde and throws barrels at you. Sound familiar? It should. A reference to one of the most iconic and classic games of all time, Donkey Kong. Only this is no easy breeze jumping over simple barrel trajectories. These barrels bounce all over the place with high speed and they're the same size as the player. Incredibly challenging and will take you many tries to overcome, if you have the patience.   After all that the level is still not complete, well over an hour now and you still have to keep going. The last sections I played were consistently frustrating. The auto scrolling of the screen which moved way too fast for me to keep up, killed me mercilessly. Not to mention the huge number of projectiles that fly at you. There is a lot of grabbing vines and ceilings reminiscent of some Shinobi levels, only the grabbing controls don't work all that well here. I died at least 30% of the time from the character refusing to grab a ledge or vine only to fall to my death. All of this combined created an experience that was punishing and sadistic. I'd have to enjoy the pain to finish this level. I did not.  Conclusion: So to conclude these reviews, I'd say that the game has great potential. The first episode being a shining example of great game design, while the second episode takes all the worse elements of older platformers and throws them all at you at the same time. This leaves me very conflicted as to what I should rate the game as a whole. I also cannot understand the massive shift in design here. The first episode featured almost no instant death or pitfalls, while the second episode is full of it. The game goes from fun and fair to brutal and painful in a flash. It's a true shame to see yet another retro throw-back desperate to relive the 'glory' days of punishing quarter-devouring arcade games instead of improving on any of it.   In the end I do not recommend this game as I can't see the next episodes going in a better direction. Odds are they'll continue trying to make it harder and more brutal as they release the other episodes. It's not really worth the time and frustration for the average gamer. This is only for true hardcore platformer fans.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "Oh God, just a hour in and i allready really love this Game so much! Beautiful, charming Pixelgraphics but unlike others it doesn`t just look oldshool it plays that way. It gets pretty hard fast but stays fair, it has no tutorials you learn the simple although deep mechanics just trough playing, with the Bombboss for example...  Can't wait to finish this and then for the other Episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Tiny Barbarian DX is a very good game, but not quite a great one. Admittedly, only two episodes have been made available at the time of writing, but having played them to near completion I think I have a pretty good feel for how the rest of it is going to go as well.  As a gaming experience, Tiny Barbarian doesn't put a foot wrong. The controls are simple to learn, a combo move keeps things interesting, and if you really want to you can flex your muscles in the middle of a life-or-death fight. The monsters are distinctive and challenging. The graphics and music design are pure retro 8-bit goodness (barring a couple of small anachronisms, like the floating Z's of the sleeping Barbarian). The checkpoints provide a way around the outdated lives system without taking away the sense of challenge or urgency, at least if you're aiming for a fast run or a no-death run.  The thing is, there's a difference between a great game and a game that doesn't make any mistakes. For all the skill and care that went into the game and its presentation, the whole experience still feels inescapably...familiar. You aren't really going to see anything here that you wouldn't have in some other 8-bit platformer, or platformer in general. There's no real experimentation, no high concept, nothing more than a token attempt at narrative, and the Conan-inspired aesthetic is there as window dressing rather than as a means of informing gameplay. These things may change with subsequent episodes, but personally I don't really see the developer deviating from a structure which has served the project well so far.  None of this is to say that Tiny Barbarian is a bad game - and I do recommend this game, because as an exercise in legitimate challenge it really is worth your time. It just feels light, even unnecessary - a throwback in an era which has already moved on. Braid has more interesting gameplay; Redder has more atmosphere; Fez looks better; Super Meat Boy is more exciting. This wouldn't be a fair comparison if Tiny Barbarian really were a retro game, but it isn't - it's an imitation of retro games, and ultimately it doesn't feel like anything more than an imitation.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and challenging. It's been a while since I played a good side-scroller game. Died so many times but honestly, if you play the game without dying, you werent challenged. This game really make you feel like a badass barbarian. Can't wait for the future releases. Congrats guys on making a good game, this game is on my top 5.",
            "review_score": "1"
        },
        {
            "review_text": "omg addictive.",
            "review_score": "1"
        },
        {
            "review_text": "heavy influenced by 90s-Oldschool-Castlevania-Megaman-Metroid-NinjaGaiden-etc-Styles! + awesome chiptunes!",
            "review_score": "1"
        },
        {
            "review_text": "What is best in life?  CRUSH YOUR ENEMIES. SEE THEM DRIVEN BEFORE YOU. HEAR THE LAMENTATION OF THE WOMEN.  You, dear Steam user, are browsing greatness. Your mouse cursor hovers, wondering if this Tiny little game is worth your time, worth your Tiny amount of money.  Is it worth your money to flex your Tiny muscles and save the princess? Is it worth your money to battle a wizard, and to prove your sword can best sorcery? Is it worth your money to battle endless hordes of enemies, and crush them?! Is it worth your money to break a vulture's neck with only your mouth?! Is it worth your money to ELBOW DROP BOMB THROWING DEMONS?!  Yes, yes it is.  Tiny Barbarian DX is a side-scrolling platformer with a well-known plot: save the princess from the evil magician. But you are not a young elf. Kromm laughs at the young elf! Our hero, the Tiny Barbarian, sword chops, elbow drops, and belly flops into waves of enemies and platforming gold. He climbs, he does spinning sword attacks, precision and brute force are wrapped up in one Tiny, explosive package.  You will experience a platforming adventure like never before. Decimate the guards that try to stop you from entering the lair of the evil magician! Elbow drop the vile snakes that try to bite you! Ride a giant cat through the palace courtyard and behead your enemies! Collect the gold coins scattered throughout the palace! ...Can YOU find all the hidden diamonds?  All the while, you will be serenaded by retro chiptunes made by Jeff Ball, the same Jeff Ball that has worked on such projects as the Mass Effect series, Red Orchestra, Monkey Island 2, and many others. The musical talent in this game is top-notch, and the sheer professionalism and quality of it pleases Kromm.  Reader, I have never written a review before. I have no tongue for it. No one, not even you, will remember if it was good or bad. Why I wrote or why you read. No, ALL THAT MATTERS IS THAT YOU STOOD AGAINST MANY. THAT'S WHAT IMPORTANT. BATTLE PLEASES KROMM. SO GRANT ME ONE REQUEST. GRANT YOURSELF REVENGE. AND IF YOU DO NOT LISTEN, THEN THE HELL WITH YOU.  ENOUGH TALK.  BUY THIS GAME.",
            "review_score": "1"
        }
    ]
}