{
    "app_id": 253430,
    "name": "CastleMiner Z",
    "release_date": "2014-02-03",
    "developer": [
        "DigitalDNA Games LLC"
    ],
    "publisher": [
        "DigitalDNA Games LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Steam Achievements"
    ],
    "genres": [
        "Violent",
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Survival",
        "Multiplayer",
        "Zombies"
    ],
    "achievements": 31,
    "positive_ratings": 4478,
    "negative_ratings": 1831,
    "price": 2.79,
    "description": "CastleMiner Z is an infinite world filled with deep places to explore, and horrifying monsters to slay. Build structures out of blocks, craft weapons and tools from raw materials, and explore the vast and frightening world around you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/253430/header.jpg?t=1509052644",
    "minimum_requirements": "OS: Windows 8, 7 , Vista, XP Processor: 2.8 GHZ Dual Core Memory: 1 GB RAM Graphics: DirectX 9.0c or better with 500 mb memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 100 MB available space Sound Card: Direct X Compatible",
    "recommended_requirements": "OS: Windows 8, 7 Processor: 3.0 ghz Quad Core or Better Memory: 8 GB RAM Graphics: DirectX 9.0c or better with 1 GB memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 100 MB available space Sound Card: Direct X Compatible",
    "reviews": [
        {
            "review_text": "Such a shame. Graphics are nice, (except for the amount of dust while mining obscuring the block you're aiming at). Nice, dark feel. A promising crafting system and potential for so much more. Unfortunately, as far a I can tell, nothing of any significance had happened since last May.  It's almost as if the developers have released a half-finished project for sale and just cut and run with the money. Kickstarter projects and early release accesses require a certain element of trust.   To my mind, and I'm sorry for all the honourable, hard-working, independant developers out there, this has put me off funding/supporting projects-in-development for good. ",
            "review_score": "-1"
        },
        {
            "review_text": "Have no idea why this is being sold on Steam when you can go to thier webiste and download it for free.",
            "review_score": "1"
        },
        {
            "review_text": "This was my most worthless purchase ever. I played for 7min then I regreted that I bought it and wished that I would have bought a foot long sandwitch at subway instead. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Edit: I intended to play since the latest updates, but have not had the willpower to really solo it. At the time of my review the developer had moved over to working on the game Savage Lands.  It feels like ages since I purchased this on Xbox. I had built a road with my friends to the end of the world and generally enjoyed the gameplay.  Now it is on PC and it is almost exactly the same as it was on the 360 (with a few upgrades from patches I had missed).  Pros: +Fun in multiplayer +Decent gameplay mechanics +Cheap  Cons: -Graphics are decent for what it is, but not great. Block textures look better than minecraft, but the monsters look like they belong to the era of N64 -Playing alone is boring -Occasional bugs -The game is dead. The developer came back to post something along the lines of 'We won't abandon you', then went silent to this community while they work on The Savage Lands. If you buy this, never expect an update.  Over all, it isn't a terrible game. It was made the way it is for reasons, and it could in theory continue to evolve and get better since the move to PC, but it seems dead now. As the game it is, it works fine (for me at least) with the only drawback for me being that only one of my friends has it.",
            "review_score": "1"
        },
        {
            "review_text": "This game DEFFINATELY needs many updates...it's like early alpha state, enemies spawn randomly and spawnrape you, health system is weird(you get hit 1-3 times and you die, recovery to full health when not hit for like 3-5 seconds), needs MANY new items to craft like windows,fences and so on... And would be nice if they would add some new NPCs like animals and that, because if they tried to create minecraft clone, at least try to make it a GOOD one! Because right now it feels like total ripoff, i even read about the creator cencorship, that they remove all negative comments. Well, this isnt a negative comment, this is just a recommendation what should be tweaked in this game to make it better.",
            "review_score": "-1"
        },
        {
            "review_text": "great game, but you guys should add traps, turrets, more blocks, beds, tables, chairs, decorations stuff, staircases, slabs etc, what if we want to build a town ingame to defend from zombies? that'd be sick if it happens, and we need building to be a lot better, add stuff like i said 1-2 lines ago, and even more, up to you guys to decide, i hope my suggestion will be taken :)",
            "review_score": "1"
        },
        {
            "review_text": "waste of your money. flat out do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "It looks like a potato, but it's actually a pretty cool potato when you play it with friends. It's minecraft-ish, but it has its own way of doing things, namely guns, and running constantly from demons who basically instakill you if you let them.  10/10 would run from demons with friends in a potato block world again",
            "review_score": "1"
        },
        {
            "review_text": "Never been this close to suicide",
            "review_score": "-1"
        },
        {
            "review_text": "inspirational dragon fighting music and machine guns",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game. I love playing it with my friends just with the game they need to add to way to skip night time. We can only mine and not do much during night. And daytime seems to short and nightime seems to be to long, Please add like a bed or something. Thx. But besided that I love playing the game and it super fun make sure to get and get some friends to get it to. :)",
            "review_score": "1"
        },
        {
            "review_text": "  What even.",
            "review_score": "1"
        },
        {
            "review_text": "'Is that Satan?' 10/10 would kill Satan again",
            "review_score": "1"
        },
        {
            "review_text": "'Is that Satan?' 10/10 would kill Satan again",
            "review_score": "1"
        },
        {
            "review_text": "Might be fun with friends if you're just there to dig or do some usless ♥♥♥♥ randomness, and it is extremly un-user-friendly, nothing is easy to do ( not talking about 'surviving' I mean everything else)",
            "review_score": "-1"
        },
        {
            "review_text": "thats pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Its a minecraft clone except with guns and crappy quality and was filled with enemies that were THE EXACT SAME ONES AS IN MINECRAFT! Makes no sense why a dragon appears at night and is practically impossible to kill unless you have a bigger gun. But The worst Possible waste of my $2 in my life! could have bought something else! DO NOT BUY THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "I WONDER WHAT THIS GAME IS TRYING TO CASH IN ON he lied as he stared at the Minecraft clone that has dragons in it because might as well cash in on skyrim while your ripping off Minecraft.  This game is literally just an amazingly poorly made ripoff of Minecraft, except now it has 12 times the edgyness as it has guns. You walk around, kill some horrible looking zombies, get attacked by a dragon with some terrible AI, then mine some minerals and make some guns, build a crappy house, die, then spend 12 hours trying to find your crappy house again. If you want to play a Minecraft style game then buy bloody Minecraft, Its like 27 Dollars, If thats too much for you too pay and you want a cheap alternative, well this isn't it, start saving up those pennies of yours and buy Minecraft. Or alternatively, sell your computer and buy yourself some bloody food. Seriously Don't buy this If you buy this you probably shouldn't be aloud financial independence.  Just like me.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is pretty dank, nice after the update. Some would even compare to minecraft",
            "review_score": "1"
        },
        {
            "review_text": "Load into game, turn right, and see lightning. Then get a siezure. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty fun for awhile ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game but they should fix the sensetivity its really slow even all the way up but other than the this game is great",
            "review_score": "1"
        },
        {
            "review_text": "Went to hell and back, fought zombies, demons, dragons and aliens. Literally ♥♥♥♥ed Satan. Then we sang Amazing Grace, and blew up our house with RPG's.   10 out of ♥♥♥♥ing 10.",
            "review_score": "1"
        },
        {
            "review_text": "Sure. Why not?",
            "review_score": "1"
        },
        {
            "review_text": "This feels like something me and a few friends could whip up in Unity in like a week.",
            "review_score": "-1"
        },
        {
            "review_text": "its minecraft in high guility,i like it ,bulding methods are the same but ,one bad thing is,you don't eat,and you look like a police who lost he's way.",
            "review_score": "1"
        },
        {
            "review_text": " An instant classic in my book ! Miner, Crafter, First-person shooter. Make your own gear and battle ruthless mobs. Run as far as your free time will allow you to in and endless world. Several game modes and Hosting options. Go from digging dirt, to using a scoped rifles to shoot Dragons out of the sky. Multiplayer with optional PvP, even Team PVP, this game is among a unique rarity on Steam!   Voxel with stunning HD Textures and views 7 Biomes in a ringed pattern on an endless globe 7 Tiers of materials that you have to earn Best voxel game mobs because they're not voxel at all  Very smooth mechanics Controller support Aim accuracy Awesome sound FX Very cool soundtrack  Only complaints from me: using Ultra Distance View lags me Dust from mining/explosions lags me Game needs way more music Gets kinda glitchy after 20,000 distance Can't host a Dragon Endurance game using a Creation made map. When I do Host, I have to hire police to monitor players because I cannot 'Lock' the map (turn off mining).  Read my epic Castleminer Z tale   Path of the Compass   where I bravely travel further than  any  other player on record!! Current distance = 250,000",
            "review_score": "1"
        },
        {
            "review_text": "its ok.....Just a lil laggy so i refunded it",
            "review_score": "-1"
        },
        {
            "review_text": "cant even save my game their no tutorails on how soo not worth my time",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game in all its glory. I can't wait to see the new updates when they come out.",
            "review_score": "1"
        },
        {
            "review_text": "I would rather walk on 1000000 lego bricks than play this horrible,unfair and stupid game made from the depths of hell and everything bad in this world.",
            "review_score": "-1"
        },
        {
            "review_text": "Its really fun to play could use some better graphics but other wise it pretty fun but when you die your stuff despawns in a couple of seconds.",
            "review_score": "1"
        },
        {
            "review_text": "Its amazing and also if you go to about 3,500 blocks (upper right) with the compass pointing green up then you will find miners haven. its quite a trip. there you will find coal,copper,iron,gold,diamond,bloodstone etc etc! past that at about 40,000 i think note: THINK that there is this thing called 'Lantern Land' and its like really good or something, i dont know well i hope whoever views this finds this review helpful!",
            "review_score": "1"
        },
        {
            "review_text": "This game will make your wallet beg for it's money back it is horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pretty average game i don't see too much of a future in it its just not the kind of addicting game as all the others and just its not got enough in it",
            "review_score": "-1"
        },
        {
            "review_text": "It's a game to where if you're bored you can play with or without your friends. And have a crap ton of fun killing, exploring, building, killing eachother, heck even blowing things up.   Also it's freaking cheep.",
            "review_score": "1"
        },
        {
            "review_text": "This sucked so bad it hurt my eyes when i opened it.    0/100000000",
            "review_score": "-1"
        },
        {
            "review_text": "uhm, I came from the Xbox version of this game. The PC port is not what you will be expecting compared to the Xbox version.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Better port than Assasin's Creed Unity.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a waste of time and money. It is so confusing i couldn't do anything. Save 5$ and don't buy this game",
            "review_score": "1"
        },
        {
            "review_text": "i dont know why my game cant launch ",
            "review_score": "1"
        },
        {
            "review_text": "cmz is a gg for youtube",
            "review_score": "1"
        },
        {
            "review_text": "This game is great off and on console has alot to do!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun af. Remember playing this on my 360 back in high school.",
            "review_score": "1"
        },
        {
            "review_text": "Game is perfect but need some patchs maybe smoke effect is bad. I can't see breaking effect.  And stop annoying players. Every pixel game is not Minecraft and games not need good graphics.  If you want graphics why are you buying this game or why are you played mario ?   To the developers ;  Nice game but add some patch or effect patchs.  I think this game need ;  1-) Skins ? (Player Skin) 2-) in xbox360 version (normal game) we have nude (flesh-colored) arm and its very good. 3-) New guns for , pistols (maybe desert eagle, usp) , smgs (example ump) and other things. 4-) Workshop (players can modify or create mods for this game)",
            "review_score": "1"
        },
        {
            "review_text": "Spawned, -found a bunch of zombies -they kill me in 2 hits -they outrun me -I am desperate -tried once again -could not outrun them and hide -found some skeletons too -This game is garbage  -Don't waste your precious money, Minecraft is better.",
            "review_score": "-1"
        },
        {
            "review_text": "as of the time im getting this, this games worth money! its great, its free multiplayer hosting, me and my friend love it! its not a game you should play alone with, it can get lonely and the monsters arnt inviting, but this games worth some money! i like it!",
            "review_score": "1"
        },
        {
            "review_text": "Don't Do it. Resist the temptation. This is true shovelware, replete with bad design and shoddy sound. Watch the Total Biscuit WTF video on this game to get a good picture of in on youtube. 1/10- To be fair, just saw that a new patch was out today (yesterday really). I will update this after I try the new patch.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels very unfinished to me. Have had quite a few issues being able to play with friends. Would not recommend. If you want to play this go try Minecraft instead.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is awsome cause its got sp00ky skeletons init 10/10 would be sp00k3d again",
            "review_score": "1"
        },
        {
            "review_text": "Its a great time killer game. Enjoy the endless mining, building, and crafting. Plus zombies make everything better. Been playing this since it came out on xbox and followed it to here on the pc. Hope it contines to be just as fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything . . . Dragons from Skyrim, Guns from Counter Strike, Zombies from CoD, Devils from Hell, Blocks from Minecraft, Cheap price from Valve, Crafting from Last of Us, Death from Dark Souls 2, If this game had good graphics . . . MAYBE IT WOULD GET SOME GOOD REVIEIWS, CAUSE EVERYONE GIVES CRAPS ABOUT GRAPHICS AND NOT ABOUT GAMEPLAY . . . All the negative reviews are about Graphics 99.999% and maybe 0.001% are about etc . . . :D ",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, i know, i know, its cheap Minecraft clone... BUT, i think this is a pretty cool game.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game Twice and it never opened again, in the 2 times i played the game, it crashed...  10/10",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not sure if it is just my pc or if other people have been having problems like this but, everytime I load up the game, everything is invisable! The blocks, my gun, and everything! Even the monsters! Its very annoying, So please help! I shall not give my opinion of recommendation because I don't want hate comments if I do ( ͡° ͜ʖ ͡°). I had no choice anyway soooo",
            "review_score": "1"
        },
        {
            "review_text": "I will say this is a good game. The graphics aren't the best, but aren't the worst. The gameplay is almost too close to minecraft, but it makes up for it with the amount of exploration. The game has many types of the same weapons and also have many melee wepons for you, and it is multiplayer so it's not empty. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "i very much enjoyed the five minutes on the game getting the shiz out of me when i got jumped by a zombie",
            "review_score": "-1"
        },
        {
            "review_text": "like minecraft but with aids",
            "review_score": "-1"
        },
        {
            "review_text": "Please don't wate your money. This game is similar to minecraft but with guns and dragons and stuff. Sounds fun right? No!  The reason Minecraft is so great is its charm. Minecraft is a very nice looking game and this is just crap. The textures are bad, the crafting is confusing, and the game its self is just really frusterating.(not to metion bad.} If your attracted to this game because you like Minecraft, do yourself a favor, DON'T GET IT.",
            "review_score": "-1"
        },
        {
            "review_text": "i can honestly say this game was enjoyable, 9/10 would recommend to friend",
            "review_score": "1"
        },
        {
            "review_text": "Worst minecraft clone you have ever seen! :D HAVE FaqING FUN!",
            "review_score": "-1"
        },
        {
            "review_text": "Uninstall worked great!",
            "review_score": "1"
        },
        {
            "review_text": "when i click on it, it says this is already running? help! ",
            "review_score": "1"
        },
        {
            "review_text": "As you can see, a lot of the reviews are complaining about the similarities to Minecraft, i.e; crafting, survival, zombies, etc. However there are many games like Minecraft nowadays. Minecraft is no longer the only 'block building' game in town. With so many different games out there like Blockland, FortressCraft, Guncraft, and CastleMiner Z - it's easy for people to complain that each new iteration in the genre is a 'shameless cash grab'. CastleMiner Z might fall under that classification, but that doesn't mean it isn't a fun game. I have put a couple hours into this game and have had a good time. I would recommend it, especially since it is such a cheap game. It's not like you have much to lose.",
            "review_score": "1"
        },
        {
            "review_text": "When this game first came out to pc it was a very crappy game but I checked it out again and its alot better than it was 2 years ago on pc. The game was very fun on xbox alone or with friends but on pc its kinda only fun if you mp with people since I find it boring playing alone and theres no fun in that. The fact that this game has zombies, aliens, skeletons, and high quality weapon models it's pretty good. Now go pick this game up and game on with your friends and kill some ugly zombies!",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the xbox360 version but still pretty fun. Like how you don't have to buy other games to unlock gamemodes like on console.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game but very hard to play :/",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilariously bad. From terrible graphics to aweful mechanics to a bug-infested enviroment, this game is a travesty. This said, being hilariously bad, it is absolutely hilarious. It is a game that you and some friends can sit down and play for 5 hours and then never play again. The game is braindead easy, as you can bypass all conventional methods of mining by entering the Hell zone immediately and killing low health mobs for virtually unlimited resources. Also, if you back into a wall, you pass into it. You can do this to literally get absurd distances with no effort. The zombies jump incredible distances and will almost always end up behind you. To boot, they make you extremely slow when they touch you. Likelyhood is they give you cancer. 3/10, wouldn't play it again.",
            "review_score": "1"
        },
        {
            "review_text": "yeye  Top quality sounds Very good graphics Smooth gameplay Easy crafting system Hip and rad music  What the ♥♥♥♥ did you just ♥♥♥♥ing say about me, you little ♥♥♥♥♥? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I’m the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the ♥♥♥♥ out with precision the likes of which has never been seen before on this Earth, mark my ♥♥♥♥ing words. You think you can get away with saying that ♥♥♥♥ to me over the Internet? Think again, ♥♥♥♥er. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You’re ♥♥♥♥ing dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ♥♥♥ off the face of the continent, you little ♥♥♥♥. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your ♥♥♥♥ing tongue. But you couldn’t, you didn’t, and now you’re paying the price, you ♥♥♥♥♥♥♥ idiot. I will ♥♥♥♥ fury all over you and you will drown in it. You’re ♥♥♥♥ing dead, kiddo.   ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "This game is crap, if a zombie hits you, your gona die because you slow down, zombies do way too much damage, if your hiding in your house, about 100 zombies will crowd outside and you cant get out without dying.",
            "review_score": "-1"
        },
        {
            "review_text": "This game changed my life forever. The pure and beautiful design makes a wonderful world. Driven by a powerful engine, designed by probably the best people out there. The gameplay is som rich in content and details. It amazes me how someone could even be able to come up with something like this.   Shortly said. This game is like minecraft and Country Justice: Revenge of the Rednecks had a ♥♥♥♥♥♥ baby, which they choose to throw in a cave where they dump radioactive waste. If someone ever managed to find that baby.. they would find this.",
            "review_score": "-1"
        },
        {
            "review_text": "blah blah blah zombies, guns, death you get the jig good game illuminati ♥♥♥♥♥ chocolate out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever made -100000000000000/10 would play again!                                        Why did I buy this?",
            "review_score": "1"
        },
        {
            "review_text": "rather play agar.io for 48 hours straight than this for 2 hours ",
            "review_score": "-1"
        },
        {
            "review_text": "The first time experience with friend was worth the two dollars.",
            "review_score": "1"
        },
        {
            "review_text": "thank the developers for this game! this is made to mine, build, survive, make friends, and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "So I bought CastleMinerZ in the early 2014s thinking 'Hey I have played this game on xbox and it was fun so I should get it on the computer.' I played for 1 hour and after that hour got up and deleted it off my desktop and walked away. One day I was bored and redownloaded this game and decided to give this game 1 hour to prove it's worth of 5 dollars. I sat down watched it download and pressed play. Lets just start off by saying I play CSGO, in CSGO I have my sensitivity at around 1.30-1.40. This game dosen't let you change your sensitivity at all. I'm basicly walking around while my mouse goes zooming around my screen at the slightest of movement. Don't even get me started on the nasty sounds or the hardcore amounts of damage you take along with the insane HP regen. The game is basicly a damn port from the xbox but somehow is WORSE than the xbox version. To conclude instead of giving this game 1 hour of my time I gave it 5 minutes and clicked EXIT. I guess for 5 dollars you can't go wrong but still its a waste.",
            "review_score": "-1"
        },
        {
            "review_text": "I hacked the game ahahahhahaha ♥♥♥♥♥ this game is great but i love hacking itttttt!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Its a very good game, basically Minecraft but a lot more challenging and it has guns. So if you're into that kind of thing I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Me and my coleages was dropped down on this forsaken plannet not knowing what whe where heading into, when read about a prophesy about a land filled with treasures and maybe freedom... Orlando. As me and my crew traveld across this planet whilst being chased by the most foul creatures you've ever seen an epiphany strikes one of my crewmebers and whe dig down towards the core of the planet and whe find a big rock wich is seeping greeen goop. whe study the goop and figures out how to use the goop in our favour and whe succesfully creates alien technology whe decide now with our newly discoverd and powerfull armory whe move towards our goal Olando. whe find the spoken land and whe grab all the loot whe can carry but lust wants us to keep going as whe venture forward into darkness to wander for an eternety.  Also whe killed dragons and ♥♥♥♥ it a cool game 5/10  I suggest you play with friends else its just another reason to kill yourself. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun action game don't get me wrong.",
            "review_score": "1"
        },
        {
            "review_text": "CastleMiner Z is a amazing game and alot better than the originle CastleMiner. There are dragons, zombies, skeleton, and aliens. What more could you ask for? Overall there are alot of options and you never get bored!",
            "review_score": "1"
        },
        {
            "review_text": "it keeps kicking me out of the game like every minute.",
            "review_score": "-1"
        },
        {
            "review_text": "It is the best videogame ever created by real human beings.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent Game,Would prefer some new hostile mobs and non hostile ones,but oh well. It's way better in multiplayer too.",
            "review_score": "1"
        },
        {
            "review_text": "Me and my mate Callum decided to get this game as a little Midnight Adventure costing us only 1.99$ of our CS GO Inventory  All we wanted was to kill a dragon together   We started out by making some basic guns (the Ak and the Rifle) about 4 minutes after we found a dragon and fisted it so hard that Alduin felt it in Sovangard   We legit sat though the 4 minute download to begin our adventure to kill the Dragon All in all this was a waste of a Griffin and an Ak Blue Laminate  'Its like a Skyrim but with guns' - IGN 2k15  'The Sky Box is too realistic 2.3/10' Inside Gamer   ",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun, but i wish that you could stay where you started and still have a challenge... i played this on 360 with my friends and i hope it comes to one with more stuff added, like cities and stuff. the game is low on graphics though and still feels like it could have more",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for a pretty good bit, and my internet isn't very good, so I'm talking about singleplayer. What the ♥♥♥♥ is this ♥♥♥♥? It's like Minecraft and Call of Duty had a baby, and it had ♥♥♥♥♥♥ particle effects.   Pros and Cons:  Pros ---- Got it for $1.00 on sale. ...Has some batshit crazy original content Has better texture than Minecraft  Cons ---- Stolen Idea Sluggish Aim Down Sights Make a Gun out of Two bars of iron and three wood planks. Genius.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game, its like Minecraft with guns! Other than the fact that the game crashes every 10-15 minutes when I play endurance multiplayer (please fix!), the game is great! Keep up the great work DigitalDNA, keep your game flowin' with more blocks, more regions, etc. Maybe even make it like Minecraft by making a Castle MinerZ for Xbox but make it downloadable on the Windows store.",
            "review_score": "1"
        },
        {
            "review_text": "nice game add me on steam if you will play",
            "review_score": "1"
        },
        {
            "review_text": "ITS fun but wen u are over powerd wat then get this game if u like being overowerd",
            "review_score": "1"
        },
        {
            "review_text": "super laggy and sucks",
            "review_score": "-1"
        },
        {
            "review_text": "good game it is fun and open world.",
            "review_score": "1"
        },
        {
            "review_text": "My review of CastleMiner Z will not be a immature kind of review. I like this game and i give it a 7.5/10 i think they should add talking to it as in speaking through mic and i hate when creatures break ♥♥♥♥. But altough when i am playing with friends this is a great game to play ",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun Co-op game. Played for 11 hours today with a friend. ended up having way more stuff then we really needed and when we faced the undead dragon we had 8 anti dragon rocket luncher each. We ended up exploring further incase we missed something, but that was it. I felt like the game could have had more stuff, something more to explore, or something more to do. Like a tradeable village or more bosses or dungeon kind of thing, empty wherehouse for example. The game just felt short and if we hadnt spent hours mining (had around 1000 diamonds) we would have probly played lots less because it felt kinda like lack of content. But the game was really fun nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "IT KEEPS CRASHING EVRY THIRTY MINS",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games of this century, literally I love this game. The graphics and story are better than any game I've ever played. If any of you disagree then I hate you. Even the title is inspiring, Bethesda, Valve, Gearbox, Rockstar, and Treyarc stole from this game.",
            "review_score": "-1"
        },
        {
            "review_text": "WTF is this game ?",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game Graphics A Little Bad But Still A Good Game I Recomend This To People Who Like Indie Simlar To Minecraft",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful open world sandbox, amazing to play with friends and suprisingly cheap. Would like it better if it featured controller suport after all i do belive it was originally meant for the xbox if im not mistaken. Extremely fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Hey devs its been awhile since an update you know...? I can only kill my friends with c4 for so long...",
            "review_score": "1"
        },
        {
            "review_text": "It would actually be somewhat interesting if solo progression was possible. Challenge and tone alone is what sets this apart as a Minecraft clone. But no matter how far you get, you still get destroyed by enemies. Progression does not make things easier. But for two bucks, I really can't complain.",
            "review_score": "1"
        },
        {
            "review_text": "Castle Miner Z is a Fun game made by the coolest people over at Digital Dna Games this game is alot like minecraft but features things like dragons i would like you guys if you are interested to join the EGZ dedicated server. Thanks and have a good one.",
            "review_score": "1"
        },
        {
            "review_text": "So, to start off,This won't be a pros and cons review, just a recommendation. Please read on to see what I mean.   I only recommend this game because of it's nearly unlimited fun it contains when playing with a group of friends (At least 2-4 other people). This isn't a game I would play alone because there isn't too much to do; once you get to laser weapons and such you're pretty much done. But with friends, you tend to ignore all the cons of this unpolished indie adventure game so to speak and just enjoy exploring and slaying enemies/dragons with your friends, making the experience much more enjoyable.    Not to mention, you can get this game on the castle miner site for FREE. The only reason I see to purchase this via steam is to game with friends. To conclude, don't buy this game unless you have friends that are down for it. Besides all that, great game in my opinion, could use lots more work and updates but sadly the owners abandoned the game. Had great potential  R.I.P Castle-Miner Z 8/8 would get chased by Satan again for another $2 ",
            "review_score": "1"
        },
        {
            "review_text": "CastleMiner Z Is a great, yet hard game that has screaming sprinting zombies, yelling crazy aliens with knives for their right hand and the ever popular SPOOKY SCARY SKELETON!!! These are brutal and unforgiving yet fun to shoot in the face! the game also has some medeival elements such as dragons, lots of trees and the satisfying blacksmith hammer noise when you craft something. There are also some futuristic features such as lazer guns and swords if you ever wanted to be a jedi or storm trooper. If you don't like getting owned by the undead from the underworld, you can turn the monsters off. The game's visuals are amazing! It runs super quick even on my laptop! It still runs great even with a high visual setting. If building is more your cup of tea, then try the creative mode. I really like this game, and at such a low price the game is impossible to say no to. P.S. the game has a slight chance to slow down in the framerate department, so make sure your computer is well optimized!",
            "review_score": "1"
        },
        {
            "review_text": "i have got castleminer z but it will not open :L",
            "review_score": "-1"
        },
        {
            "review_text": "This gaem sux m8 since it doesn't make the blox and the weapons m8. not gr8 m8 i r8 0/8",
            "review_score": "-1"
        },
        {
            "review_text": "its a pretty bad game, but playing with your mates is a ton of fun, and thats all that counts really, so i would sugest buying and playing with some freinds, it can be tons of fun",
            "review_score": "1"
        },
        {
            "review_text": "When I first bought this, I thought this game was good. They haven't optimized much. I used to play this on a Dell Studio Slim 540s at almost MAX. She was a pretty ♥♥♥♥ computer for what she was. Now I use a Toshiba Satellite C55-B5300, which is more powerful. Suddenly, one update broke game sensitivty and made it lag like all hell.",
            "review_score": "-1"
        },
        {
            "review_text": "its k for the price",
            "review_score": "1"
        },
        {
            "review_text": "Good Game Over all and if you played it on xbox you will love teh vast ammounts of updates for pc.",
            "review_score": "1"
        },
        {
            "review_text": "  hey guys i found how to hatch a egg on castleminer +NEW but wait read the spoilers  /SPOILERLOLLOL I WAS JUST JOKING WHY BECAUSE I TRICK YOU LOLOLOLOLOL    ",
            "review_score": "1"
        },
        {
            "review_text": "Essentially, Notch took a ♥♥♥♥ and this is the result",
            "review_score": "1"
        },
        {
            "review_text": "When I look at this game, I think the meeting for the concept of the game went down like this: 'HEY BOB, THE KIDS SEEM TO BE INTO THIS...UH...MINECRAFT THING, IT ISN'T ON CONSOLES YET.' 'THEN HOW ABOUT WE MAKEA CHEAP KNOCKOFF OF IT FOR CONSOLES, TIM?' 'OR BETTER YET,BOB, RIGHT BEFORE IT RELEASES ON CONSOLES?!' 'GREAT IDEA TIM! YOU'VE EARNED A PROMOTION'  So...after that, heres my opinion.  Castleminer Z was a originally a console game, before being ported to PC. I have played it on consoles, and it hasn't changed much between ports.  It was apparently released the same time as the Minecraft console ports, which makes it worse.  The game in itself is enjoyable, to an extent.It hasn't got NEARLY as much secrets or variety as the thing it's knocking off.And even though I'm not really bothered by graphics, for a 2011 game (same year as skyrim released) IT LOOKS LIKE IT COULD RUN ON WINDOWS 98.  Pretty sure the enemies would suit an N64 game. But I'm also pretty sure the zombie model has been used in other games, so this game most likey uses Unity Engine assets.   They even made a verson called CastleMiner that's just creative. They probably made the 2 versions to make more money from you buying them, though CastleMiner doesn't seem to be on steam...hmmm.  I give the game: 1 kick in the nuts followed by watching your entire family being tortured to death while on fire/10  P.S: the current price of under £1 seems too high for a piece of sh*t like this, it's worth about a penny.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 graphics",
            "review_score": "1"
        },
        {
            "review_text": "Just another plain, not that good game",
            "review_score": "-1"
        },
        {
            "review_text": "Well, first thing I want to say is I am a huge DigitalDNA fanboy. I love all of their games on the Xbox 360, and I hope that they respond to this review to give me some kind information. I'll begin my review by saying, resolution is a problem. DNA needs to add changing resolution and meaningful graphics settings to make the game playable for more PC gamers. I personally can not give much information about the gameplay, seeing as I can not play the game with it's current graphics, but from the laggy walkthrough I did, it seems pretty similar to the Xbox 360 version. When they update the graphics settings and add changing resolution, I will definitely bump up my review, but until then, I'm one dissapointed fanboy. :(",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for free. That's a relief. I enjoy it, but it's buggy and unfinished. I don't see anything happening to improve the development. Avoid it. Another reviewer mentioned he would rather drag his private bits through 70 miles of ground glass or something like that. I thought he was going easy on the developers. The LAN play isn't even properly implemented. You host a server, everyone can join. If you switch it to friends only, nobody can join and you can't even invite them... at least that was my experience. As a Minecraft mod, it would have maybe been okay. As a standalone, it's worthless.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't believe any of the positive reviews, period. This game attempts to take multiple popular franchises and mash them together into some horrible abomination of a 'game'. The characters look like they're ripped from a Nintendo 64 shooter, the landscape is what you'd expect from a mobile phone Minecraft ripoff, and the enemies look far worse than the House of the Dead shooter that has been around since 1996. If someone got this game for you, they're trolling you. If you bought this game for yourself, no matter what sale it was on, you trolled yourself. I played this game as a test of irony with a friend and I can confidently say we saw all of the content within 2 hours of playtime.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than Team Fortress 2",
            "review_score": "1"
        },
        {
            "review_text": "Literally just a modded version of minecraft. Except the mod should be called ♥♥♥♥♥♥ game simulator. with ♥♥♥♥♥ier grahics and horrible gameplay.  The only gameplay this game has to offer is shooting zombies everywhere in a randomly generated map, and the resource gathering part of the game is complete ♥♥♥♥♥♥♥t because of how easy it is just to get the best materials in the game and become insanely OP after just 5+ mins of digging. Then you can go on for a million waves and eventually come across these dragons that are just as OP as you are, but this time there is 500 of them and 1 of you. Literally 1 dragon could tear down a whole base made up of the best block in the game imaginable, making it impossible to `adapt` because of the huge ♥♥♥♥ing difficulty gap. The graphics are comeplete ♥♥♥♥. The zombies look like they came from grand theft auto 2 or 3, with thier choppy, geometric bodies. The animation is complete ♥♥♥♥ as well, the sounds are just irritating (THE ♥♥♥♥ING POP NOISE MKDSALHJKSDKWA). There is no story, and no main objective the only story there is is `Here is some ore and zombies, collect the ore make a gun and ♥♥♥♥ them up`. The castle you start out with has no other purpose than to hide on top of like a ♥♥♥♥♥, but even then skeletons snipe you with thier bows (Really, bows?! MINECRAFTTTTTT) or for zombies to somehow climb on top of it and ♥♥♥♥ you or something.     2/10 still little bit of fun and costs like 2$ so yeh.  Graphics= Aids sim  Gameplay= ♥♥♥♥♥ Please  Sounds= MY ♥♥♥♥ING EARS  Story= What's That?",
            "review_score": "-1"
        },
        {
            "review_text": "Don't.",
            "review_score": "-1"
        },
        {
            "review_text": "There's nothing to be said. As much as this game would love to be a more 'action filled' version of MineCraft, it simply can not live close to the standards.   Don't waste your money, unless you're looking for a waste of your time.",
            "review_score": "-1"
        },
        {
            "review_text": "ok aswome game but put new stuff look like  1-more pistol or smg or rife or assault rifle more guns 2-more aless 300 new blocks 3-we should have a flashlight 4-make a playermodel 5-make a glow stick 6-make armor 7-make a money if we see a villege sell guns or a food  8- make a food or medic  9-make a car or a helecopter 10-make a more ores and make a drills thank you",
            "review_score": "1"
        },
        {
            "review_text": "all of the kids ranting on how bad this game is are just trash at it seriously its fun as ♥♥♥♥ if your noot an emo white kid complaining about everythung in there life the game is 5 dollars what did u expect fr great game bad players dont hate the game hate the player",
            "review_score": "1"
        },
        {
            "review_text": "This game is sh*t. When I attempt to start the game, for some reason it does not work. as a result of me not being able to play the game and leaving me with £4 less. As of this I am very annoyed and recamend you do NOT buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is like mexican food. it may look good,but after you eat it you will know the tru meaning of pain.",
            "review_score": "-1"
        },
        {
            "review_text": "About 2 foot midgets who can jump as high as Shaq",
            "review_score": "1"
        },
        {
            "review_text": "its ok",
            "review_score": "1"
        },
        {
            "review_text": "Not very good, I was pleased on the xbox, but on hereit won't work and my computer meets the requirments.",
            "review_score": "-1"
        },
        {
            "review_text": "There is not much I can say about this game that is positive. To be honest I think most of it is taken from other games cut and paste into it. The gun sounds for example come from Half Life 1. The zombie sounds are the same as those used in 7days to die (not 100% sure which used them first since this game is older but it was ported to pc recently with some updates so it is possble). There are 2 diff types of models in this game that simply are as different as night and day. The skeletons and zombies look low res with sharp edges while the dragon and demons are so smooth and rounded they could have come from 2 different games. Its just a waste of your cash and this guy that made it already got his quick cash from the xbox indie marketplace and is now trying to do the same with the pc. Dont fall for this joke of a game and stay faaaar away.",
            "review_score": "-1"
        },
        {
            "review_text": "Games actually really fun But its broken and you pretty much can't find any fixes , or get any help so ♥♥♥♥ you Castle Miner Z, in fact i'm going to actually contact the developer of the game and see if i can get them to do something about this!!!! ♥♥♥♥ MOTHER ♥♥♥♥!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "cant play the game anymore everything became invisible every world i go into is invisible deleted and reinstalled still broken",
            "review_score": "-1"
        },
        {
            "review_text": "This game is utter ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game. Came from playing the xbox version probably at least 3 years ago. Still fun alittle clunky and slow, but thats the charm :). Dont go into this expecting minecraft!",
            "review_score": "1"
        },
        {
            "review_text": "These people dont know how to make a game!",
            "review_score": "1"
        },
        {
            "review_text": "i cant play it. it isnt in my game library. DONT BUY",
            "review_score": "-1"
        },
        {
            "review_text": "Its a little scary. More than minecraft :D",
            "review_score": "1"
        },
        {
            "review_text": "Enemies on CRACK! I have introduced several friends to this game and the results are unanimous! This game is not pretty, sophisticated nor 'up to date' but what it is....HILARIOUS and CHAOTIC. This is the most bang for the buck on Steam right now. The hordes are insane and the dragons are lethal. Definately worth a try. See you in Hell.",
            "review_score": "1"
        },
        {
            "review_text": "Castles, mining, and lots of z's. all good stuff you know you like at a price you can afford. I like it so much i bought it twice! thats right, there is a copy on my unused 360 right now, and im not even bitter. its that good.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Fan Game Mincraft 10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Like Minecraft but with guns, realistic textured blocks, ios/ps2 looking playermodels, Dragons, Zombies, Aliens, Skeletons and Demons",
            "review_score": "1"
        },
        {
            "review_text": "i bet this is better than minecraft cas IT HAS GUNNNNNNNSSSSSS",
            "review_score": "1"
        },
        {
            "review_text": "weird and when i play solo 2o mins into game it stops responding",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty ♥♥♥♥, I guess. Not worth it for the coin. I don't think it's being updated anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Trix are for Rick James 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Why is this a ♥♥♥♥ing game. Most of the models have Ebola...",
            "review_score": "-1"
        },
        {
            "review_text": "Needs more content.... That's all I have to say.  It's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would get cancer from this game again.",
            "review_score": "1"
        },
        {
            "review_text": "I Absouletly Love This Game Because Of Survival",
            "review_score": "1"
        },
        {
            "review_text": "CastleMiner Z - Raymond K. Turcotte  Yet Another Minecraft rip-off. Personally I think that game companies should stop makeing Minecraft rip-off games because they don't do as good as Minecraft, no matter what! Back on topic, i don't even understand how to play this game. A friend from New York recommended this game to me way back when on Xbox Live. I listened to him, bought it. Personally i had no intrest. So many people say 'Wow, what a great game. It's giving minecraft a run for it's money'. - Ya right, as if! Let's face the facts. Minecraft will never be betten. It's first of it's kind.",
            "review_score": "-1"
        },
        {
            "review_text": "Some robot Face comes on screen,Loading Black screen",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing ♥♥♥♥. I changed the resolution once and it permanently broke the game. ♥♥♥♥ you DigitalDNA, your game is coded by autistic children",
            "review_score": "-1"
        },
        {
            "review_text": "I broke a gold loot box and got every gun, every ammo, every weapon and everything. Develepor pls nerf",
            "review_score": "1"
        },
        {
            "review_text": "At first I was like AHHH but as the game progressed i was like FFFFFFFFFFUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU",
            "review_score": "1"
        },
        {
            "review_text": "built a house , went out mining , came back to a dragon burnning my home and the cheeky ♥♥♥♥ had the nerve to attack me   0.5/10 this game makes me want to abuse people",
            "review_score": "-1"
        },
        {
            "review_text": "this game is having ur girlfriend to bite of ur ♥♥♥♥♥ is like having a girl have a ♥♥♥♥♥ fu ck u",
            "review_score": "-1"
        },
        {
            "review_text": "Gave me 'Nam flashbacks :( ",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game. This will give you and your freinds days of fun. there are very little things to do though, so when everything is done its done :/ but its worth the money. :)",
            "review_score": "1"
        },
        {
            "review_text": "I would say this game is not really that bad In my Opinion to be honest, I had no problems with the game or anything. Graphics don't really bother me in the game, the game has been improved and alot of changes to this game. I will still suport this game by it's update, there isn't really alot of servers in this game so, I would really Appreciate if you guys contuine to support this game, because I know one day this game is going to get improved one day. Support the game guys.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would refund again.",
            "review_score": "-1"
        },
        {
            "review_text": "its pretty K",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░█▀▀░░█░░░░░░ ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░  ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░  ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░  ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░  ░░█░░░▐░░░░░░░░▄░█░░░░░  ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░  ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░  ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░░  ░░▀▀░▄CastleMiner Z▄░▐▄▄▄▄▀░░░ ░░░░░░░░░░░░░░░░░░░░░░░",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a complete disaster, tries to copy Minecraft with ♥♥♥♥♥♥ engine and gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible this game sucks",
            "review_score": "-1"
        },
        {
            "review_text": "need more updates",
            "review_score": "1"
        },
        {
            "review_text": "I've never said this about a video game, but I just have to say that the console version is better. There's a better community, better-placed control sensitivity, and voice communication. I have to give the PC version a 5.5/10, but the console version an 8.25/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game...",
            "review_score": "1"
        },
        {
            "review_text": "lolthisisajoke/10 Really violent and realistic graphics. WORTH EVERY PENNY!!!11!111oneoneoneoneone!!!!!!!!1111 Minecraft copied this CastleMiner Z many 0rig1n4l nayme Swag game 4 swag peepssssssss$$$$5555 ",
            "review_score": "1"
        },
        {
            "review_text": "  After you learn how to play this thing, its funny and worth the $20 dollars that I paid :3 (It took me like 3 hours to learn, the worst 3 hours in my life as a gamer) ",
            "review_score": "1"
        },
        {
            "review_text": "Think of everything ♥♥♥♥ about minecraft and then add console port onto the end of it.  That's this game in a nutshell.",
            "review_score": "-1"
        },
        {
            "review_text": "Minecraft but with zombies.  Thumbs upo, the good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "i hate this game's graphics and its also a copy of minecraft but worst",
            "review_score": "-1"
        },
        {
            "review_text": "Minecraft's little brother - the ♥♥♥♥♥♥♥ brother who tries to pretend he's as good at being Minecraft as Minecraft but is in fact an inferior version of Minecraft.",
            "review_score": "-1"
        },
        {
            "review_text": "Minecraft with Aids.",
            "review_score": "-1"
        },
        {
            "review_text": "alot of people say its a rip off,but its not! yes it may not be better than the XBLA version,but its still pretty good for the price tag     8.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "join server...craft some Gold bars....lags and dosnt comsume materials...then later make it rain gold everywhere......server crashes",
            "review_score": "1"
        },
        {
            "review_text": "It's like if Minecraft and Daikatana had a baby!",
            "review_score": "1"
        },
        {
            "review_text": "Very. VERY great game. If you buy this, go ahead and add me. Also, play with me. Cause...Well...The game is better like this. Let's just say 'You want some laser stuff? Come to my server.'",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game but when i join a game people always want to kick me out ",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the money very intense at hard levels.",
            "review_score": "1"
        },
        {
            "review_text": "if you like strategy games, buy it. it's similar to minecraft in the physics. If only they had emerald.... XD",
            "review_score": "1"
        },
        {
            "review_text": "it gos not loadd plz someone help me ",
            "review_score": "1"
        },
        {
            "review_text": "The game is awfully fun, I'd just think it needs some more work put into it... You can't craft much, you can't do very much, You can explore and get pwned by dragons, but other than that, It needs more work. I'd also fix the flippen Demon Hitbox. You have to hit around his **** to atleast deal Damage. Aliens also could use some work. If your mining SpaceRock and SpaceGoo, and then all of a sudden, an alien spawns in you and Murders you. I Lost so much hours of work that way. If you want to buy it, go ahead, but at the moment, Buying the game on sale is better. The game is really worth it, but keep in mind that it has NOTHING related to minecraft, and the zombies Tend to outrun you, and the farther you go, the harder and faster zombies will be.",
            "review_score": "1"
        },
        {
            "review_text": "Castleminer Z is a game we all know, it just has a different skin.  I've played this game for 200 hours+ on Xbox 360, don't let my play time fool you. This is easily one of my top 10 games I have ever played. Why you ask? Well let me explain it to you.  Castleminer Z is a game where you collect resources, craft weapons, and fight hordes of zombies, spooky skeletons, dragons, aliens, and even Satan himself. Not only can you fight, but you can also build forts, and travel vast distances that will can make your friends wonder why you play this game so much. This game can challenge you, and make you feel proud that you got that far and killed that ice dragon. This is al well and good, but lets take a look at some real ups and downs.  The Pros-  Fun sandbox gameplay  Familiar FPS feel  Co-op  PVE/PVP  Building  Ranged/Melee combat  Good difficulty scale that can make you stop and rethink your plan/strategy  $5 is a good price point   The Cons-  Performance is mediocre  Not many graphical options, but some coming soon  Sensitivity  Game can feel boring without friends (opinion)  Boring, recycled textures from another game (Castleminer, only on Xbox 360)  Zombie hording can massively overwhelm and kill you almost instantly  Was a game that went with the trend of voxel graphics  PVP is there, but not very exciting   (may add more if i come up with stuff)  All and all, Castleminer Z is a pretty good game. I could recommend it to anyone who is a fan of Minecraft and likes survival zombie games. $5 is a good price point for this product, and a sale rolls around every now and then. If you can, get some friends to pick up the game or buy a four pack to play together. If you want to know more about this game, search it on youtube, there are plenty of videos on it from 2 years ago when this game was the ♥♥♥♥ on Xbox 360.",
            "review_score": "1"
        },
        {
            "review_text": "Dayz+Minecraft=Unturned and Castle Miner Z i give it a 10/10  The game is awesome when you play with your friends! Also it has good graphics and 3D :o I reccomend getting this game because its better then minecraft and its cheaper :D Its a fun game alot zombies and skeletons :) This game is easy to play I reccomend playing in Easy And it comes clear.  Castle = Build castles! Miner = Mine! Z = Zombies!",
            "review_score": "1"
        },
        {
            "review_text": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "Loved it on xbox and love it on pc. Just needs a few more fixes. Other than tthat, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome. It would be great a crossed-multiplayer with Xbox360, but it is just a dream lol. It has everything you need, I totally recommend it. I own it on my xbox and now on steam &lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing! whatever people say about. dont listen to them.they are weirdos.this game is fun and different from minecraft.yes u may not be able to change resolution but the games still looks fine.the one thing that makes me mad is the price ,but 10 dollars ,i think the game is still worth and i recommend u to buy it",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun but I dont like it when you die.Dieing is not fun at all.:] The game is cool the have guns and explodtions in the game.You might know that because of the trailer.",
            "review_score": "1"
        },
        {
            "review_text": "i had this game on xbox and played it my friends when i was younger. So when i saw it on pc i instantly thought 'i need to get the 4 pack for me and my friends' and honestly, it was worth the $15.00 i payed, it might not be fun for people in single player, but if you like CoD, minecraft, and goat simulator you'll like this game even without others.   so i like this game but i recommend inviting a few friends because it will make for a better experience.",
            "review_score": "1"
        },
        {
            "review_text": "Best way to discribe the game is by saying this: Don't buy it, unless you're obsessed with blocks, zombies, skeletons and a annoying ♥♥♥ dragon.",
            "review_score": "-1"
        },
        {
            "review_text": "Minecraft with guns. Less to craft and create, but you can blow your friends up with c4, wich is nice. This game is actually more fun than you might think, when you play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "this games need have some of the zombie/monsters nerfed. on easy i was killed (with full health) by some monster in two hits, one of those two hits was from behind, and due to the lack of there being any armor or run feature you cannot escape said two hit killing enemy.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is 420% Legit...",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good. I don't know about everyone else but I am excited to see any new additions (preferably something to majorly branch off from the 360 version's content) that they add to this. It would be nice to see a Teleport to home or be able to set a waypoint to Teleport to it. (as I have lost many houses on the 360 version) there is a lot of potential for this game though, like maybe adding character customization, maybe adding armor (Like maybe power armor made from Space Goo and Diamonds). I give this game a 10/10 and suggest it to those of you who want something a bit different from minecraft. I even gifted this to my friend for his Birthday and he said he liked it too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the pure embodiment of potato.  Just no.",
            "review_score": "-1"
        },
        {
            "review_text": "it would be nice if they upgraded this game but it is still very fun i like the coop in this game the game looks bad but it has its fun times if you like survival with freinds i reccomend playing this with your buddies",
            "review_score": "1"
        },
        {
            "review_text": "Iv'e had loads of fun on this games hours of fun killing hunting Surviving It was just the great game... I didnt have xbox live by the time i did have steam and pc so i really wanted this game ive been waiting years for this game.... Its so great.. To have it you cant feel how it is",
            "review_score": "1"
        },
        {
            "review_text": "keep crashing ",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't that bad. The devs didn't abandon it anymore. They are updating it this fall. Plus they are now going to update it regularly.",
            "review_score": "1"
        },
        {
            "review_text": "WTF EVERYTHING IN THE GAME IS INVISIBLE ALMOST THE DRAGONS ARE INVISIBLE THE ZOMBIES ARE HALF THE GUNS ARE AND A LOT OF BLOCKS THIS IS A PIECE OF CRAP THE XBOX VERSION IS BETTER I DEMAND A REFUND",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game gifted to me and just laughed and figured it would be horrible, just by looking at the picture. But then 4 hours of playing later, it's actually a really fun game. Yeah the graphics aren't the best, but the shear insanity of the game makes up for it. Going to each biome and fighting the biome-based dragons is one of the best things about it, they get harder the farther you travel, and you get decent loot from them too!   Another thing that makes this game great for the price that it is, is the fact that you're never really safe. Whether you're mining in a cave, or you're outside wandering the biomes. There's always going to be messed up looking aliens, zombies, and skeletons shooting their arrows at you from a far. Also the fact that in caves they just magically fall from above you and land on your head is terrifyingly great, you never expect it and it scares you every time, sending you into a panic and firing an obseen amount of bullets into their faces....mind you that is really satisfying.   Also the variety of weapons that you can get is awesome, nothing beats pulling out an AK and completly destroying mobs.   To sum it all up, in my opinion this game is 100% worth $2. I would still buy it even if it was more that $2. So buy yourself a copy and get ready to have some fun.",
            "review_score": "1"
        },
        {
            "review_text": "Life sucks, and then you ♥♥♥♥ing die.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible. All I have to say. This is not what a game should (or games today) should be, just a big rehash with no replay value.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS A COPY OF MC! AND ITS ♥♥♥♥!",
            "review_score": "-1"
        },
        {
            "review_text": "i like the game but need the map of the controllers and make our own controller, and about controllers how can this game don't have the xbox 360 controller the BACK button (buttons 7) the game is on xbox",
            "review_score": "1"
        },
        {
            "review_text": "Its like developing cancer but without the waiting",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a big ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "THIS SUCKS SO HARD DONT BUY THIS M8's AT ALL ‎ಠ_ಠ",
            "review_score": "-1"
        },
        {
            "review_text": "REALLY GOOD. It's good for lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Skyrim, but with guns",
            "review_score": "1"
        },
        {
            "review_text": "dragons at spawn",
            "review_score": "-1"
        },
        {
            "review_text": "its all rit",
            "review_score": "1"
        },
        {
            "review_text": "a HUGE fuhking ripoff of Minecraft. I've played minecraft, and it's better than this sh!t",
            "review_score": "-1"
        },
        {
            "review_text": "thx for giving us updates :D",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, it is really funny to play a session of it sometimes. :D",
            "review_score": "1"
        },
        {
            "review_text": "Well its kinda good, its minecraft with guns, and more dragons........  Pros -guns. -However with the guns the zombies are hard to hit because they jump around, that may sound bad but that at least gives it SOME balance and dosent make the game too easy or too hard with the zombies  cons -when you hit a block, a smoke effect goes and that is kinda annoying. -Even with the scenitivity settings on, the scenitivity is a bit of a problem  Overall rate I give this: 6.5/10 ~decent game, could be better",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever! You should get it right away!",
            "review_score": "1"
        },
        {
            "review_text": "Is it a Minecraft clone? Yes. Is it fun? Yes. I like this game. Originally I purchased it on the Xbox live indie market. It's buggy, it's silly, it's also a cheap alternative if you can't bring yourself to shell out 25 bucks for Minecraft. End of the day it's a lot of fun to build forts and survive nightly zombie hordes. If you are looking for a game to take seriously I cannot say this is the game for you, but if you just want to run around and build stuff and kill zombies it's a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, totally recomend this for the price. Great when you and your friends are bored or just want some indie game fun with survival instead of playing Minecraft and then getting mad at your friends a few hours later. The option of No friendly fire is great so anyone can join your game, help you and not troll you by killing you. Teamwork is also important as you take down more powerful zombies throughout the days and elemental dragons in differnt terrains (biomes).  If you have played this on the Xbox 360, this is a big improvement including the better designed user interface. Controller Support works excellent with this game incase you dont know how to use keyboard and mouse or new to PC gaming.  FORTUNE LAND is still there, so make sure you go to No Enemies mode and go to 3000m. DIAMONDS and BLOODSTONE!!!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Super-fun -Smooth gameplay -Play for ages without getting bored -Even more fun with multiplayer  Cons: -Too hard in Offline Mode -Boring in singleplayer -Graphics need work",
            "review_score": "1"
        },
        {
            "review_text": "I remember being very drunk one night, and woke up with this game in my library. And it's not good.",
            "review_score": "-1"
        },
        {
            "review_text": "Number of bugs and horrid mouse sensitivity controls makes this game hard to play. The title should stay on Xbox 360.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very fun and addicting with a lot of friends.",
            "review_score": "1"
        },
        {
            "review_text": "looooovveee this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Community is completely toxic, everyone is an ♥♥♥. Also hard to understand.",
            "review_score": "-1"
        },
        {
            "review_text": "I've enjoyed the action and suspense and the new world everytime I restart.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not fun! not even worth a dollar ",
            "review_score": "-1"
        },
        {
            "review_text": "love this game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! had since x360 and got it on here love it  ",
            "review_score": "1"
        },
        {
            "review_text": "I see people posting thumbs down with only 0.3 hours and i would first like to say for thoese people to push towards playing the game for at least 5 hours with friends before reviewing, I played this game on the Xbox and On steam with alot of people. We always have a blast playing on hard going up against the hordes of mobs that spawn at night and taking down dragons, If your honestly looking for a game to hunt thing down in and also build. This is that game. Its quite its own style of game. The crafting can be a bit iffy but its also easy to find things along with making them. I do wish that they add more weapons and mobs into the game. But it is really really a good game to blow past the time or just to have a blast with your friends. I will agree, Its boring by your self. But almost every game is :)",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game it's beta,  It needs a bit more on the constuction of blocks, perhaps.   But all in all it is a good game,",
            "review_score": "1"
        },
        {
            "review_text": "Castlemine is way under rated. You dont just stay in one spot like minecraft you are supposed to travel across biomes and eventually fight dragons to beat the game. its a total shameless mc rip off but that being said its really fun for something different!",
            "review_score": "1"
        },
        {
            "review_text": "bit laggy but happy it finally came to steam",
            "review_score": "1"
        },
        {
            "review_text": "I love this game it is just amazing of course that is me ignoreing my 5fps but the game is amazing i know this because i used to play it on the xbox and loved it worth the download",
            "review_score": "1"
        },
        {
            "review_text": "At first it was just a sloppy port from the 360 But they have udated it now it is BUTIFUL aand it dosent use the xbox buttons anymore witch made it look verry sloppy",
            "review_score": "1"
        },
        {
            "review_text": "I like the game but it makes you rage quit easily. You lose everything if you die so that makes it easy for players to rage quit. I'm not liking the targeting system and the speed zombies can run at. It doesn't give the feel of the zombies. It gives more feel of phycos from borderlands 2. BUT I still recommend it because it's fun defending your castle! Gotta love defense :D. IT's even better in hell (Not being religous), Anyway if you decide to buy it I hope you love the game and have much better adventure then me :D",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game. Althought it copies minecraft it is fun. It has guns and zombies. Well thats what the z stands for, castleminer Z its 10.00 I belive",
            "review_score": "1"
        },
        {
            "review_text": "When this game was released on PC, I was hoping for more than a couple updates. We got the 1.7 update, adding a decent amount of stuff, but that's it, no more updates around a year later. The games price also dropped to $1.99, but sadly I bought it before hand. Digital DNA moved on to other projects, just after the struggle of getting this game on steam. It's a good game, but without friends to play it with, it gets real boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game for CO-OP",
            "review_score": "1"
        },
        {
            "review_text": "The game looked good at first and i thought it was good but the game needs much better graphics than what it has and the mouse sensitivity is terrible beacuase when i turned it down it didnt even change. The mouse seems really slippery too. if i was gonna buy this game i would wait untill its updated alot more.",
            "review_score": "-1"
        },
        {
            "review_text": "best game ever........ too bad i dont have any1 to play with... add me anyone and we can play!!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "This game just doesnt work or me. It has none of the charm of minecraft and the combat and crafting are mediocre at best. Might be fun multiplayer, but the few games I tried online were poorly populated with horribly rude people, so I am not the best judge of that. Some nice ideas in here but they fail to grab me. Meh...",
            "review_score": "-1"
        },
        {
            "review_text": "Played the Xbox version, loved it. Played the PC version, it's alright. Please add a way to speak in game with voice chat and fix sensitivity issues. Highly recommend this game to play with friends using teamspeak/skype, it's loads of fun to play if you have friends to do so with, if you don't have friends the game is still very fun to explore and see how long you can survive and explore. Good game just needs a bit more to make it a great game.",
            "review_score": "1"
        },
        {
            "review_text": "If you want 'aids in a good way' than play this game for 20 hours straight.   ps. if you need more viewers on twitch just stream this and name it 'Black Ops 3 Gameplay'",
            "review_score": "1"
        },
        {
            "review_text": "this game is not that game i would say its good for the price and it can be pretty fun. I will say this game is so much better then the other brick (mincraft) knock-off games on steam",
            "review_score": "1"
        },
        {
            "review_text": "CastleMiner Z I remember playing this game on the XBOX 360 from the Indie Game section. This game has alot of protential if the makers would add more content to the game. This game is a sandbox creation world like 'Minecraft' although there is a lack of blocks and items to create within the world, they have add weapons; Railguns, shotguns, pistols and much more. This brings new elements to a sandbox game as you will find these items come in handy for the vast array of AI Mobs. Creating building within this game is very difficult as AI Mobs spawn all the time during the day, and can be a handful when there's more than one. They also have the ability to jump a vast distance. The game is built up like 'Minecraft' without portals to other Dimensions, alternatively when you dig down to what would be bedrock you will discover hell made up of blood stone. The stone can be crafted to create blood pickaxes which are useful to mine all blocks within the game. once you have this pickaxe you will notice you have a step meter on your screen, running in the north direction you will find new biom's which hold valuable rocks from railgun creation.   Over all the game has potential to become a great sandbox game. Graphics within the world (Rating 5/10) Controls (Rating 8/10) variety (Rating 2/10)  CastleMiner Z (Game Rating 3/10) With additional added features this rating could rise. If your looking for an alternative to minecraft this is brilliant but don't expect the same array of blocks and items.",
            "review_score": "1"
        },
        {
            "review_text": "you need iron to make a door 0/10 got destroyed by dragons",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: Dig a 3 block deep hole Step 2: Get alot of knives Step 3: Wait until night Step 4: Jump and stab the zombies Step 5: Enjoy",
            "review_score": "1"
        },
        {
            "review_text": "Well the creator is back and is going to start updating this game again so i recommend",
            "review_score": "1"
        },
        {
            "review_text": "If you like hella cheap, glitchy versions of minecraft with much less time put into the actual production of the game, do it brah. Don't waste your money and time please. Please save me the troubled nights of sleep where I lay awake thinking about all of the poor souls who wasted a good $2.00 on this illegitimate excuse for a game.",
            "review_score": "-1"
        },
        {
            "review_text": "....................../´¯/)  ....................,/¯../  .................../..../  ............./´¯/'...'/´¯¯`·¸  ........../'/.../..../......./¨¯\\  ........('(...´...´.... ¯~/'...')  .........\\.................'...../  ..........''...\\.......... _.·´  ............\\..............(  ..............\\.............\\...  this GAME ",
            "review_score": "-1"
        },
        {
            "review_text": "i have seen read and heard alot about this game some good some bad but now that i have played it i can tell you what i think. do i like it? yes! its actually not taht bad sure it could use a few tweeks with the dragon (we call her sally) and the dust when you are mining could be toned down but it is overall a fun game! i just hope that it dosen't get stuck in develpment hell! you have a good thing going here and alot of people do actually enjoy it. just know what you are getting into watch a bit of gameplay and try to decide if it is right for you its like buying pants. you try them on beffore you buy them and with a $4 price tag who could complaine about it",
            "review_score": "1"
        },
        {
            "review_text": "8/10  A great game to play with friends.  There is alot of gameplay in this game. You can play for hours before you even get yourself a proper base, and are able to survive the night.  It's not that great graphics but overall i think this game is worth the money.  i strongly recommend you to buy the 4-pack of this game and send the copies to some friends.  Thanks for reading and have a good day!",
            "review_score": "1"
        },
        {
            "review_text": "its better if your on shrooms",
            "review_score": "-1"
        },
        {
            "review_text": "-Minecraft with guns  -Meh, boring  -Played it for a while offline.  -Farming dragons, what else will i do?  -Hosts server online  -Meets really nice guy  -We play together for atleast 2 hours  -Having fun  -Game notices that im actually having fun  -Game suddenly gives me huge and obnoxiously long lag spikes  -After a while of bearing it, i cant take it anymore  -Had to quit castleminerz and abandon my friend to see whats going on  -Think i fixed it  -Game wont even start now  -Dind't get a chance to friend that guy  10/10 I cry every single time",
            "review_score": "1"
        },
        {
            "review_text": "Good game i like this game but i have a problem said when ienter oops smth were wrong we try to look for problem so plz fix it or help me!",
            "review_score": "1"
        },
        {
            "review_text": "I will forever promote this game i love it till the end &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, at first. But it's too easy. Within 45-60 minutes, I can get the best stuff in the game. It has a dying community and very little replay value to me. I'm sad that I spent money on it, and wish I hadn't. Although I do not recommend this game, that doesn't mean you shouldn't try it for yourself, as my opinion is exactly that. An opinion. If you like minecraft and want a bit less of a challenge, go ahead and buy this. Before I conclude this review, I do want to mention that the 2 biggest reasons I am not recommending this game is simply because of the playtime, and because it's community is basically dead. Everyone I've met who still plays either kicks me, griefs, or is just a huge jerk. (I'm avoiding a choice word.) I won't play it again, but if you've got spare change and want something to fill a bit of time, go ahead and give this a try.",
            "review_score": "-1"
        },
        {
            "review_text": "CastleMiner Z is a game that blew my mind back when I used to play console, and the fact that I could get it for my PC when I switched is just great. It's an amazing game, so much to do, so much to craft, and so much to build. Probably one of my favorite Indie games out there, and as I only have 2 hours logged so far I will most DEFINITLEY be putting more time into this game!",
            "review_score": "1"
        },
        {
            "review_text": "the wire season 13",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pretty bad game. Fun to play with friends if you have any.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. I realy liked playing it. But when you reach a point then the game just reapets. It's a good game just needs some updates. I recommend playing it!",
            "review_score": "1"
        },
        {
            "review_text": "i played this game on the xbox360 and i loved it a really good game so i bought this game on steam because they dont update the xbox360 anymore.",
            "review_score": "1"
        },
        {
            "review_text": "Ignore all these reveiws saying that its just a bad minecraft. Because this game is NOT minecraft. Me and my friend back in the xbox360 days would actually stop playing minecraft to play this. Whats minecraft got? Swords and slow moving zombies? In this game we built a fortress and loaded it up with Lmg's and AK's and RPG's and would prepare for a zombie hoard to attack us. plus the world size is way bigger than 360's minecraft. There are so many different weapons that I remember everywhere from a pistol to a lightsaber. plus enimies too. minecraft has a skelliton, zombie and a creeper basically. this game has zombies, skellitons, deamons, aliens and some i havent even discovered yet in my many hours playing on 360. So if you say this game is bad because its 'Just Like Minecraft' you're wrong",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite games but add more items and stuff i recommend this to all gamers ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, if a zombie gets next to you you instantly die after 1000 meters, cant shoot demons, dragons are now a one hit kill (for me to kill them) The aliens have more health than most of the dragons i've come across, the animation is funny, achievements dont work, and the zombies jump like ♥♥♥♥ing psychos making them hard to hit with the already funky controls.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when it was released for Xbox. It was a cool game. I see they have made updates to the game since then which is even cooler. I like the new fly mode. My only suggestion is that there be more building materials and designs available, wall selections are in need of more options. Also not sure if it is a bug or what but my game closed earlier and gave me an error message saying that the game ran out of memory. I have 16GB of memory and this computer is a fairly new Desktop.",
            "review_score": "1"
        },
        {
            "review_text": "It's much more fun and challenging than similar games.",
            "review_score": "1"
        },
        {
            "review_text": "yes this game is great! it reminds me of the old dayz on xbox 360 :)! definately buy it!",
            "review_score": "1"
        },
        {
            "review_text": "they say it was shity but they have an awsome active community. Looking forward to future updates.",
            "review_score": "1"
        },
        {
            "review_text": "Alright here we go. So as you can see I only have 13 hours in this game (On my way to get at least 50. Game is still fun as I remember it.)  I've been playing since it's early Xbox 360 days. And in my opinion, is it worth it? Short answer: Yes.  Here's to keep things short.  Pros: + Don't wanna have to go through the 1-5 minute hassle of getting a gun mod on Minecraft? Get this games + Game will rip you a new one on Endurance, DON'T GO OUT AT NIGHT UNLESS YOU HAVE SOMETHING OTHER THAN A PISTOL AND KNIFE. + Cool, dragons and no need to do all the tedious tasks of going to some other dimension. + Endurance is hella fun once something like a shotgun or assault rifle is accquired. + Creative has been heavily updated since it was first release. Fly mode my dudes. + Seperate goals to complete during Endurance mode (Killing The Undead Dragon is pretty much, top priority.) + Hell biome literally sticks to it's name. (ESPECIALLY in Endurance) + Dragon Endurance is unlocked once killing the undead dragon. + Easily able to hack your items. (lol) + You can literally make a lightsaber + Fun as hell with friends (if only a friend would purchase this game. Come on lads, it's only 4 bucks.) + Got sp00ked by the demon like monster. 10/10 would ♥♥♥♥ myself again. + PvP (Though I'm not a PvP guy)  Cons: - Will be hearing the main menu screen. A LOT. (This is due to ♥♥♥♥♥♥♥s kicking anyone who they don't know) - Community is, eh. Also kind of small. (This is because obviously peeps wanna play some ol' fashion Minecraft instead.) - The minute PvP is turned on, all hell breaks lose. (You best hope to god you're not near someone with anything that ain't a pistol.) - Totalbiscut destroyed it with his 12 year old fanbase. (Joking obviously, fanbase died the second minecraft got on Xbox.) - Not much fun alone - Can and will crash possibly (You just have to pray) - Optimization is odd within this game.  Overall Rating  7/10[ /b]  Will probably do a vid review of this game and update this review if I do. ",
            "review_score": "1"
        },
        {
            "review_text": "creators of thhis game plz make it so that my castleminer z works because the game flashes n then flashes of then on steam it shows that its running when its not also i used to have this game and it auto deleted thats why i want it so plz help",
            "review_score": "1"
        },
        {
            "review_text": "It's great! It really has it's own difference between ex. Minecraft &amp; Terraria and you know those sandbox games. I feel like you developers if you're reading this you should be proud of yourself. This is a masterpiece i really feel like this needs a prize.",
            "review_score": "1"
        },
        {
            "review_text": "This is a VERy fun game for only 4$. Although it will say iv only spent 3 hours in it on steam, i have spent days playing it on xbox. Super fun, Get it, And try creative mode!",
            "review_score": "1"
        },
        {
            "review_text": "'Now, you see Dylan, we have to say '♥♥♥♥ off' to them and play the game anyways'  @Sheriken",
            "review_score": "1"
        },
        {
            "review_text": "It's an okay game, it brings back memories from Xbox 360. The only problem is that sound cannot be turned off.",
            "review_score": "1"
        }
    ]
}