{
    "app_id": 253490,
    "name": "CABAL Online",
    "release_date": "2016-02-17",
    "developer": [
        "ESTgames Corp."
    ],
    "publisher": [
        "ESTsoft Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "MMORPG"
    ],
    "achievements": 0,
    "positive_ratings": 495,
    "negative_ratings": 277,
    "price": 0.0,
    "description": "The original revolution of action has arrived on Steam. Put your skills to the test in one of the most renowned action-oriented and diverse MMORPG experiences of all time. Play now for free!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/253490/header.jpg?t=1538677317",
    "minimum_requirements": "OS: Windows 2000 or above Processor: Pentium 4 2.0GHz+ Memory: 1 GB RAM Graphics: ATI Radeon 9800PRO/Geforce 6 Series or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 2000 or above Processor: Pentium 4 3.0GHz+ Memory: 2 GB RAM Graphics: ATI Radeon HD/Geforce 7 Series or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "Literally destroying my life in every aspect since 2008, Cabal is the game if you need something to mess your head for months. Good quality skills and characters, a darn high level cap(200), addictive dungeons, a nice nation battle system are the most notable pros. As for the cons, since servers are located in the US(as i think that's why), players from anywhere outside is having serious ping problems but it can be solved via external programs like WTFast. Just play it and chose yourself but definetly give it a try. Nevareth awaits!",
            "review_score": "1"
        },
        {
            "review_text": "*Accidently kills a n00bs boss monster and takes the loot via space*  *Sends him a trade request to give him the stuff*  n00b : Do that again and I report!!!!!  This game has a ♥♥♥♥ community Overall the game itself is nice",
            "review_score": "1"
        },
        {
            "review_text": "Helpful community, great game.",
            "review_score": "1"
        },
        {
            "review_text": "Legendary game!",
            "review_score": "1"
        },
        {
            "review_text": "For an MMORPG that was released in 2005, CABAL was definitely a gem, but it's so out-of-date now (except the awesome BGM, ofc). I played it years ago and it was fun while it lasted, but they deleted my characters, so that's why my review is negative.",
            "review_score": "-1"
        },
        {
            "review_text": "it wont start anymore what do i do?",
            "review_score": "1"
        },
        {
            "review_text": "The game is good,  but those graphics in 2016 is just not right",
            "review_score": "1"
        },
        {
            "review_text": "After a horrendous registration and launcher updating phase I somehow was able to open the game and do some quests. The thing is this game didnt age well. It CTD'd on me when I finished a quest and I will never open the game ever again. I played presteam when it first came out and remember having so much fun with it. Checked daily until the release date but sadly it didnt satisfy.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Nostalgia inducing game, got destroyed after the horrible updates. 6/10.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not working.. lol what a waste of time installing.",
            "review_score": "-1"
        },
        {
            "review_text": "Game isn't even working, pretty much broken for most people, I don't how this game wont work when I'm from Washington lol.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT PLAY THIS GAME IF YOU LIVE IN EUROPE. No EU server 500 ping Hue hue br vamos all day in chat. ♥♥♥♥ YOU ESTSOFT",
            "review_score": "-1"
        },
        {
            "review_text": "i stuck at entry screen for 1 hours, many other players have the same problem too it kinda made me mad , i thought i want give a bad review , but dev said this game will be fix at the community hub ,   its just be on steam, so its maybe has some issue, so i will wait until dev fix this up, i really have high hope in this games since my friend tell me its a worth game to be played,   i hope dev will fix this as soon as posibble  *spent 5 hours to download this game*",
            "review_score": "1"
        },
        {
            "review_text": "loading screen... nothing happen...",
            "review_score": "-1"
        },
        {
            "review_text": "Game is unplayable - crash direct on joining server! Error 0XE019100B ; absolute NO support - ♥♥♥ YOU DEVS!  ....................../´¯/)  ....................,/¯../  .................../..../  ............./´¯/'...'/´¯¯`·¸  ........../'/.../..../......./¨¯\\  ........('(...´...´.... ¯~/'...')  .........\\.................'...../  ..........''...\\.......... _.·´  ............\\..............(  ..............\\.............\\..",
            "review_score": "-1"
        },
        {
            "review_text": "Stucked at loading screen!",
            "review_score": "-1"
        },
        {
            "review_text": "can't play T_T",
            "review_score": "1"
        },
        {
            "review_text": "gg cant play. steam cant fix",
            "review_score": "-1"
        },
        {
            "review_text": "Love it, My brothers been playing this game since day 1 and he got me to try it out knowing imma big mmo fan. I never ping like others say they do, nice graphics compaired to alot of games (not counting the new ones) The quests may seem repetive for some but I enjoy reading the story line to each one. Only thing I dont like is WHEN PEOPLE STEAL MY FORTUNE PIGGY!!!!! &gt;_&gt; Have some class people 1hop left on a pig someones killing does not give you grabs to come steal it ya butts",
            "review_score": "1"
        },
        {
            "review_text": "How do I start... I realy like this game, altough I've only seen the beginning. The graphics are outdated but that does not realy matter. A game does not need good graphics to be a good and enjoyable game.  At first I had some problems with starting it and gettign the error that it couldn't connect to the game servers. Wich I fixed fairly easy by doing this:  Go to: Steam\\steamapps\\common\\SteamCabal Right click: cabal.exe Press: Run is Administrator Then add a shortcut to your desktop and you are good to go.  The music is one of the PROS in this game.  The thing I realy hate about the chat is that there are 3th party sites (bots) Who are spamming the General Chat like crazy ... But you can disable the General Chat in Options &gt; Chat  I hope I helped some people out and that people are not realy looking for all my miss spelled text xD  Greetings, Mambo",
            "review_score": "1"
        },
        {
            "review_text": "I think i lost the connection with my social life after the re-launch of Cabal Online.The game is smooth and events are cool.But only problem i found is excessive ping rates.Since everyone is farmin' for lv atm its not that much of a problem but in weeks,this problem gonna cause big ****s tho.Happy to see the game of my childhood brough back alive!",
            "review_score": "1"
        },
        {
            "review_text": "Play on the regular Server (EU) because it has alot more people. Fun game, but be prepared to grind out if you want to 'gitgud'",
            "review_score": "1"
        },
        {
            "review_text": " Don't get this, unless you've played it before. I'll tell you not to get this game because you'll just end up giving a negative review. Why am I recommending it? Cause I've played it back when It was actually popular and has a special place in my heart &lt;3   You now have to be premium in order to use warp points. Obviously money is all they care about now.",
            "review_score": "-1"
        },
        {
            "review_text": "i am really like this game but i got 1 problem. when i chat in game, nothing appears. i can't communicate with anyone. anyone have some problem with me ?",
            "review_score": "1"
        },
        {
            "review_text": "surprosingly, this game is still pretty damn close to how i remember it from back in the day. More user friendly with skills and such but basically the same. wish the other games i played from back then didnt change....",
            "review_score": "1"
        },
        {
            "review_text": "surprosingly, this game is still pretty damn close to how i remember it from back in the day. More user friendly with skills and such but basically the same. wish the other games i played from back then didnt change....",
            "review_score": "1"
        }
    ]
}