{
    "app_id": 253900,
    "name": "Knights and Merchants",
    "release_date": "2013-10-14",
    "developer": [
        "Topware Interactive"
    ],
    "publisher": [
        "Topware Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Medieval",
        "City Builder"
    ],
    "achievements": 0,
    "positive_ratings": 2341,
    "negative_ratings": 515,
    "price": 4.99,
    "description": "KNIGHTS and MERCHANTS recreates the era of the Middle Ages. Apart from the purely fictitious geography of our world, all game elements and scenes are based on the Anglo-Saxon period, 1200 A.D. And we haven't used imaginary elements like fabled creatures, either. The player takes on the role of an ordinary captain in the Palace Guard.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/253900/header.jpg?t=1544799539",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel or AMD Singlecore CPU Memory: 512 MB RAM Graphics: 3D graphics card with DirectX 9.0c support DirectX: Version 9.0c Network: Broadband Internet connection Storage: 500 MB available space Sound Card: DirectX compatible Stereo Soundcard Additional Notes: Keyboard, Mouse",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel or AMD Singlecore CPU Memory: 1 GB RAM Graphics: 3D graphics card with DirectX 9.0c support DirectX: Version 9.0c Network: Broadband Internet connection Storage: 500 MB available space Sound Card: DirectX compatible Stereo Soundcard Additional Notes: Keyboard, Mouse",
    "reviews": [
        {
            "review_text": "Back in 1998 I spent a lot of hours playing this marvelous game. The city-building part is fun and easy, but battles are even more fun and, despite game's simplistic looks, challenging (at least sometimes). It's hard to recommend this 15 years old game with something like 'Settlers 7' released, but it still could deliver a lot of fun if you don't mind outdated graphics.",
            "review_score": "1"
        },
        {
            "review_text": "The first thing that stands out in this old game is the excellent detailed unit animation, the graphics are quite good too (for an old game like this), ambient life is very nice (like crabs on the beach and foxes scampering through the forest), landscapes are nicely rendered, music is suitably medieval and the sound effects are very good. It's one of those classic games that is difficult to learn, but once you learn how to play it, you will enjoy it immensely.        What's going on in my mind when I play this game.&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "All my laborers died from hunger as they were building a bakery. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Game of my Chidhood(first game in my life also xD) &lt;3 was played this around 8 years.So many differently modern strategys we have right now,but still i can recommend this game for everyone who love this games style,u will like it :3",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this game as a kid and I remember always going back to it, because it's so much fun. Honestly, the best part of the game is building your village and I have to admit that I don't play it for the battles; they're pretty much a necessary evil, haha. It's fun to keep trying new layouts and road systems. I can spend hours just building a village and then start over once I'm done.  The mechanics are great, just plan your buildings and roads and your serfs and workers do all the work. Try not to build too many things at once though, because you will make it go slower accidentally. The workers have a pre-set priority. For example, if a building needs resources the serfs will go there first, and once the building has resources, the workers will go there to build it. This means that roads won't be finished (the workers abandon it to do the buildings first) and some workers might even die while waiting for stones. So, try to finish one thing before you start the next project.  The music gets stuck in your head, I catch myself humming the themes while at work. Crazy. Very fun to play, very nostalgic. The graphics may not be anything fancy, the game surely makes up for it. I definitely recommend this to anyone who's on the verge of buying it. And be honest, for this price, what do you have to lose?",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for free from a website, thinking that it'd be another lame game for the website's promotion. I was wrong.  The game in itself is wonderful, but there's a mod on the Internet called 'KaM Remake' that adds multiplayer to this game. It makes the game 10 times better. And it's free.  Coming back to the game, I loved it, and while it might not be worth the $7 price for an average gamer, I personally think it is. 9/10, because the graphics hurt my eyes a little; but then, how much do you expect from a $7 game from 2001?",
            "review_score": "1"
        },
        {
            "review_text": "This game brings back memories - Thank you Steam for finding it. This game has a great compilation of RTS, city building and resource management in a mid-evil atmosphere. Someone needs to remake this game.",
            "review_score": "1"
        },
        {
            "review_text": "Seeing ♥♥♥♥♥♥♥♥ serf starved to death while he was carrying sausages is priceless 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Knights and Merchants. The revolution is coming. A prince had take overthe kingdom, and you will have to conquest it and liberate your people.  When you try to know why this game hasn't the recognition it deserve, you will find that he was launch at the same time as Age of Empire. This is the reason why the big marketing machine had shadowed one of the biggest strategy game of all time : Knights and Merchants.  I'm a total fan of the game, trying to create every town with the right urban organisation, avoiding starving and creating the best scheme for wining. Each level is original, and you have to make every time a new strategy : Enhance you food supply, securise raw material, make warrior as fast as possible to support your allies.  As an old game, there are some bugs, but guess wgat, they are more funny than anything else : Ennemy's Ghost Town, Ennemy do not feed it's soldier sometime and makes it easy to win. Those type of bugs can happen 1 time on 99.  But this game is one of the best strategic game ever.  I recommed it if you love strategy games and if you have the time to play it. It can take between 15 minutes and 5 hours to beat a level. Yes, you read it, 5 HOURS, and it's worth it, looking at you army detroying the ennemy building. A great satisfaction   20/20.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my, this game is still so much fun! It's amazing to be able to play this game again like I did as a kid. I'm glad it was made available on Steam!  Can be really relaxing, challenging and exciting at the same time. A classic game worth spending time on.",
            "review_score": "1"
        },
        {
            "review_text": "6.6/10 - A steal for the price  This game has aged but it still is really fun. If you still play older games you will really enjoy this title. There is alot to this game and took me some time to get better, but once you get the hang of it. Fun.  Games on sale usually for less than $1. Totally worth it!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome that this game is now available on Steam.  This is an oldskool RTS that has many features that are still lacking in modern games and it's a good example of a game with enormous detail and a huge economic simulation besides the ability to fight fights that feel like they matter.  The Steam version has two full campains included wich I believe used to be sold seperately as two games.  Sadly it is showing it's age a little because of these points:  - No widescreen support, i.e., black borders on most monitors  - Slightly unstable (my play session crashed after two hours)  Still, it's an absolute must-have if you like RTS games!",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a game that i first played as a child, this was my first ever game. Back then i loved it. I still do now. This game has everything an RTS should, although it's old, it's still a great game, it really is a big shame companies don't make games like that anymore.   For those looking for some multiplayer acton there's the remake which adds that, plus plenty of new maps and improves the AI as much as the source code allows it.  If you're looking for a real good RTS, then this is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "Fun like old time, but still like old time.  Animations are just fine, game looks cute, game pace is for people who can wait. BOTs are stupid, quests are hard enough for hardcore players. This game could take hundreds of hours to complete.  Recommend if you are hardcore simulation player.",
            "review_score": "1"
        },
        {
            "review_text": "i realy enjoy this game ",
            "review_score": "1"
        },
        {
            "review_text": "Just like in my childhood",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game , reminds me of first settlers game :P",
            "review_score": "1"
        },
        {
            "review_text": "This game is clearly labeled as the peasents rebellion but it doesnt have any of the content from the peasents rebellion simpy the origional game content am i missing something?",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Brings back the old times :)",
            "review_score": "1"
        },
        {
            "review_text": "I loved playing this game as a kid... Even though i would only go throught the tutorial because i was afaid to be attacked. Now I love it even more. It is abit slow going but a lot of fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is clearly labeled as the peasents rebellion but it doesnt have any of the content from the peasents rebellion simpy the origional game content am i missing something?",
            "review_score": "1"
        },
        {
            "review_text": "so awesome good old game",
            "review_score": "1"
        },
        {
            "review_text": "nice old school game. build an army out of nothing. make wood, make planks and build a building of it! love it! need a new version of this one ;-) 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is in my childhood.",
            "review_score": "1"
        },
        {
            "review_text": "Game crashes about once an hour, so be sure you save your game a lot. Its very old school, don't buy it till you see some videos.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever - Remember playing this as a kid :)",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece of strategy games!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favs old strategy games, along with aoe2. On most game you are building a sustainable economy,then you build an army, then you fight the enemy and destroy their town. Pros Great music and sound effect for the time it was release. I still like hearing the sound effect of the townpeople working. Economic system that works and makes sense. Combat is balance because there is no overly powerful unit that doesnt have a counter to it. Cons Towers that use rock instead of archers and 1 hit ko. Singleplayer ai starts with big armies and developed towns. So if you are not ready when they attacked you have to restart and plan your town growth again. SERFS walking on the road. You can only have 1 person on a road at any time except when a person switch road with another. So if you have big army of serfs, they'll eventually slow down the economy cause they will be bumping into each other.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy game. This is something like father of strategy games. Very old and very good. Shame we didnt see KaM2 or something like that.",
            "review_score": "1"
        },
        {
            "review_text": "In my childhood, I couldn't get past level 5 of the campaign. Today, I finally passed it. Now I'll wait another 12 years. Maybe then I'll be able to pass level 6.  11/10 would get screwed by bad micromanagement again.",
            "review_score": "1"
        },
        {
            "review_text": "Would definitely reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Right in my childhood!  The game that i spend most of my time when i was a kid.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just crap but its funny and has the best graphics ever!",
            "review_score": "1"
        },
        {
            "review_text": "How I can play online versus? Help me",
            "review_score": "1"
        },
        {
            "review_text": "Amazing old school game, I recommend playing it and downloading the remake and play the game in 1920x1080 with a couple of good tweaks. ",
            "review_score": "1"
        },
        {
            "review_text": "breaks too much not very stable wineskin.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it 4 days ago for normal price, now its for 0,90 €   11/10 would rage again.",
            "review_score": "1"
        },
        {
            "review_text": "Epic game. I'm so happy to play this in HD mode.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't so bad, It's like a Village Simulator. It's a good time killer and great background music. 6/10",
            "review_score": "1"
        },
        {
            "review_text": " A good game that is a challenge, nice being set in A.D and the gameplay is pretty good ",
            "review_score": "1"
        },
        {
            "review_text": "Old school. nice....",
            "review_score": "1"
        },
        {
            "review_text": "At first I was disgusted by this game. Absolutely repulsed.  The reason? I didn't realize this was made in 1988. Playing this back then, before Age of Empires, before RTS was even a thing would of been incredible.  I can't recommend anyone buy this game, it's so dated it's ridiculous. I got it in a $3 bundle. I saw the title and nearly fell off my chair laughing, along with some other games like 'East India Trading Company' (LOL).  Anyway, this looks like it'd be a nostalgia trip for some. It is surprisingly complex and has a nice atmosphere unadulterated by the modern standards.  Can't recommend it, but the fact that it was made in 1988 puts me in a position where I have to. For that year, this is ahead of its time.",
            "review_score": "1"
        },
        {
            "review_text": "  An educational game for the entire family.",
            "review_score": "1"
        },
        {
            "review_text": "It looks old as hell, but I never cared. I have played games that were older. Overall, I kinda like this, considering that a guy sold me a code for this at the cost of 3 ref in TF2. Reccomended for the nostalgic.",
            "review_score": "1"
        },
        {
            "review_text": "It is a nice classic game, actually, that has some really good management strategy to make. You have to buld a lot of constructions essential for your empire. You also have to 'build' specific units, like a baker, so they can manage these buildings. This simple fact is pretty nice, actually, seing the units doing their job.  The units also have to eat. A nice factor, but can be a bit irritating sometimes by a simple fact. This game is pretty slow. Your units move at a pace not really good and they are kinda dumb, getting a bit stuck sometimes. They just simply fail to be quicker.  This is most the constructor and the serf unit, specially the lattest, which can be pretty dumb. Also, the food goes to your units one by one. Bread by bread. I kinda get it that it must be necessary in a latter state of the game, so you can get the gist of what is happening in the game, but at the first stages it is pretty bad.  But the game is cool, it actually looks cool also, for a cheapier price it may be a pretty good game to buy and immerse yourself into for a time.",
            "review_score": "1"
        },
        {
            "review_text": "There is not much to say about this old GEM,  I love the cute animations and the economy chains. The enemys can still be quite challanging but are not overpowered.Combat and management are good working mechanics. It will allways stay in a special place of my heart as I have played it in the past for way more hours than Steam knows... ;) Thoroughly recommend to try it, if you like old/near historical games in a medival setting.",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop playing this game. Though it does have issues on higher res, this game is a legend.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best games around.",
            "review_score": "1"
        },
        {
            "review_text": "A classic strategy game that I bought years ago and now on steam. Its beautiful soundtracks capture the medieval feel of the game(though why the old soundtracks were replaced is beyond me). You have to boost your ecomony in order to muster your forces and even then u still have to supply them with food.   There is a simile regarding this in-game mechanic that reflects real-life. 'Any fool can raise an army, but when feeding time comes around you start to worry if you don't have enough food'.",
            "review_score": "1"
        },
        {
            "review_text": "old classic RTS on which I grew up",
            "review_score": "1"
        },
        {
            "review_text": "( ◕‿◕)",
            "review_score": "1"
        },
        {
            "review_text": "Crashes frequently on mac, game is not optimized for current mac/windows. Not running completely smoothly, these are things that are essential to any game and definitely needs fixing",
            "review_score": "-1"
        },
        {
            "review_text": "It was great in it's time, but after having a taste of all the current games like this have to offer, Knights and Merchants is a lackluster experience at best. The only way this game could become remotely playable is with stronger nostalgia goggles than I have. If you want to relive the fun of the genre's early days that's great, but I couldn't bring myself to play for much longer than this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolutely horrendous. I really want to like it, but frankly, there's nothing to like. The game has two aspects: townbuilding and combat. Ultimately, though, it's all about combat; the townbuilding is just there to facilitate your armies.  That's unfortunate, because the combat is terrible, and here's why: - Controls are clunky.  - Pathfinding is abysmal - Units will barely move in formation - Archers will only fire if the enemy is coming from a certain direction - Units can move off the map, killing them - Bad pathfinding and inconsiderate level design mean that this will happen repeatedly! - Units get hungry (which is pretty cool), but when you supply a troop the hungry unitss aren't prioritised, so they starve to death while their well-fed friends are getting stuffed with sausages.  The list goes on. All this is just from the first level! In fact, combat is so terrible I had to restart the combat tutorial at least four times to not get slaughtered.  If you like townbuiling with a little bit of combat, try Caesar or CivCity: Rome; if you like the peasant-and-pike combat, with a bit of town management on the side, play Stronghold. Either way, save yourself the ragequit and don't buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "I remembered this game as a kid and not being able to figure out how to play it. I tried to play it like an RTS but really its more a sim. Its not a very fun one. Everything is very very slow and the tutorials aren't great at explaining much about how the econmy works and it appears to be glitched with people standing arround or building not working when they clearly have wht they need to get the job done. the combat should feel deep and very strategic but your units are sluggish and trip each other up making positioning an utter nightmare that can quickly cause you to lose instantly. I bought it for less than a dollar and I still feel cheated. Novel idea to combine the city sim and RTS genres, but bith sides of game are just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "The tutorial just throws you in and says 'Build a library.' So it took me three tries to figure that out. Couldn't understand the combat, thought the game would be like Age of Empires 2. If refunds were a thing on Steam I would want my 90 cents back so I could find a different thing to buy like DLC for one of my games.",
            "review_score": "-1"
        },
        {
            "review_text": "no......Just no.. this game ;/",
            "review_score": "-1"
        },
        {
            "review_text": "The tutorial is careless. The game has so many flaws, its hard to pick one to start with.  After one hour, the game froze/crashed. Troops have to be brought food, one soldier at a time. You can't set a priority to which project is to be completed first. The music is good, but forgetable.  Overall: 2/10 This game seems more of a Junior High School project gone wild, rather than a real game.",
            "review_score": "-1"
        },
        {
            "review_text": "Town building was frustrating, battle was worse. No way to select groups of units and make them attack at the same time. Good luck trying to get them to do anything you want. Couldn't get past the battle tutorial. This game was less than one dollar and I spent too much. Feels like it's from 1990 Sierra or maybe the NES.",
            "review_score": "-1"
        },
        {
            "review_text": "I understand many people like this game because it brings back childhood memories, and I totally respect that. However, since I don't share that emotional bond, I can't honestly give a positive review. It's just not enough for me, even for a strategy game from the 1990 and somethings. The gameplay is too clunky, the soundtrack is worse than horrible, and the graphics... well I could give it a break there, considering its age, but that isn't enough for the price they ask.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphis is not to my liking",
            "review_score": "-1"
        },
        {
            "review_text": "︻╦╤─ ( •_•) !",
            "review_score": "-1"
        },
        {
            "review_text": "This is basicly Settlers 2, but less nostalic and less fun.  Only buy it if you have an unappropiate excitment for this type of old school game.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad settlers clone. Play the original instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Playing this game is a good way to cure thine nostalgia for ye olde school games. Painfully slow, pointless, repetitive and nowhere near the brilliance of the old Warcraft. The combat section is especially poorly done, The words 'strategy' and 'tactics' are simply meaningless in this game, never mind what the manual claims. More appropriate words would be chaos and stupidity. Also, you have to constantly feed your troops, one at a time, so feel free to add the words 'Chow Time' which is what your troops do 80% of the time.   ",
            "review_score": "-1"
        },
        {
            "review_text": "It bacame available for Mac, so I though I would give it ago. It might be old, but even with that in mind, I felt uncomfortable playing it. The tutorial offered no tuition, and I couldent figure it out. In my head I was comparing to Age of Empire or Settlers, but it was not grabbing my attention like them games did. I gave up pretty quick, there are far better ones to play, old or new.",
            "review_score": "-1"
        },
        {
            "review_text": "So after playing a couple of hours it is time to put down some thoughts about this game.   The main reason i purchased this game on Steam is for nostalgia reasons as i played K &amp; M back in the 'good' old days.  Right from the start i unfortunately have to say that i do not recommend this games except maybe for nostalgia reasons.   Here`s why:  In a nutshell the games does not hold up to modern standards or even the standards of other economy-focussed strategy games (Anno series or the settlers IV to name examples).   Singleplayer: The game comes packaged with a campaign about a kingdom in peril which the player has to save. The story is decently told and the missions are relatively varied in terms of startup, objectives and focus changes between battles and town building. My main issues concern the gameplay itself. Some of these issues do play a role in multiplayer as well.  First of all every time a player starts a SP or MP match from scratch and has to build a town he is only allowed to build 1 building in the beginning. As soon as that building is finished another building is unlocked, followed by another upon completion. In itself i don`t mind a progression system however this design decision leads to immediate boredom as it takes several minutes to construct the first building and the player can do nothing but watch. There is nothing else to do.... only after the 3rd building is constructed several more are unlocked and the game actually starts.  My next issue concerns the actual construction of the buildings. All buildings require a road connection so building material can be brought to the site as well as the transportation of goods etc. after the building is constructed. In theory this is a good idea. However there is now way to prioritize buildings so the player is forced to wait for the more important building to be finished before ordering the next one. This problem is worsened by the fact that the Laborers (may also be referred to as builders) always prioritize roads. So if you have a finished road and all materials present at a building site but are constructing a road on the other side of the town your laborers will first move to the other side to finish the road. Again this means that the player is forced to wait as prioritizing buildings is impossible.   Furthermore your town is unprotected untill the barracks are constructed and recruits have been trained. Again this is not too bad. However if your opponent is quicker and attacks with even 1 soldier there is nothing you can do as he can basically prevent you from building a barracks by killing off the builders. There is no way your people are going to be fast enough once you spot the enemy soldier. Regarding the defensibility i prefer the way Settlers IV handled it. That games used a tower system which made the defender a bit stronger than the attacker. That way it is impossible to be overrun by one unit.   The last issue i can think of is that players cannot prioritize which material or goods should be transported first.   Multiplayer: K &amp; M on steam is playable in two modes: HD and 'normal'. The HD mode does not support multiplayer hence this section will refer to the standard version.  The multiplayer has a variety of maps as well as two modes (Battle or build a town) in which the objective is to defeat the enemy by destroying their town and/or troops and is playable by up to 6 players.  However the multiplayer is close to being unplayable as it is prone to desynchronisation. Up till now every multiplayer match i played desynced and even worse the game doesn`t notify the players when the match is desynchronised. This leads to much time being wasted as players are unable to see or interact with the soldiers of the other player.   In summary: A lack of control, initial boredom when starting a match some poor design decisions, vulnerability and multiplayer desynchronisation issues are the reasons why i cannot recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "So after playing a couple of hours it is time to put down some thoughts about this game.   The main reason i purchased this game on Steam is for nostalgia reasons as i played K &amp; M back in the 'good' old days.  Right from the start i unfortunately have to say that i do not recommend this games except maybe for nostalgia reasons.   Here`s why:  In a nutshell the games does not hold up to modern standards or even the standards of other economy-focussed strategy games (Anno series or the settlers IV to name examples).   Singleplayer: The game comes packaged with a campaign about a kingdom in peril which the player has to save. The story is decently told and the missions are relatively varied in terms of startup, objectives and focus changes between battles and town building. My main issues concern the gameplay itself. Some of these issues do play a role in multiplayer as well.  First of all every time a player starts a SP or MP match from scratch and has to build a town he is only allowed to build 1 building in the beginning. As soon as that building is finished another building is unlocked, followed by another upon completion. In itself i don`t mind a progression system however this design decision leads to immediate boredom as it takes several minutes to construct the first building and the player can do nothing but watch. There is nothing else to do.... only after the 3rd building is constructed several more are unlocked and the game actually starts.  My next issue concerns the actual construction of the buildings. All buildings require a road connection so building material can be brought to the site as well as the transportation of goods etc. after the building is constructed. In theory this is a good idea. However there is now way to prioritize buildings so the player is forced to wait for the more important building to be finished before ordering the next one. This problem is worsened by the fact that the Laborers (may also be referred to as builders) always prioritize roads. So if you have a finished road and all materials present at a building site but are constructing a road on the other side of the town your laborers will first move to the other side to finish the road. Again this means that the player is forced to wait as prioritizing buildings is impossible.   Furthermore your town is unprotected untill the barracks are constructed and recruits have been trained. Again this is not too bad. However if your opponent is quicker and attacks with even 1 soldier there is nothing you can do as he can basically prevent you from building a barracks by killing off the builders. There is no way your people are going to be fast enough once you spot the enemy soldier. Regarding the defensibility i prefer the way Settlers IV handled it. That games used a tower system which made the defender a bit stronger than the attacker. That way it is impossible to be overrun by one unit.   The last issue i can think of is that players cannot prioritize which material or goods should be transported first.   Multiplayer: K &amp; M on steam is playable in two modes: HD and 'normal'. The HD mode does not support multiplayer hence this section will refer to the standard version.  The multiplayer has a variety of maps as well as two modes (Battle or build a town) in which the objective is to defeat the enemy by destroying their town and/or troops and is playable by up to 6 players.  However the multiplayer is close to being unplayable as it is prone to desynchronisation. Up till now every multiplayer match i played desynced and even worse the game doesn`t notify the players when the match is desynchronised. This leads to much time being wasted as players are unable to see or interact with the soldiers of the other player.   In summary: A lack of control, initial boredom when starting a match some poor design decisions, vulnerability and multiplayer desynchronisation issues are the reasons why i cannot recommend this game.",
            "review_score": "-1"
        }
    ]
}