{
    "app_id": 253980,
    "name": "Enclave",
    "release_date": "2013-10-04",
    "developer": [
        "Starbreeze"
    ],
    "publisher": [
        "Topware Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 4076,
    "negative_ratings": 1139,
    "price": 3.99,
    "description": "Experience incredibly atmospheric and intense medieval combat action! Go ahead and enter a new world, the award-winning world of ENCLAVE!The people of Light and Darkness are divided by a bottomless rift that split the earth many millennia ago.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/253980/header.jpg?t=1542546630",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: Intel or AMD Single Core CPU Memory: 1 GB RAM Graphics: with TnL support and 128 MB RAM DirectX: Version 9.0c Storage: 5 GB available space Sound Card: required Additional Notes: Keyboard, Mouse",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: Intel or AMD Multi-Core CPU with 2.0 GHz Memory: 2 GB RAM Graphics: with Shader 2.0 support and 256 MB RAM DirectX: Version 9.0c Storage: 5 GB available space Sound Card: required Additional Notes: Keyboard, Mouse",
    "reviews": [
        {
            "review_text": "When you start this game, it opens a web browser and brings you to the Steam page for Raven's Cry. They're advertising for another Topware game by employing pop-up advertising.  Yeah, I'm downvoting this game for this move, and if I ever get Raven's Cry in a bundle, I'm downvoting that as well.  You've soured my interest in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Opens browser on it's own in the background, supporting game developer's new game.  WTF learn to advertise properly.  Freaks people out.",
            "review_score": "-1"
        },
        {
            "review_text": "  Enclave is fun with almost the setting of The Elder Scrolls IV: Oblivion. But please, this game was released long time, 2003. Don't expect too much from this game if you're playing it now.",
            "review_score": "1"
        },
        {
            "review_text": "A great game,feels very nostalgic and is very addicting at first. It's got a good storyline and fairly interesting lore,and exploring feels very rewarding at some times. There's not much character progression though,I've pretty much only used the knight as far as I've played. But the fact that you just unlock a character and buy gear for it, and then get to jump straight into the game is very nice however. The game is very challenging at some times,even in 'easy' difficulty, but thanks to that,it just makes the game more interesting and more fun.  Definitly recommended if you like games from for example the Elder Scrolls franchise. ;)",
            "review_score": "1"
        },
        {
            "review_text": "  This game is PRETTY good. Its an action rpg game. in which you kill monsters dungeon after dungeon. If you like dungeon hunter games then you'll love this game. Also if you wanna play this game in first person mode press 'F' or 'G'",
            "review_score": "1"
        },
        {
            "review_text": "I went in the game with no expectations at all and after lauching it I actually was pleasantly surprisied how similar it looked and fellt like my all time favorites action rpgs.  As much as I tried to enjoy this game, it's just plain broken.  I haven't seen a game this bugged in my life and I've played all bethesda games and AC Unity.  If you move your mouse too fast in this game it completely freaks out and it's very hard not to do so. Your character begins to move at mach 5 in a random direction and the camera can't keep up with that. I tried to endure this by moving the mouse as slow as possible but in the third mission, where you had to escort a merchant it was imposible for me to do so because I allways fell from the rooftops due to the mach 5 bug.  I tried to use the second class 'the huntress' but the ranged combat is just a complete joke.  It was completely random if I'd hit or not regardless where I aimed at or if the radical was green or red... and the most stupid thing about it is that there's a headshot multiplier and without it you don't deal nearly enough damage to kill the lowest of the enemies.  The enemies bug a lot aswell. Sometimes they just stand there and do absolutley nothing even when you hit them and sometimes they rund against you and press you INTO a wall where you get stuck and have to leave the game.  Every minute of playing this game I found another hand full of game breaking bugs.  I bought this for 0,64euro so it's not a big loss but don't buy this ♥♥♥♥ for 5 euro... just don't.",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't care about the outdated graphic, this game is worth.",
            "review_score": "1"
        },
        {
            "review_text": "Enclave is a 2002 action game from Starbreeze studios, the studio that went on to develop Chronicles of Riddick, The Darkness, and even Brothers: A Tale of Two Sons. The first few steps of a storied team.  Your first mistake will be to think that this is a roleplaying game in the slightest. It is not. Campaigns are divided into an odd 13 missions (14 for Light), and you begin each one by picking a class and loadout. Collecting gold within levels only increases the amount you can purchase with your persistent loadout.   This was originally intended as a multiplayer experience, perhaps even solely multiplayer, and it shows. From 'You are leaving the mission' messages when you stray too far from the intended game arena, to several 'Capture the Castle' missions left wholesale in the Dark Campaign.  For the most part this isn't actually a bad thing. It lends itself positively in some other areas - the variety of playstyles is appreciated, and the open-ended levels (whilst obviously meant to accommodate multiple players) make the levels infinitely more interesting than if they were linear. This has all the trappings of a typical Pandemic title in a single-player only package.  However, your second mistake is to buy this game, because it's terrible.   It's a real letdown that it is. The graphics are nice - much better than the screenshots let on, with some of the Dark Campaign levels being outright beautiful. The character models are comparable to Fable's in quality and art direction, both of which have aged very well, and even the OST is excellent, with battle music and environmental shifting out of each other seamlessly.  Though the VA is terrible (narrators aside), it's endearingly so, with exaggerated movements to make up for their lack of emoting that only early 3D titles could provide.   Enclave is terrible because it plays terrible.   Melee is a wet fish slapping affair, madly bashing the single attack button as you desperately play footsies in a sad display that makes QWOP look elegant, and ranged will see you backpeddle through entire levels as you fish for headshots (along with some hopelessly onesided shootouts against the lazer-sighted AI), In both cases, the hitboxes are completely shot, with both melee and ranged strikes regularly phasing through opponents. Even when you do connect, don't expect any hitstun as you continue dancing like a puppet held by a Parkinson's patient, because this is still a multiplayer title in all but name,  It's a disgrace that makes shovelware indie titles look good by comparison. You feel like you're compensating for lag that isn't there, trying to play by the rapidly shifting rules of this broken shoddy gameplay.   You shouldn't buy this game, and I don't recommend it. Not because of the 'aging graphics', or the pricetag, or even the single save file that gets annoying when your Dark Campaign overwrites the unlocks of your Light Campaign, but because even when compared to its contemporaries, it is an absolute nightmare to actually play.  Enclave, a sloppy start to a long career, belongs to the annals of time. You should move on to greener pastures.",
            "review_score": "-1"
        },
        {
            "review_text": "Voice acting may not be the best, but the difficulty in certain areas along with the great Hack n' Slash elements make up for it. I would rate it a solid 7/10!",
            "review_score": "1"
        },
        {
            "review_text": "  I have recieved this game from a friend who gave me a key they got for free. I like this game, its graphics is decent. Ive had my moments with this game, took me two days to find the entrance to a house to retrieve a key for some dude that claims 'Celinhiem needs this gold.' When I saw the stache of gold I stopped playing and thought to myself...im going to be rich, but now I relized it was not even enough to upgrade your armor to light armor. I progressed just to see a goblin with armor as thick as my roof, I shot it with my 'Dwarven Crossbow' just to see it jump out of a tower and slaughter me. Now im stuck on level five and have no life. It has a nice combat system I geuss. All you need to run it on max graphics is a stone-age 'Stonehenge 68 windows 64 .1 gb ram computer.' Overall, I love it...",
            "review_score": "1"
        },
        {
            "review_text": "Enclave is an old 2002 game which brought to steam in 2003, exactly 12 years before i played this game. The game itself is about medieval-style hack and slash game with a great graphic (from 2002 timeline perspective).  I tried to like this game but.... somehow i felt something missing from the game while playing it, something that should be exist in game, enjoyment.  I know it's subjective matter about enjoyment, but even an old game like Crash Team Racing can give me enjoyment while playing it better than this game.  So here are the pros and cons of the game :  Pros : + Great and enticing graphic from 2002 game + Nice UI game + Smooth even in low spec PC (why can't this implemented in any other games? Dev?) + Many weapons and armors choices  Cons : -  THE STORY , it's so bland and so obvious. Something that makes this game can't meet its expectation - Unresponsive control and stiff movements - Combat system and movement is so dull from 3D perspective. Should make it 2D side scrolling instead - Not too intelligent Artificial Intelligent (AI) - still too expensive for and old game (subjective but i got it free from friends lol)  Still, i can't recommend this game for who seeks a great story based hack-and-slash game (because the game itself is trying to be one). But i if you don't mind about the bland and so-so story, you can try this game.  4/10 because bland story and dull combat movement.",
            "review_score": "-1"
        },
        {
            "review_text": "fun little putter around (run &amp; gun) game.. nothing fancy (graphics are dated but not passable). lack of saves (save points) can be a bit frustrating.. but otherwise... for a couple bucks you can get a few hours of fun out of it.   would recommend it to people who like 'fantasy setting', dont have hang up about graphics, and just want something casual.",
            "review_score": "1"
        },
        {
            "review_text": "Great RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Worst.Game.EVER!",
            "review_score": "-1"
        },
        {
            "review_text": "What can I say? it didn't age well. The combat is pretty dull and repetitive by modern stadards, and both story and world/character designs are very, very cliche. While I imagine this would look pretty impressive back in 2003 or so, now it looks really lame and there's no reason to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "I never played this game back in the day, and I feel some sort of nostalgia off of it. Maybe because the game design is dated. Mainly due to feeling bare bones, and simple. I'm a few levels in 4, or 5. Each one has been the same so far (which I'm sure the whole game will be) fighting enemy's, running through linear levels, The game is dated. It's still very playable. If you're looking for something simple, and that doesn't require a lot of thought, or time I would recommend it. Especially on sale. I got it for 69 cents btw. The music is good, the graphics are pretty good.   The biggest thing wrong with this game is I think it can only run on one core. It seems if you have more than one core you have to go into the task manager while the game is running and choose 'set affinity' and deselect all cores except one. Otherwise the game will be unplayable, and run really fast with a slight bit of lag. I play it on Vista.  Like I said it's pretty much run through each level, kill enemy's, collect hidden gold, wash, and repeat until bored. The enemy's are the same. Finally got a lava type enemy to deviate away from the orc, hobgoblin thing, and magic witch......  The game is not bad, and it's definitely brings nothing to the table. Back in the day it may of been a cool hack and slash, but now it offers nothing. Only buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game set the standard at its time.   The game is filled with amazing puzzles and hidden gold to give you a massive buck for the dollar.   5 euro for this gem is a bargain.  Fun side-note; the goblins speak swedish.",
            "review_score": "1"
        },
        {
            "review_text": "A typical medieval hack &amp; slash.  Good for 2003: has a decent combat system and a good soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Enclave feels exactly like what is it: a RPG developped in the early 2000s in Germany. It's grim, unpolished, set in a typical uninspired dark fantasy world where everybody is required to have a ♥♥♥♥♥♥♥♥ and wear armor designed by anguished teenagers. The game is working but doesn't deliver any fun and lacks any sort of appeal to me.",
            "review_score": "-1"
        },
        {
            "review_text": "An amazing game, a bit old but is much better and is more entertaining than that one 60$ indie game which takes place in space and 18 quintillion planets.",
            "review_score": "1"
        },
        {
            "review_text": "i tried to like this game but even as cheap as it was it wasnt worth it just bad mechanics makes fighting not fun or even fun to look at",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those games you don't hear about too much, and no one's really sure about why. It's very good, awesome if you consider it's a decade old. Plus it has an enjoyable gameplay which you don't see around too often nowadays: you can't level up with abilities, but you can pump up your gear if you manage to catch all the gold hidden in the levels... loot!",
            "review_score": "1"
        },
        {
            "review_text": "Good looking game for even cheapest netbook.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know how to describe this one. It's a fantasy RPG wannabe, but it's actually a slow hack &amp; slash with boring gameplay and awful graphics. Okay, it's an old game, but I saw much better looking things back then... Do yourself a favor and don't waste time on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Not great. Definitely not great.",
            "review_score": "-1"
        },
        {
            "review_text": "Dark souls Easy mode",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game actually :) Easy to play Decent gameplay Graphics not the best but ok",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game. In some places, the graphics rival Skyrim! I would give it an 8/10 for minor bugs.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I never thought I would feel ripped off for a $0.59 game. This this is busted. My mouse doesn't work with the game, cursonr disappears. Settings refer to 'Controller' setup. Thought that may fix it. Nope. Plugged in a 360 controller and the game doesn't recognize it. Just busted. Can't play it as is...wasted money. ",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "the worst game i ever played. Do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "The lack of compass/map is refreshing - I actually have to work to find my way around. There are some dirty tricks, but you learn by death. Escort mission isn't as annoying as a lot of games, since Martin has the good sense to stand back and wait for you to kill all the things instead of getting in the way. The characters are meh. The graphics are okay. Not mind-blowing, by any means, but still fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredibly simple in the worst way. I think I made it about 5 minutes into the game before deciding... 'yup, it's a piece of ♥♥♥♥.'   No criticism to the people who created this but I honestly think you could've done better.",
            "review_score": "-1"
        },
        {
            "review_text": "The fighting could be better but still a really good game",
            "review_score": "1"
        },
        {
            "review_text": "its a fun rpg game and very addictive",
            "review_score": "1"
        },
        {
            "review_text": "the worst game i ever played. Do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game for 1,25 euro. dont underestimate its graphics. its old but it is like a diamond to play.",
            "review_score": "1"
        },
        {
            "review_text": "Bad combat bad story.",
            "review_score": "-1"
        },
        {
            "review_text": "Couldn't even climb the first ladder on the first level. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The adware has been gone for a long time now, so don't worry about that. Disregard anyone's negative review if it is soley based upon adware.   Okay now for the real review,  Game: Enclave Dev: StarBreeze Publisher: Topware  PROS:   Complex level design  2 campaigns (Light and Dark)  Multiple character choices (classes if you will)  Optional first person mode  Scripted Events  Multiple different kinds of enemies  Challenging but not too challenging (from 1-10 (1 being some rediculously easy kids game and 10 being DARKS SOULS)  I'd say about a 5)  Headshots insta-kill (enemies without helms, although most of those guys still die from a headshot) (you'd understand why this is a pro if you have played Skyrim)  Different damage for different body parts, hell, you can even hit them in the weapon if you get lucky.  Pricepoint (I mean seriously, only $5) ________________________________________________________________________________ MEHs:  Sounds  Music  Voice acting ________________________________________________________________________________ Cons:   Topware's main RPG problem, the story isn't great. Most of the plot points don't make sense, like WHY THE HECK AM I IN A FREAKING FIERY VOLCANO PLACE, WIELDING A DANG ICE BLADE... Just why.  No multiplayer. _________________________________________________________________________________  All in all, an fun game. GO GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "this game AWESOME!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Hi Everyone. I had this game on the original Xbox 10 years ago. It was awesome at that time, the only thing I ever wished was for mouse control to make the archers better and now we have it on Steam for PC!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing classic. Very fun fighting mechanics and well designed levels. The only thing lacking is the story but trust me, you'll be playing the game not as much for the story but just from the fun of completing each mission.",
            "review_score": "1"
        },
        {
            "review_text": "its a very good game so far the story is amazing love it!",
            "review_score": "1"
        },
        {
            "review_text": "One of these great games underated you should play at least 'cause of action/adventure gameplay basis it founded ! It's a well managed port of an 1st &amp; 3rd person action rpg xbox game... To be honest, this pc version has way better optimized graphics and controls than this last one. Kinda précious thing i could estimate while todays developers are not getting confortable with pc for mercantile and pessimistic reasons.   Graphics are clearly outdated from nowadays, lots of clipping, little bit tearing when speeding up camera movement, global cubic rendering but it also works like a charm. Textures are clean even if obsolete and non-HD designed. The game offers quite a few graphical settings very pleasant for a console port.  Generally, the good quality level design and architecture serves the medieval fantastic ambiance, environments are inspired and never get redundant. Levels stay linear but some of them are very wide-open ans submited to a labyrinthine path, so it's easy to walk round while you are looking tirelessly for a wood key that will bring you to the next room.  Gameplay is very interesting and fun. As you complete levels , the game gives ability to unlock and play characters with its own skills, and retribute you with coins you gather during the mission. Indeed, before each mission, a menu lets users spend budget in new weapons such as enchanted crossbows, tremendous magical swords, big boom bombs, powerful magical sticks, warrior armors,... Each of these new supplies has a certain cost and doing the cupid globetrotter roaming through the entire level will make you quickly one of the best bashing champions all over the enclave.  In game, controls are very reactive but aiming is a little bit buggy ; the shots given by your character don't reach ennemy each time you wanna touch its, in fact lots of shots with no damage are expected.The game has a very hard feeling mostly because of this part of the gameplay. It remains thought fairy difficult and at any moment, it become nonsense of frustration as demon's souls can be often.  Soundtrack is a classical variety of dark medieval themes and participates in making the ambiance immersive. However, it is repetitive to hear all the same themes for differents levels so It doesn't offer necessarily an audio consistency to each level that make this boring and annoying after hours. Vocal dubbing is correct, voices actors are convinient despite conviction missing for some of them.  Two campaigns : light and darkness... Very cute and original. Player start first with the light campaign which has a storyline better exploited, longer and devoided with narrative ellipses instead of dark campaign less rich lingering on crucial moments that can be rapidly sent over.  Now it's your turn to save people of the light and/or darkness... And kill them above all, that's the real purpose and leitmotiv of this outlet epic game !  ",
            "review_score": "1"
        },
        {
            "review_text": "Kinda Fun Game If You Have The Spare Time Not a Bad Game But there are Newer Maybe Even Free To Play RPGs Out there You could play Instead. I found this game fun But It gets Repetative and I stopped half way through the Evil Campaign and its Not the Kinda game Your Replay. Also Wish they could have expanded On the StoryLine I didnt Really Understand Why We All the Only ones Trying To stop the 'Darkness People' Neither Did the Dark Campaign Make Sense I think Your Some kind of Boutny Hunter?",
            "review_score": "1"
        },
        {
            "review_text": "Great Grapics and Gameplay for its age...I will say the voice acting is kinda crappy lol non the less 7/10 Gameplay so far.  ",
            "review_score": "1"
        },
        {
            "review_text": "game when gaming",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game i Liked This Game Alot GJ",
            "review_score": "1"
        },
        {
            "review_text": "One game which has a lot of similar games. A game which is about solving quests and beating orcs.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game if you have a low end pc or just want to play old games. Pretty advanced for the time it was launched, Though, the engine is starting to feel old, but hey, it IS old.",
            "review_score": "1"
        },
        {
            "review_text": "Weird controls, strange combat system but nice scenarios and classic campain of an rpg 6.4/10",
            "review_score": "1"
        },
        {
            "review_text": "Buggy game, personally i'd give it a 5/10, For the sole reason that the game for it's time is pretty decent, If it was 2004, I'd say it was horrible. The two years are distuinguished hugely. But like i said for it's time it's a really good game. It's... I'd like to say a learning curve because though it's a old game most of the people who play games nowadays don't realize how much more dependant as a player you need to be to finish a game. Games really really easy. But loses interest when the first bug hits you, which is pretty much the first 'quest' or 'Tutorial' seeming where it starts it ends up glitching. The scenario is great though. In the end overall i'd recommend buying it.   I bought this game because it was cheap at the time, An the results of buying it is what i expected from a older game. I didn't feel any nostalgia from it. But the art is pretty good for when it was made as i said. An overall it's a good game. I'll update this review if i ever decide to re-play the game, an have a less hypacritical oppinion. (Only played less then an hour an you get stuck due to a glitch on the first area not enough 'help' or information on playing the game)",
            "review_score": "1"
        },
        {
            "review_text": "One of the many little known, but amazing games from original Xbox.",
            "review_score": "1"
        },
        {
            "review_text": "Demon Souls 0.5",
            "review_score": "1"
        },
        {
            "review_text": "This was an old favorite on the Xbox classic, so I was excited to check out the PC port all these years later. It still plays exactly the same aside from the new checkpoint system and compatibility bugs which may cause random crashes during gameplay.  The graphics are a bit dated by this point, but for the time they were quite nice and I don't think they have aged that badly. Combat is a little gimped and awkward, but you can get a feel for it.  Recommended for fans of medieval fantasy hack n' slash.",
            "review_score": "1"
        },
        {
            "review_text": "  Great game.AI is really good.It looks nice. It is not open world,yeah it has great grapichs for a 2003 game but unlike Dagerfall it isn't an open world game.Tho it looks nicer.",
            "review_score": "1"
        },
        {
            "review_text": "It got a little bit something of Gothic but it's not the same Form like gothic but i like it !!",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "I got the game and tried to play on a Windows 8.1 system and it was way to fast. The movement of the character was impossible to control becuase of the speed. I tried all suggestions I read in the discussions and nothing worked to slow the game down.  I asked steam for a refund and it is processing. If you have a fast multi-core system the game could be to fast on your system.",
            "review_score": "-1"
        },
        {
            "review_text": "1. This is a 2003 game. 2. Looks good for its time. 3. Adware's been removed. 4. Clanky controls. 5. Frustrating ranged weapon aiming. 6. Camera shakes when sidestepping + moving camera. 7. 'Caused me slight vertigo. 8. Got this for free. 9. Story is so-so. 10. But I really can't tell. Only played for two to three hours.",
            "review_score": "1"
        },
        {
            "review_text": "no lags better graphics",
            "review_score": "1"
        },
        {
            "review_text": "not bad game and not good at the same time :-| i will give it thumb up :V 5/10  ",
            "review_score": "1"
        },
        {
            "review_text": "A nice game, considering it's age. The graphics look like overlord, almost everything looks like overlord. Even the enemy sounds, if you liked overlord, get this.",
            "review_score": "1"
        },
        {
            "review_text": "Can't find any good reason to write a hateful review, so I guess that it's not a bad game.",
            "review_score": "1"
        },
        {
            "review_text": "Played it all. It was alright. 7/10 Could use a longer story.",
            "review_score": "1"
        },
        {
            "review_text": "ⓩ ⓩ ⓩ",
            "review_score": "-1"
        },
        {
            "review_text": "Good Game Overral :3",
            "review_score": "1"
        },
        {
            "review_text": "A great game!",
            "review_score": "1"
        },
        {
            "review_text": "As far as RPG games, and RPG elements, this game gets it wrong. Buy only if goes on some super sale or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Please, don't play or buy this game it's so horible. It's that tipe of game when you close by Task Manager",
            "review_score": "-1"
        },
        {
            "review_text": "dota 2 with more ultimate abilities",
            "review_score": "1"
        },
        {
            "review_text": "awsome game game reminds me a bit of thief 2 but the graphics in this game a bit better still better than risen 2 or gothic 4 even if its not open world and i got it free :P",
            "review_score": "1"
        },
        {
            "review_text": "I played this game a lot of hours (before the release of steam), completing almost all scenarios with every type of character and collecting all the gold :)  A title that fascinated me back in 2004, simple to play, with a good atmosphere and fantastic music!  I recommend it to fans of the genre, looking for a new story and adventures can involve them, of course the graphics are old but is not to be despised. I'm still waiting for the second chapter, but I doubt it will come out really.   Back then it was a good game 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "You can't complain about something free.",
            "review_score": "1"
        },
        {
            "review_text": "Enclave is more than just a trip down memory lane; it's a nostalgic treat worth experiencing over and over. It's extremely short, but the light and dark campaigns are virtually separate games with their own unique atmospheres. I enjoyed it on Xbox, but the PC port is a thousand percent better.",
            "review_score": "1"
        },
        {
            "review_text": "Nope",
            "review_score": "-1"
        },
        {
            "review_text": "This is my best singleplayer Experience ive ever had by Far ... Amazing Engine loved the Weapons Every thing &lt;3  9.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "please there needs to be a second Enclave game I don't care if it's Indi just has to be good.",
            "review_score": "1"
        },
        {
            "review_text": "  Very nice game!",
            "review_score": "1"
        },
        {
            "review_text": "i got this game for dirt cheap and i thought it was worth that.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great little fun game to play when you hve free time.",
            "review_score": "1"
        },
        {
            "review_text": "It's OK.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why i have this game... ",
            "review_score": "1"
        },
        {
            "review_text": "First off! only problem i have seen from the game, was the starting up the game, but the 1 thing i found REALLY a problem...the damn story's don't match up...play light...ok then you go to play dark guess what it seems dark has a time traveling portal that made you kill the light hero in mission 2(dark) then out of no where...your mission 9(dark) runs in with mission 2(light) where did that come from? and how the HELL did dark lose? if they got time travel? in light makes little sense...and the fact that...in some missions...you seen the same things happen from light end up in dark when the maps meet?   other then that HOLY CRAP this is the 1 of the very few games that run smoother then hell! i have played torchlight 2...guess what little lag here little lag there...here epicly no lag 100% smooth play thru and best part is...i stayed up from 4PM to 9AM X_X beating both light and dark full gold! on my first play thru! :D it really kept my interest which not alot of games do these days! good work! hope i can see more of these smoothe games :3  thing i think would be alot better...if the ranged people wouldn't bust sooo freaking much damage! in hard mode...i mean only toon i could kill them was the...knight...and the berserk the whole game X_X the archers are the WORSE they 1 shot even on easy :P cuz i did a 2nd run from hard to easy to see the damage differents holy crap do archers still 1 shot after mission 8 seems the only way to kill them is by melee block with shield then CHARGE them and...it seems the nightmares need a HELL of a nerf...hardmode...any armor...=1shot seems they got an attack no heros can do which is 100% ignore armor and dark side gets the worse of it WAVES ON WAVE ON WAVES ON WAVES!! in the dream mission :P on the escape mission...i believe i killed around...140? or so...before i noticed they don't end... i think over all...PC is better then xbox with this game :P and i can't believe it took me 9.4hours to 100% gold/bonus mission in both games xD IN HARDMODE! anyways this game was AWESOME!! in my opinion :) also...hint hint...if you disable the auto open browsers on your computer the ads go away :P",
            "review_score": "1"
        },
        {
            "review_text": "It's okay. The gameplay is simple. The music is actually pretty good. Voice acting is good for a game like this  Story is okay, although sometimes a little bit unclear. It lags a bit sometimes though. The worst problem is the camera at some times.   Worth the price i would say",
            "review_score": "1"
        },
        {
            "review_text": "i am suprised that the graphics are this good in its time periode, yes, it has a story line that is just an excuse to kill other things, but i like killing things so that works for me, the combat is basic, just like 'q' to swith weps and mouse-1 to attack, this game is nothing to dark souls or skyrim but it is still actually a decent game, buy it cheap though, it isnt worth 5$ i can tell you that",
            "review_score": "1"
        },
        {
            "review_text": "Enclave is clearly a ported console game from a different generation. While it permits key mapping, it fails to allow the player to save where they want; instead, it comes in episodes that must be finished before one's place is saved.  The game fails to make much use of the mouse, relying largely on the mouse buttons to hit stuff and do things, while movement is keyboard based. The game has 'gold' scattered around each section, and keeps track of how much is available vs. how much the player has collected in some action game-esque scorekeeping.  The real annoyance remains the 'on-the-rails' style of play that Enclave delivers. It's pretty, it seems to have its heart in the right place, but it gives the player no freedom. One quest at a time, with marks for how much gold you collect, and then on to the next. You cannot even open a door until the necessary trigger event(s) have been completed.  To be honest, this is really not a game that I would call an RPG. Action, yes. Adventure, sure. But it lacks most of what makes a good RPG - including multiple active quests and ability to stray from the path. I didn't even see character building in the short time I spent in the Enclave world.  I had such high hopes for this game, but it is time to resume the search for a good RPG.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty neat game. Just wish it would stop crashing so I could finish it. Not too much of a loss for 50 cents.",
            "review_score": "1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "a million times the speed its meant to play at",
            "review_score": "-1"
        },
        {
            "review_text": "Steam says 'None of your friends have played this game recently. Tell them why they should.' Nah,they shouldn't. The voice acting is horrid. The game has some nice qualities,but still rather crappy. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Nice classic game",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games , I started to play when I was child ...This was my third game wich one I went throught.",
            "review_score": "1"
        },
        {
            "review_text": "Even though i got it for free, it is not good at all.  *You will find a better game made by a blind homeless man* - Jake 2013",
            "review_score": "-1"
        },
        {
            "review_text": "maybe it was a good game back in its time, but it just aged well. controls are cluncky, the hunter character it's unplayable, and everything seems kind of borin giving you no willing of playing it. I cannot recommend this, but someone could find it playable.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like Skyrim, but not dog crap",
            "review_score": "1"
        },
        {
            "review_text": "OmG!!!!.. Hell Boring game just played 0.3 hours and i found this game hell bore -_-",
            "review_score": "-1"
        },
        {
            "review_text": "If not for the horrible combat this would be a good game from 2003. But the combat has some of the worst hit detection I have ever seen in a game in my life. It does not matter if you can see your sword blade hitting the enemy. You wont hit it unless an enemy is directly in front of you, and I mean DIRECTLY in a very thin line hit box, and you are so close to it you are touching it. The combat is laughably bad anyway. Just really generic and has no substance at all. The combat is so laughably generic I kept laughing at how it just feels like the very baasic 0's and 1's binary code for an atari game. The ONE THING this game has going for it is that amazingly for a game from 2003 it has vsync and supports 1920x1080. Blows my mind a game that old supports that res unless it was updated since 2003. It also installed and played fine with no technical issues at all, unless you count the fact that the game sucks balls as a technical issue, which I do. If the game sucks so bad you can't stand to play it, that is a stand out technical issue.  3/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Was pretty awful, but it was 3 bucks. You get what you pay for. The gameplay was crud, I fell through a lot of stairs, or flew up them. Felt like the character floated. Didn't seem like there was much story, but that could just be because I couldn't get through more than 30 minutes with it.",
            "review_score": "-1"
        },
        {
            "review_text": "It is awesome but quit maintaining required.",
            "review_score": "-1"
        },
        {
            "review_text": "Not horrible, but poorly made. You get more characters as the game goes on that carry different gear, otherwise they are all the same. There is no leveling, just new gear. The new gear isn't always better, just more expenive. There's no stats on any of the gear, just guess. It is hard to hit targets, as they jump around like some kind of multi-player game. Your jump however is very limited and painful to get on a box or jump a hole that will kill you. Jumping looks very awkward, and is also required in every level of the game. The melee fighting sucks the most, just use a crossbow or a staff. The story is stupid, just skip that and play. You basically get thrown into fighting and collecting money, without teaching you how to do much. Traps will kill you, and appear without reason, so use your psycic ability(not real). There are checkpoints, costs money to revive, unless you haven't found one, then restart map. So it's a cheaply made game, bugs won't get fixed, it's too old. It's not worth more than $1, and only if you're really bored.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics are horrible and controls are buggy",
            "review_score": "-1"
        },
        {
            "review_text": "it needs an update everytime i look left or right character speeds up like they poked him from behind and some other bugs like closing occasionally",
            "review_score": "-1"
        },
        {
            "review_text": "★ ☆ ☆ ☆ ☆",
            "review_score": "1"
        },
        {
            "review_text": "  Very underrated Hack &amp; Slash",
            "review_score": "1"
        },
        {
            "review_text": "It is OK for a while and given the price; but, will crash at odds times and that is not OK even for 5 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "  This is an old game . So graphic quality is not better than new games. I think no need to buy, I got this game key from  dlh.net ",
            "review_score": "-1"
        },
        {
            "review_text": "There's a reason everyone got this game for free",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this ♥♥♥♥ unless from nostalgic reasons, I have never played this game before I bought it on steam:  Pros: + different classes + coins collectibles makes exploring worthwhile (but this applies only for some people) + relatively long gameplay (20+ hours I would say for most poeple, but I am doing all coins which sometimes require 3x - 4x restart because of cheap deaths - to collect all coins you must no die a single time) + changing enviroment (mission from mission)  Cons: - terrible camera, I have been in game for 5 minutes in 1st mission and already hated it - RPG? Where? Just get the best equipment and gogogo - actual combat, the worst meele combat I have chance to witnessed, the worst part of it - you are swinging your weapon against enemy and nothing happens unless you are very specifically turned towards your enemy, even though it looks like you should be hitting all enemies in radius of 90+ degrees (graphics) the reality is about from 30 - 40, for me the most frustrating part of this game - cheap deaths (applies for gold collectors only, fall into lava, pit etc., you just must restart whole level if you want 100% of gold coins) - AI - shooting with a crossbow/bow in this game is absolutely delightful (sarcasm) - AI jumps like mad (seriously you must see it to understand) and it is almost impossible, also stucks behind objects sometimes cant even follow you upstairs etc..  Result: Mediocre, but those frustrating parts I have written down (camera, combat system...) will follow you throughout this whole game therefore -&gt; not worth it (I have bought it for 0.99 Eur, so for this price it is decent)",
            "review_score": "-1"
        },
        {
            "review_text": "I have hardly played this game, but i honestly cant reccomend it. The only thing interesting about this game is the Menu. The gameplay is choppy the characters and voice acting is half baked. The music is decent, but it doesn't make me recommend it anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Finaly in this game carts! :D",
            "review_score": "1"
        },
        {
            "review_text": "Not really a lot to it, but considering you can get it for less than a dollar during sales, I'd say it's worth your time. A bit mindless, but the story is decent all things considered, the graphics have aged surprisingly well, and it's got no shortage of action. Decent game for mindless stress relief.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game a lot.",
            "review_score": "1"
        },
        {
            "review_text": "good game for those days...",
            "review_score": "1"
        },
        {
            "review_text": "great game. i dont care that the graphics are horrific, the gameplay is amazing and the storyline is good and it is just really i mean really fun to play! you should try it out.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good,but too expensive.If you wantt to play old and fun games,it's speshal for u=)",
            "review_score": "1"
        },
        {
            "review_text": "I like it it is a bit slow (need more action) but it is playeble ;-)",
            "review_score": "1"
        },
        {
            "review_text": "one if the most over looked games. it had so much replay value and not a bad story. you get to play as both good and evil both about 5 hours if you take your time. worth 4.99 even better when its .99 totaly worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Equal parts hack and slash, puzzles, and treasure hunting. Funny.",
            "review_score": "1"
        },
        {
            "review_text": "A game that is surprisingly enjoyable even though old with ugly old graphics. Not bad at all for a game I got for 50cents. If you don't mind ugly graphics and rather sub par combat you're likely to enjoy it.  Has a variety of characters that you can play each mission with though at first you only start with 1 character and get more as you progress. It's important to collect as much gold as possible as in between missions you use it to upgrade characters with better weapons and armour.  And there are two campaigns to play light and dark.  Swapping weapons is so slow. And blocking doesn't seem to work well.  Sure it's not perfect but I still find it fun and enjoyable. It's still an ok game, better than some triple A titles. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would Idle Again.",
            "review_score": "1"
        },
        {
            "review_text": "A good game from year 2003",
            "review_score": "1"
        },
        {
            "review_text": "Good game having fun time playing :D",
            "review_score": "1"
        },
        {
            "review_text": "If u dont care about old graphics you should play this game. U have 2 choice about campaign, light campaign and dark campaign And u have 12 different (6 light and 6 dark) class to play I think this game is very nice game :)  U can conquer a fortress with 2 ally orc xD 10/10  PS. When you finish game, it unlock 2 bonus (1 light, 1 dark) character.",
            "review_score": "1"
        },
        {
            "review_text": "There is a lot about this game that needs to be fixed. However, for what it is, it's a fun little game to play on the side. Gameplay is decent. Storyline, a bit cliche'. RPG element, could be improved. All in all, decent game with a fair price.",
            "review_score": "1"
        },
        {
            "review_text": "Game İs Really Cool And Beaty :D I Found A Speed Bug :D Really Funny :D",
            "review_score": "1"
        },
        {
            "review_text": "The Good: - Great visuals for a game released in 2002 - Good soundtrack (works well enough for the fantasy themes...)  The Bad: - The combat system is pure garbage. Really bad hit detection thrown in with cheap enemies who seem to strike masses of damage while you struggle to even land a decent blow.  - Enemy AI is crap (but it often helps me when they jump to their deaths...) - Storyline and voice acting is medicore.  - No RPG systems in place whatsoever. Purely gear based (which is not a bad thing), but I am not convinced on its overall execution, as the game's emphasis on combat just doesnt come across as fun.   The Verdict - A Polished Turd. Visuals and sound aside, I found little to actually enjoy from the gameplay. If you like this style of this game, go and play Risen, Gothic or Two Worlds instead... They are superior titles.    ",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun game, a lot like an early bata of The Elder Scrolls: Skyrim.",
            "review_score": "1"
        },
        {
            "review_text": "I have hardly played this game, but i honestly cant reccomend it. The only thing interesting about this game is the Menu. The gameplay is choppy the characters and voice acting is half baked. The music is decent, but it doesn't make me recommend it anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't really play the game with a 1000hz mouse since it quadruples your movement speed, but seems like a fun linear rpg. There are better timeless rpg's out there, so I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't played it for long but it seems decent so far. I was a bit worried reading some of the reviews before I bought it, but I haven't experienced the supposed 'adware' problem people are talking about. Graphics are better than I would have expected from a 2003 game (a bit better than Fable: Lost Chapters). So far the gameplay is moderately enjoyable, mechanics pretty easy, but not stupidly simplified. Can't say much about the story yet, but it does seem rather dumbed down lore-wise, and nothing too original in that respect.  I would recommend this game if it is on for a sale price (I paid C 0.76$) but when it goes back to 5$, you could probably find something better. But hey, I'm just a weird person who likes Two Worlds more than Dead Space. ",
            "review_score": "1"
        },
        {
            "review_text": "Really good game :D 10/10",
            "review_score": "1"
        },
        {
            "review_text": "What little i've played seems fun so far. The main reason i'm commenting though is because of all the people saying that this game opens their browser to advertise for another game. This has not happened to me. Maybe because i close my browser before playing games? Really not sure. But the game is good old hack'n'slash fun!",
            "review_score": "1"
        },
        {
            "review_text": "Nice got the badge",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game - but calling it a 'forgotten gem' or a masterpiece is certainly too much. It's just an average game which looks surprisingly good for it's time but plays equally surprisingly bad. If you do not have some sweet memory of playing it back in 2003, you probably won't enjoy it for long.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good and adictive game.",
            "review_score": "1"
        },
        {
            "review_text": "Ok so the graphis are a little dated. The gameplay is still fun and this is worth at least 2 play throughs 1 on the light side and one on the dark. I would say good and evil but the good guys are kinda jerks.",
            "review_score": "1"
        },
        {
            "review_text": "Basically one of my favourite games of all time. Today, the graphics are a bit outdated, but the music is still very awesome and you really get a sense of progression by finding gold. Also, no browser is being opened with me, so no issues there. The game doesn't auto set your graphics, so make sure to set everything to high :)",
            "review_score": "1"
        },
        {
            "review_text": "I was very pleasently surprised by this game. Having played all of the Dragon Age titles, Elder Scrolls Skyrim and other titles in this genre, Enclave still managed to keep it interesting through its plot telling and gameplay. Of course I can not compare it graphically to the above titles, however it does not dissapoint and still has a 'sharp' look. I believe this will be a welcome adition to your collection, specially if you are a fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, terribly ported.",
            "review_score": "-1"
        },
        {
            "review_text": "Perfect for a boring evening",
            "review_score": "1"
        },
        {
            "review_text": "A classic RPG, reminiscent of old school, late 90s-ish adventure games. It certainly has potential, given it's solid graphics, fairly difficult combat (and no checkpoints mid-level,) awesome music, and dual-campaign setup.  Unfortunately, it is still buggy; on a particular merchant escort mission, the guy didn't move a couple of times, and I can't proceed because of a game breaking crash that happens more often than not on the following level. (i5-4690k, GTX 970 G1 Gaming ed.)",
            "review_score": "-1"
        },
        {
            "review_text": "Old but great. You need alot of accuracy in this game and if you're going to try the hard mode, prepare to die alot.",
            "review_score": "1"
        },
        {
            "review_text": "I was playing the demo of this game when it was first released on PC. Then I thought it was a good game. Now, after i've completed it, and even after so many years, i think this game is amazing! Clever and interesting design, surprisingly smart enemies, distinctive player characters - overall feeling of the game - it is just so much more, than you expect. And then, there is the dark campaign... It exceeded my expectations in so many ways and i think it, definitely, deserves more recognition and positive feedback from the players. :enclaveskull:",
            "review_score": "1"
        }
    ]
}