{
    "app_id": 254060,
    "name": "KnightShift",
    "release_date": "2013-09-27",
    "developer": [
        "Reality Pump"
    ],
    "publisher": [
        "Topware Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Strategy",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 467,
    "negative_ratings": 316,
    "price": 4.99,
    "description": "Do you like Real Time Strategy? or are Role Playing Games your preference…Why not try both genres in one? … or even both separately? …In one game: KnightShift!In a mystical world beyond fantasy and imagination, where corruption and disaster go hand in hand, not all is as it seems.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/254060/header.jpg?t=1513761297",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: Intel/AMD Single Core CPU Memory: 512 MB RAM Graphics: 3D with TnL support and 128 MB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1500 MB available space Sound Card: DirectX compatible Additional Notes: Mouse and Keyboard",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Processor: Intel/AMD Single Core CPU with 2.0 GHz Memory: 1 GB RAM Graphics: Per-Pixel-Shader 2.0 support and 256 MB DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DirectX compatible Additional Notes: Mouse and Keyboard",
    "reviews": [
        {
            "review_text": "This game is bad...but that special kind of bad that makes it fun to play with some friends while drinking or something. It has decent controls but hilariously bad dialogue. the characters all sound like Microsoft Sam and the there were times where every single word in an NPC's speach would end in the suffix 'eth.' If I had to explain the story of this game I would just say 'thiseth iseth theeth adventureseth ofeth microsoft Prince John, Heeth goeseth arroundeth andeth killseth stuffeth.'",
            "review_score": "1"
        },
        {
            "review_text": "Good humor! It's a game for easy and relaxed playing! I am very surprised by its quality (not meant graphics ^^) for such a low price!",
            "review_score": "1"
        },
        {
            "review_text": "It's OK, not great but OK. Nice fun for every now and then once you got the hang of it (I never found a tutorial or 'how to play'). Graphics a re nice and the background music isn't that bad either.  Wouldn't buy it for full price, but if you can grab a good deal at a sale and need a filler for spare time you might consider this.",
            "review_score": "1"
        },
        {
            "review_text": "Its a basic and simplistic RTS with equipable equipment and leveling to alter unit stats. while this is a interesting concept the execution is fairly basic. however the minimal purchase price for this game makes this a resonable purchase",
            "review_score": "1"
        },
        {
            "review_text": "It's game of my childhood, simple friendly mix of strategy and RPG :)",
            "review_score": "1"
        },
        {
            "review_text": "  Good enough to get on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Knightshit",
            "review_score": "-1"
        },
        {
            "review_text": "I loved playing it when i was younger. ♥",
            "review_score": "1"
        },
        {
            "review_text": "  bad game why is it on steam? oh yeas, for ♥♥♥♥ing steam badges and achievements.. that why.",
            "review_score": "-1"
        },
        {
            "review_text": "  Average. The voice acting is laughable.",
            "review_score": "-1"
        },
        {
            "review_text": "I guess my opinion is a bit biased because I generally don't like these kinds of games, but I really did not enjoy this game at all",
            "review_score": "-1"
        },
        {
            "review_text": "'90's game, game doesn't start properly, especially if you set the settings to highest. Problems entering serial number... GGWP report. Sensitivity sucks. Cool intrduction video, a bit gay. Worst than Warcraft.",
            "review_score": "-1"
        },
        {
            "review_text": "Will not start on my computer and it has sufficient poor reviews that I don't consider it worth my time to get it running.",
            "review_score": "-1"
        },
        {
            "review_text": "Persenaly I dont like games like this thay are boring",
            "review_score": "-1"
        },
        {
            "review_text": "Avoid this game like it is the plague",
            "review_score": "-1"
        },
        {
            "review_text": "This has replaced plain sight as the worst purchase i have made on steam. impressive, i only paid 70 cents for it with a 90% off coupon. this game gets my bleugh out of 10 its not even the funny kind of bad",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game i played",
            "review_score": "-1"
        },
        {
            "review_text": "Even for only $.97 it wasn't quite worth it other than to teach me a lesson about getting what you pay for. I'm not against older games, and graphics aren't my top issue, but there is also no storyline to mention. Much better choices with more modern look and feel for very little more in price.",
            "review_score": "-1"
        },
        {
            "review_text": "I paid something like .75 cents for this game. I overpaid for this game by exactly .75 cents.",
            "review_score": "-1"
        },
        {
            "review_text": "its good but old",
            "review_score": "1"
        }
    ]
}