{
    "app_id": 254460,
    "name": "Obscure",
    "release_date": "2014-03-10",
    "developer": [
        "Hydravision Entertainment"
    ],
    "publisher": [
        "Mighty Rocket Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Horror",
        "Survival Horror",
        "Action"
    ],
    "achievements": 19,
    "positive_ratings": 685,
    "negative_ratings": 55,
    "price": 4.99,
    "description": "For some time now, Leafmore High School has been the setting for unexplained disappearances. In this survival horror game, you take control of a group of 5 American students. With your friends, you try to unravel the mysterious happenings at this unremarkable-looking school. The night will be long and survival not will not be easy...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/254460/header.jpg?t=1447358758",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III 1 GHz Memory: 256 MB RAM Graphics: DirectX 9.0c compatible 3D card DirectX: Version 9.0c Storage: 4 GB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Cooperative mode (2 players): gamepad required.",
    "recommended_requirements": "OS: Windows Seven Processor: Pentium IV 2 GHz Memory: 512 MB RAM Graphics: DirectX 9.0c compatible 3D card DirectX: Version 9.0c Storage: 4 GB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Cooperative mode (2 players): gamepad required.",
    "reviews": [
        {
            "review_text": "I first got my hands on Obscure back in 2004, on PS2. Was quite surprised to see it on Steam. It's one of the games which reserved a spot in my memory. I remember having a lot of fun playing it, and i got the same pleasure replaying it after 10 years.  Obscure is an old-school horror survival game which manages to entertain by offering a cheesy story, influenced by the Robert Rodriguez's 'The Faculty' movie. It uses the music from the movie and even contains a character based on it. Even though i heavily disliked the movie, Obscure succeeded in offering me a whole different perspective.  You have 5 students trying to escape their school, from an entire horde of monsters created by their Principal who was experimenting on students. You can choose to play for any of them, and at any time a second player can join the game for any other character, which doesn't force you to start a new game if you want to play local co-op with a friend. Each one of them has a different special ability like running faster, better healing, or picking locks skills. I loved especially the method of saving the game. You do it using a CD which you need to find in-game, and i consider it to be an important aspect in a survival game, so that one won't be able to save every 2 minutes since the amount of CD's you can find is limited. The outstanding soundtrack composed by Olivier Derivière, in this particular environment, creates a even creepier atmosphere. There are few types of monsters, and also limited types of weapons, but what makes it better is that except weapons there is something else that hurts monsters - light. So when you are in a room with windows, and got yourself cornered - you can always break some windows and let them know who the boss is, as for the rooms with no windows - one can combine any firearm with a flashlight. I didn't notice for the light of the flashlight to inflict any damage, but at least it keeps the monster at distance for a short period of time.  There are also some cons of course, but none which caused me any inconvenience. You can choose a resolution up to 1920x1080 but the game does not support widescreen so you'll just get a 4:3 aspect with black borders on the right and left side. Playing it with keyboard &amp; mouse is possible, but not entirely comfortably. At least i couldn't do it, so i just used a Xbox 360 controller which worked just great. Graphics are not the best, but also not awful, especially for a 10 years old game. I enjoyed Obscure very much, and would recommend it to anyone who likes old school survival games. Looking forward to play the second game. Hope i'll enjoy it as much as the first. Cheers ;)  * NOTE &gt; The game also includes all the Deluxe Edition content: Soundtrack, Artwork, Screenshots, Sketches...",
            "review_score": "1"
        },
        {
            "review_text": "An underrated survival horror game from the ps2 era. It has good co-op, perma-death, and the ability to put flashlights on your guns. It doesn't hurt that it's inspired by my favorite movie of all time, The Faculty. It's a little cheesy in the plot department, but it has some seriously creepy enemies and enviroments.  Pros local coop  Several jumpscares Amazing story Scarecity of ammo  5 characters to choose from Each character has a slight ability to help boss battle and ending Spooky scenery Weapon situations  Everyone can die  CONS AI Partner is bad No Online Co-Op permadeath on characters,adds to the challenge  character sometimes doesn't aim where you want",
            "review_score": "1"
        },
        {
            "review_text": "This is a game I would certainly reccomend, and it certainly has a different type of idea about the conflict. Most games have a zombie virus, or nuclear waste, but in this one, it has a type of plant. Again, I would reccomend it to anyone looking for a good third-person Horror game. It gets rather frustrating during the end though, and I caution all of those prone to stress production.",
            "review_score": "1"
        },
        {
            "review_text": "Obscure is a fantastic survival horror. It's an old game but still holds it own against a lot of the games in the genre today. Well worth the money especially if you can find it on sale. Replay value is also fantastic with extra mode and special weapons unlocked after the first run through.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Still a good local coop experience after all this year. Controls are a bit clumsy, but the setting works well an graphic can still be appreciated. Short game, you can have a couple good evenings with a friend with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Obscure is like a B horror movie, with all it's downsides and advantages, only that it's a game.  The advantage a good B movie has is the ability to turn something really dumb and forced into an enjoyable experience. Obscure is doing this 100%, the plot isn't there to tell a story, the plot is there to force characters into situations where they must fight monsters. By the way, the characters are basic high-school teens and they have zero character outside the stereotypes you can see in any american show/movie whatever which features high school life. Hell, they don't even talk to each other outside the usual 'WE WERE WORRYING ABOUT U GUYZ' or some ♥♥♥♥.  About the monsters, it's dumb, the concept of them being vulnerable to light is good, but the game has no explanation WHY ON EARTH ARE THEY VULNERABLE. Since the monsters (it's not a major spoiler, but it's a detail which isn't obvious, you decide)    aren't 'shadow' creatures, they are mutated persons for ♥♥♥♥'s sake. Why mutation causes them to hate light? Whatever   . So now that we have the grasp of what kinda feel Obscure has when you think about it, we can move on to how it feels when you don't. Just like a B movie should feel, you can laugh on the logic bumps and 'weird' execution or cringe on them. Mainly I was laughing, the whole game just screams 'don't take me seriously pls'.   Outside of that the gameplay was actually fine. The fighting could be a little bit more complicated, outside of the final boss you're just lighting and shooting at random creatures. The best mechanic is that the game has perma death, if one of the five characters die it's not game over, the character just dies, no coming back, it adds to the feel that people usually DIE in horror themed stuff. There's also a part where you can basically kill one of your teammates by being an inattentive prick like me, that was super cool, I felt bad after that.  Also, you can combine items. Maybe back then it was a huge thing (I don't think so) that you can combine items, but I feel like that's not a big deal, not that big at least as people emphasize that. Your options are limited as hell, no reason to pee your knickers just because you can tape a flashlight to a handgun or a shotgun. You can also play co-op, but I didn't really care about that, I like my horror alone. But if you want to pop a beer and laugh while you're participating in some B horror action then Obscure is probably one of the best games for that.  I shouldn't like this, but I had fun while playing so I don't care.",
            "review_score": "1"
        },
        {
            "review_text": "A childhood favourite, if you're a classic survival horror fan this is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "The controls are really clanky, but overall a good creepy game! The music is really spooky, so make sure to turn up your volume.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS MY FAV GAME OF ALL TIME. love that steam made it available! thank u so much 9/10",
            "review_score": "1"
        },
        {
            "review_text": "PS2 Game on Steam , very good - Story 9/10 - Creepy 9/10 - Graph 7/10 - Controller 8/10 not bad",
            "review_score": "1"
        },
        {
            "review_text": "This title harkens back to the days of Resident Evil and Silent Hill. While it borrows from several great franchises that came before it, there are still plenty of fresh ideas here. While the plot represents little more than a teenage horror flick, the game launches you into the action almost immediately and keeps you wondering when the next atrocious ugly will stake a claim on your life. There are no zombie hordes or hell demensions here either. This is a completely unique survival horror angle that makes from a refreshing experience despite being released nine years ago.   As game mechanics go, having a group of hapless teens to choose from and freely swap between makes the game feel more dynamic and versatile. Furniture and small objects will shift and scatter when bumped into, making the environments feel more interactive despite the camera angles being fixed. You'll spend a fair amount of searching for clues and gathering supplies like in any true survival horror game too. Having originally released for xbox and ps2, this game was developed with controller support in mind. Attempting to navigate this title without one will add unnecessary challenge to the game.   While this isn't a AAA title, fans of the pre-action/horror genre of games from the 90's will likely enjoy this. If you are expecting this to be another Resident Evil 4-6 or Deadspace 3 then look elsewhere. This is a fairly dated game that should be enjoyed with a fair amount of respect for when it was released. For such an excellent price, I highly recommend this piece of videogame history to any survival horror fan.",
            "review_score": "1"
        },
        {
            "review_text": "so much fun, if you enjoy old school resident evi or silent hill type games this is definitely worth a look and a playthrough i would have to say i really really enjoyed this game not only for the nostalgia but for the option it gives the player and allows to choose weather characters live or die.",
            "review_score": "1"
        },
        {
            "review_text": "ObsCure Is AMAZING (I'm a glutten for story driven games) I absolutly love the series! I've played through the second game like multiple times (On the Wii haven't played it on PC yet) and I've got to say that it was awesome to see where it all started (Leafmore). I enjoyed playing through this game from begining to end, only draw back is there are some glitchs when playing multi-player. They aren't game breaking though by any means just mildly annoying. One I had was my flash light (Player 1) wasn't affective like it didn't seem to like to work. But besides that the game worked very well. I definately would recommend this game. If you aren't into this game try the second one it's definately my favorite in the series thus far. (Please, please, please make another ObsCure game!)",
            "review_score": "1"
        },
        {
            "review_text": "A very underrated gem. If you like high school horror like 'The Faculty', this is for you. Cool characters, nice action, stylish environments, and a lot of surprises. A really fine horror game that doesn't deserve to dwell in the realms of the unknown. Read the excellent review of Alex Lucard on  diehardgamefan.com,  he tells you what it is. All thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "imma be honest i herd of this game at age of 16 now that i own it it lives up to the reputation as one of the best survival horror games featuring permadeath this combines Resident Evil and Silent Hill Gameplay with the focus of a Teen Horror film i higly recommend this game if your new to survival horror or a hardcore fan of horror games this game is worth the 6.99$",
            "review_score": "1"
        },
        {
            "review_text": "Even though it is cheesy, it's based off of teen horror flicks so it's to be expected. However I had a lot of fun with this, so much so that I wish it was longer. Just over five hours of gameplay I finished it and was sad to do so. There are quite a few features I was surprised to see in such an old game. Features that were rare during the 2004-5 era of games. Perma death, breaking glass to get through areas, and even local co-op. Story is meh but if that doesn't matter to you and you enjoy creepy games, this one's for you.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Obscure because I used to play it on the PS2 when I was younger. I saw that Steam's store had it and I bought it straight away. Obscure is a game about four teenagers who stay late after school one day to find their friend. Only to realize that their school faculty experiments with students, turning them into monster like creatures. Within this game, you will fight off all sorts of monsters and attempt at finding your friend. I would recommend Obscure for people who like thriller games but can also handle a bit of difficulty as this game can be intermediate for some people.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who plays a fair amount of horror games, I really wanted to give ObsCure the benefit of the doubt. And in many ways, it shines. Creature design is great, the underlying premise once you get past the 'disposable teens' veneer isn't bad, and the variety of puzzles manages to keep things interesting while keeping in theme with the school campus setting. However, there are a lot of drawbacks to the game, to the point I'm not entirely sure why it receives such high praise.  In general, ObsCure seems rather player unfriendly. The UI itself is pretty solid, with the relegation of menus to the shoulder buttons on a controller proving fairly intuitive. Ammo and healing item scarcity seems reasonable, for the most part, and while there are some tough enemies, you're usually well-equipped to take care of them. Emphasis on 'usually,' which we'll get to shortly. However, the game seems to have overlooked something rather major in that there's no listing in the controls section as to how you can pass items and weapons on to your partner if you're playing single-player. I was several hours deep and frustrated by a long run of deaths before I finally found what button combination handed things over thanks to a FAQ, thus arming my second character with a second weapon in case their shotgun ran out.  The item scarcity also became an issue when boss monsters entered the picture. Rather than giving you the chance to maybe stock up on a bit more ammunition or healing items than normal before a big fight, you're left to pray that you've hoarded enough and that your last save disc was used somewhere not too far back. If you get far enough in, this can be game-ending, as you end up with less than adequate firepower to survive. I got so frustrated with what I think is the 2/3 point of the game that I sacrificed two of the five students in combat, just to keep the ones I actually liked having around going.  ObScure also gets cheaper and cheaper as the game wears on. The most egregious example I made it to occurs in the Dormitory area, late in the game, where hidden holes in a hallway floor result in instant death despite there presumably being a floor to land on, albeit with injury, beneath. This is the first instant death situation I can remember in the game, and it comes out of nowhere after everything else just smacked you really hard at worst. It just feels like a really unfair leap without any precedent. If it makes any difference, all of this was encountered on the Normal difficulty level.  I'm tempted to give this another chance, maybe on Easy, just to see how the story resolves, but I don't recommend that anyone else suffer through it. Save yourself the frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a fan of Silent Hill and Resident Evil, don't bother playing this subpar survival horror joke.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is just...no it's just the worst game . who ever made this was lazy with the story line and it was a dumb story line and had dumb fisix. DONTE BUY THE GAME &gt;:( also pleas don't coment on this review it's so god damn anoying",
            "review_score": "-1"
        }
    ]
}