{
    "app_id": 254700,
    "name": "resident evil 4 / biohazard 4",
    "release_date": "2014-02-27",
    "developer": [
        "Capcom"
    ],
    "publisher": [
        "Capcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Inventory Management",
        "Survival Horror",
        "Action"
    ],
    "achievements": 12,
    "positive_ratings": 11260,
    "negative_ratings": 2172,
    "price": 14.99,
    "description": "Special agent Leon S. Kennedy is sent on a mission to rescue the U.S. President’s daughter who has been kidnapped.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/254700/header.jpg?t=1556225890",
    "minimum_requirements": "最低配置: 操作系统: Windows XP/ Vista®, Windows 7, Windows 8 处理器: Intel® Core™ 2 Duo 2.4 Ghz or better, AMD Athlon™ X2 2.8 Ghz or better 内存: 2 GB RAM 图形: NVIDIA® GeForce® 8800GTS or better, ATI Radeon™ HD 4850 or better DirectX 版本: 9.0c 存储空间: 需要 15 GB 可用空间 声卡: Standard audio device",
    "recommended_requirements": "推荐配置: 操作系统: Windows Vista®, Windows 7, Windows 8 处理器: Intel® Core™ 2 Quad 2.7 Ghz or better, AMD Phenom™ II X4 3 Ghz or better 内存: 4 GB RAM 图形: NVIDIA® GeForce® GTX 560 or better DirectX 版本: 9.0c 存储空间: 需要 15 GB 可用空间",
    "reviews": [
        {
            "review_text": "One thing to get out of the way, if you do decide to buy this game, I highly recommend using an XBOX controller. It will make your life so much easier.  Pro - The character models for the most part look very nice. Capcom has updated the models to make them sharper, crispier, and added new textures. - The framerate is now in 60FPS -Has all the extra from the re-releases of the game -Great texture mods are available (or will be) -Same great gameplay from 2005 -1080p  Con - Motion blur is beyond terrible,I highly recommend that you turn it off ASAP. -Only about 10% of the game has HD textures, the other 90% are old textures with a filter over it (2xSAL) -No new extras -You can't aim and walk (not an issue for me but might annoy you) -Tank controls (not an issue for me) -Might not run great on certain computers (runs fine on mine, GTX 880M, i7-4810MQ 2.8Ghz)   Verdict -Overall, this is a great version of Resident Evil 4. I don't think Capcom has a reason to release this game again unless they are doing a full 'HD' version (100% updated graphics, lighting, updated controls, ect..), but I am sure this will be the 'final' version. -If you love RE4 or have never played it, then I highly suggest buying this game. This is one of the greatest video games of all time. It revolutionized the 3rd person shooter.  - I am pretty disappointed at the 'HD' in the title (it is a little misleading), but this is the 'definite' version of RE4.",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 was released in 2005 for GameCube and was later released on other platforms. It looks like Capcom wanted to significantly improve its visuals for the second PC port as the first PC port was released in 2007. The graphics are sharper than ever and the gameplay is very good, although a few small problems exist.  This game has been enhanced for 1080p resolution at 60FPS. There is keyboard and mouse support with the ability to customize the keys. Resident Evil 4 HD comes with the Separate Ways campaign to increase replay value. The keyboard and mouse work very well together, but sometimes the laser targeting is not perfect and that can lead to problems when there are multiple enemies near you or when a large boss monster is approaching.  The plot of the game begins with the kidnapping of Ashley Graham, the daughter of the president of the United States. Leon Kennedy, the well-known protagonist of the series, has been sent to a village in Spain to rescue Ashley. What happens in the Spanish village is that there is a religious cult that has released an ancient parasite called Las Plagas on to the countryside. The religious cult does not consist of zombies like other Resident Evil games. You begin fighting ganados, a group of foes who carry pitchforks and are both males and females. Later, you will meet darker and tougher foes known as cultists, religious zealots who wear red or black robes.  As Leon progresses through the story, there will be memos explaining the plan of the cult known as the Illuminados. These memos keep you well informed of the plot and it seems to get darker and darker. The environments are appropriately creepy as Leon looks for Ashely. Resident Evil 4 retains the series’ history of creepy and dark locales. There are misty forests, decrepit houses, moldy caverns, a large castle, and military facilities. The locales display diversity so that there is no monotony. Leon is joined by other characters like Luis Sera and the Ada Wong. Luis Sera is a local citizen who is willing to help Leon. Leon engages in a long shooting with the ganados while Mr. Sera helps out in this long battle. Ada Wong is a familiar figure to Resident Evil fans and has had a long relationship with Leon. There are bits and pieces of the script that indicate past romances and rivalries. However, the plot keeps you at the edge of your seat at all times, which is the way it should be for a Resident Evil game.  The graphical enhancements of the diverse locales are what make this game feel like it is not so old. The details of Leon, his allies, and enemies are impressively sharp and well defined. The walls of the castle look extremely realistic. You can see the dust falling from the ceiling of caverns that make the caverns both realistic and creepy. The textures look amazing in high resolution, but in some cases they look a little bit archaic and out of place. However, the details of the textures are sharp enough to outweigh any archaic look you may find. Military facilities make you feel like that there is a nasty experiment going on while it also feels abandoned.  The bosses are diverse and require you to figure out their main weaknesses in order to defeat them. One issue that pops up in boss battles and in other parts of the game is the quick time events. Sometimes you have to press two buttons at once very quickly to avoid key attacks or avoid deadly traps. It can feel awkward trying to press the X + C keys or the two mouse buttons while using the WASD keys in tense circumstances. While it is appropriate to have tense circumstances in a Resident Evil game, it can get frustrating trying to press two keys at once but dying in the process because of you are not able to press the buttons in time. Another issue that comes up is the laser targeting of the firearms. There are times when the laser targeting takes time to be accurate while one or more enemies are quickly approaching you. Also, the laser can twitch in the spur of the moment, leading to more difficult encounters with the various types of enemies and possible waste of ammo. Ammo is always at a premium in the game, so twitching is a bad thing in a game like this.  All firearms can be upgraded by visiting the various merchants that stand around waiting for you. Upgrading your weapons will make your shots noticeably more powerful. You can upgrade your weapons to the max so that you can be an “exclusive” weapon that will be far more powerful than the weapon you fully upgraded. The challenge is to find the pesetas scattered throughout the locales and dropped by the enemies. You will have to quite a bit of searching for pesetas and treasures with lots of value if you want to upgrade any of your firearms to the max.  There is some randomness when it comes to shooting enemies, especially in the head. Some ganados and cultists will simply fall to their deaths with a headshot. Other enemies will show their Plagas, spider-like figures that emerge from their necks, and continue to try to attack you. You can either fire a shotgun at their Plagas or use a flash grenade to finally finish them off. There are encounters that require crowd control, so you can use different types of grenades to bring some relief to these tense encounters.  Other enemies that are interesting and horrific include garradores, colmillos, and regenerators. The garradores do not attack unless they hear your sound and are blind. Their only weakness is the Plagas shown on their backs. Colmillos are terrifying dogs that can jump on top of you by surprise. Regenerators are special monstrosities in that you can only use a sniper rifle with an infrared scope to locate and shoot their Plagas on their torso.  Resident Evil 4 is worth playing for its diverse locations, creepy atmosphere, and tense encounters. The nail biting gameplay lives up to what Resident Evil fans expect from a Resident Evil game. The high resolution graphics make the PC version the definitive version to play.  My Score: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "After the abysmal port that was the PC version of RE4, this new release is fantastic. Customizable keyboard controls as well as controller support with both 'classic' and 'modern' sensitivity modes make the gameplay easy for veterans and newcomers. Constant patches from the devs keep the game improving, and the updated HD looks incredible. This game merges shooting tons of enemies with a huge amount of unlockables. No DLC here; all the content is in the game already, waiting to be unlocked. This game was and still is the prime example of a good video game: great gameplay and great replayability. Buy this if you've beaten it 15 times on previous versions like myself, or if you have never played it before. It will reinvent what you think a video game should be like.",
            "review_score": "1"
        },
        {
            "review_text": "The American prevailing is a cliché that only happens in your Hollywood movies! Oh, Mr. Kennedy, you entertain me! To show my appreciation, I will help you awaken from your world of clichés!    Story",
            "review_score": "1"
        },
        {
            "review_text": "This is the fourth time I've bought this game.  It's that good.",
            "review_score": "1"
        },
        {
            "review_text": "Difficulty: Just Right The Bottom Line: Masterpiece/Superb Score: 9.5  Originally released for the GameCube in 2005 and now bringing all its glory to Pc/Steam users in HD and smoothness 60 fps.  Every now and then a game comes along that within the first minute of playing it you know it's going to be something truly special. To say that Resident Evil 4 is the greatest thing to happen to survival-horror games in 2005 and... since it's creation is a bold statement and one that can be backed up by the quality of the game at hand. Resident Evil 4 is the end all, be all that the genre has strived for since its inception and is a fond love letter not just to fans of action or survival-horror but to people that simply like to play games.  Frenetic action and giant boss battles aside, where Resident Evil 4 succeeds, as a survival-horror game isn't so much that it's a frightening game, though there are moments where you will be scared, but its haunting atmosphere. Resident Evil 4 will send chills through your spine as its atmosphere takes center stage against seemingly impossible odds as you go off in search of the President's daughter. The game has the right feel to it, it does have it's action go to the forefront as it's greatest strength but it never lets the action get in the way of the atmosphere and the mood. The two combine together to make Resident Evil 4 one of the most masterful games ever made and an example of how to do the genre justice without abandoning what makes it a survival-horror game.  You will be lost in Resident Evil 4's game world for at least twenty hours and you will be compelled to play through it again, either on harder difficulties or with all of your previous items in tow for the second go around. The game is truly fantastic and is well worth a purchase today for those who have never played it if only to see how it's influenced games like Dead Space and Gears of War in different ways.  Overall: Whether you're a fan of Resident Evil, the survival-horror genre, action games, adventure games or simply good games, Resident Evil 4 has all the bases covered. This is the kind of game that comes along once in a console-generation and it needs to be experienced. It's a bold statement to call a game one of the all time greatest ever made but I can make that claim with Resident Evil 4 and have no reservations about it.",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me not to shoot at lakes.",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4, is actually the Sixth game in the Resident Evil series and was released in 2005. Resident Evil 4 is a Third-Person shooter/Horror game where you play once again as Leon Kennedy, the protagonist from Resident Evil 2, who is on a mission from the President of the United States to rescue his kidnapped daughter from a group of cultists. Upon arriving at a local village you encounter townspeople who worship and are infected by a virus called, Las Plagas. Not to go further into the plot, Resident Evil 4 takes place Six years after the events at Racoon City.   Resident Evil 4 has won many awards and has been an influence for other, more modern games. Even though it is starting to show it's age when compared to newer titles, Resident Evil 4 is still a good playthrough. I recommend if you enjoy the Resident Evil series, or horror/shooters in general to give Resident Evil 4 a playthrough. The story is interesting and furthers the canon of the overall Resident Evil Universe.   ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games of all time! I have beaten it multiple times on every platform it has been released on. I'm a loser.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game because when a dude with a chainsaw and a sack on his head kicks down my door, I can pause the game and play Herb Ammo Tetris for 5 minutes until I am man enough to shoot the guy.   9/10 - Fun gameplay, zombie suplexing, inventory porn",
            "review_score": "1"
        },
        {
            "review_text": "Story: This game doesn't get enough credit for it's story. It's fun, highly-unrealistic, and action-packed. Characters are also unique and pretty awesome.   Sound: Music for this game is pretty good. It's slow at the non-action sections and then hypes up when the enemies start coming. Voice acting is fantastic. Though, one certain voice will haunt you forever.  Gameplay: So good. For those not use to it, the controls will feel odd and you WILL have trouble moving around and fighting at first. However, the controls are made to be this way. It helps give it that survival horror feel and requires the player to use more skill and such. You will get used to them in 20 minutes. And, even if you don't, all keys are rebindable. It also has support for the 360 controller, but I perfer the mouse and keyboard. So many brats will stop playing this game because the controls aren't your stereotypical 3rd person shooter. I'm glad they aren't. Or this game wouldn't be nearly as fun. The game has great variety of enemies as well as weapons. The game also hits the dot on challenging without being too hard or too easy, atleast on the normal difficulty. Proffesional will give you one hell of a fight though. This is also one of the few games that gets escort missions RIGHT.  Replayability: Way more then you'd expect. New costumes, new unlockable weapons, a new difficulty level, 3 EXTRA MODES. Also, the game is just fun to play again IN GENERAL. Also features New-Game plus-ish features.  Last thoughts: As a fan of the Resident Evil series, I can safely say this is my favorite. I have no problem with the Resident Evil series changing from Survival-Horror to Action-Horror and so many people ♥♥♥♥ on this and Resident evil 5 (Also a good game) for the sake of NOT being survival horror. That's rediculouse. Go play SIlent Hill or Amnesia for horror. This game is great mixture of action and certain horror elements (Those regenerators...*shudders*) and is a fantastic game. One of my favorites of all time.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Be ten year old me Blasted through the 2/3 of the game in a couple days It's spooky but i go on I meet the Regenerador Shoot him on the floor no problem I think he's dead He' not dead Regenerador attacks me I poop myslef silly I somehow kill him He's not even a mid boss 11/10 would traumitze m̶y̶ ̶c̶h̶i̶l̶d̶h̶o̶o̶d̶ the rest of my life again",
            "review_score": "1"
        },
        {
            "review_text": "Another Resident Evil HD remake, but I really enjoyed this one just like the others. The textures are nice and crisp, the gameplay is fantastic, and its just plain enjoyable. There is some extra content to enjoy. Really the only thing that made me cringe was the multitude of quickaction cutscenes. They're so random and lightning quick and the consequences are instant death. Never really understood this mechanic. Its a great addition to the collection for anyone who wants the classics in their library.",
            "review_score": "1"
        },
        {
            "review_text": "This is, hands down, one of the best and most replayable games ever made PERIOD.  You can like it or not, obviously, but Resident Evil 4 has so much to offer it's quite hard not to have a nice time with it. This was the first game to feature the new Resident Evil layout of commands and at the time it was demonized for not being the classic survival horror as the old games were.  I loved them, I really did, but it was time for a change of that clunky movement system(if you played the originals you remember it took a hour just to turn around with your feet planted onto the ground, I still miss the fixed camera though).  That being said the game is/has:  - REALLY good - decently long - nice and well balanced - different environments - cool bosses and events - a HUGE replay value - more modes to play it even more! - tons of other stuff - tons of mods if you STILL feel like playing it  There's also a couple of bad things like:  - the graphic is starting to show its age even though I'm accostumed to it - the porting. It's good but for some reason on quite a lot of GPU's it starts to slow down REALLY HARD when there's a couple more enemies on scene than there should be  Consider that I'm running this on a GTX 750 2GB but I've had friends experience the issue on more powerful GPU's. You can either lock the game at 30fps or 60fps(nothing in between or above that) so setting it to 30 'fixes' it.  I also still reccomend playing it in 30fps because that's how the games was supposed to be played when it came out and the 60fps glitch some stuff(doors and more) and even though we all love the 60fps this is not a complete overhaul of the game but just a re-texture so playing it 'as it was' is the best option imho.  That being said if you're still thinking about getting RE4 well, I love the serie but it's still a classic for those who don't too! Wait for the sale if you're not 100% sold on this but trust me, this will give you a great time and will prepare you for RE5 which you can co-op with a friend too :)  P.s. oh and to be clear don't mind my played hours here. I played it on the GameCube during the original release and finished it more than 10 times, then I played it and beat it at a friend's house a couple times, then I finished it on an 'non original' version waiting for the sale on Steam and only THEN I got it and finished it once here.  Now I have a couple more games that are keeping me busy but I plan to finish it over and over again here, it's just THAT good ;)",
            "review_score": "1"
        },
        {
            "review_text": "Playing as a hench bloke with hair physics, big pockets and quite wonderful taste in slacks, you are tasked with rescuing a fragile girly girl, on the way shooting hundreds of angry Mexicans in the head. Also includes an optional chicken and snake egg collecting mini game. Pretty nice - 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Ashley throws a stick at Leon at 60fps.  There's also QTEs in this game, but we don't talk about those.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool playing this in 1080 at a ful 60 fps. Makes an infinitely replayable game somehow even more replayable. Mercenaries all day baby!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played since my childhood and still holds up as one of my best games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Keep in mind that this game is the first Resident Evil game I've played. Ever.  I can't speak for how different this game is from the past instalments. However, this game is fantastic and I find that it's succesfully managed to get me hooked on the entire franchise; I'm a picky ♥♥♥♥♥♥♥ when it comes to the games I like/craft the badges for nowadays, but I just had to do it for this game. It's fun, satisfying and well worth the money I payed for it.  The story is summed up like this; Leon S. Kennedy is sent to a rural Spanish village, where it is most likely the President's kidnapped daughter will be. As you can expect, things go wrong  very quickly  and Leon is forced to fight his way to the President's daughter and fight his way out. Not completely original but still not executed poorly; whatever story was there was enjoyable to follow and I feel like it increased how much I liked the game.  Anybody who is accustomed to modern third-person shooter controls will find these ones stiff at first; you can't run and shoot, you can't run and reload, you basically can't run while on the offensive. That being said, this feature makes Leon feel more helpless, making the atmosphere and the environment of the village-gone-wrong even more effective. Going up against a mob of people and being forced to run away so you can regain your composure and reload is something that is key to the game and I actually think it's a good idea it's there.  A problem that I faced, however, was a good amount of framerate issues. At first these really weren't that prominent; however, when you get later in the game this just seems to get far worse than before. Since I was already hooked on the game I didn't quit after this, nor did I find it to be a gamebreaking issue, but it still really affected how immersed I was with it. I'm not sure that this will be fixed entirely; this is a Capcom game and to be truthful they aren't exactly amazing with their fan service (GFWL not being removed from most of their games, apparently ruining this franchise with Resident Evil 6 and Raccoon City, DLC that's completed and on the disc yet still charging customers extra for it, managing to bury my favourite Mega Man spin-off franchise). That being said however, it isn't a MAJOR MAJOR issue and you could easily look past it with how much you're getting.  To sum it up, I had and am still having a lot of fun. Pretty much at the last parts of the game at this point and I hope that the ending will be a satisfying touch to an already great game. I think Capcom really did justice to this instalment.",
            "review_score": "1"
        },
        {
            "review_text": "Old memory came back after a long time 11 years ago. Now back to haunt your old age . Thrilling and the better your skills more difficult the game level . Wich is offer challenging gameplay . Resident evil 4 best of all resident evil franchise",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. A must have for RE fans.",
            "review_score": "1"
        },
        {
            "review_text": "While RE4 does show it's age in some ways, specifically where textures are concerned, it still holds up as one of the best action games ever made and one of the greatest games of all time. I've played it through atleast a dozen times across multiple systems and had just as much fun playing through it again here. If you haven't experienced it, you should. A controller is strongly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's Resident Evil 4, but in HD. What more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely good classic game with slightly refurbished graphics. Most people's favourite Resident Evil game (of the more recent ones).   It took me around 10 hours to beat, which is a fair amount of hours for a main story these days.  Only annoying part is the quicktime events, which, lets face it, everyone hates.  I've heard that this is a terrible port, with audio lag problems and stuff, which I can confirm, at least for my weak laptop.  On my computer however it works perfectly fine at constant 60 FPS at 1080p with all details maxed out, my specs are:  Intel i7-4770 | Geforce GTX 760 | 8 GB ram  As usual, I strongly recommend using a 360 controller with this game, but I guess any other halfway decent one will do.",
            "review_score": "1"
        },
        {
            "review_text": "If you are reading this review because you are unsure if Resident Evil 4 is a good game, AND you are the owner of a monster spec PC, then stop reading, buy the game and enjoy it because it is amazing. However, if you are concerned about the PC port, keep reading.  At the time of writing this review, only the actual PC port was tested. Firstly, it is MUCH better then the original RE4 port however it is not perfect.   There are a few options which are pointless because they cripple your view. Motion blur makes you feel like you are drunk and the post-processing adds a black and white film-grainy filter to it. It is 3 different colours and it makes the game look worse.   Also on my AMD R7 250, I could not run the game in 60FPS on 1080p however it ran fine on 720p with the occassional drop. Yes this could be because my card is not amazing but what I am saying is that maybe it could be optimised to run at 60FPS better on lower end systems. Not everyone owns a monster-spec PC though Capcom!   The game has 2 frame rate settings, 60 and 30. If your computer cannot handle 60 then the frame rate will drop to 30 and because the FPS is connected to the speed, it will half the speed. The default settings reset button seems to be accurate enough though when it comes to optimising the game for you, which is a first!  Finally, the mouse controls work fine however you cannot use the mouse in the inventory. Not a big deal but its fine. The game is still RE4 alright though and it is clear that it was taken seriously that the game was going to be ported. Keep in mind that you probably will need a high-end GPU in order to play 1080p/60FPS.   Overall, Capcom has done a good job but there is still room for future performance patches to improve performance on lower end cards like my R7 250. However, I can report that overclocking my R7 250 ,which more-or-less increases the quality of the card so it is equal to the 7750, makes it run fine with AA off. Final verdict, the port is great.",
            "review_score": "1"
        },
        {
            "review_text": "  So I have beaten the main story line/seperate ways/assignment ada.  .  UPDATE ON FPS DROP IN POSSIBLE BUGS.  ||||||| If your 60FPS mode starts going into slow-mo. Press M for the map screen, wait 2 seconds then it should be back to smooth. Instead of alt-tabbing out. Haven't crashed like this.||||||||||||||||||||   Having only played the gamecube version of this game with at least 75+ hours clocked in when I was younger, I expect a lot. I expect a lot especially as the first port, that I actually have, ended up as garbage. lol  I saw that this game is being updated with its bug fixes/add ons which makes it feel promising so I decided to buy it. I loved RE4 too much not to give this a try.    \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ First off, having played RE5/RE6 where the controllers are smoother on pc, I feel spoiled. I won't take away/bad talk RE4 due to the fact that they are trying to keep this game as close as possible to the original which I can appreciate(or at least I Think they are).   You can't move/strafe while aiming, you have to aim to reload, the movement feels old (it came out in 05 lol)  Stuff like that is something I will just get used to. \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\      POSITIVES   \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ Fortunately, you can change the key binds. I already hated using 'E' as a action button. I switched that to 'F'.  The 60 FPS and graphics looks sexy as ♥♥♥♥.  After a good 20 minutes, the controls felt smooth, they feel almost exactly how I played on the gamecube. The 'modern' aiming style is phenomenal. The only thing that scared me was the first QTE from the boulder run, made me smash X with XC to dodge.   UPDATE: Just started 2-2 and I cannot complain. So far I am loving this game! The controllers feel great after you get used to them and aiming does not feel restricted! The team could not have done a better job.   UPDATE: The team really out-did itself by listening to the community and fixing the bugs! They remade the game enjoyable and I love them for it.      NEGATIVES   \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ A negative I found is using the inventory. Maybe I haven't figured it out yet but using the inventory is a pain already lol. I don't want to have to move my hand from my mouse just to move stuff around. Yes, call me lazy but thats just me.   You have to deal with Ashley again lol  The audio-desync started happening near the ending scenes. I'm sure they will fix this tho as they have fixed more than half the game already.   Seperate Ways movie clips look like complete ♥♥♥ lol   POSSIBLE BUGS  \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ After I save, the frame rate dropped to 30 but since the settings are on '60', the game speed was just cut in half. All I did was alt-tab and it would be start working normal again. This was from the first save typewriter, the ones after that were normal without bugging out.  I have been having a lot more FPS drops/'slomo'bug. My game will become really slow/drop to 30fps but all I have to do is alt-tab out and alt-tab back in.  It seems that the FPS drop/'slow mo' keeps getting worse and worse. It happens often anytime I switch the screens like say I go to the merchant or just simply press tab. Of course all I do is alt-tab back in but that crashed my game once so now I'm scared. This is something that should be looked into and fixed ASAP.  My pc specs are  AMD Phenom x4 965 OC'ed to 3.8ghz 8gb DDR3 Kingstong HyperX ram at 1333mhz MSI Twin Frozr III GTX 560 TI 448 core",
            "review_score": "1"
        },
        {
            "review_text": "10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 Ultimate HD Edition (PC Port Review)  FINALLY!!! Capcom is giving appropriate attention to giving the PC heads a proper HD port!!! We can all forget that last one &gt;_&gt;  Performance: Runs great on my system, however I have heard others having performance issues. I am able to run in max settings at a stable 60 frames through out! No frame loss through out. Input: They nailed the K/M controls. X360 controls are the same as they were on consoles, I personally have forgotten my controller completely when playing on K/M. However, if you plan on playing with K/M unplug any other controllers as the input detection seems glitchy.  Good/Bad?  Okay, I'm a little biased here because Resident Evil 4 is my absolute favorite game of all time. But, this is an OK port. The game itself is still all there in all it's glory, but the small performance issues I've read up on, and the glitching controls for when you try and use K/M when controllers are plugged in is a bit disheartening that Capcom got lazy with it. Worth the purchase if you loved the Resident Evil series, and if you don't have a console and have yet to experience this amazing game? This is a great way to see what transpires in rural Europe with Leon.  Game: 4.5/5 Port: 3/5",
            "review_score": "1"
        },
        {
            "review_text": " My Personal Score: 3/5",
            "review_score": "1"
        },
        {
            "review_text": "Many of you are probably already familiar with the game. RE4 is the turning point of the franchise. Capcom decided to change the way you play the game simply because REmake and Zero didn't sell well (GameCube). For the first time Resident Evil was fully 3D with behind the shoulder camera. Many people loved it and called it the best RE ever made, many people hated it and said that it's the reason behind the downfall of RE series, others liked both old and new. Will you like it? That's for you to decide.  Just like in my other REviews I'll make a list of pros and cons. This time obviously I'll compare it to both oldschool and newschool REs. So, here's a list of alphabetical pros and cons:  Pros: -Camera. It's been finally patched and now you can choose between classic and centered camera. Whatever you like the most, that is. -Characters. RE4 features characters we already like   (especially Wesker, heheh)   and introduces bunch of new cool ones. -DLCs. RE4UHD features all available extra content there is for free! Separate Ways, Assignment Ada, Mercenaries. No need to buy them. -Enemies. New undiscovered enemies add extra scare factor. -Graphics. The game now runs in 1080p @ 60fps. there are some extra effects such as motion blur, post processing. The game's main story features real time rendered cutscenes. -Melee. Now you have a knife that doesn't take inventory space. Also now you can do special moves (basically coup de grâce but they're not always lethal). -Mercenaries. RE is well known for it's mercenaries mode in which with the given time limit you kill as many enemies as possible. It's a really fun mode and everyone should try it. -Mods. You can expect to see model, texture and even ambient effects mods! -Puzzles. Just like in old times there are few puzzles mixed in. -Replay value. The game has a decent replay value, especially with extra items you can earn, plus it allows you save all your end game's equipment and transfer it to a new game (obviously within borders of one difficulty). -Single player. ~70% of the time you're alone which is (of course) better (and more scary) than being with someone. -Soundtrack. The game features a good soundtrack.  -Survival Horror. Still somewhat scary. -Upgrades. You can upgrade your weapons! A really satisfying (but less realistic) feature. And as an extra you can attach thing to your weapons (stock, scope). -Variety of weapons. Knife, handguns, shotguns, rifles. magnums, TMP, bowgun, RPG, mine thrower and other bonus weapons! -Weather. Unlike in previous installments which had almost static weather (always night) RE4's weather changes with the areas/chapters.  Cons: -Characters. There are few characters people would like to forget about. Mainly   Salazar   and   Ashley  . -Controls. Might be one of the biggest problems here. I'm not saying that the controls are bad. They're were OK when the game was released and still can be mastered. However, the horror that is crafted by the expense of the controls is a matter of discussion. You can't dodge or counter, the controls are tanky, but now there's finally a native mouse support. -Enemies. There are no beloved zombies. Only parasite (Las Plagas) controlled humans and other species. -Escort. ~30% of the time you have to escort a person with you. Sometimes you can hide him, sometimes there's no other way but to fight with him. It's possible to accidentally kill this person (enemies can kill too, y'know) which will result in 'Mission Failed' screen. -Graphics (and Performance). RE4UHD allows you to play at anti-aliased 1080p, 60fps. That's pretty much it as the 'HD' textures are ...erm... 'Capcom HD' as in barely HD at all. There's a big inconsistency going on when there are extremely old blurry together with higher res new ones. Also one more thing should be mentioned. Some textures look more cleaner than the old ones aka less scary. -QTEs. The QTEs here are unforgiving. They give you somewhere around 1.5 seconds to react and some of them require great button mashing skills. -Story. Barely any.  I can't remember everything, so excuse me if I forgot something. I tried to make the pros and cons list  bias-free , but it seems like I did not satisfy the fanboys. Final verdict: it's a love/hate relationship. So play the game and see it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite game, played it since i was 10. This game brings childhood memory. nothing much to say.. best version of RE... ever!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game a while ago on the PS2 and just loved it, the atmosphere and the gameplay are just a great mix of horror and action. It teaches you to play the game as it is meant to be, what is good if you ask me. You can't just play as you want just using one weapon that you like, different situations need to be solved in different ways, thats what you learn by failing all the time if you don't pay attention.   Although i had really big problems with the controls at the beginning i recommend playing it. The console versions may be easier to handle but you will learn how to play the game with your mouse and keyboard pretty fast until you won't notice that the controls bothered you at first.   The graphics are quite well considering how old the game is, even though i didn't notice the changes of the HD remake all to much.   So if you like zombies, horror and some action then this game might be just perfect for you.",
            "review_score": "1"
        },
        {
            "review_text": "A must have classic! Game of the year in 2005! And it's back to do it again(well I wish!) Anyway, get this, it's awesome!",
            "review_score": "1"
        },
        {
            "review_text": "The best Resident Evil series of all!! I love this game so much that you could customize your gun, and your case deciding where your weapons to put at, also having the old brutaly death scenes and gore. This is what Resident Evil should keep going.",
            "review_score": "1"
        },
        {
            "review_text": "This version of RE4 delivers on most of the promises as it can be played in 1080p and 60 frames per second with all the settings turned up to max (If your system can handle it that is!). It works great with KB+M or a 360 controller so you can use what suits you best. All is well so far but there are some problems which I have to mention.  1. The textures aren't upgraded much so the visuals will not blow your mind  2. When reloading the bolt-action rifle the fps had a drop (despite being locked at 60FPS) but quickly went back to 60   3. The climbing up from ledges Quick Time Events to prevent falling are almost impossible to complete on the first try (or the 10 next attempts) and could potentially lead to damaging the buttons on your keyboard or controller you have to mash to complete them (Chapter 4-3 ledge climb and the chase sequence in 4-4 are the biggest offenders)  If you have trouble with the QTEs I mentioned above, lock the frame rate to 30 via the config.ini, find the part that says variableframerate, change the number from 60 to 30, complete QTE and change it back after you've done it.  The config.ini is located at: C:\\Users\\yourname\\Documents\\My Games\\Capcom\\RE4   Also the cutscene quality in the Separate ways bonus campaign is rubbish but not in the main game which is weird as several of the cutscenes are reused from the main game.  Despite these issues I'd still recommend the game if you've never played RE4.   Personal rating: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played and definitely one of the most influential in my life. This was one of the first games (Other than Super Mario 64 &amp; Super Mario Sunshine) I've ever played and really dumped hours into in my early years of gaming. Other than being absolutely wonderful with gaming mechanics but it perfected the third-person over the shoulder camera angle. This new innovative angling of the camera gave this game the winning seat in the entire franchise. The economy works well in this game, is not buggy, and you can not really glitch your way to unlocking everything in a short period of time. It also rewards you for beating on higher difficulties and replaying the game. I've beaten this game 10 times and I still find amusement playing it again and again. Most titles I can never find myself coming back too but this game was definitely one I'd gladly sit around and play all day. While it is ok on the computer, I had my most fond memories playing on my gamecube but I am still glad that valve had published it to Steam. While also having a huge influence on myself it has also had a huge influence on fps and other genre's of games. At times, it may seem dumb but still to this day it scares me. When I first downloaded it for steam I was scared to go into the starting village knowing I'd be facing Dr. Salvador. It literally took my 3 whole days to man up and finally go in. Even those game is older it has aged quite well and still remains good to this day. I would recommend this game to anyone who enjoys an amazing and nostalgic game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic third person shooter survival horror/action game. You play as Leon S. Kennedy and his hair is beatiful.",
            "review_score": "1"
        },
        {
            "review_text": "While Resident Evil 4 manage to be another solid well produced title, you can see the  changes on the genre itself (from horror to action) but only on a healthy moderation.  Minigames and treasure hunting are introduced in this title which does breaks the immersion a bit in a horror game. Also this is the turning point where the zombies are turning into armed infected with rocket launchers and gatling guns...  Still, it manage to entertain me through the end with their spooky background music and atmosphere. Different sinister enemies are slowly introduced at different chapters which keeps me well entertained. The game length is long but perfect balanced which is very satisfying! You may need at least a day or two if you try to marathon it. The bonus feature 'seperate ways' that unlocks when you played through the game is quite long too!  It is worth to mention that you won't get the mercenary bonus feature if you bought the german/censored version.  All in all it does not lose against the older RE title and it was a quite enjoyable ride. A must buy for all the RE fans out there :)",
            "review_score": "1"
        },
        {
            "review_text": "Long overdue. Game is released in the proper version finally. It feels very good, I was afraid I remember it well and that maybe I should not touch it... But I was clearly wrong, it has better mood than current RE games and is by far better than RE6 or 5. Combat is pretty challanging and the only things that can still annoy in PC version is no mouse free look (so you basically play with keyboard and use mouse only to aim or shift camera view while standing - it is actually harder to operate when you move it while moving). This is still a small issue that dissapears fast enough, when you forget the recent RE habits.  Can't say about any RE games that they were scary, but this is probably the only one where you STILL feel the tension and danger at all, which brings back nostalgia. The weapon and items systems are very rewarding and I like the ability to choose weapons and upgrade them.  While game is still great, this release should have happened a long time ago, BUT If you didn't play any RE games and wonder if you should get this or RE6, than I tell you - get RE4. I'm a big fan of the WHOLE franchise, including ALL the games and the movies (+anime), but I honestly think this is the better game. For me it's just after Code Veronica. (I even have Resident Evil: Chronicles on ps3, Wesker FTW :P)",
            "review_score": "1"
        },
        {
            "review_text": "I played this game a thousand times when it first came out on the game qube even got the chainsaw controller which was unreal playing with that. Ive allways loved the Resident Evil games played and finished all of them.now with Resident Evil 4 finally on pc and with Steam Achievements it going to be great.when the very first time Resident Evil 4 comeout on pc it was unplaybel and very crappy.well 10 out of 10 from me again to me this is one of the best games ever made but thats just what I think.",
            "review_score": "1"
        },
        {
            "review_text": "Ahh this game was great back in the old days, still is to this very day actually, the port isn't THAT bad at all, which is really weird, but I shall explain.  PROS:  Framerate/HD version: Yup this game is now even MORE high res than the PS3 and 360 versions, and to cap it all off you can pick the settings to 30 frames or 60 frames, why you would put it on 30 is beyond me though.  Nothing has changed: From what I can see nothing has really changed, then again I didn't get THAT far in the console version, since the Wii is utter s%$t, and the aiming on that console was terrible, especially the castle level.  Inventory: You can get a HUGE inventory in this game, and I love it, although at times it's like a game of damned tetris since you have to move everything around where you want it/want more space, and the fact you have to pause the game to get your gun out each time, it's not annoying though, nice for a second of relaxation.  Ashley: I may or may not get hate from this, but Ashley is the ONLY AI character I enjoy having, mainly because you can hide the b#$ch in a dumpster and she won't leave until you say so, nice since you don't have to worry about her all that much.  Keybindings: When I played this I was a little scared cause I didn't know what the key bindings would be, but they are kind of simple really, except for some button pressing sequences anyway, those can be a hassel 1-2 times.  The Beginning of the end: What I mean by this, is that this game was the point of ALL Resident Evils, and after this they dropped pretty damn quickly, cause 5 you had annoying sheva and the GOD AWFUL inventory system, Yes Sheva I know i'm hurt and I see that you care, but seriously, I ONLY LOST A PEG OF HEALTH DONT BE SO DAMN MOTHERLY. And don't get me started on 6 or Racoon City, cause Racoon city was just terrible, and 6 was a little better but still awful.  Ammo and health: When I started this I got a HUGE ammount of ammo and health, and I thought 'Man I wonder if I should have put this on a harder difficulty...' Then later I barely had any ammo left and a crapton of healing items, seriously RE4 you could be a LITTLE more forgiving, yes I know the enemies drop stuff but it's mainly money, give me some damn ammo or something.  Bosses: Some of the bosses are a total challenge to fight and some are just really simple, like the lake monster you fight all you have to do is avoid him running you into trees and just start throwing spears at him the whole time, don't even have to waste ammo.  The 'Merchant': I still don't know why this guy is here, or why i'm buying/selling stuff from/to him, but atleast he's not a a$$hole or anything, but DONT KILL HIM, or you won't be able to buy/sell anything ever again for the whole game, but the one thing I REALLY hate is that he doesn't sell ammo or grenades, WHY?! When I go to his big shops I can SEE ammo and such in the back behind him, what, is he hoarding it or something?  Block doors/windows: In certain areas like the town you can block the doors or windows with bookshelves and dressers that are nearby, it's nice to barricade a part of the room, atleast for a bit till they end up breaking it down, that way you don't have to worry as much.  CONS:  Mouse aiming: The aiming with the mouse is a little weird, but it's not bad, it's a little slow behind you're actual movement but i'm sure if they would have made it like a actual aiming mouse it would have made the game WAY too easy, so i'm glad they didn't change it.  Ammo: Ammo ends up being VERY scarce later on in the game, I recommend trying to keep ammo of a certain type on you at all times and using other guns instead, I made the mistake of wasting some on downed enemies when I should have knifed them.  Knife: Yes it is useful for breaking barrels and crates but I never really used this thing other than that, I did start using it later when I was low on ammo, I would shotgun the guys down, run over there, and just start knifing them, actually did more than what I thought it would, I wish they would have made the knife abit more obvious or maybe something that got peoples attention, cause I rarely use it.  Dogs: THESE mother f#$kers are the most annoying enemy out there, if they jump on you they can take a good 1/4 or 1/2 of your health away in just one pounce, REALLY?! I like challenge but when a enemy is heavily overpowered it gets really tedious to fight them.  Some bosses: Some bosses are a total D$#k half the time, later you have to fight these 2 giants in a boiler looking room, you can make one fall into the lava to die so you will only have one left, the problem? If you get too close to the edge of the one that fell in the f#$ker grabs you and pulls you in with him, one time I was in there and made the guy fall in, then I went around the edge, he popped OUT OF THE LAVA and pulled me in, seriously? Hell a button pressing sequence would have been PERFECT there.  No subtitles: There is a option but it's not accessible, which is really annoying, there may or may not be a fix for this, it's just a little thing I hate, I like to read what they are going to say most of the time.  The god damned Rail sequence: At one point you go into a tomb and have to ride a railcar to get to the other end where this key is at, now enemies can drop into the carts with you, but you can shoot them off before you get to them and make them fall, but it's a total b#$ch to hit them, and even the quick time sequence at the end killed me about 5 times, I am glad I don't have to deal with that again.  WHAT I THINK: I think that CAPCOM had actually done something good apart from the other hideous Resident Evil games that have been made, i'm looking at you 5 and 6, and you too racoon city. I am really glad they brought this to PC, because I loved this game so much back in the day and I still love it to this very day, it's one of the actual good games that is still entertaining.  Out of all it gets a good 8/10, there are some things that still annoy me but once you get past them atleast you don't have to worry about it again, unless you decide to do another playthrough.  Is this worth it on it's current price? YES. On a sale? YES.",
            "review_score": "1"
        },
        {
            "review_text": " Away with the irrational fan-love. Bring the real love which is more productive even if they don't listen.  When Resident Evil had a real name, the fourth installment made it clear to gaming that survival can only be made with a good map, some life organizer inventory, ultra-violence and tension leaving you scared sh*tless and a interesting plot to back it all up. On PS2 glory days, graphics were already good but with those HI-Res textures, RE4 just got some rightful restorative treatment. It isn't a revival or something, the zombies were only sent to some nice relaxing spa. They still angry though, the feeling to have many half-smart zombies (which is scarier than the full ret@rded ones) coming so slowly close to you, the darkness all around... it all still leaves a heavily armed ex-cop feeling like a girlie about to get r@ped in the woods - its all stills there. It's still hard, it still mature. Stills ultra-violent.  For my incredible surprise, it is still scary enough too. The plot was simple at first, but complex through it and full of interesting turning-points like every Biohazard before that. Never played it? Don't think twice.  You will have some problems with the joystick on the gameplay, but they implemented some variations on the options. You just need to explore that until you feel confortable with it and start tweaking from there.     This is the last great Resident Evil and I used to be a fan.  But if Capcom now thinks that I'm going to love anything thrown at my face just because it bares 'Resident' on its title, they must think I'm a b*tch and I'm not. Specially when they spell it wrong. Resident Evil Revelaitions anyone? That's sad.",
            "review_score": "1"
        },
        {
            "review_text": "nomination review hype!",
            "review_score": "1"
        },
        {
            "review_text": "The. Best. Resident. Evil. Game. Ever. Made.  Enough said",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 is one of the greatest games ever made. It rejuvenated the series as it was slowly becoming stagnant. RE4 didn't kill the series because it was bad but rather because it was so good any further sequel would be worse no matter what. It's a flawless mix of survival, horror, action, a pinch of puzzle solving and a huge amount of camp. I love that this game doesn't take itself seriously like 99% of games these days. RE4 practically invented the set piece action sequences seen in most modern games but it also features plenty of 'meat n' potatoes' gameplay in between the set pieces. The environments are incredibly varied and it's simply a blast from beginning to end. Perhaps controversial are the QTE's. While I don't particularly enjoy QTE's I can appreciate their usage in RE4 for heightening tension and not going overboard with them as some games do. I could go on and on, but these are all points shared across all versions of the game. The most important thing this PC re-release provides is mostly functional 60fps support. Playing this at 60fps is a revelation; there is absolutely no going back. It's so much easier on the eyes and plays much better. Aiming is smoother, even with a controller. I've been gaming on a 120hz monitor for a few years now and even though the game is capped at 60fps it feels smoother than most games do at 60fps. I think because the animations are keyed to the framerate is why it appears this way. For example, Wolfenstein: TNO feels downright choppy at 60fps whereas this is absolutely butter smooth. Mouse and keyboard support is present but not quite as good as I'd hoped for. The mouse is a tad wonky even with the 'modern' aim setting. It feels like there is a slight amount of dampening but at least it seems as though the negative acceleration is gone. It supports key rebinding but the defaults were just fine IMO. Overall, M+KB is definitely usable but not necessarily ideal. For a game like this, it really was intended to be played with a controller and it plays very well with a 360 pad. If you're a huge fan of RE4 like myself, you need this version for the 60fps alone. Sure it has some minor bugs and glitches but it's still by far the very best vanilla version of RE4 available and it'll only get better with further modding. I wish this had had a higher budget internally at Capcom. I'd gladly have paid a full $60 for a flawless re-release of RE4 with a more moderate graphical overhaul, perfect M+KB controls, no bugs or quirks, etc. RE4 really deserves better than these budget re-releases Capcom's been doing, but overall it's hard to complain. This release feels 90% finished for $20 which is still much, much, much better than the craptastic Sourcenext original PC release.",
            "review_score": "1"
        },
        {
            "review_text": "While it's not a terrible port, the Wii version is much better. The tank controls just feel dated on the PC. The game itself looks fantastic, even with the glaring contrast between the new HD textures and the old.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for GameCube back when it first came out. I've also owned it on PS2 and now through Steam on PC. All-in-all, I can tell you that this is a very good game - the fact that I've bought it 3 times should tell you something. This is by far my favorite of the Resident Evil series games, after playing all of them, minus Code Veronica. The story is very well thought through and to back it up, it takes a solid 12-15 hours of gameplay for a seasoned player that knows all of the tricks in the game. There are 3 main areas in the game, starting in a Village, progressing to a Castle, then onto an Island. (Each takes several hours to complete.) This has always been among my favorite games ever since i first played it 7+ years ago, which is why i was thrilled as hell to see it remastered and put onto a PC version. Controls are easy to configure/get used to wrether you're using a controller or the keyboard/mouse. If you're not new to this game, but worried that the remastering of this game changed it too much - don't be. There have been zero glitches so far for me and the graphics didn't really change that much tbh, other than removing some pixel blur here and there, which adds up for a better visual experience. It's just as I always remembered it when I was a little kid that dumped his birthday money on this game for the GameCube. Overall, I would gladly go out of my way to recommend this game. It has great replay value, due to higher difficulties, game-modes, and bonus weapons/costumes unlocked through beating it in each difficulty. A solid 9/10 from me overall - even in today's standards. Well worth every penny, and long enough to justify $20. To be honest, I'm surprised that Steam didn't charge more due to it's remastered version.",
            "review_score": "1"
        },
        {
            "review_text": "control is little bite odd, other than that is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Quick rundown: Resident Evil 4 is an action/horror hybrid that plays similar to the Dead Space games, and in terms of mechanics is probably halfway between the original Resident Evil games and the action oriented RE 5 &amp; 6. The controls are rather clunky if you’ve played the later games (like me) and the graphics are dated, which should be no surprise since the game is over 10 years old (and is a console port). I remember the old version of RE 4 didn’t even have an exit option, you had to alt + F4 to quit the game. They fixed that for the Steam version though.  I’ve never played the first Resident Evil games since I play games on PC, but if you have then I’m sure you’ll recognize the main character Leon Kennedy. As Leon, it’s your job to find and rescue the president’s missing daughter Ashley from a cult of zombie-like villagers in a dark and gloomy farming village. You find almost immediately that despite appearances these villagers are ferociously and fanatically protective of the area, and will attack you on sight with any weapon they can get their hands on. Fortunately they’re mostly slow moving… like zombies. The villagers are being controlled by the cult leader through the use of an ancient type of parasite called Las Plagas that can cause grotesque transformations in victims, which means monstrous enemies for you to fight!  You control Leon through the third person perspective which is kind of badly implemented because Leon covers about a quarter of the screen at times and the slow camera control makes it difficult to see around him. Since the game was a port from a console, you have a slight advantage with keyboard+mouse when it comes to aiming your gun, but the game is pretty forgiving when it comes to where your bullets go. The enemies will run up to you, but when they get within striking distance they suddenly start walking really slow, giving you some time to aim and shoot. If you get a headshot, the enemy will flinch and give you a few seconds to walk up and do a roundhouse kick. The kick option is only available if the enemy is stunned and it’s not even that strong, but what’s important is that it will knock the guy down so you can run over and stick him a few times with your knife. This is something you will absolutely have to master, because ammo is scarce enough in the game that you’ll need to use as little as possible on each enemy.  Speaking of ammo, you have limited inventory space to store ammo for all of your weapons. In fact, inventory space will probably limit your choices in weapons more than cost, because if your inventory is filled with guns, you won’t have space for ammo, grenades, and healing items. Throughout the game you’ll get the opportunity to buy more inventory space, but it never gets comfortably large. You’ll always have to pick and choose what you want to keep and what to sell.  Pros: +Spooky environment, an engaging story, and an assortment of creepy enemies to fight, from the slow moving villagers to the giant bosses. +There’s a lot going on in this game: puzzle solving, running for your life (with quick time events), and mini games such as a shooting range. All of which adds up to a long and entertaining game. +There are a couple of bonus games in there after beating the main campaign. You can play as Ada Wong in 2 short campaigns that add a few more hours of gameplay. It took me about 24 hours to beat everything, though I may have spent more time than necessary killing every enemy I could find.  Cons: -The controls are really hard to get used to since the mouse look is so slow and you cannot move while aiming your gun. Speaking of which, it’s sometimes annoying how weak your guns seem.  -While playing the Ada campaign, the game’s movie cutscenes are really, really low quality. It’s a technical issue, but if you’re playing the game in 1080p and suddenly one of the movie cutscenes occur, you’ll wonder what the hell happened to your screen.  Overall, the game is worthy of your time, and if you plan on playing Resident Evil 5 and 6 after, you should probably play RE 4 to know what’s going on with Las Plagas and Leon. Be warned that the game can be quite difficult for new players on your first run through. Difficulty doesn’t affect Steam achievements, but you cannot change the difficulty during the game unless you keep dying in the same place, and the game asks if you want to try easy mode. ",
            "review_score": "1"
        },
        {
            "review_text": "good game.   why the ♥♥♥♥ leon's hair is so emo  ",
            "review_score": "1"
        },
        {
            "review_text": "One Guy. One Guy kills a huge ♥♥♥ lake monster, a giant Gollum, saves Princess Peach, kills a mutated-bigass mayor and basically destroys his village and it´s inhabitants. Goes to Hogwarts Castle for 'parasite activities', takes on blind Wolverine Cosplayers, Crossbow-Jerks, mutated-acid spitting insects, giant Gollums (again), rides a Minecart through Hell, escapes Napoleon´s own moving Statue and takes on Napoleon himself. Then he proceeds to destroy a Research/Military Island. All the while he kills the incarnation of the Band 'Iron Maiden', rides a Bulldozer with Princess Peach, kills another, rather unknown band called 'U-3', dodges lazors like in a cheap Matrix Movie and settles things with the 'Traitor'. Finally, he kills the Mastermind who was responsible for all of this and escapes together with Princess Peach on a Jet-Ski to get laid. All the while, he finds drugs to cure his wounds and to improve his health (Legalise Weed!) and sells treasures and goods from the people he kills to a teleporting Merchant who may or may not be the TRUE mastermind behind everything! Also Ada Wong appears, from Resident Evil 2. You probably heard from her.  10/10  Would Suplex again",
            "review_score": "1"
        },
        {
            "review_text": "sometimes i cover myself in marinara sauce, lay in my bathtub in the fetal position, and pretend i am a meatball.",
            "review_score": "1"
        },
        {
            "review_text": "It's Resident Evil 4. Of course it's great. If you haven't played it yet, why? One of the best 3rd person action games ever made and the port isn't total garbage.   This is also the only port that allows 60fps gameplay, which after playing is impossible to go back to 30. 60fps can cause slowdown after menus or pausing, but it can be fixed by pausing completely and then unpausing. Also, free look can be somewhat problematic but it's entirely manageable.  Plays surprisingly well with the Steam Controller with correct configs.  just buy it and get your head choppde off by the chainsaw man. 9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 is the (much beloved) black sheep of the Resident Evil series. While still maintaining the classic tank control scheme from a new perspective, Resi4 takes the prerendered action adventure series and turns it into an arcade action game. While the over the shoulder camera angle and setpiece levels lends itself as a more cinematic adventure, Resi4 is a thoroughly mechanically focused game and uses its tight and limited camera angle to create a claustrophobic survival thriller experience which no other game has managed to successfully replicate, including Capcom's own later efforts. If there is any grand flaw in this game, it's that Capcom explored the gameplay experiences this sort of 3rd person combat could provide so definitively in this one game that ironically it sort of refutes the need for another game to follow up on what this game provided.   My only hangup is how mediocre this port is. I was almost ready to give this game the thumbs down because I was struggling to make this port work at all. Resi4 was never optimized to run at 60 fps, and that sadly remains true of this port. I ended up playing the game at 30 fps in order for it to be playable. This might be the only pc game in which anyone would recommend playing at 30 fps over 60, but there are other reasons besides optimization. It's clear that this game was designed to be played at the 30 fps mark, with mechanics, play speed and animation timing all built around a locked 30 fps. This isn't so much a failing of Resi4 or Capcom, but more a testament to how thoroughly this game was built to run for the system it was originally made for. There is nothing wrong with building a game around the limitations of the hardware it was meant for, many classic console games were made for the purposes of playing well on their native console. But it also means that when straight ports such as this one are made that they risk turning off die hard pc fans who refuse to drop below 60. If it's any consolation, this game plays very well at 30, and is one of the few pc games I'd ever play in which I was happy to play at 30 fps. This thumbs up is for how great Resi4 is to this day, despite the quality of this port and not because of it.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Scary and tense game play Perfecetly paced with a nice amp up on difficulty Memorbale bosses Some great side characters Presidents daughter isn't a terrible escort AI. She was pretty easy to manage  Cons: Some weapons seem useless The dialouge is sometimes terrible Doesn't add much to the lore of the series  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Almost as good as Resident Evil 6",
            "review_score": "1"
        },
        {
            "review_text": "The best looking and smoothest RE4 you'll find. Textures have been improved a bit, looking almost as good as L4D2's, The keyboard and mouse controls come 2nd best to the Wii version. If you've beaten RE4 a long time ago and want to revisit it, THIS is the one to play. If you're new to it, don't judge it harshly. The controls are like a tank (old school) and the graphics still have a 2005 vibe to them but much much cleaner than before. If you haven't played any RE game before, this one is good to start with as it doesn't have zombies from earlier in the series, instead has a different plague. As of now, the game needs patch for some small issues, and a big one that's not in the main story mode. That shouldn't stop you from buying it. It's an excellent survival horror/action. Something I should note, the game's speed is tied to the frames-per-second (like an emulator). There are 2 FPS settings: 30 and 60. If you can't keep a steady 60, try 30. If you can't keep a steady 30, give up. lol.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing classic. At the moment has a few slowmotion problems, but there are numerous fixes out there for MANY people. I used to own the PS2 edition way back; me and my step brother used to play this ♥♥♥♥ all night... great times. Play it with a controller to for the best/more enjoyable experience; this game was never designed for keyboard+mouse and it shows. 10/10                                                                                                                                                                                                                                                          ",
            "review_score": "1"
        },
        {
            "review_text": "Leon wouldn't have made out far without Ada.",
            "review_score": "1"
        },
        {
            "review_text": "After my fourth playthrough of this game I can say that it still holds up years later. The controls are stiff, moreso than I recall, but other than that it remains one of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "My Fab game from reisdent evil games.  I'm happy it was given to HD when I play 100's of hours on the ps2 version. When it become HD though I feel that Dark atmosphere is gone and that resident evil feel of survival and horror is pretty gone. It looks like your playing an average third person shooter.  You do have the choice to pick HD or not so you can get the feel of what the game used to be so It's not that bad but I Think the atmosphere Is what makes Resident Evil special in background. Becides that. the game is amazing. 3 Main areas Village,Castle and Island (sounds dull but that's the names) One bad part about this game I think Many would agree is Ashley. A whiny, annoying little girl that everytime she's in danger, it sounds like she dropped her milk at school. over half way of the game, Leon on his own and that's the shine of this survival Horror, not a girl piggy backing you.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, honestly this game is the BEST in the series by far (exept for ashly :3). Like I love this game to the point of replaying this game 17 times total on two platforms. This game gets a fat thumbs up and recommened",
            "review_score": "1"
        },
        {
            "review_text": "People have been telling me how great this game is forever! They weren't exaggerating! BUY THIS GAME! Just make sure to install the patch for the game before playing, change the aim mode to modern and increase sensitivity. If you can't grasp the wonkey keyboard and mouse controls, just change the run key to MMB. Makes it so much easier to handle.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game after beating it 7 times on gamecube, first trying it on my cousins wii in 9th grade, playing separate ways, ashley calling you a pervert, the hormones kick in when u control ashley and crawl under desks in 1 part of that mission, flash nading the parasites from the head, farming all the treasures, rifle headshots on chainsaw ppl when they're down after u shotgun them, or rifle shots on el gigante parasites, much damage, much fun, controls are iffy though cause mouse fights with camera control when turning and looking, try playing around with modern or classic controls, or try a controller.",
            "review_score": "1"
        },
        {
            "review_text": "The great game released a decade ago finally given the the chance to shine for PC gamers. the HD filters give the game a new shine that i enjoyed and full controller support made gameplay smooth and sharp.  If you are are true fan of RE don't pass this up.",
            "review_score": "1"
        },
        {
            "review_text": "5/5",
            "review_score": "1"
        },
        {
            "review_text": "No gravity , no falling damage Leon &gt; Physics",
            "review_score": "1"
        },
        {
            "review_text": "Shot a crow and it dropped a hand grenade.   10/10 would shoot crows again.   ",
            "review_score": "1"
        },
        {
            "review_text": "this game is like if you took a cute girl out on a real nice date real classy place she's a real upscale dame and it's like 'dang I gotta do good and impress her'  then halfway through dinner she gets bored and just rips off all her clothes and you bang in the middle of the restaurant for like six hours and nobody stops you because it's pretty hot  buy this game unless you're small time",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 is by far my favorite Resident Evil Game. The game stars Leon (first introduced in Resident Evil 2) as he searches for the President's daugther Ashley. He finds the both of them injected with a parasite called 'Las Plagas' by a man named Sadler and must escape while searching for a cure and a way to stop Sadler. The game moves away from the T-Virus and focuses on this new threat. The game is an over the shoulder Third Person Shooter game unlike other RE titles, and brings a bit more action to the table. Unlike future installments however, RE4 doesn't ditch puzzles entirely and there are still a few great ones. While Leon has access to more weapons and ammo then other games, Enemies are a bit more tricky. Some will try to dodge his attacks, while others will sprout a Las Plagas upon defeat that takes over their body (Not unlike the Anime/ Manga Parasyte). The game has quite the few tense moments (like the one hit Kill Chainsaw Weilders) but is not too difficult. My one major complaint is the lack of Subtitles when playing with the Language set to English. Other than that, RE4 is an awesome RE game that stands at a comprimise between the older titles, and the action based Resident Evil 5 and 6",
            "review_score": "1"
        },
        {
            "review_text": "You go to Spain and kill people...... Also you run from a boulder that you sadly can't punch because you're not Chris :(",
            "review_score": "1"
        },
        {
            "review_text": "Truly a gaming masterpeice. It hasn't aged a bit and this port is perfect. Looks absolutely stunning for agame released 10 years ago. Can't wait to see what this game looks like when it's re-re-mastered. Face it, we know it will happen, and no one cares, we'll buy it as many times as it's released.",
            "review_score": "1"
        },
        {
            "review_text": "RE:4 is a classic. It has been ported over many times to different platforms and for good reason. This port in particular is an excellent one, adding HD textures and aditional extras that didn't ship with the original GameCube on its initial launch. The game features great controller support, but I've found that a mouse and keyboard to be my new favorite way to play.   If you're new to the game, this is currently the best way to get into it.   PROS:  Gripping story Solid mechanics Satisfying inventory system Replayability with different modes unlocked Solid 'level' design  CONS: ♥♥♥♥ menu options Menu navigation could use work with kb+mouse  Overall I'd give the game 8/10. The game would of been a perfect 10, but I feel like the atmosphere lacks a little in this game. Something the RE franchise lost over time, but it doesn't disqualify this entry from being one of the best in the series.",
            "review_score": "1"
        },
        {
            "review_text": " Quick Breakdown:  A remastered version of Capcom’s 2005 horror classic. At times a slow paced survival game, punctuated with bursts of more frenetic third person shooter action.  Length:  20-25 (Main game), 30+ (Main + extras)  Genre:  Survival Horror / Third Person Shooter / Action  Score:  8.5/10  Review Date:  2016-07-04   Full Review:  Having not initially played this game until almost a decade after its release, it’s more difficult for me to fully grasp the impact it originally had on the industry, and while I’d love to go in depth with that, I’m just not familiar enough with those details. Instead we’ll focus on what we have here, which is a game that is still fantastic to play, even for the first time.  You play as Leon Kennedy, as US government agent sent to rescue the President’s daughter from a crazed cult in Spain. While doing so, he uncovers a more sinister plot involving a mind controlling parasite known as Las Plagas. It’s a pretty decent story, and more than enough to keep things interesting.  On to the meat of RE4: the gameplay, and it’s solid. The controls are a little bit dated, utilizing tank controls, in which your character turns left and right instead of strafing, and the mouse aims without changing the camera angle. It took some getting used to, but probably 2 or 3 hours of gameplay, but it was worth it in the end. While I certainly prefer more modern controls, they at least works for the game.  The game starts off very slow paced, very much a survival horror game in its early stages, having to scrounge around for weapons, health, and ammo, and just barely managing to scrap by. Resources eventually become a more easily manageable thing in the later game, once it transitions to be more action heavy. That’s not to say you can ever stop worrying and just coast without thinking of supplies, especially since you have to play inventory tetris. You have a limited amount of carrying space, represented by a grid, which each item taking up one or more grid spaces, and in various shapes representing the item itself. It’s not the perfect system, and it has its drawbacks, but at the same time it has a charm to it that does add a unique element to the game, while managing to benefit the survival element of the game.  The game has a good horror atmosphere, featuring unsettling environments, and a host of interesting enemies, from crazed villagers, horrible beasts, parasitic lifeforms, and religious fanatics. The bosses in the game are massive, colossal behemoths, grotesquely deformed parasites, and a hell of a lot of fun to fight.  Some of the game seems to draw a lot of inspiration from John Carpenter’s  The Thing , which given that it’s one of my favourite movies ever, is certainly a good thing. This can be seen in some of the enemies (Las Plagas seems to borrow some inspiration), and especially a level in the later part of the game set in a frozen laboratory (which also calls to mind the original  The Thing From Another World  from 1951). Possibly I’m drawing more connections between the two given that I greatly enjoy each, but it’s nonetheless something that I can’t help but notice and chalk up as a positive.  If there’s any downside to the gameplay that jumps out, it’s the quick time events, which add little-to-nothing, and are sometimes frustrating. There’s even a QTE or two where some people had to turn down their graphic settings, else they’re impossible to pass. I don’t remember if I personally had this problem, but I know my brother did, and he played on a machine similar to mine. For reference, one of them was the QTE at the end of an action filled mine cart passage (which in itself was a lot of fun), but the QTE involved rapid button mashing.  The game itself looks beautiful, the remastered graphics manage to really bring out the environments and enemies. I haven’t played any of the previous versions of the game, but from what I’ve read poking around online, this is the best version to play if you’re new to the game. If you’ve already played the game before, there’s no need to play through this again just because it’s been remastered, unless of course you simply want to play it again since it’s a great game. (Something I myself intend to do at some point).  The main game itself will take you around 20 or so hours to finish the main campaign; though I think I took a bit longer than that myself, adjusting to the controls, and exploring everything. (Not that I got 100% or anything). There are a few bonuses that you manage to unlock by finishing the campaign, a pair of mini-campaigns where you play as Ada Wong, which will take about an hour or two each, and are a fun romp.  There’s also a mini-game, called The Mercenaries, in which you can play as 5 different characters (4 of which must be unlocked), and your aim is to earn as high a score as possible before the time runs out. Points are earned by killing enemies, with combos and boss enemies rewarding more points. It’ll help kill at least an hour or so just dicking around, and it’s decent fun.  If you’re a fan of horror games, especially survival horror mixed with action, this is a must play. Otherwise, it might not do much for you, but it’s worth at least a try if it piques your interest.",
            "review_score": "1"
        },
        {
            "review_text": "Better than sex, 6/10",
            "review_score": "1"
        },
        {
            "review_text": "some people have beat this game faster then it took me to figure out have to reload. that is dedication.",
            "review_score": "1"
        },
        {
            "review_text": "Where's everyone going. bingo?",
            "review_score": "1"
        },
        {
            "review_text": "A really good port of a PS2 classic...also, your right hand comes off?",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Best compliment I can give a video game, owning a copy on multiple consoles. I first bought Resident Evil 4 back in 2005 for the Nintendo Gamecube. Back then it was amazing, and it still is. Add on the remastering and additional content, and this is the definitive version. Needless to say, this is the best Resident Evil out of the more modern games. Though I'm a diehard survivor horror fan, I still enjoy this game simply because it is good. I know some people out there believe that this game is bad because it's more action based rather than horror, but I don't really care. Whether or not you like this game, you still have to acknowledge that this game was innovative. Innovative in the sense that it was one of the first games to popularize the over the shoulder camera angle. At this point I'm just rambling so I'll end this review by saying that this game is a must own, no matter whether you're a Resident Evil fan.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best shooter games out there. Totally recommended.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING VERY LONG REVIEW COMING YOUR WAY!  I highly recommend this game because I am a hardcore fan of Capcom and the Resident Evil franchise! I have been playing Resident Evil games since I was 4! My first Resident Evil game I played was Resident Evil 4!  I got a GameCube and Resident Evil 4 for Christmas when I was 4! Eversince then I have beaten the game 57 times! I have this game for every game system Playstation 3, Playstation 2, GameCube, Wii, PC, and Xbox360. I have put around a total of 8-10,000 hours into this game in my entire life! This game is by far my most favorite game EVER! I have put this game at the top of the list ever since I got the game! Some of you may be thinking, why would a mom let a 4 year old play this? My mom is a nerd thats why and her favorite game series is Resident Evil! So I was introduced to horror/survival games at a young age! horror/survival games are now my favorite types of games and I am proud because I didn't wanna end up like one of those idiot people who play just CALL OF DUTY and say they're true gamers! NOW I AM GOING TO BE TYPING WHY I LOVE THIS GAME SO MUCH! ------------------------------------------------------------------------------ MAY CONTAIN SPOILERS! * You have to play the game multiple times to figure out where all the jewels and hidden objects are! * Saving and conserving ammo is crucial! * The game gives a scary/thrilling feel to it! * You are Leon! (Leon is BEST Resident Evil Character!) * Your mission is to kill people possesed by a disease controlled by Osmund Sadler! * Protecting Ashley can be annoying at times but it just adds more difficulty to the game! -------------------------------------------------------------------------------------------------- I DO HAVE TO ADMIT THAT RESIDENT EVIL 4 DID CHANGE the Resident Evil series forever but re4 is still a great game! (I DONT REALLY ENJOY THE NEWER RESIDENT EVIL GAMES AS THEY SLIPPED AWAY FROM THE HORROR :()   TO CAPCOM- PLEASE BRING BACK THE ORIGINAL FEELING THAT WAS IN RE4 AND EVERY RESIDENT EVIL BEFORE THAT! Your slipping away from horror survival! Come Back!",
            "review_score": "1"
        },
        {
            "review_text": "i play this game end  and love it so much first time i play in ps2 and this is awsome hard to tell  grate story and mystery",
            "review_score": "1"
        },
        {
            "review_text": "Finally I can use a trainer to keep wearing Leon's jacket through the entire game.  10/10, 10/10 best game. Best game every year.",
            "review_score": "1"
        },
        {
            "review_text": "I JUST NOW Finished Resident evil 4, and here are my thoughts. Resident evil 4 is trully a game ahead of its time. It's infulence is felt to this day. Is it the masterpice it was back in the day? Not really. Is it good today? Yes. The game has aged, but its still fun. Some regard this game as one of the greatest games ever made, and i see why. For me, a game should be in a greatist list because of what it did to evolve its genre, and still hold up decently even when the shine wears off and the times change. In this regard, it is a masterpice because of its legacy, and because it does stand the test of time in 2016 aswell.   Resident evil 4 is a class act, a classic. Is it perffect? No. There is no such thing. But its part of gaming history, it deserves the love and respect gamers have for it to this day .",
            "review_score": "1"
        },
        {
            "review_text": "more less the same as you remember from 10 years ago. only difference is its now in HD and instead of finding the shot gun in the village they now start you with it by default. if you liked it then get it. if not then dont. i for one will reccomend this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good that if you played it and liked it you'd love to visit it back. And I did with the best aiming control: the mouse. If that's enough to get you interested then you should try it.  Aiming is responsive, but is needed to remind you the trembling of the aim is a game thing present in all versions, not just 'unresponsive aiming'. Game also responds pretty well to 360 joy. Also, for better control go to options and set aiming in Modern.   If you didn't play this game but loved Dead Space and Evil Within, it may be very hard for this game to scare you, but combat is great. A very influential game, so influential than ruined or saved Horror games, depending on who you ask.",
            "review_score": "1"
        },
        {
            "review_text": "Ah yes! Here we go once again!  I played this.. A LOT on the ps2. Had a save where i was on number 10 round.  I did play the 2008 port for the pc. Cried a little. BUT here we have a new PC HD Remake! 60 FPS ! To be honest i have been waiting for this for a long time!  And the lighting and textures are Certainly improved!  The mouse controls are a little wonky! That's why i'm sticking to a controller cuz that's what i'm most familiar with when it comes to Resident Evil! :D You can check out my screen shots if you want! Anyway i highly recommend this Game!",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely recommend this game to everybody. It has such a great atmosphere and you always feel on edge while playing. There are so many parts of the game that will scare you if you are new to these types of games, however once you encounter them you will remember them forever. The Regenerador is the best example of making the game ten times scarier than it should be since he will be around a corner at random moments. It's been at least five years since I've played this game to it's fullest, unlocking each and every weapon (excluding the Handcannon there is no way in hell I'm doing 5 Star for everything on Mercs mode) and have completed Professional Mode for the first time. As I said before, this is just such a great game and I advise that everyone should at least try this game out.",
            "review_score": "1"
        },
        {
            "review_text": "Childhood nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "I know the bad camera and being unable to move while reloading or swinging knife was by design and isn't because it's a bad port (it's not), but it was still annoying. That's the end of my criticism, this was really fun. So fun it made me want to buy Resident Evil 6 just so I could play as Leon again. Plot's kind of silly but this is Capcom and your mission is to save the President's daughter so I kind of went into this knowing where the bar is set.   Four out of five Lennys ( ͡͡ ° ͜ʖ ͡ °) ( ͡͡ ° ͜ʖ ͡ °) ( ͡͡ ° ͜ʖ ͡ °) ( ͡͡ ° ͜ʖ ͡ °) ( )",
            "review_score": "1"
        },
        {
            "review_text": "So where to start. The game is Resident Evil 4. It's now a decade old. It's the game that took a drastic shift in gameplay from its original fixed camera survival horror predecessors, and to many it was a revolutionary step for the Third Person Shooter genre. It’s an incredible game in itself and I enjoy it so much more than many of the games today, but arguably some of the mechanics have aged over time. It’s also where all the problems began leading up to its less popular sequels.  Resident Evil 4, while having an eerie horror like atmosphere, is by no means ‘scary’. Previous installments left you very vulnerable (a common trait in Survival Horrors) with scarce ammunition and weaponry. Resident Evil 4 isn’t really a Survival Horror so to speak, it’s more like an action adventure game with a horror setting. And that only counts for 2/3rds of the game until it diverts from that atmosphere. After that once you get to the island, it turns into an action game. Leon is practically armed to the teeth as a one man army by the time he reaches Salazar’s castle and ammo is so plentiful that you have to be a complete dunce to run out of it. Enemies are a lot more common and come in hordes for you to slaughter with ease unlike the traditional survival horror games that have spread out opponents who engulf the atmosphere since you have to conserve your ammo. So there basically isn't any tension outside of the damsel in distress needing saving, but that’s easily negated by placing her in a corner far away. I never actually had to heal Ashley whatsoever.  Nevertheless, it’s the last real RE that has an actual horror setting. By the time the series came to RE5, it lost that horror element in so many ways. It’s definitely a must buy, but I suggest also buying the original Resident Evil if you wish to compare and contrast the differences between the two, as RE4 definitely changed the formula for better or worse.  Crapcom has a tendency to make sloppy ports so a couple of issues I need to address:  The game, for some unknown reason, takes up more space than Resident Evil 5. Not a big deal in this day and age since it's only 10gb, but it's still nevertheless strange.  The game can start dropping rapidly in FPS during various moments. I have no clue why, but it will start hiccupping if there is flames or other things going on.  Use a console controller or something else than a keyboard. Capcom never bothered to concentrate on making a smooth transition to Keyboard and Mouse so it comes off a little wonky when aiming.  Change your video settings to 30FPS when you get to the god damn mine cart. There’s no save point in the second Mine Shaft and the part where Leon is attempting to lift himself up is impossible to do on 60fps no matter how many times you smash the button during the quick time event. Capcom has never bothered to address this issue.  The Separate Ways campaign that is unlocked once the game is completed was originally made for the PS2. All the ingame cutscenes in the campaign look like complete ♥♥♥♥ because it's ripped directly from the PS2.",
            "review_score": "1"
        },
        {
            "review_text": "1 - Kill zombies, save the girl, ♥♥♥♥ the girl, get the ♥♥♥♥ out in a ♥♥♥♥ing jet ski. 2 - UM FORASTEIRO!",
            "review_score": "1"
        },
        {
            "review_text": "FOr those who never play resident evil games, i would certainly recommend this game as well for RE remaster edition I have completed both on the wii and pc, idk how many times i have completed in different difficults but its that awesome",
            "review_score": "1"
        },
        {
            "review_text": "Good remake of one of my all time favorite games, new HD texures and smooth 60fps gameplay, pretty buggy im some parts but im sure that will get fixed....i hope that will get fixed",
            "review_score": "1"
        },
        {
            "review_text": "Great Game ! It reminds me very good moments on the old version :) And it's always a pleasure to play Leon and Ada !!! ヾ(＾▽＾)ﾉ (Some problems with my 'no-xbox' pad but It's solved with a modification of the config.txt)",
            "review_score": "1"
        },
        {
            "review_text": "Tried to look up Ashley's skirt because I'm a pervert...?",
            "review_score": "1"
        },
        {
            "review_text": "resident evil 4 / biohazard 4 is a game that I recommend because: - is a method to banish boredom  - it has an acceptable price - it is a nice survival  - it has a good graphic - it is atmospheric - it has a good soundtrack - it has zombies - it has trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "hang on, sweetheart!!  on the real tho, GOAT game here,   PROS:   Leon! HELLLLLP LEOOOOOOON!  CONS:  uuhhhhhhhhhhhhhhhhhhhhhh goethma cohetha mrrrrrrrrrrrrrrrrrrrrrrrrrrrrr  great game and great version! resident evil 4 HYPE!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "have to say love this game on wii but on here its so slow , sometimes the speech goes off and controls are not as good on mouse and keyboard. wishing i hadnt purchased this now maybe i will use a different type of controller to see if helps , as for leon running i could walk faster . ended up playing in 800 x 600 screen resolution made it run alot faster and leon not stuck in treacle anymore",
            "review_score": "1"
        },
        {
            "review_text": "The Resident Evil that changed it all.  A classic that must be played by all survival horror fans and maybe everyone that enjoys a good third person action game.  It runs smoothly on PC. Even though I didn't really notice the 'HD Textures', it still really holds up graphically in 2015. It has lots of content to keep you busy for a lot of hours too.",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the terrible play control this game has, it falls into the RE franchise quite well.  The superficial aspect of the game is good (graphics, sounds, music, etc.). The game mechanics are simple, but what do you expect from a RE game? Right now, the game seems linear, a nice well made corridor to follow that you cannot leave. :/  But what kills the game is the awful controls typical of a console game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Resident evil game ever made ?! Of course it is !! As we were waiting long time a steam version of Re4,we got it and also in HD ! Yeah the fps sometimes sucks at some moments,but that's not quite important. Had this on pc in normal version and ps2,ah damn childhood hehe. But let's take a more look on it !   SPOILERS INCOMING",
            "review_score": "1"
        },
        {
            "review_text": "RE4 is the best Resident Evil game period. The HD is a plus. Looks really good. I use a Xbox 360 controller. Feels better than keyboard and mouse. Buy this game its great.",
            "review_score": "1"
        },
        {
            "review_text": "First things first, people need to start this game with the mentality that this is a 2004 Gamecube game that inspired many of the tropes seen in Third Person Shooters made today. Given that, it's also an incredibly unique game in its own right. This game was designed around controversial 'tank' controls, and many people who are well adjusted to today's run of the mill TPS may be surprised to find that this game does not allow you to aim, shoot, or reload while on the move. Fear not, for the game has been from start to finish balanced and designed around this fact -- many encounters are designed such that you need to learn when to be shooting, and when to be moving to avoid enemy attacks; in this game they are two distinct actions that you need to constantly evaluate throughout a fight. The game mechanics are top notch, from satisfying melee's (Can you imagine suplexing someone so hard it blows their head off? It's amazing.), to an inventory system that will bring out the OCD in all of us. While it is true that one of the greatest games of the 6th generation is missing some of the current lineup's bells and whistles, if you go in with the right mindset, you'll find that Resident Evil 4 is impeccably paced, balanced, and thought out. The story is right about what you'd expect out of a Resident Evil game; it's a cheesy B movie, filled with memorable one liners (I see the president has equipped his daughter with... ballistics) and villains you'll remember far after you've disposed of them. If you like cheesy, this is the game for you. If you like games full of pretense of greater meaning, you'll need to look elsewhere. And finally, the game as a PC port. As a long time fan of Resident Evil 4, and a purist, the PC port is everything I could hope it was -- controls are intact, the sweet deadzones left untouched from the Gamecube version, and minus a specular effect here and there, uses the (at the time jaw dropping) assets from the Gamecube version. Textures might stick out to people accustomed to newer games, and yes, you're right, there are no fancy lighting effects, but the game has a clean aesthetic that doesn't blind you from the love put into the game's visual design. There is an HD texture pack available in the menu, however I've found that many textures fail to be consistent, from overly clean wood in some places to the old SD textures in others. Many find them an improvement, while I personally stick with the SD textures, because they are more consistent. The 60 FPS feature is... rushed. If your computer can handle it with no problem, 60fps is a beautiful sight to behold in this game. However some animations are still keyed to 30fps (A result of the game's Gamecube heritage) and can be jarring at times. Also, if your computer cannot run this game at 60fps for any reason, you will experience slowdown due to the way it is coded -- be aware you may need to set the game to run at the original 30fps to allay this.  All in all, I would recommend this to ANY fan of Resident Evil 4, as this is so far the most complete version to render above the original 480p, and the few hiccups present in the porting are mostly limited to the new additions, and a patch is sure to clear most of those up. For people just getting into it, be ready: This IS NOT A NEW GAME. Keep in mind that it's a Gamecube game that, at the time, revolutionized the TPS genre, and that it will have its resultant quirks, and you're sure to have a good time with this masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever made, eccept for the PC controls which puts it off a bit.",
            "review_score": "1"
        },
        {
            "review_text": "there once was a man from spain who feared he'd be caught in the rain but being in a hurry was the least of worries when dicaprio stabbed him right in the brain   11/10 would knife every enemy to death",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 Original Release: 2005 (Gamecube) Genre: Third Person Over the Shoulder (Inspiration for other great games with a similar angle), Horror. Game of the Year for Multiple Magazines &amp; Websites in 2005   + Great Graphics (10/10) + Fluent Controls for Controller AND Keyboard (9.5/10) + Achievements &amp; Trading Cards (NA) + Well Developed Story/Gameplay (9/10) + Very High Replay Value (9/10)  Overall Rating: 9.5/10 (All games aren't perfect, especially this one, the only complaint is that CAPCOM should have released a BETTER port on PC earlier)  I strongly recommend this game to those who haven't played it before AND those who enjoy the series. What's not to love with running at 60 Frames Per Second? Pure HD graphics? Full controller support? This game IS a port that should have been done along while ago. However I'm finally relieved that they released a great port such as this one.",
            "review_score": "1"
        },
        {
            "review_text": "good ♥♥♥ classic ♥♥♥ game to play on controller",
            "review_score": "1"
        },
        {
            "review_text": "One of the Greatest games in the Resident Evil franchise. I remember playing this back when I was 8 years old. It scared the s#$t out of me.Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Old but Good. Resident evil 1 to 3 is better. But this beat Resident evil 5 and 6.",
            "review_score": "1"
        },
        {
            "review_text": "9.3/10",
            "review_score": "1"
        },
        {
            "review_text": "The Merchant   15/10",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  AlphaLegion Review: Resident Evil 4 Ultimate HD&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "One of the best in the series. It's the first to deviate to a fast paced action game, but still gives off a suspenseful horror feel with the over the shoulder limited view. I'd recommend this over 5 or 6 any day of the week. This is the game 5 and 6 tried to emulate and recapture the magic but failed to do.",
            "review_score": "1"
        },
        {
            "review_text": "finally, a version of RE4 on a system that I still own. it even has mouse aim! and there's some minor bugs but they didn't prevent me from acing everything across the board.",
            "review_score": "1"
        },
        {
            "review_text": "thirty lice",
            "review_score": "1"
        },
        {
            "review_text": "awesome game the best of Resident evil , this game is so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games of all time. If you haven't played this you are missing out!",
            "review_score": "1"
        },
        {
            "review_text": "a REALY good game ;) one of the best resident evil games released ;)",
            "review_score": "1"
        },
        {
            "review_text": "The Resident Evil that changed it all.  A classic that must be played by all survival horror fans and maybe everyone that enjoys a good third person action game.  It runs smoothly on PC. Even though I didn't really notice the 'HD Textures', it still really holds up graphically in 2015. It has lots of content to keep you busy for a lot of hours too.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME EVER!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "resident evil will always cater to my deep dark fantasy of minority genocide",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure I would love this game, if it ran on my computer.",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 still hold up after all this time. I loved this game back on the PS2 and Gamecube, and I am pleased to find my love of it has nothing to do with rose tinted goggles.  As for the port itself, it has this wierd issue where if you're running it at 60 fps and your framerate drops for whatever reason, the game slows down. It's wierd as all hell, but it's not a gamebreaking thing (unless your computer is really really REALLY old). The options also leave a bit more to be desired, but it's enough to get the job done. And the port is still functional, runs smoothly, and doesn't CTD.  Bottom line: It's a funcitonal, if a little underwhelming port of a fantastic game that is still a dear favorite of mine. Don't pass up on this, it's fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Let me start this shïte off by saying that outta my many hours of playing this game, I've only had it crash or ♥♥♥♥♥ up ONCE. And that was (evidently) not a reproducible error or anything.  Seriously, the sheer stability of this game alone makes it a digital architectural masterpiece, and that's just mentioning that one freakin' subject!  Moving on, the gameplay is either difficult or easy to explain. Ever played Dead Space? 1 or 2. You have? Great. You'll feel right at home. Just aim for the head instead-a the arms, otherwise it's basically the same kinda gameplay.  Sound? Well, shït... there's nothing to report there. It works, no glitches or issues, but it's not something you really nerd-fap to or whatever.  Story? Ehh... it's cheesier than your mum's cooch, but it works. Kinda tongue-in-cheek (or at least I hope so... it's Capcom, after all. The lousy hacks...)  Length? Lemme put it this way... ever played NG+ in Dead Space? SAME THING. AGAIN. I swear, DS must-a ripped RE4 off BIG TIME for 'inspiration'. Simply put, you can play the game over and over with the same savefile a hundred billion times if you gots the time for it. (I sure as hell don't.)  So, bottom line... is it fun? Yes. Yes it is. But is it worth the price? Ehhh... maybe. If you're a massive fan of RE4 (and really, let's face it, that's the only GOOD one in the entire freakin' series!), then yeah. It's worth it. Hell, a freakin' GameCube copy of it'll cost you at least twice that of Steam's askin' price! And then there're the sales...  Anyhoo. Score-stuff. It's a solid 9/10  The lack of subtitles unless you play in japanese is just ♥♥♥♥♥in' ♥♥♥♥♥♥♥♥, but fortunately the voice-acting is good 'nuff to not warrant subtitles as a necessity. It's got full controller support, so us PROPER RE4-players will feel right at home, too. So yeah. Definitely good, but not perfect. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "best game ive ever played in my life",
            "review_score": "1"
        },
        {
            "review_text": "A swole, bald bearded spaniard walks up to you with 2 goons. Do you: A: Use your ever so handy gun. B: Roundhouse Kick. C: Use your gun, then roundhouse kick.  If you answered B or C this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "You play as young Leonardo Dicaprio rescuing a monkey. Game is fun and very spooky, definitely recommended!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made in my opinion unlimited replayablity, on my well over 20th play through over the last 9 years never a dull moment.",
            "review_score": "1"
        },
        {
            "review_text": "this game was my horror when i was little and i watched my bro play it...i couldn't go to bed without nightmares and such now when i play it all it is to me is...'LEON!!!!! HELP!!!'",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. The only downside is that trying to perform some of the QTE's are impossible at 60fps.",
            "review_score": "1"
        },
        {
            "review_text": "If youre new to the RE/Biohazard Series, this is a great place to start",
            "review_score": "1"
        },
        {
            "review_text": "Last good Resident Evil from main series, RE5 and RE6 are disaster.   I wouldn't call this game ultimate HD edition. There is community true HD remaster patch coming soon probably by the end of the year. You can downlaod free demo, whole village section.Something to look forward.  Gameplay is not like in RE1 and RE0, its more action focused, but it is still game I would recommend to any RE or horror game fan.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, The controls might be wonky on keyboard, I wouldn't know because I use controller.  *The guns feel nice *The game looks ok, the fire is really good *Pretty cheese characters. *Feels fair, The game doesn't really screw you over   Some issues with it though - The cheesy characters, if you don't like dumb comments every convercation. - Ashley has a tendency to get kidnapped, and transported to another realm + you might shoot her in the face while trying to save her, this is a bad thing FYI - And the game gets all slow motion for no reason, which can be annoying - And it has crashed on me on doors, causing me to lose 20 min of progress.  Still pretty good, don't let the big cheese scare you. He is not really cheese, if that helps you face him.  9/10 would buy for full price (even at full price!)",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 is a game I have played for years, I owned on the PS2 then the Wii then the XBox 360 and now PC...But despite how much I love this game and the series (even if it has had it's downs *Cough* Resident Evil 6 *Cough*) I really can't fully recomend this game...for the PC at least.   If you do get it on the PC then use an XBox controller the reason is the Resident Evil series is kinda known for it's tank like control's and they aren't Keyboard friendly another thing is this games rather inflated system requirements...IT'S BEEN OUT FOR 10 YEARS (At the time of writing this) it should run on a toaster from the god damned 1950's  Gameplay wise the game is really good...without keyboard. The tank controls do take time to getting used to but once you do, the game is easy to play. The lack of a freecam means that you will always have blind spots and the camera is intentionaly slow to build up suspense and create tension. The puzzles are rather disappointing compared to the other games but at least they didn't completly remove puzzles (*Cough* Unlike Resident Evil 6 *Cough*).  So I do recommend this...but not as much as I would for other platforms  Resident Evil 4: 9/10 This Port: 6/10",
            "review_score": "1"
        },
        {
            "review_text": "its a classic, simple as that",
            "review_score": "1"
        },
        {
            "review_text": "Piece of ♥♥♥♥ stopped being HD right after the church bell. Maxed out with 970 looks no better than upscaled GameCube version.  The game itself is a timeless classic though despite this remaster being ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I Love this game, I really love it but for a reason or another, it runs too slow and the controls (even with a ps4 and ps3 controller) have a really slow response time...",
            "review_score": "1"
        },
        {
            "review_text": "pull the trigger kill the spaniards",
            "review_score": "1"
        },
        {
            "review_text": "Keyboard + mouse is terrible, especially for those accustomed to aiming with the keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "Best version of this game to date, i highly doubt that resident evil 4 will ever get better. Even if you have played it before it makes the whole experience even better.",
            "review_score": "1"
        },
        {
            "review_text": "This is hands down the definitive best version of Resident Evil 4, It has all the content of all the previous versions with enhanced graphics and smooth and consistant framerates. A must have for any fan of the series or of this installment in particular.",
            "review_score": "1"
        },
        {
            "review_text": "GOOD GAME. Two major problems here.  1, No subtittle for English. This is really bad for people who doesn't speak English as first language. Plus a lot of NPCs in games speak wired accent English. 2. The controling is bad. I Cannot use key 'A' 'D' to move left or right (A,D only turn left and right), and I cannot use mouse to change the direction of player's frontside. Only keyboard chaging, we need more controlling with mouse! Capcom plz this is a PC game.",
            "review_score": "1"
        },
        {
            "review_text": "There's always that one game you pretty much know inside out, for me it's Resident Evil 4. That being said, I am by no means a professional player here. I'm still scared of levels, I still dread encounters I know are coming, and I still end up missing a great deal of my targets - but it's fun. INSANE fun. Try using one gun, or only eggs, or using no health or upgrades and just running away. This may have lead to the decline of the series but at least it set a noteable benchmark.   Monsters, Guns, Upgrading, Headshots, Horror, Cults, Inventories, Attractive Girls and plenty of Gore.  I think that equals a well earned: Heck Yes!",
            "review_score": "1"
        },
        {
            "review_text": "Great game once you fix the random fps drops which is insanely easy so dont listen to people that say there is no fix the only thing that can hold you back is a old computer and i mean really old",
            "review_score": "1"
        },
        {
            "review_text": "After all these years, it is still an enjoyable experience to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game in which i would keep going back to i have completed it so many times since its realese in 2004 i have lost count. i have played this game that much that i know where every little tresure and little secret is even with not playing for years i could come back and still be able to find every little secret. i would definitely give it a 10/10 as i love the resident evil series on a whole except from resident evil 6 that was the most downhill it had ever been. ",
            "review_score": "1"
        },
        {
            "review_text": "Whenever Capcom™ messes up they re-release this game. Jokes aside, fantastic game.   P.S. LLLLLEEEEEEEEOOOOOOONNNNNN",
            "review_score": "1"
        },
        {
            "review_text": "i've beaten this game 3 times on the ps2 version, and i can safely assure you this game will teach you how to properly manage your inventory",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why i bought it, i told myself i've beaten this game enough, i told myself my copy on the PS2 still works fine and probably contols better, i told myself i have tons of other games to play and am tired of zombie games, and yet i bought it",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why i bought it, i told myself i've beaten this game enough, i told myself my copy on the PS2 still works fine and probably contols better, i told myself i have tons of other games to play and am tired of zombie games, and yet i bought it",
            "review_score": "1"
        },
        {
            "review_text": "HD remastered of the iconic resident evil 4 I got nothing bad to say on this game i played this before in my ps2. Now i played it on pc it still rocks. ",
            "review_score": "1"
        },
        {
            "review_text": "Its alright",
            "review_score": "1"
        },
        {
            "review_text": "My opinion Re4 better than Re Revelation, becoz zombies head can blow up.  Something cant happen at Re Revelation ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "great game.I loved it alot then on console and now on my pc.I like the hd edition they did a good job. although,I wonder about the dlc's if there are any...",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "It's good, play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is available for pretty much every device these days, so you might already have played it. But for me, the main reason for getting the Steam version was that it runs at 60 fps. Seriously, I have played this game on three different consoles during the past 10 years and now that I finally got to play it in 60 fps, it felt great. Framerates do make a difference, people!  IF you are one of those who never played RE4, well it's one of the most influental games of its generation and you can still see the effect it's had on 3rd person shooters today. It's not as impressive today as it was when it was first released on the GameCube, but it's still a great game that everyone who likes action/horror should get.",
            "review_score": "1"
        },
        {
            "review_text": "Still stands up to its reputation. Still keeps the classic survial horror people love.",
            "review_score": "1"
        },
        {
            "review_text": "A solid game that stray away from the original formula that was used in previous Resident Evil games and that we knew and loved. The third person mechanic works well to still provide that horror game feel while being a little more action based. The HD update looks very nice in comparison to the original game and allows you to immerse yourself more into the game. While it doesn't contain any zombies, it is still a very solid game that you should definitely play (or even re-play). 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games. Tank controls are a bit limiting in combat, but otherwise the game plays fine.",
            "review_score": "1"
        },
        {
            "review_text": "of course this game bringing back memories and it has graphic options something the last port to pc lacked   sure it has that slow motion glitch thing but still is pretty cool i actually wish they add a option to have the controls from the pc port before because the mouse isnt doing it for me otherwise great game",
            "review_score": "1"
        },
        {
            "review_text": "It's basically a higher resolution port of the xbox360 version which I have already completed.  Minor cons: - Forget playing with a mouse or keyboard - It's 16:9 only",
            "review_score": "1"
        },
        {
            "review_text": "my game is in slow motion.....does anyone know how to fix this? please help i love this game and want to play T-T",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "Such a good version of this game i swear! deffitanly a good purchase :D",
            "review_score": "1"
        },
        {
            "review_text": "Such a good version of this game i swear! deffitanly a good purchase :D",
            "review_score": "1"
        },
        {
            "review_text": "Well Played",
            "review_score": "1"
        },
        {
            "review_text": "obviously the best game in ever, so buy it",
            "review_score": "1"
        },
        {
            "review_text": "Angry Spanish people, guns and kickass one liners.  What's not to like?  you're smalltime / 10",
            "review_score": "1"
        },
        {
            "review_text": "If you have never played this game you don't deserve fingers",
            "review_score": "1"
        },
        {
            "review_text": "watched my friend get stabbed in the chest by a tentacle ♥♥♥♥. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The President's daughter has the best Ballistics.",
            "review_score": "1"
        },
        {
            "review_text": "for a very old (and ugly for a HD edition) game, its not optimized well, aside from that it's an ok story with great gameplay but i don't see myself replaying it anytime soon. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "were is The Mercenaries mode",
            "review_score": "1"
        },
        {
            "review_text": "STILL the best Resident Evil game by miles.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda don't know why I bought this",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games ever made. Gameplay, dialogue, graphics, all of it still is the pinacle of what an action game should be. If you have the GC version, this one has all the extras the PS2 version had, but without the crappy graphics. Optimization is ok, you can now play at 60 fps, with little to no slowdowns.  Do yourself a favor and buy this masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "It's like no matter how I try to turn the graphics down a bit, the game keeps playing so slow!  But I do in fact like this game.",
            "review_score": "1"
        },
        {
            "review_text": "An iconic RE that is fun, scary and takes you through a vast installment of enemies, guns and puzzles. And it doesnt stop there, as with all RE games, theres more on the side after completing the game.  Very highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game of all time in HD+Achievements+Badges+Steam Cloud+Steam Leaderboards+Xbox controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Best Resident Evil.  Of course, that could be the nostalgia talking.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite horror games &lt;3 love it ",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4  Developers Capcom Production / Studio 4  Release January 11, 2005  Genre Survival Horror  I first started playing Resident evil 4 on the gamecube I was 15. I loved this game right off the bat the story, people, music and gameplay all went together perfectly. I had only ever played one other resident evil game before this one. Resident Evil Director's Cut and loved that game as well.   Six years after the events of Resident Evil 2. You are Leon S. Kennedy, U.S. secret service agent. You just got your promotion and your first mission is to go out and look for the U.S. President's daughter who has been kidnapped. What you find in this rural area of Europe that you tracked her to will lead to you saving not only her but, the whole world from a deadly cult of parasite worshippers. It's a nice twist from zombies I liked this story it reminded me of stargate and the goa'uld.   The gameplay in this game is amazing. They got rid of the static camera angles and went third person over the shoulder perspective. You zoom in alittle when using any weapon and can interact with most objects in the game. You can break vases, doors, barrels, lights, etc,. You can kill fish and chickens. The Ganados (Cattle) the main enemies are slow moving pack hunters. When one spots you it will yell and any near by Ganados will come running. As you progress in the game you start to fight the parasites inside the Ganados and all of the other enemies. The Ganados are also very quiet at times if it wasn't for the music I sometimes would have not even known they were coming to get me. I was surprised and took an axe to the face a few times after I thought I killed them all but, missed that one that was sneaking around. I just love the combat it's so much fun. They're are a few quicktime events in the game mostly during boss fights to dodge attacks that adds some fun. It is possible to make though a few boss fights without taking damage if you are just good enough at the QTE's.  The graphics in the game were great even before it was remastered in HD. Now that it's in HD they are wonderful little details like the items in your suitcase look so much better and blood looks more red and definded. The main characters faces are much more detailed. Even the spiders on the walls in the village look better. They really took thier time when redoing the graphics on this game.   The music on this game is nothing short of a masterpiece. I love the erie music as you are just looking around the village and castle. It switchs up to a more up beat horror theme when a enemy spots you. The boss fights all have wonderful soundtracks. I can't say enough good things about the composers Misao Senbongi and Shusaku Uchiyama they did an amazing job.  Some pro and cons  Pros  Great story amazing gameplay wonderful music boss battles, normal battles, QTE's all seemlessly fit together. No more static camera!!! you can suplex enemies!!  Cons  I can't really think of any myself this game to me is a masterpiece.  My total score for this game is a 10/10 it has everything a horror survival fan loves! I recommend you play it!!",
            "review_score": "1"
        },
        {
            "review_text": "an all around decent game. nothing is particularly great, except my sense of nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Runs well but cant get past the beginning in the second chapter due to the graphics bugging out. It turned into a white fuzzy look and then took me to the shop guys shop, after exiting the shop it got all fuzzy + laggy and told me to press E to climb. I dont know why it's doing this but I still recomend this game. Plus if anyone can help I'd be very much appreciative.",
            "review_score": "1"
        },
        {
            "review_text": "Even tho this game is old i would still pay £20 for it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has dumb controls, on purpose, but it's a great game. If you want to play this game you should play through it. Hurry up it's getting damn old. Older than a geezer stuck in a time machine going in reverse.   ",
            "review_score": "1"
        },
        {
            "review_text": "I've played through this game so many times now, not counting the steam version. Basically, you control a Ken doll through Spain and kick ♥♥♥. A perfect fit for survival horror fans and gun nuts.̶ +1 point for hot MC",
            "review_score": "1"
        },
        {
            "review_text": "it an amazing game but the sound comes early",
            "review_score": "1"
        },
        {
            "review_text": "Played a lot back in the PS2 days, and still feels fresh, far better than the 6th Resident evil, why they don´t make games like this anymore?, If you´ve got spare $20, Do yourself a favor and buy this !",
            "review_score": "1"
        },
        {
            "review_text": "Having bought this over the years for the PS2, Gamecube, wii, Xbox 360 and the first PC version i can finally say that this is the definitive version  Graphics are excellent and the gameplay remains as excellent as ever",
            "review_score": "1"
        },
        {
            "review_text": "a monster keeps following you around screaming LEEEAAAAAAWWN, and if you kill it you lose the game. Hardest and most terrifying resident evil ever, 11/10",
            "review_score": "1"
        },
        {
            "review_text": "It is an enjoyable game, with the stereotypicial RE series ' oh S*** oh S***' moments that make the game exciting, the replay value and extra content make this game a decent buy. The only negitive thing i could say about it would be the controls, but as you get used to them, the issues with them are negligible.",
            "review_score": "1"
        },
        {
            "review_text": "After a whole lot of tweaking and forum visits I got the game running acceptably to the point I could make some progress in the game but I just can't get comfortable with Keyboard controls only types of games. I liked the game otherwise and considering that I kept trying to play it even with those shortcomings, was the reason I gave it the recommendation. Would be nice if they re-engineered it to be a WSAD and Mouse type game.",
            "review_score": "1"
        },
        {
            "review_text": "A true classic of the survival horror/action genre.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game on different consoles since it was released. I JUST LOVE IT... Now I found it on steam, which was nice because now I just use my PC for gaming. My only problem is that everything seems to be in slow motion, which does not let me play as I should... can you help me with that? Is it something about the settings? (My PC is really good, so it can not be the problem)",
            "review_score": "1"
        },
        {
            "review_text": "Best RE agter pld good ps1 and 2 :)",
            "review_score": "1"
        },
        {
            "review_text": "60 fps made the game lag terribly bad but at 30 fps it runs like a well oiled crazy robot. One of the best games i ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Having played this game many times on many systems this one is by far the best looking and will be forever in my top game list.",
            "review_score": "1"
        },
        {
            "review_text": "Very good atmosphere, very interesting story. I liked this game a lot, was playing it for hours without break because it doesn't get boring quickly. I can't tell whats different from the original RE 4, since this HD Edition was my first time with this part of the series, but it plays pretty well for a PC port and I had nothing to complain about.  If you don't know this game yet, give it a try if you like. I loved the trip.",
            "review_score": "1"
        },
        {
            "review_text": "in a world of dangerous,freakish monsters, isolation is the greatest fear. the atmosphere and mechanics of this game are impecable. must play for any action fan.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥ RE4",
            "review_score": "1"
        },
        {
            "review_text": "After a whole lot of tweaking and forum visits I got the game running acceptably to the point I could make some progress in the game but I just can't get comfortable with Keyboard controls only types of games. I liked the game otherwise and considering that I kept trying to play it even with those shortcomings, was the reason I gave it the recommendation. Would be nice if they re-engineered it to be a WSAD and Mouse type game.",
            "review_score": "1"
        },
        {
            "review_text": "A very good remaster in my opinion, all the nostalgia sinks in, as well as feeling a bit updated a tad, old but new, much better than the original hands down, 12/10 would reccomend to anyone who wants to get a fresh start with their PC.",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4. The best RE in the series. Capcom really outdid themselves when making this gem of a game. The visuals, the gameplay, story, mechanics, soundtrack (especially) are all tied intogether beautifully. If you're a fan, buy it.  Whether you agree with me or not on whether it's a good port or not is beyond my concern.",
            "review_score": "1"
        },
        {
            "review_text": "The last RE you ever need to play.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics are hardly high definition but the gameplay is pretty good, and surprisingly the keyboard and mouse controls aren't awful. Except the quick time events if you're right handed.",
            "review_score": "1"
        },
        {
            "review_text": "Was a great game from the childhood and they did amazing work on making it 60FPS and in HD runs great even with my GTX 465 :) well worth every cent :)",
            "review_score": "1"
        },
        {
            "review_text": "It holds up super well. Just as fun as it was on it's original release.",
            "review_score": "1"
        },
        {
            "review_text": "if you havent played it, get it!  if you have played it, get it!  if you have beaten it several times on multiple systems, get it anyways!  this game is one of the last of a long lost era. if it came out today it would be chopped up into (at least) 4-5 dlc's. plus microtransactions for minigames, weapons, characters and costumes. it would prolly end up costing more than 100 bucks to get it all.  thats why this game is so great, its the full package! there is nothing rushed or cut out (to sell it as dlc), there is tons of content and the replayability is insane! until you have everything unlocked (there is even a rocket launcher with unlimited ammo) youre going to have a great time with re4 - and even afterwards you still can keep playing and start speedrunning.  i had this game on the gamecube, on the nintendo wii and now on pc. i have beaten it several dozen times and i still cant get enough of it. the only negative thing would be the 'hd' textures really could use at least 100% more hd...  this game is one of a kind and i really hope 'the evil within' will be as good as this.  fyi: im using the xb360 controller to play this.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this on Game cube I bought this on PS2 I bought this on Wii I bought this on Xbox 360 And now on PC  I've played through this game collectively more then 50 times, and its still one of my favorite games of all time and i can't get enough of it  ",
            "review_score": "1"
        },
        {
            "review_text": "Extremely good - I was put off by the setting and packaging when this first came out, big mistake!",
            "review_score": "1"
        },
        {
            "review_text": "This game was awesome years ago and it's awesome now !  Definitely one of the best resident evils, it perfectly combines action and horror, on first look it seems maybe like normal shooter, but it has dark unique style and atmosphere too  Main story has quite good play time and when you finish it, it has still a lot to offer, there is bonus content - Separate ways and Assignment ada where you play as Ada Wong &lt;3 and ofc Mercenaries :) - there are also items what you can unlock like weapons or skins after finishing the game, Professional mode as well, so there is a big space for playing the game again, and maybe again !  If you like resident evil or shooter games or horror games or ... whatever, just buy it ! ;)",
            "review_score": "1"
        },
        {
            "review_text": "A rich, engrossing single player campaign with good replay value (New Game +) In my view, the best Resident Evil to date.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best shooting game I played when I was in college and now in HD!!! It's awesome!! I recommend it to all of you out there who wants to shoot some zombies a**!!!",
            "review_score": "1"
        },
        {
            "review_text": "The best tetris simulator on the market, the shooting zombies part is ok i think.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up after finishing The Evil Within because so many people compared the two games. I was pleasantly surprised and really enjoyed this game. The dialogue though somewhat cheezie fits perfectly into the story. This game is a classic and now one of my favorite games of all time. It is not nearly as scary as The Evil Within IMO but it does have a few moments. The story, characters and action are what really drive this game.   I highly recommend this game. It is a gem.",
            "review_score": "1"
        },
        {
            "review_text": "are you guys got a delay or is just me when i move or try to shot some thing i have like a slowmotion can you guys help me pls or i just Undo the purchase of the game guys i realy want to play it pls tell me what i should do ty .",
            "review_score": "1"
        },
        {
            "review_text": "Usually I dive in and get really serious about playing a game, I forget that the scouting parties, raids, stealth missions, run-and-guns, escort missions, boss battles, and mini-games were at one point, in concept a long way back down the line was suppose to be fun. It was during the mine-cart ride, fending off zombies that jumped down onto the carts, armed with a shotgun from one cart away, blasting Dr. Salvador and three other zombies in a perfect blast radius that I thought to myself 'Wow, this is actually fun.' After climbing part of the tower, and reaching the point where I could now drop barrels to roll down and hit the cultists coming up the stairs with them because in the back of my mind, I was saying 'DK!'? Fun. When I managed to one hit kill Salazar with a bazooka I'd been saving after weakening his armor shell? That was fun. Looking back, harpooning the fish monster? Difficult, because by then I still hadn't mastered PC controls, but fun.  Do you remember the last time you actually had fun playing a game? Sure, the standing still while aiming drove me mad for a while, and a few things are outdated that didn't get re-speced, but I overall enjoyed the game.",
            "review_score": "1"
        },
        {
            "review_text": "Even after all these years still a masterpiece!  When I think of the perfect combination of old-school Resident Evil horror and the newer, more action-packed style, this is the one coming to mind. The story is...not very good, but the set pieces are quite enjoyable, the music very engaging and it's deeply atmospheric.  Unfortunately I'm basing this review on the German version, which contentwise only includes Separate Ways. Therefore I can't say anything about The Mercenaries and/or Assignment Ada.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this many, many times. I'd peg it up to at least 200 hours, across all platforms. Resident Evil 4 is the pinnacle of the series for me. And it unfortunately is sometimes, not all the time, looked down as being the 'destroying factor' in Resident Evil.   Sorry, but the previous three games before this one, meh. They are good. They did do greatly for the genre. But don't act like they were special.   I'd say even if have no prior knowledge of Resident Evil, pick this one up first. The introductory cutscene gives you the basics to go on, and the plot inside this game stays contained, with a few references in future titles. It's a great place to start, and with one of the best protagonists from the series.",
            "review_score": "1"
        },
        {
            "review_text": "Spook. Regenerators ♥♥♥♥ed my dad and took me to brown town",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "I pre-ordered the limited edition of this game on Gamecube and I really enjoyed playing it in 2005. Bought again 10 years later, now my mind is clear : this is not as good as the first three Resident Evils but not as bad as the game that followed. Still retains a few of the survival horror dynamics we loved while 5 and 6 completely ruined it. I didn't like the last part of the game because it was clearly a step in the wrong direction (helicopters, enemy shooting at you and such). It's a good game, I'd say a great game (as it was awarded) but if it wasn't called Resident Evil it would have been the same since it feels like a completely new game.",
            "review_score": "1"
        },
        {
            "review_text": "Start the game.  Play until that moment where there's a rolling stone trying to crush you.  'X'  Well, too bad, you're in the hardest difficulty of the game.  GAME OVER  Repeat.",
            "review_score": "1"
        },
        {
            "review_text": "I've probably dumped triple the amount of time it says I have played this if you factor in just the previous PC release.  10/10 will suplex ganados for pesetas",
            "review_score": "1"
        },
        {
            "review_text": "The stupid old-school control and camera settings make this game a successful horror survival game. Given a modern FPS/TPS key settings, it becomes BH 6.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, but every 20 min my game crashes. Steam please fix this.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "The keyboard+mouse controls feel so busy and it is difficult to concentrate on the actually gunfight in the game. Highly recommend to use a controller instead. I really come to appreciate the new contorls of RE6 and the Revelations series, sometimes it is difficult to go back to older games after they made improvements to the newer ones. Other than that it is a good port. No framerate issue, very smooth gameplay. Maybe I'll come back and finish the game on PC someday...",
            "review_score": "1"
        },
        {
            "review_text": "'I was supposed to protect the President's Daughter, but then the President's Daughter got kidnapped. Now I have to rescue the President's Daughter.' 'Who are you looking for?' 'The President's Daughter.' [Phone rings] 'Leon, here's the file on Ashley.' 'The President's Daughter. I'll check it out.' 'And be on your best behaviour. She's the President's Daughter.'",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy games like Dead space and Tomb Raider 2013, but I accept that the have ♥♥♥♥ stories and compared tothis game are actually pretty dull. Resident evil 4 was the first of its kind and it has yet to be beat. While it has its fair share of problems, it's still very good. I just hope I can get back my infinite rocket launcher after accidentally deleting my save :(",
            "review_score": "1"
        },
        {
            "review_text": "Shinji Mikami's greatest masterpiece.  The best 3rd shooter of all time and nothing will ever come close to RE4.",
            "review_score": "1"
        },
        {
            "review_text": "Resident evil 4 was undoubtedly a massive influence on the 3rd person shooter genre, even though the game itself is a hybrid survival horror/3rd person shooter. If you are looking for more survival horror and not a shooter, then this might not be for you.  As far as survival horror games go, with shooter mechanics, this is at the top even after all these years.  The controls are old and very stiff if you compare it to modern games, so you have to be able to look past that and get used to it. The controls is not a problem if you played the original release, or any of the original resident evil games (1-3), as the controls are pretty much the same with just a change in perspective.   The game is old, so it will not be among the most hardware demanding games out. It will run in 30 fps mode without hiccups in 1080p on a amd apu A10 7870k, with motion blur turned of.   The game itself is one of the best games i have ever played, and the best resident evil has ever offered (including resident evil 1-6, revelations 1-2, code veronica and spin-off games).   Do yourself a favour and get this game and play it before resident evil 7 comes out, and see for yourself why this serious was once among the best in the gaming industry.",
            "review_score": "1"
        },
        {
            "review_text": "My fav game since 2005! My second fav RE game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing classic. Must buy. Would recommend using a xbox 360/one/ps3/ps4 controller. Alot easier.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the BEST in the franchise, and I would recomend it to anyone who wants to start playing the Resident evil series.",
            "review_score": "1"
        },
        {
            "review_text": "This really never gets old, it's a masterpiece for it's time and it brings a new perspective of what Resident Evil is about. It remains one of the best games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "It takes some time to adjust to the PC controls when you're not using an xbox controller, but once you're used to it then the game gets as good as when it was first released. I'm a huge fan of RE4, and the HD edition was a must have. It has some bugs, but they are minor issues when you compare the PS2 graphics to this !  Maybe I wish there would be more steam cards for it : )",
            "review_score": "1"
        },
        {
            "review_text": "If you like resident evil games (OLD STYLE) this is the game for you. The controls are old school and will feel weird at first. The game has no strafing, so to turn you need to stop and use keyboard or joystick. LIkely a conroller is best for this game.  Once you get past the controls (they are not bad, just based on old gaming styles) the game is really tough and cool.   Graphics might make a difference as this game is old as hell. I would watch some gameplay videos to make sure you would enjoy the style. Having top stop and slowly turn to kill zombies is annoying but also gets your heart racing. Several times I had to pause the game because my chest was pounding.",
            "review_score": "1"
        },
        {
            "review_text": "Still very fun! But i recommand having a controller",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, one that you can pick up and play any day and you will still have a lot fun.",
            "review_score": "1"
        },
        {
            "review_text": "How come when i play this game ,the chracter move so slow? Can it moving faster like normal game?  Can anyone tell me what happen on this game why moving so slow?",
            "review_score": "1"
        },
        {
            "review_text": "Still really fun after all these years. Though a little outdated, its B-Movie asthetics and cheesy dialogue more than compensate.",
            "review_score": "1"
        },
        {
            "review_text": "Over 10 years old and it still holds up. It's a solid port, with all the bonus stuff from each version.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a MASTER PIECE! I play all of its previous versions starting from the Game Cube, then the PS2, the nintendo Wii, the Xbox 360, and just when I thought there was no way for this game to be even better... BUM! Steam version came with a 60 fps mode that is just beautiful!  Play it in normal dificulty, play it in pro dificulty, play it again in normal dificulty without buying larger suitcases, then again on pro without using yellow herbs... I mean, there are just too many ways to re-play this game once and once again (And the extras are way too much fun too).  Just get this awesome game and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best third-person shooter ever made, and by far the best Resident Evil game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I've played many a resident evil game in my life, many of them. And I've been a huge fan since I was a kid. All I can say is this game does the series justice. It's action packed, filled with whitty puns and rather cheesy dialouge. but it comes out funny.  The game has so many hiddne easter eggs. for example, shoot the lake a heap where the giant fish is... you'll see the sort of stuff you can whitness in the game there.  if you havent played it before like I hadnt, do yourself a favour and get it. It was a lot of fun  (though redicoulessly easy oonce you get the infenete RPG (need to beat game for that))",
            "review_score": "1"
        },
        {
            "review_text": "Now this is a proper PC port! Not only that, it's an HD Remaster too so you can play it is sweet 60fps (or if you want that creepy look you can always turn it back to 30fps, your choice)  Unlike the more modern RE titles like 5 and 6, this one still retains the horror elements of the older titles while still giving it a new take on their genre by adding in a bit of action to the mix.  A lot of players may find a little later in the game that a certain mechanic will frustrate them to no end. That being securing the president's daughter. While I myself actually liked that mechanic that it gives me a sense of urgency to actually protect someone defenseless, I can understand why people would just attempt to leave her there to be abducted again since she can't do anything than just stand around and be scared.  The only other con I can think of is that the camera can take time getting used to since it's tank controls. Some enemies you'll encounter can be quite fast and sometimes you'll be overwhelmed by sheer numbers unless you have something that has a lot of spread.  All in all the game's not that bad.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play through again",
            "review_score": "1"
        },
        {
            "review_text": "I loved it even though the FPS has to be at 30 instead of 60 in order to work properly for a lot of people. The experience is of course different from the game cube and ps2 version, but it is fast to ajust to the keyborad/mouse controls.   Highly recommended!!",
            "review_score": "1"
        },
        {
            "review_text": "Best version of Resident Evil 4 now.",
            "review_score": "1"
        },
        {
            "review_text": "There's only one word to describe this game...'Groovy'",
            "review_score": "1"
        },
        {
            "review_text": "I've played through this game so many times now, not counting the steam version. Basically, you control a Ken doll through Spain and kick ♥♥♥. A perfect fit for survival horror fans and gun nuts.̶ +1 point for hot MC",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth the money. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best games I have played! It is truely amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Literally one of the best games of all time. Seriously, if you haven't played it yet, do yourself a favor and get on it.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the greatest games ever. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "This is about the peak area for the horror aspect of the Resident Evil series, RE4 is probably one of my top Resident Evil games. of course it still has the whole cannot move shoot aspect to it which takes a bit for someone who hasn't played RE in awhile to adjust to, in my case at least. I personally don't get as annoyed by Ashley as most players do but I do see where their coming from, I feel like Ashley inspired the co-op aspect that appears in the next game. In full I think RE4 is good, well paced horror game, and is definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic runs smooth, no lag or nothing, though for the life of me couldn't find the way out of the game, i tried button smashing but nothing worked. No in game menu as far as i can tell, though i found a way with ctrl alt delete. I could be missing something P: ..???  ",
            "review_score": "1"
        },
        {
            "review_text": "Brings back memories from the gamecube and the ps2. I played this game repetitively adn never got boring. It's the only single player game that I would spend a lot of time on. Very good game, even though it has some slow motion into it, it can be fixed.",
            "review_score": "1"
        },
        {
            "review_text": "Still my favorite RE of all time. Was just as good as when I played it the first time,made even better by smoother framerates and great portability. People who have already played it SHOULD buy it again.200% recommendation.  一番好きREタイトルがより快適にプレイできるようになれた今、 絶対購入に決まりでしょう。フレームはモッサリしてないし、キーボードもコントローラも使えるし。 前はやったことのある人にもおすすめだね。",
            "review_score": "1"
        },
        {
            "review_text": "Got decapitated by a flying scythe. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Having played every single version of this game that has been released, I can tell you that, minus a couple of little gripes that I have, this is one of the better ports of Resident Evil 4. This game has aged very well and is still a blast to play 9 years after its initial release. The tank controls are a little clunky and the mouse is a little unresponsive at times, but it doesn't really detract from the overall experience. The HD textures that they added for this version of the port are nice, but they only gave the HD makeover to parts of the game. Unfortunatly I wasn't able to play the game at 60 FPS because the game would go into slow motion every time I tried. The game runs perfectly fine at 30 FPS and I am not sure if this is an issue with the game or if it is just my PC, but it is something to consider if you want to try out this port. Overall, This game was a masterpiece when it was released back in 2005 and it is still very fun to play to this day. If you still have a version of this game lying around, the partial HD makeover and the 60 FPS may not be enough to justify another purchase, but if you have never played this game before or if you don't have this game anymore and wish to relive a blast from the past, this would be an excellent choice.",
            "review_score": "1"
        },
        {
            "review_text": "great game !!!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like blonde girl follow you around? Buy This Game. Do you like weak zombies? Buy This Game. Do you like mysterious mechant? Buy This Game. Do you like mutant-like Zombie? Buy This Game. Do you like Ada Wong? Buy This Game. Do you want to see Ada's legs? Buy This Game. Great Game,Great Story,Great Soundtrack, Cons is just for clunky controls.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good and not as scary as earlier RE games but still really nice",
            "review_score": "1"
        },
        {
            "review_text": "I have completed RE4 on PS2 before and I highly recommend this HD version of the game if you are a friend of action/horror.",
            "review_score": "1"
        },
        {
            "review_text": "Touted as one of the best in the franchise and my personal favorite, Resident Evil 4 finally jumps in to glorious HD. It's not a simple upscaling of resolution, the textures have all been updated with anti aliasing support. It also seems to have subtle additions. I can't be quite sure as its been a few years since I played this on the WII and PS2 but there do seem to be a few subtle changes like the Krauser fight in Seperate Ways is verry differant and a little sparring match with Krauser when fighting him and searching for the pieces to the door can happen. I've also noticed a few new treasures. Either way for only 20 bucks this is well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "UH YA This GAAAAAAAMMMEEE IIIISSSS OOOONNN FIIIREEE BBBEEECCUUAASSEEE IIITTT''''''''SSSSSS SOOOO GOOOODDD",
            "review_score": "1"
        },
        {
            "review_text": "it can some times be hard to navigate but other than that it is 1 i would highly recomend",
            "review_score": "1"
        },
        {
            "review_text": "Mouse aiming is a little clunky considering the first versions had you use the keyboard. But still the great classic that got amazing reviews back then. There are a few small tweaks that made the game even more challenging which was very nice. Ashley noticably yells less now too, or maybe I've just played through a lot to know better. :'D  Anyway I love the idea of the leaderboard charts, basically who can complete the game the fastest. Mercenaries will be another ordeal, because after being exposed to RE6 and RE:REV, we won't be able to move and shoot haha.  10/10, because it stays true.",
            "review_score": "1"
        },
        {
            "review_text": "The new HD texture package is quite neat, but nothing beat the classic game (Gamecube edition in my case). The controls are quite ♥♥♥♥♥♥♥♥ at times, but that isnt gonna change and when/if you get used to it, you can still play the game without being dragged down by it :-D If you like RE4 its almost a most-have for another playthrough, but if you have your old PS2, Wii, GC, you´ll be better off",
            "review_score": "1"
        },
        {
            "review_text": "Yes i recomend this version over the RE 5 and 6 because compaired to thoses 2 this one was the pinical of RE perfection for the Series.  No longer the confied cramped camera angles that restricted you in the first 3 [main games im talking about] were you had t struggle with it.  The invintory screen is fun to play around with too, rotate items, mix hurbs togeather and generaly play organizer to your otherwise unorganised items. fun for thoses who like ot keep things neat and clean.  When it premiered on the GameCube it was amasing to see what that machine could do, but when it came ot the PS2 version what happen Capcom did you become lazy?  The HD graphics relly do help this one look even better thne before now that its on a machine that will give it the proper treatment it deserves and the attention it should recive.  Over all this game has aged fairly well but i cannot iggnor the fact it didnt come ot PC in the US till 2012 when it was out on PC in Europe already, lets aviod that mistake in the future capcom  while the controlls are stil a tad clunky , useing a 360 pad for you PC is a must unless you like the keyboard and mouse eather way is fine.  My final score? is a 7 / 10  Visuals = 8  Controlls = 7.5 Plot = its RE what do you expect? Other stuff = 7  Pick it up today cause its worth a look. ",
            "review_score": "1"
        },
        {
            "review_text": "The story starts out a bit quick and the Spanish in the game doesn't match the setting at all, but don't let stuff like that and the small blemishes deter you from this absolutely fantastic game; I dare say masterpiece from CAPCOM. Every chatacter makes you feel a feeling that you can either relate to, love or absolutely hate. It's one of the best games I've ever played and definitely deserves a spot in your game library if you haven't already picked it up.",
            "review_score": "1"
        },
        {
            "review_text": "Very tense action horror experience. Would reccomend for HD remaster of a game that has certainly raised the standards for the 3rd person shooter experience.",
            "review_score": "1"
        },
        {
            "review_text": "I tried to play this but when i got locked in the first house i panicked and alt-tab the hell out of there.",
            "review_score": "1"
        },
        {
            "review_text": "Mutated Guppi Jaws aint got nothing on Leo DiCarp-e-oh-e-oh Umbrella",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Resident Evil after RE1 2 &amp; 3.   A lot more action orientated than previous games but still excellent none the less!",
            "review_score": "1"
        },
        {
            "review_text": "A better over the shoulder 3rd person shooter has yet to be made since this game was originally released. Other's have tried and failed to emulate the fabulous mechanics in this game, and frankly no one has dared to try and recreate the greatness of the attache case.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ing  hate  Ashley",
            "review_score": "1"
        },
        {
            "review_text": "Got to kill Ashley with a grenade 10/10 Would kill her again.",
            "review_score": "1"
        },
        {
            "review_text": "my mind is now blown that im not scared of this game anymore",
            "review_score": "1"
        },
        {
            "review_text": "This game was awesome years ago and it's awesome now !  Definitely one of the best resident evils, it perfectly combines action and horror, on first look it seems maybe like normal shooter, but it has dark unique style and atmosphere too  Main story has quite good play time and when you finish it, it has still a lot to offer, there is bonus content - Separate ways and Assignment ada where you play as Ada Wong &lt;3 and ofc Mercenaries :) - there are also items what you can unlock like weapons or skins after finishing the game, Professional mode as well, so there is a big space for playing the game again, and maybe again !  If you like resident evil or shooter games or horror games or ... whatever, just buy it ! ;)",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4... probably the best RE game that will ever be made. I really enjoyed playing it when it first came to PS2 and even now, after the test of time, this game is still fun to play. Even better, the textures are now HD, even though it doesn't look like the latest game, it's still good imo. But the most important part is, this game is really enjoyable! Recommend it ;)",
            "review_score": "1"
        },
        {
            "review_text": "It holds up super well. Just as fun as it was on it's original release.",
            "review_score": "1"
        },
        {
            "review_text": "I found six eggs and egged luis he ended up killing me wud play again 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A classic to add to anyones collection of games. This one stands the test of time, and is 9 years old. Not a lot of games can say that. Shinji Mikami was a genius when he made this one. The controls are fine to, just make sure you play with a controller as this game is a port from consoles. If you want to use mouse and keyboard fine but, you are adding more challenge If you do so.",
            "review_score": "1"
        },
        {
            "review_text": "I well ported version of the good old game you remember, no issues comparing the versions and has perfectly well implemented controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Favorite Resident Evil by far, I love the aiming system and the enemies although I think there could have been more types and looks with the enemies, but I still love this game. Great work Capcom!",
            "review_score": "1"
        },
        {
            "review_text": "love it my fav game of all time",
            "review_score": "1"
        },
        {
            "review_text": "really nice",
            "review_score": "1"
        },
        {
            "review_text": "A classic. Very fun.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is probably my favorite Horror-game of all time and definitely under my top 10 games of all time. I loved this game on Gamecube, Wii and now PC. I have to say that this version is exactly as good as it was back then and it just feels awesome once you got the hang of its incredibly unique controls. I recommend playing it with a Xbox360-Controller for ultimate playing comfort.  The story is very very cheesy though, so do not expect a Shakespear level story.  The gameplay is among the best!  The graphics were awesome back then and may look a little ♥♥♥♥♥♥ now but they still maintain their own style throughout the whole game, which really grows on you the further you get into the game.  10/10 so much replay value",
            "review_score": "1"
        },
        {
            "review_text": "Still a great game,but unplayable with the mouse and keyboard, a controller is a must have. The atmosphere and the loot keeps the game going, plus there are also good replay value. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't see what all the fuss is about. Seems like a good HD port to me. Really enjoying my fourth playthrough of this game. Haven't encountered any issues with the game so far 4 hours in.",
            "review_score": "1"
        },
        {
            "review_text": "It's the same old great classic, but it feels lazy in many points, one of them being the lack of options in the menu (you have to change some stuff in the CFG file directly) and other being the outrageously bad looking pre-rendered cutscenes (FMVs) which could have been treated with a little more love (filtered, ANYTHING). Anyway, this is the best version you will get for this game.",
            "review_score": "1"
        },
        {
            "review_text": "The sound has been desyncing every time a metallic sound plays like the knights moving around. The game goes in to slow motion every time I close the inventory, even after turning aliasing off completely and lowering the details to medium or low. The game crashed on me after the 25 minute Kruaser/Helicopter part as I tried to enter the building leaving that area. Not worth the money, go buy this for 5 dollars at game stop on x-box 360 and call it a day. I know its not my PC because its brand new not even a month old. Built for gaming. The crash only happened the one time and I made it through the game so I will change to a recommend because its a great fun game, not really scary though. Also the sound problem may have been fixed by something I had to download for the voice acting to work on the evil within I'll find out next time I play through on pro I guess. Don't buy the evil within on PC, good game bad PC version",
            "review_score": "1"
        },
        {
            "review_text": "Usually I dive in and get really serious about playing a game, I forget that the scouting parties, raids, stealth missions, run-and-guns, escort missions, boss battles, and mini-games were at one point, in concept a long way back down the line was suppose to be fun. It was during the mine-cart ride, fending off zombies that jumped down onto the carts, armed with a shotgun from one cart away, blasting Dr. Salvador and three other zombies in a perfect blast radius that I thought to myself 'Wow, this is actually fun.' After climbing part of the tower, and reaching the point where I could now drop barrels to roll down and hit the cultists coming up the stairs with them because in the back of my mind, I was saying 'DK!'? Fun. When I managed to one hit kill Salazar with a bazooka I'd been saving after weakening his armor shell? That was fun. Looking back, harpooning the fish monster? Difficult, because by then I still hadn't mastered PC controls, but fun.  Do you remember the last time you actually had fun playing a game? Sure, the standing still while aiming drove me mad for a while, and a few things are outdated that didn't get re-speced, but I overall enjoyed the game.",
            "review_score": "1"
        },
        {
            "review_text": "A classic :D",
            "review_score": "1"
        },
        {
            "review_text": "got Resident evil remastered HD and finished it and said i'd give it a go as its on of the few resident evil games i never played, i must admit im really enjoying it, controls are a bit wonkey but overall a great game",
            "review_score": "1"
        },
        {
            "review_text": "Why you not play this.",
            "review_score": "1"
        },
        {
            "review_text": "As much flak as this game gets for straying away from the franchise's isometric roots, this is an incredibly competent and well-paced third person shooter.  If you're looking for a classic survival horror game, get REmake. If you're looking for an undeniably fun shooter, get RE4.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an excellent classic that I would recommend to others. It seems like an in-between game, as it has elements I associate with the classic PS1 games and with the newer PS3 games. It is more action-oriented than the previous, but still maintains those important aspects of exploration and puzzle-solving. The only thing I dislike is that items and such don't carry over to games on other difficulties.",
            "review_score": "1"
        },
        {
            "review_text": "Hey look another excuse to play RE4 again.",
            "review_score": "1"
        },
        {
            "review_text": "I have this game for more than four platforms, and I have never regret buying this once. With lots of replay value, a long and action packed story, and many difficult challenges along the way. This is a great game for anyone trying to get into the Resident Evil series!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games of all time, now with more resolution!",
            "review_score": "1"
        },
        {
            "review_text": "fatal error steam must be running, duh im on steam ♥♥♥♥♥ not running wtf ",
            "review_score": "1"
        },
        {
            "review_text": "well this game not reaaly improve about graphic with horrible mouse+kb support but the gameplay is still remain it worth to try on sale off,and my version is jp from a gift of my friend so manything is sensored",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "'HELP ME LEON' 'HEEEEELLLLP' 'DON'T COME' 'YOU PERVERT' 'SHOOT THAT WAGON' 'LEAVE IT TO ME LEON' 'DON'T TOUCH ME' 'I'M COMING WITH YOU' 'I WAS SO SCARED' 'HOW ABOUT SOME OVERTIME?'  10/10, wii port is best port.",
            "review_score": "1"
        },
        {
            "review_text": "The controls and occasionall bugs are something to get used to but once you get passed that, this game is fantastic. It's genuinely creepy but is fun at the same time. It is difficult but doesn't use its difficulty as a mask to cover its lack of substance, the game treats the player like an intelligent human being capable of solving somewhat complicted tasks. Also, if your computer is even as powerful as a toaster, you can run this game with super-fast load times.",
            "review_score": "1"
        },
        {
            "review_text": "Back when i was 8 i played this game I LOVED IT! i beat it 8 times on the ps2 and it never got boring.i got a rpg that had ulimied ammo it cast 100000000 but it was worth it now i spent 20$ to relive my chiledhood and i have no regrets 10/10  #waitfollow #ihateashley",
            "review_score": "1"
        },
        {
            "review_text": "The first game, and this game are my favorites. The fifth was alright if you play with a friend. What more is there to say? It's resident evil 4. If you liked this game's previous releases you'll like this one. Can't beat the sales prices of 6.80. Now I'll just have to wait till the remeastared first game comes on sale. Hopefully they remaster the second, third, and Code Veronic. Then I'll be set.",
            "review_score": "1"
        },
        {
            "review_text": "More games like this wouldn't hurt. I played Resident evil 5 and 6 and I must admit, this one is 10x better. If you've got joystick even better!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games of all time, now with more resolution!",
            "review_score": "1"
        },
        {
            "review_text": "Best Resident evil Game Ever ! played it alot. completed it like 4 times still funny",
            "review_score": "1"
        },
        {
            "review_text": "WAIT. FOLLOW ME. WAIT. FOLLOW ME.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game that i have sunk alot of hours into across three platforms, only problem is you are almost required to use a controller for this pc version. aiming is....just terrible.",
            "review_score": "1"
        },
        {
            "review_text": "Shot a guy in the face with a pistol, he grunts.  Kick a guy in the fact, head explodes  Fallout logic to the max!  All joking aside, this is one of the best ♥♥♥♥♥♥♥ games I have ever played. Great gunplay, awesome atmosphere, intuitive inventory system, good level design.  Yum.   ",
            "review_score": "1"
        },
        {
            "review_text": "As a huge Resident Evil fan I'd say that the original games will forever be the greatest but Resident Evil 4 comes directly after that bar none. An epic survival horror game with huge focus on action. The combat is stellar, the story is great, the characters are enjoyable and it is just in general an enjoyable experience of a game. Blasting the heads off of ganados and being decapitated by chainsaws will always leave me giddy. I recommend it not only for Resident Evil fans but for fans of Survival Horror in general.  10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Best Resident Evil; or BESTEST Resident Evil?  Both answers are wrong, it's the besteresterest Resident Evil.",
            "review_score": "1"
        },
        {
            "review_text": "Classic horror third person shooter, the magic of which has never quite been replicated.  ----  + Intense, dangerous gameplay and atmosphere. + Integrated high resolution support. + Legitimate need to preserve ammo and explore areas for loot thoroughly. + Good Inventory management. + Selection of weapons with upgrades.  +/- Cheesy b-movie plot. +/- Voice acting is of 'so bad it's good' quality except for Ashley, she's just bad. +/- Unexpected instant death quick time events in cutscenes.  - Environmental texture quality is truly hideous.  ----  Resident Evil has had several brilliant entries in the series but also several that were not so good. This is one of the good ones and the first to be done in this pioneering third person style, setting the benchmark for everything that's come from the series since.  It has a legitimate intensity from the very start and just as you start to get comfortable with the game it throws a new spanner in the works to keep you on your toes time and again. It's a thrill ride from start to finish and actually has a surprising amount of content for you to sink your teeth into with a good length main campaign which has unlockable higher difficulties, the 'Seperate Ways' mini-campaign and the Mercernaries score attack mini-game.  I recommend it heartily.",
            "review_score": "1"
        },
        {
            "review_text": "A faithful port of one of Capcom's best games to date. Some issues arrise here and there, like awkward camera controls and weird frame rate drops on reloads, but overall a classic through and through.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best of the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "A classic one. Go ahead and give it a try, it would not dissapoint you.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing classic. Must buy. Would recommend using a xbox 360/one/ps3/ps4 controller. Alot easier.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. I've played it with pretty much every release of the game (gamecube, ps2, wii, and now steam) and have loved every single playthrough. Get it, that easy.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, that's a given, but if you're on Windows 10 beware of crashes. If you are on Windows 10 and can handle random crashes within 30 minute time frames, you should get this. Or you could be lucky and not crash at all, idk?",
            "review_score": "1"
        },
        {
            "review_text": "While i feel this game is really awesome but the port quality is pretty much garbage but if u have a graphics card like a 750ti or above it should be fine since it was for me BUT milage may varie so if u like this game at 60fps 1080p and max graphics is really great the game is awesome.But the port is not good but not the worst so u need a actual gaming pc not some intel hd graphics bc that wont cut it",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS BEST",
            "review_score": "1"
        },
        {
            "review_text": "I did this just so i could get the 4th reward in the steam awards",
            "review_score": "1"
        },
        {
            "review_text": "The best version of one of the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best of the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome game but it gives me really bad motion sickness. please put first person mode in game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, only game i've replayed more than once.",
            "review_score": "1"
        },
        {
            "review_text": "Whoever was behind the development of this game is lazy af. Leon's campaign cutscene were all rendered in real time while Ada's campaign were all prerendered and the quality is so bad, I can't forgive by the fact that this game is ULTIMATE HD EDITION. This game is also poorly ported. BUT I still recommend this game for those who is a RE4 fans though.",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER   resident evil 4 is the best in the series (in my opinion)    the enemy's are amazing and all the places's are full of adventure !!   I recomend this game!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 is almost everything i remember it being. Constant fear of what could possibly jump out at you, with the occasional humor that leon brings. Dealing with Ashley is still a pain since it seems she is just there to make the game one giant escort mission, and my most dreaded moments of fighting off chainsaw wielders turned into watching them run into walls. Other than a painful reminder of why we all hate escorts, and a little wonky AI, this game is still a must have for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "It a long journey of Leon !!!",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 4 is my favorite game of all time, and in my opinion one of the last great survival horror games. I had this game for GCN when I was little, and I have played and beaten it on every console it's ever been released on. If you enjoy kicking old zombie ladies and getting nagged by your little sister then you will love this game. Seriously 10/10 would recommend it to anyone who loves game.",
            "review_score": "1"
        },
        {
            "review_text": "You want a game that stands the test of time? This is it. Especially now that it runs super well.",
            "review_score": "1"
        },
        {
            "review_text": "This is that classic right here. Play it on PC if you haven't already experienced it in its million other iterations.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must play! Just get it and play it! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "The greatest shooter of all time. You're right hand will come off.",
            "review_score": "1"
        },
        {
            "review_text": "One the best games I have ever played. Game still holds up to this day. At this point I think everyone knows what RE4 so I will not give a review on the actual game. If you have not played this one yet and were ever interested do yourself a favor and get it. Game is a masterpiece. Defintely the best modern, post tank controls, Resident Evil game by far.",
            "review_score": "1"
        },
        {
            "review_text": "resident evil 4 is one of the best horror games of all time and definetely my favourite.     THE GOOD",
            "review_score": "1"
        },
        {
            "review_text": "Jewel of the survival horror genre. A must play classic.",
            "review_score": "1"
        },
        {
            "review_text": "There's only one word to describe this game...'Groovy'",
            "review_score": "1"
        },
        {
            "review_text": "it's has been a long time, but this game is awesome'''!!!",
            "review_score": "1"
        },
        {
            "review_text": "If haven't already played this then you might need to go play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Much better than the Sony port, this game unlike MOST older games lives up to the fond memories. Tried to replay a lot of classics over the years, this is the one that really held up...for me.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. Fan-Tastic!...wait wrong game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent example of a game that stands the test of time, with old-school features that are still enjoyable today. Such as the item management, tank controls, and Leon Kennedy's Japanese inspired bowlcut. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Help me Leon, it's one of my favourite games of all time featuring a closet homosexual who is trying to find and retrieve armed warheads, 'ballistics' if you will, which where stolen by THEM. The holy espagnole megalomaniac is fighting back with everything he has to stop you:  it, the beard, nessy, minority complex impersonator, gregorian choir members, spanish chickas who are so ugly that they wear paper bags over their heads and many many more.",
            "review_score": "1"
        },
        {
            "review_text": "this isnt a reivew the game is great and you should own it  this is just a few tips for the pc version   for inventory press tab for draging an iteam press backspace for rotating an item press delete and the quick time events kyes are :X+C,left mouse button+right mouse button ",
            "review_score": "1"
        },
        {
            "review_text": "It was a new direction on the resident evil series and I thoroughly enjoyed it. The setting and inhabitants of the game really don't make you feel welcome and keeps you on the edge. The story isn't anything groundbreaking but the characters are fun even if they feel a bit cheesy. The game understands it is kinda ridiculous and it embraces that feeling to make it fun at every turn. The weapons feel great, even if the controls can sometimes feel restrictive. There are a few quick time events but not enough to make you feel like there are too many of them. Replaying the game is also fun because you get access to new weapons that change your entire approach to the game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game that starts off the 'Action' change in genre for Resident Evil 4.   Taking this game as what it is, and not a strict Resident Evil sequel is kind of paramount in enjoying it. The gameplay becomes more tense, but changes from a conservation strategy to a shooting gallery.  I like to think of all the games continuing on in this series as 'B-horror games.' They're immensely enjoyable, if only for their stupidity.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "'It's like the holocaust with guns' 9/11 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "At least top five of my favourite games.   Even if you aren't a fan of Resident Evil, I suggest you play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Makin' me review for badge, plss gud game doe",
            "review_score": "1"
        },
        {
            "review_text": "I played a lot of different versions over the years.",
            "review_score": "1"
        },
        {
            "review_text": "Besides the original, Resident Evil 4 is my favorite entry in the series. It signaled a change from the by-then tired original format to a style of game which finally seemed to push the action underpinnings the series had always wanted to utilize (fairly evident from the first game, but completely obvious by the second). I know a lot of people have bemoaned the turn away from the survival horror play of the earlier games, but for my part I felt like the games had a bit of 'survival' in terms of resource management, but very little 'horror' beyond the setting and monsters (although I give RE1 points for the excellent atmospheric music pre-director's cut). Anyhow I digress, the majority of the series are pretty enjoyable in general, and I suggest anyone who hasn't already played them give them a go.",
            "review_score": "1"
        },
        {
            "review_text": "Playing Tetris with your inventory will make Resident Evil great again.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game enjoyed it",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game, on three different platforms. No regrets.   Now the real question is, 'whatcha buyin, stranger?'.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason this game is really slow.. knifing the enemy is slow. Shooting the enemy is slow.. running is even slower... everything is so slow... I dont remember this game being this slow. and I still have the ps2 version of this game. I get that 60fps is good and all and I really like it. the only thing I have a beef about is the super slow motion... please fix this...",
            "review_score": "1"
        },
        {
            "review_text": "This game has not aged well, and the game has not been ported well to the PC platform. Keyboard and mouse controls are still awful, and gamepad controls are loose and unresponsive even using a program like x360ce to fool the game into thinking you're using an official Xbox gamepad.   The textures have mostly just been scaled up to fit the new native widescreen resolutions without actually being improved very much, and the 'locked at 60fps' and 'locked at 120fps' options cause a lot of issues in cutscenes, where the sound plays much faster than the video, to the point that the sound will often be five or six seconds ahead of the video. Additionally, the pre-rendered cutscenes have not been changed since the original 2007 PC port, making the difference between in-game and cutscene very jarring.  While this is better than the 2007 PC port, it's still a terrible version of the game and you are still better off buying or renting a used game console if you really want to play RE4 again.",
            "review_score": "-1"
        },
        {
            "review_text": "Capcom must patch this game. I tried to play this game but Leon ends up shooting all over the place and theres nothing i could do. I tried to aim at the enemy but Leon aims behind him instead of the enemy right in front of him. I love RE4 back when it came out for Nintendo Gamecube but this is too much, i can't get past the first chapter without it being stupid.. The game also goes slow motion and the lip syncing is really bad when its in slow motion and i know i'm not the only one experiencing this problem. I want to recommend this game but as of right now i'd say dont buy it unless a patch is released fixing these problems. :/",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of graphic and performence problems. I can run much higher quality games. Needs a lot of patching",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another poor console port by Capcom. ",
            "review_score": "-1"
        },
        {
            "review_text": "Resident Evil 4. One of my favorite games and one of the best games of all time. Perfectly paced, tight controls, brilliant story and excellent characters. Needless to say, when I saw this was coming to steam I preordered it on the spot. I have the game on every other system it's come out on, so why not the computer. I mean what could go wrong, it's just a port to the pc.   Well, I would say something major went wrong. They locked the fps at 60.  the game runs fine, perfectly even, I'm getting the sixty frames per second as advertised. However the cost of this is that the game runs in bullet time. I get to see every frame of every animation in the game. Unless it decides to stop doing that at random intervals which result in the el gigante puching me in my face and/or smashing me into the ground. To be honest if this was just in the gameplay segments I wouldn't have a problem with it, but it's in the cutscenes. Every signle one of them.   This issue may seem to be a minor gripe, however lets take a look at this from the point of view of someone who had never played the game before.   They have heard so much about this game and are now finally able to play it since it's on the computer. They buy it and load it up. Now if their copy has the same issue as mine, the first thing they are going to notice is that in the openingcutscene the audio desyncs from the video. 'it's just a glitch.' they say as they continue forward. Once the cutscenes over, they get set adn start heading playing. Only to find that every step takes a second and a half and that the game seems to now be Max Payne having a fever dream. 'could just be the game map loading in.' So the player gets to the first house and gets another desynced cut scene. Than when it finishes the very first enemy starts lumbering over to you in slow motion. You raise you gun and prpare to fire, when the game speeds up and goes at the proper speed. Next thing the first time player knows the villager is upon them and hacking their face off with a scythe. continue this porcess though out the game.   Every time the cutscenes desync it reminds you that your playing a game and takes you out of the setting and narrative. No matter how much the games trys to set the mood again, it just doesn't stay. The broken out of sync cutscenes, the enemies playing red light green light, and the in ability to see the world in anything other than bullet time destroys this games power. You are no longer able to connect with the characters or feel for their struggle. You sit terrified that the game will speed up when facing an enemy that can one shot you, and may even find your self having trouble with quick time events where failure means death and possiby watching a cutscene over. I'm looking at you krauser.   Overall a very dissapointing port to the pc and I hope that a patch comes out soon to fix this horrific mark on an outstanding game.",
            "review_score": "-1"
        },
        {
            "review_text": "First things first : The controls are absolutely horrendous.  The character is blocking most of the view. The aim is always offset and wrong, it's impossible to be sure you're aiming in the center of the screen... or anywhere for that matter. I tried both Modern and Classic controls and haven't seen much difference. I think it went better with the classic one as far as I tried but it could've been a placebo effect and a better luck at aiming at the moment. The way the aiming is made with the mouse controls, recentering the aim where you are looking when aiming will make your aim flail around like madness in situations where you need to shoot quickly. And let's not forget the fact that Leon can't stay stable for a second, shaking the aim around.  The field of view makes me freaking sick and, as it seems, you need a mod to change it. No option and no config.ini. Never have I felt the need to pull my face off the screen that much.  When you get swarmed by 'non-zombies' (ughh!), there's this annoying noise, like if someone was falling on a drum kit constantly and it won't stop. Oh and there's no Sound options, so you can forget about adjusting your sounds in game.  The absurd loot coming out of 'non-zombies', birds and boxes stays in the map for ~30 seconds if not less so you'll be running around trying to avoid and shoot zombies only to turn the corner and find that your loot is gone. And since the controls are terrible, you will need this loot (health and ammo) to compensate for it.  Then there's QTE... oh why... You take a break to watch that cutscene, lay off the mouse and keyboatd to relaxe and watch when suddenly, here it is, a QTE which takes you by surprise, which you miss. Now you gotta watch the whole cutscene again simply to not miss that BS QTE at the end of it because it kills you. Bra-vo! Genius gameplay design guys! *clapping*  After 2 painful hours dying to the bad controls, I decided to take a break and write this review. I really wanted to retry this game since a long time, having played it on the GameCube back in the days and it's more than disappointing, it's frustrating to play.  I've seen many people stating that a badly made port is the cause of many of these problems. It may be true for something like the FOV but many negative aspects are still coming from a game made to be different, to be 'innovative' and to attract a new fanbase.  RE4 spat on TPS (Third Person Shooters) and its own franchise to create its own OTS (Over the Shoulder) point of view and, surprisingly, many game developpers thought it was a great idea to do the same, obtructing the view of the player with its character and making it basically impossible to aim. What a great and innovative idea it was.  This game almost killed the Survival Horror genre, ripped the franchise appart, divided the fanbase and it looks like this port is even worst. What a shame.   -A fan of Resident Evil since 2002 with Rebirth.   PS : The graphics are alright. In fact, I do like the atmosphere of the game and the gore aspects. Even though it's somewhat out of style from older games, it's pretty charming.",
            "review_score": "-1"
        },
        {
            "review_text": "Bragged big about making the Version Uncut in Germany for everyone and even for those who already bought it. After that nothing happened. Kind of D_ick Move, not that there was one to begin with, so it is more of a c_unt move? Either way, they lied to us in germany big time.",
            "review_score": "-1"
        },
        {
            "review_text": "I won't waste time talking about why you should play RE4, people have been telling you to for years. Instead, I'll complain about the port. Even on a decent rig, it runs pretty poorly. Locked 60fps/30fps only options cause cutscenes to lag/audio to desynch. You can manually override these, but it screws the game up even further and makes some event triggers unresponsive (the one that drove me crazy was doors not opening and that truck in the one part not exploding). Resident Evil 4 is a great game, but this port is a poor treatment of a fantastic game. It amazed me to learn that this is supposed to be the UPDATED port and that the older port was even worse. So do play Resident Evil 4, but get it on another system. The PC port isn't worth the frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, but seriously Capcom, get on those patches.  I've had 45 minutes of straight gameplay where I suffered massive framerate issues and it was literally like playing in Matrix Bullet Time mode. Enemies also occasionally lay on the ground when dead instead of disintegrating like they did in earlier versions, so that gets kind of confusing, too.  Fantastic port in every way, great controls, great graphics, intuitive key commands (Q is about-face, E is interact, R is reload, etc.) but the framerate issue is a huge problem and considering there have been about six patches since it came out in late February, it's kind of embarassing that an almost 10-year-old game is having so many issues from a simple port.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is great,but dont buy this game on steam it sucks runs at 10 fps,sound glitches and sound delay",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game!!!!  Capcom like always abandoned the support after 1-2 months. there are still issues with it and they dont care!   They just grab your money and leave off!   DON'T BUY CAPCOM GAMES ON PC!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Keyboard / Mouse controls are awkward to the point of being unplayable. This is a console port that requires a gamepad, mouse users shouldn't waste their money.",
            "review_score": "-1"
        },
        {
            "review_text": "It looks and runs well, but the changes to the controls that make it more comfortable to play with a keyboard and mouse completely break the game when using a controller. For an example, movement and aiming should be on the same input, but on PC they split it, so you will be moving with the left stick, and aiming with the right. The same is for shoot and action, which should both be the same input, but are split up. This is my favorite game of all time, so it makes me very frustrated that Capcom was so close to releasing the perfect version of Resident Evil 4, only to take a huge step backwards. If you care about controller support at all, avoid this port. If you want to play RE4 in HD, buy it on PS3 or Xbox 360, or better yet emulate it on GCN/Wii.",
            "review_score": "-1"
        },
        {
            "review_text": "Well I know this was game of the year when it was released by I really dont like it at all. I can't control the camera properly, it's too close to your character, it all feels horribly clunky and restrictive... I guess that's probably part of the point of it, to keep up that feeling of terror... but yeah, I didn't like it at all. Makes me feel like throwing my PC through the window within 10 minutes of starting it. Hated it.",
            "review_score": "-1"
        },
        {
            "review_text": "Even though i easily meet the recommended system requirements, the game slows down all the time making it almost unplayable. Only buy if you have a VERY strong gaming pc.",
            "review_score": "-1"
        },
        {
            "review_text": "I went ahead and preordered this game because I'm a huge fan of RE4. It is probably in my all time top 5 games. In the end however I'm pretty disappointed. I hope they continue to patch and improve on this game for the PC. I've completed this game on the Gamecube, PS2 and Wii. So far the Wii wins.  I would give this game three out of five stars for the PC version. For one, serious sound issues for me. The dialouge is entirely out of synch with the cutscenes. As far as gameplay I'm really conflicted. Part of me thinks that it's just really difficult to make that transition of WASD -- A and D being strafe left and right instead of turning left and right. This REALLY messes with me and I can't really fault the developers on that because that's just the way the game was designed. So, part of it is just getting used to the controls. However there seems to be other issues that I can't really put my finger on. I love the new textures but they certainly don't make the game. There's something about the controls that leave something left to be desired. I feel like a 3rd rate gamer when playing this version.  Granted I need to give this game some more play time. Perhaps I just need to adapt to the controls. As it is though, I would recommend you dust off that old GC, PS2, or hopefully if you have it, that Wii edition. Otherwise, wait for this to go on sale -- in retrospect that is what I would do.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, kinda sluggish on certain parts of the game (lowest settings still effects frame rates). I just bought a NEW computer, with good specs and it plasy like garbarge. Played well for a couple hours, but now it wont even start up. Totally wasnt worth it, get it for xbox or something other than PC",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, kinda sluggish on certain parts of the game (lowest settings still effects frame rates). I just bought a NEW computer, with good specs and it plasy like garbarge. Played well for a couple hours, but now it wont even start up. Totally wasnt worth it, get it for xbox or something other than PC",
            "review_score": "-1"
        },
        {
            "review_text": "Consistently crashes on Windows 10.",
            "review_score": "-1"
        },
        {
            "review_text": "cool bought he game and it only runs 15 minutes at a time WOOO. 0/10 hands down my favorite game. this really is a bummer...",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are about as good as QWOP. I want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "cool bought he game and it only runs 15 minutes at a time WOOO. 0/10 hands down my favorite game. this really is a bummer...",
            "review_score": "-1"
        },
        {
            "review_text": "Resident Evil 4 is a great game, a total classic that redefined the survival horror genre for better or for worse. I mean, without RE 4 to pave the way we wouldn't have the RE 5 and 6 we have today, right? Hmm, okay I do have some problems with it and I do think it's overrated, but I still like it and can recommend it to anyone who hasn't played it yet.  But my God, this is one awful, awful, awful, AWFUL port!  It's beyond inconceivable that this game that looks the way it does has such high system requirements. GTX 560? 4GB of RAM? What? Why? How? It barely looks any better than the Gamecube version I played back in 2005! The steam store page promises upgraded textures on characters, backgrounds and objects. Yeah, on SOME of them. Most textures haven't been touched at all and stand out even more when next to their more defined counterparts. Let's see what other lies the store page has for us.  'A complete visual overhaul has been performed to bring this revered title to the highest graphical quality ever.'  What the ♥♥♥♥ are they talking about? There's no overhaul, and definitely not a 'complete' one. This is just a now 10 year old game that's outfitted in 1080p with some very selective high-res textures (not even all that high-res either). There's also AA now, thank ♥♥♥♥. Doesn't make the game look any more dated. There's also a 'motion blur' option. Ever wanted a game to make you feel like you're ♥♥♥♥ drunk? There ya go. Seriously, that is NOT motion blur! They added some filters too that look awful, but I guess it's harmless after all. And subtitles that don't work. Yeah, really! The subtitles option doesn't work. It's greyed out in the menu. You can only turn them on from the config files. Fantastic.   Don't get me wrong, my problem isn't that the game looks old, that's okay with me. I do have a problem with the fact that it looks old yet still has such high requirements (again, GTX 560, what the hell) coupled with an engine that absolutely can't handle frame drops. One thing you're going along with constant 60fps, next thing you know you're in a room with a bit more effects going on and suddenly it's slow-mo city. Thinking about lowering the frame tresshold for such on occasion? Nope, can't do it during gameplay, only from the main menu! You can lower the resolution and hope that does the trick.  Here's a pet peeve of mine. Obnoxious and ugly film grain effect that you can't turn off unless you mod it out. Stop doing that! I hate film grain, give me the option to turn it off!  So it's a 10 year old game with very minimal updates that runs like ♥♥♥♥ unless you have the high requirements that it needs for some reason I can't even fathom. Face it, this game has no business being on pc with it's horribly un-optimised engine. You may say it's better than nothing, I say get any other version than this one. The Wii version has the same content, and though it doesn't run at 60 fps you won't have to worry about it going all matrix on you. Or you could just set it to 30fps, but what kind of scrub would do that, huh?",
            "review_score": "-1"
        },
        {
            "review_text": "i really wanted to like this game but the controls just don't quite cut it. using A and D to turn feels very un-intuitive, and for my keyboard, i can't even turn right while running (shift+W+D doesn't register as a command or something). plays fine on a controller except for the fact that you can't change the stick sensitivity. i know it just came out, but it's kind of disappointing that they took the time to add in HD textures and improve the frame rate (both things that didn't have much bearing on the game experience in the first place) but not update the controls to be more in tune with other PC games. i don't doubt that this can be fixed in a future patch or update, but for the time being this is not a great port of the game. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Unless your PC has the technical prowess of the Monolith, do not buy this abysmal port that makes Dark Souls look fantastic. Great game though",
            "review_score": "-1"
        },
        {
            "review_text": "Very akward to control. I fight the controls more than the enemies.",
            "review_score": "-1"
        },
        {
            "review_text": "i cant even play the game because of the black texture  ",
            "review_score": "-1"
        },
        {
            "review_text": "The controls work so differently in comparison to any other 3rd person shooter PC game. It just hurts my brain trying to get used to it.   Leon goes to save the daugther of the president an cannot even move sideways? He must stand still to use the knife?  Please CAPCOM, if someone is reading the forums, implement the following features: Set [A] and [D] to strafe. Make the mouse turn the player.  I already paid for the game as I have read the forums finding out that this way of controlling is supposed to give the unique resident evil experience. For me it feels like a terrible console port.  They got the controls in Resident Evil 5 and Resident Evil 6 on PC right, why not here?  The next time I am considering getting a new resident evil, the first thing I do is to search for the following on the Internet: 'resident evil bad controls' ... Expensive lesson to learn.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy wotse port than Dark Souls was whole game is essencly in slow motion aiming i had to turn sensivity up to max for it to feel somewhat comfortable all in all took a great game an made it ♥♥♥♥ even with a controler it contorls are so srewd up they dont work to much effort to rember what you have to do.",
            "review_score": "-1"
        },
        {
            "review_text": "I've heard great things about this game, and I'd like to tell you enjoyed it. I'd like to, but I can't because this PC port just doesn't bleeding run. Yes, this 'not recommended' is because of the port job, not the game itself.   Whenever I tried to quit the game, my entire computer would get stuck on a black screen that requires a hard reboot to fix. Oh, but this can be fixed...if you run the game in Windowed mode. Some people suggested the Borderless Fullscreen program, but that doesn't work properly either. I shouldn't have to play my games in Windowed mode to ensure that they don't crash my entire computer!  Random slowdowns are also a huge issue. If there's more than three enemies on the screen, your game can go so slow it makes bullet time in Max Payne look fast. These seem intermittent and random from my experience, but they are incredibly distracting nonetheless. Really ruins the atmosphere this game was going for. Some people claim you can remove this by opening the map, but it did not work for me.  The last nail in the coffin for me was the QTEs. I already think QTEs are an abomination and should be destroyed, but this PC port has the balls to make them nigh-impossible if you play at 60 FPS! Whichever boneheaded engineer at Capcom that decided that QTE speed should be tied to the framerate can go burn in the same hell as the person who decided weapon deterioration in vanilla Dark Souls 2 should be tied to framerate (albeit more indirectly in that case). Sure, I could play this at 30 FPS, but when you combine the narrow (And not adjustable!) FOV with a lower framerate, I get motion sickness.   I didn't even get to really play this game because how distracting these problems were. So I got a refund. If you want to play RE4, just get it on a console and stay away from this unstable PC port. It's not like it's hard to find a console port, it runs on almost anything later than a Nintendo 64/PS1.   Here are the specs I was running with. If you have a similar configuration, you might want to consider staying away:  CPU: AMD FX-8350 GPU: AMD Radeon R9 290 Sapphire Tri-X OC Edition Memory: 16 GB DDR3 1600MHz OS: Windows 10 Anniversary Edition",
            "review_score": "-1"
        },
        {
            "review_text": "how do i get a refund when the games does not work for me ",
            "review_score": "-1"
        },
        {
            "review_text": "extremely slow and i know its not my computer. DO NOT WASTE YOUR MONEY",
            "review_score": "-1"
        },
        {
            "review_text": "broken. does not run properly, yet another ♥♥♥♥♥♥ pc port.",
            "review_score": "-1"
        },
        {
            "review_text": "So far, this version of the game is so horribly broken that if you do actually manage to get the game to run, your cutscenes will be out of sync, the game will run like it is in 'slow motion' until it crashes on another cutscene later on.",
            "review_score": "-1"
        },
        {
            "review_text": "  The Short of It",
            "review_score": "-1"
        },
        {
            "review_text": "Believe me do not buy this, the game is full of bugs and its mostly unplayable because of it here are some examples: -HE Grenades doesnt explode when it hits the floor -When Leon kicks the camera zoom out of the map -Some times Leon is invisible (only the weapon that you have equiped is visible) -Bad frame rates with almost slowmotion every time -The plagas on the enemys multiply and its not a game feature so thats makes a simple enemy deatly because u get hit 3 times in a row even 4  Thats why im gonna refound it, dont get me wrong i love Resident Evil 4 but im only going to buy it 'again' when it is fixed",
            "review_score": "-1"
        },
        {
            "review_text": "Frame drops literally everywhere with high spec computer, this game is so badly optimatized fix your ♥♥♥♥ing ♥♥♥♥ capcom you ♥♥♥♥s. Still a good game though.",
            "review_score": "-1"
        },
        {
            "review_text": "I have three screens and the game is completely unplayable. The game is zoomed in and stretched across the screens. There is no way that I can see to change the resolution. Waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Windows 10 is not supported for this game. If you have windows 10, it's highly likely that this game WILL NOT WORK. This needs to get out so that capcom can get this game fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "We all know and love resident evil 4, it's a great game. But this port? Garbage. I played the game for the first time here on pc and i was really dissapointed in what i saw. The controls are fine and aiming with a mouse is much easier than with a controller, but the main problem is in the graphix. I had to play the game windowed, with ♥♥♥♥ resolution, because otherwise it would lag so much it would have been impossible to play, and my computer is not even that bad. So, in the end, i recommend playing this game on the gamecube if you can, since this port is even worse than the dark souls one, or hell, even deadly premonition's.",
            "review_score": "-1"
        },
        {
            "review_text": "This software is worse then malware on your PC. If you enjoy not being able to TAB out of your games, all screens black and being forced to flip the power switch because of whatever cancer is in this games code, you will love it. Terrible FOV, god awful mouse aim. Great remaster.",
            "review_score": "-1"
        },
        {
            "review_text": "Unoptomized port which doesn't run properly",
            "review_score": "-1"
        },
        {
            "review_text": "Good Game~，but  1.Don't have traditional Chinese,  2.movie no subtitle  so bad service.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most memorable games I have ever played. Get an Xbox or an old Gamecube. Screen goes black after starting a new game. Nothing happens.",
            "review_score": "-1"
        },
        {
            "review_text": "  GAMEPLAY IS SO BAD FOR COMPUTERS! I LOVE THIS GAME IN PLAYSTATION BUT IN COMPUTER IS BAD! PLEASE FIX GAMEPLAY",
            "review_score": "-1"
        },
        {
            "review_text": "Game breaking glitch doesn't allow me to move forward past the point of the glitch... Game was fun until that point... This, on top of it being a poorly optimized pc port makes for a not recommended. Wish I never bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried playing this on my computer and the scenes were laggy and even the gameplay was slow. That wasn't the big issue. The main problem is the controls. Yes, its an older game, but you'd think after all this time they would make a patch that makes it easier to move around. Nope. the real horror in this game is not knowing if you can turn your charecter around in time to shoot someone behind you.",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another speedrunned PC port",
            "review_score": "-1"
        },
        {
            "review_text": "I loved playing the R.E. series for a long time, my favorite one is 4 so when i heard there was a HD pc version was like ''OMFGOMFGOMFG'' so when i played the game,Guess what...it was slower than having a nerd getting sex at 15.it took me 3 hours to beat the 1st chapter and another issue is when theres a cutscene dialouge comes before anyone talks!and 1 last issue is when it said HD graphics it really meant old PS2 graphics (Sorry but with the PS4 out the PS2 is crap comparred to it) so i got this during the CAPCOM discount for 10.00$ but its still crappy,so word of advice:If you have a XBOX 360 buy the game for that console.PS this should be a example for those who try to convert old games to PCS so please dont do it!",
            "review_score": "-1"
        },
        {
            "review_text": "Where is quit? Where is subtitle?",
            "review_score": "-1"
        },
        {
            "review_text": "resident evil for biohazard 4 is game with zombi¨  it also crashes  how nice",
            "review_score": "-1"
        },
        {
            "review_text": "By many considered the best in the series. I beg to disagree - I dropped it after an hour or so The game is dated, steering is terrible (you use right stick to look left/right like in a racing game), user interface is akward and destroys immersion. I got it cheap in a Humble Bundle so not a big waste. Never listen to those nostalgia zombies. Revelations 1 and 2 is much better. RE5 is much better. Even RE6 is much better.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game out of curiosity for the series and the overwelming positivity this game has.This game might have been decent 20 years ago.The controls are absolute crap.Your dude moves like a freaking battle tank, as in very little and very poorly.So far the only terror i had was due to the fact that the controls are so bad that even in slow motion i still cant get the battle tank dude to turn or shoot or do what i want.I even bought a xbone controler to play this game and its still virtually uncontrollable.other than nostalgia dont waste your money on this, its not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "*TRIGGER WARNING: Unfavourable review; may require safe space and colouring books. Gender pronouns may be heteronormative. Thesaurus required.*  TLDR- This game is a crappy console port with unplayable controls.  I bought this on sale as part of the RE4/5/6 package.  I got about as far as the first save point before I got sick of playing this...the game could be described as an intoxication simulator, and it gave me a realistic idea of what life would be like if I had walrus flippers for arms and my feet were put on backwards.  The third person perspective is way too close fot the narrow FOV, it makes the game feel like you are following the main character around with your hands stuffed down the back of his pants while wearing a goldfish bowl on your head.  The character movement is sluggish and clumsy, it is like the character is heavily sedated and lacks peripheral vision and depth perception. If this was done on purpose to make the game more challenging, it may have worked, but not in a way that makes for an enjoyable game. Just walking down a curved path is a dreadful chore that makes churning butter seem like fun.  I'm not the world's ultimate gaming badass, but I could usually take on a group of 8 or 9 slow moving unarmed European villagers if I had an automatic handgun and a frag grenade without the urge to ragequit, sell my computer and join a monastery.  The reduction in graphics quality and poor optimization makes the game seem older than it is. I think the original Half Life game had better rendering and visual appeal than this one. Despite the potato quality graphics, and the fact that I run a newer high end gaming rig, this squeezes out a pitiful 24 frames per second. I might as well have built a time machine and travelled back to 1996. At least then it would still be appropriate for me to hit on high school girls and not have the cops called on me EVERY SINGLE TIME.  Aiming at targets? LMAO...good luck. I tried adjusting the sensitivity on the controller to make this easier, but it is still like trying to kill a mosquito with a wet bag of flour. They threw in an aiming laser to try to make this tolerable, but it doesn't help. It would be better if they just used an aimbot...even slow moving targets take 5-8 seconds to get a fix on. Considering the fact that it takes about 17 or 18 headshots to kill the most basic enemies, this game could easily make the Dalai Lama shout abusive profanity at his grandmother.  Overall this game did a good job of illustrating the considerable difference between console games and pc games, and why the two don't mix. The only way to port a console game IMO is to re-do the whole thing from the ground up to work properly on PC. It can be done, and it has been before, but I get the impression that the devs just wanted to squeeze a few more bucks out of the franchise...the PC gamer got the sloppy seconds here, and boy, they sure are sloppy.   Steam was good enough to refund my purchase with no hassle, so kudos to them for resolving the matter. Let's all give Steam a big hug for being a good sport and giving me back my precious hard earned money. If you knew how many orphanages I had to rob to earn that money, you would understand my strong feelings.  This would be a perfect gift for someone who is responsible for the death of one of your loved ones, or perhaps Gitmo detainees could be forced to play it as a less humane alternative to waterboarding.",
            "review_score": "-1"
        },
        {
            "review_text": "Resident Evil 6 was better. So was Gears of Halo, GTFO.  It's just some ugly ♥♥♥♥♥♥ console peasant port with tank controls and textures from 1923. How is this praised by ♥♥♥♥♥♥ Gamecube peasants? Because Console peasants are garbage.  Also suck my ♥♥♥♥ you ♥♥♥♥♥♥s kyskyskys.",
            "review_score": "-1"
        },
        {
            "review_text": "worst. already owned this on ps3 but i bought it again to take advantage of the mouse for shooting but it's so poorly optimised i've ended up using my 360 controller instead. the character can't straife using (a) and (d) and can't move at all when aiming. i know it's an old game but don't bother porting it to PC if it's going to be this bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game...IF IT WOULDN'T CRASH EVERY 5 SECONDS.",
            "review_score": "-1"
        },
        {
            "review_text": "Slow frame work for me v u v",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, Terrible port. I love everything about this 'upgraded' version other than I can't play it without it crashing every few minutes. These crashes just ruin the experience. You need to learn to properly optimize your games Capcom, very unprofessional.",
            "review_score": "-1"
        },
        {
            "review_text": "Not that 'HD' and a terrible port with a lower framerate that games from 2010 that i have on my PC. So this isnt a good port, at all, but im still tanking this on 10 fps and its worth it to play a classic again. In other words if you have a good PC then buy this game and enjoy from start to finish",
            "review_score": "-1"
        },
        {
            "review_text": "The game seems pretty good so far. However, the port is terrible. I nearly had to ask for my money back because it didn't seem like it was going to start up at first. Fortunately it starts up now but only after waiting for about 3 or 4 minutes! However I have heard of a few people who haven't managed to get it to work at all and Capcom don't seem to be interested in fixing it. I'd steer clear of this version of the game if I were you.",
            "review_score": "-1"
        },
        {
            "review_text": "I have 3 monitors and the game would not let me change resolution. So it ran off the screen and was unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable with keyboard/mouse (compared to a normal PC game). Hey, guys, I know it's a port, but how about strafe movement? Switching weapons with wheel up/down?  The character feels so freaking sluggish.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too much hassle for a PC remake. The game itself is great and will always be remembered as such, but this was put out there with just the intension of bumping up the graphics, clearly.  First off, my computer cannot run anything in HD or 60 frames, so that one was useless to me, I just wanted to have it on my computer. This is not a downside of the game though; I think it's cool that they managed to have better textures and whatnot and more power to whoever can run that sort of stuff. I'm just saying this didn't benefit my experience and it's unfortunate that the 60 FPS was one of the only selling points of the game.  Second, I could not play this game with a controller because my computer does not accept the USB's of afterglow xbox 360 controllers for some reason. I was stuck with the keyboard, so I wanted to get a feel for it. With all of this in mind; I set it to easy (something I've never seen before in any version of the game). Keep these two facts in mind for the rest of the review, because the two things I've just mentioned were the only selling points of the PC remake; everything else is just Resident Evil 4... with all of the 'new' problems.  I've only run through the game one time, which was on easy mode, and I noticed a few major things. I'm not sure if it was because of the difficulty, or if they just permanently programmed it like this, but some of the sections of the game were blocked off or redesigned so that you could pass them right away. My first serious encounter with this was the garden section in the castle. remember both halves of the moon stone or whatever to unlock the door and meet Ada as well as end the chapter? Well, the door was already open when I found it, and the staircase to get in the hedge maze was blocked. They actually moved the red gem for the second mask into another section of the area so that players could still get all the gems and complete the elegant mask. Other instances are getting the grail's in the castle (the king's grail is already set into place) and the clocktower when Salazar taunts you, 'I wonder if you can see us from here, Mr. Kenedy, or whatever (A brawl to get in the clocktower, shoot all the things blocking the gears, and fighting your way out turned into hitting a switch and the bridge is open, no wave of enemies on the bridge either). Again, I'm going to assume this had to do with the difficulty being set to easy, I just found it odd.  There were actual problems I've faced with this game though such as control. I'm guessing the developers just assumed everyone would play this game with a controller plugged in, because there are some, quite literally, FATAL flaws with the design. First off, the running sequences where you have to sprint away from the tumbling rock. As a first time player on this new console; I would have NO WAY OF KNOWING what the action keys were and the game did NOTHING to alarm me of them beforehand. Since I was using a keyboard, I was told to tap 'x' as fast as possible, which was easy, don't get me wrong. But remember when you have to dodge it at the end of the track? Yeah, you either get 'x'+'c' or BOTH MOUSE BUTTONS. What the hell were they thinking? I'm spending all my energy trying to mash the x key, but they want me to move my hand all the way to the inessential mouse which I've set aside in preparation 'for' said quick-time event? Bull ♥♥♥♥. I think the worst part is having to die three times on the second rock sequence just to wait for the 'x'+'c' command because I could not, for the life of me, reach my mouse when DODGE came up and flipped me the bird. When running away from the giant Salazar statue, I had to have my right hand mashing the 'x' key and my left hand overlapping my right to hit the correct mouse buttons. It was beyond ridiculous.  Here's the second issue: Unless you have a controller; you CAN'T rotate items in your inventory. I tried every button on the keyboard, spent roughly half an hour searching the key bindings (triple-checking for reassurance). So you know what that means? You can't buy the bolt-action rifle. period. It's sold to you in a way so that it's vertical, and no attache case expansion ever makes it wide enough to fit. This is stupid, not only for not being able to purchase the first rifle (which is my favorite since it's damage is insane when maxed out), but you never know how the gun will be positioned until you buy it. I eventually worked out this peculiar system where the semi auto rifle and shotgun remained on the left since they were also positioned vertically, but all of that's ruined as soon as you get a gun that's positioned horizontally like the Colt SAA (Broken Butterfly) You have to reorganize EVERYTHING so that the new gun will fit. All of the ammo boxes were horizontal, but it may sometimes RUIN your system by popping up vertically to make itself some room.  Not really a pet peeve, but it was disappointing to see that the 12 achievements for the game are the exact same achievements for the Xbox 360 version. Word for word, action for action, picture for picture. The only difference is that Steam achievements don't give a certain amount of points for unlocking them.  That's it as far as negatives go, but as for positives: I like Resident Evil 4. Again, the game itself is fantastic, but this remake had issues that they weren't taking PC considerartion in to. They didn't seem to understand that not everyone plays with a controller. It's not all about graphics, guys. I'd buy it for the console before you consider it on the computer.",
            "review_score": "-1"
        },
        {
            "review_text": "I had a lot of fun playing this game on Gamecube back when I was a wee little lad. This port is really good for the most part but the quicktime events just kill all of my enjoyment for the game.  Some of the quicktime events are broken at 60 FPS, like the Salazar robot. The only way to complete this quicktime event  -- and other ones that involve tapping the same button 100 times -- is to go back to the main menu, turn on 30 FPS, replay the part leading up to the quicktime event at 30 FPS, and then redo the quicktime event at 30 FPS.Having to do this workaround just killed my enjoyment of this game. This is a real shame because I love the gameplay and atmosphere in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "HOLY ♥♥♥♥ WHAT A BAD PORT. This game came out in 2005 and I can't even run it. There are almost no graphics options either.  The game is LOCKED at 60fps and is really not made to run at that framerate. Keyboard and mouse controls are almost Dark Souls bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Such realism, wan't to move while holding a knife in your hand? YOU CAN'T. P?robably the same with aiming the gun, but didn't even get to that.  Why can't there be conventional controlling scheme where you move with left stick and use camera and turn with right stick?",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING: what CAPCOM is advertising here in the Store Page of RE4 Ultimate HD Edition:  'This new PC version will include everything from the prior iterations including subtitle support in English, French, Italian, German, and Spanish as well as previously released bonus content such as the Separate Ways epilogue.'  is NOT true, as this new version of the game does not have any new subtitles added, if compared to previous version releases of the same game on other platforms!     Capcom is advertising on the Steam Store page that the Resident Evil 4 Ultimate HD Edition features English subtitle support but actually this is not true at all!  The game DOES NOT feature English language subtitle support for the cutscenes! (And I am not talking about radio conversations with Hunnigan, but the actual cutscenes). So, deaf and hearing-impaired people, beware!  I am very saddened that Capcom is making false advertisements and if you play the RE4 Ultimate HD version, you will discover that there have been no new subtitles added to the game, even after 3 re-releases of the game since the original Gamecube version!     Capcom better stops advertising things that are not true.",
            "review_score": "-1"
        },
        {
            "review_text": "so bought the game, not working, first it wouldn't even open, then I changed full screen setting to 0, it started opening but then just had a black screen, could hear the sound and everything just couldnt see anything, so annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game but I cant believe I spent money on this piece of ♥♥♥♥ port. WARNING! Will not run smoothly unless you have a really good computer. Mine is decent and can run games like skyrim and resident evil 5. There is NO reason I shouldnt be able to run this game other than a crappy port.",
            "review_score": "-1"
        },
        {
            "review_text": "sadly i made the horrible mistake of not checking the processor requirments before downloading.... :( so i cant play the game. Im very upset i cant play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "there is something wrong, it is like the game is in slow motion, i tried to repair these in OPTIONS but nothing works, and my computer should be able to support this game with no problems, i dont know what is happening :/",
            "review_score": "-1"
        }
    ]
}