{
    "app_id": 254880,
    "name": "MoonBase Commander",
    "release_date": "2014-02-06",
    "developer": [
        "Humongous Entertainment"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Strategy",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 101,
    "negative_ratings": 10,
    "price": 4.79,
    "description": "Explore. Strategize. Conquer.In the far future, Mankind has nearly exhausted all of earth’s natural resources. Fragile alliances between nations are tested to their limits as fierce wars ignite across land and space.MoonBase Commander puts you in charge of your own lunar territory in a quest to build the most powerful empire in space.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/254880/header.jpg?t=1478600417",
    "minimum_requirements": "最低配置: 操作系统: Windows XP (SP3), Windows Vista (SP2), Windows 7, Windows 8, Windows 8.1 处理器: 1.8 GHz Processor 内存: 1 GB RAM 图形: DirectX 9 compatible 3D graphics card DirectX 版本: 9.0c 存储空间: 需要 1 GB 可用空间 声卡: DirectX 9 compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Oh My God! I grew up playing this game with friends for hours on end back in elementry school and now its on steam, this... hold on, i'm having nostalgia. Best part? They didn't change a single thing!  I'd recomend this game to anyone, it's fun, addictive, and for a great price. I hope that this release to steam rekindles the online multiplayer community and gets people interested in it once again. It's a steal for only $6.",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest game to ever bless the world with its presence. A true classic, Moonbase Comander immerses the player in a sci-fi world of intense strategy and beautiful destruction. Battle your friends, or take on the AI on a multitude of premade maps, or use the level editor which is easy and fun to use. A sassy, robotic voice is hilarious and the funky music will always keep you groving. The wonderful simplicity of Moonbase Commander gives games on the caliber of Starcraft 2 a run for their money. Moonbase Commander is a must-buy.",
            "review_score": "1"
        },
        {
            "review_text": "only LAN multiplayer works I have still not managed to beat gnomeSlayer yet.",
            "review_score": "1"
        },
        {
            "review_text": "For years, this was probably our favorite strategy game to play on the home LAN. We still play it from time to time. I highly recommend it (and, it goes on sale for under $1 from time to time).  Some helpful information: It is turned based; however, the turns can be timed if you want (60, 30, or 15 seconds). The game does not work across the internet without a third party tool (look for the Moonbase Commander steam group to find that tool called -- it's called Moonbase Console, and it can procedurally create random maps as well). It includes a built in map editor. Also, the game has a very easy learning curve... there are not that many units, so it is a good intro strategy game for when friends come over. However, multiplayer is limited to 4 players (but, bots can fill in, if you have less).",
            "review_score": "1"
        },
        {
            "review_text": "A really neat relaxing and at the same time chilling tactical 50% turnbased RTS. This game remembers what lots of new games forget: That its all about the gameplay! Its the first 50% turnbased RTS I ever play, wasnt aware that such a thing existed, I just cant recommend this game enough, I f you want to play with me just add me or write my profile :)  + Addictingly fun + Good depth + Different civilizations/races - Messy to join multiplayer  Graphics: Kind of middle of the 90´s Not good not bad. Gameplay: Lots of depth with different tactics possible to apply Music: 80-90´s game music, quite okey.  Multiplay: You need to install Tunngle, join the same room as other players, download  a program called MoonbaseIP, start it with administrator, then host a game and  someone can join you. A bit of a fuzzle but it works like a charm once your in it. Link to the MoonbaseIP can be found in the discussion forum.",
            "review_score": "1"
        },
        {
            "review_text": "I hope you like 640/480 because that's all you ll get. I hope you like clunky mouse controle because your speed is impaired and only left button works. Don't try to zoom. So, there is no tutoriel nor campain. You can choose to map edit, skirmish, multi player or challenge. In challenge, you will find mission of easy caliber and objectives. Don't expect any help or direction on whatever you must do. On the first one you must build collect from enery pools. They of course don't appear on munimap but first one is in reach. Second one, you must build a line of hub to get there. There is strictly no indication or tool tip. You can hover mouse over the buton all you like before you find the utility on divers actions. How can such unfinished game be published in 2014 baffles me.  I bought this game during sales because it looked fun. The good part is that I now have more time to play other games.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not the first of its kind, or necessarily the most intricate. But it is a shining gem of design, where a scant 18 units, several environmental factors, and the inherent complexities of varying numbers of combatants combine to form gameplay that is an exceptional embodiment of what it means to be 'compelling'. Note that it is not Starcraft, or Civilization, or Advance Wars, but parallels can be drawn with all of these despite Moonbase Commander's unique eccentricities. Things like graph theory and virtual spatial awareness play different roles here than in other similar titles. Take care to attack with efficiency, but remember that one bridge being destroyed can wipe out your entire strategy in an instant. Those who enjoy turn-based RPGs and strategy games are urged to investigate this, but with the caveat that a timer be kept on hand, as Moonbase Commander can alchemize a full day into a blur of confrontations, chronically catchy soundtrack and numerous instances of the word 'crawler' being employed as an expletive.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my favorite strategy games.",
            "review_score": "1"
        }
    ]
}