{
    "app_id": 254860,
    "name": "Lords of the Realm III",
    "release_date": "2015-12-03",
    "developer": [
        "Impressions Games"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 8,
    "negative_ratings": 13,
    "price": 3.99,
    "description": "When it comes to medieval real-time strategy, Lords of the Realm III flies the flag high. Whether it's maneuvering troops on the battlefield, negotiating trade and alliances, or overseeing armies across the lands, RTS fans will find plenty here to enjoy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/254860/header.jpg?t=1478600377",
    "minimum_requirements": "OS: Windows Vista, Windows 7, Windows 8 or Windows 10 Processor: 1 GHz Processor (1.4 GHz recommended) Memory: 1 GB RAM Graphics: 3D graphics card compatible with DirectX 7 Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Eight years after the previous cult classic LotR2 came this much anticipated title - now over ten years ago, but fans of the series probably still remember the growing disappointment and frustration they felt as they played it. It is not an outright horrible game, but it just fails at every turn and constantly provides a frustrating and annoying flow to the game.  At first it doesn't seem quite so bad - although the first thing you find out is that basically the entire economy has been removed wholesale, and instead you just have underlings to manage each plot of land you own, and your choices are which ones - needing to assign enough food producing serfs to support your army, choosing which knights to assign with their different unit types, churches for morale, towns for income, etc. One good part here is that there are numerous named lords, mayors, and merchants with different bonuses they add to their region or your nation.  So you assign some knights/lords and they raise an army and you wait for its morale/numbers to reach maximum, merge your units together and head off to invade the enemy, having nothing else to do in the game once all your parcels of land are assigned. You engage the enemy and find the more granular unit control of LotR2 (which plays like a true RTS) has been abandoned for a return to the system of LotR1 - you order your knights around, and their troops follow them as a unit (similar to Total War). This is okay for open field battles, but invading the walls of a castle basically becomes impossible to do successfully, so you resort to just smashing the walls down with siege weapons to turn it back into an open field battle.  Up to this point there are pros and cons compared to its predecessor, however once you have defeated your enemies armies is where everything goes wrong. You move on to siege his castle to conquer the region, and while you are doing this all lhis feudal lords have respawned at their parcels and now tend to wander into your lands in small units to raze your food production - and you don't have enough units to both attack and defend very well, and even if you do intercept and kill off his raiders they just respawn again instantly at their base - even if you dishonourably kill the ones you capture, there are always more to assign even if they have worse stats/unit types. Oh, and did I mention any time you are controlling a battle personally time is going on in the main map? So those raiders will be screwing you over if you want to actually control an interesting/close/important battle.  On the earlier, smaller maps this is annoying but can be overcome due to the limited amount of units and regions in play, and because just taking one more region from what you start with gives you enough of a numeric advantage to field an offensive force and a couple of quick reaction forces to repel these weak raiders positioned appropriately, so you progress slowly and conquer Ireland and southernEngland and move on to the larger scenarios, shuffling armies about on the map, not normally being able to participate in battle yourself, but slowly gaining an advantage and then usually quickly finishing off the map once you reach a certain critical mass of parcels to work with.  Then you get to the more meaty maps, like France during the 100 Years War,with two opponents and loads of regions and no clear defensive lines and you give up as it turns into a giant game of whack-a-mole chasing around all the tiny raid forces constantly running over your land while your main unit tries to repel either of the main armies your opponents send around every now and then, and no matter how many of those raiding parties you kill off more keep coming.  Note also on a technical level this seems to be a bit flaky - alt tab seems to cause crashes regularly, or you also can get stuck not being able to return to the game (click back on it and the screen never redisplays), so if you do get this it might be prudent to save any time you need to switch out of the game. Note also Steam only currently seems to count time spent in the pre-launcher in the time played for this game.  In the end effectively the entire economic part of the game is gone, but at the same time the combat side isn't really great, plus most of the time you can't afford to spend time taking part in the actual battles because you have to constantly be dealing with tiny raid forces that can do outsized damage to your ability to field an army.",
            "review_score": "-1"
        }
    ]
}