{
    "app_id": 254820,
    "name": "Ground Control Anthology",
    "release_date": "2015-07-08",
    "developer": [
        "Massive Entertainment"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 57,
    "negative_ratings": 10,
    "price": 3.99,
    "description": "The year is 2419. War has devastated Earth, and mega-corporations take to the stars to fight over colonised planets. Your employer, the Crayven Corporation, chose you to command an army of ground and air forces. You thought it would be just another brush-fire war. You were wrong.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/254820/header.jpg?t=1478599955",
    "minimum_requirements": "最低配置: 操作系统: Windows XP (SP3), Windows Vista (SP2), Windows 7, Windows 8, Windows 8.1 处理器: 1.8 GHz Processor 内存: 1 GB RAM 图形: DirectX 9 compatible 3D graphics card DirectX 版本: 9.0 存储空间: 需要 4 GB 可用空间 声卡: DirectX 9 compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I was ten years old when this game came out. The gaming magazine that I loved was distributing a demo of the Ground Control and I was so impressed with everything I saved my allowances just to buy this game. The Science Fiction theme, memorable Soundtrack, the reactions of your units; it's all just in such a perfect place that they've found the brilliant balance of making an amazing game. - All you get is what you prepare before the mission; these type of games are not popular these days, it's shameful really.  Ground Control is probaby one of the best video games ever made and it was so damn ahead of its time that you get a gem like this once a decade or two.  Buy this game immediately.",
            "review_score": "1"
        },
        {
            "review_text": "This brings back memories. Finally Ground Control on Steam and working on windows 7! Two tiny issues I'm having. With 2 displays (both same resolution 1 on HDMI and 1 on VGA) it picks the secondary display to show the game instead of the primary. And no possibility to invert the camera control on the scroll button.  But these are tiny issues which won't spoil the fun, works like a charm just like the old days.",
            "review_score": "1"
        }
    ]
}