{
    "app_id": 255390,
    "name": "Max: The Curse of Brotherhood",
    "release_date": "2014-05-21",
    "developer": [
        "Press Play"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Platformer",
        "Puzzle"
    ],
    "achievements": 27,
    "positive_ratings": 968,
    "negative_ratings": 53,
    "price": 10.99,
    "description": "Max: The Curse of Brotherhood is a cinematic adventure filled with action-packed platforming and creative puzzle-solving. Armed with only a Magic Marker, Max must confront evil at every turn in a hostile and fantastical world in order to save his kid brother, Felix. Join Max on his great adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/255390/header.jpg?t=1538764132",
    "minimum_requirements": "OS: Windows XP SP3 or newer Processor: Dual-Core 1.6 ghz / AMD Dual-Core Athlon 2.0ghz Memory: 2 GB RAM Graphics: Intel HD 4000 or better DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX(r) compatible",
    "recommended_requirements": "OS: Windows 7 or newer Processor: Intel Core i3, 1.7ghz or faster Memory: 4 GB RAM Graphics: GeForce GT 640 / Radeon HD 6750 DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX(r) compatible",
    "reviews": [
        {
            "review_text": "SO. MUCH. FUN!   One of the reviews here said that if one enjoyed Tomb Raider, one would enjoy this title as well. I bought this game based on that review and I have to say, this has got to be one of the my favourite platformer games.   The gameplay is fun, unique and exciting. You have a magic pen that you can use to transform your environment into a platform for you to interact with and to help you on your journey to find your brother. I thought it would be awkward to try and draw things on screen with the controller, but I was wrong. It was easy and intuitive, one element that I enjoyed about the game.  + Fun little puzzle-platformer. + Pretty graphics (like watching a cartoon). + Predictable but still enjoyable story. + Puzzles are mostly not too easy (though this could be a con for a kid). + Great voice acting. + Very forgiving checkpoints. + Tight controls. + Very well paced.  - Final boss fight is too short and too easy. - Linear (though for this type of game, it is sort of expected).  I seriously hope there's a sequel. Would buy it in a heartbeat.  My Rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun, funny, platform puzzle solver. Game saves for you making this very fun and not frustrating like some other games out there. Graphics and sounds were great. Most puzzles were pretty easy, there are a few good ones though. Thr game is kinda short, but has some unique features by allowing you to alter the eviroment a bit. I got this in a bundle awhile back so it was worth the cost. I would give it 88/100 pick it up during a steam sale.  Now go give you brother or sister a hug.",
            "review_score": "1"
        },
        {
            "review_text": " 7.5/10    'Jumpin' Max with the MagicMarker.'   Max is a 3D side-scrolling puzzle jump'n'run with a great variety and very nice graphics. The story starts that Max is angry with his little brother &amp; therefor decides to try a little spell on him - which actually works. The quest is to rescue your little brother from the monsters of an imagination world. At first you have the feeling this is a cute platformer with easy known puzzles for children (age 6+)... BUT  as the puzzle learning curve climbs fast, Max has something new to offer for everyone at every age.    =&gt;Don't be fooled by the 1st chapter! (It's like the easy tutorial...)     Pros:  + great variety (slow&amp;fast scenes) + great checkpoint/auto-saves + good gameplay + good atmosphere + good graphics + good controls + good sound&amp;ost + good puzzles (learning curve) + good difficulty (starting @2nd chapter) + okay story + cut scenes + no TRINE clone + X360 controller support + a lot controller rumble  Note: only at the 1st chapter 'too familiar puzzler' feeling!    Cons:  - none - no trading cards (- no coop feature)   A very good, slow&amp;fast puzzle platformer with a story about the responsibilities of brotherhood. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is the prime example of a modern puzzle-platformer done right. It exploits all the best elements from other 2D platforming gamer, notable nods to Heart of Darkness (1998), along with an incredible diversive gameplay tool in the form of the 'magic' marker to make one of the most immersive and fun-to-play games I have played all year. - 9/10",
            "review_score": "1"
        },
        {
            "review_text": "probably died 189 times, tried again until I figured it out! Great game, lots of fun and hours of gameplay with amazing graphics, cool storyline and it is very very entertaining!! Got it on special, did not think much of the game until I started playing it, im more than 8 hours in, 90% complete and I dont want it to finnish! Puzzles are not impossible, what I love about the game is the creators was more interested in creating a cool storyline and gamplay than trying to break your brain! One of my best impulsive buys on steam, and one day my son will love this game too!!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this immensly from start to finish. A quality platformer with a good mix of action/puzzle solving throughout. It introduces new abilities at a steady pace throughout the game which leads to some quite varied puzzles (which always seem to be satisfying rather than frustrating).  Has elements of many other platformers, but it really reminded me of Heart of Darkness (the Eric Chahi game if you remember that from way back when).  At the time of writing this during the 2014 summer sale, it's got 50% off and it's worth every £/$/€.",
            "review_score": "1"
        },
        {
            "review_text": "A game for all ages. A must buy. Awesome story line and graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Fantasticly fun puzzle platformer. The voice acting and graphics are so rich. I played this game with my children. It's a blast seeing them enjoy the gameplay and the storyline. Plus, the platforming puzzles are challenging enough but not too frustarting. I recommend playing this with a gamepad, as I used the keyboard and mouse and could tell it wasn't quite optimized for that game.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute breath of fresh air comes in this delightful 2.5D package. With Trine-esque graphics with Limbo's gameplay, this game hits nearly all the marks for a Puzzle-Adventure. If you loved either of those games, do yourself a favour and play this now. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Bought this yesterday and played it once it was downloaded. Fabulous game: gorgeous, colourful graphics, super-smooth and reactive gameplay, controls that are simple to master quickly, a fun storyline... and enormous fun.  It's an incredibly 3D platform game that has everything you could want. Death-defying leaps, swinging on ropes, collapsing platforms, rope-bridges, puzzles, monsters that try to eat you, attack you or explode on you... And there's a fresh element: you can magically alter some parts of the environment. Raise a platform up higher to reach another level. Raise three platforms to create a bridge. And more... Can't wait to play some more. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great casual (?) game. Its a bit more rough than casual, because some of the fast action scenes are a serious pain in the rear with a controller. I just don't know how one would be accurate and fast enough to draw whats needed in the tiny amount of time for the action scenes. I had to switch to mouse+kb to get through those. Other than that, the game is wicked beautiful, and really creative in its design and story.",
            "review_score": "1"
        },
        {
            "review_text": "A very FUN and GORGEOUS game.  Reminds me so much of Heart of Darkness (game from 1998).  I recommend highly it!",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game, love to play with my dauther !",
            "review_score": "1"
        },
        {
            "review_text": "Other than game not unlocking and having to look on forums to find a fix, once that was fixed i played it even more i got sucked into the game. The last time i really enjoyed a side scroll game like this was back when I 1st starting playing the Commander Keen series back in the 90's which yet i haven't had a chance to get on steam. This game at some points do become a little challenging where you have to act fast and sometimes do it over a couple of times. The graphics are pretty good using the Unity3d engine which I know from creating 3d objects for a 3d VR chat/build environment called ActiveWorlds. If you are looking for a fun game to play than this game is for you. Game seems to run smooth, game seems to be well balanced as well. Also wouldn't be a bad idea for the developers to add modding for custom levels and put in a workshop so others can download other's levels,etc. that would bring this game to a higher level. Would I pay full price for this? well yes if I had the money all the time to buy things full price. I bought this game on the last sale that was running. Even the wife thinks this game is pretty cool with the magic marker.",
            "review_score": "1"
        },
        {
            "review_text": "dear devs, if you gonna make a side-scrolling game without giving player any alternative gameplay on every phrase of it, then just make an animated movie, not a video-game. there would be actually no difference in gameplay if you force 1 million player to play this. how come it make sense to make it into a game -.-",
            "review_score": "-1"
        },
        {
            "review_text": "Childish and boring game.",
            "review_score": "-1"
        },
        {
            "review_text": "awesome game! it has been a long time since i've played a good game like this.  this game challenges you to think and be creative in order to advance. each chapter provides new wonderful environments with cool graphics. i played with my little nephew and he was able to figure out some things on his own while i helped him with others. great for kids and adults. highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cute. Side scroller reminds me of Pitfall LOL - jumping on vines, water, avoiding rocks, etc.  It looks awesome! Almost like playing a Pixar game. I thought the story is cute and the puzzles are fun. I picked it up on sale and glad I did.",
            "review_score": "1"
        },
        {
            "review_text": "While it wasn't my all time favortite title, I enjoyed the game and found it a worthy spend of my gaming gold.  I'd rate it a 7/10. Solid graphics, relatively linear and middle of the road platformer. No glitches. Played with an XBox 360 controller (or other similar) is necessary, IMO.",
            "review_score": "1"
        },
        {
            "review_text": "The Verdict  A bright platformer is just what we needed on Xbox One and PC Max: The Curse of Brotherhood’s vibrant setting and terrain-altering puzzles deliver. But the adventure doesn’t quite feel next-gen. With unintuitive controls, puzzle mechanics that’ve been done better elsewhere, and a story with the depth of a coloring book, it’s hard to stay invested in this short adventure.    Using a giant marker to color your way through the puzzles of Max: The Curse of Brotherhood offers a great-looking and clever twist to the platforming genre. Well, it would if it weren’t so frustrating half the time. Once the novelty of drawing wears off, the curse we’re left with isn’t brotherhood, but awkward controls.  I generally like the idea that I can make drawings to help solve platforming puzzles, even though it’s not as freeform as the concept implies. You get the marker early on, but before you do, climbing ladders and jumping over endless gaps as Max in the beautiful 2.5D environment gives you your first taste of the floaty controls. Cruelly, our little hero is a complete platforming pansy who can't even double-jump; one long-ish fall or hit from just about anything and he'll go down faster than that kid in Limbo. And he went down a lot. This game isn't as cuddly as it appears.  New marker powers come at a nice pace though, and each one has its own vibrant chapter full of briefly interesting ways to use the mechanic. The water temple is dripping with clever puzzles that had me drawing spouts of water to create paths and making boats out of vines. The fire temple, on the other hand, is more of a thrilling race, where the marker helped me to quickly find an escape route from a fiery lava beast. Discovering new ways to utilize the power of the marker is entertaining, and each area offers some fun surprises. When I could get the marker working, successfully navigating Max through areas using vines, branches, and water spouts together to create a sort of mousetrap sequence was seriously satisfying. Some high-pressure levels towards the end where you’re outrunning lava are particularly epic as well.",
            "review_score": "1"
        },
        {
            "review_text": "it's a 2.9D puzzle platformer, and the best-looking environments that I have ever played in.   2.9D? Well, it's a 2D platformer, rendered in full 3D, wiht a rotating camera the changes angle slightly depending on the scene, and it renders beautifully. I genuinely wish I had a 3D Screen of some kind to try this out with. Often times you will see a path leading off here or there, and you feel like you should be able to follow them, but they are no in the 2D space, and are purely cosmetic... awwww.  It's a great looking game, it has a fairly simplistic, yet entertaining story line, it is just long enough that you can enjoy the immersion, yet don't get bored of the game or it's mechanics, and it has a few secrets that temp you to replay levels to find them.  None of the puzzles are so difficult that you will need to look upa guide - at least I ddin't have to, I just had to sit there and think about it for a minute. I think there were about 5 puzzles that wern't immediately obvious, and 2 of them actually had boxes that you could use, but they looked like part of the environment. (just a quick heads-up). Also, a couple of the secrets you only realise are there because you fall/die and see them on the way down. There are many 'no return' areas, too - where once you go through this door, it slams behind you, or a moster wrecks the path, or you slide/fall and can't go back. So make sure an area is clear before you carry on.  Voice acting is well done, story is simple, cute, but servicable. the magic marker can be a little hard to control on th eodd occasion, and it got me killed once or twice, but nothign that I would shoot the Dev's grandmother over :- ) Checkpoints are very forgiving.  Great little game to burn a few hours in.",
            "review_score": "1"
        },
        {
            "review_text": "A very pretty game, with a colorful and enticing universe. It's a platformer with a good atmosphere and some imagination. It's rather on the 'casual' side: it's very varied and not too difficult, which will make you feel like you're good at this game.  Graphics: Great. Sometimes you feel like you're into an animation movie.  Physics: Great. All objects behave, move and fall like you'd expect: boulders, vines, branches, roots, water and jets, ...  Game mechanics: Good. You change objects from the scenery with your magical pen to reach your objectives (progress through a level, block enemies, succeed in an impossible jump, ...) You can only do so starting at a few select spots in every level.  Gameplay: Good. It's dynamic, the setting changes often, so you'll have to find new ways to deal with the new challenges, and it's never feels repetitive or boring.  Story/Dialogue/Voice acting: Good (nothing to write home about, but good)  Level design: good to great (some good ideas, lots of imagination in some areas).  Difficulty: never too difficult (At most you'll retry a couple of times before overcoming an obstacle, when you die you lose less than a minute of progression).  Length: Short (about 7 hours to reach the end, a bit more to find all secrets in all levels). The progression is rather fast, so you'd have traveled a long way at the end of the game.  All in all, a good game that kept me wanting for more to the very end.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Starts a little slow with the simplistic puzzles, but after awhile I gets a bit more challenging and it really starts to pick up and give you more enjoyment. Graphics are splendid, and the cutscenes were very eclectic and reminded me of pixar style animation which is not a bad thing! I wouldn't be surprised if the animators for Max worked there in the future honestly. All in all this is a great game with a big fun factor. Definitely worth the $2.99 I bought it for and much much more! :D  10/10 would pull more mushstupidos eyeballs. ",
            "review_score": "1"
        },
        {
            "review_text": "I remember a time when the reviews for this game were 100% positive. I was hoping it would stay that way. I've played though this game twice, and I am very tempted for a third run. This game is just amazing, and I can say almost not a bad word about it. It is worth the price and then some!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a very good choice, if you like plattformer/puzzle genre. It is neither boring nor cloudy, however on some parts its freakin' difficult.   Every riddle is solvable. Some of them are easier to get but others can be annoying. I started the game and after ~25% of the progress, the game unfolded its full nature.  First of all, you can see the lovely graphics and surroundings, the brave hero named Max, who tries to free his little brother. Simple Story, reminds me a bit of 'Heart of Darkness'. Nevertheless, it is not just a copy.  Every chapter has new Challanges and the game itself develops.  You'll get a magic pen as a wepon and from chapter to chapter you will learn new abilitys concering to this pen. I did not play in one go, because I needed a break to prevent insanity. This game is awesome, but sometimes you will be very frustrated. Some Ideas may be the right ones, but thinking and doing is not the same progress.   Technical aspects: I played it with a xbox controller, very good and accurate control. Ingame sound is okay, you'll hear screams of death quite a lot, so maybe you wont use ingame sound ;-) Simple settings, no problems with crashs/install etc.  All in all, it is a very good game, beautiful and scary at once. Nice optic, good riddles and the best thing is to resist your frustration and solve everything without checking a let's play. That's the real challange!  I bought it during the last sale, but full price is also worth it.  Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "fun game if love limbo you will love max ",
            "review_score": "1"
        },
        {
            "review_text": "Stunning looking game and also a lot of fun. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Played this together with my six year old son and we both loved it. He managed to play the game and solve most puzzles on his own, but the games contains some puzzles that are to hard for a child to solve. The game is beautifully styled and the controls feel very comfortable ( Played it with a XBOX 360 controller) When you fail the last checkpoint is usually not far back (with the exception on some points).  All in all a great game that we'll be playing again soon.",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely fun and has a pixar feel to it.It's not too hard,but there's enough parts where it can be challening.The cutscenes skipped a lot even when I lowered the settings but wow this game was a blast!",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite good and easy to recommend. Its very playable and wonderful to look at. The controls work well. The graphics are very polished. The sounds are good too. I particularly liked the attention given to providing a range of noises emanating from enemies. The plot is a little cliche but that is not particularly important. Its not that long but I can understand why. The main game mechanics are fully implemented. Any longer and it would be as boring as the average FPS from a decade ago. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Max: The Curse of Brotherhood is a neat little platformer where the central character Max has to save his little Brother Felix from certain doom. The graphics and level design are both top notch and function very well with the magic abilities Max gains throughout his adventure. I especially liked the innovative way the core game mechanics have you 'draw' into the level to move stuff around and help Max.  I enjoyed every bit of it and even challenged myself to complete each level without dying. Secrets and achievements are very transparent and fair. The game indicates missed secrets and collectables. Playing with a controller was fun; cannot comment on keyboard + mouse.  If you're looking for a good game that isn't publicized like a AAA game, get Max: The Curse of Brotherhood :D",
            "review_score": "1"
        },
        {
            "review_text": "Get it! It's on sale! I haven't even finished this game yet and it's already sooo worth it. There's some other review saying this game has a 'Heart of Darkness' feel to it. Indeed, it has.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing puzzle platformer which is well worth the full price. I've been playing it for ages, haven't completed it yet and sill feel like it's great value (disclosure: I did actually get it on sale, but in hindsight, I'd have been happy either way).  It's really well presented, with some fiendish tantrum-inducing puzzles and stands up there as one of the best puzzle platform games.  In my opinion, playing it on keyboard and mouse is better than controller (you get better control of the magic marker).",
            "review_score": "1"
        }
    ]
}