{
    "app_id": 255370,
    "name": "KickBeat Steam Edition",
    "release_date": "2014-01-20",
    "developer": [
        "Zen Studios"
    ],
    "publisher": [
        "Zen Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Music",
        "Action",
        "Indie"
    ],
    "achievements": 42,
    "positive_ratings": 474,
    "negative_ratings": 251,
    "price": 6.99,
    "description": "From indie pioneers Zen Studios (makers of Pinball FX2 and CastleStorm) comes KickBeat, an innovative rhythm game with a Kung Fu theme, featuring fully 3D characters and high-energy music! You can use your own music to create custom KickBeat tracks, allowing you ultimate replayability!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/255370/header.jpg?t=1447358822",
    "minimum_requirements": "OS: Windows Vista/Windows 7/Windows 8 Processor: Dual Core CPU @ 2 GHz Memory: 1 GB RAM Graphics: ]Geforce 8600 GT (GDDR2, 512MB) / Radeon HD 2600 Pro (512 MB) category, DirectX® 10 compatible video card DirectX: Version 11 Storage: 2 GB available space Sound Card: DirectX® compatible sound card",
    "recommended_requirements": "OS: Windows Vista/Windows 7/Windows 8 Processor: Dual Core CPU @ 2.40 GHz Memory: 2 GB RAM Graphics: Geforce 8600 GT (GDDR3, 512 MB) / Radeon HD 3670 (512 MB) category, DirectX® 10 compatible video card DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DirectX® compatible sound card",
    "reviews": [
        {
            "review_text": "It's a rhythm based game that doesn't follow the rhythm very well. Sometimes it will do the drum beat, sometimes it will do the guitar beat. Sometimes it will throw the enemies faster, sometimes slower(during the same sequence).  Combine this with changing enemy positions meaning the same beat/riff/whatever changes required keys to press, add horrible camera placement, and you've got a recipe for a game that you will play for 40 minutes and get frustrated with it",
            "review_score": "-1"
        },
        {
            "review_text": "Kickbeat = Listening to your fav songs while kicking people in their faces. I can recommend that.  :-)",
            "review_score": "1"
        },
        {
            "review_text": "Fun ♥♥♥ game. Never before have I fought off a swarm of Turkish men in a public bath house to P.O.D. Now I can finally cross that off my bucket list.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good addition to the genre of good music driven video games such as Audiosurf 2, Audiosurf 1, and Beat Hazard. It is also quite similar to another great game called One Finger Death Punch. KickBeat combines martial arts fighting and music to create a solid game. The game has a single player campaign Story Mode where you play through all of the songs that come with the game. First as a male character. And then as a female character. As you keep playing and get better scores on the songs that come with the game, you unlock more characters that you can play as. And you also unlock more outfits for the existing characters. You can of course also play this game with your own music files as well. Although in this game, you need to manually set the beats per minute for each custom song that you want to use. Although the game makes it fairly easy for you to do that. The game plays a 15 second section from the start, middle, and end of the song. And all you have to do is just tap the Space bar to the beat of the song. Then you can listen to the final result to make sure that the beats are set properly with the song. Then the song is ready to be played in the game. The game has selectable difficulty levels so you can choose how difficult you want any song to be. It may take some time to get used to playing KickBeat at first because the in game tutorial doesn't really prepare you very well. But keep practicing and you'll learn how to play the game. If you like music driven games like Audiosurf 2, Audiosurf 1, and Beat Hazard, then I recommend KickBeat",
            "review_score": "1"
        },
        {
            "review_text": "Somehow we accepted that rhythm games could only use geometric abstractions to inform the timing of actions, but KickBeat replaces these with goons to pummel and the results are refreshingly fun. You play as Lee or Mei, two cardboard cutout characters in a fight to protect… something. The story is not really important and doesn’t get in the way or improve anything. No matter your motivation, what’s clear is that you need to beat up hundreds of goons, and you need to beat them up with impeccable timing.  At first, the fighting/rhythm mashup mechanics can feel a little overwhelming. Your enemies encircle you, and in a specific sequence step into one of four quadrants represented by your action buttons. There are color-coded baddies, which inform how closely they can group, and if more than one can attack simultaneously. After a few songs, these rules seamlessly meld into your subconscious, and you can effectively groove into a Zen-like state that only good rhythm games afford. The note charts and timings of each track feel dynamic and fine-tuned. Each time a song drops a deep hook or a heavy beat, the corresponding skull bashing feels great. The difficulty scales well, and you feel yourself improving to the same tune as your opposition. Boss encounters provide slight variances to the core gameplay, and actually provide a decent change of pace.  In KickBeat, gamepads are not only supported they are strongly recommended. Because of the difference in spacing between WASD and the intended cross pattern of the action buttons, one can’t effectively get into the groove on a keyboard as well as with a controller.  As for the actual soundtrack, it’s difficult to comment on given how subjective musical taste can be, but I found the quality of songs varied wildly. You get a fair share of clumsy nu metal and rap rock, but you also have some well-crafted electronic, and some competent dub-step. What’s surprisingly missing is “Kung Fu Fighting” by Carl Stevens. Zen Studios, how did you miss this? Altogether, I’d say the soundtrack manages to have more good than bad, but some of the lower quality tracks have a tendency to bring you back down to earth.  Luckily, the bundled soundtrack is just the start, and you can import any song from your MP3 collection. However, don’t expect a fancy automated import tool. You will be required to tap a button to the beat of each song in order to calculate the BPM of that track. Additionally, the note chart created for each song will only be based on the timing of the beats - no fancy progressions based on the actual notes or melodies, just timed commands. It’s a feature that breathes a little more life into the original game, but not enough to keep you coming back for more.  As a devotee to rhythm games, I was excited to see if KickBeat could manage to deliver a new experience to a genre that has recently felt flat. It’s concept of using hoards of thugs as beat-fodder is more than a gimmick and provides satisfying play, but an inconsistent soundtrack, hackneyed presentation, and a weak track importer unfortunately keep KickBeat from being a true contender.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting take on music and rhytm games with a fighting twist. There's even a story mode with two storylines and bossfights.  As for the gameplay, it shares similarities with Dance Dance Revolution, mainly the 4 button layout. Kickbeat also has multipliers, Chi mode (star power that doubles the multiplier) and powerups. Not very difficult, but the main challenge is to get to the Master difficulty or learning to play without prompts (like Batman games). After playing Story mode for a while you'll unlock 'Beat your music' mode that lets you use your own tunes in game, though it doesn't provide as amazing show as built-in songs. Speaking of music, there are multitude of genres present: drum'n'bass, (nu) metal, hip-hop, electro and a bit of dubstep. PC version has the largest soundtrack of all versions, sporting 6 additional songs from the game 'Electronic super joy'.  For rhytm game junkies this is a must-buy!",
            "review_score": "1"
        },
        {
            "review_text": "A rhythm game where you hit the button when the game dictates you to do so with flashy kung fu visuals to make you feel like you are really kicking butt with a theme song playing. I recommend you check out the soundtrack before purchasing the game to make sure that you receive maximum enjoyment out of the game, as the storymode song list cannot be changed and while there is a way to play your own custom songs, I find the BPM Calculator to be a rather terrible way to try and calculate the beat for your own songs. This is because it only calculates BPM change at the beginning, middle, and end of the song, so if you find a song that changes BPM frequently, you may have trouble playing it; or, in my case, any song because you are slightly rhythmically challenged. Overall, though, I would recommend this game as I enjoyed the soundtrack, the story, and the gameplay, finding only the BPM Calculator to be a major flaw slightly due to design, mostly due to user failure.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ing love this",
            "review_score": "1"
        },
        {
            "review_text": "I am not really into rhythm games but this one got my eyes on it for the gameplay change. But well, in the end its just another button smasher music game, not the best but enjoyable. I recommend it if you are new to rhythm game or looking for something fresh to play.  +Include some flashy martial art moves which is also the selling point of this game. +The graphic and art style look great. +Customable track which is really nice and offer replaybility. +Has story. +9euro is somewhat reasonable. +Trading card available and has 7 cards.  The only point that bugging me is: -The game keeps crashing on me, i couldnt finish a song without crash at least once. -Getting repetitive as you play like other rhythm games. -Lack multiplayers",
            "review_score": "1"
        },
        {
            "review_text": "Love this game a lot. Mixing music with martial arts is very fun. The only thing I didn’t like much is that Mei story has the same stages and song than Lee. Wish they could have done something different. Still…great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has quickly become one of my favourite games, easy to learn and enjoy, can be a tad tricky but that comes with what a should do is to pose a challenge, and it does just that, and the integration of your own music just adds to that enjoyment I must say.",
            "review_score": "1"
        },
        {
            "review_text": "YES,, This game has a Electronic Super Joy Song.. THAT MEANS INSTASOLD!!!!!!!! GOGOOGOGOGOG",
            "review_score": "1"
        },
        {
            "review_text": "If you're in to rhythm games then you owe it to yourself to play this game! KickBeat brings a modern interface to the genre and the energetic style of the music, arenas and humourous storyline make you want to keep on playing.  Anyone feeling burned out on all the 'same old' rhythm games of the past will enjoy this game! A breath of fresh air!",
            "review_score": "1"
        },
        {
            "review_text": "plss make a KickBeat 2 i love this game *-*",
            "review_score": "1"
        },
        {
            "review_text": "At first sight, there's nothing really wrong with this game. The problem lies in the system. It relies upon archaic music gameplay style- it's basicly DDR with punching instead of arrows. While this isn't a bad game, the custom music mechanic frequently falls short, and is underwhelming. You have to play through a first few levels, which is rather annoying if you're not interested in the music that comes with the game. Once you do unlock music customization, the navigation to select songs is clumsy and poorly responsive to mouse input, making scrolling through large libraries or browsing a full drive difficult. The mapping system is limited by player attentiveness; you are expected to either know the BPM of the track, or be capable of timing your own inputs to the beats of the music. It's simply an underwhelming mechanic that is not atoned for by the rest of the game. There are solid principles underlying the game, but questionable stylistic and gameplay decisions limit the effectiveness of the game. It clings to console mechanics, even on a PC version, and is uncomfortable and awkward. The camera also skews slightly, making it at times difficult to follow where enemies are coming from.  All in all, it's not a bad game, but if you expect anything unique or interesting, you might want to look somewhere else. As for enjoying your own music, or a specific genre of music, you'll have to tolerate the ecclectic music selection of the campaign for a bit first. It's alright, but so much potential was wasted here.",
            "review_score": "-1"
        },
        {
            "review_text": "Want to listen to some S#($ty music? Here you go. One would think that a rhythm game would seek to please a wide audience. One would be wrong. Unless you are under 25 and/or have some pretty terrible taste in music, you are going to find this a wasted experiment in gaming. The first two tracks pretty much sum it up. Imagine Pantera playing Run DMC playing Aerosmith. Imagine heavy, repetitive guitar riffs, mixed with uninspired, throaty singing. Imagine music without any heart or soul, an amalgam of bad taste as it were. Now thank me, and save yourself a few bucks. It does has some pretty fluid graphics though. Without sound: 9/10. With sound 0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "It's remarkable that this game manages to screw up a simple 'press this button when we say' concept with an interface that's practically unreadable. A simpler GH-style scroll would be fantastic, but the circular scroll presented is awful.  The timing is off, too. Not by much, but enough to be noticeable.   All in all, bitterly disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "this game was fun. it is rhythm action and has many varied songs. it wont be your favourite game ever but its ok",
            "review_score": "1"
        },
        {
            "review_text": "This is a very unique music game with somewhat of a fighting game edge. Unfortunately due to my biased taste in music, I found the game to be more teidious than I would have hoped. I can play the game to my own personal stash of music, but I would have to wade through two thirds of the game to unlock that feature.   What makes most musical games special is that they have their own original soundtracks; something new and fun to experience. This game borrows from a library of record labels from several genres to try to please people of different tastes. But the fact that I am forced to play through songs I actualy have a distaste for in order to play songs I would like to play is the one thing that really prevented me from enjoying this game.  The story that goes with this game I found to be somewhat amusing and gave proper meaning and motivation to play the game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I wish I had something good to say about this game. I saw that they had pendulum and it sounded like it was worth my time. But it DOES NOT let you use the songs outside of the game.  As far as the game goes, it's mind-numbingly boring. You press either a b x or y when bad guys are above, below, or right next to you. You press the key that pops-up obviously and it's nothing more than a guitar hero clone with punching moves. I also think that the soundtrack is really not that great. I wanted to use the 'use your music' feature but that feature leaves a lot to be desired. IMHO this game really just has good graphics and is not worth any amount of money. Shame, the premise sounds fun but the fact is is that its just a DDR clone at its best and a waste of time at it's worst.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the perfect excuse to play a dancing game with a controller. The track list is a little short, but it matches the price.",
            "review_score": "1"
        },
        {
            "review_text": "mmmmmmmmnope It's a DDR clone that tries to look like it's not a DDR clone, and in the process makes everything 10x more confusing than it needs to be. Also, the rhythm is off, making you lose points for being right",
            "review_score": "-1"
        },
        {
            "review_text": "The Dark Souls of Rhythm games.",
            "review_score": "1"
        },
        {
            "review_text": "A rhythm game? Where the ♥♥♥♥ is the rhythm? Total bullcrap. This is the one of the worst concepts I've ever seen. Not even the non-custom songs are not synced with enemies very well, the enemies often obstruct button prompts and it just gets really distracting really fast. Just nope.",
            "review_score": "-1"
        },
        {
            "review_text": "We beat Arabs in a Turkish bath in Istanbul.  10/10 It's good not beating yout own people.",
            "review_score": "1"
        },
        {
            "review_text": "Does this game work everyone cause i tried to play but i get to the opening scenes perfectly but when im in the stadium it lags like crazy at one point it gets stuck?",
            "review_score": "1"
        },
        {
            "review_text": "Music taste will always be a factor in any rhythm based game, and this particular one fails to have much of a range. Almost the entire playlist is nerd-rock, some guy with personal issues screaming into a mic as if he is trying to dislodge something from his throat - which is fine if you like that sort of thing I suppose.   If you don't like it however then don't be suckered in by the thought that you might be able to play with your own music. You *CAN* do it, but it requires you to mark your own beats manually rather than having software do it for you and do you really want to spend half an hour just to play a rythm game for ONE song? Furthermore you actually have to play through the story missions in order to unlock the mode for using your own music too, so no hope there either.  The cutscenes found an aesthetic somewhere but marred it with poorly arranged cinematics, and on top of that I found the humour lacking - probably because the voice actors sounded so utterly bored out of their skulls in dialogue.  Oh, and if you were hoping for actual rhythm in a rhythm game then you may be disappointed too, for four or five times on average during a song you will be thrown off your pacing because of a pre-animated takedown occuring (of which there are only about eight varieties).  If you like rhythm games on steam then stick to Symphony or Audiosurf. I loved Castlestorm but this game feels like a flop to me. :(",
            "review_score": "-1"
        },
        {
            "review_text": "I'm blown away by how good this game is. Was interested in it for a while, and I believe I eventually got it in a bundle. The baked in tracks are very good and have an awesome energy. Using your own tracks works pretty well thanks to the BPM calculator. They won't be quite as precise, but probably better than most games that let you use your own music end up.  And by far, the graphics are the best for any game in this genre on Steam. I highly recommend an Xbox 360 controller for this one, otherwise you might be a bit frustrated with the controls.",
            "review_score": "1"
        },
        {
            "review_text": "KickBeat is a title I've had a lot of fun with so far. Great rhythm game, never have any problems following the rhythm of the songs I'm playing. Great animation and textures on everything, making for a very pretty game. The only thing I'd caution is that the camera is very disorienting at times. It was most noticeable, for me, on the first level of the tokyo rooftop section. The camera zooms in and out in time with the music for effect, but it makes it very difficult to keep track of where your enemies are, which was annoying as hell for me. When the camera is zoomed out, it becomes significantly harder to differentiate things, which becomes an exponentially larger problem depending on the speed of the track.  9/10 Good game  (Sidenote, if you're avidly against loud metal/hard rock music, don't buy this title. Most of the tracks that aren't from the ESJ soundtrack are among those genres.)",
            "review_score": "1"
        },
        {
            "review_text": "I really like the concept of this game but the response times ar a bit slow and they should fix some things until then i dont recomend this game",
            "review_score": "-1"
        },
        {
            "review_text": "If you like DDR or rhythm games, you'll like this game!!! Its fun, addictive, and sometime challenging. Although the song list is rather short, you can add in your own music (this feature does require that you know the beat of the song well enough to configure the level, but is quite rewarding if you configure the beat just right)...However the camera angles could use a little work, but if can get past that, then i'm sure you'll defintely find this game fun.",
            "review_score": "1"
        },
        {
            "review_text": "Could have worked, but just didn't. First off, they missed the major opportunity that they could have had, and further, they made a game rhythm game with no stable rhythm. As it's been said before, the rhythm it follows varies, and it just makes a confusing game. Furthermore, the way they try to move the camera just doesn't work for the format. So much is going on, and it's not always easy to really watch which button you need to push.  Also, I only got to the first boss before I got tired of it, but what a disappointment. They had such a good opportunity with that boss that they squandered. You sit on top of a statue playing the same game against minions and tapping the “use power” button until it comes available. I cannot recommend. This is just not a good rhythm game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible. Under no circumstances should you buy it. The music doesn't match the sound at all, and the lag adjustment doesn't even begin to compensate. There is far too much to keep track of on screen at once, and it doesn't feel good to play, on controller or keyboard.  Normally I like Rhythm games, but this just blows.  Do not waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game but more i played it the more I disliked it. I just can't seem to enjoy it The challenge is an annoying version of a challenge to me lol. Guess I'm just to old for this game. When i find a game that seems stupid and pointless I know I'm not playing the right game. 3/10 from me give it a 3 cause I'm a nice guy.....",
            "review_score": "-1"
        },
        {
            "review_text": "KickBeat offers players several innovative ways to interact with music. The game combines beat-matching mechanics with an acrobatic style of martial arts, turning every song into a raucous battle. The game also features a music analyzer that allows players to create new tracks from their own music libraries.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of rhythm games, and while I feel Kickbeat is a little lacking, I still enjoyed it very much.  PROS:  - If you're into industrial rock, rap rock, and nu metal, you'll enjoy the soundtrack. I personally felt like a clone of myself chose the music.  - It's fairly pleasing visually.  - As far as rhythm games go, it's not overwhelmingly difficult nor is it incredibly easy. (Though you're someone who has played 'Through The Fire &amp; Flames' on every rhythm game out there, you probably will find it easy.)  CONS:  - I'm sorry, but the custom track system is just bad. You will never get the same, perfectly fluid experience playing your own songs as you do playing one of the included songs.  - Only 24 tracks.  - For a game with this theme and premise, there's just a lack of features. It's a kung fu rhythm game. You could've added some gimmicky modes for fun.",
            "review_score": "1"
        },
        {
            "review_text": "You start off playing like 'Oh yeah I a rythm game that I can use my own music in' then you start playing and it chrashes and you say 'S#it! Oh well this is the first time its running so its ok'. Then you get into the beat of the music and it lags so bad, the camera angle spasses out and you say 'S#it s#it s#it! I hope that dosn't happen often' (It does) And then it crashes.  0.5 / 10 Stars Bad",
            "review_score": "-1"
        },
        {
            "review_text": "This game is nice and built-in soundtrack is good, but adding your own songs is buggy, there are problems with BPM detection, and enemies come in not in rhythm.",
            "review_score": "1"
        },
        {
            "review_text": "I've only gone through the first couple of songs, but I have to say that so far I am thoroughly enjoying this game. When I was younger, (currently 16,) I hated rhythm games like Guitar Hero and the like. However, this has a nice soundtrack of more modern rap-esque music with some nice guitars. I love this game due to it's asthetic, in spite of not being a fan of Kung-Fu action flicks.  What really makes this game amazing is the desire to play well that in instills in you. I can't describe exactly why, but seeing two stars on my first attempt didn't leave me angry at my failure, a reaction other games have inflicted on me. Instead, I felt the urge to try again, just one more star because I know I can do it.  Another attempt, a crack at another song and a breif return netted me five stars, a feeling of joy that I haven't felt in a long time and certainly didn't expect from one of my most hated genres.  As mentioned before, I only played for all of 20 minutes before typing this. But it was all I needed to know to tell that the soundtrack and asthetic have hooked me in to something I was supposed to hate.  If you like the screenshots and the gameplay trailer, go buy it.",
            "review_score": "1"
        },
        {
            "review_text": "More difficult than it seems at first. I am a big fan of beat games, and I'm usually pretty decent at them, but this one is probably going to take some getting used to. First off, the main characters just look awful. Generic distorted anatomy bruce lee with hair gel and female counterpart. If I'm going to be playing to badass music, I don't want to look like a 14 year at an anime convention. I know it's possible to unlock a few outfits and whatnot, but I don't think the gameplay is going to keep me interested long enough to do so. Only real graphics options are resolution and anti-aliasing level. It lags like crazy on startup and whenever I get a steam achievement, even at no anti-aliasing, causing the game to slow down and then speed up, sending 20 seconds worth of enemies at me in a second. This is the biggest problem I have with kickbeat, for some reason whatever they have going on with achievements isn't optimized to work smoothly during gameplay, and should probably have notifications after the round is over, instead of during. I've never had that problem with any other game.   Gameplaywise, when you wait for an enemy to step into his circle of attack, it seems like it waits until very slightly after the beat to be counted as perfect, as he takes that extra step, even though you feel like it's the perfect timing to hit, according to the music. Because of the way the circles appear it's very easy to get overwhelmed, because the circular gang of enemies rotate constantly, and the only indication of the next enemies is a thin white shading around the next guy. I think I'm going to keep trying at it a bit just to unlock the visualizer and to be able to play my own music (the biggest draw I had to this).  EDIT: Gave this game another couple of chances. The timing of enemies is totally not in synch with the music, enemies just seem to spiral in at random times occasionally to throw off the rythm of the ones that are actually on time (not even on down beats, as they say in the tutorial). Glad I got this on humble bundle. Don't pay full price for this.",
            "review_score": "-1"
        },
        {
            "review_text": "Even though i have only played for about two (2) to three (3) hours of KickBeat, and never played it on the PS3 or the Vita versions, i enjoy it. However, I wouldn't reccomend buying it for $9.99 USD. I would reccomend buying for about half that.   The story to the game [so far I have only played about half the game] is actually a bit funny. Hell, I was surprised to hear one voice actor playing as one of the man characters.   THe music in this is...not exactly of my taste. And another suprise that one of my favorite NG Artist [at least I think its the same person] has four (4) or five (5) [can't remember] on this game. And that isn't counting the Steam tracks I haven't got to yet.   The one edition that I actually have only a problem with is Beat Your Music.... There are three (3) games on my steam list: Audiosurf, Beat Hazard [ultra], and Symphony. Mind you they have actually a inner program within the system that arealdy measures by the music. Why couldn't KickBeat do the same?   Other than that, I give this game 4 out of 5 stars. The game is good, it isn't the best music/rhythm game I have played but I have enjoyed it. IF you are into this kind of game I would give it a try [and if they had a demo I would play that first]",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Amazing! Soundtrack is perfect and the gameplay is alot of fun. It's got a pretty big learning curve as with most rythm games. But mastering it is very satisfying. The custom song creator works but I had limited success with it. The songs end up being not that complicated. However there is a ton of replay value in the highest difficulty on the campaign due to the fact that the beat maps are totally random at that point.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this game so far. When I was a kid, I really enjoyed the game Bust-a-Groove and, in some respects, this game brought that back. It's not the same, not by a long shot, but it's an interesting take on the Rhythm genre. It's missing some bits, has a fairly short playlist and the ability to put your own track into the game leaves a lot to be desired, but for the asking price, it's well worth the purchase!",
            "review_score": "1"
        },
        {
            "review_text": "I really reccomend this game to all those people who love DDR and other rythm games. Zen studious really thought of something to show a different rythm game by mixing kung fu animations in it. This really stood out from other rythm games on pc. However the sad part is tha tthe animations are all the same for the characters. If Zen studious can create different animations for each character that is playable in the game, then the game will be more non-repetitive. If this point is added to the game, then KickBeat is defenitely going to attract more people.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Even if you don't like the songs in story mode, you can add your own in and make levels for them. Super easy to do too. Kept me entertained for quite a bit!!",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't make it past the first level :( Looks like it would be a fun casual game, but it's insanely hard. It's basically a game of memorizing a QTE sequence.",
            "review_score": "-1"
        },
        {
            "review_text": "I play DDR, and while I'm not a big fan of rhythm games on PC (with the exception of Sequence), this one has a pretty cool twist to it.   But it's hard. It's a little forgiving, but not much, and you can't really tell how badly you're doing and when the game is about to be over. There's a lot to keep track of. Most of the music tracks don't seem that straightforward for when you have to hit the button. The lighting is nightclub style, but the game gives you some help - once you realise it. The most obivous is that the enemy walks over a big coloured Y/X/B/A symbol, but it's up to you to get the timing right. Not as easy as you think. It gets a little easier when you realise enemies have a white outline around them when they're about to strike.  But between the nightclub lighting, the buttons not being where you expect, the white outlines being in different areas, some of the music not having clear spots to keep in time - you need a lot of focus to play the game.  There's a story to the game as well, but it's not fantastic and I didn't care to pay attention to it. Better story and shorter songs might have kept my attention better, I dunno. It's the kind of the game I'd play once in a while because it's a niche concept. Get it on sale, but only if you're really curious (like I was).",
            "review_score": "-1"
        },
        {
            "review_text": "this game is the best game that i ever played about music its awsome musics are 10/10 gameplay is awsome too i love this game i commend this game for people who loves music ",
            "review_score": "1"
        },
        {
            "review_text": "A simple, short rhythm game, which can sometimes evoke the same feelings of synchronicity with the music, like when you're jamming out on Guitar Hero.   Some of the songs however don't really work and are quite repetitive and uninteresting. Due to the limited number of songs it's not going to have much replayability.  Having said that I did get some enjoyment out of it. If you get it cheap enough give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "It's been a while since I played a boring game like this, there are a lot better rhythm games out there even free (osu! just for example).   The idea could have been nice but it was bad developed",
            "review_score": "-1"
        },
        {
            "review_text": "The notes doesn't feel quite right, they don't really match up with the music. It's like they couldn't decide on which beats to put the notes and therefore sprinkled them a bit here and there making the controls feel rather loose.",
            "review_score": "-1"
        }
    ]
}