{
    "app_id": 25600,
    "name": "Eschalon: Book I",
    "release_date": "2009-02-10",
    "developer": [
        "Basilisk Games"
    ],
    "publisher": [
        "Basilisk Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Isometric"
    ],
    "achievements": 0,
    "positive_ratings": 167,
    "negative_ratings": 25,
    "price": 0.0,
    "description": "Eschalon: Book I is an old-school role-playing game that will take you across massive outdoor environments and deep into dozens of sprawling dungeons as you seek to uncover the mystery of who you are. It features a tile-built, turn-based game world where the result of absolutely every action is rolled, calculated or statistically...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/25600/header.jpg?t=1489769517",
    "minimum_requirements": "OS: Windows 2000, XP, Vista                     Processor: 1.8ghz or better                     Memory: 512MB                     Graphics: 3D Accelerated (DirectX 7.0  or OpenGL compliant)                     DirectX®: 7.0 or greater                     Hard Drive: 200MB                     Sound: Yes",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Finishing this game took me 34 hours. Was that good time? Definitely yes, I spent a great time with that. But that doesn't mean that every player will like it as I do. First of all, you must be real RPG fan, and what is most important, you must be old-school gamer. Because this game is true old-school RPG with very poor animations and weak graphics (as for today). But if you're ok with that, you will like it. It has good story, turn based combat and high difficulty level.  VERDICT: If you're old-school RPG fan, this is what you need. If you're modern RPG fan but you want to try something classic, this is good choice. If you're not a fan either of RPG and old-school, you shouldn't even read this, that might harm you.  Like this review? Consider to join  Good Games Giveaways &amp; Reviews  group and maybe press big sexy 'Follow this curator' button on our  curation page  to read more reviews and win free games.",
            "review_score": "1"
        },
        {
            "review_text": "TO BUY OR NOT TO BUY: Eschalon: Book 1 by JunkStar  PROS: ✭Old-school isometric GUI ✭Utilizes an effective variant of turn-based strategy ✭12-15 hour playthrough feels signifcant, but not overwhelming ✭Great character customization and strategies  CONS: ✭Steep learning curve ✭More linear than you might expect from an open world game ✭Small gameworld compared to others of the genre ✭Slow walking animation ✭Superflous gold/items beyond 10 hours of gameplay ✭Surprisingly uninteresting story  FINAL DECISION: You will get you money's worth even at the full price of $6 if you are into classic, isometric RPG games like Ultima. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "If you like old school single character RPGs than Eschalon is exactly what you're looking for. It's 2-D slightly skewed perspective is reminiscent of the later Ultima games, while the character development is more on par with a Baldur's Gate game, allowing you to choose which skills and spells to improve as you level. The story is simple but effective, and you consistantly feel there is a purpose to your actions, propeling you on to the next area or quest. It's simple old school fun in an RPG, and it works. Eschalon Books I and II provide hours of entertaining gameplay and are recommended for anyone looking for that early 90's feel from an RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a solid isometric game, but I just can't get past the fact that the window is tiny.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good RPG game. If you like the old fallouts and medieval fantastic universe, you should love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great classic RPG game, took me a bit longer to finish than others, however I enjoyed exploring around. Really looking forward to playing Book 2",
            "review_score": "1"
        },
        {
            "review_text": "Super fun little game. If you like oldschool RPG's this is worth checking out!!",
            "review_score": "1"
        },
        {
            "review_text": "Old shcool RPG, if you are tired of action RPG this is what you exactly need.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing Eschalon for the good part of an year. It's one of those 'actual' CRPGs where mechanics actually did require you to think and invest time in proper attributes and playstyles, not expecting any handholding like kids get in teen/console rpgs these days. Now, I just finished the main story and felt the same as when I put a good book down after reading its last word. Loved the music, the engine and exploration, above all. I still don't have Book II, but sure as hell it's on my wishlist now. This game comes from before the current golden age of CRPGs and was one of the few that brought me back hope to the niche market of classic-styled, thought-out, pen-n-paper inspired role playing games, along with the Spiderweb Games and Knights of the Chalice.  Estive jogando Eschalon por quase um ano. É um daqueles CRPGs 'reais' onde a mecânica e regras realmente te forçam a pensar e investir tempo em atributos adequados e no seu estilo de jogo, sem segurar sua mão como a criançada espera dos RPGs de adolescentes / consoles de hoje. Agora, acabei de terminar a história principal e foi uma sensação semelhante à de por de lado um bom livro depois de ler a sua última palavra. Adorei a música, a engine e acima de tudo, a exploração. Eu ainda não tenho o Book II, mas com certeza está na minha lista agora. Este jogo vem de antes da atual 'era de ouro' dos CRPGs e foi um dos poucos que me trouxe de volta a esperança para o jogos mais regrados no estilo RPG de mesa clássico , juntamente com os jogos da Spiderweb e o Knights of the Chalice.",
            "review_score": "1"
        }
    ]
}