{
    "app_id": 256030,
    "name": "Shadows: Heretic Kingdoms",
    "release_date": "2014-11-20",
    "developer": [
        "Games Farm"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Hack and Slash",
        "Story Rich"
    ],
    "achievements": 18,
    "positive_ratings": 227,
    "negative_ratings": 135,
    "price": 29.99,
    "description": "Shadows is the next chapter in the Heretic Kingdoms saga. Experience an epic adventure with challenging gameplay, a gripping storyline and enchanting graphics. Take on the role of the Devourer, a demon that swallows the souls of the dead and then brings them back into the mortal realm as his puppets...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/256030/header.jpg?t=1548864434",
    "minimum_requirements": "OS: Windows XP/Vista/7/8; 64 bit Processor: x86 processor, 2.5 GHz Memory: 4 GB RAM Graphics: nVidiaGeForce 260GTX or higher DirectX: Version 9.0a Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 7 / Windows 8; 64 bit Processor: x86 processor, 3 GHz +, quad core Memory: 6 GB RAM Graphics: nVidia GeForce 560GTX or higher DirectX: Version 9.0a Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "OK from Scratch.. i had a real Love/hate thing going at the beginning.. it was somewhat confusing and the whole issue between the Devs and the Publisher and the ? regarding Book 2 ... Get to act 2 before you make any hastey reviews as i did. Act 2 the game became really pretty amazing.. you worked out the wrinkles and confusion you get a few more puppets and that changes the entire play value.. if book 2 never comes book 1 alone is well worth the asking price imo.. a very attractive game sound/ graphics/mechanics all i would rate fairly high.. but the true fun comes once you have a selection of puppets to control.. it was a game changer for me.. i sincerely hope book 2 makes it to release it desreves to. for 20 bucks i got a good deal",
            "review_score": "1"
        },
        {
            "review_text": "If you expect this Game to be like Torchlight or Diablo 3, do not buy it.  Combat: It is somehow pretty buggy. You end up pretty often hitting nothing but Air, if you get swarmed by multiple Enemies at once. Also, it seems that quite often you just hang, and then you end up dying, because your Character decided to do nothing.  Running: While that System is nothing you should think its buggy, it is still buggy. Because you find yourself a few Times just getting stuck on Things .. and yes, you can even get stuck into NOTHING. Then you just cant move anymore, no back or forth.  Content: Here comes my biggest complain. The Steam Version of the Game is incomplete. When you finally end up killing the 'End-Boss', you find yourself with a few unfinished Quests that lead into nothing. There are several locked Doors/Gates that you cant open. Missing Boss in the Steam Version. On the other Hand, if you have the Retail Version of this Game, all those Quests are doable, and you can open the Gates/Doors.  Crashes: You experience random and non-random Crashes all over the World. There are several Hotspots in the World, where the Game just crash, and it does this every time you get close to this Point. And the Random Crashes happen also, all the Time. So you can repeat or walk over the Map all over again, just to end up having another Crash.   As of now: Dont buy this Game, at least not on Steam, if you want the Full Experience of the Game.  Additional Information: For Achievement-Hunters - DO NOT BUY. Due to the Fact that the Game is not complete, many Achievements are not unlockable!",
            "review_score": "-1"
        },
        {
            "review_text": "Unfinished game being sold as finished product  This games has potential, although it needs balancing and the crafting system is virtually inexistent. But what makes me say a big 'NO' to the game is the fact that it's unfinished because of an ongoing bankrupcy process and there is no estimate for when and if Book 2 will ever be launched. I feel mislead, because there is no info on Steam about this, the information is lost amid community posts but not clearly stated in the game's page, the game is sold as if it's a finished product. I would like to get my money back. If you want to waste your money on an unfinished game, go for it. A third or less of a complete game seems to be available and the rest hasn't been released, and probably never will, for that matter.",
            "review_score": "-1"
        },
        {
            "review_text": "Just the graphics alone are really awesome. Not to mention the game play is alot of fun with a good amount of customization for your characters. If you are a fan of games like Titan Quest, Diablo, Torchlight, or Grim Dawn, you will really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Update for 2016:  While the game itself has polished gameplay with a very interesting and fun spin on action RPG mechanics, it is a game that is unfinished and full of empty promises not delivered 2 years after official release. Book 2 is still unreleased as of October 2016 and discussion on a remastered version has been going on for over a year, while the developer, has openly shifted to working on a new game with a new publisher.  In terms of this game, I really like the atmosphere, the rich environments and the lore. If they ever end up releasing the remastered version and the long promised (2 years) book 2, I will fully recommend. Right now I wish I could give a neutral, but for now I will leave this at a thumbs up.   The developer managed to get rights to this game back from the publishers over a year ago and said they would make the game supporters, especially those from early access, whole after a ton of promises, we are still waiting.   If you are ok with knowing there is an entire book for this game that was planned and promised, that that is still 'on hold,' while the devs are working on a new game, then go ahead and pick this up on sale. What is there today is an interesting spin on the ARPG genre.   If however, you want a finished product, I recommend waiting to see if the remaster ever gets released.   If they ever end up delivering on the promise I will update this review accordingly.",
            "review_score": "1"
        },
        {
            "review_text": "I think its a good game, I just wanted to write this review coz I think this game has too many negative review.  But it seem like good game good graphic with a modern take on oldschool action rpg.  Maybe I will update this review when I played some more.",
            "review_score": "1"
        },
        {
            "review_text": "Not much to write about the game except that it is pure fun. I really loved the concept of the devourer of souls. Found some minor bugs in the game, but nothing critical.  Definitely recommend that game.",
            "review_score": "1"
        },
        {
            "review_text": "PROS -the game is fairly cheap to buy  -has a combat system where the main character can change into other characters  -the game looks fairly ok but not great  CONS -the game is really cpu intensive so if you have a doule core and your trying to watch a video on the side its not going to happen -the controls are extremely clunky, awkward, and not every fun to play  -the time i takes to switch between characters takes way to long for any meaning full combios to be achieved -the voice acting is really flat, i wish this game just didnt have voice action at all and spent their money else where -the game isnt very polished, if there is dialog going on and you pause the game. the voice will continue to speak all the way through even though the game is pause. -on the edges of some maps the characters will clip through objects and environments. -not enough enemies and the amount of damage you do is very little also the cooldowns dont help with the flow of combat either. over all the combat is very clunky and dull.   CLOSING THOUGHT the games isnt horrible but isnt great either. the just isnt very fun to play. i think its just how they have the damage amount and cooldowns set up. combat is just really long, clunky, dull, and over all not very fun to play. I would say just skip this game you wouldnt be missing anything important.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game so badly but can't recommend anyone buy it.  I loved the look, the UI and the idea of having two worlds to mingle in. Twice the fun, right?   Two worlds, 1 Shadow",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely lack luster story, the mechanics are a little slow. Switching between characters seems like a neat idea, but just becomes tedious and annoying after the first little bit. only played 4 hours so far but i iwll put in a bit more just to see if this goes anywhere. It seems like diablo, but with a more annoying system, which i didnt think was possible.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't say much about the game as I didnt play it for long but a huge aspect of RPGs to me at least is character creation, which this game doesnt have ;~; Looking past that however, even the first zone showed me that combat is frustrating and clunky with health being too difficult to come by and very easy to lose if you arent the warrior. The story overall seems well done but the combat (which is a main part in ARPGs) is unfulfilling and distasteful. Not a game I personally will be keeping.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has a wonderful and interesting story, very good voice acting and the idea of swaping through your diffrent classes in a fight is really compelling, the GAME is at it's absolut worst when it come to GAMEplay. Everything from the basic movement to the strange and unfair difficulty spikes is absolut and utter crap. If this was a animated story I could watch instead of play, man would I like it. But it's a game and as a game it's crap, it's even more frustrating because you want to know what will happen in the future, you want to be the one to do all the things they talk about in the game, but in the end you just get more and more frustrated because the game doesn't seem to want to give you the chance to move forward at a half decent pace. I'm really sad and angry that I can't like this game, because the creators took it upon themselfs to smash every bit of fun and investment in the story you could have built after the first few hours in bits and pieces in the hours to come. It's another game where I can only think, why didn't the ppl creating the game make gameplay the main focus, because if the gameplay gets in the way no good story, voice acting or looks can hold it up enough to make it worthwhile and because all of these points are really good, they seems to have talent.   Something not entirely related to the review: I'm disappointed with the many games that are so good at the beginning but then can't hold up because the creators try to make it extra hard or extra wonky or extra whatever, in an attempt to make their game special while forgetting joy, playing a game should be fun. If the game isn't fun to play, it's not worth the time ppl stick in it to play it. So to all ppl who are making a game or will in the future: Stop wasting our time and money for crap, we as gamers love to fund you if your game is fun to play. ",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game for the 'Fastest uninstall ever' award. Buggy and boring gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Why do I start as level 19, with lots of abilities chosen already?? I want to do my own choices &gt;.&lt;  Oh, and those who don't like riddles might not like this game.",
            "review_score": "-1"
        },
        {
            "review_text": "first of all, i bought this game at its early access period, i thought it is difficult to understand how its upgrade system work, especially for the skill tree. and today i played it for a while, i found that it is not that difficult to play, it depends on how carefully you played it.  graphic is good, music is good, action is ok. i think only reason for others to say the action physical system is not because you can't hear enough hit sound by attacking on enemies... skipping above comments, it has a very eye catching characteristic in this game, that is you can play at least 2 different worlds at same time with at least 2 characters. That makes so different gaming experience.  Try it!",
            "review_score": "1"
        }
    ]
}