{
    "app_id": 257050,
    "name": "Darkout",
    "release_date": "2013-12-04",
    "developer": [
        "Allgraf"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Sandbox",
        "Indie",
        "Crafting"
    ],
    "achievements": 36,
    "positive_ratings": 409,
    "negative_ratings": 388,
    "price": 9.99,
    "description": "Crashed and alone on a world mankind tried to leave behind, Darkout challenges players to survive on Illuna, in harsh, procedurally generated biomes, utilizing the game’s sandbox features to build shelters, craft weapons, and research new technologies.You are not alone.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/257050/header.jpg?t=1490226498",
    "minimum_requirements": "Mínimo: SO: Windows XP SP3 / Vista / Windows 7 Procesador: Intel Pentium Core 2 Duo 1.3 Ghz or Better Memoria: 2 GB de RAM Gráficos: OpenGL Graphics card that can display at least 1024x768 res (Nvidia 8000 series or better) Almacenamiento: 3 GB de espacio disponible Tarjeta de sonido: Any Notas adicionales: Latest OpenGL Drivers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Dev post: Hey sorry we never made multiplayer or even finished the story but we're going to finish the game as paid DLC now...after we finish the next game we make while this one's still unfinished which we hope will make us enough money to pour it back into this game even though now nobody trusts us.   Seriously.  (Not even joking)   The shame of it all, the most infuriating thing, is that it's a great survival 1/2 game, like Terraria but so much better looking and exciting. Absolute shame to see this much potential squandered.",
            "review_score": "-1"
        },
        {
            "review_text": "Written 09/25/2014  Technical Notes: The game has a fairly good core, but is buggy (some bugs are even game stopping, like corrupted saves). In addtion parts of it is extremely grindy and unfun. It literally took me a day or two to find a single core I was looking for, and I needed 8. Additionally, some materials are so rare you will spend days looking for them.  Development Notes: This game is extremely slow on releasing any patches (only one minor bug patch in a year). The community page and forums are mostly dead and the developer rarely releases any notes on what is going on. In fact it took quite some time for them to inform the community that they lost a core member of their team, were dropping multiplayer support. All and all the dev is extremely un-responsive to the community. The dev laid out a 3 stage content plan for the game. Stage 1 is not complete and baised off of the recent development woes I do not think they will be able to get out a stage 2 or 3.  Closing: I cannot recommend this game in its current state because it is rarely updated and the dev has terrible communication skills with their community. I would hold off several years before purchasing to give the dev time refine the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just another set of scum bag thieves that ripped off a bunch of stupid people such as my self for backing this game. Its turds like these that are ruining pc gaming as we know it. I think Steam should stop all this Early Access crap and make it like the good ole days when developers had to actually work to get paid. Now its get paid and I may develop this game. Just depends on how many hookers and crack rocks we go through each week",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a blast.  While the game starts off slow and a bit confusing due to a clunky tutorial, as you delve into it deeper you find an amazing adventure.   Darkout has an excellent atmosphere, and a very creepy feel to it throughout. Not just form the beautiful graphics and art style, but from the story that is told to you through various ways. Between the creepy text data modules you find while exploring, to the audio ones with some very creepy messages, to the beacon that you set up from the start. This game has a very sci-fi thriller theme.  On top of this it has a very detailed crafting system. A system that is backed by a very deep and rewarding reserch tree. You must explore and mine to collect resources that allow you to further your research and give you access to new crafting items and materials. The research trees are quite large and you will be finding new and great technologies for tens of hours while playing. It's not something you just can blow through quickly. There are double digit tiers of research that have dozens of new items, weapons, armors, devices, building material, etc. in every tier. The more you research the more crafting options unlock, as well as higher end research options.   You also have to deal with powering up many of your machines and finding ways to keep your bases powered up. Be it through fuel, or various generators having a good power setup will keep your base fully operational. This is a nice touch for this genre and isn't a micromanaging thing. Once you figure out how to use it and create enough power you will not have to worry about it. You just need to figure out how to wire things properly and make sure you have enough power generators to keep the lights on! IF devices and lights are blinking...you know you need more power sources.   While this game has a fascinating and creepy story it still is part of the whole sandbox genre that Terraria was a part of. You still must build a shelter, gain access to devices and crafting equipment, and can build a massive base if you choose to. The game even has a building mode that you are basically free to build with no distractions , or need to unlock anything. As you research you have things like elevators, jetpacks, an enormous amount of light sources, and tons of furniture to build as much as you like. There really is some amazing tech.  The game uses a darkness mechanic in which enemies can become stronger, or weaker when confronted by light. They thrive in darkness and can spawn from it. Even in your own shelter if you fail to provide enough light! You have dozens of weapons such as melee swords, guns, crossbows, grenades, and many more as well as things that allow you to emit light in some ingenious ways. The armors you can make are beautiful and have some very interesting functions. You can equip accessories as well to give you even more passive abilities as you explore.   You still do a lot of mining for resources of course so the game goes underground to darker caves and not just left and right. You can even go up into the sky once you figure out how to get there. :)  This is a game that just gets better the deeper you go into it. The world seems to slowly change as you get stronger. Gets darker and creepier as you go further and learn interesting stories throughout the main quest. If you are looking for a happy experience with fuzzy animals and sunshine you will not find it here. This is a sandbox game that is set in darkness.   There are a few small bugs early on, but the developers are very active in fixing them and have taken polls aobut what the best ways to implement new control options could be. The game is FULL release even if the store page suggests it is in Stage 1. The wording is a bit off, but the new stages are new features that are going to be added in the coming months for free, including Multiplayer.   I purchased this game when it was in kickstarter as well as Starbound at roughly the same time...back in 2012, and have been eagerly awaiting Starbound much more than I was Darkout. By some strange coincidence, BOTH games were released on Steam on the exact same day. The dilemma of which to play was there from the start, but after playing both I have found myself playing strictly Darkout since the first few days I had with Starbound. Since Starbound is extremely early in Beta, and we have had a character save wipe already, I have not even touched it since maybe a week ago, while I am playing Darkout constantly. The early beta of Starbound has actually been a bit of a positive since it allowed me to dedicate more time to Darkout.   I recommend you check this game out and don't even bother trying to compare it to games like Starbound or Terraria. This game is MUCH darker, and the art style is leaps and bounds above the others.",
            "review_score": "1"
        },
        {
            "review_text": "Another entry in the increasingly crowded sci-fi Terraria-clone genre. Anyone who has played Terraria will know more or less what to expect in this game. Procedurally-generated world, exploration, resource collection, crafting, etc. A lot of basic Terraria concepts and mechanics still apply. In particular, digging a 'hellevator' (a mine shaft straight down to the magma-filled lowest levels of the world, with water at the bottom to break your fall) is just as useful in this game.  The things that are notable with this particular game:   Hi-fi graphics that capture much more detail than the pixelart graphics used in most Terraria-clones.   Lightness / darkness mechanism. The darker your surroundings are, the more likely that things-that-go-bump-in-the-night are to spawn around you, and the stronger these dark monsters are. Bathing these monsters in light will weaken them noticeably, Alan Wake style.   Loads of high-tech futuristic devices and set pieces to build your base with. Power circuits and switches to turn lights and devices on and off.   Multitudes of light-producing gizmos in various styles and colors to craft and decorate your base with.   My main criticisms of the game are a poorly-conceived main storyline progression system that requires random item drops, and a lack of minibosses to fight for loot drops. The game also seems to still be a work in progress despite not being in Early Access, so occasional bugs still crop up, the more common of these being inventory items dropping to the ground when you try to drag them onto the hotbar.",
            "review_score": "1"
        },
        {
            "review_text": "Looking for a 'terraria, starbound, edge of space, signs of life'-like game? You will find a coupple of hours fun in this game.  But sadly development stopped on a kinda buggy and unfinished game. It has so much potential.   Buy only if you love this kind of games and have too much money.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good and I thoughly enjoyed it but the lack of content and the major lack of progress is quite painful since it has so much potential. Games like this are what give early access a bad name. looks very nice and has a good vibe but at the current price you will feel ripped off buying it. it is not a complete game and i doubt it ever will be. im really on the fence if i should give it a positive or negative, and to spite the fact it really doesnt deserve it i will be giving it a positve review since i got it on sale and for the short period i played it really was quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "Used to like this game based on gameplay and expected improvements - now... No more improvements for me means no more playing - not wasting my time with a game that didn't come close to the initial vision and is essentially unfinished.",
            "review_score": "-1"
        },
        {
            "review_text": "I must say that at full price I cant recommend this game. I dont even know if I should recommend it at all. I did enjoy it while it lasted, but today, after throwing a glow stick my game froze and crashed. When i loaded it back up the menu was completely messed up. There is fun to be had in this game, but it does have a lot of game breakers in it. i'm rating it down because I can no longer play it until it is fixed.   edit : Months later the bug still isnt fixed. I just reinstalled the game and the same bug is there. sadly this game isnt worth the time or hastle. it has too many game breaking bugs. take caution with this one",
            "review_score": "-1"
        },
        {
            "review_text": "First things first, this is a beautiful game. It's set on a world of perpetual night, and it manages to make it look amazing with the different zones all looking spectacular.   The combat is pretty frantic, especially when you get into the game and start coming across the different enemy types, all of which have their own little set of abilites and attacks to deal with instead of the far too common 'just give it more HP and make it red' style of enemy progress. It can get a little bit too hectic towards endgame though, with enemy spawns becoming extremely rapid. By that point you can just ignore them though.  Building is fun and fairly satisfying, watching your wooden hovel evolve into a high tech fortress is never going to stop being enjoyable and the tech progression is both big and fairly straightforward too. There's a fair few different 'this looks like a wall from Star Trek' type backgrounds and walls you can build with, but they are all kinda the same so that's a downside for the people who have to build that perfect unique base. You do need to wait for different items to be researched once you have the components, and there are build times too, which some people find annoying. I never had a problem with them, I just queued a few things up and went and did some renovations.  The real problem with this game is that it is not better known. Hopefully there'll be a decent bit of word of mouth going on at some point because this really does deserve a much bigger audience.",
            "review_score": "1"
        },
        {
            "review_text": "this game was incredible in early access it had great potention now its gone to rubbish i hate this game 100% dislike you promised all these contents including multiplayer support you published a dev blog showing us the development of multiplayer you should be ashamed as your only in it for the money everyone get your money back or just don`t buy words can`t express how bad this is sincearly unrealsentinum6",
            "review_score": "-1"
        },
        {
            "review_text": "In my opinion, the best survival/sandbox/crafting game on the market so far. Really adictive, well polished. Nice gob guys!",
            "review_score": "1"
        },
        {
            "review_text": "Darkout isn't listed as 'early access' but the description clearly states that something isn't complete... and it shows. It's clumsy. low-rent, and doesn't do a particularly great job getting you started. The camera follows the mouse, making simple acts of crafting feel like a bad night at the club. You're best off sticking with the proven titles than grabbing Darkout.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems the game was abandoned, a shame. It could have been great.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad but not great 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great game. I'm not into games like Minecraft of typical crafting games, but this one sucked me in. I'm in my second play-through and it's just as good as the first. I think it has something for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more content, preferably bosses and some more weapons can't hurt either but mostly bosses so we can do things at the end game. Otherwise a really nice game. Cool story, quite a few bugs which get fixed asap, new content coming in once in a while...",
            "review_score": "1"
        },
        {
            "review_text": "You'll see alot of bad reviews of this game, you'll also see that many of these bad reviews are from people who have spent many many hours playing Darkout, alot upwards of 100 hours, like myself. The game is jammmed with content, and while the story side of things is glitchy and unfinished, the crafting and research is brilliant. And some of the mechanics are well thought out and considerate. Like the fact you dont need a particular resource in you personal inventory to craft, it only need be stored nearby. So simple yet so brilliant. As for the story, i had played many hours before i relised there was one, and when i tried to follow it, i could only get so far. But it does not impinge on the core game, which is what we want. I hope the Devs get their act together, as this is a greatly missed opportunity. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fully crap. Developers tells one thing and do another. They promise multiplayer and after month abandoned. When i bought this game it worked. And now - doesn't. Don't buy, save your nerves and money",
            "review_score": "-1"
        },
        {
            "review_text": "I've tried to like it, but haven't been successful so far. I've played worse, but I can't recommend it. I just haven't been able to get a sense of momentum.",
            "review_score": "-1"
        },
        {
            "review_text": "I have had a lot of fun with this game, and honestly you will get out of it what you put into it. This game is a georgeous 2.5D minecraft meets metroidvania set on the planet of Pitch Black (the movie). I started playing early on before the game was finished, and I have been afraid to update because I will lose my fort and all my stuff, but this game is fun for those who like proceedural worlds and crafting, but with beautiful next gen graphics.   I did have one bug in Windows 7 if you scale your desktop using Windows, you have to set the scaling back to 100% or the game will be skewed off your screen.",
            "review_score": "1"
        },
        {
            "review_text": "This game clearly riffs on Terraria and Starbound - albeit very loosely. Having played all three games - I find Darkout to be far more enjoyable in its current state than Starbound. The emphasis on the importance of light, the mentally draining darkness, the more robust sci fi elements and the unique UI all combine to make Darkout a game of its own. I recommend giving it a try if you even remotely enjoyed Terraria or Starbound - you will be pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "This is rather a better game compared to its counterpart games. To start with the graphics just blew all the other competitors out of the water with its 3D mesh and rather surprising to see smooth fluid kinetic animation.  Lets hope for more coontent to come, I really like the research tree. It be cool to have a massive library of stuff to craft.",
            "review_score": "1"
        },
        {
            "review_text": "Nope. This game is the perfect example as to why developers should use kickstarter instead of EA to fund there game. The game is essentially abandoned and the rest of the game is being put into DLC so we can pay again.  They activly refused to use kickstarter over and over and then wonder why they've got no funds to finish the game. Early Access is not for funding. Stop using it for this and abusing the system.   But this brings up a question, if they don't have the funds to finish the game, how do they have enough funds to develope the rest of the game into DLC and then charge us for it?  Pros -I actually can't think of one... -Scratch that, it kinda looks good.  Cons -The game has fairly bad options and lags at times. Changing the lighting leaves you with no lighting... -Rather boring but can be slight fun. Very slow progression. -Base game abandoned and is being turned into DLC. -I've spent enough of my time on this game. Hope they make it but I won't support them.",
            "review_score": "-1"
        },
        {
            "review_text": "*EARLY ACCESS REVIEW*  During the early access, it was full of game breaking bugs. That being said, I still clocked up 50+ despite those bugs, what does that tell you? It's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Very similar to Terraria but also very different in a sense where anything with light becomes your friend... Instead of being able to build / craft anything, you first need to research it in stages which keeps the game a lot more balanced unlike Terraria where you can skip all the basic metals and jump straight to the high tier armors and stuff. The game has almost as much content as Terraria already, but most of the content is really different from Terraria, so it actually feels like a different game.  I have no idea why there's so many negative reviews on the game as I highly recommend it. It runs really well on my machine, everything on the screen looks amazing and really high quality. It is a great game that all Terraria fans should own.  And for the record... ignore the Steam Play time cuz I have a lot more hours put into the game than what it says here... at least 50 hours more.",
            "review_score": "1"
        },
        {
            "review_text": "The key bindings are not changeable, controlling the character was a nightermare to me. I stranded in some dark would of another planet, the tutorial hints told me to collect wood by catting trees. So wa walked a bit to a side and fell in some small pond - but no chance to get out even though it was not very deep. So that was my first death. I tried again a few times, but no chance. When I finally got some wood on other side, the tutorial told me to craft some stuff, to male small free field and to build the shelter. While I was still was figuring out how to even move properly and to place the blocks, the first creatures attacked me while I still had no idea how to defend or if I even have a weapon. The tutorial said that if the auto-slot is active, alwas the most adequate tool will be used automatically. there was also a weapon symbol sometimes when I pointed at the creature but my char did not attack it, not even with fists. So I looked into my inventory again and found a pistol. But that didn't work either. I don't know if it required any ammuniton or something. Aftera lot of dieing and respawning I by accident I found that the glow torch works as weapon - if it's active. It gets automatically deactivated whe you place blocks or start digging. After a lot of dying and respawning, running out of wood blocks while still have no proper flat area for shelter, I gave up. Not even the digging and placing of blocks is an easy task. The char mines 3 blocks at a time not the one I selected. He starts swimming when in water which goes not even to his chest, but is then unable to get out of it. Tere are 1000 little things that make it hard to do even simple tasks. And getting attacked while reading tutorial hints in starts area- you gotta be kidding me!",
            "review_score": "-1"
        },
        {
            "review_text": "Go play Starbound",
            "review_score": "-1"
        },
        {
            "review_text": "Holy crap i can't set my screensize cause the original one is oversized so gets out of screen, problem is that it wouldn't let me start in windowed mode in the steam properties, as well i can't set it to windows normally because the apply button is always out of screen, so BADLY DONE, REALLY! Can't play this ♥♥♥♥ whithout the chance of changing setups...",
            "review_score": "-1"
        },
        {
            "review_text": "Crooked devs, again. Bad.",
            "review_score": "-1"
        },
        {
            "review_text": "As far as I can tell this is a scam so my advice is do not go near this product or it's developers.",
            "review_score": "-1"
        },
        {
            "review_text": "Could be a fun game, no clear path or helps though, more frustrating than fun, if your going to play a game like this get Terrieria or something else.",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesn't even start up, or when it does there is no button to click on to actually play it. Whoever thought this was ready to be released to the public should be ashamed.",
            "review_score": "-1"
        },
        {
            "review_text": "Picked this up recently and have put in just over hours into the game.  First off, it's not finished. It's not labeled early access. Stage 1 (as they call this not-in-beta game) is not finished, which means there's bugs, and I have yet to come accrosss anything that resembles a start to the story. Random crash bugs (one that seems related to the auto-save) should be a priority fix but... still waiting on the fix. Instead of talking fixes, they're talking upcoming multiplayer (because, you know, if something it's working you should add more things to it first before fixing it), and they have even had to go so far as to post a stickey about forum behaviour, which doesn't speak well for the community which this multipler is being designed for.  Yeah Darkout looks good, can be fun when it's not crashing, and I may put in a few more hours into it, but when a game is frustrating, unfinished, and buggy and not advertised as such (saying on the Store page you're working on Stage 1 but the beta is finished is not true - this is just the beta for stage 1, and the previous beta was finished), does not make you want to play it often, nor get your friends playing it.  If you want a game like this, go with Starbound. At least they don't try to hide the state of their game with newspeak.",
            "review_score": "-1"
        },
        {
            "review_text": "The movement may feel a little clunky compared to some similar games, but it is a beautiful and interesting world with a nice combat gimmick to make things a bit different. Pretty fun to boot. Plus, who doesn't love glowing, floating jellyfish?",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, very atmospheric and has its own vibe",
            "review_score": "1"
        },
        {
            "review_text": "Well the game good and adictive to me. I like it and think the money worth it. More content = more money needed but ofcouse. you pay for the ticket everytime you go amusement park right?",
            "review_score": "1"
        },
        {
            "review_text": "Quite fun game to play, worth the sale price!",
            "review_score": "1"
        },
        {
            "review_text": "As a developer I often see things that are obviously half-done and this, unfortunately, fits the bill. The crafting is AMAZING and the world is absolutely beautiful, but story progression is a combination of tedium and luck with the Random Number Generator. The devs are aware, but unfortnately, it leads to overcompensation and inventory bloat.   The premise of this game is that you are a member of a colony ship, unfrozen and jettisoned onto the world below. No-one above is aware of the catastrophic events that led them to stasis in that ship, and it's on you to find out why. I think. The problems with the story quickly crack open when early quests have you fetch broken parts of a beacon. Pulling these into your inventory doesn't trigger anything; you then have to kill an enemy and get it to drop a log file (which could also be a blueprint or minor side story item). This log will look and sound like it was intended to play when you found the broken beacon piece (which happens to also be a random drop from chests and crates that spawn in the wild).   Once you've done this, the one voice acted character which isn't a computer but *is* interactive (sorta) grows ill in some way and bam, he's out of the story. In fact, your entire beacon apparatus you spent tons of time building is also now just taking up space. Hopefully by now you've been doing more things on your own and developing your base. Enemies grow with your 'Research Level' which is just your level, gained by mining and killing things and inventing.   The story gets harder to follow; the concepts are more abstract and the only indicator as to where to kill something to get it to drop a log or data cube (and yes, this is how all story elements progress) is to catch the one hint in the last log as to where it will be found. While I appreciate making exploration necessary to progress, this is overdone; there are gates you encounter that need 'purification' later which require a lot of searching for some hard to find items (such as big stacks of a certain color of Crystal). Furthermore, if you start 'purifying' a gate you can't work any other gate until that specific one is fixed. When you finally face a boss, it drops a 'leet loot' item but fails to progress the story in any way I can see. All of the logs that are 'above' your spot in the plot line refuse to unlock so you can read them, and I now have 5 metal chests full and am filling a Vault (which holds 100 items).  Some may say ripping on the acting in a game is nitpicky, but there is a limit to everything. It's clear that someone from the sound studio must have quit their job during development; many of the audio clips have the actors rereading the line to deliver it how they want it to sound. This normally doesn't make it past the sound studio; someone just grabbed the files and chucked them in. You'll do a double-take the first time you read the line in the file, but hear the line spoken twice in a row with emphasis on different words. Unfortunately, it does not have the endearing goof-up quality of the early days of TV like when Doctor Who had to be done in one take per scene.   Still, I recommend a buy ON SALE. The gameplay itself is pretty solid, outside of some graphics-lag issues when too many items you can't pick up are on screen (i.e. when inventory is full). You'll get stuck in the story, however; it's essentially an endurance test to see if you will keep playing until you get lucky enough to progress the tale, or if you get bored and stop playing before then. I regret to say, I am probably in the latter, as will most people be.",
            "review_score": "1"
        },
        {
            "review_text": "I cant put this one down!!",
            "review_score": "1"
        },
        {
            "review_text": "Played this game now for 4 hours, nothing works like it should, cannot open the ship i arrived in, to get the items to help me in the new world.",
            "review_score": "-1"
        },
        {
            "review_text": "This is easily my favorite game in the 2d sandbox games. Unlike its peers, Darkout has a story and significant atmosphere, and, for my money, a better visual style. There is a good amount of mine-grinding, but that's inherent in the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a beautiful and immersive game one might say, and the soundtrack, by the gods, the soundtrack is truly amazing, it really sets the mood there. Building as never been this much fun really, but the entire game feels like its still in early development, almost as if it was rushed upon its release, because, although pretty and nice, the game itself its still a bit buggy, but that crafting system though, adorable as a kitten. The trailer and the screenshots really caught my eyes and the game does deliver what it shows, but as my fellow Steam users said, it needs work. Not sure if i should recommend it though, in my opinion its very, very good, but im sure most of the gentleman and kind ladies here may not be of the same opinion. A fun experience nontheless, would love to play with friend.",
            "review_score": "1"
        },
        {
            "review_text": "Got it on a sale and still feel like I got ripped off.  Not worth it, stick to Terraria or Starbound.",
            "review_score": "-1"
        },
        {
            "review_text": "º \\(^o^)/ * This game has become one of my favourites in the mine&amp;craft genre. ",
            "review_score": "1"
        },
        {
            "review_text": "The first thing you notice when firing up the game is how beautiful it looks, the lush vegetation and ethereal atmosphere. This game looks amazing. I love sandbox games and have high hopes for this one. Thus far I like what I see, although I had some frustrations with mobs early in the game continuously killing me every time I respawned, and the gathering mechanic can be fiddly. I hope that the devs can sort it their problems and get the game finished because I believe it could be a winner once completed and polished. Try it, you (probably) won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "When all the stages are complete, I'm sure it will be a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Light/Darkness monster spawning mechanics on steroids.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty good sandbox game like Terraria. Okay polygonal visuals, but neat lighting effects. Big tech tree with lots of tools, decorations, and weapons. The game is not done, necessarily, as it's only in Stage 1 at the time I'm posting this review. Make sure to look over the Steam page to get an accurate portrayal of where the game is at in its lifecycle. Frequent updates, which is nice.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great idea, but no Mac OS support. Windows version has a lot of bugs.  I hope to final version playing. Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "The pros and cons of this game   Cons-Many elements are unfinished  Interface is clunky and glitch   SO MANY GLITCHES   No story or any motivation to carry on playing   No multiplayer   Terraria Wanna-be  SO BORING AND TIRING TO PLAY   Pros- The uninstall button works perfectly",
            "review_score": "-1"
        },
        {
            "review_text": "This has been the most fun I have ever had. I played Terreria and MineCraft, partial more to the latter, and will take THIS over Terreria any day.  Its fun, its crazy, the enemies are awesome, hell the atmospherics are just... wow. Love it. It does slow down though in its current state, but that takes awhile. And when you do get to the latter stages... well. You'll want to manage your resources (store em like, logically, unlike me.... its a freakin' mess!)  I am so hoping for MP to come sooner than I want it too, but regardless. Its one hell of a fun game. Worth the money, and for the promised MP. Anyway, I'm going back to work, and hoping for my lunch break so I can play more.",
            "review_score": "1"
        },
        {
            "review_text": "I've found it disappointing so far - the interface is very difficult to get to grips with and doesn't seem to work very well (selecting actions/items from the action bar doesn't always stick). I gave up my first try in frustration after trying to use building blocks to make a shelter, only to find I dropped my whole stock on the ground instead and then couldn't work out how to pick them up again. I'll probably give it another try, but it hasn't been a good first impression.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow what a mess. This is no way near complete.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has graphics that kinda make it look like a game pre schoolers would play, i COULD get past this if it werent for the bugs that made this unplayable. I glitched through the ground five times, and i tried to jump over some kind of acid pit and died from nothing. the controls, suck, from what i remember, the default controls (For me) wasn't WASD, it was ESDF. There were the kinda messed up hotbars, where i had to press an odd combination of keys to get to the bottom row, and it didnt carry over to the next slot, so, say i was on the bottom slot, if i changed slots, i would be on the top slot. There were many items to get at first, many had no descriptions at the time, and were very hard to tell what does what. Though you may not believe me due to my time on the game. But in my opinion, its not. I also noticed something, you 'Fight shadow enemies sensitive to light'... IS THIS ♥♥♥♥ING ALLAN WAKE? NO. IT ISNT.  This game tried to be original with its enemies, but instead it kinda turned into a 2d space sandbox allan wake... That was a terrible analogy. BUt i mean. Okay, so, in allan wake there are these dark enemies, if you shine light on them the darkness stops protecting them allowing you to dammage them, see, THIS is a GOOD design choice, this game, just is like 'Hey! Lets make 'Shadow Enemies', which are basically skyrim vampires! Where, ya know, because they are shadows the become weaker in light!' This seems to be a thing in games focused around enemies infected with darkness or shadows or something, I mean, Look at 'The Darkness', Instead of the enemies effected by light, YOU are, and light is actually a BAD thing that you will suddenly HATE! If this is how the enemies worked, where you LIKED the light because the enemies become freaking... Black tin cans, but instead they are like 'Hey, the enemies can be dammaged in dark AND light, but light makes them have less health' What about, you cant harm the enemies, or they regenerate health at a rapid pace unless they are in light, if they are in light for along time, they can be damaged outSIDE of light (Why did i put emphasis on SIDE?). I have a very hasy memory of this game, and i dont feel like getting 3 gigabytes of space used up on my hard drive so i can confirm my claims to be Extremely Accurate, but if i remember correctly, the shadow enemies are slightly weaker in light.",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely worth a try for fans of this style game.  There are some inconsistencies though:    even though light is supposed to suppress the danger, it rarely did in my case - baddies still walked straight into my fully lit areas    block sizes don't match well with the visuals so you'll find yourself needed to remove extra space to maneuver - prefer block sizes being very clear (like Terraria)   Keep in mind, you have to enjoy spending a lot of time in the dark.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game. Easy to lose a few hours it sucks you in that well.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite part was unistalling it. Don't waste your money on this piece of crap. Go buy starbound or Terraria instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I used to have this nice long review talking about the pluses and minuses of this game. Then, the devs abandoned the project and disappeared completely.  So, what do you get from Darkout as it stands?!  A multi-player game with no multi-player support, a dangling plot line that is only about 1/4 complete, a crafting tree that is not well thought out and a game that gives a promise with no happy ending, actually no ending at all except deleting it and never playing it again.  If those appeal to you, then buy the game. Otherwise there are plenty of new games on the market to spend your time on.  So, for me lesson learned. I got burnt on this game and Starforge. Now I won't buy alpha, beta, early access or any type of pre-release software. I recommend everyone does the same.  Does it look good?! Sure. Can you get some play time out of it?! Sure. That said, other than the typical grind required to tool up, there is about 4 to 5 hours of real content to this game and that is it. Then, you are stuck wanting more, more that will never come.",
            "review_score": "-1"
        }
    ]
}