{
    "app_id": 257120,
    "name": "Not The Robots",
    "release_date": "2013-12-12",
    "developer": [
        "2DArray"
    ],
    "publisher": [
        "tinyBuild"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Stealth",
        "Indie",
        "Strategy"
    ],
    "achievements": 15,
    "positive_ratings": 428,
    "negative_ratings": 108,
    "price": 6.99,
    "description": "You are a robot in an office building. You have to eat furniture and not get caught. A mysterious story unfolds.Not The Robots is this year’s most exciting Roguelike Stealth Furniture Eating Simulator. It’s a game with random levels, permadeath, and the goal of eating furniture - which is also your stealth cover.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/257120/header.jpg?t=1447358895",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Processor: 1.5Ghz Memory: 1 GB RAM Graphics: Graphics card from 2004 or later DirectX: Version 7.0 Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've only just started with this fabulous little gem, but already completely hooked. So without giving too much away (since the game developer clearly loves his secrets!), this is basically a tight stealth game, where you are zipping around randomly generated levels picking up 'loot' as you go.   The brilliant, brilliant twist is this: that loot is your cover, the only thing keeping you hidden from lasers, levitating skulls of death, and - as the levelling system has assured me - 'nastier things'. So that's twist #1. You have to pick up your 'loot' (AKA 'food', AKA 'furniture) very carefully, since any cover you yank is cover permanently deleted. Yikes! Yet to leave the level you will have to grab a certain amount of it.  Then it starts getting crazier. For one thing, new objectives get added. NOW you have to go through a series of ordered points, scattered randomly through the level. NOW you have to 'tag' every enemy on the map by getting close and using an item - scary stuff. Mysterious laptops provide a gateway to the game's cryptic story of business skullduggery and a strong feeling of conspiracy.  And, like my favorite kind of rogue-like (sometimes called rogue-lite, I believe), the game changes each time you play. But maybe it should be called rogue-heavy in this case, because the game doesn't get easier (through 'upgrades') so much as harder (new elements, new ENEMIES). Of course, you also get to unlock special challenges (pre-designed maps with tailored problems to solve) and special runs. Some of these provide more 'XP' to continue advancing; some are just for the glory.  All of this is to say that Not The Robots is a fantastic, fun, panicky stealth game, pure and simple. There are no weapons (at least, so far), there is limited cover, and there are plenty of lasers and drones to end your run with a foolhardy step. I'm a glutton for this kind of finely-crafted punishment...are you? ;)",
            "review_score": "1"
        },
        {
            "review_text": "You are a robot moving floor to floor, building to building, eating as much furniture as you can without getting destroyed by lasers, forcefields, sentries that look like skulls, and more using upgrades and powerups, such as teleportation, invisibility, etc., obtained along your adventure through the many buildings and enemies you will encounter. Only people who belong in an insane asylum would not want this game.",
            "review_score": "1"
        },
        {
            "review_text": "Not The Robots is like Katamari with tactics. There are enemies you have to take into consideration so you can't just rush off and eat everything you see. Other than that there are power-ups like invisibility which you'll desperately need in order to advance. The game plays like a roguelike so if you die it's game over. You will level up eventually allowing you to store more items and things like that. All in all Not The Robots is decent. It isn't my favorite game by a longshot and it will never appear in any of my top 10 lists, but it's kinda fun for short sessions.  [Rating: 68/100]",
            "review_score": "1"
        },
        {
            "review_text": "You ever seen that show My Strange Obsession? Where normal everyday humans eat hair, toilet paper, diapers and other odd things? This game is kinda like that but instead you are a robot who enjoys eating office furniture. Instead of pesky psychologists ruining your guilty pleasure, you have sentry robots trying to destroy you. Tough love is tough.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy good! It's got a simple dynamic to learn, but some really difficult challenges as you progress. The difficulty seems to ramp up perfectly with your skill. It's got a great sense of humor about it, and an overall very slick fit &amp; finish. I've played it on both OS X and Win7 so far, and both perform equally well (thank you!) I'm completely in love with this game already, and it just keeps getting better. HIGHLY recommended!",
            "review_score": "1"
        },
        {
            "review_text": "A robot that eats furniture..what's not to like!?",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious. But the sentries are bloody scary.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It has randomly generated levels, different game modes, added obstacles, and side objectives, you get a great game with a lot of re-playability. It looks very nice, has smooth game controls, and has a simple game style, but manages to keep you on edge. There is also the satisfaction of the destroying furniture, lol. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Simple, and that is the beauty. I could lose (and have already lost) substantial time playing this. The premise is simple - eat all the furniture in the office and don't get attacked by the security bots. Minimalist, frustrating, addictive and really good value for money. Don't waste another second. Buy it!!",
            "review_score": "1"
        },
        {
            "review_text": "Play the demo on the website. This game has a tremendously difficult learning curve and an amazingly unique concept. If you can overcome the one, you'll fall in love with the other.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. It's like being a robot ninja.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. It's like being a robot ninja.",
            "review_score": "1"
        },
        {
            "review_text": "Want to be a robot that eats furniture get not the robots",
            "review_score": "1"
        },
        {
            "review_text": "I have somewhat mixed feelings about this game. I really enjoyed it - the idea of eating what keeps you hidden is a very interesting mechanic that added a lot to what would have been a typical stealth game otherwise.  On the other hand, levels like those with the sentries made me very frustrated, especially since the sentries would remain alert for the remainder of the level. This made the difficulty seem unbalanced between sentry levels and levels without.",
            "review_score": "1"
        },
        {
            "review_text": "It's a roguelike stealth furniture eating simulator! What more can i say other than you have to try this game!",
            "review_score": "1"
        },
        {
            "review_text": "If you only buy one furniture eating stealth robot roguelike game this year, make sure it's Not The Robots.",
            "review_score": "1"
        },
        {
            "review_text": "If you like stealth rogue games, then this is for you :) 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A very simple game that manages to be highly entertaining, and surprisingly difficult at times. Part puzzle, part stealth the ga -OH MY GOD SOMEBODY HELP ME A ROBOT IS EATING MY COMPU",
            "review_score": "1"
        },
        {
            "review_text": "robot like to eat furnitures 10/10  too much eat - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Not the Robots added stealth to it's mix of randomized stealth-level chaos. The game is short, but now that saving exists you need not fear having to start over if you've been having a good run but need to leave. Worth it for the odd premise alone. Gameplay:         YouTube™ Video:  Glance: Not the Robots (Now Has Saving)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  Very Interesting But Very Repetitive",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantasically fun little game that has a wonderful direction and puzzle solving element to it that I have not seen for quite a while. I would reccomend it for anyone, weather you are a hard core gamer looking for a lower stress problem solver or a casual gamer looking for a fun challenge.",
            "review_score": "1"
        },
        {
            "review_text": "If you like rogue-like games where you stealthily eat furniture and avoid enemies with random paths while listening to sombre music then this is your game. I personally dislike rogue-likes but I can recommend the game for those who do. The game has an interesting style and is very well made.",
            "review_score": "1"
        },
        {
            "review_text": "It's not one of those sims to play to just pass time. In fact, you won't even notice time pass as you play it. The randomly generated levels, stealth elements, completionist elements, and 'die-once-start-over' styles really makes this game great.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun little game, especilly if you want to just pass the time! The best feture is, as you level up, you dont get stronger, the levels get tougher! So definitely give this game a go! the robot is adorable!",
            "review_score": "1"
        },
        {
            "review_text": "Fun little distraction, but can get very frustrating. Hover sentry robots are unpredictable, making dodging them almost impossible (especially with the random nature of the level generation). Low laser beams are also crazy, considering that unlike with the high lasers (where you can 'crouch'), there is no jump command (or small hover), which would have improved the game. The story segments (found as collectable laptops) are funny and fit the style of this game.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting narrative but the plot is much too vague for my tastes. The gameplay, through, is simply wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "Man, I have always wondered what it would be like to eat my furniture...",
            "review_score": "1"
        },
        {
            "review_text": "Not The Robot wins my vote for most unique premise - a robot that eats furniture. We're talking a skinny robot that eats huge desks, and has the audacity to say it needs more.  In addition to furniture-eating, your robots needs to avoid traps, which may be lasers or other hazards, as well as moving enemies. There is no direct fighting in this game, so there is a large degree of stealth in balancing out which furniture pieces you want to eat now, and which you want to eat later. In addition, the game rewards your furniture gluttony with powerups that may shape the environment, or provide personal buffs. Acquiring buffs requires a sizable amount of furniture to be eaten already, so it goes back to stealth vs. food debate.  The game itself is fairly randomly-generated, and appears to be pretty unique across playthroughs. There's also a sliding difficulty which impacts the spawning of your levels. A level-up system will also impact your level's conditions. Your level is calculated across runs, based on performance, and increases as you do better. In layman's terms: the better you do, the harder it gets.  The game goes on sale quite a bit during major sales, and is definitely worth sale price.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game , it is something a little different , a good quality for its price (and not like most modern overpriced games of gaming industry ) although the high level of randomness makes some imbalances in learning curve. It should be a little more structured , but overall it is very good and a definite purchase for puzzle lovers.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a fun time and can really be gotten into if you like level crawling games, and a a dollar you cant really beat it.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't sure about this one but the developer made a few other games I like which are free to play online so I gave it a shot. I'm not disappointed. Combining stealth with an all-you-can-eat office. Really enjoyed this one",
            "review_score": "1"
        },
        {
            "review_text": "silly little stealth game about eating furniture",
            "review_score": "1"
        },
        {
            "review_text": "I'd reccomend buying this game if it looks fun. I'd reccomend buying it on sale if you think it will be fun.  It can be very frustrating at times, i.e. getting cornered by sentry robots and you can't do anything.  I really love the random generated levels, it keeps the game challenging as you can't simply memorize the patterns.   The sentry bots move randomly, which means, if you want to move, you find a good covered spot, and wait for ideal sentry positions. I don't find this a problem, as planning routes or listening to the story keeps me busy. However, you won't win if you charge through the rooms eating all the furniture.  Some buildings don't have sentriy bots which is a nice change of pace, as the sentry levels can be stressful, and you can lose a lot of health on them. As long as you keep an eye on the lasers it's easy to make it past these levels unscathed.  Hands down, this game is difficult. Since you're forced to destroy cover, levels become progressively harder. If you like a good challenge, try Not The Robots.",
            "review_score": "1"
        },
        {
            "review_text": "On the positive side - Game looks great, controls are good.  NEGATIVE SIDE - The game is only fun for 15 minutes... after that its repeatative and boring. There is a group of people out there who loves the concept of robots devouring furnature will LOVE this game. The other 99% should probably pass.",
            "review_score": "-1"
        },
        {
            "review_text": "the sound track. no. kills the game. also gameplay is uninspired and the whole feel is very much lacking. got cheap on sale but still regret just having it in my library",
            "review_score": "-1"
        },
        {
            "review_text": "I hate to thumbs down this game because it is well made. It has its own thing going and I'm sure this game is on someones favorite top list. I just can't get into it. I like rogue-like games at times and stealth is one of my favorite genres, but this game just does not satisfy me. I got tired of it very quickly, like within the first hour.   I guess the main thing that got me is that I didn't feel like it was a stealthy game. You eat furniture that you're supposed to hide behind. The bots have no specific route which is cool but sucks at the same time, cause there is not much strategy to it IMO with the generated level designs. When I actually try to be stealthy it felt like I was waiting too long and become impatient, I usually don't have that problem with stealth games. Starting over is boring. I didn't like how much the screen shakes when you're being shot at. I didn't feel the suspense. I felt like I had to be extremely patient or run and steal everything as fast as I could which neither were enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and meaningless game, do not recommend it",
            "review_score": "-1"
        },
        {
            "review_text": "No, not really. I mean the graphics are almost OK. The concept is... well, quite all right. But you just don't want to continue after a while. That's pretty it. Meaning: no fun?",
            "review_score": "-1"
        },
        {
            "review_text": "I'd honestly rather Barbeque my own Grandfather than play another minute of this horrible game. The unresponsive utilties combined with ear peircing Fallout Boy in the background just makes for an unenjoyable experience. Like YYYUUUUCKCKKK  Here's 5 reasons I hate this game   It's not The Adventures of Mr. Bobley   It's not Devil's Share   It's not Brilliant Bob   It's not Civic Mirror   It's not The Adventures of Mr. Bobley  ",
            "review_score": "-1"
        }
    ]
}