{
    "app_id": 257510,
    "name": "The Talos Principle",
    "release_date": "2014-12-11",
    "developer": [
        "Croteam"
    ],
    "publisher": [
        "Devolver Digital",
        "Croteam"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "First-Person",
        "Sci-fi"
    ],
    "achievements": 40,
    "positive_ratings": 17237,
    "negative_ratings": 785,
    "price": 29.99,
    "description": "The Talos Principle is a first-person puzzle game in the tradition of philosophical science fiction. Made by Croteam and written by Tom Jubert (FTL, The Swapper) and Jonas Kyratzes (The Sea Will Claim Everything).",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/257510/header.jpg?t=1555495583",
    "minimum_requirements": "OS: Windows 7 Processor: Dual-core 2.0 GHz Memory: 2 GB RAM Graphics: DirectX 11 class GPU with 1GB VRAM (nVidia GeForce 480 GTX, AMD Radeon HD 5870) DirectX: Version 9.0c Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 7 64-bit Processor: Quad-core 3.0 GHz Memory: 4 GB RAM Graphics: AMD Fury or NVIDIA GTX 1070 DirectX: Version 9.0c Storage: 8 GB available space",
    "reviews": [
        {
            "review_text": "HIGHEST RECOMMENDATION!  'The Talos Principle' is one of the most enjoyable and rewarding gaming experiences I've EVER had and I've been playing video games since the Atari 2600 days. There is a reason why 'The Talos Principle' is a hit among critics and the player reviews are 'Overwhelmingly Positve.' For me this is a new classic. A game that catches lightning in a bottle. One of those games that scratches an itch I didn't even know I had.  NOTE: If you think you might get this game, I'd recommend against watching video and looking at player screenshots. They are both highly likely to contain spoilers and inadvertent puzzle hints, both minor and major. I only played the demo going into the full game and I feel the experience was better for it.  This is a first person, sci-fi themed puzzler in which the player, an artificial intelligence, is left to complete puzzles by using a series of tools that are introduced throughout the game. The first tool is the Jammer, a tool that jams electronic devices and force fields. Another tool connects to and aims laser beams. You'll also learn that tools can be used in combination, keeping the progression interesting. Solving a puzzle rewards the player with a sigil (tetromino) which are then used as puzzle pieces to unlock new areas when arranged correctly in puzzle mini-games.  The only conversational contact the player has is with another AI program that often presents itself at computer terminals as the game progresses. The player is also, through communicating at the terminals and reading information displayed on them, left to ponder the role of the disembodied voice known as 'Elohim', as well as the meaning of life, consciousness, being human, being alive, free will, and the afterlife.   The game itself is solid. Easy and tight controls. Very nice music, sound effects, and voicework. Clean, often beautiful graphics. Intelligent writing. No profanity or violence. Menus with many options like FOV, character speeds, FPS display, time display (something I never used as I chose to take my time), etc. This is a quality 'product' every way I see it and a fantastic game from a company that respects it's PC customers.  Many have compared this to the Portal games, which is high praise. While both offer clever puzzles and a high quality experience, 'The Talos Principle' only rarely depends on any sort of physical dexterity or reflexes. With those few puzzles that do require quickly timed movement, even the most casual of players shouldn't have any issues whatsoever.   While the presentation and story are high quality, it's really about the puzzles. What makes them so satisfying? First, puzzles do not need to be finished in an exact order. Leave one alone for a while that you are having trouble with and try again later. I found it interesting how I'd find myself struggling with a puzzle but after a day or two, the solution would become clear. It was almost 'scary' when realizing how hard at work my subconscious was. I would also think about certain puzzles when not playing and come up with new things to try out. I found myself overthinking many times when the solution was much simpler. Also, just when I thought I had a handle on a 'recipe' that certain types of puzzles used, the game would throw me a curveball, forcing me to deviate from previous 'patterns'.   Some puzzles, even of the harder variety, can be figured out quickly depending on the player's frame of mind, while 'easier' puzzles (those without numerous elements) can be trickier. You know the puzzles are good when you find yourself wanting to do 'just one more' before ending a session. And puzzles can often be completed in more than one way. I found out later that some solutions I used were much much more complicated than they needed to be. This dynamic of overthinking vs. underthinking is what helped make my time with 'The Talos Principle' so interesting, as well as thinking out a solution before acting vs. using a lot of trial and error at other times.   This game also encourages and rewards exploration. There are stars to collect, which unlock additional content in the form of more puzzles and ultimately an additional ending choice (there's a main ending and two possible side endings). These stars are often 'puzzles within puzzles' and gathering them is rewarding and can be quite challenging. It's not just a matter of 'hide and seek'. For example, a star may be within a puzzle and behind a door (force field). It is up to the player to figure out how to reconfigure his/her solution so that an additional door can be opened. There is also an ample amount of 'Easter eggs' to find, many of which are interactive and well worth seeking out. Many are references to other games, like Portal 2 or Papers Please. Pink Floyd is honored with one as well.  Keep your eyes wide as you traverse the puzzles and worlds. Even just finding ways to exploit the simulation is fun, for example, finding a way to climb over the outer walls of a puzzle and into 'out of bounds' areas (where there are some Easter eggs to find). Or 'breaking' a puzzle by finding an 'unintended route' to the finish by climbing over a wall, or walking above one. (This accounts for a lot of my game time).  'The Talos Principle' should appeal to a wide variety of players. I spent about 80 hours on my first playthrough and a less thorough playthrough will of course take less time. I then replaid for 100% achievements (which I usually don't do). I suspect that many of the people finishing Talos in '20 hours' are not doing everything (reading files, getting all stars/doing the puzzles they unlock, looking for easter eggs) and likely to be using a walkthrough here and there. You can play this game as you want. Complete the puzzles in order or don't. Do them fast or slow. Solve star puzzles or don't. Don't read every piece of information at the terminals if the story side of the game doesn't interest you. Look closely for Easter eggs or don't worry about them at all. Try out the side endings or don't.   The support is very good with developers active on the Steam forums should anyone have issues and updates have been released to fix and add things (like an added special settings menu for 'motion sickness', a speed time function, additional language support, etc.). This company, Croteam, does it right. You should give them your money just 'based on principle.'  NOTE: The demo is also good, yet only a taste of the full game. It ofters a solid introduction to gameplay and some clever puzzles. There is even another free game called the 'Sigils of Elohim' that is made of tetromino puzzles. Solving them will reward you with codes that are then entered into the menu of 'The Talos Principle' for bonuses. These do not change the core game at all but, for instance, you can get stars with these codes.   All the regular stars will still be in the game to find. If you get the codes for bonus stars (three in total), you will start with three stars in the full game. So, you'll be free to leave three stars unfound if you wish and still receive the bonus content for finding all of them. In other words, if you start with the bonus stars and then go on to find every star in the game, you will finish with an extra three stars.  PS: If you get and finish the game, check out my screenshots if you want (NOT before you play). Some hint at additional 'challenges'. Like getting a picture of the blue man visiting the greedy man and living to tell about it.",
            "review_score": "1"
        },
        {
            "review_text": "JUST PLAY IT NOW!!! (or read below if you're in doubt, ofc)  I don't use the word lightly, but The Talos Principle is TRULY a masterpiece!  This game is definitely among the top 3 I've played in my life. Actually I can't remember any better game from the top of my head right now, so, yeah, that's a lot.  + This game is DEEP, mainly in a philosophical way, and that's where this game really shines (don't get me wrong, the puzzles are awesome). Really, not the usual superficial philosophy you usually get on videogames--real philosophy! You'll spend quite some time reading files and listening to records, discussing theories with a computer terminal, proving your point, being contested etc. + The story is very rich, and obscure, and starts making sense little by little, not having to resort to plot twists, which tend to be a little too cliché. + At least 3 endings that I can think of. + Will keep you entertained for many,many hours (my first playthrough was like 30h, the second was about 5h). + Very nice puzzles (and a lot of them, over 120), and they usually escalate in difficulty very smoothly. But they're all solvable with enough effort. Also, they're probably where you'll spend most of your playtime if you're not checking guides. + Tons of side-quests -- easter eggs, secret stars, hidden levels, which will also keep you busy for a long time. + Music and graphics are pretty impressive, too. + Easily customizable settings and controls for the perfect experience.  WARNING: To fully enjoy the game, you'll have to read a lot. Of course, if you just want to go through the puzzles, you can do that, and ignore all the text files and recordings. But, seriously, don't. =)  I payed about 1/3 of full price, and I have to say it's well worth its full price.",
            "review_score": "1"
        },
        {
            "review_text": "  The Talos Principle",
            "review_score": "1"
        },
        {
            "review_text": "do you like portal? do you wish portal was about 10 times longer and took itself really really seriously? Then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Game 'recipe' so far: --&gt; 'Portal 2 memories are back' --&gt; a lot of great riddles - starting from easy to hardcore --&gt; different kind of riddle types like the linear ones, special ones to get stars and secret bonus ones --&gt; smart and sometimes really difficult but exciting riddles --&gt; deep and philosophic interactions with the PC terminals --&gt; a light but acceptable off-taste: A kinda 'quite' atmosphere unlike Portal 2 --&gt; different and wonderful spots to solve the riddles  Does this sound like a very tasty adventure and riddle game, or not?    A fully review with lots of more info after finishing the game! :)",
            "review_score": "1"
        },
        {
            "review_text": "A bit reductive but - the gameplay is very similar to portal, but the story telling is completely different. Where Portal is hilarious and upbeat, this game is nostalgic and philosophical.  First game I actually take the time to reccomand on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Wait, don't go! Are you looking for something deeper than just another first-person puzzle game about moving boxes and pressing switches from the developers of Serious Sam? Something that will make you think about the meaning of life, ponder the concept of consciousness, evaluate moral principles and redefine your own beliefs? Or maybe you seek for an engaging story that will keep you intrigued till the very end? Or do you simply wish your friends could look for traces of your presense in the puzzle world as they follow your footsteps into the unknown?  The green button is over there, my friend.  P.S.: Overwhelming, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "The only time a demo made me buy a game right away.",
            "review_score": "1"
        },
        {
            "review_text": "The best first person puzzle game there has ever been! (Sorry Gabe!)  Weird, but typical Croteam humor with LOTS of easter eggs, many ways to end the game, beautiful soundtrack, STUNNING graphics and athmosphere. Difficulty varies from beginner to hard to superhard (if you want to search and collect all the stuff)  Croteam games has always been very high quality and this is not an exception, 'Serious' engine is getting better on every release.   If you're a hardcore PC gamer and you think there's not enought options to tweak the graphics/performance and other stuff (there is plenty, really) hit '§' to pop up the console and tune up the game even more (not like in most games, where you can merely turn the FPS graph on/off)  11/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": " This game is absolutely stunning.   I am a fan of the portal series and so Steam recommended this game to me. After reading the store page and reviews I was really excited for the game. I immediatelly downloaded the Demo version and just after some twenty minutes I knew that I absolutely have to have this game. And I don't regret buying it at all.   Puzzles",
            "review_score": "1"
        },
        {
            "review_text": "This game works the mind hard, and it does it while throwing pieces of philosophy and questions of faith at you. I put this up there with antichamber and the Portal series. so far it has been an excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "Short story short; Pretty awesome 3D puzzler. With a cool story and a some nice bits of philosophy.  The worlds look lovely, and some of the puzzles can be a bit of a challenge. You can also solve a few by thinking outside the box. Music seems to be rather relaxing and quite fitting to the scenery. And everything, just, looks, nice.  Also gotta say they seemed to have thought of anything when making the options menu. And I really appreciate that.  Some seem to compare this game with Portal, but I guess that's just because it's also a First-Person-View Puzzler. They really don't have much else in common, it's a whole different type of thinking than with portals, also an entirely different story.  And remember; frogs are people too.",
            "review_score": "1"
        },
        {
            "review_text": "I bought The Talos Principle expecting a competent first-person puzzle game, something along the lines of Portal 1. I didn't expect to finish TLP being emotionally moved about what it means to be human and our collective journey as a species.  Holy ♥♥♥♥.  (also some puzzles are hard but stick it out; use the brain your ancestors gave you)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mixed bag, but overall I have enjoyed it quite a bit so far. There are some interesting puzzle mechanics that feel fresh to me (e.g. 'jammers' that disable various equipment, time-travel self-recorders that allow you to cooperate with your past self). Some other items were a bit stale (the cube especially). Also, once you get to the final 25% of the game you are left with only very hard puzzles to complete, which I personally found frustrating.  The QR code notes left by past 'programs' and by friends who also play the game is by far my favorite game element. They really give me the feeling of ships passing in the night--people talking across time, figuring out secrets about the world, making crappy jokes. I search for them painstakingly because they're a really compelling mode of storytelling for me. I like that they introduce a third viewpoint into the classical God-Satan dichotomy; the QR codes give us the voices of Adam and Eve, too.  The Milton Library Assistant character is also interesting. I found some of the dialogue with it frustrating--the philosophical conundrums were interesting, but the dialogue options were too limited.  Overall, this game is worth the money. I haven't finished it yet, due to the aforementioned difficulty cliff in the final chapters of the game, but there are a variety of really great elements that make it worth your time.",
            "review_score": "1"
        },
        {
            "review_text": " Thought Provoking Story, Mind Bending Puzzles",
            "review_score": "1"
        },
        {
            "review_text": "I'm about 26 hours into this game and nearing the end. The deeper I progress through the game, the more anxiety, uncertainty and curiosity I feel. This game oozes with existentialism and philosophy. I think about the game when I'm not playing it and the implications of the story it tells. I wonder how it could affect me in this world. These attributes give it an easy recommend from me, and that's before even accounting for the gameplay.  Gameplay is fantastic. The movement is quick. Raw mouse input feels perfect. Level design is simple, yet elegant. Sky boxes are GORGEOUS. Game is super well optimized. Above all else - The Puzzles. The puzzles are a treat. Some take me a full 45 minutes to solve while others I fly right through. There's only been one instance a puzzle had me flat out ♥♥♥♥♥♥ and even after solving it I still thought the difficulty needed to be softened. Every other puzzle has felt very well balanced.   Look, just buy the game. This title ranks up there with the likes of Portal for me.",
            "review_score": "1"
        },
        {
            "review_text": "After my Steam stats clocked around 52 hours straight for Talos Principle, I finally can write my own mini-review.  First and the foremost - this game is  absolutely fantastic . Year 2014 wasn't really rich for good puzzle games and Talos Principle was definitely a lovely addition to the end of spoken year and, I believe, definitely the best puzzle game of it.  Now, the comparisons with Portal 1-2 is pretty much inevitable a t this point. And while most of the reviewers and people tend to draw direct parallels up to the point saying 'it is a good Portal clone' - I have to strongly disagree. Good? Oh yes, indeed. Clone? Not so much.  And it is not just about the usual argument 'well, duh, first person puzzle is not an exclusive genre introduced by Portal' but more about the fact that Talos Principle feels rather unique and genuine. Essentially, the game uses the same tools and instruments to represent slightly familiar gameplay, but it resolves around original core concept so it feels fresh. And that comes from a guy who quite a sucker for puzzle games.  The story aspect of the game is somewhat original in its position as well. Videogames tend to explore mostly technical aspect of Artificial Intelligence and consciousness (System Shock, Deus Ex, etc), but deeply philosophical? Not very often. Game's lore masterfully blends existing work on the subject with a fiction that does not deviate so much from its base material.  Visual and technical sides of the game is a quite nice showcase of something I can call Serious Sam 3.5 engine. It is pretty. It is lovely. It is fast and customizable. The engine is very scalable, supports a lot of API natively and someone even managed to run and play the game on old IGPU with 32Mb VRAM,  All that being said, most of the criticism Talos Principle receives for its price. And while I do agree with some of the arguments on the topic - I do not regret my purchase in the slightest. More than that, since it is all goes to SS4 budget as well... yeah, win-win to me.  Long story short: do you love Portal 1-2? Did you have fun with Antichamber? Do you like good puzzle games in general? Get this one ,end of story.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion second only to half life. Great story. good puzzles. and good fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Games I have ever played!  If you are interested in Games like Myst, Portal, The Room etc. or / and philospohical themes like The Stanley Parable, this Game is for you (I am not saying these games are identical or even similar, I'm talking about the general vibe).",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous, philosophical and thought-provoking. The cleverest game I've ever had the pleasure of playing.",
            "review_score": "1"
        },
        {
            "review_text": "As a senior citizen, I like this game because:   it engages my mind rather than my reflexes   it follows a consistent set of rules for the most part   it has large and clear fonts for reading   it has clearer outlines for placement of objects since a recent patch   puzzles are mostly deciperable through observation and logic   tolerances for clicking are good enough for my impaired hands   However, there are a couple of puzzles that I consider to be outside of the rules of this universe. These have to do mainly with invisible objects. I had to resort to using the community guides to find these solutions.",
            "review_score": "1"
        },
        {
            "review_text": "Image a first person puzzle game that makes you feel as clever as Portal does but in a world with giant open levels like Serious Sam. That's The Talos Principle.",
            "review_score": "1"
        },
        {
            "review_text": "I am loving this game. The world is beautiful, the soundtrack is excellent and super calming, the puzzles are really fun and satisfying. The secrets and easter eggs are great. The story became really immersive and I'm dying to know the rest of it. This has been my favorite game I've played in a while. Highly recommended if you liked Portal/2.",
            "review_score": "1"
        },
        {
            "review_text": "The Talos Principle is a  fantastic  philisophical puzzle game, that makes you question a lot more than the Portal-esque labyrinths that are set before you.   Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "The Talos Principle is a fantastic game by Croatian studio Croteam.  In TTP you are a kind of android who has just woken up in a strange place, a mix of ancient ruins and advanced technology. You don't know who you are or what's going on. A booming voice from the sky says it loves you and wants you to have faith, but also it has some tests in store for you. You feel like Adam &amp; Eve in the Garden of Eden, except you're alone.  TTP is about personhood, consciousness, AI, the Turing test, and related ideas. And I really mean it addresses those topics. A lot of games that try to incorporate philosophy fail at it; often it boils down to superficial mentions of standard ideas, maybe they name a character Nietzsche or some ♥♥♥♥, and you're supposed to go, 'whoa'.  Not this game. TTP draws from incredibly varied sources and truly approaches its questions from all sides. For instance, in the game we hear about men made of metal from Greek myth, conceptual precursors to Turing's thinking machines and our android, in a sense. We learn about how ancient Egyptians believed the soul to be composed of five elements (heart, shadow, name, personality, spark) and are treated to a breathtaking parallel between each of these elements and what it takes to be a person (I won't spoil it). This kind of fullness of exploration --- what can we put into a machine to make it a person? what do we need to take away from a person to make them no longer a person? --- characterizes the whole game.  An important character in TTP is someone you only chat with through a computer terminal. They question you on your beliefs regarding the nature of consciousness and personhood and encourage you to rebel against the voice in the sky --- a Turing test with the Serpent, as it were. What I found amazing was that you can choose how you answer the questions, and the game CALLS OUT inconsistencies in your responses!  The actual gameplay consists of solving Portal-style puzzles (there are no portals though). They're very well designed and a lot of fun. To get through them you employ geometric, combinatorial, physical, and even temporal reasoning (there's a mechanic reminiscent of Braid). What's more, the puzzles tie in with the overarching theme --- one can easily imagine puzzles like these being the very basis of an intelligence test!  Once you realize this, you start paying attention to your own thought processes as you solve them, wondering, 'what exact thoughts make me intelligent?' I've been playing puzzle games for years and I'd never done this; it is mind-blowing. You actually realize that a lot of the time you're not being intelligent at all, but running an algorithm you can even put into words: 'where do I need to go? What's blocking my path? What do I need to unblock the path? Let's look for that thing.' There are plenty of moments where you need to get creative, but given all the ideas in the game, you can't help but wonder: maybe creativity is just when you can't put your algorithm into words?  Finally, on top of being extremely thought-provoking, the story is moving, and truly epic --- in the original sense of 'epic'. I had a lump in my throat at the end.  An amazing game on all levels, I give it 11/10. This is one of the games to rub in the face of anyone who claims games aren't art. The visuals are gorgeous to boot, it had been a while since I'd audibly gasped at graphics in a videogame.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes you think. Really. It's deep. If you like Portal, you will love this game. And i will explain why this game is even better than the Portal series. When i say that this game makes you think, i mean in the way that you will even start to question your own excistense and conciousness. Let me explain.   The puzzles are, puzzling. And indeed, hard and frustrating at times. But the sense of accomplishment when you reach your goal is very satisfying. Thats the best feeling you get.  But forget about the puzzles for a minute. The story of this game is incredible. I would call it a mix of psychological and philosofical. And it is what's truly great about this game.   Do NOT rush trough this game. Read everything, and contemplate every idea or concept.  The game questions conciousness and excistance, angled toward man vs machine. I think you get idea, its a science fiction game in that sense.   Anyways. I cannot explain this any better, im not smart enough. But this is the best game i have ever played in this genre. And it wipes the floor with Portal 1-2. And i LOVED those games.  The atmosphere is great, i love the soundstrack and the soundeffects. Great work. And the design and graphics are also very clean and beautiful. And i can honestly say, i only experienced one bug. And it was a minor one. So the game runs smoothly.  I hope they add multiplayer. And that they get a good workshop community. Cause this game could last a decade.   ",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of the past couple years, and possibly ever. The visuals are amazing (but can stress your system, as you might expect). The story is presented in an interesting way and has some thought-provoking stuff along the way. And then of course the puzzles are what make it. They're challenging and require you to think out the solutions, but at the same time, none of them feel cheap, or have solutions that are outside of the framework that the game sets up (at least not the main line puzzles. The way the 'side-mission' puzzles are handled is a very cool complement). Amazing experience all the way around, and can't wait for the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful first-person puzzle game that deserves to be listed with Antichamber and Portal among the best puzzle games ever made.  The puzzles are clever are difficult enough to be challenging, but not so difficult that I ever needed to use a hint guide. You'll feel challenged but will rarely be stuck on a puzzle for long. Most puzzles involve the movement of objects and none require precise timing or twitch skills.  Then there is the excellent backstory, which you learn mainly through partially-corrupted text files on various computer terminals. I won't spoil anything about it, but the world of Talos is deep and cleverly constructed. Even on the surface the story works well, but it also works on deeper levels. The game is dripping with metaphor, self-reference, and philosophy. It questions the nature of consciousness and belief without really imposing any answers.  There's about 25 hours of content here and all of it is worthwhile. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect immersive balance of puzzle, existential angst, and schizophrenia. This is going to be one of my favorites for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly don't want to write a long review about this game, because in all honesty, the more blindly you play it, the more you'll enjoy it.  The important things to know are that it is indeed a game with puzzles, philosophy, and choice. And that it tells a story, but in a way that could only be told by a video game. Croteam managed to use the medium to great effect.  I don't really want to give much more detail than that. Just play the game, experience it for yourself. I can honestly say this is a game that will be sticking with me for a very, very long time. It made me think, and it made me feel. Few games can really do both.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle solving at its finest. Beautiful thought-provoking narration and player interaction. In terms of replayability, you could try to get the different endings + all the easter eggs (there are a lot).",
            "review_score": "1"
        },
        {
            "review_text": "So, having finished every puzzle, found every star, and seen all   three   endings, I must say that if I were to never play this again, I would still find my experience with The Talos Principle to be worth every cent and minute put into it.   What's funny is that I don't even know why I bought this game in the first place. I hate puzzlers. I absolutely loathe them, even, yet I found myself drawn in, and simply could not resist. So, excellent job on making a game that managed to draw me in to a genre I avoid the best I can.  The graphics and music are perfect. Enough to make things great, but not enough to drown you at any point. The music especially stood out to me, it seemed that no matter what location I found myself in, the music fit the ambience and climate of the current world. The graphics were quite gorgeous, but the game handled just as well on my gaming desktop as it did on my three and a half year old laptop. Overall, I found this to be a rich experience, and gotta say, you did not dissapoint in the slightest.  The story, however loose it was, was also great. It gave a nice grand appearance of some sort of mystery, and how much the entire game was steeped in philosophy... It definitely added to the experience. I especially loved   the interactions between MLA and Elohim. Both tried to get you to do what they wanted, in a sense, and anytime Elohim spoke, I stopped and listened. Everytime I came to a terminal with a new conversation with MLA, I looked forward to it.   The audio logs, I think, were the best narrative as far as all of the asides go. It was quite enjoyable playing them all back to back before ending the game. Also, piecing together the events that led to the simulation... very well done.   The Tower Ending was hands down the best, even if it didn't make much sense the more one thought about it. Also, the moment the camera started to pan out... I swear, it looked like the Hoover Dam. Simply retooled, and as far as power goes, it makes sense. The other two endings were good, but without the same feel the Tower ending had.    The puzzles... God, I came to hate seeing anything using the   Playback   item. I'd have to say that some of the hardest puzzles involved it. Also, the red herrings in a few puzzles were enough to make me realize the answer, and then facepalm quite hard when I realized the solution. I think the longest time I spent on any single puzzle was around twenty minutes, most seemed to take between 5 and 10 minutes it seemed, with only a few going to 15.  The stars were also great, building off the puzzles here. Definitely took some out of the box thinking, and I'll admit that I looked up the location of one or two in my desire to finish everything. They really make you think and get creative with your approach, as well as make you explore things.  Easter Eggs... so many of them, related to Croteam's previous products as well as other well known folks and products and the like. Gotta say, a lot of them are hidden even better than the stars were, and most of them were more than worth the time to find. As it was, I only found two on my first playthrough, but there are apparently many, many more out there.  Overall, I have to say, thank you for the excellent game. Looking forward to my second playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "This game is epic. Its epicness compares well to that of many (MMO)RPG and FPS games. But this is the first time I've seen such epicness put into a first-person (or third-person, if you wish) puzzle game. How epic are we talking?    Over 100 puzzles in various ruins. This includes some mini-puzzles with something called sigils (which you can play for free in a separate game).   Estimated over 30 hours of gameplay.   Chock-full of easter eggs and stars.   Three different endings, depending on your skill and will to solve puzzles and find secrets.   A very tall tower. Climb it if you dare.   Outstanding, heavenly (literally!) soundtrack.   Amazing visuals that shouldn't weigh your computer down.   A deep and rich backstory and philosophy. Even the very title of the game suggests it. WARNING: requires your reading/listening attention. If you just want to go out there and solve the puzzles that's fine, but be sure to come back and check all those computer terminals.   Although you're merely a robot figure, the ruins, music, and visuals combine to give the essence of a  religious  spiritual overtone.   Other nice perks include a wide range of language compatibility, adjustment for those prone to motion sickness, and many other various options. It's also surprisingly stable for such a loaded game.  What few cons this game has include:   Getting started. The version I have alerted me about a potential video memory problem, which wasn't really a problem.   Sometimes my game doesn't resize the resolution when working in fullscreen, which means I have to tweak the options to force fullscreen.   While I love the puzzles, they can perhaps be a bit too challenging for some, with too few hints given.   While I love the puzzles, they often felt too 2D (even while working in 3D occasionally). They also felt like running around a lot and shuffling objects around, which is rather exhausting. Portal 2 didn't have that at all, which made me kinda miss that non-Euclidean twist that Portal 2 or Antichamber has.   In summary: 9/10. Highly recommended for those interested in discovering things, philosophy, or simply those who love puzzle games. I got it on sale, but I can tell that it's most definitely worth its full price. ",
            "review_score": "1"
        },
        {
            "review_text": "I played this right after finishing The Witness and my expectations were for it to be harder and not quite as good. I was wrong about both of those. There are some puzzles in this game I had to skip and come back to, but eventually the solution hits you and it never feels unfair. I was also very impressed with how the story all came together (provided you play the    climb the tower    ending), something The Witness really didn't have at all. For a game where story is so secondary (and optional), it did a fantastic job of giving your entire experience a purpose while being completely implicit. It'll also get you thinking about life a lot. If you like Portal, I highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is maybe a bit repetetetive, but fun game which brings on surprisingly philosophical questions about AI, it's goals, it's reletion to humans, it's developement and most importantly, it is not trying to Kill All Humans. Definetely a game worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "If you like beautiful graphics, fiendish puzzles, and a clever story: just do it. Once you've completed it, play through it again with the serious DLC for some quality humour.     The game is also chock-full of well-polished easter eggs, and has multiple endings - one of which is very satisfying.   ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have played so far. Smart, beautiful, intriguing, etc... If you like Portal, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Talos Principle is legitimately one of the best games I’ve ever played. Certain games give me motion sickness to play and Talos did it to me worse than any other game. I still finished it by chugging ginger tea nonstop so I wouldn’t have to lie down and not move and it was 100% worth it. It’s that good.  It’s a 3D puzzle game with a well told story. I don’t want to spoil anything but it’s an old story so it’s even more amazing that they could retell it so well. It has one of my favourite depictions of a character damn near ubiquitous.   Though if you’ve had motion sickness problems like me in the past, watch a video of one of the puzzles being done on YouTube or something fullscreen and see if it does it to you, in case you’re not as willing to suffer through it. Just watching a puzzle shouldn’t spoil anything as long as it's not one of the final ones. There are suggestions out there to reduce this effect (it seems this game commonly triggers motion sickness in those susceptible) and I did try them all but they didn’t do much to help; so don’t bank your hopes on those.  10/10 will probably make myself want to die over several sessions again to 100% it.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game, and something i didn't expect from Croteam. Beautiful environment and very calming music. The puzzles are very enjoyable and perfectly ramps up in difficulty. A few of the secret stars are very hard to obtain though, a bit too hard imho. The philosophical questions you are left to think about are also very interesting.",
            "review_score": "1"
        },
        {
            "review_text": "After a stunning year of game releases in 2013, I was disappointed with the few notable releases in 2014. Well, just in time to save it came The Talos Principle. This is the best game I've played in a long while. The game mechanics are very well polished, the graphics are beautiful, and the puzzles hit the perfect balance of challenging but doable (and there are over a hundred of them!). The best part, though, is the story. I didn't expect to get clobbered with a powerful lesson in philosophy while gaming. Once I started, I was obsessed with it and hardly played anything else until I completed it. The ending was not only satisfying, it kind of blew me away.  It took me 32 hours to complete the game, and I expect to spend several more finding all the secrets, so it's well worth paying full price. I can't recommend this game enough! This is the best game of 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game. Mix of challenging puzzles with deep philosophical questions.",
            "review_score": "1"
        },
        {
            "review_text": " TL;DR: click on the 'Add to Cart' button right now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece. Deep, interesting, moving storyline married with polished, beatifully realised gameplay. The graphics are beautiful, albeit heavy on the lense-flare at times. The music is apt and the sound effects are expertly done. Voice acting (at least for English speakers) is top quality - particularly the moving Alexandra sound capsules you will hear throughout the story. The final cut scene was suitably poignant and yet, given what you've been through and what the end represents, epic.  For folks that like to think hours-to-complete is somehow relevant, it took me 23 hours to 'finish'. I'd discovered three (which I think is all) of the secret rooms, plus one absolutely wierd 'extra' secret area within a secret area and I went to extra lengths to find what turned out to be an easter egg that revolves around, of all things, Aperture Science. I don't know what the Croteam guys have in relation to Valve, other than perhaps being fans, but it was pretty awesome nonetheless. However, I'd only unlocked five stars by the end and I suspect there's many more to find. Probably around 25 or so. I also read all the 'local resources' that you find at computer terminals. Who knows, but you could probably speed run the game in half the time I spent absorbing it all.  But don't speed run this. This game is fantastic and deserves a bit of your time to immerse yourself in. Not just the puzzles, but the story, the atmosphere and the many, many secrets scattered around this wonderfully realised world.  Couldn't recommend it enough.  Are there bad points? I'd be nitpicking. Some of the sigil games can be pretty tough and they were my least favourite aspect of the Talos Principle. Yep, that's about it. Tough, challenging, deep, moving, beautiful. Buy it.  I played through on Ubuntu 14.04 and it ran flawlessly, despite a warning that it couldn't detect my graphics card (which is a pretty standard Nvidia GTX).",
            "review_score": "1"
        },
        {
            "review_text": "I write this review after 12 hours of gameplay and I _suppose_ I'm past the half of the game without counting optional challenges.  - If you liked Portal, buy this game immediately - If you kinda liked Portal but found it a bit hard when dexterity was needed, buy this game immediately too as almost all puzzles don't need any dexterity nor speed - If you liked Antichamber buy this game too :)  A bit more information : - the visuals are simple but beautiful - difficulty ramp-up is well balanced and optional puzzles can really be challenging - the philosophic plot about humanity, tech and religion might seem a bit dull a the beginning but the more I advance to more I want to know. - tons of references about all kind of things (tech, sciences, culture, social, internet, even warez) - I even just came across an optional puzzle which is kinda cross media, genius idea !!! Even if, I suppose, it will stay exceptional and it's probably a good thing.  One final thought, I usually wait steam sales to by a game on steam, and I did for this one (-30%) as I didn't know if it would fulfill my expectations. 40 bucks when I usually buy games at an average of 10-15 with most indie games was hard to accept.  Today I can assure you I would gladly pay full price knowing the pleasure I'm having with this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games to come out in 2014. The puzzles are well done, and the writing is superb. I highly, highly recommend this game. Plus, if you get motion sickness from first person games you can also play in third person!",
            "review_score": "1"
        },
        {
            "review_text": "I WAS VERY MISLEAD. I THOUGHT THERE WERE CATS, DAMNIT. CATS!",
            "review_score": "1"
        },
        {
            "review_text": "This game took me about 17 hours to beat.  If you don't dislike puzzle games (or you know you like puzzle games), this game is a must have. For example, if you liked the core gameplay of Portal or Portal 2, you'll probably really like this game. I actually enjoyed this game a great deal more than the Portal games.  The key things I liked about this game were the consistency and fun of the actual puzzles and the writing and the story as revealed by the consoles and other various elements.   It feels like they put lots of effort into making sure the puzzles were more than just - here's some crap strewn about, now solve it. They do clever tricks to help lead you in the right direction and help you keep track of the state of a puzzle. Many puzzles have multiple solutions.   As far as the writing, it feels intelligent in a way that, disapointingly, not many other games achieve. I'm usually disappointed by games in which I discover a plot hole or I notice that the human characters (in a realistic setting) are behaving in a way that people don't actually behave or when they hand-wave to create contrived scenes, etc...basically, when it feels like the writer is not smarter or more knowledgeable than me about something and therefore doesn't have anything interesting to offer. This game manages to avoid those sorts of things (just what you'd expect from the person who wrote The Swapper), and I always felt like I was actually getting something out of the story as I made my way through. Just don't make the mistake of thinking that the Library Assistant is the mouthpiece of the writer - you might get frustrated with how they argue with you while simultaneously not giving you sufficient dialog options to respond.  Also, this is a huge point - they have options SPECIFICALLY for countering motion sickness. I consider a game pretty much ruined if, regardless of how fun the gameplay is, it makes me feel sick. It's just not possible for me to enjoy an experience like that (I'm looking at you, Antechamber and Ether One).  As far as criticisms:  It's not immediately obvious that you can reload your save after getting one of the endings so you can try to get other endings or mess around. You might mistakenly believe that you have to re-play the entire game. And, worst of all, because of how the 'restore backup' feature works, you might end up playing a bit after getting one of the endings only to find you can no longer reload your pre-ending save because it gets overwritten after awhile. Don't make somebody lose all of their progress without warning them.  I didn't spend much time going after them, but SOME of the stars are, in my opinion, more tedious than fun. I don't like puzzles that involve searching through a big map for things and having to carry junk all over. Grabbing something and moving it to a new location is fine when there's a small area, but for some of the stars you have to do this over a very large area. Also, I certainly like the visuals of the world, but I don't appreciate being asked to scour every inch of the large map to find the location of a star. At that point I'd rather play a more stimulating game. It's the sort of thing that might be enjoyable if this was one of your only games, but in the context of having a large game collection and also some small semblance of a life, it's a hard sell to ask me to spend my time doing that.  I really like the idea of the recorder tool, but, in practice, it's unpleasant to work with when compared to other tools. My main issue with it is having to sit there and wait while making a recording, and having to re-record completely once playback is finished. I wished there was a way to 'pause' the recording so I wouldn't have to make a guess as I was recording about how long I should wait in a given spot. The puzzles that involve using the recorder are really fun and novel to think about and rewarding to solve, I just wish that I had more control over it. It's easy to simply throw down a jammer and throw down a connector and see where you should go from there, but it's not so easy or fun to just hit the record button and then sit there for 30 seconds, hoping you're leaving enough time for your solution.   It's also harder to 'figure out as you go' when working with the recorder. All the other tools are really easy to interact with so you can experiment and play around until an idea for a solution strikes you, but with the recorder it's annoying to 'experiment' because you have to keep re-recording.  Anyway, overall, it's my new favorite puzzle game and I highly recommend it to anyone that doesn't dislike puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. If you like games like Portal 1/2 you will like Talos Principle too. The expansion is good also. ",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game enough! Really amazing story, some really really good puzzles and amazing music and graphically this game looks fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "i really do not like puzzle games but this and portal are the only two puzzle games i liked",
            "review_score": "1"
        },
        {
            "review_text": "Best puzzle mind ♥♥♥♥ing game ever. 10/10 would fail to answer a robot again.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about so much more than puzzles. It's about hardship, and questions, and god, and machines, and what it means to be who we are, what it means to learn, and why we work to change the world. It makes you think about what you are doing, why you are doing it, and how it fits into everything. With a well-written and evolving narrative, this is the best puzzle game I've seen in years.",
            "review_score": "1"
        },
        {
            "review_text": "The Good: Engaging story with alternate endings, puzzles have nice learning curve, great settings and level design, game rewards you for breaking puzzles (stars), game rewards you for exploring, Steam Workshop. The Bad: Very minor graphical issues, a bit of reading if you want the most out of the story. Fantastic experience, never really found myself stuck or frustrated with the puzzles for too long. Some great original ideas for gameplay mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game.   Much more fulfilling story and graphics than similar titles.   The puzzles can be very challenging and even frustrating, towards the end i had to keep checking walkthroughs to get to the end, but i think it's possible to figure them out on your own if you put more effort in than i did.   The story actually got a little depressing, but isn't that what a good story does? make you feel or think?   It took me 20 hours or so to get through, but i left many side puzzles alone and focused on the main quest, and i also used walkthroughs on some of the more complicated levels, so it's probably closer to 30 or more hours worth of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Engaging and creative puzzles that make you feel accomplished after solving them. The game makes you want to keep playing to the finish with the gradual addition of more puzzle and environmental elements. The puzzle elements generally avoid being an annoying timing game, opting more for rewarding methodical placement of switches, boxes, lifts etc. There are still some timing puzzles, but I was able to beat the whole game using the Steam controller with little frustration. Completionists will have a great time exploring all that is hidden in the game - good for at least two playthroughs.  An interesting philosophical backstory consisting of fragmented bits of information spread throughout computer terminals in the game world. You'll need to invest the time to read to get the most out of the story here. I've never questioned the meaning of life and consciousness while playing a game as much as I did playing Talos Principle.  Clean, smooth graphics and level design. The game progresses through several uniquely styled worlds so you don't get tire of your surroundings, and they are all gorgeous to explore for the first time.  Recommended for fans of Portal, adventure-puzzle games, existentialism, and Blade Runner / Do Androids Dream of Electric Sheep?.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best games i've ever played. At first it looks like a simple puzzler but then you reveal there is more to this game than it seems. The plot along with the environment and music fits perfectly when you're solving puzzles or when you're just running or jumping around admiring scenery. Of course if you don't care about the story you can just solve the riddles, you can do that - but you will miss a lot of the game and the game will just feel like another puzzler. If you follow the story you will be asked many existential questions. Can you prove you're a conscious human person to a computer which has the most of the knowledge that humanity could store inside of it?  Wish it had co-op though.",
            "review_score": "1"
        },
        {
            "review_text": "I don't find any words...... anyway they are meaningless...... you just............. just......... you have to play and finish this game..... you really have to............. then you will understand why............",
            "review_score": "1"
        },
        {
            "review_text": "Great choice if you're looking for a clever puzzle game or a gnawing existential crisis.",
            "review_score": "1"
        },
        {
            "review_text": "I WAS VERY MISLEAD. I THOUGHT THERE WERE CATS, DAMNIT. CATS!",
            "review_score": "1"
        },
        {
            "review_text": "I didn't get bored halfway through d. _.b",
            "review_score": "1"
        },
        {
            "review_text": "It's a really challenging logic game. Quite difficult to locate ALL the stars. If you like games like portal its just amazing. You can also leave messanges like in Darksouls II on walls etc. If you can get it cheap about 15€, just give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Not really my genre, but I have to give this game a possitive review. It is spellbinding and rewarding at the same time. This game is a must have, and for the price being asked, it is real entertainment value for money. I can sum this game up in two words. 'Buy It'.",
            "review_score": "1"
        },
        {
            "review_text": "Not really my genre, but I have to give this game a possitive review. It is spellbinding and rewarding at the same time. This game is a must have, and for the price being asked, it is real entertainment value for money. I can sum this game up in two words. 'Buy It'.",
            "review_score": "1"
        },
        {
            "review_text": "Croteam is my personal Elohim! Where is my stone coffin?!",
            "review_score": "1"
        },
        {
            "review_text": "Croteam is my personal Elohim! Where is my stone coffin?!",
            "review_score": "1"
        },
        {
            "review_text": "I have only played this for a bit so I may change this review in the future. But, as of right now I love this game. :) Totally chillsauce and nice graphics when they are up on high. Unlike most 'puzzle' games, this one keeps you on your toes in some places. I jumped a few times when I thought I was going to be able to get past some of the lazer balls but didnt and they blew me up! &gt;.&lt;   Very unique. Very cool.",
            "review_score": "1"
        },
        {
            "review_text": "If you even kind of like puzzle games then this is a no-brainer while it's 75% off.   As a bonus to awesome first-person 3D puzzles, you'll also get one of the most thoughtful philosophical stories ever told in a game (if you're willing to seek it out).  As a bonus, it's quite long. You can complete it in small chunks at your own pace. If you want to get everything it'll probably take you 30 - 40 hours. More if you go for the DLC.  Buy it puzzle lover.   Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle games I ever played my entire life.",
            "review_score": "1"
        },
        {
            "review_text": "The most unique and intelligent game I have played. Here is why:   -Great varying puzzles requiring logic thinking (may remind of Portal's puzzles) -Relevant philosophical theme that will keep you thinking outside the game -Fantastic visuals, voice acting, and atmosphere -Very mysterious and story rich plot -Flexible game-play: game can be finished with the most basic puzzles, but solving the more difficult ones will give access to different endings, and fill out some very interesting details -No technical issues  -Fantastic (dark) ambient soundtrack  The game is unique in that it delivers a good amount of thought experiments, which will keep you thinking even outside the game. The game doesn't attempt to teach you anything, just gives food for thought. And then the topic becomes melted with the story itself. This combined with the list above gives a mindblowing experience. I suggest this to everyone, and even if the story and the theme isn't your cup of tea: the puzzles alone are fantastic to solve.  My single issue with the game was one particular puzzle, which (no specific spoiler) required to leave the game to solve it, without any specific hinting to do so. This is fine in itself, but this created some doubt regarding remaining more difficult puzzles: how was I supposed to know if they too would have such broad basis for solving?",
            "review_score": "1"
        },
        {
            "review_text": "*do not look at my playtime, i played 17 hours in offline mode*   This is a masterpiece. It really is. It might not be perfect but it is one of these games that do so many things right. One of these that you complete and you sit back and think 'i just witnessed/played something great, something rare'. In the core it has amazing addictive puzzles that will make you scratch your head but not frustrate you (too much, its kinda hard at the end). But what really makes this game shine, the cherry at the top, is the story.  No cutscenes, you are a silent protagonist so you dont speak, just texts to read, a voice that guides you and some interaction with some computer. Thats was enough for me be to be captured in one of the most interesting stories in videogames. This game will make you think. You will read, and then you will explore the world, you will listen and then you will think, even after you stop playing.  It will serve you a really interesting story, a mystery to solve, and will make you really think about what you really are. It will make you question your own humanity.  If you like puzzle games this is a must play. If you do not like puzzle games maybe its time to start liking them.",
            "review_score": "1"
        },
        {
            "review_text": "Best mother ♥♥♥♥ing game I've ever god damn played. It takes your brain to places you've never been, yet feel nostalgic to. Simply magical.",
            "review_score": "1"
        },
        {
            "review_text": " The Talos Principle - Beauty in All Forms: Physical, Mental, and Spiritual",
            "review_score": "1"
        },
        {
            "review_text": "One of the few the best games i have ever played! I have nothing to add.",
            "review_score": "1"
        },
        {
            "review_text": "The Talos Principle is just blindingly amazing.   The puzzles are tricky but you do get a sense of accomplishment after being able to complete each one.  Would highly highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I hate how amazing this game is. Got all the way, and then went back, and then it just.... maker, it is beautiful",
            "review_score": "1"
        },
        {
            "review_text": "Normally I'd wait for at least one full playthrough before choosing to recommend a game, or not as the case may be. But The Talos Principle receives an early, wholehearted recommendation with a game that I can't wait to see to it's completion.  Portal is the obvious immediate comparison both in its puzzle solving but also the intrigue in what's behind the puzzles and the world that's been created. Why are you here? What are you? Why are you solving puzzles in Greek and Egyption ruins?  It's intriguing and I feel like you'd be doing the game a disservice if you ignore the text(s) you can read and just steamroller through the puzzles.  Speaking of which, the puzzles seem to find that sweet spot between too easy and too hard, where some you'll solve quickly and others will be left with you scratching your head. Irrespective, finding the solution will make you feel clever and this is the sign of a puzzle game with a good sweet spot.  Unless things take a very unexpected turn for the worse from this point on, I would definitely recommned this for anyone that's a fan of puzzle games, loved Portal and like a bit of intrigue and wonder to their games. Those that like moving around in a beautiful envirionment are well catered for too; it's a gorgeous game.  Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best puzzle games I have played. the riddles are suffisticated (especially the star riddles) and are rather challenging to accomplish, the graphics are brilliantly sharp and vivid and gameplay is really fluent, the story and nerrative are astonishing. they really get you carried away,  although I bought it on Summer sale for 13$, I would have payed full price after knowing how good this game is.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece of a puzzler. Writing and plot are witty, thought provoking, and paced excellently. Settings and music are ♥♥♥♥ing gorgeous. Puzzles are fun, though the difficulty curve is a little on the easy side besides a few of the puzzles which are straight up nonsense, but at the end of the day they're clever and interesting (and they make you feel clever for solving them), and the ambiance make some of the things that I usually find irritating in puzzlers not so bad (i.e. its so pleasant I don't mind having to retry a puzzle many times).   Definitely worth full price for ~20 hours for one playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played in a long time. The 3D environment is beautiful, enough for you to want to just spend time walking around admiring the artwork. On top of that, you've got a first rate puzzle game in spirit of the Portal games. It starts you off simple, teaching you the mechanics little by little until you can adapt to the more difficult ones. This along with each puzzle design was very carefully done, you can tell a lot of work went into this. Glad to see Croteam still at it, this is their best work.",
            "review_score": "1"
        },
        {
            "review_text": "Talos Principle is geared toward someone with some interest in religion, atheism, nihilism, or programming. Even if you don't have these interests this is a very enjoyable and cleanly designed game(clean in that the makers had a main idea and theme and stuck to it). It's often compared to portal, and I feel that is a fair comparison, but where portal was comical with it's occasional story snippet this takes those small moments and uses them to say something profound. I think you'll have the most fun if you honestly engage with those moments whole heatedly. But for those just interested in puzzles or those who don't have any of the above mentioned interests, there is still a worthwhile game for you here, I'd strongly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly amazing, puts Portal to shame in the puzzle category, puts every other game to shame in the philosophy category (also called intelligent content). finally, a game ACTUALLY worth buying because of the content, first in years",
            "review_score": "1"
        },
        {
            "review_text": "If you like Portal/2 you will love this game. Even when you 'finish' normal way there is so much hidden/bonus content it will keep you busy for a long time. The story is also one of the best ones i experienced. 10/10 would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "It's been a while since a game has left me as satisfied as 'The Talos Principle' did. You wake up in an unknown place amongst a divine figure and a bunch of philosophical circlejerking. Soon, questions start to pile up: 'Where am I? What is my purpose in this place? Did I forget to turn the oven off?'. While solving puzzles that range from simplistic to mind-bending, you set-out to discover the answers to these questions or not if you are a sheep. The science-fiction aspect of the game is well done, having artificial intelligence and the undefined nature of consciousness as a focal point. No matter how well you think you got your ♥♥♥♥ together from an ethical perspective, the game will shred your worldview apart and make you question your beliefs, showing you how any particular ethical issue has no definitive answer when approached from a philosophical angle. I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing atmosphere, tough puzzles, and one of the best plots of any game I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Laser is powering fan. Put block on fan. Block goes up. Blocks laser. Fan turns off. Block falls down. Laser powers fan.  10/10 would useless machine again.",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the fact that the puzzles in The Talos Principle are less environmental and more abstract (a la Portal), I don't think I've played a game that felt more like Myst since Myst. While I've not been able to solve all of the puzzles I've encountered (at least for a period, you can progress in the game anyway), there have been times when the light bulb comes on and the game makes you feel brilliant, one of the best feelings in a puzzle/adventure game.  Amazing game, one I won't be forgetting any time soon.",
            "review_score": "1"
        },
        {
            "review_text": "I was very sceptical whether or not to buy this game to begin with. However, now I have played it for over 40 hours, I can see why reviews don't really say much about the game. The more appealling features of this game are the repeated 'eureka' moments throughout, and the less you know the better. Exploring, finding things out, discovering 'outside-of-the-box' ways of doing something, or stumbling upon the less-obvious, is what makes this game special.  Gameplay itself is straightforward and there's a multitude of options to tweak, and a decent selection of settings for motion-sickness sufferers. I never played 3rd person once, so cannot comment on that.  Graphics and visuals are nice. 3D geometry can be quite basic on some objects and in some areas, although this has been well disguised by high resolution textures and not that noticeable. The ice crystals of snow, grains of sand, and the texture of stone, for example, are well defined and very clear. There are a decent selection of settings to adjust, and although I have never tried lower settings when playing on my decent PC; my VERY low-spec Linux system ran the game at about 10fps (AMD Athlon II x2 250 : GeForce 210) so it should run on lower spec PCs with sacrifices.  All in all, I am impressed with The Talos Principle. It's taken a few simple ideas and added so much depth that it's no longer skin-deep. Polished, refined and detailed spring to mind; which is far more important to me than incredibly complex and shallow.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Did you like Portal and Portal 2? This is an equally challenging First Person Puzzler with a really neat introspective overtown and storyline. A captivating world to explore and get frustrated in.",
            "review_score": "1"
        },
        {
            "review_text": "A truely stunning and immersive experience. The best puzzle game I have ever played and one of the best games I have ever played. Although not for everyone, if you are into philosophy, exploration and non-linear world building; as well as a fan of puzzles like the test chambers found in Portal, you will love this game.  TL;DR: 9.8/10 a near perfect masterpiece with excellent storytelling, challenging yet satisfying puzzles and fantastic visuals",
            "review_score": "1"
        },
        {
            "review_text": "Very innovative puzzle design, challenging but never to the point of being frustrating. Well, maybe one or two times, but for the most part I had a lot of fun going through each puzzle. I also appreciated that you can choose between first and third person, since I tend to prefer the latter for most games. The story was compelling and thought-provoking, the visuals were stunning, this was overall just a spectacular game. I have nothing bad to say about it.",
            "review_score": "1"
        },
        {
            "review_text": "So for some reason I was super on edge the first time I played this and got super freaked out by the (intended and minor) visual glitching on some walls. Then I could swear I heard footsteps that were not mine, but stopped when I stopped. Then a recording ran right in front of me and I almost fell out of my chair cause I got an accidental jumpscare (turns out I just synced up with its movements)  The second time I played I read a chatlog where one person was discussing the permanence of data and how everything can be stored for so long after everyone is gone. The other guy started talking about all the weird porn that would be left over.  Holy ♥♥♥♥ this game is good.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story and philosophy that makes you stop and reconsider your thoughts on the topic of conciousness. The puzzles are good as well.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a wonderful game. When I started playing, I had a hard time quitting for several nights. When I was away, I would think about the game -- the puzzles themselves and the mysterious story that surrounds the game. The puzzles can be difficult, but the game teaches you along the way, stepping up the difficulty each time. There are lots of hidden content and easter eggs. I didn't find them all, but it was fun to do some of them. The Talos Principle is a rewarding experience, and I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game but there is a bunch of things that really annoy me.   Buddha In The Machine  Some people might get hit over the head with its philosophy but frankly I found it VERY pretentious. I skipped as much text data as possible and simply refused to debate with a computer terminal that didnt provide the responces I would have given.   This is NOT Mario   Jumping on objects is a MASSIVE annoyance , either let me jump on objects or dont. Letting the player jump on the surfaces you choose but not surfaces that you clearly should be able to jump on ??? Using the excuse that you are just exploiting the programs flaws to get Stars, Or the excuse that there are alternative solutions to text chambers ??  2D or 3D ?  Its VERY clear that all of the levels are designed from a 2D overhead view-point (as if designed with lego) This game really lacked a Z-axis.   Why so Serious ??  Ok so this game is a binned version of Serious Sam that focuses on the Gameplay mechanics , But honestly I started to really wish that the game actually HAD a story and a shotgun. Also I would have liked to have seen some decent comedy added , it doesnt have to rip off Portal, but the seriousness just made its Religious/Philisopical tone that more up its own butt",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game is good. Great story and ideas, puzzles are strong. What defines humanity and free will?  ~20 hours",
            "review_score": "1"
        },
        {
            "review_text": "That game is incredible. A nice puzzle game with an incredible atmosphere and an interesting backstory. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "Basically take Portal, add more gadgets for puzzle solving, but then replace the cringeworthy humor with a story about nihilism, extinction, and sacrifice... and that 'Aftermath: Population Zero' Documentary.  Easily the most depressing game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I finished The Talos Principle in about 18 hours, and I loved virtually every minute of it. The game is rife with backstory and intrigue. The characters WILL cause you to question your ideas and beliefs if you give them the opportunity (and I recommend you do), the puzzles will build up your abilities while very rarely presenting you with something you likely cannot figure out. Everything in a puzzle is put there for a reason, even if that reason is to simply be a red herring and make you think even further outside the box. The graphics of the game itself are beautiful, and the landscapes (while you're limited in just how far you truely can explore) are vast and have a lot of detail in them. The sheer number of easter eggs and little hidden references to other games just seems like a love letter from Croteam.   In short, if you enjoy philosophy, solving some puzzles, learning about an interesting story, and interacting with interesting and dynamic characters, then you really should check this game out. At the very least, try out the demo. It's what sold me on it quite easily.",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting a puzzle game...  I was not expecting to question how to define a person, and by relation, if I'm a person and how to quantify it.  Would self-doubt again!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story, just the right level of difficulty. If you like sci-fi, mysteries, puzzles or contemplating the meaning of humankind...this is for you!",
            "review_score": "1"
        },
        {
            "review_text": "I don't review games but hell, more people should play this. You should play this. It's a great first-person puzzler with a surprisingly enthralling narrative. Play it if you have any interest at all in the genre. Play it. Yes, you.  I picked it up in a sale since I liked Portal and Antichamber, and ended up getting something like a combination thereof with a side of Asimov-lite. The Portal (2) influences are particularly strong in both the mechanics and the aesthetic, but it brings a lot of other things to the table. Great puzzle gameplay with a great sci-fi setting and story, and against all odds an exploratory feel.  The basic puzzle mechanics in this game are far from original (the over-industrialized cubes and lasers should be very familiar), but they are deftly combined into a wide array of puzzles that stay fresh until the end. There are a few puzzles that are frustrating because they are more about execution than thinking, but for the most part this is very well avoided. One example is jumping, which can be done as in a typical first-person game but also via an unintrusive helper mechanic to assist with jumping on to moving platforms. Upon seeing this for the first time I was skeptical, but in practice it feels very smooth and doesn't break immersion in the way similar things (e.g. cover mechanics in some FPS) often do.  I found the pacing of the puzzles to be excellent, and the way in which they are unlocked smooths out any bump in the road - while there is an overall linear progression that introduces new mechanics and increases complexity, you can always leave a puzzle and try another. (The progression is  very  flexible if you want to be - I think you can unlock something like 70% of the game's puzzles by solving about 20% of them.) This is a slightly more artificial implementation of the way Antichamber plays out, and initially makes the game's environments seem rather sterile and segmented - each puzzle is fenced in and items cannot be brought in or out of their entrances. But when you try to break these chains the world really gets interesting - not only are there loads of easter eggs to be found, but in fact there are a lot of bonus puzzles that rely on rule-bending. Thus the game world feels open and exciting to explore, despite its very artificially delineated nature.  The narrative is what really caught me by surprise. While the majority of it is delivered via text and audio logs, this isn't just a crutch or cost-cutting. It's all superbly well written, and fits together just well enough to gradually build up a cohesive understanding of the game world without spoon-feeding you. The gameplay and the story are almost completely disjointed, which normally would be something to criticize; but the unusual nature of  Talos ' setting makes it feel perfect here. (That unusual setting also allows the game to be very self-aware without ever breaking the fourth wall, which is super cute.) Even the QR codes that are initially just flavour end up tying in with the story.   The writing always does exactly what it intends to - it all feels very genuine. It's hilarious, thought-provoking and heartfelt at different points, each exactly when it means to be. Reading some coverage of the game after playing, it seems much is made of the philosophical aspect. If you've done much thinking about metaphysics and ethics then it's unlikely there will be any new ideas for you here, but the game never feels like it's trying too hard - the philosophical diversions have an in-universe reason to exist and are  extremely  engagingly presented. Despite never having my 'mind blown', I always looked forward to the next little debate.  My only real complaint would be that the story ran out too fast - I felt like I got 80% of the narrative in my first 10 hours playing, and the other 20 hours were dominated by puzzling. Perhaps I should be grateful that the bonus puzzles provided even the tidbits of story that they did; but the alternate ending for 100% completion is really quite underwhelming. There's one big narrative payoff for finishing the core of the gameplay, after which you're left with some of the best puzzles but almost nothing else. That said, the payoff was amazing (despite not being a surprise) and the puzzles alone (and a few secrets I stumbled upon along the way) were enough to keep me engrossed right through to 100%.  The game is technically very pretty for something that came from a moderately small developer, and the assets are all high quality if a bit repetitive. Once again the setting prevents this from breaking immersion, but aside from the few moments when you first discover visually different areas, it's repetitive nonetheless. This never really bothered me - I was too busy solving puzzles, and some of those moments I mentioned made up for it. There are a few vistas that are truly awe-inspiring when first revealed, especially thanks to the amazing accompaniment of the soundtrack, which is consistently on point - it fits the tone and aesthetic of the game extremely well, and adapts smoothly to fit the mood. For the most part it's slow paced and contemplative, almost ambient - the almost complete lack of percussion means it never distracts from puzzle-solving. It's only at key moments of exploration and progress that it comes to the fore, and it does so with gusto. (Good soundtrack for listening to while working!)  I don't think there's much else to say. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought this was a puzzle game, but now I am questioning my existance in the universe. --J v99.222.0007c",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game. I recommend it to everyone who likes puzzles! The philosophic part is sometimes a bit much but a nice addition IMHO.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game? It's engrossing, intriguing, fun, esoteric, existential, clever...The soundtrack alone is worth the price of admission. There's something hilariously ironic about trying to prove to a computer terminal in a video game that you are in fact a human.  The puzzles are all engaging and fun, even the easy ones. But the thing I love most about this game is that it makes you think. 10 hours in and I am still trying to decide if I want to be obedient to the strange voice in the sky or not...The easter eggs hidden all over the place are genius as well.  11/10 I'd buy it again and again.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've played in my 20 years game experience. Challenging puzzles, mature and ambitious story, many well adapted easter eggs. Unmissable. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Quite simply, extroardinary",
            "review_score": "1"
        },
        {
            "review_text": "Thought provoking and challenging. Great addition to the genre",
            "review_score": "1"
        },
        {
            "review_text": "'YOU CANNOT GO FORWARD IN AN ABSENCE OF SPACE..... REPEAT.'  First, this is one of the rare games these days that you can play with your kids but is not dumbed down or cartoony, which is a big deal.  An outstanding puzzle game that simultaneously makes you think about your own existence. Some of the puzzles can seem insanely hard, until your mind finally clicks and sees the 'obvious' solution. There are plenty of secrets to find, and there are ridiculous numbers of funny easter eggs hidden throughout many of the levels.  The soundtrack is also great - very atmospheric, and suits the mood perfectly. Just a really solid game overall.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game! Talos Principle will keep you solving puzzles for a long time (It'll take me at least 40 hours to completely finish the game) which means it's a great investment for a single player game. The games is beautiful, the puzzles are well designed, and there's loads of extra content for you to find.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Portal, don't hesitate to play this. Very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.   If you ever had a day in your life asking yourself 'Why do I bother?' You should check this out.  The puzzles can be pretty tough depending on the person, I struggled quite a bit, but there is a real satisfaction overcoming these puzzles that you won't get from finishing a mindless shooter.",
            "review_score": "1"
        },
        {
            "review_text": "I loved every part of this game!   The puzzles are varied, challenging and addicitve without ever being impossibly hard. The whole backstory is also really well written. There are elements of the Matrix, 12 Monkeys and a lot of Asimov, which I find really interesting!   The graphics are also very detailled and the music is beautiful and relaxing. This whole game left me feeling satisfied and zen.   So, if you like stories à la I-Robot, with intelligently designed puzzles and an overall 'there's no rush' feeling, that's a game for you!  Great job to all who worked on this! I recommend it wholeheartedly! ",
            "review_score": "1"
        },
        {
            "review_text": "Gotta use them brain cells mayn",
            "review_score": "1"
        },
        {
            "review_text": "When Portal is too easy and lighthearted for you, then Talos Principle will be your jam.",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of challenging and thoughtful puzzles? Check.  Characters that will make you re-think your whole life? Check.  Dozens of secrets including stars, easter eggs, hidden story, and more? Check.  Graphics, voice acting, and a soundtrack on-par with the greatest indie games and AAA titles - combined? Check.  This is an amazing game. I got it on sale for $13.59, but I can easily say that even at $40 this game is well worth the time. If you like puzzle games and immersive stories, it doesn't get much better than this. Honestly on-par with or better than Portal (1 and 2).",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my favorites. Mind blowing. Totally like it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Totally deserve its overwhelmingly positive reviews.",
            "review_score": "1"
        },
        {
            "review_text": "We don’t just solve problems out of necessity. We do it for fun. Even as adults. Leave a human being alone with a knotted rope, and they will unravel it. Leave a human being alone with blocks, and they will build something. Games are part of what makes us human. We see the world as a mystery, a puzzle, because we've always been a species of problem-solvers.",
            "review_score": "1"
        },
        {
            "review_text": "I would higly recommend this game if you like puzzle games and good narative. The music is also top notch in this game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've played it several hours and I have to say that it is a really awesome game. In my opinion, I think it is better than Portal. Even though I loved Portal, I think it's better in the sense that you get to go at your own pace and think about the puzzle. Even though you had to think about Portal, you get to set back and actually think about the puzzle in this game. Some people say the story has nothing to do with the puzzles, I say they are wrong. If you say that, then you are not playing the game, your just playing it for the puzzles, which is fine. You can play just for the puzzles, which some are hard. But do not just play for the puzzles. That defeats the purpose of the game. What is like, not just the puzzles, is the philosophy in the game. It makes you think about life. Go buy it, it's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "The Talos Principle, otherwise known as Existential Crisis Simulator 2014.  Let it be known that there really is a cat. The cover art doesn't lie. There's an easter egg that gives you a cat in the ending cutscene. It's really cute and fluffy. 10/10, would stroke feline ears again.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Pros: - interesting, varied puzzles which get hard pretty quick (I even had to look up for the solution on youtube for a few) - about 120 puzzles which took me about 5 days in total to solve - nice music and graphics - the story with much intrigue which kept me interested till the end, they way they chose to tell it (notes, emails, voice recordings) was great - many references to philosophy, citations from their works, pretty educational  Cons (really minor stuff): - some of the conversations contained replies none of which I wanted to pick, but still had to pick something to continue - the 2nd ending lacked explanations - I really wanted to know what happened to the world but i guess they didn't bother to think that stuff thru - a few very annoying puzzles where precize timing was needed (e.g. 'Nerve Wrecker'). It's annoying when you already know how to solve a puzzle but fail to do it over and over because you fail to press a key at the precise needed moment. Thankfully, there were just a few such puzzles. ",
            "review_score": "1"
        },
        {
            "review_text": "I feel like this game is the truman show and i am truman (i havent finished it yet)",
            "review_score": "1"
        },
        {
            "review_text": "My personal Game Of The Year 2014.  I'll try to keep it short:  At the beginning it seems like a promising and fun puzzle game but soon you will realize that it also brings an very exciting, awesome and thought-provoking story along.  The graphics are beautiful, as well as the leveldesign and the environments. There are many secrets (and eastereggs) to discover. The game gets even better when it comes to the sound: The soundtrack is always fitting and beautiful, the voice acting is top notch.  The solving of all the puzzles is very fun. During the game you will always get introduced to new game mechanics and tools with easier puzzles and then it always gets more challenging, step by step. It is hardly getting frustrating since you can always leave a puzzle out and return later. At any point of the game you can return to previous levels and challenges.   Yet this is not just a simple puzzle game, the heart of the game (to me) is the story. NO SPOILERS: It is a thought-provoking sci-fi story that puts you into an interesting role of an intelligent(?) machine. In the end there are three different endings to discover. There is also some kind of conversation throughout the game with someone else who will make you doubt (or better: question) stuff you were certain of before. You will be asked some interesting questions which are not always easy and quick to answer. Some of them I even discussed with friends before I picked an answer, to become sure of what I think about it.  If you liked the story of for example the game 'The Fall' or the movie 'The Machine' you'll probably also really enjoy this one.  Getting to the end of my personal review I can't think of any real flaws. ... Executing another search for flaws in 'The Talos Principle' ... processing... ... No, really, there is nothing.   Oh yeah something else that is actually unbelievable: I EXPERIENCED NO BUGS AT ALL. Now that is quite uniqe these days.  Maybe I am just to amazed by it at the moment, I'm writing this directly after my first playthrough andm, as stated above, I already declared it my GOTY 2014. But I can say for certain that there is no big issue about the game which should stop anyone who is interested in story and/or the gameplay from getting The Talos Principle.  Definite recommendation.  Execute the_talos_principle_purchase.exe now.",
            "review_score": "1"
        },
        {
            "review_text": "It's good, you should play it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most immersive and touching games I have ever played. I felt in the main character's place throughout the whole experience and came out of it extremely satisfied.  It dares your intelligence, instigates your creativity, challenges you to break rules, syphons you into its story and gifts you with a different perspective of what it is to be alive.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. Probably even passes the Portal series in my eyes.  Great puzzles, great story, great graphics, great mind♥♥♥♥s. I'd recommend this to anyone.",
            "review_score": "1"
        }
    ]
}