{
    "app_id": 257690,
    "name": "J.U.L.I.A.: Among the Stars",
    "release_date": "2014-09-12",
    "developer": [
        "CBE Software s.r.o."
    ],
    "publisher": [
        "CBE Software s.r.o."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 40,
    "positive_ratings": 609,
    "negative_ratings": 102,
    "price": 14.99,
    "description": "J.U.L.I.A.: Among the Stars is an innovative narrative driven adventure game. The story centers on Rachel Manners, a 35 year old astrobiologist. She is a member of an elite group of scientists, chosen to embark on one of the most critical missions ever conceived on Earth. Now Rachel is alone, orbiting an unknown planet.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/257690/header.jpg?t=1478551627",
    "minimum_requirements": "OS: Vista Processor: Dual Core 2 GHz or higher Memory: 1 GB RAM Graphics: Minimum resolution: 1280x720 with at least 128 MB VRAM accelerated card DirectX: Version 10 Storage: 4 GB available space Sound Card: DirectX compatible soundcard (Mandatory)",
    "recommended_requirements": "OS: Windows 7 and Higher Processor: Intel i5 or equivalent Memory: 2 GB RAM Graphics: Resolution of 1920x1080 with at least 512 MB VRAM accelerated card DirectX: Version 10 Storage: 4 GB available space Sound Card: DirectX compatible soundcard (Mandatory)",
    "reviews": [
        {
            "review_text": "I love adventure games and I love space. This game is most suitably my 'cup of tea'! This is the first game I have bought that has been re-released in an Enhanced version after buying the original version. This isn't just an enhanced version of the original... It's practically a huge rewrite with loads more content and the graphics and visuals and audio... I could go on all day about it. Simply OUTSTANDING release!",
            "review_score": "1"
        },
        {
            "review_text": "I've never been a huge fan of point and click style adventures, but this one is superb. It's got a great atmosphere that drags you into the game. At times I even felt I was there....           YouTube™ Video:  ➜ A Quick Look @ 'J.U.L.I.A. :Among the Stars'&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. One regret - it's over. I was hooked from the outset and played through this game in 3 sessions. I found it to be a very compelling experience and commend the devs for creating such a thought provoking experience. The graphics are gorgeous and the ever changing UI was both innovative and intuitive. Sounds and music are very apt and the degree of tasks and puzzles keep you going back for more. I found the puzzles to be logical for the most part. A few did require some serious effort but this only enhanced the sense of reward upon solving them. The sense of exploration and accomplishment was high and the situations and encounters very immersive.  If you like this type of game, I   highly recommend ",
            "review_score": "1"
        },
        {
            "review_text": "At the very start I had some trouble getting into this game because I expected more visuals than there really were. However, as the story began to reveal itself and I began to get a feel for the game's purpose and how it was meant to be approached, I found myself coming back again and again until I got hooked and binged until 4AM to finish it!  This game is not exactly a clone of the Myst series, but nor is it a hidden object adventure. The story is a HUGE part of the game!  - interesting, fairly original puzzles - investigative gameplay with 'murder mystery' elements - brilliantly-conceived AI personality and engaging story - responsive interface and no glitches that I could find  There's no point listing off negative points, because if you're like me you'll inevitably weight them excessively when you read this review. Also, I can't really think of any.  Buy this game, if nothing else than for the story itself!",
            "review_score": "1"
        },
        {
            "review_text": "Just completed the Game and I will give this one a thumbs up.  Wonderful Space puzzle game with Nice Graphics, Good Animation, Great Plot, Funny Robot, Crazy AI, Easy Puzzle, Engaging music and unexpected Ending.   Takes about 5-10 hours to playthough without a guide. Achievements are pretty simple but you can miss of few if you not careful. There is also a hidden achievement no one was able to get yet and i am waiting for an online explaination for that.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game. It has an interesting story and pretty visuals. The soundtrack also matches it quite nicely. It's an impressive showing from a development team of two.  The puzzles were a mix of basic, straightoward clicking/exploration and some rather arbitrary puzzles towards the end. There were several pattern and decryption games I found interesting, but for the most part the puzzles are more random than logical (fortunately, the majority of them are simple and linear). I would've liked to see more logical puzzles that stemmed from the gameplay and clues you found, and had to piece together, but this was largely absent. The closest it came to that was key codes and the Mind-O-Matic parts that really just amounted to testing your short-term memory (or ability to write things down). The Mind-O-Matics were particularly frustrating because they were fairly arbitrary and it had less to do with having the correct sequence of events, and more to do with having the exact solution the authors came up with (made worse by the lack of a meaningful log mechanic to easily view previously discovered information). I likewise found most of the 'history / translation' exercises clumsy and arbitrary, which was unfortunate.  This isn't really a deal-breaker though, because you don't play this game for the puzzles; more for the atmosphere, music, and story, which more than make up for it. It's a narrative-driven game, and it does a good job of maintaining that without feeling too linear.  It's a nice story, in an engrossing atmosphere that will keep your interest until the end. It's not really a puzzle game (at least the puzzle elements really aren't so strong, and due to their often arbitrary nature (with the exception of a few solid pattern-matching excercises) you shouldn't feel guilty if you want to consult a guide to help move you along. I wouldn't recommend this at full price, but on sale for 50% off or more, I would say it's definitely worth your money if you like this type of game.  It's a nice little gem from a two-person inde team. It looks and feels like a game developed by a much larger dev team. Get it on sale and you'll definitely feel that you got your money's worth. It's a thoroughly enjoyable experience. I would rate it at about 5-8 hours worth of content (wasn't keeping track).",
            "review_score": "1"
        },
        {
            "review_text": "A point and click advenure with an assortment of solidly implemented puzzles, hidden items, friendly AIs and wierd aliens. Somewhat dytopian sc-fi setting. A few frustraiting puzzle (yes, I resorted to random clicking and using walkthroughs on a couple of occasions). Most of the puzzles will be of types you've seen before, just with a JULIA skin. There is an absolute ton of differnet interfaces to use with the various puzzles. The narrative feels high-minded and rather preachy. Unafthomable, mysical , secret ancient aliens from the beginning of time. Urgh. Anticlimactic ending.  I am interested to see what the developers come up with next.  I would recommned it to anyone looking for some brain exercise.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I am blown the heck away. I just finished. Give me a little time for it to sink in, and I might be able to write a more cogent review.",
            "review_score": "1"
        },
        {
            "review_text": "+ Decent story and characters. You'll actualy care about what's going on. + Great design, visuals and music. This project was loved by its developers. + Fantastic atmosphere of space exploration, protagonist is so alone and space is so vast and and full of misteries.  + Really original and fun interface. + Numerous interesting puzzles, not too repetative. + Nice balanced difficulty.  - Poor point and click elements, poor inventory system. - The game is linear, but sometimes it teases you about choices which do not matter. - You can see low budget here and there. - Buggy Mac version.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a gamer for over 20 years, not disclosing my age though :p I played FPS, MOBA, MMO, RTS, TBS, RPG... J.U.L.I.A gave me a feeling like never before, its simple, yet with enough depth to capture my imagination, I literally immersed into the character while playing it, without the presence of lore like the Starwars or Lord of the rings; character backstory like dragonage series; or top of the line graphics like skyrim.  By the end of the game, I was even so in sync with the character that I wanted to find out what happen to her.  Trust me, buy it, you will not regret it. and dontaskanymore ",
            "review_score": "1"
        },
        {
            "review_text": "Great game for everyone who loves sci-fi and science.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic adventure game. The puzzles are logical but tricky for the most part, and the story is also good. I'm trying to figure out why Steam didn't put this in my Recommendations Queue sooner, but I'm glad they finally did.   it's not a pixel-hunt and I found myself enjoying the puzzle completion, the environments, and figuring out what was going on with the story.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT game - was hooked immediately and haven't enjoyed a point and click sc-fi adventure game like this for a VERY long time!!! (old school adventure gamer)",
            "review_score": "1"
        },
        {
            "review_text": "A sci-fi point and click, puzzle, space exploration game with a solid storyline. I had to look up some walkthroughs because some of the puzzles were just bizarre and had unclear instructions, but overall an enjoyable experience. Definitely unlike any other game I've played. Pick it up on sale!",
            "review_score": "1"
        },
        {
            "review_text": "I have only played a bit so far, but this game is a lot of fun. There are a wide variety of puzzles, but so far nothing so hard as to make me tear my hair out. The story seems to flow very well, and there is a fair amount of mystery. Not what I would call a hard core game, but cetainly a fun game.  If you want a fun space based mystery, this is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "I think ultimately I would recommend this game. It has a great mix of puzzles and point and click adventure gaming. My biggest complaint is that Julia's and Mobot's voice acting are awful.",
            "review_score": "1"
        },
        {
            "review_text": "Great adventure! Very relaxing game, loved it from beginnig to end.",
            "review_score": "1"
        },
        {
            "review_text": "So far this looks like an interesting and creative game, although I am a little put off that it crashed an hour and a half into the game and forced me to start over.",
            "review_score": "1"
        },
        {
            "review_text": "Solid point and click sci-fi puzzler. Scrapes a recommendation but with two big caveats.  Seen Dr Who? Like K9? - you'll like this. Hate K9 with the firey passion of a thousand suns? You'll spend every minute of this game wishing varied and painful deaths on Mobot.  Completionist? One achievement is only avilable via the OST/Hintbook DLC that, at the time of writing, DOESN'T EXIST. Good luck keeping your OCD in check.  ",
            "review_score": "1"
        },
        {
            "review_text": "This was exactly what I wanted out of an adventure game. Everything was enjoyable to interact with. The art, voice acting, and overall story were great. The puzzles weren't too difficult and I never get off track very long. The experience reminded me how it felt to play games as a kid. Got 11 great hours of entertainment out of it - 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it and I thought it was worth the price. Here is a partial breakdown:  Art: Really fantastic throughout, except for the human character's animation which was a little weird.  Story: I wanted to find out more all the way up to the ending big reveals, at which point it lost me a little as I thought a few parts were overly derivative. That is hard to avoid in science fiction, but that is how I felt.  Characterization: Light. I think the main human's name was Rachel? She was an astrobiologist, was in cryo for some reason, and said the phrase 'horrible accident' at some point. Thats about all I can remember. I thought the AI character was condescending, although I liked the MoBot character. Not a whole lot of depth there though. I can't really remember any of them having arcs.  Gameplay: The hot-spot indentifier is a good idea, no pixel hunting at all basically. I thought the puzzles were fun and never got stuck, although at some points I thought they were a little silly for what they represented.  Overall: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game with a great story.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful adventure game which I highly recommend. I especially liked the mix of serenity and uneasiness at the same time. The atmosphere reminded me very much of The Dig. And the puzzles were great too.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, lonely, and eerie.   This game places you in the hot seat of a derelict space probe in order to question your morals. There are lots of other questions too.   Where have the rest of your crew gone? How long were you asleep anyway? What of your mission to discover new life?   Solve puzzles as astrobiologist Rachel Manners in order to progress and discover what really happened here. Some of these puzzles are annoyingly difficult. It's best to save often and keep notes of useful information.  Though Manners accepts some aspects of her situation way too calmly, the game explores a lot of human emotion.",
            "review_score": "1"
        },
        {
            "review_text": "I like it. Really like it. Adventure as it is.",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr: If you never played the original, pick it up.  Ps &amp; Cs: + Neat game + Very methodical + Unique - This is just a remake of the first one without telling you  I purchased the last one a bit ago and played it and loved it. So naturally I wanted to pick up the sequel. Pretty disapointed that this is just a remaster of that one. However, if you haven't played it, it's a fine game.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game. I hope they decide to do a part 2.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting point-and-click game with a very good variety of puzzles and game mechanics. There is at least one action sequence.",
            "review_score": "1"
        },
        {
            "review_text": "This game was really fun, although it's not too dynamic, the vistas are amazing, and the story line is definitely moving. If you are a sci-fi enthusiast and love adventure games this game is a good choice.",
            "review_score": "1"
        },
        {
            "review_text": "I am not an adventure type gamer, but I occasionaly do enjoy a puzzle. But.... this game is awesome, it's well writen, puzzles are doable, and since I am big scifi fan, the story really touched me on emotional level.  10/10 in Adventure/RPG games 10/10 in Indie/crowdfunding games 9/10 in all games",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely worth it. I bought this on sale, but it's worth full price, I think. I got around 5-6 hours from it in a playthrough. Some of the puzzles just take time and experimenting, but overall, it isn't very hard.  The environment was creepy when it needed to be (Xenophon, for example) did a good job of giving you clues, and was actually pretty immersive.  I don't want to say too much, as I could give away the story....but I think I'll just summarize the game as: fun, interesting puzzles, decent plot, decent voice acting, amazingly well drawn/rendered scenes, and was pretty immersive. I finished it in two sittings only because I had work to get done, else I'd have finished it all at once.  There's another game, J.U.L.I.A. Untold. I don't know where to find it, but it's a prequel...and I want it!",
            "review_score": "1"
        },
        {
            "review_text": "A nice modern point and click game. I loved the voice acting and the rich backdrops. The story was ok but one of my biggest gripes is that most of it has to be read. If you don't mind doing a lot of reading this is a pretty fun point and click game with about 4 main sections that take 1-1.5 hours each.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Point and Click adventure fun. Voice acting is terrific and the graphics are good given the resources.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Point and Click adventure fun. Voice acting is terrific and the graphics are good given the resources.",
            "review_score": "1"
        },
        {
            "review_text": "a very nice story, with cool graphics. I'ts a bit short, but I realy liked it...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, thrilling, interesting, well written, atmospheric. I love such games. They are by far my favorite types of games. I got sucked it immediately and played straight until I finished it. I enjoyed every bit (except for a few overly difficult bits, but I googled them)",
            "review_score": "1"
        },
        {
            "review_text": "WOW what an awesome piece of work  Only game that captivated me right from the start till 28 hours later  This game fried my brain trying to figure out the many clever puzzels but in a really good way.  I can highly recommend the journey.... cos that's what it is.  Who would have thought this point and click would tick most if not all the boxes you would expect from a AAA title ,Bar the fancy state of the art tek these days.   Surprised the hell out of me.  Good job Devs 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I bought this today and as soon as I started the game I was hooked for almost 3 hrs!! Beautiful, immersive, fascinating at every turn. Having a Great time so far in the game! The puzzles are not super Easy but they aren't crazy difficult either. The game developers seem to have figured out how to make it just hard enough to keep it entertaining. Not bored yet after 3 hrs :)",
            "review_score": "1"
        },
        {
            "review_text": "A awsome game that tells a great story, and has some good moral choices that make you really think upon the actions and outcomes of your decision.   Really loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Space Mystery/Adventure Game. Simplistic yet captivating.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game for the exploration lovers, especially in space, nice storytelling and excellent visionary music in-game. This is a peaceful game, and it is beautiful.  If you are fed up with the 'I-shoot-everything-I-see' games and want to dream a little, trust the robot J.U.L.I.A with your life and get ready for the trip up to space.",
            "review_score": "1"
        },
        {
            "review_text": "Decent graphics, nice puzzle solving. The plot was well thought out. Most puzzles could be figured out. Had to go online for a few hints, especially the encounter inside the submarine. Not quite up to the standards of the rest of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Great casual puzzle game that runs well on Linux.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game enough to anyone who enjoys story and/or puzzles. Jesus christ it's amazing. That's all I can really say on it without spoiling.",
            "review_score": "1"
        },
        {
            "review_text": "If you're running Linux, don't buy this one.  Too many glitches made it literally unplayable on my old laptop, and the new one won't even start it.",
            "review_score": "-1"
        },
        {
            "review_text": "This isn't a bad game, and I played it all the way through so that must say something. With that said, you can see the ending coming from a mile away, some of the puzzles are frustratingly silly, and the dialogue is incredibly corny at times. If you get it on sale for under $10, I'd say go for it. Otherwise it's probably not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "JULIA has a theme right up my alley; unfortunately, the execution of that theme is uneven and mediocre. The technobabble ranges from dubious to face-palm-inducing; the out-of-nowhere mood swings in the dialogue could cause whiplash; and several of the puzzle UIs were impenetrable.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad voice acting, poor dialog and writing(Sole surviving crew member on an interstellar expedition wakes and the only thing she can say when she learns everyone else is dead is, 'Well, that planet looks boring.'), little in the way of animation beyond FMV scene transitions. Very little in the way of interactivity.",
            "review_score": "-1"
        },
        {
            "review_text": "No saving. In 2016.  Need anything more be said?  (This coming from the guy who just lost *his entire game* due to his battery dying.)  ----  Edit: Okay, to be fair, it's quite a cute game, and I mostly loved it right up until I lost everything ... but:  1. A lot of the interface has *no* explanation (a few windows near the beginning do pop up little help-screens, but this stops happening shortly ... and this game is constantly throwing new interfaces at you); in many of the puzzles, I *never* figured out how you were *supposed* to interact with the interface, and simply persisted through spam-clicking and trial-and-error. (The ‘language translation’ puzzle, anyone? Egads.)  2. The parts that *are* explained, are difficult to interact with (why on earth isn't there a *hotkey* for ‘highlight interactable elements?’ I really have to mouse up to the top corner, every single frame, every single location? Jesus.)  3. Again: No saving. Can't speak as to how the game's storyline holds up towards the end, because there's no way I'm trudging back through every intervening story-element at a snail's pace, to find out. Again: 2016, thought we'd solved this in the 70s.",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Overall, the story was kind of weak. I would reccommend it if you like point and click puzzle games, but if you are looking for a unique scifi narrative this isn't it.",
            "review_score": "-1"
        }
    ]
}