{
    "app_id": 257630,
    "name": "Blast Em!",
    "release_date": "2014-01-22",
    "developer": [
        "Xiotex Studios Ltd"
    ],
    "publisher": [
        "Xiotex Studios Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Shoot 'Em Up"
    ],
    "achievements": 23,
    "positive_ratings": 134,
    "negative_ratings": 152,
    "price": 0.79,
    "description": "Protect the universe from the evil Alien robots terror-bent on eliminating the Earth and all of Humanity! Take control of the ship and blast the hell out of anything that moves and if it doesn’t move – blast it anyway to be sure. Collect coins to get points and use those points to get power-ups.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/257630/header.jpg?t=1481109279",
    "minimum_requirements": "OS: Windows XP Processor: 500 MHz Memory: 1 GB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Perfect game to kill a couple hours on. It's like playing Galaga and Space Invadors when I was a kid.",
            "review_score": "1"
        },
        {
            "review_text": "Pro: Retro style Source code available - not sure who would use it but still Steam chieves  Fun SHUMP Inexpensive Low system spec  Con: No steam cards Yet another SHUMP. If you like them you probably have plenty of them already that are as good as this is. Several major bugs - see other revews for random death No demo  Neutral: $11 CDN for source code = 3x price of the game   Overall: 5/10 +1 price -1 no card &amp; other issues +1 source code = 6/10 Thumbs sideways  I actually like it, so thumbs up for me. That said if you have 50+ other SHUMPs, don't bother.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great fun time-killing game. I don't know why there are so many negative reviews about this. I know, I know, the price is a bit high. Even though, it has great gameplay, great music, very challenging, the auto-attack system helps you a lot, it gets frustrating after sometime when you get very high scores, in the 1.5 hours I spent, I can say it was worth it. The achievements are also good and challenging but I don't think you should really buy it at 2,99 $, wait for a small sale or just get a coupon (Just like I did).",
            "review_score": "1"
        },
        {
            "review_text": "Its a cool little game. it's not especially perfect or anything, but its very good and well executed as a bullet hell. it's incredibly standard really, so don't expect much. definatley worth the price.  COMPLETIONIST'S NOTE: Not too bad, give it a shot",
            "review_score": "1"
        },
        {
            "review_text": "Its a cool little game. it's not especially perfect or anything, but its very good and well executed as a bullet hell. it's incredibly standard really, so don't expect much. definatley worth the price.  COMPLETIONIST'S NOTE: Not too bad, give it a shot",
            "review_score": "1"
        },
        {
            "review_text": "Amazing time wasting game  worth the 3 bucks  10\\10",
            "review_score": "1"
        },
        {
            "review_text": "Blast Em!,  My review of this game is that i feel it's a nice simple game, which is also refleshing and pretty enjoyable.  I've also noticed that since playing it my ability to priortize concentration and reflex's and reaction timing as improved, (you subconscious feel it improving as the number of enemies appear the longer you stay in the game).  Key Points :- Improvment of Concentration. (Able to ignore movement in background image).  Reaction Timing. (improves split second thinking on which you can touch and cant touch).   Reflexes / Improved Motor Control. (lowers the chance of you moving the mouse to much), (i.e. moving your mouse just a little tomuch upwards and hitting an enemy).  I've also noticed that since playing this my reaction timing as improved in games like CoD or Payday. (i'm better able to see slight movement on screen, and improved chances of getting headshots).  As also improved reflexes for games like Dont starve. where you need to hit fast moving monsters before they hit you. (as they are a pain in the backside to hit before they've managed to hit you at least twice).  So totally worth the money paid to get this game. I hope to see more work from the devs, maybe one day they will make a game thats as good as the R-type games.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a great timekiller! Simple game mechanics and has a great retro-feel to it :)",
            "review_score": "1"
        },
        {
            "review_text": "very very enjoyable and the only probable i had was that there was no full screen mode and that is only nit pick",
            "review_score": "1"
        },
        {
            "review_text": "Little. Fun. Space. Addictive. Need more? 9/10  Down: - Annoying music sometimes, and background",
            "review_score": "1"
        },
        {
            "review_text": "I do not know how the bugs escaped mention in the other reviews I read but I feel compelled to write this as a warning. At least some players experience a bug where they die when they are hit by nothing. This happens quite frequently, and perhaps accounts for between 20 and 50 percent of all deaths to those experiencing it. Perhaps most people do not have this issue, though everyone I know who owns it does.   I don't think I could recommend the game even if it worked as intended, mostly because the odd scoring system renders most of the gameplay meaningless.. You will spend the first few minutes mostly breaking even with very little score progress until the one enemy that is actually worth any score shows up. Your score then flies up for a few minutes until that enemy stops spawning for a while and then you wait for it to return.   If you do happen to experience that bug though, paired with the way the game scores, you can unfortunately expect to end most games with a very low score, prior to that enemy spawning. This is of particular interest to achievement hunters because the game may not be such a quick 100% if you have this issue. Dying that early for no reason can make a very long task of the 'cumulative score' type achievements present in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Gives me a configuration screen for inputs and then once I'm in the game, doesn't accept inputs from either. So, completely unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Using mouse Simply dodge, shoot, avoid. Or simply using ones intelligence, AVOID AVOID AVOID.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks a lot more interesting than it really is. Premise: Shoot things with an uncontrollable forward laser, collect coins, spend coins (score) on powerups that only last a little while, suffer from too-sensitive controls and a lack of variety, repeat.  If you want a shooter, go find Raiden 2 somewhere on the internet.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing really special about this game. It's a generic Shoot'Em Up game with no story. This game is good when you are bored and have nothing to do, maybe. Also the game gets boring pretty fast ( at least for me ). Nothing really attracted me to this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game features a constant, headache inducing camera shake that makes the game utterly unplayable. Thankfully, one of the three configuration options is a screen shake slider. After disabling that particular feature, the game is unexceptional. There are a million side scrolling shooters on the market, and no reason to play this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Where is the 'eh...' recommendation? I am a huge fan of shmups. Normally they fall into two categories: Pattern recognition or Luck. This game is really neither... There is no end that I can tell. You just go until you die. I picked it up for something like 40 cents, so I got my monies worth. But at full price? No way!",
            "review_score": "-1"
        },
        {
            "review_text": "Arcade-style games and side-scrollers can still be great games when executed properly, but this game misses the mark. What I believe is the biggest flaw about this game, aside from lack of content and substance, is the controls.  I was never able to re-map my controls from the mouse to the keyboard. There was no help in doing so, despite options to change the controls in the launcher. Combined with a clunky interface and minimalist gameplay, there were no shining elements that really make this game stand out, or even meet the par of similar games in this genre.  As another review pointed out, this game looks, feels, and plays like somebody's first game design. And for that reason and many others, I don't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "i just realized this was worth £2 most free FLASH games are better than this how can you sell this pacman has more story and purpose than this game does",
            "review_score": "-1"
        },
        {
            "review_text": "As the game stands, I would not recommend it.   Even for the achievement hunters out there, it is tedious to try to gain all of these.  My suggestions:  Stop making the game about 'how difficult it is' and the '34 second life expectancy', because as it stands, the games fun lasts for about 34 seconds.  Upgrades: 2 ways to do this. 1. Use the coins at the end to buy upgrades which last 1 round. 2. Upgrade the ship each time you achieve a new rank, gaining an extra life and better weapons.  Make enemies a little more exciting, it feels like i'm playing space invaders on LSD.  Bosses? Perhaps there are some... but I haven't seen any.  Different backgrounds to mix it up a bit.  Different ship skins which can be unlocked.  Quests? An option that will take a bit more work, but having quests usually makes a game a little more interesting.  As it stands, it is pretty mindless.",
            "review_score": "-1"
        }
    ]
}