{
    "app_id": 257710,
    "name": "Max Gentlemen",
    "release_date": "2014-08-21",
    "developer": [
        "The Men Who Wear Many Hats"
    ],
    "publisher": [
        "The Men Who Wear Many Hats"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Cross-Platform Multiplayer",
        "Full controller support"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 805,
    "negative_ratings": 117,
    "price": 0.0,
    "description": "Max Gentlemen is an arcade-style extreme manners simulator about stacking hats.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/257710/header.jpg?t=1447358945",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows XP SP2 Processeur : 1 GHz Mémoire vive : 512 MB de mémoire DirectX : Version 9.0c Espace disque : 600 MB d'espace disque disponible",
    "recommended_requirements": "Recommandée : Système d'exploitation : Windows 7 Processeur : 1 GHz Mémoire vive : 1 GB de mémoire DirectX : Version 9.0c Espace disque : 600 MB d'espace disque disponible",
    "reviews": [
        {
            "review_text": "Must have for all TF2 fans.",
            "review_score": "1"
        },
        {
            "review_text": "Got called a lobcock fishmonger.  Wore more fedoras than the internet AT ONE TIME.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best hat simulator since Team Fortress 2.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game! Honestly a lot more entertaining than I frist thought it would be. The biggest downside for me is that there are only 2 game modes. So it can get kind of boring after a while. But overall, its a pretty well done game and you can't beat the price.",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded it for the novelty and played to unlock all the hats. You're honestly better off spending your time elsewhere. I can't speak for the paid content but the 2 games on offer are shallow and repetitive.",
            "review_score": "-1"
        },
        {
            "review_text": "TF3 Confirmed.",
            "review_score": "1"
        },
        {
            "review_text": "very strange little game. easy to learn controls and very fun to play with friends or try to beat your best score. This game is very funny at times. If you looking for a good time to just relax and play with a friend this is a game worth at least trying. and its free so 10/10!",
            "review_score": "1"
        },
        {
            "review_text": " I never knew stacking hats could be this entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "what a nice game. everyone should try this out..",
            "review_score": "1"
        },
        {
            "review_text": "Gentleman's version of TF2       Smashing.",
            "review_score": "1"
        },
        {
            "review_text": "Just download it. You'll see.",
            "review_score": "1"
        },
        {
            "review_text": "Who doesnt like the euphoric idea about stacking hats",
            "review_score": "1"
        },
        {
            "review_text": "So, you ever want TF3? Want even more hats? Here it is, guys. So basically, this game is just about stacking hats. You can play as different characters, one being Octodad. 7/5",
            "review_score": "1"
        },
        {
            "review_text": "Ultimate and better hat simulator than Team Fortress 2. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games on steam.",
            "review_score": "1"
        },
        {
            "review_text": "It's like tf2 without guns.  -IGN",
            "review_score": "1"
        },
        {
            "review_text": "A hilariously simple and fun game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Without paying the game you just have two levels and two characters, and the game is boring. :/",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been way better. 3/10  Dont get the game spend your time somewhere else. I got it and i thought you could play as multiple characters because they had lots of characters in the trailer. No you cant. You have to buy a DLC which is a ripoff. What you get for the DLC you ask. Maybe 3 characters and a new map. RIPOFF WRITTEN ALL OVER IT!! I would probably jump off a cliff into freezing cold water insteaded of playing this! WASTE OF TIME DONT GET!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is for you to have a laugh with your mates. This isn't a game to get competitive and play for hours with no end.",
            "review_score": "-1"
        },
        {
            "review_text": "this is just a big rip-off of valves popular tf2",
            "review_score": "1"
        },
        {
            "review_text": "Gives men the idea that if they don't enjoy this, they are somehow less manly. This wouldn't be so bad if the game worked.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a good laugh. Great for gentlemen enthusiasts everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "If the developers took all the fps mechanic out of team fortress 2 and just added more hats, then yes, this is team fortress 3.",
            "review_score": "1"
        },
        {
            "review_text": "Oh look, a game about me!",
            "review_score": "1"
        },
        {
            "review_text": "Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "TF2 look out, with hats AND drinking this is the most fun a Gentleman could have. Tally ho old chap (and yes i am a brittish citizen so i can talk like this!)",
            "review_score": "1"
        },
        {
            "review_text": "Boring and there are way better free games out there.",
            "review_score": "-1"
        },
        {
            "review_text": "This is quite possibly...the gayest game I have ever played in my entire life.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "boring and repetitive",
            "review_score": "-1"
        },
        {
            "review_text": "Team Fortress 3",
            "review_score": "1"
        },
        {
            "review_text": "Fun for 30 seconds.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, Its more likely a flash game than a steam game and without buying anything its just a two levels and two characters. Mouse is useless and in bigger stack of hats you can't react fast enough for dodging birds because you have to select a specific hat in a short time with one-by-one movement (even shift 'run' is not enough). In short, the control is stiff and odd.  Have a try, have a play and have your opinion on it. At least it cost you nothing but time.",
            "review_score": "-1"
        },
        {
            "review_text": "Turns my D*ck to a V*gina every ♥♥♥♥ing round I play.  Recommend for every Homosexual person on the planet, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "There not a lot of games that break the sound barrier of crapiness, this one just broke the light speed barrier, thats how awful it is. This game looks, feels, sounds and looks, like an iPhone game you might play once or twice on the way back home from work, on the train, to try and avoid the creepy fat dude that is staring at you from across your sit. thats the only purpose of this game, to be used in order of getting out of akward situations. it is sure not wothy being called a desktop game. the feeling of a scam game reeks from this so called game, by that i mean that the greedy owner of this company told himself, while sitting on the crapper... 'hmmm, i have an idea!!! lets make the simplest game ever and cover it up with retro graphics (because retro is in, you know Hipsters and what not), make the graphics as simple as possibly, and offer this game for FREE. since people are soulless consumers who like thing free, they will download it, and since people are stupid they will draw some enjoinment from this, and because people are spinless creatures of habit they will have to buy the added DLC to this game, EASY MONEY, lets start making the shitiest game made in the last sevral decades'.   So i am giving this game: 0 out of 10.  Pros: NONE. Cons: Insult to human inteligence.  DONT DOWNLOAD THIS GAME ITS A WASTE OF TIME AND YOUR MENTAL HEALTH.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont say right like this game i dont like it hats stuff i hate",
            "review_score": "-1"
        },
        {
            "review_text": "Hats Hats AND MORE HATS!! If you love hats and can't get enough hats in TF2, you'll love this addictive game! XD",
            "review_score": "1"
        },
        {
            "review_text": "I prefer this game than life. I feel so professional while I play this, so... classy.",
            "review_score": "1"
        },
        {
            "review_text": "the new team fortress models are looking good. ",
            "review_score": "1"
        },
        {
            "review_text": "this game fun!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and classy i would recomend it to all you dapper gentleman out there and to all the ladies as well",
            "review_score": "1"
        },
        {
            "review_text": "Fun game nice graphics, addictive, good time waster. Takes a while to get used to it but after that it's fun. Already beat gold challenge without beating bronze and silver! Mlg pro tip use mouse and space. Fastest way to switch hats plus you can dodge things easier by lining the line up with the obstacle",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazballs it has everything a person could want, hats and hats and moustaches great game purple/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Much hats. Much like TF2. Amazing graphics. Wow.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a hilarious game with a lot of hats and root beer then congrats your seach is over",
            "review_score": "1"
        },
        {
            "review_text": "Stacked hats and observed good manners 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I expected to see a game where you stack up hats like a madman. What I GOT, was entirely different, its a nice time waster and fun against friends if your bored and need a pick me up. Its quite silly as they exagerate alot.",
            "review_score": "1"
        },
        {
            "review_text": "Most gentlemanly way possible to settle a dispute.",
            "review_score": "1"
        },
        {
            "review_text": "Team FOrtress 3 is pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "Feels and looks like a flash game from newgrounds, it's great, give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Another submission to the oversaturated genre of competitive hat-stacking games",
            "review_score": "1"
        },
        {
            "review_text": "really really fun and addictive 9.5",
            "review_score": "1"
        },
        {
            "review_text": "Even though from the little time i've played, Max Gentelman is a great, funny game. I recommend it to anyone who likes hats.",
            "review_score": "1"
        },
        {
            "review_text": "If you love stacking and hats (I mean this is like 2D tf2) you will love this game",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Like TF2 with birds.",
            "review_score": "1"
        },
        {
            "review_text": "This is indeed the epitome of Maximum Gentlemanliness. As a Gentleman Scholar, I did indeed find my vigor and vitality increased upon playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "good game a bit of a laugh",
            "review_score": "1"
        },
        {
            "review_text": "this game is so funny :D you can play with your friend in 1 PC/Laptop ",
            "review_score": "1"
        },
        {
            "review_text": "Like hats? Like quick games? Like pseudo-Victorian steampunk settings filled with ridiculousness? Like FREE GAMES? Yeah, Max Gentlemen has got all of that. A little disappointed the free base game only comes with two white dudes as the basic playable characters but there are others in the DLC packs. Fun, fairly easy to get a handle on, but challenging. ABSOULTELY worth the price of free, and I'm considering the DLC to boot.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game but really needs online mutliplayer so everyone can play togther. I think that would be alot better.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game 7/10 stars",
            "review_score": "1"
        },
        {
            "review_text": "Max Gentlemen is Fantastic! Coupled with its unique style, charm and above all else, its addictive fun! Go get it, it's free man! My hats are off to the developer ... or on ... or ... whatever!?!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would stack agian.",
            "review_score": "1"
        },
        {
            "review_text": "HATS off Best game ever 10/10 beers",
            "review_score": "1"
        },
        {
            "review_text": "I normally wouldnt play a game like this but theres a few reasons i like this game  1. It's so easy and stupid that its fun.  2. Its a game about hats what type of person dosnt like hats?  3. Its so mannly.  2 mannly 4 u",
            "review_score": "1"
        },
        {
            "review_text": "It's a game about stacking hats, who wouldn't play it? 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Hats. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "Too much Gentle. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "ITS A MUST AVE AND ITS FREE 19i032180982149137431984913581039481093481398409 stars",
            "review_score": "1"
        },
        {
            "review_text": "TF2 simulator hats out of ducks watching you from the door. This review was sponsored by Aflak.",
            "review_score": "1"
        },
        {
            "review_text": "A true competitor to for Hat Simulator of the year. Also it’s a silly game that's free.",
            "review_score": "1"
        },
        {
            "review_text": "Most gentlemanly way possible to settle a dispute.",
            "review_score": "1"
        },
        {
            "review_text": "It's... perfect!",
            "review_score": "1"
        },
        {
            "review_text": "A game with hattitude.  10/10 best game.",
            "review_score": "1"
        },
        {
            "review_text": "All the hats a gentleman could desire. All of them.",
            "review_score": "1"
        },
        {
            "review_text": "Very Funny and Entertaining ",
            "review_score": "1"
        },
        {
            "review_text": "A silly, dumb game, fun to pass a bit of time. Not much else, though. Not sure if it's worth it to get the DLC packs, it becomes less funny in a few minutes.",
            "review_score": "1"
        },
        {
            "review_text": "a true gentelmen would play this game  #1000/10",
            "review_score": "1"
        }
    ]
}