{
    "app_id": 257750,
    "name": "Bloody Trapland",
    "release_date": "2013-11-18",
    "developer": [
        "2Play"
    ],
    "publisher": [
        "2Play"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Co-op",
        "Indie"
    ],
    "achievements": 29,
    "positive_ratings": 2489,
    "negative_ratings": 497,
    "price": 6.99,
    "description": "Bloody Trapland is a fast-paced multiplayer platformer where the levels are filled with dozens of dangerous traps and tricky jumps that stand in your way! Play co-op with your friends or take on the challenges on your own. With support for up to 4 players at once, local and/or online.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/257750/header.jpg?t=1547303350",
    "minimum_requirements": "OS: Windows XP/Vista/7 (32- or 64-bit) Processor: 1.6 Ghz Memory: 1 GB RAM Graphics: NVIDIA® GeForce 5+ ATI Radeon R300+ DirectX: Version 9.0 Network: Broadband Internet connection Storage: 500 MB available space Additional Notes: Compatible with Keyboard and/or up too 4 Xbox 360 controllers, XNA 4.0 and .NET 3.5 required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Whats Better Than Raging? Raging With Your Friends",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, especially in online co-op or local with friends. I love it! This game is worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "This game is bloody hard. Pun intended.  I spawned and died by a stray bullet three times in a row. 10/10 would paint scene red again.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would kill self again  Gift it to someone you hate basically",
            "review_score": "1"
        },
        {
            "review_text": "I've almost passed a level until my friend jumped on my head, killing me then getting killed themselves by a turret  ✔ Nominated for: The 'I'm Uninstalling' Award",
            "review_score": "1"
        },
        {
            "review_text": "One of the most challenging yet fun to play, if you don't rage easily of course, platformer games. It's even more thrilling, or enraging, to play on multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Rage Quit Simulator 2016  This game has more blood than an average Tarantino movie, and can f*ck your mind up easily. Levels are sometimes so hard that you will just get tired and stop playing. But if you convince a few friends to play together, this game is actually fun. Mostly because you can kill your friends prevent them from complete the level. The menu is a bit messy, for me finding how to play multiplayer was a pain, joining through Steam doesn't work. Overall it's a nice game, if you see it on discount it's definetely worths to buy, but don't play it alone.",
            "review_score": "1"
        },
        {
            "review_text": "I just had to stop playing this to write a review. And I'm not doing those very often, let alone getting such urgent impulse to actually close the game for it. But this game deserves it... I guess. Well, I'm just an hour in, reached only W3-1 but oh boy, it gives me some sweats – sweats of joy! Never have I played such a challenging yet achievable plattformer. Admittedly it's not my preferred genre of choice on my computer, and console gamers could eventually prove me otherwise, but I'm having a blast!  The gameplay is as easy as it gets – jump, run, duck, avoid deadly objects, just don't die reaching the exit. One lvl is merely one screen, no scrolling. One world has ten screens (plus some bonus stages), as far as I can tell, I'm in the last lvl of the 2nd world. For the adventure mode that is. There are also a race and a deathmatch mode which are obviously multiplayer modes. I've only tried adventure so far, as I'm testing candidates for the next local gaming party, but lacking a buddy right now. And this one looks very promising although you might gather a more experienced crowd. Now, it is hard as stated before and on entering a lvl you might think “how I'm ever going to make this?!”. But you are! It may take a while though*g* It's always doable, never unfair. It takes some plattfoming skill and timing. Controls are precise and responsive. Levels are riddled with – well – traps... where some of those aren't visible when you enter a new screen. But you won't succeed on your first attempt anyway... so. The graphics are – as you can see on the screenshots – retro styled, inspired by the 16 bit era. They're not particularly unique, but by no means dull or ugly. The gore effect which covers the environment with more and more blood as you're being constantly crushed by the fist of doom or saw blade of horror gives a weird sense of accomplishment. It's got a great soundtrack, I don't like the soundeffects though. Often they don't fit or sound awfully generic.  I definitely recommend Bloody Trapland for solo players and I will vote for it on the next game night with friends.",
            "review_score": "1"
        },
        {
            "review_text": " Review on Bloody Trapland   Written By: Rias Gremory    Pros",
            "review_score": "1"
        },
        {
            "review_text": " If you are a calm easy going gamer that doesn't like to rage quit then this is totally for you.",
            "review_score": "1"
        },
        {
            "review_text": "Do your have 'friends'? Play Co op to fix that!   F**K YOU/10  Would punch my (x) friend again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth the money spent, not only for the gore and cartoon violence, but for the non-stop laughs.The game not only tests friendships but also makes you question and get the answer to 'Why are we friends?' You're willing to dodge a bullet (or lead one to me), send me flying into spikes, jump on my head to kill me, all so we can progress through the adventure. Best Friends Ever.",
            "review_score": "1"
        },
        {
            "review_text": "Its a rage game with co op and friendly fire. Enough said. I don't know why I play this but I do. Its one of the games that you absolutely hate but keep playing for whatever reason.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really fun to play multiplayer! (y)",
            "review_score": "1"
        },
        {
            "review_text": "better than cat mario",
            "review_score": "1"
        },
        {
            "review_text": "8.2/10",
            "review_score": "1"
        },
        {
            "review_text": "Glad this had finally released onto Steam. Nice and wonderful game to play with a group of friends. Not an easy game, has different game mode options, and is definitely one to make you frustrated.   Creating a blood splatted landscape is rather creative in it's own way, quite literally a blast. Just a splash of red and you're on your way to painting a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Chaos, Raging and Frustration all rolled into one highly satisfying platformer!",
            "review_score": "1"
        },
        {
            "review_text": "Gorey little platforming game. Graphic wise it is alright but not the best. Puzzles can be tough to get through, but definitely worth while of fun if you have friends to play along with. Not really fun soloing. You are going to want to use a controller. Highly suggest it if possible. Can be a bit difficult in some levels with just a keyboard. Overall, it is good to play time to time, but it is not one of those games you will keep playing a lot. I give it a rating of 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Engaging, frustrating fun! It's a simple platformer where you have to get past the traps to the exit of the screen, similar to the Meat Boy franchise. You have endless lives and just throw yourself at the traps until you can get through. You can play up to 4 players on the same map, but there is little you can do to help each other. Instead, if one of you beats the level, you all advance to the next level together. So sometimes it can end up as a bit of a race rather than cooperation.  Fun in short doses. Can be too frustrating if you play several hours in one sitting.",
            "review_score": "1"
        },
        {
            "review_text": "Whatever Human Being Made This Game Had One ♥♥♥♥ed Up Child Hood.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a challenging puzzle platforming co-op game. Yet it is a very interesting and fun platformer when you play it with friends. For only $10 this game is worth it. If you need a reference to what type a game this is it really is just Super Meat Boy except with multiplayer. This game also has 3 different modes. Adventure, Race, &amp; Deathmatch. So if you would like to have a good 'ol challenge with some friends to back you up... this is your game. Trust me when you play with multiplayer and you use skype or steam private voice chat, you will have a LOT of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody Trapland is a challenging 2D Platformer with tight controls. It's plays like games as Super Meat Boy or Electronic Super Joy. Where you need to do a lot of trial and error to complete short levels. The only downside this game has is that the art style isn't as great. Other then that it's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This rage-inducing, high pressure rising, aggrivating torturing nightmare called a game, is the most addicting, hard, fun, entertaining old school platform out there. Multiplayer is funny as anything you'll ever see, screwing your friends over by jumping on them, ultimatley killing them. Spending hours getting past a certain level, knowing that even harder obstacles are to come. The name lives up to expectation. It comes to the point where the only color is red. Don't get it because of my word, get it for your entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "Great Gaming, Great challenges and Great co-op fun In this game you can challenge the level,s  6 worlds and more, 100+ levels Have fun with it :p",
            "review_score": "1"
        },
        {
            "review_text": "First off, the game has an amazing soundtrack in my opinion. Try looking up World 3's theme on Youtube if you want. It's by far my favorite. Now, onto more gameplay-related things:  A possible friendship destroyer if you've got that friend who loves to jump on your head and then commit suicide at the end of the level that took you 30 minutes to beat.  Even if you lack any friends to play it with, there's still usually one or two unlocked rooms you can join and make some more friends in. 10 people who I am now friends with on Steam came from random open servers in this game.   The way I see it, this can either be classified as one of three things: an unfair platformer (troll blocks), an impossible platformer (speed run challenges in race mode that are far more difficult than they should be), or a good time (watching friends rage out).   If you're an achievement hunter, this game might not be for you because of the speed run challenges. They're all possible (personal experience), but you best be willing to devote a lot of time and accept a lot of failure to do so.   There's one or two levels that have a bug or two in them, but the game has over 60 campaign levels and 60 more race levels, so the vast majority of levels are bug-free. Some of them even have extremely cheap tactics to complete if you have a friend.  Overall, this game is definitely one of my favorite platformers, but it's no walk in the park on the first playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game if you are playing with people, but it glitches out quite a bit and sometimes when online you will get dropped.",
            "review_score": "1"
        },
        {
            "review_text": "If I had a sware box for the amount of rageful deaths I had I would be rich.............  In a nutshell if you move too much you die. You jump wrong you die. If you crouch wrong you die. if you die you die again.  average death rate on most maps 50 - 1000000000000000000000000000000000000000 times   0-50 you laugh it if anymore thats the swares coming in.   play with friends sware as a group  only downside   awkward server set up",
            "review_score": "1"
        },
        {
            "review_text": "Bloody cats",
            "review_score": "1"
        },
        {
            "review_text": "Gorey little platforming game. Graphic wise it is alright but not the best. Puzzles can be tough to get through, but definitely worth while of fun if you have friends to play along with. Not really fun soloing. You are going to want to use a controller. Highly suggest it if possible. Can be a bit difficult in some levels with just a keyboard. Overall, it is good to play time to time, but it is not one of those games you will keep playing a lot. I give it a rating of 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "It is a tipical contept of 'easy to learn hard to master'. If you ever played the original super mario game you already know the game mechanics. The only minor differences are in this game there are neither mushrooms nor coins to collect. Although these are replaced with creative homicidal traps around the map. Now if you ever see a game with 'multiplayer or Coop' tags you immediately think oh this is a fun game to play with friends. You guessed wrong. Playing over 1 hour with my degenerate 'friends' was enough to realise Super mario's bloopers or hammer brothers are kind and cuddly.  You don't play this game because it is fun or entertanining. It is the complete opposite of it.   5/7 would recommend as an official e-sports game.",
            "review_score": "1"
        },
        {
            "review_text": "got some friends you want to annoy / lose? dont want to buy a nintendo console for mario party or kart? get this game, out friendly fire on and watch the sparks fly.  games hard if you dont think logically, if you apply logic and observation to the game with some patience you will beat it",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun ",
            "review_score": "1"
        },
        {
            "review_text": "an awesome game its worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "Best platterformer I've ever played. No, that was not a mistake. Your butt gets handed to you on a golden platter. A challenging one, but it whacks time in the face and that's not covering all the gamemodes: Race, Adventure and Deathmatch. If you're a noob to the platforming scene, try out Race. If you're already good enough at platformers, then try out Adventure. If you're so bored of the games and you're thinking the freakin Call of Doody, then settle down and play some Deathmatch. Countless hours of fun, cats, bloodsplatters and rage screams. I've had fun with this one.  9.8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and addicting. Fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Broke my keyboard while playing it. 11/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Broke my keyboard while playing it. 11/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game BUY IT IT PLAYS CO OP",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would buy again. Great game for what it is. played it with my ♥♥♥♥♥♥♥ friends and could not stop laughing",
            "review_score": "1"
        },
        {
            "review_text": "Well ive played this game with my friends for a while now. And I can safely say that after you've played this you'll want to kill yourself AND all of your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you are able to control your self and not smash your computer in rage.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun with friends, I can't even imagine playing this alone, that must be terrible. There's nothing like overcoming a challenge together though. (Or giving up and letting your partner finish the level instead.)",
            "review_score": "1"
        },
        {
            "review_text": "Got the four pack because it looked fun but was a waste of time a money to try to at least have some fun. Multiplayer is busted and it's hard going into games. Stay away, even it have good reviews because I call bull crap I am tried of getting it to work.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls are decent.  The levels are tricky but that's the point.  The levels are relatively short, which works for them. The music, while not bad, gets repeditive immediately. Standard for games like this. The level editor does not seem to work very well. Locks up very fast. The downloadable comunity levels do not seem to exist. This may be part of the last point.  I would say do not buy this unless it is on a really good sale.  The $1.99 I paid seems right, if a bit steep. This game seems like it wants to be a cutesy version of N+. It has most of the parts neccessary. But just seems to not come together well. I wish I could be more specific than that. But I can't.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you love painting the world in blood? Than this game is for you! It's super fun, and the bigger the party the better! Get all 4 cats going and its laughter galore.   Caution: In some people it can cause extreme saltyness, please lower the salt count in your blood, and just enjoy the game for the crazy antics, and awesome 'impossible' platformer that it is.   10/10 Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Great and funny game to play with your friends and it's also challenging which makes it fun so i recommend to buy this game. Nothing like blood and gore and friendship to overcome the challenges that awaits you.",
            "review_score": "1"
        },
        {
            "review_text": "so fustrating, but so fun.",
            "review_score": "1"
        },
        {
            "review_text": "Bloddy Trapland. Its a game about being a cat that does kinda hard courses to go to the next level. I would recommend this game, but there are just a lot of features that are missing. When you join a multiplayer game, you cant choose the color of your cat. Now I know that might seem kinda ridiculous to complain about, but its the little things that add up. When someone completes a level in multiplayer, you have to go with them, even if you are at the start. That doesn't make any sense to me. And the servers are terrible. Whatever server I join I always time out. And that isn't my interent. If you want an actual hard platformer, get Super Meat Boy. Don't get this game. It isn't a replacement.",
            "review_score": "-1"
        },
        {
            "review_text": "Guys i purchased the game yesterday and i really like it but can you help me get on multiplayer and play with my friends. For some reaseon it doesnt let me play mulitplayer :( Add me and text me if you have fix thank you ",
            "review_score": "1"
        },
        {
            "review_text": "super meat boy had a daughter. and she hates us.",
            "review_score": "1"
        },
        {
            "review_text": "May have only played a few hours of the game but its fun and challaging puzzeles",
            "review_score": "1"
        },
        {
            "review_text": "it was bad",
            "review_score": "1"
        },
        {
            "review_text": "you will have a bloody good time! heh heh...       You get it?",
            "review_score": "1"
        },
        {
            "review_text": "This is a Bloody fine game",
            "review_score": "1"
        },
        {
            "review_text": "Start.... Hard..... Light Jumps (with that bloody axe above you and some bullets are coming to your damn head)...... Death..... Rage...... More Light Jump Attempts..... Blood...... Try more and more..... ALT+F4...... Punch your computer parts...... (Different selections can be made) Buy new parts to replace your damaged ones.....  Start Again.....   If you buy this game you are destined to get mad everytime you play it.....",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blast to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "The instant I tried this high-octane thrillride I knew that this was it. This was the coming of Cancer Jesus. 0/10 would pull hair out again.",
            "review_score": "1"
        },
        {
            "review_text": "What the .... I can't play this game. It says i have invalid CD-Key.",
            "review_score": "-1"
        },
        {
            "review_text": "EN: My game stops start ... I expected an update hoping that after this , the game will go , but ... I asked for my money back , but nothing ... by google translate RO: Jocul meu se opreste la pornire.. Am asteptat un update crezand ca dupa acesta jocul va pornii, dar nu.. Am intrebat daca imi pot cere banii inapoi, dar nimic...",
            "review_score": "-1"
        },
        {
            "review_text": "9/11 fu-ck this game, love it. Play with a friend, ruin the friendship. 9/11 would try again.",
            "review_score": "1"
        },
        {
            "review_text": "'♥♥♥♥, ♥♥♥♥, AAAAAAAAAAAAHHHHHH, OOOOO MMYYYYY GOOOOOODDDDDDDDDD.' Is what you'll be saying if you buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lose your friends simulator. 9/10 would lose friends again",
            "review_score": "1"
        },
        {
            "review_text": "Really tried to like it. Joining a multiplayer game with friends did not work (and a quick google did not solve the issue). It's slightly too hard to be entertaining. Meh :(",
            "review_score": "-1"
        },
        {
            "review_text": "-hard as ♥♥♥♥♥ -cool retro platformer graphics -more fun wit frends  9/10 (cuz didn't finish it)",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: Austistic Multiplayer",
            "review_score": "-1"
        },
        {
            "review_text": "never play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "You can not find servers to play. Its very rare to find some server and join so most of your playing time remains in solo.",
            "review_score": "-1"
        },
        {
            "review_text": "EITHER LET ME TYPE THAT CODE DAMN CD CODE IN OR THIS GAME IS A ♥♥♥♥ING WASTE OF TIME!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game for co op play. It is very rage inducing but its fun to experience with friends. Just imagine super meat boy with 4 people that can kill each other ,and even though its frustrating it is always worth the effort for the juicy victory.",
            "review_score": "1"
        },
        {
            "review_text": "My friend hates me now...  10/10 would buy it again.",
            "review_score": "1"
        },
        {
            "review_text": "I was waiting for the day that this game would finally come to Steam. The second it did, I just HAD to purchase it.  To be successful at this game, you have to be patient, calm, and read the stage. Bear in mind that even the smallest thing on the map can get you killed. And of course, steady hands are the key to victory.  With friends, the game gets harder (Yes, you can kill your own friends, intentionally or unintentionally) but this makes it more fun.  This is definitely worth the try and the buy. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I am furry.",
            "review_score": "1"
        },
        {
            "review_text": "Nobody said games were easy, nobody said this game was hard though, I am literally about to go from sanity to insanity, on how diffuclt this game is. Please if you aren't good at hard games, then this isn't your game, overall it's fun, raging, and funny, I would recommend to people who have lots and lots of sanity, because this will drain yours.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy blood, raging, and very difficult levels this is an ideal game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "May ruin friendships, relationships and marriages, but it's so worth it. Also may bring out the dark side of you as it will tear your ♥♥♥♥ into a regretful oblivion. Buy this game if you're a ♥♥♥♥♥♥♥♥ to not just others, but yourself as well. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Stupid glitch on Desert level, I got stuck and then my autistic friend got stuck inside me and now we're stuck in each other. I paid for Bloody Trapland, not an orgy.  10/10 Would Uninstall Again",
            "review_score": "-1"
        },
        {
            "review_text": "Was soft whole time 7/13",
            "review_score": "1"
        },
        {
            "review_text": "Couldnt launch  Got sad  made a burrito  ate a burrito  i sharted  and ripped my butt 10/1",
            "review_score": "-1"
        },
        {
            "review_text": "Good game i love to rage raging is fun",
            "review_score": "1"
        },
        {
            "review_text": "The game is ment to make you brake your controller/keyboard. Yes, it is a pretty fun game, but sometimes I run into spots where they seem to make things a little bit to cheap. Overall it's a pretty well done game.  8/10. Worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Has a very similar feel to Super Meat Boy but now imagine trying to get through every level with 3 friends consistently trying to kill you repeatedly while the levels become more challenging as you progress.   This game is absolutely fantastic especially when playing with friends. Many laughs were had and had an absolute blast playing it. Haven't messed with the level editor yet but it sounds amazing what you can probably do with it.  For 1$ you'd be a fool not to pick this game up.",
            "review_score": "1"
        },
        {
            "review_text": "alright game, played a few hours on it",
            "review_score": "1"
        },
        {
            "review_text": "This game can be frustrating at times but it's a really addicting and fun game that I love to play with friends or even by myself. I'm happy to own a copy of this game!",
            "review_score": "1"
        },
        {
            "review_text": "this game is rage and i LIKE IT",
            "review_score": "1"
        },
        {
            "review_text": "Simple, bright, and very fun. Affordable too! not many games like this out there, Would definatley recommend to others. quite the challenge!",
            "review_score": "1"
        },
        {
            "review_text": "Bloody Trapland is hours of fun and anger. play it for lyfe",
            "review_score": "1"
        },
        {
            "review_text": "Was soft whole time 7/13",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game, really entertaining, definitely reccomend. One problem though. It crashes out of nowhere. You alt+tab, it crashes, you finish a level, it crashes. Other than that, real nice. ",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play with friends. But seriously, this game like uuuuuggggghhhhhhhhhh.....",
            "review_score": "1"
        },
        {
            "review_text": "Wish it had actul multiplayer and not local. Other than that is a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "How do i host a freaking game ?!! ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 MORE PERIOD BLOOD",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me hemorrhoids.",
            "review_score": "1"
        },
        {
            "review_text": "a fun little mess around with mates",
            "review_score": "1"
        },
        {
            "review_text": "If you want to spend 2 hours dying repeatedly and hating yourself for spending that much time doing so, this game is perfect for you. I would recommed playing with friends that way everyone ponders why they threw so much time into a simple game.",
            "review_score": "1"
        },
        {
            "review_text": "Not enough gameplay for 10$, I am almost done with the adventure mode and there are barely any servers on. If you want a good game to train on for something like SMB, this would be good.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not for me, but thats mainly because I hate getting frustrated. It's a game made for streamers and LP's.",
            "review_score": "-1"
        },
        {
            "review_text": "PURE HELL but in a good way",
            "review_score": "1"
        },
        {
            "review_text": "this game is so ♥♥♥♥ing awesome the rage inside of me",
            "review_score": "1"
        },
        {
            "review_text": "All it needs is a Death Counter, great little game!",
            "review_score": "1"
        },
        {
            "review_text": "cats r everything... now instead of killing one u can kill one in a game.",
            "review_score": "1"
        },
        {
            "review_text": "Literally cancer.",
            "review_score": "1"
        },
        {
            "review_text": "really cool game",
            "review_score": "1"
        },
        {
            "review_text": "Don't play this if you are angry ! JUST DONT !",
            "review_score": "1"
        },
        {
            "review_text": "made me kill my whole family  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Welp , when i put my CD key it says error 100 , what do I do ? I know this game is fun tho but i wish i could play it right now D: HAAAAAALP    Edit : It got fix so now i can play, yusss , totally recommend this game , it's hard but it's hella fun with friends :3",
            "review_score": "1"
        },
        {
            "review_text": "  Just made me want to play Super Meat Boy. Glad friend got this for a gift rather than buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Dafuq I can't even play the game because of the ♥♥♥♥ing cd key it just keeps saying invalid cd key, it's a waste of money ",
            "review_score": "-1"
        },
        {
            "review_text": "Literally cancer.",
            "review_score": "1"
        },
        {
            "review_text": "Play this if you like a challenge",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game i just need someone to play it with!",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Infuriating but good. Unfortunately the multiplayer doesn't work. At all. Booo.",
            "review_score": "1"
        },
        {
            "review_text": "Pure definition of insanity and RAGE",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most frustrating game, but also the funniest game.",
            "review_score": "1"
        },
        {
            "review_text": "My pc was threwed in to the window because i was stuck on 1 level with my friend :/",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun at first but get's difficult as you go your way",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "its defiently not hard at all.",
            "review_score": "1"
        },
        {
            "review_text": "its games like this that make me not want to buy indie games any more. i bought the four pack hoping to play with my friends, and everytime i make a server it just says 'server shutdown' almost instantly.  yes i port forwarded, yes i cleared it through my firewall, yes i verified the intergrity of my cache, NO I WILL NOT EVER DOWN ♥♥♥♥♥♥♥ HAMACHI TO PLAY A MULTIPLAYER GAME!  if i have to download hamachi to get multiplayer to work, then the devs messed up.  bottom line, this is a broken game.  -infinity/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is hard as Putin!",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Nice platformer with quite a bunch of levels but some (if not all) of them deliverately try to just kill you. I'd recommend to learn patience before attemting to play. Controls are very responsive and consistent and every level is possible.",
            "review_score": "1"
        },
        {
            "review_text": "stage 5 cancer 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Thought I was getting a deal on some premier ♥♥♥♥♥ fresh outta a menstral cycle. Sadly after playing this game and dying over and over again I felt the desire to chop my own testicles off. Only then did I see the irony.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥ game u cant play online with friends unless u have hamachi or ♥♥♥♥ like that i will not recommended this game for all of u guys.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun to play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "sucks how multiplayer is bugged :/ adventure is fun though but hard",
            "review_score": "1"
        },
        {
            "review_text": "Cant play with friends cz of servers want money back",
            "review_score": "-1"
        },
        {
            "review_text": "The game is very good, though it sometimes closes for a reason, maybe it's because my specs are at the borderline xD.",
            "review_score": "1"
        },
        {
            "review_text": "as an independant gamer i can say that i've had hours of rage induced fun with friends on multiplayer and i can say was definitely worth the money spent, would give it a 4/5",
            "review_score": "1"
        },
        {
            "review_text": "⁧ ⁨",
            "review_score": "1"
        },
        {
            "review_text": "  Oh boy, YouTubers make it look more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Cute little rage platformer. friends recommended! 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Blood Death Rage...my kind of game....that i like at first then get really angry ",
            "review_score": "1"
        },
        {
            "review_text": "Your gonna love this game !",
            "review_score": "1"
        },
        {
            "review_text": "  NIce game to play with friends and have fun! :D ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Can't stop playing. 200+ hours already.",
            "review_score": "1"
        },
        {
            "review_text": "Rage inducing, ♥♥♥♥ throbbing, vein popping, and butt clenching. Def buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "good game. the controls work just fine. This is not a game that will make you rage because of the controls. it will make you rage because you know the fails are your fault",
            "review_score": "1"
        },
        {
            "review_text": "When i got this game i got it for 99 cents and also got a copy for my sister.   Nice dollar spent on rage moments and moments of joy once you pass a level. As with most games, its more fun to play with friends.... so you can sabotage them and watch them die.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun and great to play with friends, but at times, it makes you want to hang yourself.",
            "review_score": "1"
        }
    ]
}