{
    "app_id": 258070,
    "name": "Probability 0",
    "release_date": "2014-06-12",
    "developer": [
        "Droqen"
    ],
    "publisher": [
        "none"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 11,
    "price": 4.99,
    "description": "Never reach the bottom of the pit that is Probability 0. The game is different every time you die: the enemies you fight, the landscape you climb down, and the body you inhabit (if you so choose). Never survive. But find your way deeper than you did last time.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258070/header.jpg?t=1447358956",
    "minimum_requirements": "Memory: 1 GB RAM Storage: 20 MB available space",
    "recommended_requirements": "Memory: 2 GB RAM Storage: 20 MB available space",
    "reviews": [
        {
            "review_text": "10/10 would die again.  Probability 0 is the basic concept behind roguelikes boiled down to a very few key aspects, and mixed with some clever design elements. It's pure, accessible, deep, and has an eerie, mysterious vibe to it. The platforming and combat both start out really simple, and are continuously expanded upon through new abilities (like firing your ranged projectile in new directions, being able to stomp your enemies, smash otherwise solid blocks, just to name a few). It's worth mentioning that the skill tree is extremely refined and well-designed. It feels balanced, interesting, and allows for an astounding amount of customization and experimentation at the same time.  Enemies start off really simple, but as you get deeper, the spawn pool gets mixed up with very interesting critters that drastically differ in their movement, attack pattern and other behaviour. Since each enemy and environmental hazard is extremely easy to grasp and learn, death is rather caused by multiple of these elements driving you into situations you didn't calculate. Each death, even if they are very frequent, feels more than deserved - an aspect lacking in quite a number of other games.  I would definitely recommend Probability 0 to everyone who likes a good challenge. It can be frustrating, but in the most positive way a game can be. It's pure in its design, fun to play and very rewarding.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game. I haven't spent too much time in this game, but gosh is it hard. I've decked a good hour or so into the game, but it takes the rouge-like to a new level of hard. The screen is constantly descending deeper, and you're tryting to keep up, but you have to grab some more star-ammo, dare you risk going for the ammo? Or should you play it safe? Now, imagine you're a time lord, and you go for option A, you rush across the screen, and grab the ammo, but the screen passes and you die. Now, rewind time and go for B. You descend deeper succesfully, but are flanked by two flying foes, who basically bite you to death. This is Probability 0. The game has a certain old-school difficulty not successfully pulled very often today, and its by the creators of Starseed Piligrim. Overall, I'd say if you really like old-school titles, buy it, if not, wait for it to go on sale. It's a great game(Would be better with local coop.), but the price tag is a tad hyperbole.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe I'm just no fun, but I don't enjoy this at all. In mid-air you can only attack downwards? On the ground you have super-limited attack range? You actually do have to kill stuff to reach higher levels? I just don't see the point of this game, mostly, and for how cheap I got it I don't feel like dumping more time into it. Tried it a while back, didn't like it, tried it again today, didn't like it. So... oh well.",
            "review_score": "-1"
        },
        {
            "review_text": "Worth what I paid for it, nothing. Terrible graphics, terrible controls.",
            "review_score": "-1"
        },
        {
            "review_text": "I lovethis game a great deal I even wrote a guide for it!  So you go down kill things get powerups and level up learning skill as you go and you do this until you perish!  and start again and again and again!",
            "review_score": "1"
        }
    ]
}