{
    "app_id": 258010,
    "name": "Ring Runner: Flight of the Sages",
    "release_date": "2013-11-19",
    "developer": [
        "Triple.B.Titles"
    ],
    "publisher": [
        "Triple.B.Titles"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Indie"
    ],
    "achievements": 175,
    "positive_ratings": 593,
    "negative_ratings": 112,
    "price": 3.99,
    "description": "Ring Runner combines the fast-paced action of space combat with the rich story and skill variety of an RPG.Trek across the universe in a 30 hour long story-driven campaign based on a companion Sci Fi novel, or challenge 6 scenarios alone, cooperatively, or competitively through local or online multiplayer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258010/header.jpg?t=1478033493",
    "minimum_requirements": "OS: XP, Vista, 7, 8 (32 or 64 bit) Processor: 2 GHz Memory: 1 GB RAM Graphics: Graphics: XNA Hi Def Profile Compatible GPU DirectX: Version 9.0 Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've never seen a game where you watch the devs descend into madness (read: awesomeness) as the game progresses.  I played this for a few hours, wasn't too enthusiastic, and forgot about it until a few months later.  Big mistake. I'd stopped at precisely the moment the developers stopped caring about what a game was 'supposed' to be like, and what they actually WANTED to.  One minute I'm shooting space cops in a clunker spaceship. Next thing you know, I'm going back to the drawing board and building spaceships that should be IMPOSSIBLE so I can blow up a galaxy's Parent-Teacher Association and bill them for Dvorak keyboards.  And it just KEEPS GOING. Forget 'characters you care about'--most of the games you hear people say that about don't HAVE characters. You know what's a REAL character? A REAL character says 'this mission has been boring, let's pretend the mission objective was to get in the arena anyway' because THAT'S WHAT YOU WOULD DO IF YOU HAD LASERS.  The game opens up the hangar and you get bogged down in minutiae because you don't know what all those numbers mean--at first. A few hours later, you're saying stuff like 'okay, I'll make this ship out of paper but it'll be REALLY FAST, and by going fast it recharges shields to cover the duct tape armor, but I'LL NEED TO ALWAYS BE FIRING so my generators don't overload because then the enemy could tap me and make me EXPLODE.'  Since the ships at the beginning suck, they're not much fun to pilot under the game's Newtonian physics. It's like if all you knew about Gran Turismo was driving a 1970s Volkswagon. But after a certain point? Hotrods with lasers, baby. Hotrods with DRILLS and SPACE MACES YOU SWING AROUND. You want turrets? How does 19 TURRETS, 1 SPACESHIP sound?  I'd say something trite like 'the game goes NUTS after a certain point and I love it forever, forgive the weak start' but you know what? No. NOPE. Even at the game's worst, before the plot and ship customization gets great, it's still only as 'bad' as pretty much any game out there. I want you to sit down and ask yourself: is this other game I'm going to play gonna give me a SPACE MACE?  No, no it's not. Ain't happenin'.  Toss that 'other game' out the airlock. Now.",
            "review_score": "1"
        },
        {
            "review_text": "Several aspects of this game alone are enough to make this game great. Nontheless, they all come together to make a fantastic experience I'll start with combat. The game starts you out with some crappy ships and crappy weapons. This fits in line with the plot. As you get more vessels and new armaments, you start to pick favorites, and by the time you get to design your first fully customized craft, you already have a good idea of a few combinations that may become standbys for the battles to come. Fighting involves destroying, distracting, subverting, evading, tricking, stunning, outrunning and overpowering the enemies. I am very well convinced that someone could spend a year on this game and barely scratch the surface of all the amazing combinations that have yet to be discovered. The plot? Enthralling. Through gut renching losses and righteous victories, this game engrains you. Between the universe threatening drama, cheeky humor pervades the dialogue, and the characters, even minor ones, can be quite lovable. What also helps to make this story concrete is the depth of the lore. That, along with the fact that some of the Sci-Fi technology makes sense helps to make this a real feeling world. The music isn't flashy, but it is a great case study of how one can do great things with only a few tools. I heard there guys aren't even musicians. The graphics use shiny light and pretty colors to draw you in, with atmospheric backgrounds the fit right in place.  Some of the cons involve the layout. It can be difficult to navigate the hangar and switch ships. Finding your favorite presets can be irksome, and there doesn't seem to be a way to test ship combinations without going into a story mission. Most of the game is fighting, with some racing and stealth in there too. This is, however, broken up by the jovial dialogue and a few puzzles. In short, this game had a lot of careful quality and love put into it. It is easily worth more that $10.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games i've played in my life. Pros: +Funny - There are lot of funny dialogues and interactions in the campaing +++Gameplay - The mechanics are really great. I'm fairly new to space shooters, this one made me want to explore the genre a little more ++Diversity - The game counts with different ship classes you can choose, each one with strategic diferences from each other +Multiplayer - From the little i've played, the multiplayer seemed balanced and a lot of fun Cons: -Controls - Controls are hard to get and harder to master, it adds some difficulty to the game and people often count this as a pro, but in my opinion it dissuades a lot of people from playing this. = Graphics - A game doesn't have to be a graphic masterpiece to be good, but it's worth mentioning that the graphics are really simple  Solid game with a good replayability and a good price, highly recommended. ",
            "review_score": "1"
        },
        {
            "review_text": "As of writing this review the game costs 8,99€. And now after I finally finished the story I must say that I even deem that price to be lower than what could be expected when comparing it with other games. There are thousands of games out there that cost a lot more and won't even deliver a half of what this game has to offer.  The gameplay is very varied and outright fun most of the times. Those few moments of frustration I had I've brought upon myself by choosing a somewhat higher difficulty. The game forces you into many different roles but constantly performs well at doing that, and even up to the last levels the gameplay occasionally gets some new twists. That's nothing I could say about many games, actually at this niveau Ring Runner is the first I've encountered.  The story is... really incredible for a game with this price. It is really long, it is immersive, well thought through, interesting, awesome and at times breathtaking. It offers twists up to the very last moments and nothing ever felt out of place. The game even manages to convincingly think up a new way of faster-than-light travel, and managed to sew it perfectly into the story.  If you have any remote interest in games like this, get it. There's even a Demo to try out first in case of doubt.",
            "review_score": "1"
        },
        {
            "review_text": "Objectively: A top-down Space Shooter reminiscent of SPAZ, with great depth and complexity, letting you handle a single intensely customizable ship for a large number of play styles, tactics, and possibilities.   The lore is rich and designed with a lot of care, the same care that has gone into the rest of the game. Dialogue is witty, though perhaps annoying to some. All in all worth its price even without a discount.   Subjectively: My favorite game of all time. There is a demo. If you even remotely like spaceships and shooting stuff, why aren't you downloading the demo right now, what are you DOING?!   EDIT: Be wary of dark souls levels of learning curve and skill ceiling.",
            "review_score": "1"
        },
        {
            "review_text": "Storyline is fantastic, the dialogue is well-written and humorous (think Hitchhiker's Guide to the Galaxy), the gameplay is fun and engaging, it has nearly limitless replayability due to the level of customization... I don't think I can say enough good things about this game. The fact that it was made by only two people (brothers no less -- what a neat personal story that makes for Triple B), and is their first game to boot, is amazing. Not only is the game good, but they have continued to update the game and tweak things here and there after it was released, in addition to releasing a free addon multiplayer mode reminiscent of MOBAs like LOL or DOTA.  The only criticism I can think of for this game is that some of the ship types are not 100% balanced, but given the vast number of customizable elements of each ship type, I am frankly amazed that it is as balanced as it is right now.  tl;dr 10/10 would buy a thousand times.  Last-minute disclaimer: it says I've got .8 hours of play on record, but I played this game for hundreds of hours well before it was released on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic story in the package with a fantastic game to match, if top-down 2d real-time space battles and very satisfying levels of customization are your thing then this is the game for you! Singleplayer campaign coop is samescreen local coop only. The multiplayer modes are where online coop comes from.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game for £6. It's actually very indepth with all the customization considering at a glance it looks like Asteroid on crack. Pretty badass story mode too with some fun references, acclaimed to be 30+ hours. I haven't finished it, or been timing myself lol. There are loads of difficulty settings and you can change it whenever, so it's a very playable game for the most casual to hardcore gamers.   I'd recommend utilizing the game's controller support if you can, as this game feels as though it would play heaps better with a controller. The mouse+keyboard controls are good albeit difficult.",
            "review_score": "1"
        },
        {
            "review_text": "A quirky space shooter with a deeply developed universe and a LOT of satire. A space comedy, but the plot grows surprisingly deep and involved over time. Think Hitchhiker's Guide in tone, though the execution is rather different.  Gameplay is good once you get used to the controls, but there are several different control schemes, so you can find the one that is most intuitive for you. Missions are short and to the point, which works very well given the game doesn't take itself seriously (a good thing).  Ships are extremely customizable, to the point of being confusing and unwieldy. To do an effective build, you'll have to spend several hours learning about the ship types and components and how they work. Or you can just slap a bunch of random crap into a Caster and mash buttons, like I did. A great deal of potential for novel/interesting playstyles with this system, but very little hand-holding for players who just want progressively better ships to shoot at the bad guys with.  Well-balanced and always remains interesting. The plot moves forward more steadily and naturally than many games I've played. Characters are loveable, though the game has a tendency of killing them off, so don't get too attached.  Graphics, while nothing spectacular, stand out nicely among your usual indie games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a hidden gem.   -Tons of customization and playstyles for 2d arcade spaceship combat -Snarky, witty writing makes dialogue fun -Huge galaxy to explore with its own lore -Pretty long story if you do everything -Hell they even got single ship co-op, driver and gunner -They have a workshop for ship custimizations  This game would be amazing online. But alas, no one is on.",
            "review_score": "1"
        },
        {
            "review_text": "I've never been a fan of space shooters but this game changed my opinion. It has a good story, dialogues are well made, have a enjoyable gameplay and ship customization is just awesome. i just dont understand why some people keep complaining about the controls and the physics, there's nothing wrong with them.",
            "review_score": "1"
        },
        {
            "review_text": "i actually kinda feel bad getting this game for such a cheap price, holly molly its gorgeous, the gameplay feels like a space simulator like it plays where you have only one trust direction and then it doesnt stop going, ya know, no gravity,",
            "review_score": "1"
        },
        {
            "review_text": "Suddenly a very good thing, punctually corresponding to its description. I think i ain't gone very far from the beginning by now, it seems to be too easy on any other difficulty that the hardest which i'm playing on, yet takes some dedication to get used to controls, and flying and combat peculiarities, as It's a top-down 2D, while my pilot skills are all coming from X3 Reunion and HAWX and based on the first pirson view. Yet it's quite intresting to fly and to fight in there, especially when you get better with understanding how it is handled properly. Nice graphics and tolerable-to-nice 8-bit (ore how ever it's called) soundtrack.  Plot dialogues written with great talent and humour. To sum up - a good game worth a try, especially for playing in short spans of time between more useful occupations). PS Would be nice to have a 3d game based on this one, with 1st and 3d person view and comfortable controls. Неожиданно хорошая вешь, вполне соответствующая своему описанию. Далеко от начала пока зайти не удалось - слишком легкая на всех настройках сложности кроме максимальной, а на максимальной приходиться поумирать пока привыкнешь к особенностям двухмерности и вида сверху, так как у меня все навыки по летной части из X3 Reunion и HAWX и в основном с видом от первого лица. Но летать и рубиться довольно интересно, особенно когда начинаешь лучше понимать, как это правильно делать. Смотрится неплохо, саундтрэк тоже ничего, не считая того что он восьмибитный.  Сюжетные диалоги хорошо написаны- талантливо и с юмором то есть.  В общем в целом вполне достойная игра, особенно для коротких заходов между делом.  ЗЫ. Не помешала бы и трехмерная игра на основе этой, с видом от 1 и 3 лица и хорошим управлением.",
            "review_score": "1"
        },
        {
            "review_text": "The best twin-stick shooter I've played. Classic fantasy-RPG based classes for the hulls, hundreds of skills and parts to customize with. Procedural maps to blast your friends on. The single-player campaign takes quite awhile to really get going, but the story's decent and the soundtrack is pretty damn good. All-in-all, I'd say it's well worth a purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Having finished the game on 5 diffirent occassions, I can definetly say that it's a wonderfull little game. The campaign is a real rollercoaster from begin to end and doubles as a tutorial. Play it on easy if you just want to enjoy the story, or play it on the hardest difficulty if you want an impossible challenge. Next to that, every level has a set of chellanges to complete, some which can't be completed at the same time. It's pretty touching, but it also ha the best jokes and moments I've ever heard.  While not having touched the multiplayer too much, with its various co-op horde modes and competitive MOBA style missions, it's quite varied.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it and play the game, you amnesiac caricature.",
            "review_score": "1"
        },
        {
            "review_text": "Its highly recommended to get an XBOX controller for this one. There's a lot of variety in game modes, a lot of customization, a lot of story. What more do you want?",
            "review_score": "1"
        },
        {
            "review_text": "amazeing story  awsome game play  funny jokes what more colud u want",
            "review_score": "1"
        },
        {
            "review_text": "Really nice. I think this is a good early effort from the studio and I am looking forward to their next steps.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, get it!",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, atmospheric twin stick shooter with amazing tactical and RPG-like depth.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually pretty cool when it comes to a story, I will not go into to details, but it makes you get slightly attached to a character, then makes you watch him die, like, you literally watch him die....Mugen...Nooooo!.",
            "review_score": "1"
        },
        {
            "review_text": "-Start mission -Voice in my head is hungry -Enter fast food joint exit first -Voice in my head makes *nal joke -Game knows me better than I do",
            "review_score": "1"
        },
        {
            "review_text": "Nice one! good stuff!",
            "review_score": "1"
        },
        {
            "review_text": "Try it! ;)  5 of 5 Stars",
            "review_score": "1"
        },
        {
            "review_text": "i dont remember playing this game--- i dont even own it :D",
            "review_score": "1"
        },
        {
            "review_text": "I can't really tell if this game is worth playing or not cuz I cant play it too well. It seems really cool, and probably is a fun top down space shooter, but I have to play games with a controller. And therein lies my difficulty - the controller control scheme is VERY odd and unintuitive. You spin your guy with the LS, 'flick' the RS to dodge, thrust with RT and brake with LT. The fire buttons are the face buttons, which really sucks if an enemy comes up from behind you, you have to do a complete 360 (and it only responds to LS right and LS left, you cant just point the way you want to face and your ship goes that way). In addition, having the fire/skills on face and dodge on RS isnt the greatest idea.  Because of this, I careen all over the place and die instantly.  But beyond that, I posted a non-trollish and polite note saying that the control scheme on a controller needs work, and it was removed by a mod. For no reason. Just cuz they want their game to look good.   Devs have to take criticsm with the good. I think the game would be great if the controls werent so weird, and an alternate controls scheme would be nice or at least mappable controller buttons. That it basically what I said in my post.  I probably would have written the exact same review, but clicked 'yes its worth playing' if you can get over or dont mind the controls. But due to the idiocy of the mods, sorry. This ones getting a big red no.",
            "review_score": "-1"
        },
        {
            "review_text": "the mouse aiming is unresponsive and enough reason to not like this space shooter game which requires a lot of movement and precise aiming.",
            "review_score": "-1"
        },
        {
            "review_text": "At the beginning it pretends to be a decent space shooter game with 3D graphics and stuff, and then you get a f**** Nokia-like space shooter with awkward controls. Only good thing about this game is that I didn't pay for it.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good in every aspect, beacuse it is basicly a book, but not a good book. Every point you will feel, that you want to just skip to the part where the game lets your hand off and allow you to play with the tools that he keeps teasing you with by giving you small demo sessions with them... But it never does. The story is text based story driven with excelent writing, except a good book when you read about a different sede plot you have the time to think about the main one and can't wait to go back to it to find out if you were right or the book will suprises you. Here the game never lets you off the leash. It keeps throwing itself on you that you can bearly grip it and then takes it away either too early or force you to keep it for too long to the point you just farm yourself trough it in hope somewhere in the distance you can enjoy yourself, but No. You will eventually learn that that part of the game is not the campaign and if its not the campaign you will not enjoy it.  I am sorry guys.  One of those games where a super small tweak could have bring it to the halls of classics but it just triped at the door and fell on its face.",
            "review_score": "-1"
        },
        {
            "review_text": "Have tried several times to survive the first mission.  Cannot, despite the fact that I've played (and loved) 'Newtonian' space games before.  Ragequit.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is unstable and uncompelling.",
            "review_score": "-1"
        },
        {
            "review_text": "The game tutorial is bad the controls are bad. They will tell you if you like SPAZ you will like this. I like SPAZ.. I find this game lousy.  I ask the forum for help and the developers just accused me of skipping tutorials instead of being helpful. Lousy bunch.  I think this game has potential but found out it was lousy in the end. SPAZ is way better than this game in story, game design or in gameplay, controls, fun, everything. It is cheaper too.   Boring story, dont even have art. Dont waste you money in this garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "I was expecting game like Galak-z in PS4, which is not released yet. Hope it will be released on PC too. Well, this game is the closest thing you could get on PC yet.",
            "review_score": "1"
        },
        {
            "review_text": " Short version  Jesus christ. The game is ridiculously, overwhelmingly awesome.    Longer version   Combat: Gratitious Space Battles combat was dull. SPAZ combat was fun. Reassembly combat is great. Ring Runner's combat is just outstanding. It's super dynamic, fast-paced but not chaotic: you control the pace of fight. It's like an action-RPG with a very deep skill system, where every skill is indeed unique. Most abilities have very low cooldowns, so you'll have to blink, dodge, slow time, push, pull, manage your heat, shield and energy and destroy your enemies in any way you can imagine. 10/10.  Customization: No, you can not build your ship from scratch like you can in reassembly. But hell, this game's customization system is just way more advanced and balanced! Every hull has a set number of mounting points for different types of devices. Every mounting point has a capacity: the more capacity it has, the more comlex gear you may equip to it grating you passive bonuses or active abilities. You may equip multiple devices into a single mounting point if you have the capacity. It's so way better than in any other seemengly similar game like Gratitious Space Battles or SPAZ. 10/10.  Abilities: Basically everything including evasion and weapon autofiring is an ability in this game. And wow, varied they are. Abilities are designed to be very synergetic and they often let you turn your downsides into an advantage. For example you can grab a super-powerful engine that generates a ton of heat. Overheating is generally not the thing you want. But you can attach a freaking molten laser that dissipates all your heat in one shot if you're overheated! Or you can equip an engine with high top speed but low acceleration and get an ability that instantly accelerates you to maximum speed in any direction. Basically there are only 2 games I know that have as synergetic abilities as this: Tales of Maj'Eyal 4 and Baldur's Gate 2(wizard). Please tell me if you know another! 10/10 here, no doubt  Graphics: The game is developed by one family. Graphics are 3d while game mechanics are 2d. They pretty advanced, run smoothly but I personally am not a huge fan of this game's graphical content. SPAZ or Gratitious Space Battles look better if you ask me. But it's nowhere close to being game-breaking or unlikable. 7/10  Story: I have not completed the story yet. So far(10 hours of story) it is pretty fun and well-written. It's not a Planescape: Torment in space but there's a decent sci-fi story that utilizes some very well-though physical concepts. Like Mass Effect is based on physical phenomon called Mass Effect(some materials may change their density when electrical current is applied to them) this game has numerous concepts that I found even more interesting(physics is my major). 8/10(?)  Music: Game's music is atmospheric enough and fits it well though it it sometimes a little repititive. You're unlikely to listen to game's OST when you're not playing like you listen to Silent HIll's or Final Fantasy's but it is a great soundtrack and you won't end up listening to your own music instead of built-in soundtrack. 7/10  Controls: As I said before, most abilities have low cooldowns and you may end up equipping a lot of them. Ability management, movement, evasion and heat/energy/ammo may will be as challenging as you want them to. If you can't handle too much active abilities, equip passives instead. But I love controlling as much as my brain can handle and the game certainly gives me opportunity to equip enough active skills. My gamepad acts funny with this game(analog joystick sticks to 8 discrete directions) but controlling with mouse + keyboard is great anyway and controlling multiple skills is more convinient with keyboard.  General impression: The game is Loved by its developers. You can feel it in every aspect in every small detail. It's like the opposite to stuff you see in android market or most early access garbage that are developed to get as much money and as soon is possible. This game is so detailed, so well-though, so *lived* by it's developers I just can't help but admire it. It's very strange and disappointing to see how unknown it is and it's 75/100 metascore rating is just frustrating. Do not let AAA-crap reviwers fool you, this is a true indie game gem.",
            "review_score": "1"
        },
        {
            "review_text": "Hidden gem, this game is super TIGHT! I was sceptical when the campaign started off. Half an hour later, made me kek and enjoy the story already. Apart from the obvious plus sides of 30h campaign value, tons of customization etc.. You can play a team moba styled map and drive a ship that dumps ♥♥♥♥ing COMETS on their face, oh and some weird vortex balls and.. god knows what else. Oh and did i tell you, that you're also a sage? Just buy it man, it's dirt cheap and was also in bundles.   Crushed their tower with a giant meatball / 10",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun top-down space shooter, with some of the best storyline and writing in all of gaming. Or to put it more accurately, some of the best storyline and writing in all media. I love science fiction novels, but this convinces me that games have more potential to tell a story.",
            "review_score": "1"
        },
        {
            "review_text": "A good and long campaign with vast customisation",
            "review_score": "1"
        },
        {
            "review_text": "Under 500 reviews, does this make it a hidden gem? I believe it is a hidden gem. And I only played for about 4 hours. The only flaw with this is not that heard of.",
            "review_score": "1"
        },
        {
            "review_text": "It's amazing how much attention this game doesn't get. It's is honestly a good game, I got it for sale for $0.99, and trust me when I tell you it is well worth your money.  4/5",
            "review_score": "1"
        },
        {
            "review_text": "This isn't usually my genre. But this particular top-down space shooter had me hooked. I bought it in a Steam sale and it was well worth it. The tutorial is well-made and prepares you for the controls and the different abilities, and the story is really deep and interesting, unfolding really nicely.  I haven't gotten far into it but it's one I can definitely highly recommend. It's a gem to play and the controls feel right. Smaller ships are very manoeuverable and turn well while larger ships are, as expected, a little clunkier. Momentum is well-balanced and it's very fun to play.  If you like space shooters, deep storylines and sci-fi, buy it. Even if you're on the fence, buy it anyway. You may be pleasantly surprised, just as I was.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing soundtrack, quippy headmate, over the top story, lots of customization, and a tight dual stick shooter gameplay are the main merits of this little gem. If any of those interest you the least, you owe it to yourself to try it.  Even after all this time, Nero's attitude and the tunes stuck with me.",
            "review_score": "1"
        },
        {
            "review_text": "What I love the most about this game is I feel like the creators poured a lot of love into it. I don't get that feeling with a lot of games. True, the ship customization is a bit too complicated and uninteresting for my taste, but the story, music, gameplay, graphics - it all works pretty well for me.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine if Asteroids was made in 2012 by a team of developers led by Cuck Norris. now that is not even NEARLY as awesome as this game. infinite customisability, great music (I WANNA BUY THE SOUNDTRACK BUT YOU CANT BUY THE SOUNDTRACK) and generally just gives me a good feeling when playing the game. 10/10 would murder kittens for a sequal or DLC.",
            "review_score": "1"
        },
        {
            "review_text": "Went on sale two days after I bought it for %75 off and I was waiting for it to go on sale AAAAAUAAUUUGGUGUGGGGHGHHHHHHHHHHH!",
            "review_score": "1"
        },
        {
            "review_text": "The game is exellent! Full of Story and Content and most of all its not horrible!!. I love everything about this game and if your into space travel and having the ability to customise your ship any way you can possibly imagine then get this!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game for the price. A great application of a top-down space shooter with endless customization and other options. It also features 6 other gamemodes and has multiplayer.   The graphics are not the best, but fit the type of game it is. The performance is excellent and the developers are quick to respond if you have a problem.  I would definitely recommend this game to any of my friends.",
            "review_score": "1"
        },
        {
            "review_text": "Ring Runner is exceedingly unfriendly to the casual gamer, and it throws far more information at the gamer than can be easily digested. If you can get into it, however, it's a really great game. The story's worth your time, and the game becomes pretty dang fun once you get good enough at it. It's incredibly well made and the story and world are extremely well-crafted. I recommend it if you're smart, good at games, and love a good story.",
            "review_score": "1"
        },
        {
            "review_text": "A great little indie title. Mission based with a lot of variety and fun writing.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Gundam Build Fighters then this game is for you. It has a Gundam like ship that looks like Hi-Nu Gundam. XD",
            "review_score": "1"
        },
        {
            "review_text": "What a fun and original game! Playing with a Xbox controller makes it feel like a twin-stick shooter, but with missions and configurable equipment. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I just completed this game after 20 hours. It's a ♥♥♥♥ing masterpiece. The gameplay is awesome, the customization of the ships is great for choosing which arsenal of weapons you like best, and the story... one of the greatest plots I have ever seen. When you are learning Sage macros, it truly feels like you are in the most sacred, mystic place on the universe, and you have full control of every single molecule. And the plot twists... the feelings are strong in some points of the game.  The ending, in combination with the credits song, brought tears to my eyes. Oh, and that was only for the single player mode! This game has multiplayer too, which I have yet to try out! 10/10, would play again to beat the campaign on a harder difficulty.﻿",
            "review_score": "1"
        },
        {
            "review_text": "It reminds me sufficiently of Star Control 2 to make it instantly appealing. If that means anything to you, buy this game. If it doesn't, go discover it. I can't come up with anything more to say. It's wonderful, give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "This game surprised me. I picked it up on a sale and I was expecting something reasonably generic in terms of a spacey shooter game. In reality, it's a well thought through game with an interesting story, good soundtrack and really tight gameplay. It is a spacey shooter at it's core, but there's enough variation going on that it's not feeling samey. The customisation choices and the variation of gamestyle it offers is really high, which coupled with the alternative game modes (like racing, tower defence) it makes for a rich and interesting experience. In hindsight, I'd buy it at full price and feel happy.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this at the advertised price 9.99 but you might wait for a sale.  I love the concept of it being an RPG, but it's not. The tutorial is kind of rpgish but very structured--few choices in customization and ship choice so they can introduce you to all the ships.  The problem is that afterwards all the level 1-3 ships, most hulls and a bunch of level 5 prebuilts are all open.  At that point it's not an RPG, it's a combat/shooter with a decent choice of ships and weapons.  I restarted hoping for an 'RPG' mode where you start with a single, tiny fighter hull and work your way up but no--you skip the tutoral and they just open up everything including 1-2 of each highest level prebuilt hull.  I realize many people don't like RPGs and so they just want to get to the highest level with every option open and fight, but if that's the case kindly don't advertise it as an RPG. For isntance, Diablo 3 is this way--levels 1-70 are paretty much a tutorial and then you start playing after level 70. Stop calling these things RPGs, they are fighting games with extended tutorials--that's it.  Still, not at all bad for the price. Even has a MOBA map that's pretty cool.  If an RPG mode was introduced to (optionally) replace the extended tutorial with slower advancement and less initially unlocked I'd be really happy with this game.",
            "review_score": "1"
        },
        {
            "review_text": "I really recommend this game. Just don't buy it with it's normal price, it comes to sale almost allt he time so... just don't, but otherwise it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "Bought Randomly because I had 69p in my steam wallet from selling cards during a sale, was a genuinely enjoyable space game with good humour. The Flying mechanics are certainly a challenge at first and crashing into things is generally the easiest way to stop if you aren't playing a maneuverable ship, but the huge amount of weapons and upgrades allow for loads of combinations and loadouts that I'm sure people better than me will make full use out of. Additionally the game can become pretty crazy on higher difficulties, Personally i'll stick to the lower ones and murder people with the power of maths lasers and slow motion powers.   Overall, considering I bought this for barely anything, it was definitely worth it.",
            "review_score": "1"
        }
    ]
}