{
    "app_id": 25830,
    "name": "Knights of Honor",
    "release_date": "2009-02-04",
    "developer": [
        "Black Sea Studios Ltd"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Medieval",
        "Grand Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 1018,
    "negative_ratings": 89,
    "price": 7.49,
    "description": "As King, it is your duty to lead your people in their struggle to raise your kingdom from its humble beginnings to a position of power and prestige. War, diplomacy and a burgeoning economy are the means by which you increase your power and expand your influence.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/25830/header.jpg?t=1447351680",
    "minimum_requirements": "OS: Windows® XP, Windows® 2000                     Processor: 1 GHz Intel® Pentium® III or AMD® Athlon™ processor                      Memory: 256 MB RAM                      Graphics: 16 MB video card with 1024x768 resolution                      Hard Drive: 1.2 GB free hard disk space plus space for saved games                      Sound: DirectX 9.x compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It doesn't seem we will ever see a sequel, which is a shame considering how advanced this game was for its time. Even by today's standards it is a very enjoyable grand-strategy title and features some of the best diplomacy in the genre. Sending a spy to infilitrate an opposing faction and watching him seize their lands for you, only to find out he has claimed the lands for himself and has usurped you, is just a taste of the possibilities the campaign gives you. Highly recommended and I would love to see features from this game introduced and evolved in future TW titles.",
            "review_score": "1"
        },
        {
            "review_text": "Wow.  This game is awesome.  This game, now on sale for $2 because of the Paradox sale, is worth at least 100. I'm not kidding.  There are games made nowadays that are only half as good as this thing.  This has...political intrigue...diplomacy...trade...real city development...simple yet effective society running...FULL RTS BATTLES and GOOD autoresolve...  This is THE Medieval Strategy game.  I'm sorry Paradox, but Black Sea Studios really should have made at least 5 more of these.  I think I was supremely wrong when I thought isometric RTS's were dead.  This is better than:  Age of Empires 1/2/3 Stronghold 1/Crusader/2/3/Legends/Crusader 2 Crusader Kings II Europa Universalis III/IV Medieval Total War 1/2 etc.  I thought Dragon Commander was a great game, this...is utterly perfect.  A+++  100/10  Etc. Etc. Etc.  WHY HASN'T A SEQUEL BEEN MADE???  This is the Skyrim of Medieval RTS's.",
            "review_score": "1"
        },
        {
            "review_text": "The best strategy i've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game, and even better if you think about how old it is, i'd say it's like Crusader Kings 2, but then... a bit more detailed and less dlc-based, the graphics are much worse though, you just have to get used to them ;3",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy game I ever played..",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps one of my favorite medival strategy games. Ever. I had hundreds of hours of gamplay since it was first released back in 2006.",
            "review_score": "1"
        },
        {
            "review_text": "120 hours on record has to mean something. Not a terribly deep game, but terribly fun nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Started in Cork, allied with Scotland.. Got myself a solid economy fueling my army.. Swept accross the British Isles while fighting rebels back home. Trained some spys with books, and a couple of my Marshels were themselves spies. I tourtured them and lost respect of the other nations.. Sent my main Marshel on a crusade, upon completion of crusade he choose to take the land for his own. Swept over Spain into Africa and as far east as Russia, destroyed the Papacy by accident when my son and the daughter of the 'pope' claimed the land after he died. Sent my last spy on a mission, while gone my throne was infiltrated and all of my near maxed out marshels claimed lands of mine as theirs and rebeled... Still had 3 proviences left and a few marshels... My treasury which was 1k gold a cycle, dropped to -700ish, I was near 100k.. Quickley my marshels which remained loyal were trying to reclaim the lands I had 'liberated'.. My new marhels were left with basic units and many died in service or imprissoned. I found a few mercany camps and exploited the best units I could find and alloted them to my prince, who immediately became king,. Only to throw all his feudal knights against basic spear men in the african campaign. My spy became king losing vast random tracks of lands to other claims. Finally I regained most of my lands.. Game froze.. Had not saved in 6 hours.   This is a really good game for its time, and despite some of the clunky controls a solid experience with all its merits still. I grabbed it for a couple bucks and put in more than time than I paid for. I wish some of these features were implimented with modern Total War games.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of my favorite childhood games!  It might be an old game but it's very good even with some aged mechanics. It's just a shame that this game never got to see the light of a sequal.",
            "review_score": "1"
        },
        {
            "review_text": "I played France....and converted myself to Islam........... i wanted to sent a printscreen to the Front National.  That being said it's a very good strategie game one of my favorite! And i became soo knowledgable about the olds empires! clearly outsmarted everyone in history thanks to that!",
            "review_score": "1"
        },
        {
            "review_text": "Knights of Honor was a blast from the past even on its release date---as the Total War series started to evolve away from province-based conquest and toward the form it now has become, KoH was effectively a clone of Medieval: Total War (the first one). Which means that it will always have a place on my hard drive, since MTW1 just plain doesn't seem to like to run on fast, modern machines, while Knights of Honor runs smoothly and all but completely crash-free.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best medieval soundtracks I've heard in a strategy game.  Combat is mediocre at best, though the seiges are a lot of fun.  -Empire management is simple enough with your towns focusing on specific production of limited resources (one region able to focus on making wine, marble, and salt while others focus on cultivation and fishing maybe). So expanding to neighboring regions and trading with other empires is a must if you wish to be successful early on.  Each region also has a random generator attached to them. It decides what features it starts with at the beggining of the game, either farm, chapel, village, and docks (I also think it depends if you have certain options checked before starting).   -Knights have differing proffessions: merchant, spy, commander, mason, farmer, etc...(e.g.. Have your only heir become a spy, infiltrate the enemy nation, commands one of their armies, mistake hime for an actual enemy.............. It isn't a complex game but it's fun enough to try if your bored with EU4 and the likes. Could also get you started with the genre if you are new...",
            "review_score": "1"
        },
        {
            "review_text": "  A ''friend'' gifted me this game, and holy crap this game is freaking fantastic and awesome. I wish I'd gotten this game much earlier, it's freaking great! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game since I was five years old and when I didn't know what more than half the options meant. I am now thirteen and I am STILL finding new strategies in this game. I have played some of the biggest title games, but I have never enjoyed a game more than Knights of Honor.  Update on that one: Currently, 17, still playing the game. Interesting stuff has been found. Apparently a Muslim King, historically speaking, CAN become the Pope. Didn't know that was Catholics believed in Allah.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game to play even now. Just a warning you have to spend A LOT of time.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever stuck to any game which actually needs long-term gameplay and everyday you keep learning even if you’ve played this game for years? Well, if you haven’t then you don’t have to go to far, just try Knights of Honor. This is simply a never ending game which never gets boring.   Full Review  [www.noobfeed.com] .",
            "review_score": "1"
        },
        {
            "review_text": "Feel so nostalgic. Awesome game for people who like medieval strategies.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It really needs a sequel...",
            "review_score": "1"
        },
        {
            "review_text": "If you are bulgarian you will like this game",
            "review_score": "1"
        },
        {
            "review_text": "What you doing here reading this ? GO BUY IT I can play this for eternities and won't get bored. Quite the opposite, as time passes I like the game even more. I had this game before it became available on steam, if you look closer you can see that this game is from 2005, its 2014 near 2015 and I'm still playing it these days. Why are you still here ? GO BUY IT",
            "review_score": "1"
        },
        {
            "review_text": "Timeless...... and when coupled with mods........epic",
            "review_score": "1"
        },
        {
            "review_text": "10 years of playing this game. on and off and so forth. never gets dull caue it is fun. However, I don't do ground battles cause I got total war for that.",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing this game, this game is what brought me into playing games 10/10 best game ever",
            "review_score": "1"
        },
        {
            "review_text": "I'm not too bad at these sort of games, but I keep getting a butt reaming every game! I've tried turtling and building, going out agressive, diplomacy/spying. What gives?  I mean it looks like a nice game, very polished, have not seen a bug yet. I guess seeing as I got it on a -80% off sale, I'll recommend it.  Gird your Loins, Sirs!!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for like over 1000 hours at least when I was a kid.  I killed the Catholic Pope for countless time, then burned down the Catholic Church. I restored the Roman Empire. I built the Kingdom of Prussia. I built the Austro-Hungarian empire. I built the lesser German Empire. I built Hansetic League. Muahahahah ",
            "review_score": "1"
        },
        {
            "review_text": "Not the best I,ve played, not enough slots for buildings if you want to complete the tech tree, or enough slots for Knights if you want to campaign and keep your home free from rebels. But very cheap so thought I'd give it a try.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay this the reason I am giving this game a negative review is becuase of the late game. The late game is just boring and bd. Once you get very big you have to keep your marshals in your territory in case there is a peasent rebellion. There is always a chance there wil be a peasent rebellion and you cannot change that becuase there is only one upgrade to the tavern. It becomes a crushing revolts simulator in the late game. The reason this hapens is becuase you cannot make your court size bigger so the bigger you get the more thin your army gets.",
            "review_score": "-1"
        },
        {
            "review_text": "Ill invest more hours into this but currently cannot recommend it.   Negatives - UI is a horrible pain, diplomatic but especially economic. Unbelievable they do not give you a popup for needed resources - How do I know the strenght of a castle before attacking? - REBELS EVERYWHERE, puny but burning your stuff. And my nice army next to them does nothing unless explicitly ordered  - Building unclear; do I need multiple buildings in all counties? Do I need one? Such a mess - recruiting; there seems to be a centralized recruiting system somewhere but when I need something its not there. So: Unclear  Positive - Diplomacy, there is some - Trade, except the ui to help you there is some - war. simple but fine",
            "review_score": "-1"
        },
        {
            "review_text": "This is like Age Of Empires + Civilization and then somebody stole all the fun. got it on sale for 0.75$ so mehhhh 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game if you're into history or strategy! Only downside is the lack of a random nation selector.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would conquer everything again",
            "review_score": "1"
        },
        {
            "review_text": "Played game for few hours and it is most frustrating game ever. Got my princess married for German king, he died and I got 2 of his provinces. My prince (hair of throne) got married for Itally princess king died and I got one provice.  5/7 would play again as King of Croatia",
            "review_score": "1"
        },
        {
            "review_text": "Great middle-ages empire game in the vein ot the Total War series. More emphasis on resource control and your officers. Has some unique features I'd like to see in more games like the resources I mentioned. Depending on some random generation, certain territories have certain natural resources. These resources can allow you to train horses or obtain different food items. Having multiple resources can unlock 'Kingdom Advantages' which give you bonuses.  I'd reccomend it for anyone who plays the Europa Universalis or Total War series.",
            "review_score": "1"
        },
        {
            "review_text": "It may have hit and miss widescreen, low quality graphics, no zoom and weak AI But dam it had good gameplay, Tactical decisions, moral and realistic royalty",
            "review_score": "1"
        },
        {
            "review_text": "Lets just develop the economy a little. Oh, damn, I have 10 new regions. Lets just play this a little - conquered europe and it's morning and have to go to school. It is a very good old gamee and there are some mods that you can try to play in 1080p and add some variaty to the game.",
            "review_score": "1"
        },
        {
            "review_text": "On the strategic level, it's a fantastic game. The battles are atrocious though. Never play them myself, but autobattle instead.",
            "review_score": "1"
        },
        {
            "review_text": "Please do ignore my play hours, I've played this game off-steam for years...  This is THE grand strategy game of medieval times, many factions to choose, many battles to overcome and most importantly the spying system in this game is pure awesomeness... Send a spy to a neighboring country to ensure that they do your bidding... is insanely satisfying...  I remember when I played with Ottomans I've sent a spy to the papacy, the dude is elected as pope, I've managed to disband a crusader army against me...   All in all it's a good game if you liked the 'Civilization' part of the Total War and want to play that aspect with more intreguing mechanics...",
            "review_score": "1"
        },
        {
            "review_text": "Needs Sequel badly",
            "review_score": "1"
        },
        {
            "review_text": "[Based to a true story of my first time playing this game]  -I was playing as Germany. -I rallied up my 4 Marshals to conquer the Swiss Confederation. -I ate some lunch -After 30 minutes, I find that all my marshals died in Switzerland -Ragequits -Plays as Switzerland -Fills my one marshal with swordsmen -Lombardy asks for me to join war against Hungary and Poland. -Accepts -6 different Hungarian and Polish marshals suddenly appear and besiege Helvetia -Deja vu, my one marshal wrecks the entire enemy army marching to Lombardy. -More than deja vu, I ask Hungary to become my vassal -He accepts -I ask Poland for the rest of their treasury -He accepts  10/10 would wreck half continent with Switzerland again.  EDIT: Still playing as Switzerland",
            "review_score": "1"
        },
        {
            "review_text": "fun time killer despite its age. makes me wish it has mods though.",
            "review_score": "1"
        },
        {
            "review_text": "For this game to be so aged, it is still by far a very well created game. 10\\10 would buy it again",
            "review_score": "1"
        },
        {
            "review_text": "Guys, you really have to pick this one.. tons of fun in this game.",
            "review_score": "1"
        }
    ]
}