{
    "app_id": 258760,
    "name": "Scania Truck Driving Simulator",
    "release_date": "2014-02-27",
    "developer": [
        "SCS Software"
    ],
    "publisher": [
        "SCS Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Driving",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 830,
    "negative_ratings": 253,
    "price": 6.99,
    "description": "Get behind the wheel of one of the most iconic trucks on the road with this highly detailed Scania R-series truck simulation by SCS Software, developers of Euro Truck Simulator 2.Prove your truck skills - Put your driving skills to the ultimate test with 10 individual truck maneuvering challenges that serve as a practical exam as you...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258760/header.jpg?t=1447359085",
    "minimum_requirements": "最低配備: 作業系統: Windows XP 處理器: Dual core CPU 2.4 GHz 記憶體: 2 GB 記憶體 顯示卡: GeForce 7600 GT-class equivalent 256 MB DirectX: 版本：9.0c 儲存空間: 2 GB 可用空間",
    "recommended_requirements": "建議配備: 作業系統: Windows 7 處理器: Quad core CPU 3.0 GHz 記憶體: 4 GB 記憶體 顯示卡: GeForce GTS 450-class 1024 MB DirectX: 版本：10 儲存空間: 2 GB 可用空間 備註: Logitech G27 or similar racing wheel recommended",
    "reviews": [
        {
            "review_text": "Is this game better than Euro Truck Simulator 2? --- That depends what you are looking for.  I got into the truck driving simulator series when I was curious about my skills being able to operate a trailer and take tight turns. I have yet to see a game that puts you in a city situation where you have really check your space margins when taking a right turn next to traffic.   Euro Truck simulator seems to focus more on highway driving and has a bit of city driving when you get near the warehouse. Thing is though, seems like warehouses are the only things that make up the cities. I bought Scania for the reason mentioned above about city situations, I wanted to be driving in tight situations where turns would be difficult. The game gives a few options regarding driving such as free drive mode (where you pick up a trailer and deliver it, more like time trial mode), driver license where you go through a tough licensing course, driver competition to test your accuracy around obstacles, and my favorite and reason why I bought this game : dangerous drives. Dangerous drives put you in situations where you must drive your truck or cargo through super tight scenarios (such as driving along side of a cliff). My favorite feature of this game setting is that the devs seemed to try to incorporate everyday life scenarios into this mode. One challenge requires the player to back up their truck behind the stage of a rock show, and attach to a trailer, do a 180 through a bunch of parked cars and other band trailers, and drive away.   The controller bindings for this game are absolutely beautiful once you figure it out. I wish more games had this much control over controller settings.   Visuals are nice neat and relevant to trucking. No hiccups or gaps here. Sounds are generic as trucks are all the same brand.   Although I would put it on par with Euro Truck 2, I would say if Euro Truck had dangerous drives I would have most likely skipped over this game and kept with that one. That being said, I would still like to see a truck driving simulating game that puts the player in a city where they have to make turns in busy pedestrian and traffic scenarios. Sure it would be hard to make entire maps for cities, but even have a few to choose from with a few tight roads to outmaneuver through would be cool.   I feel Euro Truck has given in their game a bit more to do, and for that it's rating will be higher than this games. None the less, great purchase on sale.   RATING : 7.25/10       Gameplay   B-     Story / Campaign   C+     Visuals / User Interface   B     Sounds / Music   B-     Replay-ability   C+     Overall    B-      ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": "  Brief Review    A truck driving simulator might not sound like the most exciting of games out there, but Scania is very much a game. This isn’t just another delivery simulation. The crux of Scania Truck Driving Simulator is maneuvering your big rig through a number of dangerous situations and hazardous courses filled with real-life obstacles. You’ll be put into critical situations where flooding or the aftermath of an earthquake, play a part in compromising what would normally be a direct and hazard free delivery route    Pros and Cons     Pros   Great Fun Addictive Gameplay Great Graphics Kid Friendly Leadboards Competitive   Cons   Cant Think Of Any    An Ending    Prove your truck skills - Put your driving skills to the ultimate test",
            "review_score": "1"
        },
        {
            "review_text": "This yet another great game by SCS, however i do not play it that much i will do the odd challenge here and there when i am not playing Euro Truck Simulator 2, this game is perfect for those who find ETS2 too slow and boring with the long journeys as the longest challenge i have done in this game was no more than 3-4 minutes long. Also great for people who are competitive as the game features online leaderboards if you have the money to spare i would definatly reccomend grabbing the Deluxe bundle edition as you will get 5 games and plenty of the DLC for ETS2 for only $50 which is alot cheaper than buying the 5 games individually and they are all just as good as each other even if some are older or you only end up playing ETS2 (which alot of people do) it is definatly worth the money (and the money saved) to get this game in the bundle.",
            "review_score": "1"
        },
        {
            "review_text": "The game isnt very complicated.But has one problem.Not easy interface people dont know how to play it mostly.",
            "review_score": "1"
        },
        {
            "review_text": "For those who are asking if is it worth buying if you have ETS2... I'll say YES. Because this is training you to be better at driving in ETS2... The complicated roads...the parking challanges...they are great and they helped me drive better in ETS2. I think this is a game to buy with ETS2...If you buy it alone...its not gonna help you with too much stuff.",
            "review_score": "1"
        },
        {
            "review_text": "STDS is far more punishing to novice drivers. If you think backing a trailer is hard in ETS2, just wait until you experience the rage-fuelled exercise in misery that attempting the same in STDS turns out to be. Your gear-shifting has to be more accurate, your stopping distances longer, and if you're anything like me, you'll stall the truck roughly 285 times during hill-starts or when manoeuvring at low speed. (Planting your foot on the accelerator for a couple of seconds before releasing the clutch rapidly becomes a way of life.) And if you think you can just hook up a trailer and trundle off in 4th gear like you do in ETS2... I'm afraid not. The Scania you have in STDS is powered by an emaciated hamster with a respiratory infection, and he just can't turn that driveshaft fast enough.  Compared to this, ETS2 is child's play. You spend the vast majority of your time cruising down the Autobahn listening to Def Leppard. In STDS, you're navigating tiny cargo yards strewn with pallets and forkhoists, or squeezing down narrow side streets between parked cars and roadworks. And then, if you actually manage to get to your destination without ploughing into a field or getting yourself stuck in a hedge, you'll spend the next 20 minutes performing a 27 point turn in a cack-handed attempt to slot the trailer into the crevice left between another trailer and those barrels some git left sitting in the middle of the yard.  Most of the truck drivers I know swear a lot. If there was such a thing as the 'profanity olympics', they'd be gold medallists. Now that I've played STDS, I know why. Having said that, it's a lot of fun. You do, after a few hours spent shrieking like a lunatic and cursing the laws of physics, get the hang of it. I can now make deliveries without causing a multiple car pile up in the middle of an intersection. I can navigate the city (no GPS for you, young man) pretty well, and I can even reverse my trailer into position without stalling, punching a hole through a fence or reducing a pedestrian to an unsightly crimson smear on the pavement. I still can't parallel park. But then I can barely parallel park my car, so I'm not that fussed to be honest.  To sum up, STDS is basically ETS2 with mushy controls, crappy force feedback, slightly dodgy physics, somewhat underwhelming audio (the Scania doesn't so much roar as mewl piteously), no career mode, a much smaller map, and a learning curve so steep you'll need a velcro wetsuit dipped in PVA glue to have even a hope of scaling it. Unlike ETS2, it forces you to drive properly -- pay attention to your mirrors, shift gears at the right time, make tiny adjustments to the steering wheel when manoeuvring, and practice, practice, practice. Because it really is a simulator (as well as being a gloriously shameless advertising campaign for Scania), as opposed to a scenic tour of Europe by truck. I love both games, and for completely different reasons, but I would recommend STDS to die-hard truck driving fans, Scania fetishists and masochists only. This is a game that will kick you in the crotch and then laugh about it, but if you're willing to spend the time (and we're talking a lot of time here) mastering it, it may eventually shake your hand and buy you a pint.  Maybe.",
            "review_score": "1"
        },
        {
            "review_text": "They Took The ETS2 Game engine to this. well not the whole thing but its very simaler. Instead of making a company u do chalenges that some are real ones but some are just extremely dumb and u would never do in real life like were u need to drive over a broken bridge. Either from that i love this game. It made me feel like a good truck driver because i cam 17th out of like 2000 on the leaderboard. i recommend.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game trying to learn how to drive a truck is hard but graghics are great and it works excelent no problems here.",
            "review_score": "1"
        },
        {
            "review_text": "most rage inducing game I have ever played I r8 8/8 m8",
            "review_score": "1"
        },
        {
            "review_text": "there is not much to this game, just challenges and online play. No story line or anything. The tasks are fun, hard and take a lot of skill but it is short lived, when you have completed a few challenges it does seem to get repetitive and lame. Compared to the euro truck sims and that this game is a bit of a let down as it lacks story and character.",
            "review_score": "1"
        },
        {
            "review_text": "muchmuchmuch better than ETS2. THIS is the real simulator my friend, this is where you can learn. In ETS2 you just going straight, and there are no real cities and real situations where the space is very limited, and objects block your way. In real life very often you have to manouver between small spaces like houses, cars, objects, and even to park in to your company.  Real truckers will know what im sayin...if you want to be a trucker leave ETS2 ♥♥♥♥♥♥♥t, that gives you nothing but boring driving (in real life the same driving is exciting as well, but that is just a game).",
            "review_score": "1"
        },
        {
            "review_text": "In some ways this game has been effectively replaces, though I think it still it has a good place if you want a realistic truck driing simulator. That place is in the challenges. The challenges here will push your ability to drive the truck to the limit, a limit which seems nearly impossible to reach even if you have played Euro Truck Simulator for a while, because Euro Truck is not nearly as challenging as this. You need to know how to drive the truck masterfully here, and if learning to masterfully drive a truck appeals to you, this is a game worth getting,",
            "review_score": "1"
        },
        {
            "review_text": "NOPE. I guess after one has played Euro Truck Simulator 2 (Same Developer) there is no other Truck Game thats playable.. get yourself ETS 2 (now with multiplayer servers around the world).",
            "review_score": "-1"
        },
        {
            "review_text": "havent enjoyed this game because i´m unable to set the right scale and fov for my triple screen since this one does not allow the same settings that ETS2 have",
            "review_score": "-1"
        },
        {
            "review_text": "I Don't recommend this game.. It's not what I thought it would be. Its not really worth money, at all. The in-game keyboard, is fine, but when you drive, the wheel on the truck is always turned to a certain way, and theres no way of getting it back to its original placement...",
            "review_score": "-1"
        },
        {
            "review_text": "**",
            "review_score": "-1"
        },
        {
            "review_text": "This is definetly a good game.......That is if you want to learn how to drive a truck backwards before you learn how to drive properly",
            "review_score": "-1"
        }
    ]
}