{
    "app_id": 258880,
    "name": "Professional Farmer 2014",
    "release_date": "2013-11-27",
    "developer": [
        "PlayWay S.A."
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Agriculture",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 264,
    "negative_ratings": 320,
    "price": 14.99,
    "description": "Tractors And Farm Machines Get Your Farm Up And RunningThe PC simulator &quot;Professional Farmer 2014&quot; takes the player to the countryside and gives hobby farmers full control in the comfort of their home.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258880/header.jpg?t=1447359108",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel Core 2 Duo / AMD Athlon X2 Memory: 2 GB RAM Graphics: Nvidia GeForce 6800GT / AMD Radeon HD 3650 DirectX: Version 9.0c Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel Core 2 Quad / AMD Phenom X4 Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 560 / AMD Radeon HD 6970 DirectX: Version 9.0c Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "I have a long history with UIG and in all honesty we both(UIG and me) would admit it has not been a great relationship. I was given pre-release access to this game so that, as I quote from UIG 'you will be pleasantly surprised'. Well as I played it....I was pleasantly surprised. You can find a thread labeled 'CE - This game delivers' in the profarm forum if you desire more info into all of that. Now with the review.  Technical: Currently at the time of this writing there are about 5 people saying they have bad frame rates. This means this game runs fine for 99% of all buyers. Which when you think about it, is a pretty darn good ratio. No crashes have been reported from what I have seen. From my side of things it has run very well with only some minor technical issues that I would think will be fixed in upcomming patches. These issues include odd and overly bright reflections from the sun at sunrise/set and from headlights. The occasional piece of texture floating a few inches above the ground after plowing (only noticable when you have camera at the right angle. Some controller mapping issues. All in all though no serious techinical glitches or bugs that break gameplay or the fun level.  Graphics: Graphics are better than FS13 for comparision. There are seasonal changes and with that the foliage and trees change colors and drop leaves ect. It is this area that you will find the small little glitches like I mentioned above. The skybox is well done, have not seen any weather yet so not sure how well that is done.  Playability: The game plays very well. the career mode starts off with a tutorial that takes you through your first year and explains everything like how to use your multi-geared transmissions. Most of the complaints seem to center around these kinds of things. As many players have said why can I only go 24kph, only to get the reply on how to use the gears and achieve 42 kph. So if you do purchase this game, play career at least until the tutorial gets done after the first year. The map is good sized and pretty well done. There are only a single sales spot for crops and bales which is another source of some complaints. I don't mind since in say FS13 you go sell at the best price anyways so in the end your still only selling at one spot most likely. Which leads us to the area this game shines the most. that is farming realism. What I mean by that is with the seasonal structure of the game, the single sales point, the unhurried pace, is more the life of a farmer. I am surrounded by farms in RL and there is only buyer within about 500 mile radius. The seasonal change makes the whole game slower and more relaxed, much like the life of a farmer. Only under extreme situations a farmer might be in a hurry to get something done but the reality is hard work but not necessarily hurried work. Where I find myself in FS13 in a race against..something(time ect). There is no hurry here, no real need to hire helpers even if you own the whole map (although invisible helpers that charge per job are available). Basically it's get up, work til sunset, rinse/repeat. When your work is done you advance the season and start your work again. So maybe more simulation feel? I am sure some out there will not like this in comparision to its rival game. I myself find it a nice fit for a farming game. The equipment is well done on the inside but could use a bit of improvement on the technical/physics side(little things like tires momentarily going in terrain, sliding on a hill a few inches when you come to a stop ect). The amount of equipment is on the smaller end but there is always room for improvement(DLC,maybe modding ability in the future). For the price though there is nothing to complain about as you have everything you need and larger versions to upgrade to. There are 7 crops with one that is a winter only crop(i think) and this one cannot be stored. Crops wheat,barley,canola,corn,soy,peas,luvin. Animals are non interactive and just provide an additonal seasonal income per animal bought. All animal models are well done.  Sound: This area could use some improvement. Some sounds are good some not so good so it is a mixed bag. there is a nice sound feature though. When you enter a vehicle your radio starts to play and you can insert your own music with justa little effort(for info on that how to ect see the 'CE - This title delivers' thread I mentioned above. So probably if I were to score this game by catagories this is the one catagory that would have the lowest score.  All in all it is a good solid release at frankly a pretty darn good price. The devs at the moment of this review are active and it looks like they have the will and time/money to address issues. Hope this review helps those looking into this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lost the motivation after two hours. There is no need to do anything else in this game then pushing a few buttons to earn money. There is no reason to buy new machines, everything happens instantly. If you are using the machines it takes ages. All in all there is no objective, no goal you want to achieve.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is too slow, not pretty enough and not feature rich enough to be considered a worthwhile purchase while Farm Sim 2013 is out there. I own and have played both. FS2013 is miles ahead despite the fact that it's ... well not all that great. At least FS2013 made farming fun even if it is really funny how bad it can be.",
            "review_score": "-1"
        },
        {
            "review_text": "It should be called 'Very slow and boring driving simulator' I am disappointed about this game :( Most of time spent in this game I was driving from one point to another very big distances with very slow vehicle and it is very boring. To go to market for seeds you need spend a lot of time just driving very slow. Same thing to go to bank for loan. They should have gave you a car with faster speed or just fast travel option trough map what by-passes that driving and then you could have to spend more time doing field works. Also lack of animal variety.",
            "review_score": "-1"
        },
        {
            "review_text": "This is by far the best looking Farming Simulator i have ever used,gameplay wise it's pretty good still a few rough edges to smooth but it runs quite nicely.",
            "review_score": "1"
        },
        {
            "review_text": "I am a big fan of Farming Sims, but I was hoping for more than is offered in PF14. Graphics are great, seasons are plus, and the list of equipment without DLC is great, but... there is really nothing new here. I was excited about the campaign mode, but it didn't really add to the experience. I gave up after 5 hours of play.   The game has potential, but it currently doesn't match the gameplay and features of its competition.",
            "review_score": "-1"
        },
        {
            "review_text": "This game, is just a tractor simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "Never before have I truly been a part of soil until I found this game. I feel like this is the best game I've ever played in my whole life. I've since made room in my heart for this game, removing trivial (in comparison to this game) things, like all family, all friends, and a few basic bodily functions like using my legs and breathing. 10/10 would buy DLC.",
            "review_score": "1"
        },
        {
            "review_text": "controls are hard needs better controls more like farming sim",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, but it is a budget game and very limited in scope.   You will find yourself repeating the same process over and over again: plow, cultivate, plant, fertilize, advance 'season', harvest, repeat. Don't expect much variety other than a small variety in plant types all of which are harested with the same machinery except corn which needs a different header and hay which needa a forlift, baler, and trailer.  There are also some basic features missing from the game. The button configuration menu is very limited as is controller support. You sell your grain at a single location with no foreknowledge of what you will get for it. Hiring workers is done instantly (you never see them working) with a pop-up on the screen saying the work was done. At this time there is no official modding.  There are a number of additional features of the game that are stripped down or missing entirely. It feels like they started the game by making the graphics engine and driving physics and then found out that the budget was actually 25% what it was supposed to be and development time was cut by the same amount.",
            "review_score": "1"
        },
        {
            "review_text": "Game was rushed, dumped on steam and I was a fool to buy it. Don't make my mistake.",
            "review_score": "-1"
        },
        {
            "review_text": "Very limited FOV. Tabbing out causes the game to crash.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice and decent graphics overall, though not the top of the genre. Lack of proper AI workers is a major drawback",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would farm again",
            "review_score": "1"
        },
        {
            "review_text": "Friend asked me to plow their field. I drove to their house at 10 mph (their house was 2 miles away) and I plowed their field. Like litterally, I took my plow device and tractor with me and plowed that field. Looking forward to 'Lawn Mowing 2014' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i7 processor 16 gig ram geforce 950 (2gig) run at 4 fps yeah enought said",
            "review_score": "-1"
        },
        {
            "review_text": "when i play the game it freeze my computer wat happening is not steam because can play different not professional farmer 2014",
            "review_score": "1"
        },
        {
            "review_text": "The program as is is slow and jumpy. 'Don't have any problems with the other farming games. I plan of uninstalling the progarm.  I don't have any problems with other games that are intensive.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty graphics though the game requires a decent PC and the physics can be quite glitchy. I'll be switching to Farming Simulator 2015 (Though it isn't perfect either).",
            "review_score": "-1"
        },
        {
            "review_text": "worste game! no comment.",
            "review_score": "-1"
        }
    ]
}