{
    "app_id": 258890,
    "name": "Type:Rider",
    "release_date": "2013-11-06",
    "developer": [
        "Ex Nihilo"
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 1123,
    "negative_ratings": 281,
    "price": 3.99,
    "description": "A typographic odyssey.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258890/header.jpg?t=1519903216",
    "minimum_requirements": "OS: Windows XP Processor: Core 2 Duo Memory: 2 GB RAM Graphics: 3D accelerated DirectX: Version 9.0 Network: Broadband Internet connection Storage: 500 MB available space Sound Card: Compatible SB16",
    "recommended_requirements": "OS: Windows 7 Processor: Core i5 Memory: 4 GB RAM Graphics: 3D accelerated DirectX: Version 9.0 Network: Broadband Internet connection Storage: 500 MB available space Sound Card: Compatible SB16",
    "reviews": [
        {
            "review_text": " Something of an artistic experience // Recommended for a casual night in",
            "review_score": "1"
        },
        {
            "review_text": "I played this as a recommendation for a relaxing short game with easy achivements. Boy was that bad advice. The first few levels are exactly that, soothing music relaxing levels. But after that its a total mess. This is one of those clumsy control games, where it's all luck and no skill, and when it gets a bit harder it get extremelly stressful and annoying. It turns out to be such a tedious and frustrating experience, with some aweful level design. This will leave you raging instead of satisfied, and is far form being the good game that can afford to be this messy and nerve wrecking.   If you want a quick enjoyable game similar to Thomas was alone you're in for a hell of a surprise. Do yourself a favor and avoid this. Much funnier games in the 'clumsy control' category and far better platforming games out there.  You probably own this dirt already since its practically free in every bundle. Just dont bother playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "A beautiful, fantastic puzzle platformer that also happens to be educational, Type:Rider teaches you about typography through the ages. The design is impeccable: each era has a distinct visual and auditory style that is wrapped in a remarkably soothing package. The generally easy game does have the occasional difficulty spike and there are some rare typos/translation errors in the historic entries (nothing rendering them incomprehensible/unpleasant - at least in the English version) but it is definitely a journey worth taking. Don't let it's relatively short game time put you off, your time will definitely be well spent with this game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good platformer. I only used a controller and it worked great. Its an easy game to get 100% of its achievements and aside from being fun, its actually educational. You unlock book chapters in each level of each map and they give background information about the history of human writing and some information on how certain fonts came to be. Reading that stuff is completely optional, so feel free to skip it if you want. Its a short game, I think I beat it around 4 or 4.5 hours, but its a good length for what it is. It you're a fan of platformer games I'd recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing art. The game takes you through time with vivid music, sights, and color. The art of the game holds a truly unique feeling and I would definitely give it a 10/10.  The platforming. Oh, the platforming. It starts out basic, with a few obsticals here and there including references to the era. Brilliant. Until you get to the rest of the game. You roll around as an awkward colon atop giant letters. Doesn't sound bad, eh? It's not until you have a laser shooting giant cat chasing after you and those once friendly letters are now placed in the room by a toddler.  Overall, DO BUY THIS GAME for the art. It is most definitely worth the price for the environments alone. If you hate getting frustrated at sloppily controlled platformers maybe you should hold back until a sale.  Problems:  -Alt-Tabbing from the game cuts the music from the level completely, even after going back to the game. -Imbalanced controls along with poor platform placement. -Some visual errors like rainbows clipping through platforms, but nothing too major.   Overall: 8/10   @Developer Had some weird consistent lag towards the beginning of the last level. Wasn't able to figure out why. Maybe it was the mariachi music over taking my soul.",
            "review_score": "-1"
        },
        {
            "review_text": "Indie, Artsy, Educational, Platformer.  Roll and bounce your balls across an obstacle course. Watch as your balls get squashed, trapped, spiked, shot at, or disappear all together. Learn all about the history of written and typed language. Playing with your balls has rarely been more educational.  I found this game easy, with only a couple of retries on certain sections, I breezed right through the ten levels. But I can see why this might be frustrating for those not adept at this genre. It was good quick fun and I admit I learnt some stuff along the way. Game play and controls are super simple. Nice mix of environments, great backgrounds, good music and sound for each age, and a little touch of logic puzzles to keep things interesting.  I got my copy in one of the eight cheap bundles it has so far appeared in, but it is alo regularly offered at 75% off.",
            "review_score": "1"
        },
        {
            "review_text": "!!! WILL EDIT AFTER FINISHING THE GAME !!!  In short, I really enjoyed Type:Rider, but there are some points I would love to see... revisited?   GRAPHICS: The graphics are nice, they fit on the style of game and yes it is undeniable that Limbo played a strong inspirational role here, which for me is only positive since the topic of the game makes it a whole new thing and I really enjoy this type of 'ambient scrolling'; Don't even think they copied Limbo, because they sure didn't, it is just really the atmosphere that gets similar points!  THE 'STORY': As a graphic designer and typography lover, I HAD to have this game and give it a try. I had little difficulty understanding the game story and in my opinion everything was connected in a extremely smart fashion, but I do realize that people without 'education' towards typography/printing history might not link the things as I do;   Now, to claim 'historical' as a tag to describe the game, a little bit more of in-game action, other than reading the chapters about each Type, would also be requiered.   GAMEPLAY Simple commands are okay, but sadly, very simple and short levels. But still they are very beautifull! Adding a little extra of content to each level and making it a little bit more challenging / long would be a perfect modification to the game!  THE SOUND: It is okay.  My overhall thinking is that the game could: a) have a major update; b) have a TYPE:RIDER 2 to prove everyone how talented the devs are really ;)  Cheers",
            "review_score": "1"
        },
        {
            "review_text": "'Edutainment' used to be one of those words that would send people running to the hills, at least until we developed nostalgia for things like MathBlaster and Encarta Mind Maze. It's not even a term that's used anymore, despite a rise in indie games that actually make good on the promise of being educational AND fun. Which brings us to Type:Rider, a physics platformer based around what really should be the most boring subject imaginable, the history of typefaces. Instead, we have a beautiful, challenging game that manages to make its topic more engaging than any textbook could ever hope to.  Your avatar in Type:Rider is either a plucky umlaut or an alignment-challenged colon, two dots that roll along the landscape like wheels on an invisible car. I know the jump from one ball to two doesn't sound like much innovation in the crowded physics-platformer genre, but this allows for some really clever maneuvers like cartwheel flips, wheelie jumps, and dangling under platforms. You'll need all of these tricks to navigate across the giant letters and silhouettes that make up the beautiful, otherworldly levels. Each level is themed after a period in the history of the written word, everything from primeval script to printing presses to HTML, with gimmicks befitting the era. You'll ski down cursive curves, float on classical notes, hop across postmodern art, and bounce on blinking cursors.  Each level has six asterisks to collect along the main path, 26 letters of the alphabet that require some platforming to nab, and a hidden ampersand (that &amp; thingy) that's quite a challenge to reach. The collectable symbols are a nice touch to keep you going but it's the asterisks that really make the game, because each unlocks a short article about the history of typefaces from that period. You would think that breaking up gameplay with educational passages would ruin the flow of the game, but each is short, interesting, and well-written enough to make for a welcome interlude. I honestly knew nothing about  Claude Garamont  [en.wikipedia.org]  or why  sans-serif  [en.wikipedia.org]  fonts are called that, but I was delighted to learn within the context of the game. And even if you aren't, the articles are entirely optional to even open.  The actual platforming is a perfect match for a game of this nature, challenging but without ever reaching frustrating levels, and with several relaxing segments and thoughtful puzzles. The different periods are visual joys to traverse, and an generous checkpointing system makes it easy to revisit your favorite parts. There's even a secret level in everyone's favorite love-to-hate font that hits the perfect tone for the game. All of these elements make Type:Rider an unexpected gem from a dormant genre, and a very strong case for its return to boot.",
            "review_score": "1"
        },
        {
            "review_text": "+ I like the general mood of the game.  - sometimes when I open the book, then click resume - controls are locked, can't move at all, and have to restart the game. - the screen resolution is capped at the 1366x768 this isn't good for LCDs with higher native resolution. - if I alt-tab and get back to the game - there's no music playing anymore. Till you restart or get to next level. - up and down arrow buttons in the books don't work for me when I click on them with mouse - have to use mouse wheel to scroll or click and drag the text. - when you got to the second book for example. You see it open up... if you close it... and see other book then want to open it up again - you can't. You have to click resume and drive the colon all the way back. There are plenty of poor design choices like this that meke you waste time since the game assumes you will do things in certain order and if you don't follow the exact sequence, you need to do it over again. - game's originally in French - translation is not great.   Still... even with the flaws, it's an unpolished gem - if you want an adventure through the texts of history - literally - you will most definitely appreciate this little game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice ambience, music, visuals, concept, and you get to learn a lot from it. Controls are screwed up tho. Really slow. Other than that, if you are extremely patient, you will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the manliest game on steam. You literally play as 2 balls.  6/10  Still a stupid simple platformer though.",
            "review_score": "1"
        },
        {
            "review_text": "Type:Rider is a platformer that has you play as a pair of dots who jump, swim, and solve environmental puzzles to progress. It’s also an educational game that teaches you about the history of typography as you play. And it looks fantastic. So if you’re a word nerd, a history buff, or a platforming fan, this is a game you’ll want to play.  The art style is downright gorgeous, the music is great and the map design is amusingly clever. Occasionally the controls can feel a bit mushy but it never gets frustrating; the game is very unique and just fun!  It's fairly short but if you can get it in a sale or bundle it's definitely worth it!",
            "review_score": "1"
        },
        {
            "review_text": "7/10 Simple clear and effective. I got this game on the recommendation of a friend who teaches computer design, including typography. Yep, my friends are old-school geeky. Dig it? He told me that the game was fascinating and educational, but also fun. I normally never believe anybody who says that with the exception of Carl Sagan, but I gave it a shot. I was instantly drawn into the game. The controls were simple enough to grasp instantly and I quickliy found myself happily shifting two little dots through an illustrated history of typesetting.  You read that right.  Surprisingly It's a smooth, engaging platformer with a highly original setting. ",
            "review_score": "1"
        },
        {
            "review_text": "Like so many other players, I really want to recommend this game. It's innovative, educational, and visually stunning. However, the control is really difficult, and it soon became too frustrating to continue.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game, beautiful setting and soundtrack. However it crashes on my Linux setup (most recent fglrx drivers) which makes it impossible to complete the game. Other users reported the same problem.",
            "review_score": "-1"
        },
        {
            "review_text": "I love the idea and art of this game.   I hate the stupid cowboy shooting me mid-way through the game in the mine cart. Stuck there for months. Wish I could just skip that level.   Still, likeable enough to keep revisiting it over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful soundtrack, excellent summary of typography and writing through human history, giving good detail of the story behind everyday fonts. Gameplay is pretty spot on, though the controls could be a bit tighter. 11.5/10 would type ride again",
            "review_score": "1"
        },
        {
            "review_text": "I thought that this game had an interesting concept, so I bought it.   This game was much more wonderful than I thought it would be! The music was fantastic, the levels engaging, and that secret level was stupid hard for a bit!  So good.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty game in parts, I'll give it that, but the platforming controls are terrible and you really don't learn all that much about typography.",
            "review_score": "-1"
        },
        {
            "review_text": "Gorgeous game and the music fits the atmosphere perfectly. The texts you unlock are actually informative. Level design is creative, but the platforming is frustrating. Be patient with the book UI or it'll start bugging.  Recommended for typography fans, probably not worth it for anyone else.",
            "review_score": "1"
        },
        {
            "review_text": "I love the idea and art of this game.   I hate the stupid cowboy shooting me mid-way through the game in the mine cart. Stuck there for months. Wish I could just skip that level.   Still, likeable enough to keep revisiting it over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "This is a quirky little game that focuses on the history of fonts/written text. Sure, it sounds boring on the surface, but if you give it a chance, it really ends up impressing.   You play a colon (not the body part) that can roll around sideways or flip around. You have to navigate through various levels, which are separated typically into 4 parts each. The whole level is focused on a particular font and timeline, ranging back from the beginning of time, to the most recent fonts. You collect letters as you explore, from A to Z in order. Also strewn across the maps are asterisks - each one presents a 'page' of a book that introduces a couple of paragraphs of interesting information. You don't have to read them, but for a game of this nature, it would make sense to spend the time learning a little about the fonts of which you are reading at this very moment. I'm no history buff myself, but I definitely got some neat information out of it.   On top of the learning experience lies a robust and intricate platforming game. As you travel onwards, collecting letters and asterisks is fairly straightforward, but there are also some ampersands lying around that are somewhat hidden. Nothing too elaborate, but enough to make you pay attention to the levels. That said, the level design for each timeline is very well done - lots of various jumps and platforming mechanics abound. Some may say that the controls aren't that tight, and that is true - at times it can be frustrating; I found a few moments where the colon just didn't want to make it over a ledge or out of the way of something - but I have played much worse. For a game that charges less than a typical meal, its nothing to really complain about. The music in this game is also pleasant and fits the tone of each timeline.  The game features a few achievements, most of which are standard fare, but one of them is downright evil ('Desperado'). It will make you work for it, but the relief afterwards is worth it. Surprisingly enough, this game comes with trading cards, so if you like those, then that's a big plus. Overall, the game took me a little over 3.5 hours to finish - but that was with getting every single achievement, and I did skim the history pages a little. If you took your time, you could probably get at least 4-5 hours out of this.   Type:Rider certainly came out of nowhere and surprised me. This is not the type of game I normally play, or typically have any interest in. I bought this as part of an 'indie bundle' and decided to give it a shot. What a fresh and unique experience. However, would I pay full price for it? Honestly, probably not, but then again I'm the type that typically waits for the major Steam sales. If you like platforming indies and wouldn't mind learning some interesting history of fonts, then give it a shot!  PS - If anyone buys this and beats it - make sure to check things out after the credits. It's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I did enjoy the art, style, and music of this game, but some levels got seriously frustrating for a 100%er like me. Even still there can be very tricky and frustrating parts at times. After all that I expected the game to be sort of a calm, nice, 'breeze' of a game which is personally what I would have preferred. Even the funny Comic Sans bonus level was more frustrating than fun. However this is likely just me being snoody, so I will reccomend this game due to it's really awesome style and music",
            "review_score": "1"
        },
        {
            "review_text": "I love the atmosphere/style of this game. It's not a very long game, but it's fun nonetheless, and I'm really glad I got it. It's not expensive, either, so you don't have much to lose by trying it! It's fairly relaxing and straightforward, but it holds my interest quite well.",
            "review_score": "1"
        },
        {
            "review_text": "⁨",
            "review_score": "1"
        },
        {
            "review_text": "wow... just wow! I wish I can learn my art history class like this! Amazing BGM! Each era has its uniquely picked corresponding BGM ! You can enjoy the music (of course, the game as well) and learn something about art at the same time!   Amazing game! Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "A really fun and educational casual platformer, especially for those who have an interest in art/graphic design and history.  You jump around through linear levels, collecting letters of the alphabet and reading material dispersed throughout. And you can read it whenever you feel like, even skip it entirely if you want. It's pretty mellow like that, but I think it's engaging just enough with the challenge factor while still managing to be a pretty relaxing experience. It's a pretty short game if you're just looking to blast through the levels, but I got some extra time and enjoyment out of it by reading all the material as I went along and collecting everything. Finding all the ampersands should prove to be a particular challenge, since there is one per level and they are quite hidden.  I am proud to say that I like this game enough to have gotten every achievement, including that dumb Facebook/Twitter post one. I don't even have Facebook or Twitter, so this sort of achievement is dumb and irritating to me. But hey, I just borrowed my sister's account to get it. I still really like the game, but this sort of thing annoys me. A video game's achievements should never have anyhting to do with external social networking sites. This is nothing significant in terms of the game, but it's something that stuck out for me and I though it was worth mentioning, since I know there are others like me who aren't really into Facebook or Twitter, even if we may seem few and far between. We anti-Facebook people gotta stick together, y'all! We should totally make a Facebook page for our kind.  Anyway, this being a game about ♥♥♥♥ing fonts, it's a very niche sort of game. But I happen to really like font, so this game appeals to me, that very specific sort of person who enjoys graphic design and history and delicious, glorious fonts. Gameplay-wise, it's nothing new or groundbreaking; it's a very simple platformer and there isn't much to it. But, again, if you like art, history, or art history, this is a fun (and educational!) trip. And I commend any game that can be fun AND educational, and also be centered around something as esoteric as fonts.",
            "review_score": "1"
        },
        {
            "review_text": "The only flaw of this game is that there could be audio texts.  Very much information included on history of typography and it's really cool that you can play and afterwards learn something! I will admit that gameplay could be a little more interesting, but it's a platformer game. They have bounds and this game hasn't quite reached them.",
            "review_score": "1"
        },
        {
            "review_text": "The gamer in me wanted nothing to do with this title, but the designer and writer in me really wanted to see what a game about typography was all about. It's about typography. Every 'puzzle' or so, you (really should, if you want to understand the theme of the level you are playing) read a wall of text about that period in the history of typography. But there is TOO MUCH TEXT! There isn't a lot of puzzle or platforming in this game, everything is straightforward: hop around the alphabet of whatever font theme, collect the little mini-alphabet of whatever font theme, read the walls of text about the font theme, level complete. Most of the difficulty comes from unrefined controls. I love the idea and motivation behind this game, but it is a game. I wish they had really spent time on the game and level design, creating puzzles that gradually provided the same information written in Type:Rider's walls of text in a much more interactive and gratifying manner. Also, the music was really good.",
            "review_score": "-1"
        },
        {
            "review_text": "Type:Rider proves that educational games can not only be fun, but also look incredible. Set to brilliant soundtracks that are somewhat associated with each typeface, Type:Rider takes you on a journey through the history of fonts.   The art - all based on typograhpy - is simply stunning and the level design is ingenious. The mechanics and gameplay are fairly trivial and there really isn't much of a challenge until the 'secret' level which, depending on your disposition, is either the best or most infuritating level ever created in a game. I did encounter a couple in game bugs which necessitated a restart of the level but this didn't dampen the experience at all. The experience itself is quite short, though I do believe it's the right length given the simple gameplay.   Would I recommend it? Most definitely, if only to experience the beautiful art and brilliant level design.",
            "review_score": "1"
        },
        {
            "review_text": "Casual Games with History as main feature  + Good Graphic + Good Music + Deep History  - Nothing since it's casual and History games  = 8/10 from me",
            "review_score": "1"
        },
        {
            "review_text": "Played this during an Indie-Game-Saturday event. Short little title that is worth the trip. I would probably wait for a sale or a bundle as 6.99$ is a bit steep given two hours of gameplay to finish it though.   The intentions are really good with this game. Great trip through time and font-related goodness. Platforming is nothing fresh nor difficult. Decent music and cool graphical style and lines. No real story.",
            "review_score": "1"
        },
        {
            "review_text": "Pleaseful-looking interactive narration of the history of the typographic characters. Only for people interested in this matter, since the game is quite lame.",
            "review_score": "1"
        },
        {
            "review_text": "It is a beautiful little indie game. With its simple yet pleasant graphics (imagine LIMBO game in color version) and relaxing music, combined with simple puzzles and gameplay, this game brings you a very nice educational note by collecting informations through the game, where you learn about writting and fonts through history. Overall, a nice indie game. p.s - I dare you to find hidden level. :)",
            "review_score": "1"
        },
        {
            "review_text": "Bouncing balls around on the alphabet is what I would imagine someone does with a degree in English.",
            "review_score": "-1"
        },
        {
            "review_text": "A simple but beautyfull learning game.",
            "review_score": "1"
        },
        {
            "review_text": "It's basically next gen Nightsky and with aspect of teaching. Much recommended,",
            "review_score": "1"
        },
        {
            "review_text": "Boring gameplay, 2/10 would play again. A couple of informations about letters you could also gain by searching on Google etc for about 5 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just amazing.",
            "review_score": "1"
        },
        {
            "review_text": "The controls are extremely clunky and frustrating. The font history you unlock is also boring, they look like they were taken from a textbook rather than being interesting pieces of informations as rewards. There are way better platformers out there, and the additional features in the game cant make up for the terrible gameplay. The artstyle alone cant justify playing a game.",
            "review_score": "-1"
        },
        {
            "review_text": "'Typography was always this boring you just never realized it before.' - Warp Door",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes me say 'ow my balls' alot.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not available nor getting any support for Linux.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute trash. it's not a game, if i want i can watch a documentary about human language and writing, controls are horrible, also big lag betwen when i push a button and drags its f...ing a.s, useless, i'm starting to really hate indie/small games, they seem to hate the players, WHERE IS THE FUN MAN ! I tell you where it is, in older games i have 100+ hours of fun even if i fail 100+ times i get more fun out of those. JUST STOP BUYING SMALL GAMES PEOPLE IT'S NOT WORTH IT !  Full of bugs, and why do i need an get to facebook/twitter achievement, i don't use them.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, with very nice sound and graphics. Great if you'd love to know more about typography. My only complaint is with controlling your two characters, as moving one without losing the other can be very tricky. Checkpoints are frequent, though.   Casual, lighthearted, and even funny, this is a very cute platformer!",
            "review_score": "1"
        },
        {
            "review_text": "Such fun game. Who know learning about fonts could be fun. Fascinating game.",
            "review_score": "1"
        },
        {
            "review_text": "Kind of a simpler, nerdier and more educational version of NightSky, as far as ambiance goes. A short and mildly interesting thing if you don't know anything about typography and want a bit more interactivity than just googling for details would offer.  Also, the secret level at the end made me laugh. :P",
            "review_score": "1"
        },
        {
            "review_text": "This is a 2D artistic game in which you literally roll through the evolution of drawn/written communication; there are some simplistic puzzles in teh game and you collect pages to read as well as characters.  One can choose to read the historical blurbs one picks up that is in each backdrop, or just play through the game and enjoy the background whilst not reading a thing (the reading/learning is optional).  I am not the type of person that would go out and buy a game like this (in no way do you need to be a gamer, simply rolling and jumping)... Now that I have played it and have a better grasp about what it is, I say it is deifnitly worth picking up if you can get it for ~$1, albiet I am a cheap (sales) gamer, so it might be worth more to oneself.  If you do see it for one doller and that is nto cheap enough for you, but you know you'll buy more games on steam... it has trading cards so you can always pawn those off to recoup some of your money.  Whilst the mechanics are simplistic and the gameplay is relatively speaking short, if you go on the metric a buck and hour for entertainment, it definitly surpasses it. I liekd to read the pages though... if you really wanted to you probably could finish the game far faster (maybe an hour or less).  ITo recap, this is a game that is worth playing for it is unique, artistic, and you might learn something... and is definitly a game I could see being played in elementary schools to utilize as a teaching tool.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this to all my designer friends. It's unique and atomspheric. The music really stood out for me. It's been a while since I enjoyed a platformer and this was nice and short. The bonus level was hilarious. Ah, comic sans, when will you finally wither away into obscurity?",
            "review_score": "1"
        },
        {
            "review_text": "Completely broken on Linux. Unplayable. Screen is zoomed in so you can only see part of what's going on. Other things are broken. This is an utterly horrendous port.",
            "review_score": "-1"
        },
        {
            "review_text": "Artistically very thematic and beautiful, with calm, nice music, it has horrible 'physic platforming' gameplay. The centre of gravity for two connected active elements could be only guessed; the bouncing/jumping is impredictable and in many places imprecise which leads to many frustrating deaths. Respawn is fast but still, the whole process is annoying. You still can play though up to the end and some micro-puzzles are clever but the whole gameplay feels very lose and, in many places, unfair. Two or three bad checkpoint locations could spoil the whole experience. This game would do much better as a precise platformer with better controls.",
            "review_score": "-1"
        },
        {
            "review_text": "This is more of a maybe than a flat out No. This game is kind of a cross between a 2D platformer and a Wikipedia article. But the two sides of it are pretty much completely separate. You won't learn anything WHILE playing the game unless you pause and look at the unlockables.   The graphics are very stylized, and look good for what they are. The main issue is that the game is slow moving and fairly difficult to control. There are moments where it tries new things like a minecart ride, and those are always more fun than the normal gameplay. Give it a try during a good Steam Sale or giveaway but that's as far as I'd go.   PS- Ignore the time played. I spent about an hour and a half clearing the main game but left this running to get the trading cards. Finding all the secrets would probably add another hour or two.",
            "review_score": "-1"
        },
        {
            "review_text": "Super fun and educational! Music and gameplay is beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Roger Ebert may have famously declared that 'video games can never be art,' but Type:Rider proves that art can be video games.  As someone who studied typography in college, I found this game to be a joy and a fun way to have a historical refresher course.",
            "review_score": "1"
        },
        {
            "review_text": "The concept behind Type:Rider is pretty cool. As you go through each level, you can collect objects that detail the history of the different types of fonts, their creators, and the reasons behind their creations. It also has surprisingly interesting and well-designed levels and an equally good soundtrack.   The one major complaint, as others have noted, is the control of the character. The character is a colon and if you've seen the toy car that has wheels large enough so that it can be driven right side up or upside down, then you'll know how the colon will act like when controlling it. Sometimes the colon will flip over while jumping up steps because it runs into the wall. Moreover, when pressing a direction key when the colon is in the air, it'll rotate while moving in that direction. This can be problematic when trying to jump into a small gap and the colon is aligned vertically instead of horizontally, so the character will bounce off the entrance instead of getting through. Finally because the game is physics based, the colon has quite an amount of inertia so controlling it can be a bit sluggish when fast reactions are needed.  If you're able to get used to the controls, then overall this is a nice, interesting game. I'd be interested in seeing the developers create games like this but with other concepts like the history of Rome or China.",
            "review_score": "1"
        },
        {
            "review_text": "Type:Rider is an interesting little informational game. On the surface, you take control of a piece of punctuation, and race it around a variety of levels based on different typesettings throughout the ages. As you go, you collect various collectibles to unlock information about typesets throughout the ages. Overall, the information presented is few dry and factual, leaning heavilly on the game to provide the fun aspects. The game has a fairly easy beginning before it starts adding mechanics to up the difficulty, ending on a bonus level made to be ridiculously difficult to complete.  Overall, I'd say it's a fun little game, but it's probably not for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun little game that gives the history of typography and is very interesting. The game itself is a puzzle/platform with some interesting puzzles most of them are pretty simple though. Each different font/typography style gives the atmosphere of the time period it was created in. Although this game is really short it is very interesting to learn the backstory of typography.",
            "review_score": "1"
        },
        {
            "review_text": "A game about typograhpy in nice enviroments, where you play with two slippery balls. Ned I say more?",
            "review_score": "1"
        },
        {
            "review_text": "Lack of typography in a typography game. Good job.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a nice little platformer with very simple controls left right and jump. However that doesn't make it boring, there is plenty of hazards and unique elements to keep you entertained, theres even a few simple puzzles and minigames thrown in for good measure. Reminds me of portal and limbo in places.  If had to pick out a fault the physics can make your controls a bit wonky from time to time but thankfully it saves progress fairly often. I think without those wonky physics though it wouldn't be half as much fun to play.  After completing the game I can honestly say for a casual game it was a lot of fun to play and would recommend giving it a go. I just wish there was few more silly levels thrown in.",
            "review_score": "1"
        },
        {
            "review_text": "A really good platformer, really instructive.  May not be the game of the century, but it's actually pretty good for what it is. Playing this game was really a good time, and just for the knowledges it shares, it's a beautiful game.  My bad points are not on the gameplay, but on the physics, which can be pretty random sometimes, making you fail with no real good reason.  But this game have great good points, such as scenario... oh wait no. But knowledges of course. It's very instructive, and I like that. And what you have to know about this, is that you are NOT forced to read all this stuff. Except if you want the achievement, but the game can be tricked easily I guessed. And there's a little surprised at the end of the game which is really funny. The difficulty is not really high, but keep increasing as you pass the levels, asking you to play better. I feel the difficulty is fine for this game. We don't want it to be a really hard game, so if you want some challenge, that may not be for you...  But this game surely is a really interesting experience, and I warmly recommend it to anyone who likes platform games, typography, and why not learning stuff. Good game, really. PLUS: you can give it a try on Arte's website. You can play the first level at least, but it really is a tutorial, really easy. That being said, it still can give you a good idea of the game's atmosphere. Which is really good.  OK that's all. Hope you'll give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Got sniped more in this game than in tf2",
            "review_score": "1"
        },
        {
            "review_text": "Recommended: maybe. Arte is surely a great tv channel/website/organization: this game's graphics are flawless. The 'only' big flaw is the control system, due to the peculiar physics of the game. Controlling two deformable dots is not simple as it sounds, and, though the first levels are really trivial, it becomes really hard later on due to the fast-paced playtrough that doesn't go very well with those balls bouncing around restlessly. 10/10 on the concept and subject, 2/10 playability.",
            "review_score": "1"
        },
        {
            "review_text": "Got it as part of a bundle. Conceptually it's cool and looks nice.  Execution is shoddy. Prepare to be frustrated with the controls and collectable typeface glyphs that are way too difficult to get. Nit, but in a game about typography I'd expect the informational text to be better written and the layout to n o t b e p o o r l y done.  Put an hour into it before I was more frustrated than amused. Will probably run it in the background to collect the cards. :P",
            "review_score": "-1"
        },
        {
            "review_text": "This game is gorgeous, stalyish, and actually fun and educational. That's pretty rare. When it flows (like in the Claredon level) it works marvelously, and with the exception of the last level the platforming never felt frustrating. The unfortunate thing is that there are some minor technical hitches (for example, reading typography history that you just got when you're in a stage with a non-standard zoom level) that prevented me from enjoying the game 100%. Overall though I'm really glad I got this game and had a very fun evening playing through it.",
            "review_score": "1"
        },
        {
            "review_text": "A simple, quite easy and VERY interesting game. It does not take too long to finish it, a bit longer to get all achievements. The story of typography as presented is interesting, unfortunately the Italian translation is very poor (really TOO much typos!).  Not an epic game, but if you have a couple of spare hours it definitely deserves a try.  The music is very good, the game physics are also funny.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! I love this game, kept me hooked from start to finish, although I am into design and typography so that helped. I had to smile at the secret hidden level at the end of the game which was the hardest of them all not having a reset point and having to start from the beginning each time!  It was a great challenge - thoroughly enjoyable and relaxing game!  What's it like to play? Well if you imagine one of those dirt bike games where you have to get your motorbike over all the obstacles using balance and acceleration. It's like that but removing the bike body and just having the two wheels of the bike and your obstacles are letters and fantastic artwork.",
            "review_score": "1"
        },
        {
            "review_text": "[insert sophomoric humor about playing with balls]",
            "review_score": "1"
        },
        {
            "review_text": "A series of articles about fonts punctuated by puzzles for some reason.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game to feature a colon since Surgeon Simulator 2013.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay-wise, it's OK with some fun moments and some interesting moments.  However, surprisingly, I found the booklets teaching about typography (and occasionally art) to be the best part. Way more interesting than I would have expected a game about fonts to be.",
            "review_score": "1"
        },
        {
            "review_text": "Nice only if you're interested in typography - although the informations are completely separated from the gameplay: you simply find articles while playing.  There are better platforms around. 6,5/10 - if you like platforms AND typography  5,5/10 - if not interested in typography",
            "review_score": "1"
        },
        {
            "review_text": "Type:Rider is an elegant and humble platforming physics game with an emphasis on collection and only three inputs: left, right, and jump. You are a colon -- a grammatical one, thank goodness -- who must travel through the history of the written word, from beginning to quasi-modern times, one font face at a time, collecting letters and such as you go; perhaps to understand the meaning of your own existence. Fair warning: If you're not at least mildly interested in reading about typography, you won't be terribly happy with this game.  Type:Rider isn't complicated, as there isn't any combat or anything. You have infinite lives, and death from obstacles or falling down pits will just put you back a few seconds. It does however have puzzle segments, usually focusing on weight or game physics. As your character is composed of two wheels, more or less, you can stand on round things and move to spin them. Each level also introduces new gimmicks such as wind or water jets that will add significant velocity to you on touch.  This is at heart an educational, scholarly game - each time you pick up an asterisk, you receive a new article on another element of typography. They're not terribly long articles. They take up the right half of the screen and usually require a little bit of scrolling. You can instantly skip through these if you don't care, but they are more or less the entire point of the game.  Play this game if you're not averse to reading encyclopedic-style entries on the history of typography. Otherwise, you probably won't get too much out of this.",
            "review_score": "1"
        },
        {
            "review_text": "Lightly challenging platforming that takes you for an informative history of the people and execution of the design and printing of iconic fonts. A good afternoon’s worth of punctuation platform play. If you have thing for letters and gaming then I think this will be just your Type.",
            "review_score": "1"
        },
        {
            "review_text": "This is an educational game. While I don't have anything against educational games this one is quite simply boring: it's basically tread further on the terrain while encountering mild obstacles but every 5 minutes dropping an article on you - that's supposed to educate you about typography and language. meh. The ONLY positive thing about this game is that it looks very stylish and pretty but it's boring to tears and not engaging at all.  kudos for the bold attempt, you don't see educational games these days but this is a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Its shiny... Like a nickle... BUT NOT WHAT I WANTED",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty good. ♥♥♥♥ the Pixel level though. Seriously, ♥♥♥♥ the Pixel level. I absoutely hate it. Aside from that, the game made learning history fun, so good for that!  7/10",
            "review_score": "1"
        },
        {
            "review_text": "A fantastically atmospheric interactive journey throught the history of writing :)",
            "review_score": "1"
        },
        {
            "review_text": "I though it was a fun, simple, short platformer/puzzle game. And I was right. It has great music and amazing art. Well worth the few bucks in my opinion. But seriously though, Type:Rider has out of this world levels.",
            "review_score": "1"
        },
        {
            "review_text": "As a graphic designer I felt in love with this game immediately. You're controlling these two dots while making your way through typographical obstacles. And best of all: While playing you learn about the biggest fonts in history! Worth a try even though you might not be into typography.  - You gotta love the secret level, I promise. Trololololo, L O L.",
            "review_score": "1"
        },
        {
            "review_text": "Another beautiful game, the graphic and the music ... it is very challenging to solve as it is not easy to move around inside the game. It requires patient and stay intact being calm to conduct this game. I just enjoy being inside the game ... the whole thing is mesmirizing, going back through times to read the history of the typhography ....",
            "review_score": "1"
        },
        {
            "review_text": "You think Limbo was a great? Oh, boy! You are here for a treat!  Guess what, this game sucks even more! Yay!  You can have your 2d black surfaces platformer with a BLACK BALLS as your character. MORE HIDDEN MEANING OMFG!! AND there is no story whatsoever! Don't you hate stories? Bah, story is for losers.   But wait, there is more! This game is supposed to be educational, and gives you info about letters, and... words..and writing....and some amasing articles from wikipedia about...all that...  Oh, and no. You don't type in this game. No. This is not that kind of game. You... just collect letters. Yeah.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun and fascinating exploration of the history of typography, beautifully presented at every level. A must-play for keen artists, writers and visual historians!",
            "review_score": "1"
        },
        {
            "review_text": "Nice simple physics platformer that kids (6+) will like. A decent number of levels. Sometimes challenging.  Works fine under Arch Linux 64 bit with an nvidia card.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics and sound are so cool! I never thought that typography can be something interesting. But with this game you're be able not only to just play, but also teach so much about typography. -Volcano Monster 2015",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyment of Type:Rider will likely hinge on one's interest in, or curiosity about, typography. As a platformer the game is rather standard, though the two dots (colon?) are somewhat unwieldy. Nowhere is this more evident than the in the bonus level, modeled on Comic Sans MS and some of the internet's more hackneyed tropes. The level requires a degree of precision which is hard to gauge from the low level of detail presented by the player avatar. That being said, this mostly isn't an issue, as the game is rather easy as far as platformers go, the puzzle levels are relatively simplistic, and the game is forgiving as well, with frequent checkpoints, making it suitable for more casual platformer players.  As far as integrating the educational material into the gameplay goes, it doesn't. Information about the history of type is present in snippets of text that are picked up in the form of collectables in the levels. Most collectables are rather easy to find, save one that I noticed several Let's Play videos missed. Also 'missed' is the particular reason for Comic Sans's failure. As a typesetter once told me, CS was intended to be used at a 6 pt size. Unlike many other typefaces, CS is completely legible here. When made larger, it comes to look ridiculous. While I'm at it, the game misuses the word 'font,' which actually refers to a particular size, thickness and style of a typeface, not merely the typeface. That being said, I still found it pleasant to take breaks from the action for an illustrated slice of the history of type.  In spite of its shortcomings Type:Rider is a breezy, short game with handsome presentation that should make a nice parfait for afficianados of the printed word.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyment of Type:Rider will likely hinge on one's interest in, or curiosity about, typography. As a platformer the game is rather standard, though the two dots (colon?) are somewhat unwieldy. Nowhere is this more evident than the in the bonus level, modeled on Comic Sans MS and some of the internet's more hackneyed tropes. The level requires a degree of precision which is hard to gauge from the low level of detail presented by the player avatar. That being said, this mostly isn't an issue, as the game is rather easy as far as platformers go, the puzzle levels are relatively simplistic, and the game is forgiving as well, with frequent checkpoints, making it suitable for more casual platformer players.  As far as integrating the educational material into the gameplay goes, it doesn't. Information about the history of type is present in snippets of text that are picked up in the form of collectables in the levels. Most collectables are rather easy to find, save one that I noticed several Let's Play videos missed. Also 'missed' is the particular reason for Comic Sans's failure. As a typesetter once told me, CS was intended to be used at a 6 pt size. Unlike many other typefaces, CS is completely legible here. When made larger, it comes to look ridiculous. While I'm at it, the game misuses the word 'font,' which actually refers to a particular size, thickness and style of a typeface, not merely the typeface. That being said, I still found it pleasant to take breaks from the action for an illustrated slice of the history of type.  In spite of its shortcomings Type:Rider is a breezy, short game with handsome presentation that should make a nice parfait for afficianados of the printed word.",
            "review_score": "1"
        },
        {
            "review_text": "A okay game with some lovely visuals, let down by terrible controls which provide the only challenge to this game as the puzzles are incredibly simple.  Unless you buy this dirt cheap, it's not really worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "an amusing, dreamlike romp through the history of typefaces coupled with the worst bonus level i've ever experienced in any video game ever",
            "review_score": "1"
        },
        {
            "review_text": "Simple game mechanics, beautiful design work, terrific music, and educational to boot - what's not to love? Recommended for puzzlers who love the lore of language in its visual form and for players who want something a little different.",
            "review_score": "1"
        },
        {
            "review_text": "Got sniped more in this game than in tf2",
            "review_score": "1"
        }
    ]
}