{
    "app_id": 258910,
    "name": "Citizens of Earth",
    "release_date": "2015-01-20",
    "developer": [
        "Eden Industries"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Comedy",
        "Turn-Based"
    ],
    "achievements": 50,
    "positive_ratings": 241,
    "negative_ratings": 69,
    "price": 9.99,
    "description": "As the newly elected Vice President of the World, it's your job to save the Earth by recruiting friends, family, and the local townsfolk! ...A true politician would never get his own hands dirty, after all!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258910/header.jpg?t=1554202872",
    "minimum_requirements": "OS: Windows XP or above Processor: 2.2 GHz Dual Core Memory: 2 GB RAM Graphics: 512 MB NVIDIA GeForce 9800 / ATI Radeon HD 2600 XT Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows Vista or above Processor: 2.8 GHz Dual Core Memory: 4 GB RAM Graphics: 1 GB NVIDIA 460 / AMD Radeon 5870 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "An RPG modelled after Earthbound in many ways, yet comepletely original in plenty of others. The recruitment system is unique and fantastic, and the dialogue is hysterical. The game looks and feels great. Having played Earthbound, I'd say this game is pretty dang close to it. Definitely would reccomend to anyone, even those who aren't RPG fans.",
            "review_score": "1"
        },
        {
            "review_text": "Citizens of Earth is a very comical, not to difficult JRPG that feels a little bit like earthbound. This game does some things perfectly and other things not so much. The voice acting is perfect, the writing is very funny, the music is great, there are a ton of different abilites you can expiriment with, and each citizen has a unique talent you can use out of combat. ( For example the musician will let you change the music to any music within the game at any time ) The way you go about collecting citizens is done very well and there are a bunch of neat side missions in the game too. However, the combat is kinda bland at times, especially later in the game, and its very hard to avoid enemys when you don't want to fight. They can see you from very far and will chase you down. This is probably the thing I hated most about this game. Luckily, after you beat an area the enemies run away from you when you walk by. The level design in this game isn't that great either, its usually some mazelike area littered with the same three enemies. You end up just constantly battling enemies until you find the right direction. Even so, I liked it probably way more than I should have. I'd recommend it if you like funny games or if you are looking for an rpg along the lines of pokemon, where the combat isn't to complicated and there's collecting to be had.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I ever played",
            "review_score": "1"
        },
        {
            "review_text": "-Spoiler-   This classic-style rpg is pretty epic and funny. I like it how you can travel from place to place in ' unique ' ways. I snuck into the capital building and the front desk eagle-man said something like ' Since I'm the VP of the world, doesn't mean that I don't have to pay for a room '. I wanted to knock his head off and his twin at the capitol building.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little game. It crashes occasionally but thanks to auto saves I haven't lost much progress.",
            "review_score": "1"
        },
        {
            "review_text": "The game promises a mixture of Pokemon and Earthbound, and definitely delivers. The game's tone is fun, the humor generally works, and the gameplay seems pretty fair. Though it is a bit glitchy, and I confess i'm only an hour and a half into it, I definitely recommend this to anyone interested in a good, fun RPG.",
            "review_score": "1"
        },
        {
            "review_text": "The Vice President of the world... Still living with his mom.... Can´t sort out his dirty laundry and still plays Pokemon - sort of!  Gotta catch em all! All of his friends and good people and fight the Opposition Pikachu style. Topped off with a great humour and story. I definitely will keep playing a while to find out what to do with the dirty socks that are still in his inventory... ughhhh...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing RPG game and though it may not give you the same sense of adventure as Earthbound etc. , It's still amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Finally an RPG that is unique in a genre that is full of the same old stuff over and over again. All the special moves are fun and creative instead of the boring, overdone magic/spell abilities that every RPG ever made has. It reminds me of Earthbound and it is every bit as fun. There is no way a true fan of RPG's will not like this game. I have played 100's of RPG's and I would like to commend the team behind this game on a job well done. I supported the Kickstarter project that failed, and I am thrilled to see the game finally here. I wish there were two thumbs up for special games like this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game with classic JRPG charm, a ton of influences from games like Earthbound(which is always welcome), and a light hearted comedic tone that reflects on(and sort of embraces while picking fun at) culture in general.   I love the fact that the politicians are completely useless, but the citizens are all awesome and unqiue( just like in real ife ;) ).  The great thing about this too is that you can play it in spurts or in a marathon depending on your mood. It doesn't force you into a corner with that.   Favorite Music Track: Boss Battle ",
            "review_score": "1"
        },
        {
            "review_text": "This is the most fun I've had playing a retro-style turn-based rpg since playing an SNES.  Cool unique mechanics, goofy and entertaining story and graphics, tons of secrets/quests, and a great soundtrack too. These aspects easily make up for the somewhat high price as compared to other games of the genre.  Highly recommended to anyone who enjoys this style rpg.",
            "review_score": "1"
        },
        {
            "review_text": "What appears to be an Earthbound ripoff at first glance comes with a unique battle system that has nothing in common with its inspiration.. My main complaint is that enemy variety is a bit low.",
            "review_score": "1"
        },
        {
            "review_text": "right away the game reminds me of earthbound which is always a plus and i highly recommend this game but keep in mind that this game needs a update mostly to keep the game stable espicilayy during the moonbucks area where the game seem to flicker",
            "review_score": "1"
        },
        {
            "review_text": "Capitalism at it's finest. Stupid crazy game. Play it now suckas.",
            "review_score": "1"
        },
        {
            "review_text": "[s] Can't believe I paid $7 for this ♥♥♥♥. Battle is simple but complicated. Yeah, that confused you and me.   The world is huge. Maybe bigger than South Park: The Stick of Truth, which sucks because SPTSOT was $60 compared to this $7 ♥♥♥♥.   Not to mention the content. SPTSOT has tiny amount of contents and replayability compared to CoE. That's what pessimists(realists*) would say.The optimists(and realists) would say 'CoE has more amount of content and replayability than SPTSOT.'  Dialogues are funny not because they are funny, but because every character is a stereotype. You might find Nicki Minaj from one of them. deym  Level up system is a bit complicated for noobs because of the different bonuses given depending on who are in your party when one of your characters leveled up. Mind = blown...  Performance is a stable 60fps. I expected an eye-gouging 120+fps but well, meh. I had 1 crash during my 10-hour playthrough and that was when I entered a graphically-abused sandstorm map, after I left the game while multitasking for about 30 minutes or so. tsk tsk  And they freaking lied about the 'Partial Controller Support'. I uncovered the lie when I used a Logitech F310 so I found out that it should be 'Full and Partial Controller Support' or simply 'Full Controller Support. *sigh*  [/s]  P.S. I haven't played SPTSOT for more than an hour using a, you know, 'free' distributable copy. *wink* *wink*  So, why am I even comparing CoE to that game? /facepalm",
            "review_score": "1"
        },
        {
            "review_text": "Cannot recommend this game. Nothing fun here for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I wasn't expecting to enjoy this game as much as I did, I've read many mixed reviews about it so I played with low expectations and actually ended up loving it.  It's quirky from the beggining to the end, the artstyle is very appealing, the characters are lovable and it gets surprisingly addictive trying to recruit them all. Exploring around is very fun.  I'd say the difficulty is a little off, the combat system can get complex but I almost never really felt the need to actually plan too much which team I'd use, the difficulty can be changed but it gets tedious as battles start to take too long to finish.  Overall I really had a blast and 25h of gameplay passed very quickly.",
            "review_score": "1"
        },
        {
            "review_text": "its also on wii u !!!!",
            "review_score": "1"
        },
        {
            "review_text": "A very casual and forgiving RPG with a perfectly weird story and loads of content. I'm only 9 hours through at this point but I will finish the game before long. It kindoff feels like playing Pokémon to be honest.",
            "review_score": "1"
        }
    ]
}