{
    "app_id": 258950,
    "name": "Montague's Mount",
    "release_date": "2013-11-19",
    "developer": [
        "PolyPusher Studios"
    ],
    "publisher": [
        "PolyPusher Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Walking Simulator"
    ],
    "achievements": 20,
    "positive_ratings": 241,
    "negative_ratings": 168,
    "price": 3.99,
    "description": "Montague's Mount is disturbing psychological thriller set in the bleakness of an abandoned Irish island, featuring exploration and challenging puzzle solving. This game is part one of a two part story, some questions are left unanswered and open to interpretation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258950/header.jpg?t=1450177156",
    "minimum_requirements": "OS: Windows XP SP3, Windows Vista/7/8 Processor: Intel Core i3 (2 * 3200 MHz) Memory: 2 GB RAM Graphics: Radeon HD 2900 XT or GeForce 8800 GTX DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX 9.0c compatible, 16-bit",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I think that how you feel about this game will largely depend upon what you expect or want from it before going in. The tags on the store page say 'Adventure' and 'Horror' and 'Walking Simulator', but to be honest I really think you should downplay the adventure and horror aspects and temper your expectations instead towards the walking part... and add 'Exploration' and 'Puzzle' into the mix while you're at it. That's what you'll be doing for the two or three hours it'll take to finish this, slowly walking around a small island, searching for items and using them to complete puzzles whilst also trying to solve the mystery of who you are after a storm has washed you up on a beach and robbed you of your memory.  I can't say I actually cared about the protagonist's story all that much as starting off a game by waking up some place with amnesia has been done so many times it's lost its intrigue and impact. And at this point, instead of proving vital to a unique story, it feels more like a device to drip feed the player the details of the past while still keeping them in the present, as well as not have the character know something that the player who's controlling him doesn't. It's probably something of a Catch 22 situation as it's difficult as a storyteller to walk that line of having the player be someone else whilst also not really knowing who they actually are and finding a way to convey that information. But either way, it just didn't grab me.  What I found far more interesting, though, was the story of the island itself and how a fatal infection that spread across it affected the now dead people and drove them ever more to desperate measures. And, sure, while your own character is a part of that story, it didn't feel as interesting as the bigger picture. By the end it appears as though the personal story has mostly been answered, so if the intended second/final part of this game ever sees the light of day I really hope it focuses on that and wrapping up your character's story is much more secondary.  Gameplay itself is more about having a keen eye and a sharp mind as you track down items and follow clues to figure out how to complete puzzles. But this is another kind of Catch 22 situation as the atmosphere and presentation of the game clashes with actually operating within the world. So much effort is spent on creating the perfect tone that it makes finding objects and clues awkward at times. The entire game takes place at night and many areas are cast in shadow, add to that a film grain effect and the fluctuating colour that regularly drains to make the world completely grey and sometimes figuring out what you're missing really can feel like looking for a needle in a haystack. But while some of these effects are optional, as much as you're making it harder on yourself to leave them on, without them I think it takes away from the greatest aspect of the game, its atmosphere.  Moody really doesn't begin to describe it. Throw in some more words like 'brooding' and 'desolate' and 'isolated' and you're getting closer. When I started playing this I decided to do it in the wee small hours of the morning, with no lights on and the windows open to let in the cold air and rustling wind. It genuinely helped immerse me in the world even more, but this only built on what was already perfectly crafted to begin with. As I progressed through the game I began mentally drowning out the presentation as I focused on some of the more irritating puzzle features, but just before I finished it I started backtracking across the island for the sake of an achievement to walk ten kilometres (yes, I'm one of those people. Sometimes I hate myself, too), and that's when it really struck me just how much care and attention went into building a truly incredible atmosphere.  Without any objectives to distract me I was able to better notice the details, like the waves lapping at the shore, insects chirpings and lights buzzing, the random coughs of your weather-beaten character, the fact that the greying of the game seems to coincide with the periodic rainfall and accompanying thunderclaps (the intensity of the grey being proportional to how heavy the rain is), or noticing eerie noises seeming to come from different points all around me. Is it an owl hooting somewhere, or my ears playing tricks on me to make it sound like distant children playing among the death and decay of the island, or possibly hidden somewhere crying? It really brought to life a rare feeling for me in a game where I really was immersed completely in my surroundings and overcome with a genuine sense of almost alien solitude and curious wonder, intrigue to explore but apprehension of the unknown. This really is as fine an example as you're going to see of how to craft an environment to evoke real feelings in a player.  The game did take a bit of a bashing upon initial release, but it seems to have gotten better with additional updates and tweaks based on user feedback. I really do hope the negativity won't discourage the developer from carrying on with the conclusion, and if anything will use it as constructive criticism to further improve upon what he's already made. And if we're really, lucky Derek Riddell will also return to lend his excellent voice-over talents once more. As flawed as it may be, I really do think this deserves to be experienced by every fan of the genre. Look up a guide if you have to, mess with some settings if need be, but give it a chance and I think you'll be glad you did.",
            "review_score": "1"
        },
        {
            "review_text": "The game was okay. Wasnt that great but if your a fan of puzzle games and finding hidden items then this game is for you!!  Pros atmospheric gloomy ambience good narration  Music Sound Effects Story  Cons Only walking (cant run) Cant save anywhere you want Cant jump Can barely read letters and notes",
            "review_score": "1"
        },
        {
            "review_text": "a dark and dreary game. Puzzles are not too hard if you pay attention to your surroundings.",
            "review_score": "1"
        },
        {
            "review_text": "I was drawn to this paranormal/mystery game because it was something different, in that it took place on an unknown irish island and the text featured in-game for signs, item descriptions, and location is Gaelic (with translation). Many sites mock/belittle the atmosphere, the voice acting, the puzzles, and just plainly the game itself. In all honesty, it is a bit much for such a short game and like myself would wait untill it goes on sale.  The game itself is short, linear and the music is limited yet pleasing to the ears. The scenery/atmosphere is a bit dark and add film grain to the visuals which can be removed in the options. I like this as it is the dead of night on a moonless island and I feel the film grains adds a re-telling or recollection of a tragic past through the eyes of someone alive, desceased, maybe somewhere in between... The puzzles I think are the main downfall. They are easy despite being odd, convoluted, and elaborate considering the storyline and the current situation. Though, some puzzles fit in nicely but all are blended in to that one really has to look carefully, and I do admit it is kind of hard given the dark scenery and film grain (*film grain can be removed in options). But really, it's you're looking for something in real life it doesn't magically give off an glowing aura or flash for you to say 'Here I am!.' (*...Although it would be great....*) but the game does highlight SOME things for you.   All-in-All, the game was a good lilttle experience and educational as well for those interested in Gaelic and want a game that takes you somewhere else.   NOTE: This is my opinions and thoughts of the game and not an overall view if the game for general audience. As with many reviews and opinions, take this with a grain of salt and do your own research.",
            "review_score": "1"
        },
        {
            "review_text": "A great Short Mystic Puzzle Game.  Nice Puzzles. I Love the game ",
            "review_score": "1"
        },
        {
            "review_text": "My main reaction to this game is 'what. the. efffffffffffffffffffffffffff.' The story was good, if a bit vague and plot-holish, and the Steam guides were my lifeline for the elaborate, why-the-frick-would-you-every-build-this puzzles. And yet, once I had adjusted the settings and got through the Prologue, the game was strangley compelling and playable. Sometimes I think it took itself too seriously--I didn't absoluetely NEED those long shots on Peter's photo--but I wanted to find out what happened to all the villagers, beat all that Irish puzzle ingenuity, and stick around for all those Irish words. I also appreciated the representation for disabled people and older protagonists. It wasn't particularily scary, more of a 'the horror! The horror!' feel, but speculating on the remaining loose ends is really fun. I'm going to encrouage my other friends to play it just so I can talk about it with them.",
            "review_score": "1"
        },
        {
            "review_text": "A walking simulator in the vain of Gone Home and Dear Esther. Made in Ireland, and set in Ireland, its wears it's irishness proudly.  Very atmospheric, great soundtrack.  A short game with fairly straightforward puzzles, that doesn't overstay its welcome.  Verdict: Buy it in a sale. Definitely worth a few pennies.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself was OK, it wasn't bad, but it also wasn't great. I enjoyed the story and the language features (English-Irish). Personally I would like to see a continuation. To me the game simply ended on a cliffhanger and that spoiled the title a bit. In the end, even though I enjoyed this game, somehow it felt a bit short. I hope there will be a sequel/ add-on for it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games that I have ever played. I haven't come across many thriller/puzzle/horror games for a long time as such a good standard as this. I would recommend this to anyone who a good thriller / puzzle game for a low price. Even if you dont like the game itself it still deserves a round of aplause for the amount of detail and voiceovers. This game made by one man definitly deserves a 10/10 from me",
            "review_score": "1"
        },
        {
            "review_text": "its short, but i liked it",
            "review_score": "1"
        },
        {
            "review_text": "It's a poor man's Vanishing of Ethan Carter, but it's worth a look if you're into your walking simulators.",
            "review_score": "1"
        },
        {
            "review_text": "tldr; you'll bang your own head against a wall, much like the protaginist does.  I started this game off with a couple friends, one controlling movement with a controller, one managing inventory and looking around with a keyboard. We managed to find a walking stick, pick up a few little red glowy wooden tube things, open a gate (in a world record time of: several minutes!), get confused - not creeped out - by a boy sat on a tree stump, because it looked like my computer was struggling so hard to deal with his motion that we only saw him move towards us in three key frames. Maybe this is because this game has Oculus Rift support, so the devs thought you'd blink at the correct moment, to give a creative Dr. Who vibe to the game. We quickly swooped up a gold medal in the world championships for this game by placing a protractor on a sun dial, then quit before we went mad - to play Shovel Knight.  I returned to this game weeks later, and despite having full keyboard control, I cannot for the life of me find out which key I have to press to put that protractor back on that sundial. I think I need to put a valve wheel on something, but I can't figure that out either. Even the controls in the main menu don't give me the glimmer of enlightenment that I so longingly wish for, pray for.   Don't let my play time fool you, I went AFK whilst watching Game of Thrones to get at least some achievements in this game. I initially laughed when I saw an achievement for walking - just walking - but given the unchangable, excrutiatingly slow pace the protaginist has, I can say that walking a few kilometres in this game truly is an achievement.  Perhaps an interesting game to spend a pound on to see what not to do when trying to create an immersive game, but on the whole I strongly suggest you keep that pound, add it to the jar then pick up a game you actually want later on. You probably have enough games to keep you occupied anyway. I know you do. Don't look down in shame, look back at this review. There's a quip or two coming.  Due to the Oculus Rift support, and door lintels being at eye-height, I dub this game 'Headbang simulator 2014'.  If you already bought this game, give it a go - and if you don't like it, go afk, get those silly achievements and thankfully, some steam trading cards - perhaps someone's way of saying 'I'm... I'm sorry for accepting your money'.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm going to put this in right now, even though I've only just begun the game, because I'm frankly ♥♥♥♥♥♥ at the developers for including such an asinine puzzle right at the beginning. Basically, when you first start the game, your character has some kind of problem walking, and to simulate this, the entire game screen wobbles. It's bad enough while you're standing still, but when you start moving around, it's absolutely intolerable. I couldn't watch the game for more than one or two seconds at a time before I started feeling hot and nauseous. I had to eyeball my target, close my eyes, then hold down the W key and check my progress. There is an item you can find to fix this, but still, why torment the sizable portion of game players sensitive to this kind of thing? If the rest of the game is fantastic, I may change my review, but for the moment I'm not happy at all about the fact I feel like I need to puke even five minutes after I've passed the wobbly part.",
            "review_score": "-1"
        },
        {
            "review_text": "Too dark, no story, ain't scary, slow movement. Only one positive is trading cards. From me it is simply no.  Verdict: 0.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Uninteresting, not scary, I wouldn't even call it atmospheric, I'd call it depressing. There are so many games you could play which perform better in the areas this game tries (and fails) to compete in. If you enjoy walking around in a greyscale world and feeling depressed then sure, go ahead and buy it, otherwise steer clear.",
            "review_score": "-1"
        },
        {
            "review_text": "Pseudo-psychological walking simulator in which you need to discover secrets of the island. But please, do yourself a favor and play Dear Esther or Gone Home instead if you into such games.       Audio   6/10     Graphics   4/10     Gameplay   5/10     Story   3/10     Time to beat   3hrs     Summary",
            "review_score": "-1"
        },
        {
            "review_text": "Even though I like riddles I didn't like this game a lot. It just takes too long to get from one place to the next. The colors are all grey and somehow it all just seems confusing. On the other hand if you like to have a game that makes you feel like a seasick person just washed upon the shore, this is what you've been looking for.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game 80% off and I still regret buying it. The only thing that made me finish the game is my curiosity for the story. Some of the mechanics are clunky, the lighting and color made some things hard to make out at times and the worst part is how SLOOOOOW things are. Walking is slower than in Dear Esther or at least just as slow. Waiting for gates to open seems like AGES. If you make it through all of that, just wait until you get to those animation sequences that are very slow and boring (which you cannot skip.)  I used the walkthroughs on some parts just to get through the game and get my $2 worth.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried so hard to open the latch, couldn't.  Best.",
            "review_score": "-1"
        },
        {
            "review_text": "just save your money and time for something else, avoid this garbage",
            "review_score": "-1"
        },
        {
            "review_text": "Horribly bad writing, tedious gameplay, unconvincing voice acting. The audio and video are painful to hear and see. Avoid this one.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has some positive points, for example, it has a nice atmosphere, decent voice acting and an interesting plot, with some good ideas, but it is let down by an overly tedious prologue, unclear objectives, a confusing system inventory, the inability to access any options during the game, and poor graphics. Montague's Mount has so much potential to be more.",
            "review_score": "-1"
        }
    ]
}