{
    "app_id": 258970,
    "name": "Gauntlet™ Slayer Edition",
    "release_date": "2014-09-23",
    "developer": [
        "Arrowhead Game Studios"
    ],
    "publisher": [
        "WB Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Co-op",
        "Dungeon Crawler",
        "Action"
    ],
    "achievements": 46,
    "positive_ratings": 4997,
    "negative_ratings": 1407,
    "price": 14.99,
    "description": "The classic Gauntlet 4-player co-op action gameplay returns in a completely new experience! Battle the endless hordes of foes as you and your friends fight for treasure and glory via both local and online co-op multiplayer. Invade the Darkness!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/258970/header.jpg?t=1461103468",
    "minimum_requirements": "OS: Windows Vista / Windows 7 Processor: 2.4 GHz Dual Core Memory: 4 GB RAM Graphics: 512 MB NVIDIA GeForce 9800 / ATI Radeon HD 2600 XT DirectX: Version 10 Network: Broadband Internet connection Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows Vista / Windows 7 Processor: 2.4 GHz Dual Core Memory: 4 GB RAM Graphics: 1 GB NVIDIA 460 / AMD Radeon 5870 DirectX: Version 10 Network: Broadband Internet connection Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "4 players = 8/10 3 players = 7.5/10 2 players = 7/10 1 player = 0.5/10",
            "review_score": "1"
        },
        {
            "review_text": "The origional release of Gauntlet was awesome!  For some reason they changed it to 'slayer edition' took away all the custom elements and created a dumbed down version of somthing that coulda been great.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I wont recommend this game to someone looking for a Gauntlet game, but if it's on sale for like $10, id say go for it.  On one hand, the game isn't a 'bad game,' except for the fact that there are only three areas, which was an enormous disappointment to me when i walked forqard and back thinking i had just missed them. On the other hand, this game is not the Gauntlet you probably know and love. The whole new character design thing is lame, Gauntlet didn't need that type of gameplay.  Then theres the part where there really aren't any items because you get these sort of bonus skills (which are the only thing you use gold for) which are activated by potions (which is the only thing you use potions for). Keys don't roll over after you've completed a level, and neither do potions, and theres really no reason to ever worry about having the exact number of them, you might just miss one or two doors with some gold behind them, which is relatively pointless and not even remotely exciting anyways.  It feels like someone who hasn't played Gauntlet much just took the project and went 'Hey, guys, hear me out, I think people want this kind of game!'   All things considered, I didn't go through it hating my life, but I would give it a better ratying if it didn't pretend to be a Gauntlet game. And, again, why so few areas, that really bugs me. I feel like if I paid $10, or $15 i would be okay with it, but I didn't, so I'm not.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is basically ruined. They removed the unfair difficulty setting which was where 99% of the fun was. They also removed the leveling system that improves your character after defeating x amount of different types of monsters. I spent 97 hours according to Steam improving my characters and just had that returned to me as a paltry amount of in-game (read: completely worthless) gold.  Do NOT recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: The game looks and runs great. I haven't seen any bugs or had any crashes yet. It is very fun for the first 3-4 hours.   CONS:  It is extremely repetative. The 'puzzles' are easy and you don't have to think twice about using a key.  The characters AREN'T balanced. The melee characters need a complete rehaul. You can literately get stun locked when you use warrior. If you get hit once as the warrior, there is no way to escape and you can bounce around and get hit 2 3 sometimes 4 times and die. 90% of the time you are running away, kiting as a melee character.  THERE IS NO END GAME. You work towards your relic, which is the only thing you can customize besides cosmetics. BUT GUESS WHAT? You can't actually use your relic during the boss fights!! ALSO you can only use it 2 MAYBE 3 times during a dungeon with the way they have it set up.   All in all, it is a fun game for a couple of hours. Maybe a weekend fling. But there is absolutely no more then 7 maybe 8 hours of fun. $20 is too much. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay, visuals, and skills were very neat. The game deffinetly had the old gauntlet feel to it. That being said, this game was so short... I think it took about 4 hours to beat the game, it seems the makers of this game literally pulled a Diablo on us and gave a short game with the ability to play it over and over again to unlock ♥♥♥♥♥♥ items. Gauntlet Dark Legends which was presented on the Playstation 2 had more playable hours then this and the memory space available was tiny.  TL;DR This game is not worth your 20 dollars, it is another fine example for how companies overcharge for games that are not yet finished yet or are half ♥♥♥ representations of what they are meant to be.",
            "review_score": "-1"
        },
        {
            "review_text": "Sadly dissapointing. Gauntlet has evolved with every game with new leveling systems, character customization, and even unique hidden characters, but this is just a crash from all of that.  It's a dungeon crawler with little to no player/class customization, No shop, no leveling, no, uniqueness, no hidden classes or special chalolenges that made all the predecessors so amazingly addictive.   Fair graphics, good voice acting, fair game controls, and decent music. 5 Hours to beat, more fun with others, but that's it. Just has a sprinkle, a flavor of Gauntlet. It is that succulant roast.. With a wretched arrow in it!  ",
            "review_score": "-1"
        },
        {
            "review_text": "I was excited to see Gauntlet, but expected something as legendary as Gauntlet Legends 64. Unfortunately what I got was Gauntlet. It's a simple enough game, beat down waves of enemies to advance through dungeons, faces bosses, and then the game ends. I believe there are a total of 9 dungeons with 3 boss battles. A variety in gameplay can be achieved by making the game more or less difficult, but the dungeons will always be the same, enemies the same (but harder to kill), spawns the same, you get the point.  Finding players seems to be difficult to find, on launch I could find lobbies within a few seconds or have players fill my lobby in a few minutes. Now to fill your lobby could take twenty minutes, and finding a lobby will more likely take you into a lobby already in progress.  Could have been amazing, but was instead a four-hour distraction with little in way of replayability. That replayability is taken away more by no one willing to play. Save your money, or go get an N64 and buy Gauntlet Legends 64, which was an epic adventure with many levels, hours of gameplay and a great variety in enemies and locations.",
            "review_score": "-1"
        },
        {
            "review_text": "I played the original Gauntlet local co-op with my brother regularly as a child. I find that this remake has stayed true to the concept and I have enjoyed it now twice all the way through. First time was normal mode solo, and then hard mode with my brother (ah, the nostalgia of playing the original!). This game is fairly short - about 5-6 hours. There is a lot of reason to replay this game though: you can level up each of the four classes, upgrade items and gear for up to all four classes, have fun playing with friends and even try to break the speed run records and score records. There are also 5 skill modes ranging from easy to unfair!  On the downside, there is absolutely no text or voice chat within the game so it can be annoying if you ever need to talk to a party member, especially if by allowing public to join your lobby. If you plan to co-op with friends steam chat and/or steam voice chat (or 3rd party software) are the only ways to communicate without any chat functions in-game.  All in all, I really enjoyed playing this game twice and would play it again if another friend wants to co-op through it.",
            "review_score": "1"
        },
        {
            "review_text": "A fun overhead-view twin-stick game. Each character has a very different playstyle with extra variety built in as you unlock different weapons for them. Multiple difficulty levels too.  The game is also simple. It isn't some in-depth role playing game. Its just a dungeon-crawler, with the primary element being slaughtering crowds of monsters. Before too long, you have seen it all.  ",
            "review_score": "1"
        },
        {
            "review_text": "good stuff for couch-coop. Would like to see more games like this for PC",
            "review_score": "1"
        },
        {
            "review_text": "I really don't understand why there are so many good reviews. This game is boring. I didn't played the original Gauntlet.  - You fight waves of the same ennemies again and again - Levels feel like copy paste. - Useless expensive equipment, give no stats, you just have to chose only 2 relics (10 total) that are the same for every classes. 0 feeling of progress. - 0 synergy between classes. - 'Epic bosses' what a joke, bosses are so uninspired. - The camera is so annoying - You can pick health when you are full, really ? You get rewarded to kill your friends, so many good idea for a co-op game... - Classes are not balanced. - No control rebind. - Short game, not enough content for a 20€ game.  I am sure i forget things. I mean when you see Hammerwatch for 9€, i do not recommend Gauntlet.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a badly executed game, and the combat is quite nice... It's just i lose my interest everytime after a few levels because there is just not enough incentive leveling your character or gaining gold, which feels pretty useless after you unlocked the few and only skills your character has, without the possibility of upgrading it. A decent upgrade or leveling path feels like a huge omission for what could have been a great game considering the execution of everything they DID right. Fun maybe for a few hours, but gets old too quickly unfortunately.",
            "review_score": "-1"
        },
        {
            "review_text": "So 3 of my friends and myself gave the game a go last night. For $15 bucks (each) and based on past Gauntlet games {Legends and Legacy} we figured it was worth a go. Traditional Gauntlet games get a ton of replay value so the $15 should merit that. In either case let me break into the actual review  Gauntlet starts you off by having you play each class; Warrior, Valkyrie, Elf/Archer and Wizard.  Warrior plays like in the typical hack and slash style. Valkyrie feel very Captain America'esc but still hack and slashy. Elf/Archer plays like a character from Smash TV. Lastly Wizard plays like Invoker from Dota 2 (to elaborate you have 9 spells and based on what elements you combine {Lightning, Fire, Ice} you get a different spell with each spell having its own cooldown). With each unique character you sort of get a different button schema. Where Warrior and Valkyrie (I might need clarification on this) smash buttons. The Elf/Archer and Wizard utilize the right analog.  Once you go through the tutorial you have the ability to start a game or begin a lobby. The lobby system is fantastic. There's no shift tabbing into the steam community to select a person's profile to invite them into a game. You simple click the button to open lobby (for me it was 'Y' on the Xbox control or 'X' on the PS3 based on the conversation software). and it brought up a list of friends currently playing Gauntlet who I could invite. The only gief is I wish it only brought up friends who have / are playing Gauntlet. I still get my full list of steam list friends which I think is silly.  Each selection is unique so can't have two Warriors or Valkyries etc. Once your in the game you have worlds to choose from... there's only 3 worlds with 4 levels so that was sort of a let down from the get go.  Also in the lobby you decide on your difficult. Easy is like a light version of Normal so you have more health and monsters are not as strong. Normal you get infinite number of re-spawns. Hard requires that you have tokens to re-spawn other players and Unfair you simply don't re-spawn and food rarely/never(?) exist. We went with Normal for our play-through.  There's also a shop that sells artifacts however to use the artifacts you must use potions you find in the level. So potions are no longer a generic AOE effect but are used in conjunction with artifacts. Shops items can also be upgraded and few items no longer have the 'one time use' feel. This gives potions sort of a customized feel however ultimately make them useless on boss as no potions spawn on those fights.  Another thing that doesn't exist in the shop now is 'stats'. 'Stats' or any sort of character enhancement is gained by spamming a specific character skill (typically bound to a button or in the Wizards case combine two buttons to make a spell). Other character enhancements (which are called Masteries) are gained through eating food, dying and collecting gold provide a passive bonus rather than active.  As to the actually game play...it felt super linear at first and unfortunately stayed that way for most of the game. There was very few 'whoops we went the wrong way' or 'did we miss something'. If such situations occurred it was a result of a bad camera angle hiding a wall that wasn't visible rather than a puzzle to figure out.  There's of course game elements to try to lighten the mood like players can light barrels of TNT on fire and throw it at friends or destroy food that a friend is about to pick up. There's also preset emotes that players can spam at each other. While were on emotes the characters periodically compliment each other when they get a long kill streak...this is 'cute' at first but due to its frequency gets old fast. The last sort interactive element was the crown which when worn gives the player at the end a gold bonus. However if they get hit the crown drops and another player can pick it up.  Level 1 and 2 of each world was typically presenting the theme. Level 3 was typically a small boss battle arena and level 4 was purely focused on the boss. Bosses were a hybrid of spamming the attack key and figuring out puzzles.  So general flow of the game was 'pick a world' -&gt; 'pick a level' -&gt; 'playthrough it' -&gt; 'return to town' -&gt; 'debating on buying artifacts' -&gt; 'pick a world' repeat.  Now with all that said would I recommend picking up the game... probably not at it's current release price or I would definitely split the $15 bucks among several people and play it via Local. Even then not enough bang for the buck for me to recommend it.  As a group of 4 players we beat the game in about 4.3 hours. It really emphasizes on 'party play' and I could see it getting frustrating solo. There's no 'true' leveling system so you don't really feel the progression. You get a new skill to spam or your cool downs on a spell are reduced but your overall power still feels 'fixed'. As I mentioned before there are 'artifacts' that you can buy with gold earned in game but they are nothing game breaking.  Once you complete the game you do unlock cosmetic items however they require that you use in-game gold to buy them... so your reward for completing the game on a certain difficulty is unlocking an item in which you have to grind the levels you just beat to get the gold to buy the cosmetic item....yeah...no.  On a few minor notes there's a few times where death shows up which leads to comical deaths (Death no longer drains he simple kills you) but is quickly forgotten. There's no alternative classes like Tigress, Jester, Minotaur and etc. After we finished playing we expected that they would be DLC or something silly. Pojo (aka EGG911) is not in the game as well as 'X IS NOW IT' system is out as well.  The novelty and hopefully nostalgia you hope to draw out the game is typically gone after the first few hours. At its core it took what made the Gauntlet series unique and made it feel like a generic hack and slash.  Oh one last thing before I close this out...the soundtrack is okay but nothing stellar or to write home about.  Edits below (due to comments section limitation of 1,000 characters or less)  Response to Jareth Gawain on 09/28/2014:  Correct Jareth Gawain however I find that overall it pulls more aspects from Legends and Legacy then the original Gauntlet.   The original Gauntlet arcade aspects that differed it from other hack and slash/beat-'em-up arcade games at that time was the concept of a time limit. Players health totals constantly dropped and there weren't many/any titles prior to this that forced players to find a way to conclude the level in an effective manner. This game mechanic at the time was complimented by a labyrinth-esc design which futher penalized player for making an incorrect choice for not finding the right way out. Am I saying that such a mechanic(s) should have been implemented into Gauntlet™?  Absolutely not or rather if they did so perhaps it happens on a higher difficulty. As I stated I did not play on anything higher than 'Normal' so this may already maybe implemented in the game. The above game mechanic(s) I didn't feel in Gauntlet™. The game felt very linear and more Legends/Legacy then the arcade versions.  To the point regarding Legends and/or Legacys I felt Gauntlet™ drew more from these mondern versions than its predecessors. Concepts of character progression, item shops, boss battles, quotes such as 'needs food badly' and many others pull from the days of Legends and/or Legacy. Which to me as a individual playing the game I think is a good thing that they didn't try to keep the pure rustic feel of the past in Gauntlet™. For these above reasons I feel Gauntlet™ feels more like Legends and/or Legacy than the original arcade boot.",
            "review_score": "-1"
        },
        {
            "review_text": "Had high hopes that this reboot would bring back the classic Gauntlet experience. I just don't feel it's worth the $20 when It can easily be completed in under 5 hours. The developers could have packed a bit more stages and wider variety of monsters to slash through before releasing this. I won't say it's a bad game, just lacking content. And there is no reason you should be able to destroy food. Sorry, I can't recommend this game to anyone whose played the previous Gauntlet titles, It's missing a lot of features.. :/",
            "review_score": "-1"
        },
        {
            "review_text": "If you've played past Gauntlet games you'll come to realize shortly after starting the tutorial stage that this is almost   NOTHING   like past games of the series.   The only things that I found similar are:   4 Player Co-Op    The announcer exclaims things like. 'Your health is getting low!'   Oh you shot the food? It's gone now.   Secret passages   RUN FROM DEATH   Things missing from past Gauntlet games:   Persistant Stats. The armor from the shop? Yeah it's cosmetic.   Buying benificial shop items. Besides the stat boosts which is obviously gone. You also can't buy magic potions, halos, that little Phoenix that would follow you around and add projectiles on top of your own attacks. Yeah none of that exists. You can only buy 'relics' now.   No shield button. That's gone too. One class has a shield. The others have different abilities like charge or a dodge roll. Wizard doesn't have any of those. But he does have a spell shield he can cast that breaks after a short duration.   Things that are largely different from past Gauntlet games:   Characters have a skill that goes on cooldown and a couple benificial abilities instead of a basic attack that would automatically choose a ranged or melee attack.   Magic potions don't damage things on the screen. Now they're used to power 'relic' items you purchase with gold from the shop. Not necessarily as great or had the same powerful impact as dropping a lightning potion on the screen and frying things to a crisp.    TL;DR If you have never played a Gauntlet game. You might actually find this game is eh, alright. Not terrible. But not great either.  But if you're a past Gauntlet fan. Look elsewhere. Holy crap. They just plastered the title 'Gauntlet' on this. I bought into it like a fool. Don't make the same mistake I did.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game but all you see in the trailer is all the game is. There's nothing else because this is a short game. I would recommend it for 5 bucks but not more because Gauntlet can't offer more than 8-10 fun hours. It would be an awesome game if it had more content but it only has 3 quick areas... it's not worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a fan of Gauntlet Legends for the N64, this game is a total let down! There is no leveling system which in my mind made Legends great. No one wants to remember 4 different button combos for the wizards different spells. I get that the developer was trying to do something new but they left out all of the parts that made Legends great. The art style is well done I will give them that but the characters dialogue is to childish and made it seem like they were trying to force in anything that would make them sound whitty at any moment.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game. Just my type of hack and slash game. Fast paced game. Just need more dungeons and more boss mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "I shot the food :/",
            "review_score": "1"
        },
        {
            "review_text": "All of us growing up in the golden age of standup arcade games remember the beast of a machine Gauntlet was. 4 player coop was unheard of at the time and boy did we like it. So this new rendition of Gauntlet takes that basic formula and steps it up a notch by giving each hero some new skills that gives it a much more modern hack 'n slash feel. And it works. It manages to hold a nostalgic presence while still feeling refreshingly new. They've added some character level ups to keep it interesting and there is even a difficulty setting if you feel like adding a little more challenge.  The biggest shortcoming with Gauntlet is the disproportionate skill set when it comes to the Wizard. He has way too many abilities and other cool effects than anyone else, so playing anyone else feels kind of under whelming. The other significant blemish is its short campaign length. The first playthrough is fun and exciting, but it quickly loses luster on subsequent playthroughs.  The new Gauntlet is indeed fun and best experienced in a full 4-player cooperative, but the game eventually gets stale due to it's short levels and repetitive game play--kind of like the original.",
            "review_score": "1"
        },
        {
            "review_text": "This stays true to the arcade version while modernizing it enought to give it a fresh new feel. I love it.   There's much fun to be had. Racing to get the gold before your friends do. Screaming at the person who shot your health. Laughing as everyone runs from death in oposite directions. Yep, I cannot wait until we play our next round.  Grab four friends and have yourself a blast.  Update: I am close to 11 hours played and I am done for now. In that time I have beaten the game with my friends. While I had a great time, I feel like I need to let it sit for a while before I give it another go. I still think it is worth full price, I just thought I should warn people who might be expecting a longer game.",
            "review_score": "1"
        },
        {
            "review_text": "I originally played Gauntlet 2 on the old Commodore 64. I was super excited when this came out, and bought it.   The humor is spot on and several times my friends and I almost fell out of our chair laughing at some of the dialogue.   Though this isn't quite as unbeatable as the originals with near infinite levels, it's still a great kick-back-and-enjoy game.  Animation and artwork are great, dialogue is great, and tracking acheivment scores and stuff in game is nice. There's also another great minigame in there about who can steal the crown from their friends the most though, and also being a jerk and shooting the food before your friends get it when they're about to die.",
            "review_score": "1"
        },
        {
            "review_text": "Bought a 4 pack to play with my friends, continuously disconnects in the middle of the game. Wouldn't recommend this game, since it's meant to be played in a group.  Hope they'll fix the connection issue, game looks like it had potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Gauntlet is a game worth devoting yourself into for at least a 100h. There is so much more skill and variety than meets the eye. It's one of those games that is easy to get into, but at the same time hard to master. Gauntlet also has great replay value with several weapons on each class, several campaign difficulties and an endless mode. It's a game that is largely based on co-op, but at the same time a game in which there is a huge difference bettween a skilled player and a newbie. Meaning, this is a great co-op game, but also a challeging while not frustraring, at least for the most part, single player game.   If you're into games that have a lot of replay value, collectibles, take skill and have a rather ''existant'' community, then by all means buy gauntlet.   All that aside, it's also a fun game to just mess around in with a few buddies on a lazy weekend.   As a final note, this review is not say that gauntlet is a perfect game. It has its cons, bugs and there are things in the game which may seem ''slightly overpowered'' to newer players and some veterans alike. But when you look past all the non-sense some people claim about class balance issues, there lies a game worth investing time into.  Tl;Dr +1    ",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet looks like an amazing arpg at first, but it happens to be extremely repetitive.  There are only 3 different environments, no other weapons, no real inventory and the kind of maps you are exploring are always the same for every cave. This is what killed the game for me.   The graphics are nice and the game feels good, but it is very short lasting. For me it was kind of fun for about 2 hours, then it became annoying.  Buy it only if you really love simplistic arpgs and arcade games and if it is on a heavy discount!",
            "review_score": "-1"
        },
        {
            "review_text": "I picked up the 2014 version of Gauntlet. I've given the game 15 hours so far since its release so I believe I can make an honest assessment of game from both the nostalgic (I put at least $300 into the original arcade version) and modern game design and playing perspectives. Keep in mind I play this with a keyboard and mouse (Razer Naga).  The Good  1. The game play and design are polished with a few exceptions. The game feels like Gauntlet in 2014 and that is a good thing. The same run around, find keys, open doors, get potions, and the characters and narrator are all there from the original. What has changed is the fun factor and a much shorter game. The characters do more, they are flashier and more unique, and they feel solid when played. Questor the Elf definitely has the easiest playstyle, followed by Thyra the Valkyrie, Thor the Warrior, and finally Merlin the Wizard who is definitely the hardest to play.  2. I found myself enjoying Thyra for the best balance of defense and offense. Thyra has great movement, can block any attack (yes any, even the end boss), and has a great offense as well. I suggest for starting players if you want to get into the fray, choose Thyra first.  3. The mastery levels are nice touch and I really like how they build your character up. You have to choose before you go in whether you are going for no deaths or to dying a million times on purpose.  4. $20 is about the perfect price for the game. I can honestly say I am glad I bought it.  The (Somewhat) Bad  1. Numerous bugs still exist in the game (crashes at times, sound cuts out, visual bugs). Luckily these aren't game-breaking.  2. The camera tries hard to be there for you but currently it leads to more deaths than to give you a clear view of the game. In reality I wish each player had their own screen to look at (e.g. Diablo 3) versus the 3/4-view that traps players.  3. Not being able to check your mastery progression at any time in the game is very annoying. A key to do this needs to be added.  4. Merlin plays too much like Magicka (another Arrowhead product). I programmed my Razer Naga to switch between the nine spells he has and it then became much easier to play. My guess is a lot of other people are going to do the same thing.  5. Cosmetic items are essentially worthless. I'd rather see that you have to buy new gear with better attributes after finishing a difficulty to do better in the harder difficulties than have just a look that nobody cares about.  6. Mastery progression is way too high of a curve at times - it's a ploy for replay value. I do not want to go from 2,000 to 8,000 just for 5% more of an attribute.  7. The game is too short. Normal is completed within 5 hours with a halfway decent team of players. Hopefully Arrowhead now that they have our money have a plan for future content.  8. You are forced into being only one of the four characters. While this mimics the original arcade, in this day and age I shouldn't be forced to play Merlin if I don't want to. Again, this needs to be changed to allow multiple people to live out their Legolas dreams if they wish.  The Ugly  1. The game has no way to chat with other players so you spend a lot of your time in public games using the emotes to try and cajole other players to go the way they need to go, or for you to move due to the camera getting you stuck.  2. The world leader-board was hacked within one hour of release. Currently there are players hacking to over 1.9 trillion points in single player mode. Arrowhead has yet as of this review to respond to a plan to either secure the boards or (as I've suggested on the Steam forums) remove them entirely until they have a way to fix them.  Conclusion  If you are looking for a game that can help you pass some time and is casual, then Gauntlet is definitely the kind of game to lead to a night of fun. If you are looking for something more robust and long-term then this is not the game you are looking for; I would suggest another Action RPG such as Path of Exile or Diablo 3.",
            "review_score": "1"
        },
        {
            "review_text": "Looking for a fun, multiplayer arena brawler for friends? Then move along. There are far better ones out there. Gauntlet was about frantically running around a maze, fighting off the oncoming hoard of enemies, and trying to seek an exit. Gauntlet Legends was about exploring stages, over the top attacks, huge bosses, and playing as a chicken. New Gauntlet is about walking around muddy-brown areas that all look the same, getting into one locked arena after another until you reach the end. Occassionally you have to run from Death and his wonky hit box. Seriously, though.. all previous Gauntlets are bright, gaudy affairs. This one is all browns and greys.  Most egregious to me, though, is that the game can't detect my PS2 Dual Shock 2 controller. That's not that it detects it and won't let me remap buttons, but that the game says 'is this a 360 controller? No? Then there is no controller'. Which is a load of crap in the modern world of PC gaming.  And while spell slinging as the Wizard can be fun, there's a game out there that can do it better (Magicka). In fact, any good point I can think of about Gauntlet is done better by another game.",
            "review_score": "-1"
        },
        {
            "review_text": "It was fun for a single playthrough, but after beating it once I had no desire to play it again. Not a bad game, just no replayability IMO.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really the game for me. I'll try again on Easy mode tomorrow but Normal just kicked my ♥♥♥♥. I'm not a huge fan of hack'n'slash to start with but I do really enjoy it on occasion. Constant deaths on the first level though just destroyed my confidence in my ability to play the game. I can see how some people who are more into hardcore games and don't get frustrated easily with death after death would enjoy it but I have more fun with progression.",
            "review_score": "-1"
        },
        {
            "review_text": "A fantastic revamp of a fantastic classic. Gauntlet is quite possibly the most fun I have had killing skeletons, orcs, deamons and the like.  With four (five with dlc) characters to play, who all play differently, you can enjoy hours of slaying. Or, better yet, hop in with your friends and really start harming bodies.  With the Slayer Edition, this game has gotten even better. Different abilities, new talismans, and a more interesting layout. What's not to love?  If you enjoy 'top down' games, this is a must. If you enjoy somewhat retro advanture/hack and slash games, this is a must. And if you have enjoyed any previous Gauntlet game, how have you not already bought this?  ",
            "review_score": "1"
        },
        {
            "review_text": "Has a feel like the old games while introducing plenty of new features.   It's Unique. Infuriating. Fun.   Reminds me of the 8-bit days.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing Gauntlet Legends on the Dreamcast like it was yesterday. Vibrant colors, outdoorsy environments and good ole' local multiplayer options.  Years later and we get this game, it takes a more darker approach with more features - underground dungeons, caves, with a more matured art style. Add some upgrade components and online multiplayer. However, it keeps that same fun-factor by engaging us in addictive gameplay and dark/sarcastic humor.  I feel like I could play this game forever and not get tired. There are 4 characters (5 if you purchase the Necromancer dlc) and each character feels totally different changing the experience.",
            "review_score": "1"
        },
        {
            "review_text": "It is really fun.  But be careful, it is not cheap for how fast it gets repetitive. I believe that more updates would suit this game well.  So far I finished the normal mode and tried a bit of the colesseum and that is where things get fun and complicated.  Get it, and find 3 friends to play with you, you'll have a blast!",
            "review_score": "1"
        },
        {
            "review_text": "The Slayer Edition is the proper version of Gauntlet. The game is a carefully balanced eminently playable *real* game; you never get the sense that any challenge is unfair or gimmicky. The screen is still 'shared', as if all players are bound to a single screen, however it is something you can get used to. Somehow - perhaps only illusory - it seems less of a problem in the Slayer Edition.  Looking forward to more playable characters, new equipment, new enemies, and new adventures. The developers deserve their price on this one.",
            "review_score": "1"
        },
        {
            "review_text": "Great re-make. I really really really hope steam adds Gauntlet Legends and Gauntlet Dark Legacy, that would be amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This is great if you enjoyed other Gauntlet-like games, but almost everyone agrees this game is entirely too short, and I feel the characters are a bit too basic. Would easily be 10/10 for an Alpha game, but no folks, this is the complete version.   Relaxing, mindless fun for those who like dungeon-crawling, but don't buy it for anything over $10.  Edit 9/15/15: Much better. Much, much, MUCH better.",
            "review_score": "1"
        },
        {
            "review_text": "Very disappointed with this game. Went in with high hopes, thinking it would be like the nostalgic games I remember.  Things I liked. -Slaying hordes of monsters -Class gameplay -Boss fights -Ranking system -Buyable skills  Things I didn't like. -No way to carry potions to the next dungeons or buy them -Gear is purely cosmetic -NO PUZZLES or critical thinking (imo the biggest flaw with the game) -Really, really short (12 levels? c'mon!)  I really think this game has a lot of potential. I know people complained about the wizard, but I really enjoyed playing as him. The style is a little harder than the other classes but once you get the button sequences down he owns. I believe the game could benefit if it had DLC but it was way too short and really has no re-playabilty.",
            "review_score": "-1"
        },
        {
            "review_text": "fun game, but needs friends to be played with. Easy to get boring playing by yourself or random other people",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with a group of friends and its even better with a control.",
            "review_score": "1"
        },
        {
            "review_text": "The definition of arcade and adventure, this Gauntlet is true to it's predecessors!   Definitively, the game you want to play with your friends even when you're missing time!",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty damn fun refresh of the classic game. If you were a Gauntlet fan, you'll enjoy this one imo. If you have no idea what Gauntlet is about, it's basically the precursor to games like Diablo. Or you could look at it as a simpler version of Diablo, with simpler RPG elements. The game isn't meant to be crazy profound; just something super fun to play with friends :).  Get your friends involved, and it's totally worth it. It's still fun single player though :)",
            "review_score": "1"
        },
        {
            "review_text": "I was honestly looking for something more along the lines of Gauntlet GC/PS2 version instead of the original old one. Personally I had a lot more fun playing FORCED and would recommend it over Gauntlet™ if you don't have a problem with it not being the same IP. That said it was a fun game if you can get the people together.",
            "review_score": "1"
        },
        {
            "review_text": "OMG! this is so fun!",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for that classic Gauntlet where you can roam around the four elemental castles to find rings and eventually unlock the fifth to battle a dragon as you slowly improve your character stats.... get a sega emulator because this isn't it. It does carry with it many of the elements of the earlier gauntlet we had on Sega but also adds impressive graphics and the ability to blow s#!@ up!. It has an extremely easy to use interface. We all sat down and without speaking immediately took up our old characters. The quick little elf, the bull headed warrior and the mystical wizard have had their abilities greatly expanded. My wife even enjoys the Valkaryte so she can huddle in a corner and bounce enemies off her shield. After several hours of play (and a sale) we even opted to try out the necromancer but alas, I am the elf. I am always the elf! ... and always the last one standing. If you get mad at the elf shooting the food...move faster and don't get hit!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! just like the old classic but with new stuff. You get what you see.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of replay value &amp; slightly addictive. There are a few bugs but nothing major.",
            "review_score": "1"
        },
        {
            "review_text": "It is simple, old school, and fun, really fun. Sometimes a bit frustrating, but it is worth the price!",
            "review_score": "1"
        },
        {
            "review_text": "Very basic gameplay, and there is not many special moves/attacks or enemies. Playing on normal the game doesn't last very long, and the hardcore difficulties are not really anything special. The enemies just have more health but the same basic attacks. It was cool for like an hour cause it was a change of view and looked made well, just not enough content in the game itself. Just feels like there is something lacking.  IMHO WOULD RATHER PLAY THE ORIGINAL",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful variation of one of my favorite arcade games growing up. Good work, hope to see some of the other avatars come out in another expansion?? Wishful thinking, if it is possible to grant me this news I would be grateful. Honestly tho guys, Great Job!",
            "review_score": "1"
        },
        {
            "review_text": "not super single player friendly but still a good game",
            "review_score": "1"
        },
        {
            "review_text": "If Baldur's Gate: Dark Alliance and Hammerwatch had a baby, this would be it. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet in the 80's arcade was fantastic fun. There were usually lots of people around to join in on the fun, but for whatever reason this one just didn't hold the nostalgic trip I was looking for. Don't get me wrong though. If you're into gauntlet you definitely need to check this title out. GREAT fun for some couch co-op when you have friends over.   There's LOTS of in game achievements to grab for each of the characters it provides. There's bosses throughout and an end game boss too. I found the Elf to be the easiest character to play as. He's quick and ranged which helps with the mass amount of enemies charging your direction. I only played the Slayer Edition so I can't comment on pre-2.0, but I've heard version 1.0 was a lot better and many people miss it.  There's 30ish stages to play through and it does have online mp and couch coop. It'll take roughly 6 hours to beat solo with one play through, but once again the coop is where it's at. Grab it on sale. Fun for a limited time.",
            "review_score": "1"
        },
        {
            "review_text": "Like any other game, play it on Hard mode before ♥♥♥♥♥ing that it's too short.  Not as good as Legends, still a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "A simple but very entertaining game. Especially with friends. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun, just needs more levels to grind! :)",
            "review_score": "1"
        },
        {
            "review_text": "BLUE JESTER HAS GAINED A LEVEL",
            "review_score": "1"
        },
        {
            "review_text": "Wizard probably blue screened himself in Magicka and wound up here, Valkyrie is basically your generic tank with fast melee attacks and a rather nice lunging thrust attack, warrior is your generic spin2win stereotype, and elf is.. Well, he's an elf. Probably the most suited to soloing unfair due to being able to move while spamming ranged attacks.  If you're expecting a remake of something like Dark Legacy or Legends, you'll be disappointed, but if you liked the older games in the series, you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "Very solid mostly-coop game. Why mostly? Because there's a competitive aspect to it when it comes to scoring. Gold pickups are shared, everything else isn't. In fact, you can pretty much pull all sorts of ♥♥♥♥ery like hogging the food and potions, destroying the food, triggering environmental hazards perhaps out of spite for that ♥♥♥♥♥♥ who got you to drop the crown. The crown is pretty inconsequential, it just adds to your score at the end of a level and gives everyone something to brag about.  You get skull coins for killing special mobs, and it's these skull coins that count as your 'continue coin' whenever somebody dies. It's shared among the party so once they're all used up, anyone who dies gets a much longer respawn timer (at least in normal difficulty).  Much of the levels involve very simple puzzles and killing lots of monsters. You'll have to work together to destroy spawners but also kill the monster while someone else kites them around.  Potions are limited use items that let you activate one of two relics you've equipped which are special abilities. You can activate them via LB or RB (Xbox controller) but the game doesn't really teach you this at the start.  The equipment are all cosmetic, but masteries are like achievements that give you passive bonuses as you rank them up. Ranking them up involve all sorts of things like doing certain amounts of damage, killing a number of monsters, using skills, even dying.  As of launch week, there is a glaring omission of drop-in/out multiplayer (you can only join at the lobby at the very start), needs somewhat better matchmaking (I kept getting an AFK game host, couldn't find any other games), simple in-game chat or voice would be nice, but I understand why it needed to be left out because you really never know what you're getting into with public groups.  TL;DR Solid dungeon coop, ♥♥♥♥ with your friends indirectly. BUY IT. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but nothing like the older gauntlets. Levels are uninspired and same-y, nothing like the variety of Legends and Dark Legacy. Each stage has like 3 zones with exactly the same special rules every time. Gets tiring. Definitely play this game on Hard, it seems like the real difficulty. Normal is way too easy with unlimited respawns. Game is crazy short, less than 5 hours to entirely beat the story. Final boss was lame and obvious. Game is fun to play as a romp with friends, but I got it on sale for 5 and still feel like it was barely worth it. Let alone $20. I enjoy the competitiveness of separate gold and the Crown added a fun challenge for friends",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. True to the old arcade and NES gauntlets even has some of the music. you can play it online. and its a good PC version if you play it with a gamepad I cant tell the diff between pc and PS4 other than PC looks better.",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet is a reboot of the 1985 classic arcade game. The 1985 version was memorable for having four characters: Warrior, Valkyrie, Wizard, and Elf. Many people pour quarter after quarter to play this game since it was so addictive. The four characters are back with the same abilities that will remind Gauntlet veterans of what it was like back in the day.  This game offers modes in single player, multiplayer, and four player co-op. You will have to complete three floors of dungeons in each coliseum to unlock new group of floors. The dungeons are diverse enough and you can accidentally shoot foods like in the original. It does get tedious going through the same dungeons after dying and using up skull coins to get a new life. Once you run out of skull coins you will have to start from the first floor regardless of the floor you were in when you died. So, there are no save points on any floor.  Gauntlet also tries to be a little RPG by including Masteries. The Masteries represent the progression of the character you have chosen to play. Believe it or not, dying many times is considered an achievement. Other achievements include taking a lot of damage and using specific moves more than others. It looks to me like the character progression turns out not to be that important since the game is about shooting your way through the dungeons.  The gameplay is interesting when playing co-op or multiplayer. You can shoot each other by accident with friendly fire and that can cause some interesting friction between the players. The layout of the dungeons contains many cranks that you can turn to be able to advance to other parts of the dungeon. It is necessary to get used to being attacked by packs of monsters. In many cases you will have to destroy shacks that summon the monsters since destroying the shacks is the only way to keep more monsters from coming. Sometimes the sorcerers add to the challenge by regenerating the health of a shack with their staves and it will be up to you to kill the sorcerer before destroying the shack.  The controls are easy enough to understand: they are as simple as WASD and the mouse. Playing with ranged characters such as the Elf and the Wizard take more practice than playing with characters that fight in close quarters. I think Gauntlet is more fun when playing either multiplayer or co-op than single player.  The people who experience the original Gauntlet will find this reboot entertaining because of the classic characters and the diverse dungeons. However, if you are a diehard RPG fan looking for deep character customization and progression, you may not like Gauntlet as much as the Gauntlet fans. I think that it is best experienced with other players in multiplayer and co-op modes. The single player mode feels a little boring. This reboot looks better than previous iterations of Gauntlet games that were made after that 1985 original.  My Score: 7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Hate playing this with a keyboard. Game suggests play with a game pad. Tried two different game pads. Didn't recognize my Logitech PS3 style controller so I bought and Xbox 360 style controller but can only move up and right or down and left making gameplay impossible. Nothing in the game allows you to change button settings on gamepad. Contacted Arrowhead studios but got no response. Very disapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is alot of fun glad I bought it",
            "review_score": "1"
        },
        {
            "review_text": "An excellent homage to the old school arcade game, this reiteration plays exactly like you would expect. You have four characters, each with their own skills and abilities, and you team up with friends to obliterate huge waves of enemies, all while splitting up (or fighting over) the spoils. The voice acting is very witty and entertaining for all the characters, and each character has 'masteries' which you unlock by doing certain things in game, such as killing x amount of a certain monster, or even dying multiple times on a level. These masteries unlock subtle but useful passive abilities on that character, such as slightly increased damage, or a longer spawn protection.   While rather linear, this is a great dungeon crawler game, especially with friends. And at a modest price of $20 (like Torchlight II), you can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "if you love gauntlet do not get this game   everything they could do wrong with a gauntlet game has been inserted in this game  ridiculous AOE enemies? Check! (Rememer any aoe enemy in the original gauntlet?)  unblockable attacks that are impossible to read in the general mess? Check!   recycled boss, but two at a time instead of only one? Check!   consoletards based fights, enter room, get locked inside, kill all enemies, room unlocked? Check!   all in all i paid 5 euros and i think it was not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "A 'Diablo lite'.  Manages to capture a portion of the feeling of the 1985 original. However, by today's standards the game doesn't offer much variety. Only a handful of useful items to purchase and not much in the way of character development. This does have the benefit of new players being able to jump right in to play with old players' characters, as a new character can be almost as useful as an old one. The flipside is that character development doesn't offer much incentive to keep playing.  The campaign is a bit short, I'd estimate it will be over in 6-8 hours, but for 20 Eur it's an okay deal and the harder difficulty levels can extend its lifetime a bit.  The real meat of the game is the co-op. The more friends you play with, the more fun you have, and although the game itself doesn't offer voice chat, using it is definitely recommended.  At the time of the release the game seemed a bit unpolished and suffered from some cosmetic bugs (the end level mastery achievement descriptions seemed to have some wonky numbers) and some other small annoyances (enemies get rarely stuck inside obstacles making them difficult to kill, no text or voice chat etc.). Nothing gamebreaking though, and they'll hopefully be fixed in future updates.  In conclusion, I wouldn't recommend this for single players, but groups of friends will have a blast. Don't shoot the food, man.",
            "review_score": "1"
        },
        {
            "review_text": "I was reasonably interested to hear that a new Gauntlet game was in the pipeline BUT at that stage I didn't know which pipeline it was in. I hoped it wouldn't be coming from the same one which has blurted forth the gaming equivalent of hot, liquid turds in the name of Gauntlet since the 1980's.  It seems that instead of serving us up complete effluent they have instead managed some kind of plumbing tomfoolery which has resulted in the effluent being mixed with cool, pure water. The resulting fluid can fill a glass but it is possibly not a glass one would choose to drink from.   Some of the benefits of the game...  1) Graphics are nice and (vaguely) evocative of the original game. Nothing looks bad and the game runs well. Everything looks reasonable for an arpg, tbh. Fairly stereotypical but then Gauntlet was pretty much first on the block for this kind of thing. However, there is little to no variation within a dungeon 'set', which isn't in line with the original, there are just themed 'worlds' which are not unlike the crap we had to munch through with 'Gauntlet: Dark Legacy'  2) Multiplayer works well, netcode seems tight. Now that the 'cannot connect to Gauntlet online' random messages have ceased thanks to a post release patch, the netcode works well. Compared to something like Magicka which is still, imo, in a broken 'online' state, Gauntlet runs perfectly. No real problems to report, no lag issues as such.   3) It's a good game for a little while, especially for fans of the original BUT this only lasts a short time. One of the key factors of the original was that there were a lot of different dungeons pooled randomly from a larger set, many of which could be flipped and changed in ways by the game before they were presented to the player. No two playthroughs would be quite the same. This is not the case in the new version, with only a few levels being occasionally 'flipped' but they're very familiar whatever way round you do them after a very few playthroughs.  BAD POINTS  1) Skill trees have been added but instead of making the game something one would return to in order to 'level up' items etc we are presented with something that's nothing more than a skin buying interface (buying skins with ingame money does nothing to your character and they are barely visible) and the option to buy 'spells' (more on these on point 2). You can collect more than enough money very quickly to buy all of these things. Also, each upgrade is NOT character specific, with only 2 skills being particular to each character. This is nonsense. It just means, basically, that you're endlessly playing the game to unlock more of the same stuff (unlocks do not migrate across characters)  2) Spells are terrible. 'Potions' in the original Gauntlet worked as 'Smart bombs' which would destroy onscreen monsters, particularly 'Death' (More on this explained in point 3) but instead of keeping them the same the developers saw fit to wangle them into some rubbish kind of 'Special move' enabling fandango. Preposterous. So, basically, you have to have a potion in your possession to perform your Special move. This means players simply signpost points in levels, grind out enough potions then all just launch the same kind of devastating, battle winning special. This renders the game really boring and, as a direct result of how the game progresses coupled with this stupid idea, the 'end of level' bosses actually get progressively easier as the players become more invincible (in chosen situations). It's a really stupid, crappy system. They should have based these Special abilities on kills or a rage meter or something like that and kept potions the same. In the original game, the wizard could clear a screen by firing off a potion, with the other characters doing progressively less damage with them (warrior being least proficient). Potions were more rare, usually, whereas I feel the new version gives too many, with everyone able to just blast out specials by the time you reach the end of a particular dungeon set.  3) Death is rubbish in this game. People who play/played Gauntlet will know what I mean but for the benefit of those not familiar, Death in Gauntlet is a physical character. In the original he would chase the players and steal health unless someone used a potion. Using a potion 'killed' him, for the time being. There could be multiple 'deaths' on one level, though. They were quite fun and an interesting alternative to ploughing through loads of 'nasties'. Anyway, 'Death' is nothing like that in the new version. Instead of being in the main levels, he gets his own set of levels which really DO NOT WORK. They're not much fun and get old very quick. He appears, chases you for a bit, then disappears. This happens as you're pushed through a linear set of rooms and, yeah, gets old. Death is not remotely troublesome, either, and you can simply run round and round him. He even smashes crates/pots by passing over them so you can use him to collect money. He's basically rubbish in this version of the game, pushed into a sidequest of sorts (which is short and lame YET counts as a 'main level')  4) GENERATORS. GENERATORS, FOR CHRISTS SAKES, NOT 'SUMMONING STONES'. JESUS ! WTF !? The summoning stones are a BAD idea. They even sound rubbish. 'GENERATOR' sounds so much more malevolent and directionless. 'Summoning stones' take the place of generators in this version of the game but they're a really lame replacement. In the original, Generators were in place in the level anyway. You could see them from far away. In this version you will usually walk into a room, the doors will shut, and a Summoning Stone will appear. From this, enemies will come and you smash them up then smash the stone. Doors open. Proceed. Pretty lame, tbh. There are no 'levels' of summoning stone, either, whereas the original game had varying strengths of Generator that spewed various strengths of creature. Also, there were ghost generators in the original game. In this game, ghosts are confined to just appearing on the 'death' mini-levels. They just appear in tiny groups, following him. Useless. Gone are the days of masses of monsters (including ghosts, see LEVEL ONE IN THE ORIGINAL GAME FFS) generating and pushing at the backs of doors, instead we get the occasional room that's been 'set up' with standing monsters but nothing like the original dungeons, creaking with scum to be destroyed. It's like everything in this game is just waiting for you to turn up before it'll appear, which takes away from the 'world of absolute violence' vibe that many so loved about the original. Then again, that might just have been me. I'm asian.  5) This is a SHORT game. It's not got anywhere near the replayability of the original and in a couple of playthroughs (or less) you'll most likely have enough gold to max everything on your (not very unique) character. It's really hurt by not having random levels of the kind offered by stuff like Full Mojo Rampage (and many other such games). With no real need (or, perhaps, desire ?) to replay for more xp and to enjoy some different levels, there's little to return to this game for and we, once again, encounter the same problem that has plagued all of the more modern Gauntlet updates. NOT ENOUGH GAME. Why, when the original paved the way for randomising such a large amount of gameplay elements do we have to put up with this NONSENSE ? We were even promised such things in this version of the game but there is no such thing (99% of the time) here.   6) Price. It's too expensive for what it is and the new character should have been free DLC. The base game doesn't contain a fair few things that were promised and just feels, well, way too short and shallow. It's good fun and the engine is sweet, the characters 'play' well and all the new moves are fine but there need to be many more levels to make this worthwhile.  6/10.   I recommend Full Mojo Rampage instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Great. Even better with friends. Removes some of the ease of early Gauntlets by making each character have unique attacks and defense mechanisms. Further character customization comes from relics which you can choose based on your style. Armor 'upgrades' also appear but seem solely aesthetic and give no stats boost. Not nearly as long as previous versions of Gauntlet.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging,extremely entertaining to play with friends and coop online,I can't say more right now but i played non-stop till the release. If you like the genre i'm sure you will spend a lot of time into this.",
            "review_score": "1"
        },
        {
            "review_text": "The 'Slayer Edition' should have been a different game/game mode. Playing alone is hard as ballz now, plus all the time i spent in the campaign is gone, as is my character that i had spent the time to build  0.5/10  TLDR; don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "0:05 - 'Hey this game is pretty fun I pick the warrior smash things :DDD' 0:10 - 'Oh no death game is difficult' 0:15 - 'Hey haven't I seen that room before?????????' 0:20 - 'Wow my game desynced my friends, better restart! Bugs happen but developers fix them!' 0:25 - 'Hey I bet I can figure out where the spawner is going to pop up!' 0:30 - 'I wish there were more than 3 different enemies' 0:35 - 'This announcer is pretty annoying...' 0:40 - 'Haven't we played this entire level before?' 0:50 - 'Couldn't they have given the announcer more than five lines?' 1:00 - 'This counts as a boss???! Well maybe the next set of stages will be better!' 1:10 - 'Wow, it's basically the same enemies with the models changed and minor modifications!' 1:20 - 'I literally heard the announcer say that same exact line 2 minutes ago' 1:30 - *uninstalls game, screams internally*",
            "review_score": "-1"
        },
        {
            "review_text": "Are you wishing to find something similar to good old Diablo 2, but with the ability to move with the WASD-keys, aim with the mouse and more or less wave-zombie-survival-like gameplay? Look no further.  Gauntlet is a great game for both playing solo or in a party. Choose one of five classic characters:  Barbarian (aka The Warrior) Valkyre (aka The Tank) Archer (-_-) Wizard (aka Invoker's little bro) or Necromancer (aka The DLC-chick) and get into the fight through the vast dungeons full of monsters, traps, TURKEY and GOLD! The more you play and the more you kill - the more powerful you get, opening new bonuses and abilities.  Sharpen your axe and spear, stretch your bow or ....? your spellbook and dive into action!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very easy to get into and the cooperative gamneplay is very cool. The graphic style is pefect for this game and each class provides for some interesting results. A game controller is definate plus . I highly recommend that you  check this game out.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. It definitely smells of nostalgia. Graphics and sound are good and it definitely shows that the game is using the Magicka engine. Controls are fluid and responsive, however, I did find the pace of the game a bit slow. The mobs are massive and reminicent of the original.  Multiplayer is a lot of fun and I don't think I'll ever play it on single player mode. Relics and items are ok, not really my thing, but hopefully, later on they'll add more items.  This game has a lot of potential, but it hasn't reached it yet. I expect a ton of DLC to be released since there is a DLC folder in the game's installation.  Big gripes right now is that I can't reconfigure the keys and I'm not sure how multiplayer will do in the future. As of now, since the game is new, it's pretty easy to hop on and find a game.  Definitely recommend. I'd say this game is a 7.5 - 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is well done and a blast. Unfortunately, I was the only person I know that could get it to launch, despite trying a bunch of player-found fixes on the forums. Can't really recommend anyone purchase it in that case.",
            "review_score": "-1"
        },
        {
            "review_text": "This 2014 edition of Gauntlet is a game I want to like, but that's simply impossible. It's a tedious, monotonous game with serious design problems. The game recently got polished into Gauntlet: Slayer Edition, but the problems remained.  Conclusion: looks good, but not worth of any money. Maybe, if you get it for free, or as a part of humble bundle. Otherwise, no.  Regrettably, this game is not fun to play at all.  After 4 to 5 first levels the game starts to repeat itself. First levels are fairly enjoyable, but after that: nothing new. Controlling game characters (4 different + 1 dlc) is not rewarding, because most of the time your character is very hard to spot from the screen. That's because of three of the worst design flaws: walls obstruct your view, the viewpoint (camera) is zoomed out way too far away from your character AND the levels have very few light sources.  Playing the game makes you wish you had binoculars and a flashlight pointed at the screen.  How about multiplayer mode? You need a friend for that, because there is never anyone playing multiplayer otherwise. Once you get online with your friend, you will experience even more design flaws. You think you cannot get motion sickness from a game? I dare you to try this one on multiplayer mode. Have a bucket next to you when you try. I mean, what were the devs thinking? On single-player you have to strain your eyes to be able see your tiny character on a dim screen, and on multiplayer mode the screen jumps and jolts around making sure you'll vomit, or at least get a headache.  Even if I pretend I can endure the flaws I mentioned, the boring map design and clearing a floor after a floor from the same enemies over and over again is just not worth the time. It is very sad to give this game thumbs down, because I really loved previous Gauntlet games, such as Gauntlet: Dark Legacy and the original Gauntlet and Gauntlet 2. Yes, even the original Gauntlet is less monotonous than this one. At least the original Gauntlet had proper level design and a feeling of progress in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "They promised us native Linux support as a selling point. Months after purchase, they've admitted that they won't deliver. Isn't this false advertising? Isn't this illegal? This is what you get when you purchase an Arrowhead game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game's good. The Unfair difficulty is actually really challenging and punishes mistakes heavily. There's a good amount of items of which you can equip your character with 2 at a time, that are activateable and will get you out of a pinch but don't break the game. They're not impossible to get as far as grinding is concerned, and just by playing the game and feeling it out will improve your overall character naturally. The spell selection for the Wizard is a cool idea, forcing you to hit keystrokes/buttons in a specific series to conjure 1 of the 9 different spells available (I guess mimicking hand gestures). All of the characters are strong, though, Questor (the archer) being my favorite. The game is really an excellent modernization of the Atari version (which I remember the most, only briefly played any of the others), while it captures much of the same mechanics it really is its own game and holds up against any single player or co-op game I've played over recent years.  With the recommendation of this game, comes another recommendation, play it on Unfair right away. No single player/co-op game will ever be as hard as it is on the hardest difficulty for the first playthrough. If you give it a fair chance and decide it's too tough, tone it down a notch, it will feel too easy. If you don't play it with the harshest conditions possible with the intention of beating it on normal/hard for the first playthrough, and plan to play on Unfair after that you are cheating yourself. You will already know the layouts, completed the learning curve, and mastered how to manipulate bosses/challenges with training wheels on. Don't be a ♥♥♥♥♥. No grown ♥♥♥ man should be proud of beating a game, or difficulty setting, designed for children.  This game is reasonably priced.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun to play when you have a few friends over. Really challenging.",
            "review_score": "1"
        },
        {
            "review_text": "I love Gauntlet! The series, the feel of the game, and all that the Gauntlet series has offered up to this point. However, I'm a bit dissapointed with Gauntlet for the PC. Briefly put, this game falls short of my expectations. I expected to see more levels, abilitys, and monsters. To start, the feel of the original Gauntlet is missing. I jumped into the first few levels, and didn't feel absorbed into the Gauntlet world, and the feel of the levels fall a bit short as well. The game boasts 12 levels and in the end it just doesn't feel like enough. An endless mode, or additional levels would be nice to see in the game.  The game isn't horrible, but it's not what I like in Gauntlet games. I expect to jump into a game and play with 4 people and feel like I'm playing Gauntlet. I feel that this game may meet that potential after a few updates. I will still be playing the game, but it does not meet these expectations. I hope that some changes are made. ",
            "review_score": "-1"
        },
        {
            "review_text": "I can choose a 'meh' option? I mean its an okay game, but not what I remember Gauntlet to be. Whether its just my preferences have changed over the years or it just didn't capture the magic of its legendary arcade version, its not something I really want to play after the novelty wore off.",
            "review_score": "1"
        },
        {
            "review_text": "Great hack and slash. Each character has different controlls and playstyle, all of which are fun and effective. The difficulty ramps up in higher difficulty forcing genuine tactics and finesse. The progression system is simple and fun, rewarding smart play and provides good power progression.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like the original it is a safe bet you will like this too. Highly enjoyable Old School fun.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Good game to play with your friends if you just want to kick back and have some competitive fun. The heroes all work really well and the game itself is fun as hell to blast your way through. Only downside in my opinion is the length. Having never played the arcade I was able to solo run through this the 2nd time in about an hour and a half. Took 2 Hours for 3 of us the first go around.   My advice here would be to look for a good discount. It's a damn good game but not worth more than maybe $5 just due to length. Anymore than $5 and you don't really feel like you're getting your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game as an HD reboot of the old 80s arcade classic. Fortunately I was wrong. The arcade classic is there - but its in spirit more than form. There are still hordes of enemies, gates that need to be unlocked, and food to shoot - but they have taken the combat system to the next level, and introduce encounter and boss stages that bring the game onto a much higher level. Every player has a learning curve - you need to learn how to be effective with them. The wizard being the hardest. Once you start to learn your character however, the game is a lot of fun. I picked up the four-pack of gauntlet and sent it to all of my old gaming friends. Multiplayer is a blast. I only wish we could select the same character .. If I recall you could in the original .. 'Red Valkerie is about to die' ...  Before buying this game I checked a few reviews and critic sites. I would sum up the feedback of the game as 'luke warm' .. Many people cited glitches and crashes as the main problems. I'm playing version 1.03 (Patch 3) and neither my friends nor myself have encountered any problems whatsoever thus far.   If you played the original, Gauntlet II .. you should love the game and be pleasantly surprised by the additional features. If you are new to the franchise, then remember that it is a remake of an 80s original - its not trying to emulate any other game but itself .. be patient with the character learning curve and I'm sure you too will enjoy it!  2012-12-13 UPDATE: I play this game casually, a bit here and there. I'm starting to get my character masteries filled out - where you unlock small incremental buffs that accumulate to make you more powerful. I love the Necromancer update with the Colosseum. I play this game mostly solo - but when my kids or friends play with me - the game takes on a whole other level. It scales to the number of players and the boss fights are an absolute blast. Still unable to select the same character - that sucks 'Blue Wizard is about to die...'",
            "review_score": "1"
        },
        {
            "review_text": "DONT SHOOT THE FOOD!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I used to spend my evenings playing Gauntlet at the local pub during my college years. Later on, I got the game on the Amiga. Since then, I have waited to find a faithful successor to the original game. After having played this version of Gauntlet, I can honestly say that I found it. This game is as addictive as the original. You get that kind of rush when your life is almost depleeted and you are looking for a little bit of food. Great game, I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Narrator: Thor needs food badly. Narrator: Elf is starving. Narrator: The skillful Valkyrie made a tactical decision to destroy the food! Narrator: Warrior has died. Lilith: So much for muscles. Thyra: Get back in the fight Thor! --------- Really funny game, and it is really fun when you enter online mode.  1337/69 would die again.  --- NOTE: If you have poor quality WiFi, this game may not be for you.",
            "review_score": "1"
        },
        {
            "review_text": "OK game, but not Gauntlet. It's had to recapture the magic of the original. Do you know what the trouble is? In the original gauntlet, you had a more open map, in this game you are pretty much on a rail.",
            "review_score": "1"
        },
        {
            "review_text": "If you have some friends to play with, this is a hell of a time.",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet is a brilliant modern take on a classic game. It does away with all the unimportant crap that games have been overburdened with in recent years, and just focuses on what's actually important: Solid moment-to-moment gameplay that's challenging and engaging.   Perfect for playing together with a non-gamer spouse: No annoying level ups, tool tips to read and loot to distribute, just easy to understand abilities with depth.",
            "review_score": "1"
        },
        {
            "review_text": "meh. not what i expected.  a bit weak on content and depth.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic (up to) four player competitive co-op arcadey action. A surprisingly difficult and very fun arcade dungeon-em-up.. although it is a bit glitchy in it's current state (.. as to kinda be expected of the Magicka devs.)",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the old Gauntlet.  This one requires teamwork and a lot of trial and error. You will die, very easily. The classes are varied and fun to play with. My favorite is the Elf. It runs really well with never a dip in frames or stutters when the mobs fill the screen. There isn't too much replay value. You do unlock different powers and cosmetic gear but thats about it. Playing with friends wether online, local or even both is where the meat of the game is. As of this writing I had no problem finding people to p[lay with. It's fun and worth the $20 price. Just don't expect the depth of Hammerwatch or Torchlight. If you like dungeon crawlers and co-op games this is a goodie. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "was so terrible... if youre looking for a dark legacy equivalent .. THIS IS NOT WHAT YOURE LOOKING FOR!! you cant level up in this game you get no familiars no such things as items not even rune stones there is no 4 player fun times its so boring and lacking that you just want to stab your face with a rusty dull blade for spending money on this game. thanks WB for ruining the gauntlet series... i repeat this isnt gauntlet legends/ or gauntlet legends dark legacy or anything like it at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was already good, now with Slayer Edition it's Outstanding. • Extreme Hack'n'Slash bloodgasm, that feeling when you slice 15 enemies heads off, brings tear to my eyes. • Great game to play with your friends • Comic and challenging • Controller recommended  Basically with this new edition you can customize each hero more than before! :D. ",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for the old Gauntlet, you've come to the wrong place...it's not here.  Yes the graphics are nice and the controlls are slick, but this is not Gauntlet.",
            "review_score": "-1"
        },
        {
            "review_text": "While its not going to revolutionize the Gauntlet name or make it onto anyone's Top 10 games of 2014,  Gauntlet  is still a fun romp that gets better with friends, and is an excellent restart for the franchise. The gameplay is largely mindless, not many decisions need to be made even if you're playing as the most complex class, but feels rewarding and enjoyable if you can stomach the grindy nature of it. Harder difficulties are recommended, turning the game into a zombie/demon/orc melee extravaganza that requires a good amount of skill or luck to get through unscathed. Story is almost non-existant, but the characters are amusing and good for a few laughs, especially if paired together in co-op where they will play off each other. Playable solo, but much more grindy in nature this way. This is the type of game to play on a friday night with some friends and some beers, it doesn't take too much effort but can still be challenging and leads to some fun stories.",
            "review_score": "1"
        },
        {
            "review_text": "I like it but I do have a few reservations. It does capture the feel of classic quarter eating Gauntlet - to a point. But, I think it is also trying to be a Diablo type game and it falls short trying to be two things at once. There is a great C64 game published by EA called Raid on Doomfang. It featured 100 levels and a level designer - good times!  Also, I am puzzled as to why this game is poorly optimized. It runs very HOT whereas games like Kingdoms of Amalur - admittedly not a Cry Engine GPU killer - barely cause a blip in GPU temps.  I am hopeful that either level randomization and/or a leve editor will be added to Gauntelt 2014 to give it some legs. As it stands now, it is fun for VERY short bursts of time. Come on devs, please flesh ut the skeleton?",
            "review_score": "1"
        },
        {
            "review_text": "This game is awful. I enjoyed Gauntlet Legends on the old consoles - this is nothing like it. There are only 4 characters (+1 if you buy a ridiculously expensive addon), and they don't learn any new abilities ever. Equipment is all cosmetic, so there are practically no upgrades except for a small 'perk' system which you won't feel unless you log a lot of playtime. The levels are boring and flat with few puzzles that the old games had, and the bosses are totally uninteresting. There is not even the token storyline that the old game had, and the basic characters they did add in are ugly. I don't know what kind of nostalgia feeling other people are getting from this, but I had no enjoyment at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh my goodness the lag. I have tried (1) clicking the invisible resolution button below the visible one under Settings [And what is this, Neopets?], (2) changing the resolution in Settings.ini, (3) changing the resolution in user_settings.config. Also, you have to sign up on their website [for a 'WBID WBPlay LEGO ID'] just to get a ticket for support.  THIS COULD BE SO MUCH FUN.   wb pls",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst games I've ever played.  Very cheap rip off of the gauntlet franchise.  The gameplay is very linear and boring.  For dungeons they have just copypasted the first map of each dungeon, added few corners and corridors and that's it. Same goes for the monsters. Every level has the same monsters and spawners, but with a diffrent skin.  They should have taken a look at what Gauntlet: Dark Legacy was like and learned from that.  This game is just garbage.   3/10",
            "review_score": "-1"
        },
        {
            "review_text": "When is Gauntlet not like Gauntlet? When it's this version.  This has more in common with a multi-player version of Diablo than it does with Gauntlet.  I played Gauntlet in the arcades back in the day, when it was new, and eagerly awaited it's release for home computers, including Atari ST and zx spectrum and a few others that were around at the time. My friends and I enjoyed the conversion and played it for many hours.  Then came Gauntlet 2 and we were excited all over again, especially when it was released for home enjoyment, and we all spent our waking hours wandering around with different coloured versions of each of the four characters, with Red elf and yellow wizard and blue wizard and green valkyrie, it was a good time had by all without the limitations of one character type availalbe, and often we'd play as four versions of the same character to see how it played.  Now after a few other releases of gauntlet and it's clones over the years on consoles and home computers, we come to this version.  While I wouldn't say it's a bad game at all, to expect it to be like either of the first two Gauntlet games is to meet with dissapointment, and it really does have a lot more in common with diablo 1 or 2, and Diablo's spawned children than the golden Gauntlet of happiness that I still remember clearly and dearly.  There are certain things that tie this title loosely to the Gauntlet of it's title, like 4 characters named after the Gauntlet characters. Food that's fragile and can be destroyed accidentally, and the fact that it all takes place in a dungeon. Certain sounds and phrases are very similar to the original too. But that's it for similarity really. Anything else is from Diablo. There aren't mazes filled with spawners of varying strengths 1-3 (though there are occassional spawners scattered here and there), and there are potions but they are needed to power artifacts which you buy with gold, outside of the levels you play through. The speech is of course clear and everything, but it is missing the dramatic tone that the original sampled speech used to have, and doesn't fit so well. The only characters that shoot anything off are the elf and wizard, with the rest needing to use secondary abilities to do anything beyond bashing/stabbing the monsters. And on the subect of the wizard, I hope you like pressing combinations of buttons/keys to use an ability, out of all the ones he has hidden.  Muti-player is very hit and miss, in that you might find good players that work together, and with due caution, or more usually find completely selfish players who get the party killed and have no other care but for their own selves and getting all the money and food for themselves. Unfortunately there are far more of the second type than the first, which makes for a less than wonderful experience in multi-player, and has made it so that I am hesitant to even consider playing multi-player when (if) I play gauntlet. Too many people playing it as though the other gamers are just tagging along, and then blaming them for being noobs when they die because the selfish individual has taken all the money/food/potions.  All in all, I am not so willing to recommend this version as a Gauntlet game, but I am willing to recommend it as a diablo clone that's cheaper than the average game these days, and I'd not recommend it to any of my friends if they played Gauntlet and were looking for a modern version to have fun with, though hey.. it's a game to fill the quiet moments of the day with dungeons and monsters.",
            "review_score": "1"
        },
        {
            "review_text": "Although the game is short it is completely worth the buy, and if they release expansions then even more so. This game right now tho does have one worthless clas(warrior) but hopeluffy they will fix him to be usefull. ME personally i don't use the warrior so i dont mind that hes bad.   -oh ya i almost for got. IF YOU DONT BUY THIS GAME IT WILL GO TO WERE YOU ARE RIGHT NOWAND SING SONGS UNTILL YOU BUY IT... i may even DANCE!",
            "review_score": "1"
        },
        {
            "review_text": "Mass hordes of enemies blocking your way to the summoner, you're all low on health and you don't want to enter another coin, well you don't have to do that anymore do you? This game is definately worthy of the Gauntlet title and envisions the old arcade classic from the 80's. This is definately the original hack/slash dungeon crawler people remember, with improved graphics, some new sounds (and old for good nostalgic measure) and good ol' classic mode in the settings. Well worth the money, even if this is your first time playing Gauntlet i recommend you to buy this game. WARNING: Extremely addicting, quarrel with friends for shooting the food",
            "review_score": "1"
        },
        {
            "review_text": "I like axes and hammers.... SO not the game for me.... i love coop but this is not my coop... the 'thor' was so under whatever that it was not fun at all to play for me. never did try the other classes because I dont care anymore....",
            "review_score": "-1"
        },
        {
            "review_text": "Very shallow game overall not to mention game-play is pretty bland. Took about 4 hours to complete only because the game bugged out multiple times resulting in me having to do the entire tier over again. Wasnt expecting much from this game but i was still disspointed. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Not nearly as good, content wise, as Gauntlet Legends on the Dreamcast. Too short, too.",
            "review_score": "-1"
        },
        {
            "review_text": "Funny and very adictive. Play in co-op, it is much more fun than alone.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty great. Much better when playing with others, as long as you avoid the trolls",
            "review_score": "1"
        },
        {
            "review_text": "Ive been playing Gauntlet since the original arcade game version and i can happily say that the devs didnt screw this one up. It seems like alot of reboot games havnt been very good because of things the devs wanted to change about characters or gameplay mechanics that we loved. this is not the case with gauntlet. now if only i could figure out how to get that digital comic to download...",
            "review_score": "1"
        },
        {
            "review_text": "10/10 no joke one of the best games i have played in a while. The graphics are just like the cartoons 'Just Mindblowing'. the sound track of this game is fanomonal and makes every room feal different from the other because there is just so many songs in this game. Dont even get me started on the level design in this game i wouldnt even be able to stop telling you all the great things in each level. So if your looking for a really fun long lasting game for the price look no further and get Gautlet now. p.s. i havent stoped playing sence i got it. ONLY BUY ON SALE BECAUSE WE CHEAP ASSES.",
            "review_score": "1"
        },
        {
            "review_text": "I got wrist ache lol fun great to look at first impressions of co op multiplayer fine,fun and fast. At this price a steal .",
            "review_score": "1"
        },
        {
            "review_text": "I shot the food",
            "review_score": "1"
        },
        {
            "review_text": "I loved the original version of Arrowhead/Warner Bros attempt at Gauntlet, my only complaint was that it was A bit short. This seems to have been fixed with the addition of Endless mode, which is a good laugh, also the colloseums are a good little romp.  All of the character have been given an overhaul as well and are now more customisable, which will also add to replay value.",
            "review_score": "1"
        },
        {
            "review_text": "I paid 13 for this game on sale and still feel like it was over priced. It's a multiplayer game with no functional way to communicate - text or voice. What year is it again? It's honestly worth about 2.50 for how much content there is.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a long time fan of Gauntlet - back from the pop a quarter in the game at the Mall Arcade era. This is a wonderful true to the game update of the system. Alas there are some bugs. My son can not get it to open at all - per the forums this is a common problem. And using a keyboard - the navigation is tricky. I still can't see how to use potions whcih would be helpful in the race from death. Even at Easy level you can shoot food and potions. The wizard is complicated on the keyboards with a shift left click shift spacebar sort of spell pattern ( While using Wasd and mouse to flee for your life). Good update - not great and not as seemless as I would like.   Multiplayer helps greatly with survivability. Be careful you dont move too far away and get your partner stuck - yes still has that issue from orginal game. And be careful when you go somewhere if it is a one way trip or not.   Curious how play is with a controller vs a keyboard. If my son can ever get his up - then we will see.",
            "review_score": "1"
        },
        {
            "review_text": "The game feels like a mix of a top down shooter and an action rpg. It's fast paced, challening and simple in its core.  Why do I recommend it?  It's just very well made. Everything is smooth and nice about this game. I doesn't have N amounts of weird and cryptic gimmicks and abilities. You will grasp it very fast, you will play fast and you will have alot of fun with this while it gets more and more challenging. Easy to learn, hard to master. It comes with a healthy portion of humor on top of it.  Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet was one of my favorite Arcade games in the 80s, we played with 2-4 people around he arcade machine when I was a teenager. This game here brings back those good memories in many ways. Strongly suggested for team-players!!",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet is not a terrible game to kill some time with, especially if you play with friends but if you choose to pick it up I suggest that you only get it on sale. It has too many flaws for me to recommend it at full price.  It strays a bit from the classic titles but is still a pretty simple arcade-style game and does not get too bogged down with overly complex additions. There are some light gear grinds in the game, you have a few different weapons and other items which you can purchase with gold and some cosmetic cloaks you can unlock through arenas, but that is about it. It is pretty easy to get gold in the game although it can be a bit monotonous to grind enough to buy everything. There is a campaign mode with three difficulties but no real story to speak of, not that this type of game needs one. There is also an endless floor mode which starts extremely easy but ramps up to be quite difficult in a hurry.   Endless mode should be where the game shines, unfortunately the levels are terribly unbalanced and you can go through several floors in a row that are easy enough to be boring only to have a floor with a very small room so packed with enemies that it is nearly impossible to kite, making it extremely tedious to proceed. Also the camera in this game is absolutely horrible so if you are playing with friends and you end up kiting in opposite directions it will attempt to keep all of you on screen rather than focusing on your character. This can lead to you being stuck at the very edge of your screen not able to see what is happening around you. I would say the camera was responsible for more of my cooperative play deaths than anything else.  The Death mob is present but works differently than in Gauntlet 2. He takes up quite a bit of screen real estate and has a huge aura which can sometimes make it hard to see other enemies and projectiles. If he touches you it is an instant kill, at least on the classes I have played. This could actually be somewhat fun on long corridors when you are constantly running and killing what you can as you go, but when you get locked into a room with a large number of mobs, spawners and bullet-sponge minibosses and also have death and his giant blob of color to deal with, it stops feeling challenging and just feels cheap.   The old Gauntlet games threw ridiculous hordes at you but the gameplay was just more enjoyable than it is here. If Death was not quite as obnoxious and the camera did not continually cause problems I would find it easier to recommend. If you want an okay coop game that you can get ten or twenty hours out of, pick it up on sale but do not expect too much out of it. If you want to scratch the Gauntlet itch, just go fire up one of the old arcade titles because this game misses that mark.",
            "review_score": "-1"
        },
        {
            "review_text": "Forgot to eat.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Great casual game to pick up for 20 minute romps with three good friends. The levels are designed in such a way that you can easily break up your play time if needed or play through the night just as easily. The character classes have interesting unique play mechanics and controls that make switching from class to class much more fun that a simple change of appearance. In general, a solid game for those that enjoy a little co-op with a lot of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, wish i had some friends to come lan all the time for this one. It's a quite short, which is dissapointing, but its very replayable and there are many difficulties. I wish it was more arcade like - and that people could jump in whenever so you dont need to go to the lobby all the time to try to get more people as its most fun with a group of 4. It's a little unbalanced it feels, the warrior feels much weaker than everyone else and no one likes to pick him but they will likely patch to balance the characters a bit more (everyone wants the elf).",
            "review_score": "1"
        },
        {
            "review_text": "10/10 simply beautiful",
            "review_score": "1"
        },
        {
            "review_text": "This is not a Gauntlet game! If you are expecting a Gauntlet game like on the N64 or Game Cube, you will be very upset. I bought this game expecting to re-live my childhood with my brother and when we sat down to play it, it was a massive disappointment.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game when it decides to load. The game loads to a minimized window where sound is only heard and the game doesnt maximize. Outta the 12months ive owned the game its only worked for 1month. Ill give it a thumbs down only on my experience of when it didnt run but a thumbs up when i was able to play.",
            "review_score": "-1"
        },
        {
            "review_text": "At first I was unsure about this game. It was pretty fun at least in multiplayer with 3+ players. It was short though, we burned through all of it in one 'all-nighter.' So I wasn't sure if it was worth the money, though I did buy the 4-pack so I could share. However, I notice today that there is a 1.5GB update and the devs have added things and changed some of the systems (seemingly for the better). This is great, I love when devs keep working on their games and adding content and changing things. Redigit (Terraria) is a great example of this. That game is the best money I have ever spent. In short, I am no longer unsure about whether this game was worth it and I'm very glad that I bought and enjoyed this game with my friends. We will probably play it again soon to see the new things and changes to old systems.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely has some bugs pertaining to the Graphic settings such as a hidden 1920 X 1080 resolution setting. Along with some massive frame rate drops and audio glitches.   Aside from that and assuming you are lucky enough that the game doesn't crash, it is good. Like really addicting good. But the glaring issues are too much to ignore. I suggest you wait on the purchase for a week or so while the devlopers fix the bugs.   8/10 till the bugs are fixed  10/10 when the bugs are fixed.   11/10 when you shoot the chicken.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a long time fan of the arcade Gauntlet Legends you will be disappointed, however it is still playable.  When I reach 30 hours of gameplay and have'nt yet turned into a fire breathing chicken, there will be hell to pay.",
            "review_score": "1"
        },
        {
            "review_text": "Enormous waste of money. Don't bother unless you have at least a 60 inch screen to see the microscopic characters and really enjoyed the button mashers of the 80's.",
            "review_score": "-1"
        },
        {
            "review_text": "I installed this game on 2 different PCs and tried 3 different gamepads. ALL OF WHICH WERE SUPPORTED according to their guidelines. I couldnt get this game to see the gamepad. Load up anything else (Magicka, Trine, Metal Slug) and the gamepads are seen right away.   ",
            "review_score": "-1"
        },
        {
            "review_text": "I admit I was skeptical about this one. Recent entries in the series haven't done well. Legends and Dark Legacy were pretty bad. I wasn't sure they'd be able to pull this one off, but they did.   This is a solid game that stands well on it's own. I'm not saying it's perfect, as there are some quirks and rough edges. There's a strange 1920x1080 screen resolution bug (check the Steam guides for that work around). I think the way it visually tracks progress towards acheivements is confusing and unintuitive. These are things that should definitely be fixed, but nothing I would consider gamebreaking.   If you're a fan of the series, especially 80's arcade machines or the original NES version, this is a must-have. The developers went back to the roots of the series and on the things that makes Guantlet unique: monster generators, destructible food, the iconic announcer. They built new features on top of that like elemental spell combinations for the wizard, and the valkyrie's flying shield. They added an item system that lets you customize the characters accoring to your playstyle. But it all feels grounded in the original game, like it should have been there already.   If you're a fan of Guantlet, or just like killing mobs with 3 of your closest friends (or random strangers for that matter), it's worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "More like Smash TV than Gauntlet, but still awesome. Love Arrowhead.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice but quite short!!",
            "review_score": "1"
        },
        {
            "review_text": "I very much recommend this game. Though I do caution players. I played all the previous and original arcade versions and this game takes the trophy so far. It's a very simple concept as well. Run through the levels, try not to die, and beat the boss. You can cool artifacts and armour on the way if you're lucky or good enough.  This game does not skimp on difficulty. When it says hard, it means hard. I haven't even tried unfair with my friends. But you do need comms and communication to succeed.  A definite recommendation from me",
            "review_score": "1"
        },
        {
            "review_text": "I recommend it as it's a nice and fast dungeon crawler with a very cool artwork but not for 19.99 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "THE NEW UPDATE MADE THIS GAME AMILLION TIMES BETTER! :D",
            "review_score": "1"
        },
        {
            "review_text": "I thought it would be refreshing to have a co-op arcade style game like the old gauntlet legends but gauntlet fails to live up to its predecessor. The melee characters are useless and the mage will end up taking all the kills which will have a co-op pair fighting for gold and kills instead of working together. The levels are redundant and the main kill mob is composed of monster spawners. The camera can trap you or your friend as you run through the level and it is easy to get stuck in the small doors during the chase levels. Overall, I would not recommend this game and if you want to play it wait for the price to go down to $1-2 because that is about how much it is worth.",
            "review_score": "-1"
        },
        {
            "review_text": "Warrior needs food. Badly.",
            "review_score": "1"
        },
        {
            "review_text": "*UPDATE*  Gauntlet Slayer Edition  Finally the option to play at high framerate has come! In all other aspects I recommend this game now.  *previous comment* capped at 60 fps, F*** that peasent garbage. Will retract thumbs down if changed.",
            "review_score": "1"
        },
        {
            "review_text": "+++++++++++++++++++",
            "review_score": "1"
        },
        {
            "review_text": "Another black screen.",
            "review_score": "-1"
        },
        {
            "review_text": "So I put about 5 hours into this game. Safe to say it is a quick hack n slash with really no story line. The only replay value is playing through with each character buying their respected gear and leveling up what gear you can. I had bought this on sale with the DLC and played through with the necromancer on normal and I think I died once, maybe twice throughout the entire game and then I got destroyed by the last boss having to battle him around 10 times to finally kill him. There weren't really any puzzles. Just follow the path, hack n slash and that's about it. There is some occasional voice dialogues but nothing special. I believe there could have been a lot more added to this game but since I got it on sale I feel like I got what I paid for which was around 5 bucks. If I had paid full price I would of been extremely dissapointed. I understand the dev's wanting to keep it similar to the classics but that was 15 years ago. We need more and a lot has changed with gammers needing certain things to keep the replay value up like skill trees and character leveling. Otherwise you play through once and then uninstall.  Would I recommend this game? Sure. Its a quick hack n slash. Is there replay value? Afar from playing with different characters there is no replay value in my personal opinion so I suggest getting it on sale because that is how much it's really worth in play value.",
            "review_score": "1"
        },
        {
            "review_text": "Poor performance/badly optimized at release. Totally ruined my experience with it.",
            "review_score": "-1"
        },
        {
            "review_text": "The arcade game is eating my quarters again. Fun overload!",
            "review_score": "1"
        },
        {
            "review_text": "I really like Gauntlet it's really fun to play I do recommend you getting this game",
            "review_score": "1"
        },
        {
            "review_text": "Great game and a lot of fun....",
            "review_score": "1"
        },
        {
            "review_text": "Its A exceptional tribute to the classic games, It is very fun with others and supports matchmaking and 4 player Local co-op as well as ingame items , weapons , armour thats purchasble with ingame gold earned and maybe workshop/DLC at some point...  This games deserves a 10/10 for its creativity and originality...",
            "review_score": "1"
        },
        {
            "review_text": "You know I absolutely LOVED the arcade and N64 versions of Gauntlet so I'm bias as far as that goes but I really have to say that day one bugs really turn me off. Strike one for this company was the ungodly frustrating bugs in Magicka. This is strike two for Arrowhead Game Studios and if the Gauntlet bugs aren't seriously addressed in later releases, they've lost a customer for life.  FAIR WARNING: I'm writing this review with 1.6hrs of gameplay under my belt so draw your own conclusions on what I noticed during my brief time. In complete honesty, after the game crashed 1.6hrs in, I didn't bother loading it up again and played Civ 5 instead. I'm really irked about my ill-Magicka feelings bleeding through onto this review, but that's what happens when you don't address defects in your software.  Pros: Nostalgia, graphics, puzzle environment, online multiplayer, levels load very fast.  Cons: oh boy, here we go... -Full screen video. The game start with your windows start bar displaying. You can change it to full screen but the full screen setting doesn't always stick.  -Games in Progress: You can't join (or have your friends join) a game that has already started. Highly annoying.  -Character Selection: You can't select more than one character type at the same time. i.e. you can't have four warriors at the same time. You should be able to have a red/blue/green/yellow warrior but you no can haz!  -Upon death: I would love to have the ability to change character classes but since I'm locked to one class once I join the game, I can't do that.  -The camera. I played with two other players and all of us were on the same half of the screen, yet, the camera doesn't move to compensate unless you touch the edge of the screen. This leads you to burn up keys that you've collected.  -Auto Fire: When using the mouse, you can hold the left click to auto-fire with the archer, but none of the other characters have an auto-fire ability. This leads to insane amounts of clicking and can get really tiresome. I haven't tested this with my USB Logitech selectable auto-fire controller but I'm going to be forced to use it if this feature doesn't get added.  -Buggy: Random crashes reminiscent of Magicka that turned you off to Magicka in the first place. I was lucky enough to get to unlock level 4 with two of my friends in one sitting before the first crash occurred.  -Collision: Collision should be an option to be turned on or off. It's upsetting when your friend blocks a doorway and you die because can't get past him.  -Random spawn timers: I've died and have had to wait anywhere from 5 seconds to 20 seconds to spawn and have no idea why the timers are different.  -Wizard: The gameplay is challenging enough as it is, and your character is already always on the move dodging enemies, so why introduce 'Magicka style' 3 or 4 button combinations needed to cast a magic spell? It's my opinion that the wizard will be the least used character because of this.  -Warrior and Valkyrie: The HP attributes on these two characters needs to be improved, either that or make the fighting space a lot larger, have have the baddies do less damage, or introduce a slight knock back on every attack.  Hopefully these issues will be addressed in future updates.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good, good old school fun. Using the wizard is a bit out of whack though, those controls are a bit weird...",
            "review_score": "1"
        },
        {
            "review_text": "Great game, real old School action, frenetic &amp; funny from beginning to end. Well worth EVERY penny. Well done to the makers of this game &amp; thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Its exactly what I expaected. Its Arcade Hack n Slash and I love it. Also the game brings back childhood memories of me and my friends hanging out.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about competitive cooperation, and *must* be played with friends (either in meatspace, or with voip) in order to get the full experience. It might not be the 'next big game', but that's clearly not what it set out to be. The game is an absolute blast (with friends), and provides great value (especially if you grab a 4-pack).",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly well done. If anyone wants to play, add me on Steam and let's kill some stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Cons:  Wayyyyy to short for $20 in my opinion.   Pros: The mix of classes and the different control schemes keeps it fun and interesting. Graphics are pretty good for genre. Game plays well(phyics, movment, combat) Local Co-Op is included and is needed for the future of pc gaming steam boxes etc.",
            "review_score": "1"
        },
        {
            "review_text": "this game is is very good i love playing it :) only thing that make me peed off was the no bonus rooms like the norm one :( every ting else is there like death and that :)   8/10 do like :) need more levels :)",
            "review_score": "1"
        },
        {
            "review_text": "The game has great potential. It is action-packed, smooth and does not yet seem to be boring. I hope one of the updates will see a chat system to communicate with players in the lobby/match and maybe more gear. So far I am satisfied with the game itself and hope it will be getting better faster than it will be getting boring.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, and perfect for the casual gamer to get their fix. If you played the original, then this is a total winner. If you never did, it's a great game for the price.",
            "review_score": "1"
        },
        {
            "review_text": "A really great update to the classic Gauntlet. Each class feels unique with different moves and manuevers.",
            "review_score": "1"
        },
        {
            "review_text": "Short game. Ruthlessly fun though. :DD",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun top view hack n slash/ beat em' up. If these are your types of game i suggest this one. I recommend buying it on sale for it is kind of short and the other content its some what lacking. All the of the characters are fun and have their own difficulty of play! Very fun! Especially when playing with friends,   The only down fall to this game IMO is that it is too short!",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun.   But you still shouldn't buy it. The developers left the game, leaving it with only the barest content. 5 characters, only about a dozen maps, only about 3 bosses, and the removal of the hardest difficulty setting (which was what a lot of people played on, because otherwise the game is a cakewalk.)  The multiplayer is dead. Since there isn't much reason for people to come back to the same levels over and over. Unless you REALLY like pointless gold. (Like really pointless. It doesn't help at all.)   And again, the developers left the game. There will be NO future content. What's here is here. I got this game when ti came out, and enjoyed it. But the game has almost 0 content for the long haul.  Maybe play with friends, but that's not really a recommendation. ANY GAME can be made fun with friends.",
            "review_score": "-1"
        },
        {
            "review_text": "Mechanics aren't as deep as I expected. Kind of disappointing, even though it was bought on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "not the game i payed for :/ would like a refund because i really dont think ill be playing this game anymore.  played for 10-15 min. and really unamused.  why such a big change and remove old version completly?",
            "review_score": "-1"
        },
        {
            "review_text": "Gaunlet is a great dungeon crawler that stay's true to the original and also does more. One quick thing this game is not worth its original price and you should wait for it to go on sale. But on with it, it has a 4 player co-op that make you and friends trying to survive because its not an easy game. There is 4 characters with one dlc character that each have their role pros and cons. Its is a great game and it deserve a 7.85/10",
            "review_score": "1"
        },
        {
            "review_text": "Want a challenge? Want to hack monsters to death? Want dungeon crawling madness? This is for you. I am a big gauntlet series fan. I've enjoyed it very much, especially after the update.",
            "review_score": "1"
        },
        {
            "review_text": "I've been hearing about how previous Gauntlets are awesome, and also found this game seemingly very good while watching Twitch broadcasting it. But I have to say, despite this is a great game, the bugs don't cut it. TOO MANY BUGS. Just way too many to consider that this is an acutal released game. Beta or early access, sure. But actual released game? Not only bugs, but if you have ever played any other games, and tested out the game thoroughly, you know what interface needs to be changed. I'd say programmer sucks a bunch and shame on you. Do not buy this game.... unless these are fixed. This is why I am not buying the extra DLC.",
            "review_score": "-1"
        },
        {
            "review_text": "beat the game once got borad",
            "review_score": "-1"
        },
        {
            "review_text": "Despite all the negative reviews you'll probably see in this section,I still think the game is very fun.I bought it together with a friend and we jumped on together not expecting much really,but when we stopped playing it left a sweat taste in our mouths.It has a lot of classes that feel diferent from each other(atleast some of em),it has upgrades and diferent playstyles ffor each class,and the boss battles are unique and challenging.I feel this game is very good for around 5~ euros or like 6 or even 7(I got it for 2),but anything above 10 I wouldnt really recomend.Also,dont buy this if you are going solo,all the fun is the mayehm with 1 or more friends.",
            "review_score": "1"
        },
        {
            "review_text": "It is pretty good if compared to the original arcade game. Has everything you need for some decent coop. I just kind of wish it had more to it, as far as upgrades and levels. The unlockable cosmetic only things are just kind of 'meh'  6/10",
            "review_score": "1"
        },
        {
            "review_text": "Good multiplayer fun. Good sense of humor, pleasant gameplay. Recommended if you have friends to play this with.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me so much of Gauntlet Legends N64. The one downside is the boring narrator :( I do miss the 'Food is good' but hey, its fun.  I would also have to say I felt like like the story wasn't very long and I found myself going back to try and find something to do. I wonder if they could get the old story and apply it to this game. If that happened, I would easily give it an 11/10",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable Diablo styled game simplified down to core combat mechanics, strategy, and mindless mob blasting.",
            "review_score": "1"
        },
        {
            "review_text": "Best played locally with friends and loved ones. A great bonding moment for the wife and kids. Blood, gore and all.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game, capturing the essence of Gauntlet and modernizing it.",
            "review_score": "1"
        },
        {
            "review_text": "Game was dope. But a little repetative.",
            "review_score": "1"
        },
        {
            "review_text": "Was hoping for a sequel to Gauntlet dark legacy. Was quite dissapointed. I don't really understand how you can make an inferior game years down the line. All you have to do is copy dark legacy, give it good graphics, and give it your own spin. But they couldnt even do that.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome dungeon hacker which really comes alive with friends. Characters play quite differently and gameplay can get quite complex, allowing real mastery of a character with enough practice. Visuals are smooth and pretty, with relatively low system requirements.",
            "review_score": "1"
        },
        {
            "review_text": "A nice little diablo III-like game.  For 5€ a must buy, but not worth 20€.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥t with graphics from PS 2.Better buy Sacred 3, much better.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste you money on this game. It's only a matter of time before its free. Not worth it at all. Unless they do a major overhaul on everything there is about this game. It is not worth the money. Game is 3 chapters and 4 dungeons/levels per chapter and 4 difficulties. So once you completed easy, you have done it all. So basically a total of 12 maps, other then that. It’s just more monsters and higher hit points. Its really to bad that such a great game from the 80's has been so cheaply redone. I will never buy another warner bro's game again. warner needs to stick with the cartoons and leave the gaming to the Pro's. Atari would of Never let this slop be released like this.  Two bit Duh Two bit Duh Thats All Folks",
            "review_score": "-1"
        },
        {
            "review_text": "There's no real weight behind the attacks in this game. The gameplay feels very slow and monotonous after only a few moments. Maybe things pick up eventually, but the first impression I got was not a good one.",
            "review_score": "-1"
        },
        {
            "review_text": "A very brutal game, And worthy of being a successor to the Gauntlet name.",
            "review_score": "1"
        },
        {
            "review_text": "not a bad game, turned out too much like Diablo than I had wanted... I wanted the same feeling as Gauntlet when I played it in the arcade",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "Same old I need another mountain dew feeling as the gauntlets I was playing in arcades back in the day. Awesome",
            "review_score": "1"
        },
        {
            "review_text": "The game is fastpaced, skills are satisfying, and you actually have a purpose to fight.  However this game is a bit repetitive, relics cost a lot of gold, so it may require some grinding.",
            "review_score": "1"
        },
        {
            "review_text": "Need . . Food . . Badly . . Thor . . SMASH!!! 10/10   Also . . Please add chatting communication for multiplayer. Its too quiet to play 4 players with no chat.",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying this game! Even though I'm not great at it, the online multiplayer is super awesome! JUST REMEMBER TO NOT SHOOT THE FOOD. THAT MEANS YOU ELF &gt;:(",
            "review_score": "1"
        },
        {
            "review_text": "These days such called hardcore!",
            "review_score": "1"
        },
        {
            "review_text": "The best game to figure out which of your friends is jewish.",
            "review_score": "1"
        },
        {
            "review_text": "A good remake of a classic even with the red warrior is about to die and shot the food a must buy",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is Awesome Fells like the Old school one Highly Recommend it for a friend or you'r self",
            "review_score": "1"
        },
        {
            "review_text": "play the wizard or you're not good",
            "review_score": "1"
        },
        {
            "review_text": "It's okay.  I was expecting hundreds of procedurally generated levels and gameplay more involving than kiting monsters around a tombstone before eventually blowing it up. It's a missed opportunity when you put your mind around it but I still enjoy playing it, it just could have been a lot more.  ♥♥♥♥ers dont shoot the food arrgh",
            "review_score": "1"
        },
        {
            "review_text": "Super fun a little small. I wish it was bigger! Multiplayer group finding is a little buggy but I bet they work it out they patched once already :)",
            "review_score": "1"
        },
        {
            "review_text": "A great throw back game love what i have played so far and cant wait to get back to it...... so im going to stop talking about it and just play it =)",
            "review_score": "1"
        },
        {
            "review_text": "A series revived and overall a fantastically fun game; however it's not without it's faults. One, the class selction is limited and because of it you rarely get to play the role you want to play and you'll often see people leave if they don't get the class they want. They should have made two versions of each class like Dark Legacy so people would have more choice and variety for gameplay as the 4 classes get tiring. Two, the items you purchase are merely cosmetic and do nothing, invest your hard earned cash in actives. Three, there is a desperate lack of of levels and variety in the game. This game would thrive off of more unique stages and level creator would be amazing here. Four, the final and most pressing issue, there's a huge lack of communication. In a cooperative game like this it is very difficult to function properly without proper communication; voice chat, a more fleshed out command system, or even a simple chatbox would makes a world difference in improving the game. The thing Gauntlet does right though is gameplay itself. The actives are brilliant, the gameplay is fantastic, coop is fantastic, and the style is gorgeous. In total I think this game is a step in the right direction for the Gauntlet series and I hope it gets expanded upon in the future or gets a sequel that get's it right.   $20 is a steep price for such a simple game, wait until it's about $10 to get your money's worth.  TL:DR  Pros - Gameplay - Style - Actives - Coop - LAN  Cons - Lack of Communication - Lack of Characters - Too Short - Overpriced  7/10   ",
            "review_score": "1"
        },
        {
            "review_text": "I have seen this game played and it looks very fun but unfortunately my computer cant handle the intense video graphics even with all low settings. I mean I can play left for dead 2 with low settings. I just whished this game could update so older computers like mine can play. But i do recommend it",
            "review_score": "1"
        },
        {
            "review_text": "This is the first Guantlet Game that I have played. Coming from playing Diablo 3 extensively and Borderlands 2, and other rpg loot based games, this game is on a different class of game. It isn't loot based like most. You can get gold which can go towards different abilities, however it is mostly a classic old-school style hack n' slash game. If you want to relive the glory days of the '80's and '90's style of rpg dungeon crawlers, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game if you remember the original. I love the elf while the wizard is a steaming pile of shot food. The elf is like playing any twinstick shooter great for solo and multi. Barbarian heavy hitter with cleave damage good both styles. Valkire is also a good strong multi player but lacks good offense solo. And the wizard is slow and most spells shoot every 3-5 seconds and you have to remember 9 button combos for his 9 spells he is only useful in a group as a nuke because he does not do cleanup easy. All difficulties are fun and can be finished solo with the right class. My only gripe is the gear you can buy dont explain if they increase stats or are just cosmetic. And relics in the right hands can make or break a run at the higher difficulty levels. From what I have seen its 45 levels broke down into 15 chapters and 3 acts. Each chapter is one static level that is not random. One random run from death level (Which is easy if you keep moving and clear out props) and a arena level that is one screen. At the end of each act is a boss. Dont play with 'classic' graphics on its just a horribly derezed nightmare nothing like the original. ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and challenging co-op game. It's a great throwback to old style games.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a BIG dissapointment!! I have played the Original arcade version of 'Gauntlet'....I did so as a kid in my lunch hour, which would sometimes be 2 hours and a detention for being late back to school. 'Gauntlet was a memory I have from a long time ago and so I had very high expectations for this new 2014 version.....One thing I always remember was that it had 100 levels!! Compare this to the handful we get now its pitiful? Ok the graphics were pretty poor back in the 90's in comparison to nowadays, but what have the devs done with this game? Its not what I was expecting that is for sure....Fun, teamwork and hordes of ghosts, grunts and generators just to start with. I would have been happy to just have potions as they were, 100 levels where you were able to skip to level 7 if you found an exit for level 7, death as it was back in the day not some toxic cloud emiating from its ringpiece. It feels like no effort has been made, no in game chat, not even text type!! and we the human gamer guinea pigs flock to obtain a game because we all know the history and what it used to be like.....Its a shame really, because this could have been a REALLY good game if they had maybe taken a look at the original and taken some of the simplistic level design, teamwork, puzzles, and beefed it up a bit into a polished 2014 portal of a classic game. It didnt need Big bosses, just an end game, hidden stuff and areas and bits n pieces for your charector to buy, teamwork and loads and loads of ghosts, grunts etc.  Overall...  Ok for a bit......then it wont appeal anymore, give it about 2 months, and we'll have it on sale with steam!! 4/10 :0(",
            "review_score": "1"
        },
        {
            "review_text": "4 classic classes, 3 classic chapters with a central hub at the start of each game. Abilities are Shift, Space, and Right Click plus the ability to get 2 items bound to Q and E for extra powers. The game is fanastastic and very polished. I don't regret hyping myself up for this indie title. The art style is reminiscent of Magicka (same devs), but this has it's own zombie horde feel that really requires a good mindset and strategic positioning plus a good grasp of the class you're playing at the time. Overall I'd rate this a 7 or 8 out of 10 with a high replayability value. I'd like to try out survival mode soon and see how the random generated content comes into play. I am on Chapter 3 and then will start a Hard campaign and then eventually Unfair difficulty. Fun stuff!",
            "review_score": "1"
        },
        {
            "review_text": "Barely started playing it, but it's got that old Gauntlet feel with some modern, more complex game mechanics. I approve of the experience so far :)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would destory food again.",
            "review_score": "1"
        },
        {
            "review_text": "alot of fun if you like dungeon crawler games and if ur on my friends list buy it and play with me or you're a ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Been playing for a few days now - It's obviously not the same as it was in the 80's, but it's still a lot of fun. Really shines when playing with a group of friends. Won't really go into the gameplay as it's pretty self-explanatory - hack up and try and survive in dungeons infested with mosters. Bosses are great fun and fairly tricky as the difficulty levels rise. Godd atmosphere etc. All in all - it's never gonna win an Oscar, but it certainly is immense fun....for how long remains to be seen, but for the decent pricetag, it's certainly worth it for a little nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "The originals were better",
            "review_score": "-1"
        },
        {
            "review_text": "i downloaded the game but the screen to play wont pop up what do i do?",
            "review_score": "1"
        },
        {
            "review_text": "Boring. Same sequence over and over.",
            "review_score": "-1"
        },
        {
            "review_text": "Just buy Diablo 3 this is so bad",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a throwback to my Arcade days. If you ever played any of these games on the N64 or Arcade, you need to pick this up. It's hard. It's fun. It's hilarious. It's just incredible.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best co-op games I've played in ages. Extremely challenging. Highly recommend playing with friends.",
            "review_score": "1"
        },
        {
            "review_text": "If this was a free game I could recommend it - however, this is sadly not the case. The game lacks replayability with purpose for me and there are far better hack &amp; slash games out there. Look into Diablo 3, Divine Divinity, and Sacred 2 if you are looking for a more fleshed out solid one there. If you are looking for a pick up and play then go for only a few minutes move along as well. For me this is a 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome!!!! The fighting is very exciting.",
            "review_score": "1"
        },
        {
            "review_text": " I bought the ORIGINAL GAUNTLET. Almost beat the original Gauntlet. Now with this 'NEW UPDATE' this game is called Gauntlet: Slayer Edition and I lost my old progress. Why not have both versions playable??  Amazing game just like the original on Nintendo (NES). Except no timer and much better visuals and gameplay!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "might be fun if you could ever find a game.....",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like it could be a good game. However, it's currently unplayable due to the fact that you cannot rebind any keys. Everytime I try to talk on TS, I throw my shield. Effectively stunning myself and blowing a cooldown ability every time I try to talk in a cooperative game is extremely frustrating. Not recommended before rebinding keys is patched in.",
            "review_score": "-1"
        },
        {
            "review_text": "PLayed 3 hours with and without friends.. Not worth 20€",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty Cool, though not sure if its a keeper yet gets boring after awhile. Game is fun though and worth a try though i think it should be less $20 is steep for it.",
            "review_score": "1"
        },
        {
            "review_text": "WOW, play red nation, this is pretty dumb, and im the original gauntlet master....you can have my capes..",
            "review_score": "-1"
        },
        {
            "review_text": "its fun, but very hard, and one problem I found was that there is no button to use potions on the xbox controller setup. which sucks.",
            "review_score": "1"
        },
        {
            "review_text": "The nostalgia isn't here. This is not the installment you want to play.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just awful",
            "review_score": "-1"
        },
        {
            "review_text": "The classes are very different from each other and help provide a new game expirience when using each. Team work is likely going to be a big deal further in the game.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the original coin-op game, but I am really sorry that I paid for this.  When I die in the campaign I have to start from the beginnig.  When I look for a multiplayer game, there usually isn't anybody. The one time I found another player, I must have looked too much like a noob and he booted me before launching the game.  Really not fun like the original was.  I played it some more, since writing the above. I managed to get into some more multiplayer games, but I just get kicked. Maybe it's because I'm a noob, but if you just bought this game, you will be too.   This game sucks. Don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Words cant describe this game...",
            "review_score": "1"
        },
        {
            "review_text": "do not buy its crap",
            "review_score": "-1"
        },
        {
            "review_text": "Game is incredibly easy until the last boss where he has a one hit kill move that you have to dodge before any animation even starts, and then half the time it hits where you dodge to so you literally have no choice but to die.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been waiting for this game since it was annoucned, and the wait was WORTH IT!  I got introduced to Gauntlet with Gauntlet Legends and played Dark Legacy. Even played in the arcade.  This game is just amazing, especially with friends, work together to go through the gauntlet and try to survive, play co-op or solo!   I haven't beaten the game yet but my time that i have spent with it has been joyus and if you're a fan of gauntlet and or Gauntlet Legends or Dark Legacy and like having fun with your friends pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a huge disapointment. Though it looks good it is repedative and almost completely lacks character advancement. The big question you must ask yourself is why would I ever play this when there are so many better dungeon crawls out there. On a keyboard the Wizard Class is almost unplayable. The Warrior class is underpowered. This game is bland and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "This has none of the aspects that made the old gauntlet fun. Everything that was cool and original has been left out of this game. This game is nothing but a boring mindless dungeon crawl. It's basically like diablo 3 was to diablo 2. A sequal to a great game made by different people with whole new ideas... that are completely unoriginal, uninteresting and uncreative. Worthless trash. 4/10 would not buy again.",
            "review_score": "-1"
        },
        {
            "review_text": "lots of fun !!!!! wish controls were easier to use fingers are getting in each others way.",
            "review_score": "1"
        },
        {
            "review_text": "According to the date in the corner of my desktop, the year is currently 2014.  This game does not allow you to rebind the awful keyboard controls.  In 2014.  The developers have posted that rebinding will be added soon. Whenever that is. For something that should have been in the game, and people on the forums had been wondering about.  Was really looking forward to this game, having pre-ordered it as soon as I heard about it. Not being able to change the keybinds makes it basically unplayable for me.",
            "review_score": "-1"
        },
        {
            "review_text": "awfully bad. mostly because of the controls, but you'll have a bad time playing it alone since there are so many monsters to kill and sometimes you die without even knowing what did hit you.",
            "review_score": "-1"
        },
        {
            "review_text": "Its alright.",
            "review_score": "-1"
        },
        {
            "review_text": "This is AIDS, especially for the price. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "A little short, but never have I had so much fun ♥♥♥♥♥♥♥ off my girlfriend by picking up a crown.  10/10 would 'steal' crown again",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the characters and wide difficulty range (easy is easy and unfair is exactly what it says) make it incredibly replayable. Colosseum provides another fun challenge and most of the game seems soloable so far, maybe not on unfair, but we'll see. Even though you can play through the game solo it's a lot more fun with friends and the fact that their is local coop is a really nice touch.",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool. going back towards classic a bit more than previous sequels, but giving you more than just 2 attacks. I thought it was well done, though I wish you could defeat death with potions still. tons of fun and all the characters play so different you gotta try them all.",
            "review_score": "1"
        },
        {
            "review_text": "Fun great looking game to play with friends at first, but quickly became stale since the custom powers can't be used in boss fights nor is there any way to improve the skills of your character. It should have taken a page from Forced and introduced more systems that encourage team-work and strategy, but for now there is only few challenges that makes you want to keep playing. Extremely low replay value because unlockables don't change anything except for looks and the only challenge comes from seeing how much you can spam the same moves against the same enemies against the same spawners in the same levels you did before fighting the same bosses in the exact same way with just more of their health to take out. The game is boring, the combat situations are the same each time, and the characters are far from balanced with the warrior being so pathetically weak compared to the others. It's good for some 4 player hack-and-slash, but doesn't experiment with any of it. This is not an rpg, you choose 1 of 4 preset characters and 2 limited use abilities which can't be used in any bossfight.",
            "review_score": "-1"
        },
        {
            "review_text": "Just like the Arcade. great game",
            "review_score": "1"
        },
        {
            "review_text": "I would not recommend this to fans of the Original, or even later versions of gauntlet.  It simply shares the name.",
            "review_score": "-1"
        },
        {
            "review_text": "Played Gauntlet Legends on the Dreamcast. If you loved that you're bound to love this.",
            "review_score": "1"
        },
        {
            "review_text": "I rather enjoy playing this with friends, trolling each other by destroying food and rushing for the crown.  Pretty much the ONLY criticism i have is that it is incredibly short, it took a mere 4-5hrs to finish with a friend.  If there were to be more realms added, giving it more playtime similar to that of the original(like an additional 10hrs at least) then I would gleefully recommend this game.  I choose to tick that i recommend this game since i enjoyed it and dont consider it to be a bad game at all, if you are looking for a fun multiplayer game where you troll each other like in Magicka then i say go for it :)",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet is a challenging game. It caters to the casual gamer, giving a great experience for those who just want to point and click, and an equally great experience for those who want to master the classes and defeat hordes of enemies with precise mouse and button clicks. I reccomend it to everyone and give it a 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "don't buy, nothing like the original... go play diablo 3 it's the same thing",
            "review_score": "-1"
        },
        {
            "review_text": "Verdict: 7 / 10  The 1980’s Gauntlet characters return in this new era of gaming: Thor the warrior, Thyra the valkyrie, Merlin the wizard and Questor the elf. Each one having their own progression called masteries. As you chop down, skewering, obliterating or sniping foes, the character becomes stronger overtime, even awarded in death too! Relics, a new feature, activated by potions, have different effects on oneself or enemies. Having it on the right the character can make all the difference in heat of battle. The voice acting is a neat touch and nicely done for the characters to feel more lively, especially Questor’s having a Scottish accent.  Unfortunately, the biggest letdown of the game is the length… it’s short. Finished roughly about five hours on the second hardest difficulty. After completing the game, the repetitiveness is harsh because you’ll be playing the same dungeons again, again and again. At that point, you’ll be increasing the character’s masteries. Still, it declines interest and the replay value quite fast.  The developers no less stuck true to the 1980’s Gauntlet feel. With its amount of content and shortness of the game, it’s going to be hard to love the game. I still recommend the game if your looking for some good old hack ‘n’ slash cooperative fun.  And remember… don’t destroy the food.",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw a trailer for this new version of Gauntlet I was a equal parts skeptical and excited. Excited that a new Gauntlet was even being made but a little bit worried about the seemingly bland environment and really high up camera perspective.   Having played it now for about three hours all I can say is that it's great! I'm not sure if someone with no feelings of nostalgia towards the series will be able to appreciate it but I can say it's been a while since I experienced such a rush playing a game. The differentiation between characters is cool and you still get to experience the 'old school' long-range Gauntlet gameplay by playing as Archer or Wizard.   I've enjoyed online multiplayer so far. Balancing teamwork with nabbing as much loot as possible is fun as always though I'd like to try some local multiplayer for that good old fashioned couch fun.   I got used to the camera being so high up and can appreciatelocking players on screen as it adds to the need to work together and not just run off for some solo action.  Anyway I might update this review as I play some more but for now I can only recommend it!  ",
            "review_score": "1"
        },
        {
            "review_text": "Not exactly what I was expecting but its a lot of fun both solo and with friends",
            "review_score": "1"
        },
        {
            "review_text": "Fun game for coop",
            "review_score": "1"
        },
        {
            "review_text": "I shot the food. Teammates cried. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A group of friends and myself use to play one of the older versions of gauntlet and loved it so we decided to give this one a try and see if all of us could play together again. The game is awesome, tons of fun and a great game to play with a group of friends.",
            "review_score": "1"
        },
        {
            "review_text": "It's super great. It's like a CRPG/Hack-n-slash gameplay style. It gets straight to the action and it never lets up, which is great because the combat is fantastic! The diversity of the playstyles means that the replay value is seriously good. You will have one that you love and you will likely enjoy all of them. I highly recommend the necromancer, creating an army of skeletons is so OP against waves of enemies. She hardly ever gets hit, and her theme/scripted lines are hilarious and badass.   I'm very glad I made this purchase. I play it with my wife all the time and we have a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for quick plays. Reccomended to have some friends to play with.  I have fond memories of Dark Legacy. This feels as though they were playing off the arcade games however still a great game. Very short, but tons of repaly value.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet. 4 difficulties. 4 heroes to choose from. 3 levels, with 4 dungeons each including 1 boss. You 'progress' through the game as your character grinds achievements that give you damage and survival boosts -- almost esential to do the harder difficulties. The shop now only sells one type of item, which you can hold two of, and the items grant you an ability that you level up 3 times with gold. Only about 3 of these are actually useful, and once maxed out, gold will be useless except to cosmetically alter your character as you 'unlock' cosmetics by defeating more difficult modes.  Basically once you beat it on normal, you know what it is. If you want to progress beating the harder modes, it's a grind not for gear but for achievments to boost your damage, and the grind itself is quite long.  Overall, for a buttonmash type gauntlet game it is still fun. It'd be nice to see more content rather than just padding content with grindy achievments and reused content with stat-padded enemies no more threatening then before, simply more time consuming. I still managed to squeak out quite a few hours playing just one class alone in this game. I hate DLC... but I hope to see some DLC for this game adding some more levels",
            "review_score": "1"
        },
        {
            "review_text": "The game is done well for what it is; no lag, decent connections.... but it's insanely short, pretty easy, and offers no replayability. If they had made about 10 times as many levels then I would recommend it highly but there's just not enough content.",
            "review_score": "-1"
        },
        {
            "review_text": "Chalenging and fun!",
            "review_score": "1"
        },
        {
            "review_text": "I Love this game, me and friends have been playing this the day it came out and the devs have been patching and adding new playable classes. Hard, is just hard enough to keep you on your toes, but not too hard. The game feels smooth.",
            "review_score": "1"
        },
        {
            "review_text": "That moment when you wish you still had your n64. Seriously how can feel good about this game as a developer knowing you were outdone by a 16 year old cartidge. Repeatitive is an understatemet. The Wizard's 'spell' system however unoriginal was slightly enjoyable and that is about all that I can say was a positive point for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A great remake of the original Gauntlet game. Grab some mates and beer, slaughter zombies and have a barrel of laughs! :)",
            "review_score": "1"
        },
        {
            "review_text": "Great arcade-style hack n' slash game. I tried playing it single player and local co-op, and it's WAY better with someone else. It certainly has an old-school arcade vibe to it (4 buttons to mash, racing against the clock, fighting through swarms of baddies...), which is great, but is also a tad frustrating for a casual gamer. There are no saves, so if you die (or if you don't have hours on end to play in a row), you have to keep restarting from the beginning. And since you only have limited 'tokens' to revive, if one player is weaker than the other, you end up restarting the same level over and over again (in our case, we sometimes had to restart the same level 5 or 6 times to get through it on medium difficulty. We eventually downgraded to easy difficulty). The achievements are also a bit of a stretch, so there's not a whole lot of replay value. I still have it the thumbs up because it's worth the buck for a good night of fun with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Love it.  Gives me nostalgia. Different heroes have different attach mechanics.  Great with friends.  Dunno why it gets bad reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Had been umm-ing and ahh-ing about buying this for ages. I loved the original version (being old enough to remember it in the arcades and on the Spectrum, etc), but wasn't sure about the remake. It looked nice and shiny from the videos, but still... So, anyway, it came on sale a couple of weeks ago, so I bought it. Love it. Mainly playing as Elf so far. Humour is good, 'puzzles' and level layout are great, actually quite tense in the dark levels.  Unlike the original, you don't get massively over-swamped with baddies. The weapons are pretty cool, too, as well as the power ups. Glad I bought it. Good, clean fun.",
            "review_score": "1"
        },
        {
            "review_text": "Are you looking at this game with fond, rose-tinted memories of Gauntlets past? Are you, perhaps, remembering hours upon hours of fun, with or without friends, smashing your way through hundreds of foes and dozens of doors, pushing ever forward to victory and the end of your journey?  If you answered 'yes', congratulations, you've already played this game. No need to buy it, you've already experienced more than what this store page's title could offer you.   I just saved you twenty bucks. You're welcome.",
            "review_score": "-1"
        },
        {
            "review_text": "Gauntlet is a very enjoyable co-op hack n' slash experience, and also surprisingly fun when played solo. In contrast to Arrowhead's previous game Magicka, Gauntlet is extremely polished - expect great controls, graphics, and interface. However, bad habits from Magicka do return. Most notably, Gauntlet is simply too short as-is, with too little variety in environments, layouts, and enemy types. It feels very much as though Arrowhead have held a lot of content back, knowing they can make tons of money through DLC (as they did with Magicka).   In short, expect a fun experience from Gauntlet - but don't expect a long one.",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet: Dark Legacy is one of my all time favorite games. With that being said, Gauntlet I feel does not match up to how good Dark Legacy was. The poor character selection is my biggest complaint. Dark Legacy had so many! My second complaint is the game trying to be funny. I just can't take it as seriously. All in all though, it is still an excellent game. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "FRIENDS!!!!!!  I played one full level and then Death himself wiped me out on the second, but I can tell already this is a GREAT game! If the devs dont change anything... So far it feels like the old Gauntlet I lost countless hours playing in my younger years. :)  It has the hordes of creeps and their endles spawns until you destroy the base thingy...  As you explore the dungeons you find keys to open areas, eat food to heal and franticly spin and move killing all the monsters mobbing you. The dungeons to be explored are part defined maps and part procedurally generated so it has massive replayablity.  The art style is very Torchlight and fits perfect giving the beadties and piles and piles of loot. A shimmery cartoonish coolness that wont get boreing soon.  At the beginning you are given the chance to play all four characters, Barbarian, Valkyrie, Elf and Wizard. They have the same weps they always did but with a few new combos and control choices. All the characters have several attack options that are appropriate to the character you play.   I did notice one new machanic to the wizard- the spell system is like the one used in Magicka- prolly because its made by the same people: Arrowhead Studios. You will have to cycle key choices useing shift-space- left &amp; right mouse buttons- which ever you press first, adds the first componant to your spell: lightning ice and fire. Along with the other keys you 'build' your spell after it is created you seem to have the ability to fire it over and over useing the left mouse button.  I didn't play long nor did I try online multi-player I will wait for my friends to play with but I still see this as AAA quality game. For the price of 20 bucks you really can not go wrong.   If you played the original Gauntlet you will more than likely feel the same about this remake from Arrowhead Studios.  -Mr.GrAnD  ",
            "review_score": "1"
        },
        {
            "review_text": "Shot down all the foods when Thor and Odin were at 10% health.  Enjoyable like the original, spent many quarters on this. 11/10, perfect for anybody who seeks adventure and trolling their friends.",
            "review_score": "1"
        },
        {
            "review_text": "Not interested in playing with a controller, and unable to remap the keys.  I bought this game because I have a custom arcade cabinet, but it works by mimicking a full-sized keyboard; without being able to remap the keys, I can't even play 1 player much less try for 4 player local co-op (also apparently the mouse is necessary for whatever reason). So basically I paid $20 for a game I will never play, because the developers were too lazy to program in adjustable key-bindings (which ought to be in every game invented since computer gaming got big in the late 90s/early 00s).  Given that so basic of a feature is missing, I have serious doubts about the playability of the rest of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably one of the best OldSchool Arcade Games brought back to life ever. Its just as amazing as it was before with an even more difficult aspect to it :)",
            "review_score": "1"
        },
        {
            "review_text": "Got this the other day,have yet to be able to connect to a single CO OP game,which is why I got it in the first place,have Fiber optic high speed net connection,no probs there,just wont stop kdisconnecting me for some reason,all my other games work fine,waste of time so far,save your money.",
            "review_score": "-1"
        },
        {
            "review_text": "To avoid any misunderstanding I would NOT recommend this game to anyone. Well, that's not entirely true. If it were sold at 4.99 I'd say go for it, knock yourself out. Okay so 14.99 isn't a king’s ransom but I expected a little more. I, like a fair few of you guys out there, played the arcade original and liked it loads. Hell, if it wasn't for that reason I'd not have looked twice at the title.   To my mind Gauntlet was always an extremely limited game, but I foolishly assumed this reboot would inject new life into its old, dried up veins. But no, no it didn't. Okay they've added a few half arsed items, etc, but it's all done with little or no imagination. I suppose that's why it only cost 14.99? I mean come on guys, this is a lazy game that has such a short shelf life. Yes I know it'll get a DLC make over, but at what cost? Another 14.99 for more half-hearted, second hand churn? Not for me, sorry. Anyway, after 17.5 hours I've grown bored of its mindless repetition.  Matt..",
            "review_score": "-1"
        },
        {
            "review_text": "Okay. I am aware that i don't have nearly as many hours invested in this game as others do; but i would still not recomend this game at all. For the first six hours I spent playing and beating the game i was highly dissapointed. My original thought was that, i just need to beat these first three areas then more will apear. Boy was i mistaken. I found myself forceing my self to like this game, which one should never do.   I did enjoy the fact that at no point did i feel invinsible.   But that being said this game needs a searious reworking of the bosses difficulty. the first boss was significantly harder than the second, and i have tried both wih all the characters. And the last boss was more about fighting trash mobs then fighting the boss himself.  End of the day; as a big fan of the previous titles in this series. I would not recomend this game to anyone that has played the others. just bust out your ps2 or gamecube and go at it.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game to play with friends online.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun! Reminds me of the classic old school Gauntlet in the best way possible!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. A lot better if you're playing with people you know (and have skype) because you can't talk to eachother.",
            "review_score": "1"
        },
        {
            "review_text": "I'll admit, this game is fun to play, especially with other players. The down side to this is that the story was way too short. It's not even close to the arcade Gauntlet, since you can't drop through an exit hole to the next level or have the almost infinite number of levels. Though this game has added special abilities to each character and to be able to purchase/upgrade items. (Not real currency, in-game currency) I'd recommend this game if the price was cut in half. This game isn't worth $19.99. If they could somehow add many more levels to the game, then I'd recommend it. But for now, no. Save your money and wait for a sale to buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun Game if you have 3 friends willing to play the game with you. Otherwise it might be a little too hard for some people because their are so many creatures on screen.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game. Its a nice fun throw back.  Really enjoyed it more playing with 4 rather then solo.   However, its short. Real short.   7/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Nostalgia (it's a fairly honest remake) - Enjoyable Co-op experience - Reasonably priced - Some humor (most of it doesn't 'work') - Watching your friends die because you shot the food / potion / fire barrel (and the Narrator lets them know that)  Cons: - No F*$KING 'Gauntlet' theme (as someone who played the original, this really bothers me) - The matchmaking service is f'ing horrible, made worse by the relatively low number of players - Characters are locked - join a game that already has your best / favorite character? Too f'ing bad. - Enemies and bossfights are samey-samey.  - The 'loadout' system is completely cosmetic, yet still requires a ton of gold and specific boss kills (or signing up for Warner Bros.'s stu pid 'gaming service' ). - Obtaining genuine damage / health / abilities upgrades requires grinding out thousands (if not tens of thousands) of kills. In other words: either you play this game for hundreds of hours, killsteal like a ♥♥♥♥♥♥♥, or you spend a lot of time solo.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game, but I can't play it most times because for some reason it will bug out and my screen will freak out in special effects, the entire screen may go white, flashing lines will appear everyone, gold keys and coins and what not will appear all over my screen, red and black dots will go everywhere, and things of that nature. If the game could handle not freaking out with visual effects and make it unplayable, it would be great.",
            "review_score": "-1"
        },
        {
            "review_text": "Very tedious game. Rinse &amp; repeat. Was hoping for a baldurs gate RPG.",
            "review_score": "-1"
        },
        {
            "review_text": "I cut my teeth on Gauntlet in the arcade, spending way too much time and tossing way too many quarters into the hungry gullet. This is by far my favorite arcade style game.  However, save your money until this game gets 50% off... go buy Runers instead.  The good: The story elements, characters, and theme all have the classic Gauntlet vibe. The intro gave a good, and quick familiarization with how each character fights. I really liked the idea of gaining benefits by dying in interesting and different ways. The online game even keeps you stuck on the same screen, so charging off in opposite directions gets you stuck.   The bad: Unlike the original, this game gates off portions so you end up fighting hordes of creatures in enclosed spaces. Rince, repeat.   The scary: a recent indie game by the name of 'Runers' only needs to add a multi-player coop option in order to completely blow this version of Gauntlet out of the water.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a highly replayable, excellent hack and slash. The kills are gratifying. The loot stealing is a fun mini game. The bosses and mini bosses are challenging enough to -want- to farm your character.   Overall good job. I find very little gripes and have absolutely found more than the $20 asking price worth of entertainment. It has almost hit Diablo 2 status on the 'funability' scale. Bravo.",
            "review_score": "1"
        },
        {
            "review_text": "I was a big fan of the original. This is a fantastic recreation with hours of replay value. Play 1 of 4 different characters through 3 different major game sections each with 4 different dungeons on 3 different difficulty levels.",
            "review_score": "1"
        },
        {
            "review_text": "The only game that makes you fear for your life when you see food",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, fun to play co-op. Bash, bash, bash!",
            "review_score": "1"
        },
        {
            "review_text": "This game brings back all of the fun of old with some new elements. Miss the classic Gauntlet style? Well here it is! It could be a better PC port, admittedly, but at the same time it's still an incredibly fun game. I've only had limited experience with it so far, but from what I've played I can absolutely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The first time I saw this reboot on steam, the first thought that came to mind was 'Only twenty dollars? Should be like a mini game with this kind of price tag.' I was taken back to Gauntlet: Dark Legends when I used to play with my friends as a kid and just recalled how much fun I had playing. This game couldn't be any worse, and without second thought I purchased it.  The point is, this game is magnificent.  The mechanics are really pleasant and definitely easy to pick up from the get-go. The character progression is something I really enjoy, you don't lose time in your inventory full of numerous things that could confuse and otherwise deter you from the gameplay such as other hack-n-slash games. You can immediately pick up and take pleasure killing creatures and the rewards system will level your character based off of prerequisites that you meet as you play the game longer. You can spend time in the shop where you can choose two Relics and attempt to find the combination for your character.  The visuals are simple and appealing - you don't need more.  This is the the perfect game to spend hours and hours with friends and have fun with them.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, the game is good.  It could use some fine tuning.   The Cons:   Character building could use slightly more depth. Legends had it on the money, but I suppose relics are the compromise between Classic and Legends.  Multiplayer needs an update. Specifically, being able to jump directly into a Public game regardless of if they're in a lobby waiting. I've had way too many people join and quit before entering a dungeon.  Levels are too few. I've only had the game a few days, playing it only a few hours a day and am almost done on Normal. At the very least, I'd hope they release some sort of endless challenge dungeon.  Pros:  The game is a nice blend of Classic Gauntlet and the modern hack-n-slash grinder.  Graphical refresh is slick as hell. Though, the close-up character models could stand for an upgrade. They look a bit to iOSish, as though they could be planning a port one of these days...  Gameplay is for the most part solid. There are a couple minor annoyances, but pretty negligible in the end. Probably the most annoying thing is using a key because your weapon hit a door while attacking.  Multiplayer gameplay-wise is spot on.  For $20, you can't really beat it at all. If this iteration of the game is any indication of where the franchise is going, I'm really looking forward to expansions and the potential for a sequel. Good game. Good price. Support it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Wow!  So, firstly, not at all what I thought it was going to be.  Watching the videos and such, I thought this was going to be something more than just a cold replication of the classic gauntlet, like a modern reboot.  They reallly need to make that more clear in the description of what this game actually is.  This is not a $20 purchase, this is a $5 phone app disguised as a $20 purchase.  Great nostalgic reboot of a classic game, definitely not worth $20 though, There are cheaper phone apps that are more complex, ya know?  I really thought this was going to be more than just a hard classic reboot. like, nothing at all about dark legacy, whatsoever in the game, just staight up original Gauntlet.   I will continue to not recommend that anyone spend $20 on this game until they at the very least announce that there's going to be more than what there is already.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would get frogstomped again.",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet does a lot of things right and Arrowhead (the developer) has raised the bar for this type of experience in a lot of ways. Items of note:  No game I've played does a better job of making you feel like you're fighting against unending hordes of enemies. The Dead Rising series comes close, but Gauntlet's core combat mechanics are built around it. Every combat move that a character has is designed with careful consideration to how you would use it in a horde of bad guys, with pros and cons. This isn't always balanced well between the character classes. Let's segue to that:  Gauntlet, unlike its predecessors, only allows you to pick one of each character class. This means there's no Red Wizard and Blue Wizard. There's just Wizard. I understand the purpose of this, and in a lot of ways, it's better for the game. Each class is very different. Unlike previous entries in the series, the classes all play very differently. The control schemes are different, and your primary tactics are different. Forcing players to choose different characters means there are a lot more interesting and varied things happening in the game, and that is undoubtedly cooler. It also prevents exploits that would be plentiful... I can only imagine what 4 of any one class could do if they strategized to take advantage of their strengths. If the game had balanced around the need for that, the characters would have lost some of their most fun and defining abilities in the interest of balance.  However, it means matchmaking online, or even with your friends, can be a bit of a pain because you will undoubtedly have a favorite class. There's also a 75% chance that nobody you're playing with will want to be the Warrior. I beat the game with the Valkyrie (the game tracks progression separately for each character class), but I put in significant time with each class. I can say with some confidence that the Warrior is underpowered and difficult to play. The Valkyrie and the Warrior are the two characters with the most similar control schemes, but the Valkyrie's moves are often more practical and easier to use than the Warrior's. I won't go into depth, but I'll simply recommend that the game is better with 3 players than with 4, assuming nobody plays the Warrior.  The lighting and art style are perfect for the content of the game. The story is forgettable and pointless, but the characters have fun personalities and they spew Left 4 Dead-style quips at each other. The dungeon's master Morak (more like Genorak amirite?) has a sadistic GLaDOS quality, especially when he mocks you for destroying food, and the game is genuinely fun to listen to. They did an excellent job with effects and sound design for giving the player tons of feedback, despite a hugely crowded play-space once the hordes get going.  I would be very happy to recommend Gauntlet, especially for co-op play.",
            "review_score": "1"
        },
        {
            "review_text": "I give this game a 8/10. It's a lot of fun and the 4 characters offer a surprisingly balanced game. Hope they develop and release more worlds.",
            "review_score": "1"
        },
        {
            "review_text": "FUN. JUST LIKE THE GOOD OLD MIDWAY DAY",
            "review_score": "1"
        },
        {
            "review_text": "As much as i REALLY wanted to love this game.. it was just way too short of a game to really enjoy. Being very limited with veriety in spells / combos of any kind, I felt as if my only option was to button mash my entire way through with some slight 'dont stand in the fire' style dodging. Myself and some friends carelessly beat the game on its normal difficulty in just a couple hours. I don't have much to say outside of that. was fun while it lasted? but nothing to keep me coming back to even attempt the harder difficulties at all. Sorry Gauntlet, you were a childhood favorite, and I gave you all my best hopes.",
            "review_score": "-1"
        },
        {
            "review_text": "Beomes completely unplayable over time as audio starts to stutter and gameplay slows to a crawl. MacBookPro with 2.6 GHz quad core i7 running Bootcamp. Other simple bugs like onscreen text obscures pause menu when its brought up clearly indicate a rushed QA job.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing! You're not just mindlessly shooting everything in sight. Each character takes skill to use. Moreoever, this game requires a lot of teamwork. Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet is a really good game with great gameplay. Yet I'm getting one very severe tech issue thats making the game unlayable for me. I'm playing it with a wired xbox contoller and the game is constantly cutting off from my controller getting me killed constantly. I've gotten several other stability issues when running this game such as the music cutting in and out and problems with glitching textures. This game is not the finished product its made out to be and is on the verge of being unplayable. Once these technical issues are fixed this will be a fantastic game but until they are fixed I would not recommend buying this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The online play is pretty bad, and it's incredibly tough and lonely to run solo. Locally though, this game is great. Friends stealing loot, witty banter between characters, friends accidentally destroying loot, satisfying skills, and plenty of baddies.",
            "review_score": "1"
        },
        {
            "review_text": "+ Game is cheap + Looks nice for a low end game + Gameplay like the original + An intresting take on a clasic  - This game is very fidgity and looks odd streatched across 3 monitors. I thought multi monitors were common on PCs?! - Game's Keyboard/Mouse controles are akward. On a 'computer only' game?! - Only a few controlers supported. All the owners of the (very common!!!) Logitech F310 are out of luck! WTF?! You need a controler that costs 3X (or more) then the game in order to play it?! GET YOUR HED OUT OF YOUR *** ARROWHEAD!!!! - Some people that actualy have a working controler are not giving the option to switch between keyboard and controler.  I played for a bit, and found the Keyboard/Mouse a little wonkey so I whent out and bought a controller. Walmart - Only controler for PC was the Logitech F310 BestBuy - Only controler for PC was the Logitech F310 Target - Only controler for PC was the Logitech F310 Controlers supporterd - Not the Logitech F310  This game REALLY seems like it was made for the WiiU, or even a smartphone and at the last min changed it to PC. (I'm glad it's not a WiiU game, the WiiU already has enough bad PR it doesn't need this to deal with) It's like the Devs dont even own PCs, or are 'Bro' gamers, that have pre-builds with are configured to be ran like an xBox360. It's like alot of thought was put into recreating Gauntlet, and no thought was put into how people would actualy play it.  5/10, 5 for what could have been, -5 for the crap we should NEVER EVER have to put up with from a 'made for pc game.' It's like a bad port!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Everything you need to experience to understand the entirety of the game happens within the first minute. What a pointless waste of time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Akward controls, graphics issues, has very little in common with the original gauntlet gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: -Tons of fun if played with a friend or three -Widely differing playstyles based on which character you choose -Very few bugs/issues  Cons: -Solo play can be aggravating at times with how frequently creatures spawn from spawners -Can't remap keybindings (Not much an issue unless you're playing the Wizard) -Fairly repetitive (Similar to Gauntlet Legends, Seven Sorrows, and Dark Legacy) -Very few levels overall (Again, similar to Gauntlet Legends, Seven Sorrows, and Dark Legacy) -No in-game chat (VoIP or text) -Characters seem to have balance issues (Will elaborate below)  Gameplay: 7/10 Graphics: 7/10 Reply Value: 5/10 Overall Rating: 6/10  Worth $20? No Worth $10-15? Absolutely  All in all, the game does a great job in taking you back to an earlier age of gaming where storyline wasn't always paramount nor required. In terms of being a hack and slash game, it also does a great job. However, it falls short in the category for replay value, variety in level design, and overall balance.  Playing solo is do-able with the Valkyrie or Elf (Played through the first four areas, boss included, as the Elf solo on hard), but the Warrior falls far short of where I believe he should or was intended to be. As above, will withhold judgment on the Wizard due to lack of use.  Unless you're playing with friends with some form of communication (VoIP or third-party chat program) don't expect much from PUG groups. As mentioned above, wound up soloing the first boss on hard when a party of 2-4 failed multiple times due to lack of communication.  Character Balance: Warrior - Should have been the frontline tank and brawling damage-dealer of the game. However, any time I've tried to pick him up and play the game on hard he feels more like a mobile punching bag for the enemy masses than a fearsome warrior. His rush ability is okay at knocking enemies down, but the overall utility is lacking compared to the Elf and Valkyrie. Perhaps it'll start to shine when I unlock the ability to leap attack with it.  OPINION - Increase health pool and damage dealt, should help to relieve some of his early-game issues.  Valkyrie - Similar role as the Warrior, except with more mobility and utility. Makes me feel like I'm playing some medieval female Captain America character with the shield throw. Tons of fun overall. Possibly the second-best character in the game next to the Elf at the moment.  OPINION - Replace her sword with a spear and give her a mid-ranged thrust attack.  Wizard - Withholding judgment, haven't played the character outside the tutorial. Not my style.  OPINION - Withheld  Elf - Quite possibly the most powerful character in the game, easily solo'd the entire first chapter of the game right through the boss on hard. Very mobile, very versatile, very deadly. Legolas from LotR, 'nuff said. The few times I've had issues using the Elf were due to my own mistake on where to roll, where to place his bomb, and generally running into stupid situations. Otherwise makes hard mode easy mode.  OPINION - Bomb damage should be halved against creature spawners and have its cooldown increased by 20-30%. Should also have a slightly longer delay after finishing a roll to balance the fact it can pass through ANY enemy.",
            "review_score": "1"
        },
        {
            "review_text": "repetition after repetition... ZZzzZZzzZZzzz to bad. May instead recommend to play Hammerwatch.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is so BORING... not much incentive to continue playing...  1) upgrades dont do much 2) cant stack characters (more than 1 archer in 1 in coop play)  Overall very underwhelming.",
            "review_score": "-1"
        },
        {
            "review_text": "This game captures all the things that I loved about gauntlet and added on to them. As a game that is based completly around gameplay, the different characters were fun and each set of levels gave a unique twist on the overall gameplay. If you enjoyed arcade type games then you would enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "Very much fun. Good game playing. Did this for the badge",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this to those who have not played Gauntlet Dark Legacy. The reason being is that there is not a multitude of characters to choose from in that game and whenever a character does come out you have to pay for them also instead of just getting them with the game or having to do something to unlock them. The dungeons are fun and chalenging if you play solo. I have not been able to play with others yet. The mobs are ones that you eventually are able to predict on how to evade, but still provide a challenge when you are fighting massive hordes of them. You can grind and make your chosen fav character look and feel stronger compared to others, but really only have a bit better of an edge. I beat the game going solo in about 4 and half hours. Overal the game is good, not great. Don't buy it full price would be my advice and hope that they come out with a character that you love (I want the jester back so badly so i can throw bombs). This way you bay what the game should d cost with the character you want to use. 7 out of 10 for game rating right now.",
            "review_score": "1"
        },
        {
            "review_text": "This new twist on gauntlet appears to be a welcome change after an hour of play and one chapter complete. Each class has unique combat mechanics and gameplay between them is quite different especially the wizard which is very magika like in magic mixing and useage.  I think I bought it on a sale but even at $20 bucks this game is a steal.",
            "review_score": "1"
        },
        {
            "review_text": "Bad game nothin like the other gaunlets in a bad way",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, a little more complex than classic Gauntlet with more moves and controls (especially for the mage/wizard). Highly highly recommend playing with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "well, its fun to play friends, not so much with grinding alone.But if you do play with friends or total strangers be prepared to be rob because they wont let you to get the gold....fml",
            "review_score": "1"
        },
        {
            "review_text": "Couch co-op and a solid update later, I can do nothing but reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you are an old gamer from the 80's coin-op era or a seasoned dungeon crawler, this game could be for you. Updated graphics, great sound over and the multi player option really does this game justice. I personally expected to be a little dispointed with what had been done to the game but I failed to meet my own expectations. This game could get a little dry after several hours non stop play but as a game on its own to while an hour or two away, you could do much worse than this.",
            "review_score": "1"
        },
        {
            "review_text": "You go to aim in a direction to attack and your character just does what they feel like. Enemies act like walls and too often are swarming you before you can work up a strategy to defeat them. Your characters die quite easily and the gimmicks of things like Death following you in levels, without the ability to never die, grows old very quickly. If you're a fan of Gauntlet Dark Legacy, just avoid it at all costs. Hell, if you're a fan of fair and difficult games like Dark Souls, avoid it.",
            "review_score": "-1"
        },
        {
            "review_text": "All you need is friends, if you have friends you can play with, this game unfolds itself to one of very few games on PC that are on par with Nintendo system games in terms of just having fun with friends and competing against friends while always play together as a team. As some reviews here say it's a short game. You can play the normal difficulty through in two or three sessions, every session one of the 3 chapters with 4 sub-chapters with about 4 stages each, depending on how fast you get the puzzles, more complex bossfights and challenging level designs. So you have about 48 stages that are handcrafted and play and look very differently from each other. This is an arcade style game, it's ment to be played when you happen to find half an hour to have leisure time with friends online. Or if you suddenly all got time on your hand and don't know what to play together: This is the perfect game for that. For singleplayer only or if you want to play through a rich story together, i'd say better get another action RPG like Dungeon Siege 3. And before i forget it: Gauntlet is not easy! It is not an easy game, you need brain, a good overview over hectic situations, the ability to hit with skillshots (everything in this game is a skillshot!) and hence, very fast reactions, even when playing together with up to 3 other players. And you'll need to find a way to make quick decisions together as a team, in some cases you will be punished as a team for deciding for different routes or actions at the same time. A good example is a situation where you have less keys than there are doors to unlock and behind some doors there might be more keys. And the UI? It's the best action RPG UI i've ever seen, that even allows for every player's character information to be completely visible on each player's screen simultaneously! You see all your friend's resources, cooldowns, active spells, etc. The UI and hack'n'slash combat are genious, both on par with Diablo 3, at least!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, quirky, great character design and if you play it on hard difficulty, then it will MAKE YOU CRY. If you're looking to pass a few hours and have a great time, then grab a few friends and play Gauntlet.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Started playing by myself, but finally got some friends into this.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY. When the game released the framerate was uncapped and it looked great on a 120hz monitor but the devs decided to patch in a 60 fps cap with absolutely no way to unlock it.  ",
            "review_score": "-1"
        },
        {
            "review_text": "We played through the entire game co-op and it was extremely short. For some games that would be fine, but there was pretty much no room for character advancement and none of the items were really purchasable without grinding. Some of the 'levels' weren't even levels. The final level of each act is a single room boss-fight that you are dumped right in.  I feel like we would have just been better off playing Gauntlet Legends on our Dreamcast. If you haven't played Hammerwatch and you have a choice between getting that or this, get Hammerwatch instead. You'll thank me later.",
            "review_score": "-1"
        },
        {
            "review_text": "masochistic un-game. Also, for own sanity, do not bloody bother playing anyone other than the elf if you play solo. If you go solo, you are only permitted to win 1st room of 1st course, but even that reduced form is only viable for the Elf. If you are up for co-op, go with elf as carry, Lilith as semi-carry, wiz as support, don't bother with a 4th.",
            "review_score": "-1"
        },
        {
            "review_text": "Been playing Gauntlet games since the early 80's - found this one to be fairly faithful to the original, with modernisation and a couple of new abilities, but in keeping with the spirit of the original. If you liked Gauntlet 1-4, you'll probably enjoy this one too.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, just make sure you have friends to play it with!",
            "review_score": "1"
        },
        {
            "review_text": "its pretty decent but its best played with a controller for sure",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, brings back some childhood memories!",
            "review_score": "1"
        },
        {
            "review_text": "fun game with friends!",
            "review_score": "1"
        },
        {
            "review_text": "The uninstall button works BTW",
            "review_score": "-1"
        },
        {
            "review_text": "As a long-time fan of the Gauntlet series, I really looked forward to playing this game and wasn't disappointed. It's very hard to get through levels playing by yourself on the 'normal' difficulty setting, so this game is best-played as a multiplayer game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. But only really fun when your with someone. not saying that signel player isn't fun, but Co-op is where you can have the most fun. So grab it when a few friends and have a blast",
            "review_score": "1"
        },
        {
            "review_text": "It's Gauntlet, I mean come on! I grew up on this game; however, this is not the game that we all know from console and arcade -- it's better. What's more 'Gauntlet: Slayer Edition' is also familiar enough that the player will fall in love with the franchise all over again.",
            "review_score": "1"
        },
        {
            "review_text": "The game has improved a lot since launch, for sale price is a nobrainer with friends. Always play coop if you can.",
            "review_score": "1"
        },
        {
            "review_text": "Not the same as the old gauntlet. Solo is really hard and skills i find very useless and dumb, it is a boring game and you die very easy no fun at all.",
            "review_score": "-1"
        },
        {
            "review_text": "The original Gauntlet was released in the early 80's on arcade and this game is an awesome addition to the series.  This is an amazingly fun hack n slash game.  Online MP runs great and is hours of fun.  If you are looking for a more arcade-feel Diablo, then this is the game for you.  10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Not sure i like how they changed the achievment",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game, especially in multiplayer, that comes with some good old wave clearing nostalgia and extra RPG elements from modern games. But if you've come looking for Gauntlet Legends, you've unfortunately come to the wrong place. Not that there's anything wrong with that, it's worth it for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "Ended amazingly. So much lore and a nice long cut scene before the credits. Genuinely worth all my time. But too much lava. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Best played with friends. Wait for a sale though.",
            "review_score": "1"
        },
        {
            "review_text": "I would recomend playing is a fun game but dont expect the same gauntlet. It is also disapointing that they just recently stoped production on this game and i hope that the gauntlet series isnt dead and will come back with a punch and discounts to the ones sticking with them cause that be awsome.",
            "review_score": "1"
        },
        {
            "review_text": "I have to remove my former Thumbs-up review. Sadly, after the 'Slayer edition' I cannot recommend this game. If you can, pirate the old 1.2 version. That was ingenious. This is just a mindless button-smasher without fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Slayer Edition is terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun except for the last boss.",
            "review_score": "1"
        },
        {
            "review_text": "More! For Thor!!",
            "review_score": "1"
        },
        {
            "review_text": "It's good to kill some time with friends and quite fun. Would recommend it but don't take it too serious. Re-make of an old classic.",
            "review_score": "1"
        },
        {
            "review_text": "Not to many hours to beat the game but there is a decent reason to keep playing with the endless levels. You can play with 3 other people and with friends it's a lot of fun. Able to beat it within 6 hours and the extra levels are fun for a bit.",
            "review_score": "1"
        },
        {
            "review_text": "A perfect game to play with friends, definately not one to play alone.  I rate 4/20.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent co-op title. Good fun though it could've used a bit more content and options.",
            "review_score": "1"
        },
        {
            "review_text": "I've been looking forward to playing this for about a year, and after playing the original as a kid I was worried about them screwing it up, but it has to be said they've done an amazing job with it! I've only had a couple of hours playtime, but playing co-op on this with my brother was the most fun I've had on a game for ages - I can't wait to get all 4 of us playing! :D   The controls are great with the XBox 360 controller (although the wizard is confusing to play with at first, but you quickly get used to it) however i've heard people complain about the PC controls, particularly without being able to change them. The classes all feel like their classic selves and instantly felt familiar, along with the enemies who also have nice re-designs. I also like the addition of the new Necromancer class, who has the ability to summon undead warriors to fight alongside in battle, but the £3.99 pricetag is way too much! (bought mine on sale). I look forward to seeing what other DLC is released in the future, but pray they stay well away from microtransactions, which could very easily kill the game.   I like the new features in the game too; having the upgrade store bewteen 'floors' is a good idea, and gives purpose to collecting gold. The new bonus items are also useful too, but don't take the challenge away from the game. The new survival mode is a new way to break a way from traditional gameplay, which also allows you to unlock a cool set of capes to show off with :P   This is a brilliant remake of a classic game, and highly reccomend it, whether you've played the original or not. Grab the multipack and play with your mates, I promise you'll enjoyt it!",
            "review_score": "1"
        },
        {
            "review_text": "almost a year later and its finally a full game",
            "review_score": "1"
        },
        {
            "review_text": "Very different from the original gauntlet. Still playing as the wizard is very fun. I don't really enjoy the other classes and they want you to pay for the 5th character.",
            "review_score": "-1"
        },
        {
            "review_text": "VERY GOOD GAME THE CONTROLS ARE AWESOME AND 4 class to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "=)",
            "review_score": "1"
        },
        {
            "review_text": "luv this fkn game",
            "review_score": "1"
        },
        {
            "review_text": "Memories of playing local coop on a keyboard (all on one computer) came flooding back. It's like the old school one with some nice adjustments so that both oldies and younglings can still enjoy it today. Haven't tried playing on public servers, but definitely a blast if you have friends who can play with (or against!) you. If you enjoyed Magicka, you will definitely enjoy this!",
            "review_score": "1"
        },
        {
            "review_text": "Great new take on Gauntlet while still keeping the feel of playing it in the arcades. The player classes and their new abilities are refreshing and the graphics are great! Find your friends and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Great Coop Game , a lot of fun with Friends .",
            "review_score": "1"
        },
        {
            "review_text": "So let's be honest about this game. I bought it when it was on sale, if I would have paid the full price I would have been ♥♥♥♥♥♥. Instead I got it at a decent price for the gameplay which was around $6.00. This game has a lot of things going for it, and if WB is smart they will listen to the community on the game, in Short this is what I have.  Pros:  Dungeon Crawl and Awsome experiance with multiplayer Buy this at a discounted rate Graphics are Ok, they could have been a lot better Cons: Short gameplay 6 hours or less to beat this game, yes I know it is meant to be played over and over No Random Dungeon,We Need RANDOM! Everything is the same when you replay the game, Why devs are lazy about this is beyond me, and to me this is what bothers most people from playing.  Bosses are not really to enjoyable, The last boss is the best fight in the game.  Need more dungeons then what they have there is 3 per door and 9 instances in the last 3 doors are bosses.  The game is fun although the negitive's about the game I have it isnt enough not to play it and yes I would return to play it again and I will re do this review if that changes.   P.S. Dear Devs if you guys ever look at other game reviews always make Random Dungeons when you create a game somewhat in this genre!",
            "review_score": "1"
        },
        {
            "review_text": "Very much like the 1985 orginal but with modernized graphics. Will fill the gaping hole of nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "this is my first time posting a review. The game is really not worth anyone's time unless they relish in old school arcade style games with no flexibility. If you like POE or DII (DIII sucks in my opinion) you will not like this game. I am sad that I wasted $20 on this game to be honest. I have to completely agree with TraceofHatred's review. Too basic for what you get. Look elsewhere for fun and excitement.",
            "review_score": "-1"
        },
        {
            "review_text": "Havent managed multiplayer since the update",
            "review_score": "1"
        },
        {
            "review_text": "Fun game! Although I've only really played the Warrior for more than a few minutes, have still had fun, especially when playing with friends. The interplay between other players can be almost as much fun as the game itself. Never played the original so I can't comment on that, but from what I've seen, it is a great update that still captures the spirit of the original game.   Would appreciate savepoints to some degree, as when you're playing solo it can be a bit hard to play through a level in one sitting. Other than that, it's a great game, and I am looking forward to playing it more.",
            "review_score": "1"
        },
        {
            "review_text": "The original Gauntlet was perhaps the pre-eminent arcade hack-and-slash quarter eating game. The 2014 remake follows in the tradition of the original game, but changes the formula somewhat; rather than having four identical classes with the levels being what really defines how you fight, instead there are four different classes where the emphasis is on your powers and teamwork.  Overall, the gameplay experience was decent enough, but there wasn’t all that much of it; for $20, only about 4-5 hours of gameplay feels a bit limited, but the limited nature of the gameplay meant that stretching the game out any longer would have been a mistake as well, as there just isn’t enough meat to the game for such. While there are challenges to complete which grant the player permanent minor buffs, and a number of relics which the player can unlock, in the end none of them really felt interesting or exciting enough that I had to play the game over and over again, grinding through the levels to unlock them. At $5, it would be a pretty good value; at $10, it might be something to do with your friends. At $20, though, I have to say that you can get more bang for your buck elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is amazing for having friends come over and playing it, but I think it is best used with x box controllers. I think this is a game that anyone wanting to have a party needs to get",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "Abyssmal controller support for a game that looks like it was made for console (but was released only for PC).",
            "review_score": "-1"
        },
        {
            "review_text": "Controls kinda suck - especially if you try to play a mage. The game doesn't feel anything like the nostalgic original. Other than the Elf, the other champions are very subpar in their mechanics and abilities. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Gauntlet is at best 'OK', but I wouldn't recommend it for those who want to do 'big picture mode' with local couch co-op. A few issues:  *The characters are too small on screen. I play on 50 inch TV from about 8 feet away, and the characfers are far too small to have a good idea of what's going on from even that reasonable distance for local co-op.     * The game will spotaneously disconnect from my Xbox360 controllers when playing with 3 or 4 people.    * The Warrior and Valyrie are pretty boring to play, compared to the Wizard and Elf, and you can't have multiple characters of the same class within a session.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game.. but if you get a message, it doesn't pause the game and your control stops working. WTF devs.. Room full of baddies, two spawners and I can't move?!?!",
            "review_score": "1"
        },
        {
            "review_text": "Maniacally diabolical, sadistic perfection....",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to play will enjoy for hours and even better with friends",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid game. Co-op works great right away, no need to setup/host a server or anything. Graphics are nice, but nothing to brag about. The character balance is pretty bad, but it's still enjoyable nonetheless.  The game is a bit short though, but it's completely fair for the price. My only real complaints are that you can't have multiple saves, so if you go back to play through the game again, you're going to have all of your gold, relics, and upgrades. And higher difficulties are not really balanced well around having only two people (spawns way too many enemies in some levels, and you really need the extra players running around to distract them).",
            "review_score": "1"
        },
        {
            "review_text": "Fun fun! Just like the good old days.",
            "review_score": "1"
        },
        {
            "review_text": "Brillant fun !! With friends it brings back that same old feeling of standing about that Atari arcade machine.   It certainly has that retro feel, but also that very much needed modernisation from the original. Multiplayer is a must with friends, It has loads of unlocks, a few skill upgrades to chase to keep you busy. Killing monster spawners and finding keys!  Its Gauntlet Revamped  BUT IT   ",
            "review_score": "1"
        },
        {
            "review_text": "needs more content ",
            "review_score": "1"
        },
        {
            "review_text": "Collecting loot, leveling up, and setting up character builds are two things you won't be doing in Gauntlet, it is a bare bones dungeon crawler. The game allows you to play one of five different classes. The classes are all very different from one another, but within each class there is very little room for customization and different playstyles.   Instead of setting a button layout for the game and fitting each character's abilties into that layout the game opts to give each character a unique feel in addition to skillset. The warrior for example is your standard light hit mapped to one button, hard hit mapped to another, and special skill, and each of those can be stringed into combos. The elf uses a bow and arrow and plays like most top down shooters where you use the right thumbstick to shoot arrows in the direction you aim the stick. Among all the classes the most fun I found to play was the wizard. The wizard has access to 9 spells and they're all done with a different combination of three buttons, it actually ends up being a pretty elegant system for spells as opposed to a spell bar, but it does take a little getting used to.  The character customization seems like an afterthought. Each character can have two relics that they can equip. The relics aren't found, they can only be bought with gold collected throughout the levels. They'll allow you to do things like move faster, freeze enemies around you, put a trail of fire where you walk, and heal the party. There are not very many relics available, only about 9 or so, and they don't really change the game much. To use relics you need to obtain magic bottles so in addition to there not being very many you also won't be using them very often.   There is hardly a story to the game, there's a big bad guy and you have to go kill him, that's about it. In some games this may be a negative, but I don't think most people would really expect a Gauntlet game to be about the story. I'm only stating this as information for those that might expect it to be a primary focus, it's not, and I don't count it against the game.  The game has jump in and jump out of game co-op where everyone has to play one of the five classes, there is no doubling up on classes. It is fun to group up and work through a dungeon together, and on the hardest difficulty it can be hard so everyone has to be on their game to get through. One of the primary aspects of the original Gauntlet games that were important to the experience was competition with your teammates. Who can get through the level with the most gold? Kill the most enemies? This version of Gauntlet doesn't seem to have that aspect for some reason. I think a few factors contribute to this: 1) not much gold to go around, 2) some classes are obviously more powerful than others and will always lead in kills. By making the classes so different they sort of ruined the competitive aspect because of balance problems. What ends up happening is the game is turned into a normal dungeon crawler where the objective is just to survive and beat the level. I think it might have been more fun to include some other competitive aspect in some way with certain types of drops or something.  Gauntlet is a fun game if what you expect out of it is realistic. You aren't going to be getting a high end dungeon crawler loot fest. It is a simplistic, watered down dungeon crawler that should be played with multiple people. I think the $20 asking price is a bit too much for what you get, but this is a great buy for at least 50% off on a sale.     ",
            "review_score": "1"
        },
        {
            "review_text": "Lots of pickup game fun. You can bring along your friends too, whether they're good or bad, doesn't matter too much.",
            "review_score": "1"
        },
        {
            "review_text": "Meh... not horrible, just.. meh.  it is okay, and maybe worth it on sale.  I love previous versions of Gauntlet WAY better.  =^.,.^=",
            "review_score": "-1"
        },
        {
            "review_text": "A great update of a classic. I've been playing this with an old friend and having a blast with it.   It has the old arcade game feel with a few new mechanics.  My only complaints are: 1) no re-mappable controls. 2) needs more content! Another dozen dungeons or so would be awesome!  ",
            "review_score": "1"
        },
        {
            "review_text": "I generally only enjoy the game when I play as the wizard. The other characters seem too limited by their small number of abilities. The achievement bonuses are mostly insignificant in proportion to the effort it takes to get them. If they were repeatable achievements that indefinitely built upon the previous ones, I'd understand. Killing 10,000 enemies should give more than just a few percents of extra damage. The equipment in the shop doesn't offer any gameplay bonuses, and their appearance doesn't really matter when you play. Still...I recommend the game if you can get it for $15 or less.",
            "review_score": "1"
        },
        {
            "review_text": "After they fixed the camera finally the game is playable again. Quite some fun.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who liked the Gauntlet games of ages past, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I bought the game after the 2.2 update and am having a blast. Each of the classes plays very differently from eachother and which allows for varying styles of play.   Fan of Gauntlet Dark Legacy, and while this game's dungon seems smaller and more linear than its predecessor, the imporvements in combat make this game easily worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "Only played 2.8 hours so far, but it's great for a bit of non-commital casual hack and slash fun. Note, currently on the WB title sale it comes to ~$5AUD, not a bad pickup. Has a few different classes for variety, co-op and the arena look like they might be a bit of fun too. I've been playing with the xbox controller and found it satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game, make your friends buy this game. MAKE EVERYONE IN YOUR INTIRE FAMILY BUY THIS GAME! Its amazing its almost exactly like the games that I use to play with my dad. Yes I do miss the hub world where you can buy items like Thors Hammer, and the other cool items that you can get with gold.  I'm really enjoying this game. Hard as hell with just one person, but a lot of fun with friends.",
            "review_score": "1"
        },
        {
            "review_text": "When the game first came out, it was fun. easy and normal u had unlimited lives after a cooldown. could run around, groups of 8-10 that u can kill with a group. now, u have ur character and can switch skills but no 'lobby' zone where u can practice so u have to learn on the fly. also on a 4 person easy, mobs of 20-30 spawn and wreck your day. For a casual player playing with other casual players, this game is too difficult, even on easy. Before i would recommend this game before the slayer edition, but now no..",
            "review_score": "-1"
        },
        {
            "review_text": "If you took some of the worst aspects of a Diablo game (rogue-like levels which are composed of all-too-few room types), coupled it with level mechanics which constantly lock you into tiny rooms with overwhelming numbers of monsters, took away the player's ability to manuever or use any real level of tactics, added a rather useless RPG store mechanism which encourages you to die until you and buy enough to stop dying as often, totally ignored any concept of class balance or fair play, constantly spawned invulnerable enemies or one-hit-kill traps against the player, and then slapped a Gauntlet skin and audio track on the mess... That's this game.  It's not a challenge... It's just keep dying until you can buy enough so you don't.  And you won't really know enough about this game to decide whether you like it until you've played too much to get a refund. It takes hours to figure out that the class balance is completely out of whack. It takes hours to get upgrades. It takes hours to figure out that all you really have to do is keep dying...   The Gauntlet of old was, at its best, a game of tactics and planning. You were playing alone or with friends against hordes of enemies, setting up choke points, solving puzzles, sweeping a floor in a careful, methodical method, and pressing on. It was a game about tactics, planning, and puzzle solving as much as action. This isn't that game. This game... Just run for the gold, hope you can blast enough enemies to keep some of it. Repeat. Buy upgrades. Repeat.   So, if you like mindless action and lots of dying, go for it. But I can't even really call it Gauntlet. It lacks Gauntlet's spirit.",
            "review_score": "-1"
        },
        {
            "review_text": "A fantastic modernization of the classic dungeon crawler which birthed a genre. It's simple to pick up but a challenge to complete. Even more fun with three others, who can easily drop in and out at any time, as you race for more gold and claw to get more kills. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a small group of friends.  I dont really like how only one person can play each character. I found myself leaving and join a lot of games just to get the person I wanted to play. Although every character is fun, I like the Archer more than the others. This game can get a bit repetitive, but it's a fun game.   If you have a small group og 3-4 friends, I highly recommend this game. It's a simple, fun, and enjoyable experience.  Buy it.   ps: archer=best",
            "review_score": "1"
        },
        {
            "review_text": "It's alright. It isn't as fun as the old Dark Legacy games, and really could have gone farthur into a bunch of different areas. But, it's still fun to play with friends. It's still a decent game and worth a playthrough with your buds. I just don't think you'll sit around hour after hour collecting coins and leveling up all the way and building your stats to the max.  And that's because there are no levels and you don't build up your stats at all.  You do collect gold and get a couple upgrades, but everything is expensive and there isn't very much of it. You basically pick one potion power, and one super power, and you invest in each of them. But that's it.  The other biggest drawback to me is that when you and your pals play, each of you have to be a different class. You can't have 2 mages in the same game. You can't have 2 warriors. That means if you are your friend both spent all your time investing in your Valkrie, you can't play them together and one of you has to start over.  But eh.... it's still fun for an afternoon. Pick it up on a good 'Buy 4' sale and spend an afternoon avoiding your girlfriends together.",
            "review_score": "1"
        },
        {
            "review_text": "I should have known better than to buy this. I've always thought the Gauntlet franchise was cheesey so why would this one be any different. I'm glad they deversified the characters, but you can seriously beat the game in an afternoon. Not worth the money unless it's on sale. I' m giving it a 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "With thanksgiving finished, it's nice to know that there is a turkey in almost everyroom to pour gravey and fireballs on. But eating turkey is no fun without friends and family... I lost track of my review. 9/10 - single player could be better",
            "review_score": "1"
        },
        {
            "review_text": "I never expected Gauntlet to turn into something so uninspired and flavorless.",
            "review_score": "-1"
        },
        {
            "review_text": "For years, I have played Gauntlet on the PS1 with friends and family in couch co-op, and this remake has not left me disapointed. The combination of skills and boosters allows for extended gameplay and continued enjoyment of hours of slaying. Though yes, you can play the game alone, but on the other hand online multiplayer combined with local couch co-op means playing with a full game of 4 is not difficult. Though I have only currently spent about 6 hours in game, since this title is more of an 'arcade' style game; my near 6 hours is actually a decent amount of time spent, especially considering that I'm about half way through the levels with my friend. This is not the kind of game your going to encounter a ton of bugs or problems with (or any at all); its a 'start it up, play and enjoy' kind of game, which reminds me of the way most games once were.  I was lucky to get this game during the Autumn sale for $15 in a pack of 4; so paying $5 a copy was a steal, let alone getting one copy essentially free was just an extended bonus. Though I recommend getting this game on sale when ever possible, I don't really think $20 is completely terrible for this game, as it is one I know I will come back too with friends and family in the future. - We played it on the couch after Thanksgiving, and we may even play a little on Christmas together. This game spells classic fun for me.  10/10 would play again and again...",
            "review_score": "1"
        },
        {
            "review_text": "brings back memories but not the gameplay , so its really good and nicely revised can have some connectivity issues at times",
            "review_score": "1"
        },
        {
            "review_text": "Last update was not good for this game. Removed perks for achievements.  Developers said they're finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Simply the hardest Gauntlet game I've ever played. It's hardcore and you need friends to survive. Still a blast to play, and I'd recommend if you liked the old style Gauntlet games.",
            "review_score": "1"
        },
        {
            "review_text": "The final boss is extremely cheaply difficult. Really frustrating. Rest of the game is okay tho.",
            "review_score": "-1"
        },
        {
            "review_text": "I had fun, but there is no character progression or loot, few weps and skills, close to no lore or puzzles, It's very short and the dev team quit the project. Since i can only recommend this game to hard core fans of this genre i will have to opt out for the general gamer. Get this on a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the best local co-op RPGs I know of. The only other games that I've played that are in a comparable genre are Gauntlet Legends, Gauntlet Dark Legacy, and Bauldur's Gate: Dark Alliance, so if you like those, you'll love this one. The graphics are better than the other Gauntlet games, and more people can play than in Bauldur's Gate: Dark Alliance. And the fact that there is an randomly-generated endless mode that just keeps getting harder makes it even better.",
            "review_score": "1"
        },
        {
            "review_text": "Let me clarify the thumbs down. This game gets thumbs down because it is not Gauntlet, I will elaborate. The game is a decent hack n slash party game with a fun challenge, but calling it Gauntlet is a lie and is deceiving to fans.   I was excited as ♥♥♥♥ to see this game's trailer, they made it look so pretty and fast paced and fun, bringing back that Nintendo64 gauntlet adventure feeling. Turning that old game on was always like being transported to another gigantic epic adventure with all the unique levels, bosses, tons of items along the way for weapon mutations or familiars that join you. Not to mention items that unlock secret levels or characters, lots of interesting and fun cutscenes, and a wide variety of puzzles to interact with unique to each world.   THIS GAME trades all of that for pretty colours and getting to change your helmet, weapon, a cape, and alternating what potions do, and some spells. This basically negates all of the fun of what Gauntlet was. Your primary focus has now become taking all the gold, which just makes people mad, because without gold, you cannot buy weapons. You are also correct in realizing that no weapons/item purchases mean no variance in your gameplay. All ability and weapon and spell augmentations are tied to weapons or tomes you purchase in the store. Note that not even all of the store items even do anything, most are purely cosmetic.   I mean so yeah, having a unique inventory to your character is cool, and buying your own special ♥♥♥♥ is nice, but…at the cost of what? Well you judge that.   Other things that take away from the game are the fact that you cannot kill death anymore, at least it's more obscure than it was in the original games. Why does using a potion not kill death? Was this some dumb unlockable ability for one hero that he has to buy in the store to be able to do? Before, any character could use a potion to dispel death. Now they have turned levels in which he exclusively appears (no more opening a chest for treasure, no death popping out of a chest!) he is turned into basically an outrun the lava level. It's not timed, but he really enforces you to proceed quite quickly due to following you quickly and being huge.   There are no more worlds, it's a straight shot down, barely any change up of enemy diversity, I felt like I was fighting the same monster the entire game, and there were very few bosses, nothing was themed or engaging. Grind grind, get gold, buy shitx666   Whoo. So, maybe I didn't play this enough? Is there more to this game? Does it open up into everything I am criticizing it for missing? Maybe so, and if so then that's too bad. I invested around 8 good hours with 3-4 fluctuating people involved and it was of the consistent content I have previously described. So if there is more, then frankly that's a damn shame that it would take so long to getting back to a game so timelessly classic as Gauntlet. I understand Gauntlet changed through generations and Midway no longer exists, so clearly the same heart was not in the production of this game. I'm not interested in investing that much time in a game that is nothing what I was told it was. They used key factors reminiscent of the old game to draw you in and cheated people out of how many dollars is this game? 15? 25? 30? I don't know right now, but whatever the price, it's not worth more than 5$ if you call it Gauntlet. Yeah sure you put the music from the old games in, there was a wizard, you shot the food, and you said 'Red wizard needs food badly', but come on, that doesn't make a game.   Like I said, it was a decent party game, and it was enjoyable. I just spent the entire time trying to be entertained like I was with Dark Legacy or Legends, but it never happened. It's like they didn't even try.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Not the beat em up, ♥♥♥ kicking, cluster frack gauntlet i remember, too cartoony, but still good.",
            "review_score": "1"
        },
        {
            "review_text": "i really love this game ^_^",
            "review_score": "1"
        },
        {
            "review_text": "I never played the original Gauntlet, but from what I've seen this is a wonderful reboot. It stays true to the 4 heros and tells a short story with a lot of great dungeon crawling.   However, if you're like me and your first taste of the series was Gauntlet: Dark Legacy; be prepared for disappointment. There is no shop, no items to use, no chests to unlock, and no ultimate moves. This model is true to the original, but in my opinion isn't as fun.  All in all I really liked this game, though I doubt I will replay it anytime soon. The lackluster storyline and repetitive levels just don't invoke the same awe that Dark legacy did for me. It was fun the first time, and that first time seemed really short, but I had fun nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "  Wonderful to play online/offline, alone or in a group.  Superb progression for each character. This game was gifted to me and I am ever grateful to that user.",
            "review_score": "1"
        },
        {
            "review_text": "  theem grephicz",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, simple, quick to pick up and enjoy changing the characters gear around (when comparing to the 80's when that never happened.  Good to play when you mains are down and your killing time with mates. ",
            "review_score": "1"
        },
        {
            "review_text": "Alright.. so we start off terribly by the game having insanely loud crackling audio problems, then I restart it only to get hit by a slow clunky menu when the audio fixes itself, then I discover the game is unplayably laggy when I hop in to a game. Checked out my PC, nothing is wrong with it, not having any problems otherwise (a PC which runs higher taxing games effortlessly, btw), only to find out that it is in fact something wrong with the game itself.  I've never done a 6 minute refund before, but it's happening. I really, really wanted to try out this game because I'm a HUGE fan of the old Gauntlet games (Dark Legacy, mm), but this right here is unplayable. I don't understand how others are having no difficulty, but I got hit with every problem you could think of before I even got in to a game. Hopefully they fix this ridiculously buggy crap..",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, simple, arcadey multiplayer. A great game to play with friends!",
            "review_score": "1"
        },
        {
            "review_text": "They updated this game recently and made it an amazing homage to the arcade classic. You used to be able to grind the game to get permanent stat boosts, completely locking out higher difficulties, but now it's a much more balanced affair.  That's why almost everyones whining btw, because it doesn't have pathetic RPG elements... yeah, because a remake of a classic arcade game doesn't allow you to grind for extra stats.",
            "review_score": "1"
        },
        {
            "review_text": "It's not terrible on its own, but knowing how good the previous games were in a sense of progression... This Gauntlet feels like it's severely dumbed down... Maybe because it needs to work on a controller for the console versions? I wouldn't know.   As its own game, it's great. I can play it for ages. I like it.  As a part of the Gauntlet games? Maybe not so much.  So treat it like it's its own game, despite the context of the prior games existing. You'll have less of a sour taste in your mouth.",
            "review_score": "1"
        },
        {
            "review_text": "eh moik, u can play invoker in this :v",
            "review_score": "1"
        },
        {
            "review_text": "This wasn't the same as when I bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "it's like the classic game but more modern.",
            "review_score": "1"
        },
        {
            "review_text": "I feel this game has gotten a bad rap.  Was it as good as the Nintendo 64 gauntlet legends....No. Does it stay true to the gauntlet franchise overall...Absolutely. at the time of my writing of this review the games is 75% off ( a grand total of $4.99) at a price like that, it is absolutely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Fair warning, It's not Gauntlet Legends.  That being said, this game is one of the best options for couch co-op made in the last few years.",
            "review_score": "1"
        },
        {
            "review_text": "Gauntlet is a fun and witty dungeon crawler that made me laugh on more than one occasion. I love it when a game knows not to take itself too seriously. The more friends you bring, the more fun the game is.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying this game so far, definately better with a controller.",
            "review_score": "1"
        }
    ]
}