{
    "app_id": 259080,
    "name": "Just Cause 2: Multiplayer Mod",
    "release_date": "2013-12-16",
    "developer": [
        "Avalanche Studios"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Open World",
        "Multiplayer",
        "Action"
    ],
    "achievements": 20,
    "positive_ratings": 12261,
    "negative_ratings": 1099,
    "price": 0.0,
    "description": "JC2-MP is a project to bring multiplayer to Just Cause 2 in all of its magnificent glory. Imagine the chaos of normal Just Cause 2, then extending it out to dozens, hundreds, and even thousands of players.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/259080/header.jpg?t=1478821646",
    "minimum_requirements": "OS: Microsoft Windows Vista (Windows XP is unsupported) Processor: Dual-core CPU with SSE3 (Athlon 64 X2 4200 / Pentium D 3GHz) Memory: 2GB System Memory Hard Drive: 10GB of free drive space Graphics: DX10 compatible graphics card with 256 MB of memory (Nvidia GeForce 8800 series/ ATI Radeon HD 2600 Pro) Sound: 100% DirectX 10 compatible sound card DirectX®: Microsoft DirectX 10",
    "recommended_requirements": "OS: Microsoft Windows Vista SP1 or Windows 7 Processor: Intel Core® 2 Duo 2.6 GHz or AMD Phenom X3 2.4GHz or equivalen Memory: 3GB system Memory Hard Drive:  Graphics: DX10 compatible graphics card with 512 MB of memory (Nvidia GeForce GTS 250 series/ ATI Radeon HD 5750 series)  Sound: 100% DirectX 10 compatible Dolby Digital 5.1 sound card DirectX®: Microsoft DirectX 10.1",
    "reviews": [
        {
            "review_text": "It's like GTA V Online but way cooler and cheaper. 11/10  Edit: And it loads faster than GTA V Online.",
            "review_score": "1"
        },
        {
            "review_text": "Literally the best game for your money right now, the core game itself isn't too much to buy and its amazing alone But the multiplayer quite literally hosts one of the best communities in gaming There isn't any competition between servers, hell they even help eachother when servers go down 10/10, its a must buy for anyone ",
            "review_score": "1"
        },
        {
            "review_text": "A bunch of moders turned singleplayer game into multiplayer. Modding doesn't get much better than this.",
            "review_score": "1"
        },
        {
            "review_text": "I flew a truck so high that the game crashed recommended",
            "review_score": "1"
        },
        {
            "review_text": "Well, i really didnt try out alot of things, but for beeing a beta mod project this thing is pretty impressive, and allready ♥♥♥♥♥♥♥♥ly fun.   Give it a try if you can, you might like it, especially if you liked Just Cause 2 or similar open world games.",
            "review_score": "1"
        },
        {
            "review_text": "Where to even begin... As you can see, I have invested a large amount of time into this mod. Why? Simply because each and everytime I log on to a server, it's a unique experience. Be it total mayhem, or a unique roleplay experience that you're looking for, you'll find it with Just Cause 2: Multiplayer Mod. I cannot recommend this enough, give it a go, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "If you can't run GTA 5 get this game and play multiplayer its much better. It's an Awesome mod to mess around.",
            "review_score": "1"
        },
        {
            "review_text": "Started a taxi service with boats Someone got in my boat and said 'Take me to the moon' I flew a boat to the moon 11/10",
            "review_score": "1"
        },
        {
            "review_text": "The invention of the internet had just one purpose. And that purpose is this mod.  Massive Multiplayer Madness, bring Friends",
            "review_score": "1"
        },
        {
            "review_text": "Do whatever you want  Why ? Just Cause",
            "review_score": "1"
        },
        {
            "review_text": "So I went and joined 3 servers.  Server 1) Absolute chaos, zero orderly things, and all the children had horrible ping.  Server 2) Well-put-together server with some nice organized activities and friendly people.  Server 3) COPS AND FREAKING ROBBERS.  You just gotta find the right server. ;)",
            "review_score": "1"
        },
        {
            "review_text": " The Best Mod For Just Cause 2!",
            "review_score": "1"
        },
        {
            "review_text": "Lots and lots of fun",
            "review_score": "1"
        },
        {
            "review_text": "I cant wait 'till this mod comes out, I've partecipated at four public tests, and for each one of them I haven't been deluded. A Good developing team and a awesome game, I expect great things from this mod!",
            "review_score": "1"
        },
        {
            "review_text": "My friend typed 'America is probably the best country in the world' into the chat and the server erupted in anger",
            "review_score": "1"
        },
        {
            "review_text": "Best game to jerk around that has explosives, guns, cars, and planes. Way better than GTA. Hours of entertainment. It's bringing in revenue for the original game, campaign is bland but I'm reviewing the multiplayer. Just get it, we'll poop around on it and have fun. Debatibley best multiplayer game around other than Gmod.",
            "review_score": "1"
        },
        {
            "review_text": "Like the name implies, this is a mod for the game Just Cause 2 and not a game by itself. You will have to purchase the full game in order to use this mod. What other gamers have done with this mod is take the Just Cause 2 gaming experience to a whole new level of multiplayer fun.   Pros",
            "review_score": "1"
        },
        {
            "review_text": "Most realistic flying simular so far. I was able to fly a fully loaded passenget jet backwards at three times the intended airspeed.  6.9/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Chaos , Chaos and a bit more chaos , If you have a love for explosions and shooting all your friends with an attack helicopter this game is for you .  quite With some servers boosting of over quite literally thousands of players ,there is not a game (I) know that has this experence quite like this one .  One of the highlights for me about this game is the pure insanity of juming from a helicopter to a plane then a free falling boat then pressing SHIFT and happily fly away , I would recommend this game to any one .",
            "review_score": "1"
        },
        {
            "review_text": "Countless Hours of flying Tuk-Tuks",
            "review_score": "1"
        },
        {
            "review_text": "I've been a fan of the main game Just Cause 2 and knew about the multiplayer mod for a while however only recently have I played it.  Only very few hours in, I'm enjoying every minute of it. Great way to kill some time, especially if you have a bunch of friends on the same server. I thought there might be issues with latency but for the servers I have connected to so far (Australian servers), it has been great.  Not all servers are the same, some are barebones with very few plugins etc on them for the game (derby, nametags, teleporting and a few others). Others can have race modes, stores (to buy weapons/vehicles/skins etc, some times these cost in-game money, sometimes they are completely free) and other funny things like boost modes for cars etc.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game is like flying a boat into the sun. You can fly a boat into the sun.",
            "review_score": "1"
        },
        {
            "review_text": "Just cause this game thinks its the ♥♥♥♥ doesn't mean that it should go lickity split.   Please please click off now no no go fly",
            "review_score": "1"
        },
        {
            "review_text": "Crazy, crazy open world JC2 game...It's a great MOD multi-player. Keep up the good work fellas.",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this from almost the 1st public beta and it just gets better and better, Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best mods ever!!!",
            "review_score": "1"
        },
        {
            "review_text": "Though I do find it fun to fly in boats it would be better if this game had NPCs, to possibly add teamwork for epic cop chases  9/10",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best multiplayer games i have played...  Pro's  Same awesome graphics  Best car chases i have had out of any game's i have played  Better then GTA IV  Con's  You can never team up with someone because everyone is KOS in this game  Most everyone camps the airport with a helicopter or a modded rocket launcher  the only way to get a vehichle is press b so you can't exactly have awesome RolePlay's   ----------------------------------------------- If you haven't already bought this buy it now -----------------------------------------------  8|5/10",
            "review_score": "1"
        },
        {
            "review_text": "Verrrrrry fun mod. Lots of good people and servers, and lots of fun shenanigans. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the greatest/worst multiplayer game of all times. It's buggy as hell and the community is basically worse than ♥♥♥♥♥, but if you can look past it all you basically get a 10,000 man free for all. If you're looking to ♥♥♥♥ around with PVP action, then play this. If not, stay away because you'll hate it.",
            "review_score": "1"
        },
        {
            "review_text": "How does this not crash every 10min",
            "review_score": "1"
        },
        {
            "review_text": "-Entered Game -Went to Ocean -Spawned Sailboat -Boosted in Sailboat -Entered Orbit -Fun Times  10/10 Best Game",
            "review_score": "1"
        },
        {
            "review_text": "definitely worth the free download, best mod for a game thats years old and make it worth replaying all over. Don't own Just Cause 2 well i think you should buy it for this 1000+ players and the severs don't ever feel full. Only down side you get killed atlot by other players while messing about with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This mod is one huge cluster♥♥♥♥ of a game with maps supporting upto 9000 people NINE THOUSAND ♥♥♥♥ING PEOPLE Expect ping higher than a jamacan on 420. Also if you wanna get an airplane GOOD ♥♥♥♥ING LUCK. if you are able to escape the carnage that is the international airport you deserve a medal. If you have a rosy picture of how you can grapple around with your friends in peace and quiet with no lag COME BACK TO REALITY.   0/10 they REEEEAAALLY need to fix this mod, or get the actual game devs on it. Until then avoid this ♥♥♥♥♥♥♥t ",
            "review_score": "1"
        },
        {
            "review_text": "Not too sure where to start, but then again writing reviews about something that you personally found amazing is hard to be balanced on. For a mod, the player sync is almost perfect, sometimes your internet may mess it up, but they can help that. I will certainly be hosting a server with their availablility to host other servers. Only thing I have against it, is the fact that EVERYONE IS LITTERALLY HOSTILE... But even then, driving in Convoys with friends or Faction members, fighting and totally immersing into this amazing world is all you'll need. The Moderators are very helpful and funny.  This mod is near perfect ^.^",
            "review_score": "1"
        },
        {
            "review_text": "This mod is one huge cluster♥♥♥♥ of a game with maps supporting upto 9000 people NINE THOUSAND ♥♥♥♥ING PEOPLE Expect ping higher than a jamacan on 420. Also if you wanna get an airplane GOOD ♥♥♥♥ING LUCK. if you are able to escape the carnage that is the international airport you deserve a medal. If you have a rosy picture of how you can grapple around with your friends in peace and quiet with no lag COME BACK TO REALITY.   0/10 they REEEEAAALLY need to fix this mod, or get the actual game devs on it. Until then avoid this ♥♥♥♥♥♥♥t ",
            "review_score": "1"
        },
        {
            "review_text": "Two words: Flying tanks.",
            "review_score": "1"
        },
        {
            "review_text": "Epic Mod!  10/10 For Everything!",
            "review_score": "1"
        },
        {
            "review_text": "Two words: Flying tanks.",
            "review_score": "1"
        },
        {
            "review_text": "Much mod. Such crazy. Very gaem. Many physics.",
            "review_score": "1"
        },
        {
            "review_text": "it's ♥♥♥♥ing beautiful!!!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, i love playing JC2 Multiplayer. So cool and pretty Awesome!!",
            "review_score": "1"
        },
        {
            "review_text": "If you have Just Cause 2, play this. I think it says something that I have never even played singleplayer of this game :3",
            "review_score": "1"
        },
        {
            "review_text": "Best Multiplayer experience I ever had. I've met thousands of individual persons, some special people and some people you just played with sometime :D Its the best Multiplayer Expirience you'll ever get. We are a Community. We are gamers. We're united and this game shows best what a community can do.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Multiplayer mod, reminds me alot of SA:MP and is worth your time ! :D",
            "review_score": "1"
        },
        {
            "review_text": "Only bad thing is it crashes somtimes. depending on what server your on, and no npc.  Other than that i've had tons of fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is the most sexiest game I have ever played online! I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Awsome",
            "review_score": "1"
        },
        {
            "review_text": "the best mod of the year so far.",
            "review_score": "1"
        },
        {
            "review_text": "world too big",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun, easy to run. It's great with a few friends! Definetly get JC2 when it's on sale and then download the MP mod :) Please donate to the devs, they are awesome for making this game!",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the singleplayer game, at least try it out. It's free. It's awesome. Do it.",
            "review_score": "1"
        },
        {
            "review_text": "If you have Just Cause 2, there is no reason not to have this mod. While it does not at first seem to add much other than people who want to kill you, you can quickly become a part of incredible activities, such as the massive Demolition Derbies or the faction based air assaults. You can do almost anything in this add on. If you don't have Just Cause 2, I would buy it just for this.",
            "review_score": "1"
        },
        {
            "review_text": "If you need one reason to buy Just Cause 2, this is it. From all out gun battles in the middle of the forest to dog fights high above the clouds to races out on the water, the JC2 mod is one of the best third person games I've played in a while. The one major downside to this game is that there is no passive mode and a ton of asshats. Tons of them. No seriously, let me just play the ♥♥♥♥ing game without getting shot or blown up every five seconds. Please? ;_; 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the climax of #PCMASTERRACE",
            "review_score": "1"
        },
        {
            "review_text": "Sure lets fly a commercial airliner into a bike and jump out shoot the guy in the face and then spawn in a tank. Why not.",
            "review_score": "1"
        },
        {
            "review_text": "although it still has some major bugs and lag, it is still in beta, but it's so much fun, so ridiculous, with hundreds, if not thousands of players to play with, so much things to do , and so much chaos and stuff to blow up",
            "review_score": "1"
        },
        {
            "review_text": "What if i told you that you could be a midget mafia boss parachuting off a cliff and then turn into the most OP jet and then blow the ♥♥♥♥ out of everybody, is it wrong if this game gave me an erection? 10/10 MUST PLAY",
            "review_score": "1"
        },
        {
            "review_text": "best mod ever but does need fixing",
            "review_score": "1"
        },
        {
            "review_text": "Chaos Chaos..Chaos Eveeerryywheeree",
            "review_score": "1"
        },
        {
            "review_text": "Do you like cars? Do you like helicopters or planes? Do you like explosions? Then this game is the game for you! Experience high explosive action and great vehicle physics in the beautiful multiplayer mod of Just Cause 2!  This is this game in a nutshell.         YouTube™ Video:  Just Cause 2 Multiplayer in a nutshell&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "All the mass anarchy of Just Cause 2 Singleplayer, now with a bunch of untamed people running around either shooting at you or racing you.",
            "review_score": "1"
        },
        {
            "review_text": "really fun",
            "review_score": "1"
        },
        {
            "review_text": "I'm a ninja in a fedora and sunglasses, who flies a boosted pearlescent tug boat into airports and then blows it up.  11/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is amazing",
            "review_score": "1"
        },
        {
            "review_text": "What if i told you that you could be a midget mafia boss parachuting off a cliff and then turn into the most OP jet and then blow the ♥♥♥♥ out of everybody, is it wrong if this game gave me an erection? 10/10 MUST PLAY",
            "review_score": "1"
        },
        {
            "review_text": "achei muito show as dlcs",
            "review_score": "1"
        },
        {
            "review_text": "(Read my Just Cause 2 Review) If you like getting shot by hundreds of snipers, if you like teleporting, if you like causing havoc at the airport, if you like flying a boat, if you like running people over with a boat on land, if you like dual wielding grenade launchers, if you like riding on a jet by standing on it, install this mod. You won't recover from the laughter this mod will bring.",
            "review_score": "1"
        },
        {
            "review_text": "Great! You can fly boats with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "Much Crash.  Step 1: Get on Step 2: Crash Step 3: Trouble shoot (for me it was Raptr Step 4: Fly a Boat Step 5: Crash Step 6: Cry  Would Crash again 10/10  Overall, While it works, it is kinda fun to mess around with. A bit like goat sim, you have fun, but 2 hours later you just feel bad about yourself.   (SECRET STEP) Load the game again. (SECRET STEP) Crash again.",
            "review_score": "1"
        },
        {
            "review_text": "Great mod, its what many have waited for.   BUT!! it crashes a lot, thats a big bummer",
            "review_score": "1"
        },
        {
            "review_text": "I Press Shift in car and crashed",
            "review_score": "1"
        },
        {
            "review_text": "Great! You can fly boats with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "This Mod Is AWSOME",
            "review_score": "1"
        },
        {
            "review_text": "very fun multiplayer you can only get on pc. you have huge ranges of servers from survival to nerdcubes huge open teleport map. some servers let you spawn in anything you want. A great addition to anyones library and its compeletely free (if you have just cause 2) very enjoyable 8.9/10",
            "review_score": "1"
        },
        {
            "review_text": "It was surprisingly fun to play Just Cause 2 with a bunch of other people. Especially in sessions with hundreds of people fighting each other in the airports, camping the helicopters and jets. But, I'm not complaining. I love just using the speed boost on vehicles so I can go 750 km/h across the map.",
            "review_score": "1"
        },
        {
            "review_text": "FREE ! FUN ! what do you expect more !! GO GET IT ! ;)",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 2 is a Fun games just by itself but with this Mod added to it it just makes it 100 times better  Just Cause 2: Multiplayer is a very fun mod its just Awesome!! When i first played Just Cause 2: Multiplayer it was just epic it was a lot of fun Just Cause 2: Multiplayer is mostly fun playing with friends it can be Glitchy but who cares just aslong as you're having fun thats all that Counts  i Recommend Just Cause 2 and Just Cause 2: Multiplayer Mod For Everyone :D",
            "review_score": "1"
        },
        {
            "review_text": "Lol Tyler can't run it",
            "review_score": "1"
        },
        {
            "review_text": "otis ",
            "review_score": "1"
        },
        {
            "review_text": "All around amazing guns and people every were",
            "review_score": "1"
        },
        {
            "review_text": "When you make your character to have a scarf glithed into his face, while your going 400KPH up a mountain in a bright pink bus, and you didn't have to grind for hours. ( haha GTA) You have an epiphany that you can do whatever you can put your mind to do anything you want to do. ( Usually illeagal in real life). This game is the defintion of a pure hilarious sandbox mixed with the community mods that remove all tedious asppects out of the game to create in my opinion a paradise for the true sandbox gamer to enjoy. When a triple A game cuddles in a speial way with a modding community something rare and very special is made. The glithy, hilarious fun and perfectly stupid Just Cause 2 Multiplayer Mod.",
            "review_score": "1"
        },
        {
            "review_text": "Its so awesome I dont even need to explain. If you havent played it before, JUST PLAY IT NOW YOU FOOLS, YOUR MISSING OUT ON SO MUCH.   One downside though is the lack of NPCs (They say its because its impossible to sync them). Oh well, still you must play it.",
            "review_score": "1"
        },
        {
            "review_text": "The Future.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever played Just Cause 2 and thought:  'What this really needs is a bunch of servers that can each hold up to 4,999 more Rico?'   This is what you need",
            "review_score": "1"
        },
        {
            "review_text": "Just so, so, so ♥♥♥♥ing fun",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS THE BEST IN EXISTANCE!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "When all the Russians are on vacation from CS: GO, they gather here, to release they're bottled-up rage against the over-saturated demographic of 12 year old 'meme loving ♥♥♥♥s'.  10/10 the best GTA Online mode.",
            "review_score": "1"
        },
        {
            "review_text": "Shoddy community, gets boring after a while. Can be a fun experience sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "Epic! The Beta testing was better but the offical one is ok. You can create your own servers with boost, derbys and races.",
            "review_score": "1"
        },
        {
            "review_text": "love this, not manny minutes in this game when i dont laugth my as of when playing",
            "review_score": "1"
        },
        {
            "review_text": "5/5 I just crashed to a jetfighter with a bus, then the game itself crashed as we flew out of the map with that bus with the speed of 720km/h My life is complete.",
            "review_score": "1"
        },
        {
            "review_text": "awesome mod i think its just like gta but you can do more things (aka gta 4)",
            "review_score": "1"
        },
        {
            "review_text": "Very fun! Awesome and amusing at the same time! I'm glad they made this Multiplayer because I now get to mess around with friends. 10/10 ~JayGamingReviews",
            "review_score": "1"
        },
        {
            "review_text": "&gt; After many months of waiting friends buy game &gt; Tell them to join my server &gt; Kick everybody and lock it when they join. &gt; Give them admin &gt; Goof around for about 1 hour &gt; 'I have to go' &gt; Unlocks the server before I leave &gt; Leave the 3 stooges to make my server go from #14 to #41 in 3 seconds.   thanks fethurz and insert_name for ruining life",
            "review_score": "1"
        },
        {
            "review_text": "For being a multiplayer mod for a single player game, I believe this mod was made very well.",
            "review_score": "1"
        },
        {
            "review_text": "Fly into the sunset sky in your spinning car going ape ♥♥♥♥ while listening to Danger Zone, things like that you'll never forget.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game . must play",
            "review_score": "1"
        },
        {
            "review_text": "Been playing for 5 Hours Straight! epic!!! Thanx for this AWESOME MOD! :",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, just brilliant. There are so many things about Just Cause 2 multiplayer that make it amazing! ",
            "review_score": "1"
        },
        {
            "review_text": "awesome game . must play",
            "review_score": "1"
        },
        {
            "review_text": "Everyone knows why this game exists. It exitsts so you can join a server with speed boost enabled, and then hit the shift key all day. I recommend it :)",
            "review_score": "1"
        },
        {
            "review_text": "The first time I logged into the beta server all those months ago I was greeted with a flaming passenger jet hurtling past my screen. The lag was terrible, shots wouldn't hit anything and the rocket launcher was insanely overpowered. Yet, despite all this I had the most fun I'd had in a game for ages.  In the subsequent beta tests the lag became far less noticable and in the prerelease version it was down to no more than internet speed. One should approach this game as something akin to Planetside 2; but as one constant battlefield, with no commander and the ability to spawn a Hercules Jet whenever you want. This game is the embodiment of chaos, and I loved every second of it.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of my favorite multiplayer games. A map around 300 or so square miles and no limits. If you are looking to make friends, you will find them here. I know I did.",
            "review_score": "1"
        },
        {
            "review_text": "A real blast of an idea, the world of Just Cause 2 has become even more chaotic. Even if you are only interested in the mod it's worth every penny you spend on it, an absolute must have.",
            "review_score": "1"
        },
        {
            "review_text": "I really recommend this game, its super fun and insane at the same time :D *I also recommend to play the single player first to see how to play*",
            "review_score": "1"
        },
        {
            "review_text": "For the low, low, price of free you get new shoes. 101/20 ",
            "review_score": "1"
        },
        {
            "review_text": "I came into this mod with not high hopes as I found JC2 a little bit restrictive (it was hard to get money for weapons). But I stand corrected this mod is amazing.( as long as you find a good server)",
            "review_score": "1"
        },
        {
            "review_text": "Simply awesome! A ♥♥♥♥♥♥♥♥ of fun and a great way to pass some time. From wreaking havoc to simply exploring the map, this game has it all. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good game! Ps: cant wait for Just Cause 3",
            "review_score": "1"
        },
        {
            "review_text": "Very fun! Awesome and amusing at the same time! I'm glad they made this Multiplayer because I now get to mess around with friends. 10/10 ~JayGamingReviews",
            "review_score": "1"
        },
        {
            "review_text": "The perfect game. Open world, Huge map, Spawn menu. And now with multplayer. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong I love this mod. It makes it easy to play with friends... I just hate how it always crashes and or says its not responding when I close it.",
            "review_score": "1"
        },
        {
            "review_text": "every one should ge this ",
            "review_score": "1"
        },
        {
            "review_text": "Great!!!",
            "review_score": "1"
        },
        {
            "review_text": "Basically: You try to run from people but 9 times out of ten you'll get shot by an RPG  But anyway, it's really fun with the servers that have a 'Boost' button, because you can be a tank and fly into the air. Laughed really hard.",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting for GTAV to come out on PC? WELL STOP! This'll be all you need, plus some friends to extend your playtime. Bah sure there might be more official activities in GTAV but can your buddy ride on top of your jet and fly across the world in GTAV? DIDNT THINK SO! The massive servers provide constant mayhem in hotspots. I'm having serious fun playing this by myself and with friends. So what are you waiting for?! Quit saving up money for GTAV (Which may never come out on PC anyways... Thanks RStar. :P) and save loads-a-dosh buy buying JC2 and get the multiplayer mod for FREE!",
            "review_score": "1"
        },
        {
            "review_text": "Flew himalayas then managed to jump a 250m gap with a ♥♥♥♥♥♥ motor bike 666/10 - Would learn to fly a boat again",
            "review_score": "1"
        },
        {
            "review_text": "We're the Tunnel Snakes. That's us, we rule. Tunnel Snakes rule.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome mod for an awesome game. Finally get to play JC2 with other people!",
            "review_score": "1"
        },
        {
            "review_text": "It's like GTA Online if it were directed by Michael Bay",
            "review_score": "1"
        },
        {
            "review_text": "Great!!!",
            "review_score": "1"
        },
        {
            "review_text": "JUST ♥♥♥♥ING GET IT! YOU CAN FLY ♥♥♥♥ING BOATS!!!",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for making this epic mod :D",
            "review_score": "1"
        },
        {
            "review_text": "Fun. Addicting Fun.",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting for GTAV to come out on PC? WELL STOP! This'll be all you need, plus some friends to extend your playtime. Bah sure there might be more official activities in GTAV but can your buddy ride on top of your jet and fly across the world in GTAV? DIDNT THINK SO! The massive servers provide constant mayhem in hotspots. I'm having serious fun playing this by myself and with friends. So what are you waiting for?! Quit saving up money for GTAV (Which may never come out on PC anyways... Thanks RStar. :P) and save loads-a-dosh buy buying JC2 and get the multiplayer mod for FREE!",
            "review_score": "1"
        },
        {
            "review_text": "I REALLY wish there was an option to create a co-op server with NPCs. Other than that, its pretty hilarious. My friend and I spend a Friday night and a Saturday night playing on a server until 2 AM until we were acting like complete idiots. 11/10 would drive around looking for my friend until I finally ask where he is, and as soon as I start talking, he crashes an airliner into my little jeep.",
            "review_score": "1"
        },
        {
            "review_text": "Discover server with shift boost. Got with a friend on a boat. Friend presses shift. Our boat became a space shuttle.  Also, you can wield a tuk tuk to a plane and become an exploding wrecking ball.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing mod/game.  -Spawn in vehicles -Teleport to places -Lots of stuff happening all over the place -Hold shift to go insanely fast -Carry on holding shift to fly at 700km/h -Huge battles -Lots of gun fights -Dog fights -Tank battles -Grapple vehicles together -For loads of fun go to the main airport -Road trips -Tuk tuk's (and tuk tuk boom's) -Events -Halarious deaths -Really funny in general -Play with friends  Hours of fun!!!!!  11/10 - Definitely reccomend this game!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious",
            "review_score": "1"
        },
        {
            "review_text": "Joined a server, saw flying boats. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It will destroy your life, and everyone around you will suffer.   10000/10 Must own.",
            "review_score": "1"
        },
        {
            "review_text": "i bought just cause 2 for the multiplayer 10//10 would play 2000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000more times again",
            "review_score": "1"
        },
        {
            "review_text": "Just say 'alienware' in chat and watch things explode for a few days.",
            "review_score": "1"
        },
        {
            "review_text": "I Play this game since day 1 and i still love it 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Good but not too much things to do, the first thing you do it's survive without being kill by others.. and the other kind of activities, you cannot play it because nobody play it.",
            "review_score": "1"
        },
        {
            "review_text": "apparently this game has a singleplayer counterpart too",
            "review_score": "1"
        },
        {
            "review_text": "Endless fun!  Everything you touch explodes!",
            "review_score": "1"
        },
        {
            "review_text": "A mod So Good I can't stand playing the original game! Please Buy JC2 so you can get this mod!",
            "review_score": "1"
        },
        {
            "review_text": "ABSALOUTE CHAOS",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 2 on Steroids, love it.  For all who have JC2,ya gotta play this.   Cheers.",
            "review_score": "1"
        },
        {
            "review_text": "better than gta5.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome mod for Just cause 2, with great modes and multiplayer fun. Everything you need for the sake of funness!",
            "review_score": "1"
        },
        {
            "review_text": "Where's all the ♥♥♥♥ing players?",
            "review_score": "1"
        },
        {
            "review_text": "Great multiplayer mod!! Enough players around to have a good time (At least for me) Some servers have passive mode so you can play without having to worry about getting shot.  I primarily play this as a flight 'sim' because I love the flying mechanics. Some servers crash this mp mod so try a few servers and find one that is stable. It shouldn't take long =)",
            "review_score": "1"
        },
        {
            "review_text": "Great fun and huge haos :) Who doesnt like those 2",
            "review_score": "1"
        },
        {
            "review_text": "I like this game boo boo kity ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ing ♥♥♥♥ this is awesome with a friend!",
            "review_score": "1"
        },
        {
            "review_text": "For The Win ",
            "review_score": "1"
        },
        {
            "review_text": "Jman100's freeroam server is the best",
            "review_score": "1"
        },
        {
            "review_text": "Best mod to a game ever!  69/10 would blow up again!",
            "review_score": "1"
        },
        {
            "review_text": "Get it... Get it now!!! Get this mod now!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "So much more fun than Just Cause 2",
            "review_score": "1"
        },
        {
            "review_text": "Imagine GTAV online for PC, make it considerably laggy, multiply the player count by a thousand, make everyone superhuman and THEN you have JC2-MP. Boats can go 600 mph, attack helicopters never have to reload and the sky is FULL of parachuting, machine gun toting maniacs.",
            "review_score": "1"
        },
        {
            "review_text": "'hai guise u shoud use a alenware pc' 'NVIDIA &lt; ALIENWARE' 'alienware gets me 60 fps' 'pcmasterrace' ",
            "review_score": "1"
        },
        {
            "review_text": "Get your own server and play with friends and it becomes JC2 carnage times however many players you have.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best mods ever. Why did Just cause 3 have no multiplayer?",
            "review_score": "1"
        },
        {
            "review_text": "If u do not have this game there is something wrong with you (not just your face)",
            "review_score": "1"
        },
        {
            "review_text": "Its like DayZ , With Grapling Hook  10/10 gonna broke again",
            "review_score": "1"
        },
        {
            "review_text": "This is the best, and most chaotic multiplayer that I've ever played. I'll never ever get bored of this.",
            "review_score": "1"
        },
        {
            "review_text": "holy ♥♥♥♥ing christ",
            "review_score": "1"
        },
        {
            "review_text": "JC2:MM is what a massive multiplayer sandbox should be; absolute mayhem and endless fun. Combine that with custom servers and a scripting language that can push the game engine to its limits, the possibilities are almost endless and the enjoyment is absolutely phenomenal.",
            "review_score": "1"
        },
        {
            "review_text": "playig it for a long time and i am enjoying it so much!",
            "review_score": "1"
        },
        {
            "review_text": "Freaking radical. I love the ability to host and play modded servers (sorta like Multi Theft Auto), increasing the already caotic chaos. Just Cause 2 is dirt cheap on sales aswell, so you really have no reason not to play this. Get it and then download this, you fool.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "Very Good, Action Packed and or Just plain solo chaos. This is good for 23 mb of a mod, common fps is around 30-40. Reccomend this strongly if you want to cause chaos but, dont want to be wanted. THumbs up",
            "review_score": "1"
        },
        {
            "review_text": "Everyone grappled their Berings to each other, forming a giant chain of Berings.  We all blew up trying to take off.   10/10 Would break physics again.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best, and most chaotic multiplayer that I've ever played. I'll never ever get bored of this.",
            "review_score": "1"
        },
        {
            "review_text": "i can easily masturbate to this mod because its so good",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING free add on to Just Cause 2. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Other than the crybabies, it's a really fun game. Play on Gaveroid's server!",
            "review_score": "1"
        },
        {
            "review_text": "Ingredients:  •4 russet potatoes, peeled •1 lb ground beef •1/2 tsp cayenne •1 tsp paprika •1 tsp cumin powder •Oil for frying •Salt &amp; pepper •1 cup shredded cheddar or Mexican cheese mix •1 tomato, seeded and chopped •Sour cream  Quick Guacamole •1 avocado, pitted and peel removed •Juice of 1 lime •1 tsp fresh cilantro, chopped + more for garnish •1/8 cup red onion, chopped •1/2 jalapeno, seeded and chopped  Directions:        Report this ad    1.Cut potatoes into French fry lengths (a mandoline comes in handy here). Add to a large bowl and fill with enough cold water to cover the fries. Refrigerate for about 30 minutes to 1 hour. 2.While the potatoes are soaking, cook the ground beef. Warm a medium skillet over medium-high heat. When the pan is hot, add the ground beef along with the cayenne, paprika, cumin, ¼ tsp salt and ¼ black pepper. Cook, breaking up the meat so it doesn’t form large clumps, until browned and cooked through. Keep warm and set aside. 3.To make the quick guacamole, smash the avocado in a small bowl with the back of your form until smooth. Stir in jalapeno, red onion, cilantro, salt, pepper and lime juice. Cover and set aside. 4.Pour oil into a dutch oven or heavy bottomed pot until it is 3' deep. Heat over medium heat until the temperature reaches 375 degrees. Drain potatoes and dry completely with paper towels. Fry the potatoes, working in small batches, until crisp and golden. Remove to a paper towel lined plate to drain. Season immediately with salt. 5.Add the French fries to a cast iron skillet. Top with the cooked ground beef and shredded cheese. Turn on oven broiler to high and broil until the cheese is melted and bubbling, approximately 2 to 3 minutes. Remove from oven, top with chopped tomato, guacamole, and sour cream. Sprinkle with extra fresh cilantro and serve immediately. ",
            "review_score": "1"
        },
        {
            "review_text": "Let me start with the negatives first: Con's: - Can crash a lot (turn of 'Decals' in the options menu to avoid most of them) - Taking over towns is absolutely repetitive - Huge open world, but it feels empty sometimes  Pro's: - You can blow stuff up! - You want to blow stuff up! - Plenty of towns to blow stuff up! - Grappling is fun - Plenty of mods available - Huge open world map to explore - Easter eggs - Action packed  Don't take this game too seriously and you'll have lots of fun. :-) Don't pass this one by, the price of this game is ridiculously low for what you get in return.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer CHAOS!!!!! Best game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Good multiplayer for JC2.",
            "review_score": "1"
        },
        {
            "review_text": "so remmber when GTA V came out and the world teased PC gamers that we didnt get it? well this is our amazing come back, that map is larger than GTA V and the community is more organised but still with mayhem and madness of all these sorts of games. the servers hold upto 5000 people and iv been in a game with 1000 and it didnt feel crowded just more fun! there are bugs for sure but everything works perfect until you notice the small things like why didnt he die? but hey this is a MOD made by some guy not the big game dev team! theres races, derbys, deathmatches and after winning or just finishing these events you get cash to but guns, vechiels, and other things to play with.  overall this is a must have in a gamers libary now with this MOD 9/10 - for bugs but they will be fixed",
            "review_score": "1"
        },
        {
            "review_text": "Got in a car used boost turned into an airplane 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Got in a car used boost turned into an airplane 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Bought JC2, downloaded it, gave it a try, downloaded this, gave this a try, never touched original game again.",
            "review_score": "1"
        },
        {
            "review_text": "I love this mod! There is a huge variety of things to do but be warned there are a lot of glitches and it is most fun when you have friends to play with. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "FUN RANDOM FREE ROAM, you have a grappling hook a parachute and you can buy things and freaking blow stuff up!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is fun but I have no idea what I'm supposed to be doing with it most of the time, so I just end up flying tugboats thru the air at 600km/h.",
            "review_score": "1"
        },
        {
            "review_text": "I only played 30 mins and yet the possibilities are endless. In fact, that's one of the downsides of this - since the scale of the game is so large it can be an absolute bugbear to find other players at the mo! I hope that, as time goes on and more people hear about this, this will be different as the idea of 1000s of players on here is just too good to miss.",
            "review_score": "1"
        },
        {
            "review_text": "GTA 5 + Random Physics+ Multiplayer = Just Cause 2 Multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "One of the best modifications ever released.",
            "review_score": "1"
        },
        {
            "review_text": "Best mod ever, i LOVE the servers and if you love jc2 then you should defently play jc2mp",
            "review_score": "1"
        },
        {
            "review_text": "Playing was funny for about 2-3 hours with one friend, so with 10 friends it can be 20-30 hours of fun??? I doubt it.  Still, great job making this mod possible.",
            "review_score": "1"
        },
        {
            "review_text": "just play singleplayer lol",
            "review_score": "1"
        },
        {
            "review_text": "Would be great, if it worked......",
            "review_score": "1"
        },
        {
            "review_text": "it is the best because you can just do every thing you can do in single player but with your friends ",
            "review_score": "1"
        },
        {
            "review_text": "An interesting experience and OH MY GOD A FLYING SAILBOAT",
            "review_score": "1"
        },
        {
            "review_text": "Still feels like an unfinished mo but it's so fun!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite things to play at the moment. On par with GTA V Online. Definitely recommend it. - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "dicking around is fun kids!",
            "review_score": "1"
        },
        {
            "review_text": "I destoryed someones tank with a Sniper Rifle in 6 shots and got called a hacker. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "hey devs  GIVE US SERVER CLIENT",
            "review_score": "1"
        },
        {
            "review_text": "Crazy,Stupid,Fun. If you haven't played it do yourself a favour and give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry, I can't make a good enough review for this, I'm too busy flying in a boat at 400 miles an hour",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome mod. I love the boost and how boats are now airborn :D",
            "review_score": "1"
        },
        {
            "review_text": "I've had my experiences with this multiplayer mod, a lot of good times and a lot of bad times, but the most important part about the game is the chaos. You can't go wrong with too much chaos or too little chaos, but if you like a balanced gametype with hardly any explosions and lots of pretty flowers, go back to minecraft. But seriously, let's get real here, if you like a game where you can screw around and do whatever you want, play this game, because to be honest, if i had to choose between this game or 1,000,000 dollars, i'd choose this game because i don't need money. Ok i lied, i need money but if you do purchase this game, the server that'll be perfect for you is N3rdCubed, look it up, you will not regret the chaos",
            "review_score": "1"
        },
        {
            "review_text": "the ebst fan-made mod you could ever get",
            "review_score": "1"
        },
        {
            "review_text": "Though I say I recommend it, its not entirely what I was looking for. I personally thought it would be the same turn-off-your-brain and ♥♥♥♥ around thing, with being able to progress through the ACTUAL game. Even though it not what I wanted and probably what others like myself expected, I still enjoy it. I still got the ♥♥♥♥ing around, but just not Just Cause 2. No story, no missions. But aside from that. ♥♥♥♥ing Fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "cause why not",
            "review_score": "1"
        },
        {
            "review_text": "Makes an already awesome game 100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.5x better. 11/10 SO MUCH EXPLODING",
            "review_score": "1"
        },
        {
            "review_text": "I destoryed someones tank with a Sniper Rifle in 6 shots and got called a hacker. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Makes a good idea even better when you can share it with your friends",
            "review_score": "1"
        },
        {
            "review_text": "I like this.",
            "review_score": "1"
        },
        {
            "review_text": "I went about 1200kmph with a car, hit a tree, the tree broke down, i started flying, i flew over the water, finally reached ground, jumped out of car and opened parachute a milisecond before it exploded into flames, landed safely, game crashed.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥ so intense. Whats better than crashing a air plane into 500 other players. I DONT KNOW! NOTHING COMES CLOSE TO THIS WACK ♥♥♥♥ ♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "awesome.it changed gaming for me because one of my favourite games online and me and my friends love grappling around and flying planes and having tank wars and loads more!!!!! GET IT!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Most fun that i've had with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Makes an already awesome game 100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.5x better. 11/10 SO MUCH EXPLODING",
            "review_score": "1"
        },
        {
            "review_text": "In this game it's kill or be killed",
            "review_score": "1"
        },
        {
            "review_text": "Obligatory Just Cause pun. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "The best game has become the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Just another Great mod that makes the game more enjoyable, I recommend Jman100s sever for just spawning random stuff and having fun with friends. but Role Play severs are just behind it (because I never Play on Them) If you are into role-playing, The role play severs are not what you would think it is not like Arma 3 altis Life with police ect the only real RP feature is not being able not find cars easily which is a pain. But On a whole A very Good mod not many bugs There are not many bugs I can pick out",
            "review_score": "1"
        },
        {
            "review_text": "This mod is why I bought JC2 on PC, as I already owned it on Xbox 360. Unfortunately, I didn't do enough looking into this mod before I bought the PC version. It's not a bad mod and can be fun to play, but perhaps understandably so, there are no NPCs. I was hoping for like a campaign co-op feature but it's not there. Every server pretty much just for pvp. One major complaints that I have is that in the mod, there is a wingsuit but they didn't add the ability to activate it using a controller. You HAVE to use the keyboard. This is a problem for me as I've always used a 360 controller when I played this so using a keyboard would be like me switching to a PS4. It'd take me hours to get used to it and imo it's not worth it. Unfortunately again, most players use the wingsuit, usually to escape unfavorable pvp conditions and once they're flying, their speed literally rivals that of a jet in the game, no joke. Overall though, these issues are mostly ones personal to me, just so you know these things going in, I still think you should get the mod. It is free after all.",
            "review_score": "1"
        },
        {
            "review_text": "looks like   GRAND THEFT AUTO FIVE!!!!!!!!!!! WOOOOOOOOOOOH  i love this game so nice my friend likes this so much :D :D :D:D :D:D :D :D:   ",
            "review_score": "1"
        },
        {
            "review_text": "I got to play as a old woman who shot rockets as fast as a smg. Best gaem  21857529357958795370/10",
            "review_score": "1"
        },
        {
            "review_text": "Flew a boat across the map  10/10",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS GREAT!",
            "review_score": "1"
        },
        {
            "review_text": "Obligatory Just Cause pun. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Its ok i guess",
            "review_score": "1"
        },
        {
            "review_text": "u can attach cars to plane than ♥♥♥♥ a car 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I played it for just an hour and already I can tell this is going to be gold.",
            "review_score": "1"
        },
        {
            "review_text": "Everywhere else is empty and boring apart from the airport where everyone is at a vietnam style war with eachother. 7.8/10 not enough DRM",
            "review_score": "1"
        },
        {
            "review_text": "I would like to thank the developers of this mod for such wonderful work and i hope to see them work on JC3 in the future.",
            "review_score": "1"
        },
        {
            "review_text": "If you have this game then you need to get this mod for it. This changes everything!! This is almost as good as gta 5 online except you are playing in a much bigger map. You atleast need to try this before you say no. I dont think anyone wouldnt want to play this.",
            "review_score": "1"
        },
        {
            "review_text": "Good game.I've just never played games better than that.Good gameplay,graphic and weapon makes this game very cool,",
            "review_score": "1"
        },
        {
            "review_text": "If you have this game then you need to get this mod for it. This changes everything!! This is almost as good as gta 5 online except you are playing in a much bigger map. You atleast need to try this before you say no. I dont think anyone wouldnt want to play this.",
            "review_score": "1"
        },
        {
            "review_text": "this Game is so good 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is like... Well, not a single game can compare to this game!",
            "review_score": "1"
        },
        {
            "review_text": "A good mod for a great game. Crashes a lot though.",
            "review_score": "1"
        },
        {
            "review_text": "Despite not opening on AMD pc's with Win 10 once I fixed I am Happy!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "veri fun 2 jack planes and cars  mani servers to go on and have funn",
            "review_score": "1"
        },
        {
            "review_text": "It darn got heli-chopers in it, it dose.",
            "review_score": "1"
        },
        {
            "review_text": "Basically: Execution, awfull. Full of glitches, crashes, lag and clientside problems  This shouldn't be a problem in 'funforfun' servers, where ur only objective is kill and make things explode for fun.  BUT, in servers like RolePlay, this is a great problem that can't be permanently resolved.  You can have fun for a few hours or even months, but this won't last long in your 'favourite multiplayer games'.",
            "review_score": "1"
        },
        {
            "review_text": "Really just a massive deathmatch with no real goal except to f**k people up. Usally big battles drag FPS down into single digits as the server(s) can't seem to handle all the action. Glitchy, buggy, unstable, and overall a chaotic mess...which is actually kind of fun for a while. However it can wear thin fast, but hey, it's free!  All in all- it's a mod and it's free; so if you already own JC2 (or can get it for cheap), then you've got nothing to loose",
            "review_score": "1"
        },
        {
            "review_text": "I fell from the sky with a jetplane following me... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the funnest mod I have ever played, ever.",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a riot! Total chaos at times. This open world multiplayer action game is one of a kind, but it's the type of game that you can learn as you go, although it is still easy to get into. I played this before it was on Steam and can't wait to see the community and the mod grow!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best multiplayers i have ever played! :D",
            "review_score": "1"
        },
        {
            "review_text": "This is just great if you have just cause 2.",
            "review_score": "1"
        },
        {
            "review_text": "This is wonderful, sensational stupidity, and well worth the purchase of Just Cause 2.",
            "review_score": "1"
        },
        {
            "review_text": "9/11 simulator simply ",
            "review_score": "1"
        },
        {
            "review_text": "Flying boats... nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Its great because Just Cause",
            "review_score": "1"
        },
        {
            "review_text": "Not The Best Multi-player due to everyone being really mean and you can hardly ever get a plane. Planes disappear in the middle of a flight although it is kinda fun when you do get a descent vehicle.",
            "review_score": "1"
        },
        {
            "review_text": "De boost [SHIFT] is fabolous",
            "review_score": "1"
        },
        {
            "review_text": "this game is so fun oyu should get you got everything its kinda of like gta or saints row",
            "review_score": "1"
        },
        {
            "review_text": "This is some of the strangest multiplayer I have ever experienced. Its like GTA Online but so much better! Its like non stop action movie!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome concept and game in general, just don't realy like the community.",
            "review_score": "1"
        },
        {
            "review_text": "Explosions = Good Multiplayer Explosions = Better Good. 128 Multiplayers = 3059125/10",
            "review_score": "1"
        },
        {
            "review_text": "Flew a boat into a mountain.  10/10 Must play.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun ! Just Cause 2 is usually at sale for ~2 euros every month. It's a no brainer. Endless possibilites of fun !",
            "review_score": "1"
        },
        {
            "review_text": "What GTA should be!  Adds so much to a game for a free addon, Great if you have a few mins to kill but the hours will quickly tick by.",
            "review_score": "1"
        },
        {
            "review_text": "Just so glad this is free. Once upon a time, you could f*** up Panau on your own. Now you can do it with thousands of others. Go on a public server, play with friends or even by yourself. 11/5",
            "review_score": "1"
        },
        {
            "review_text": "hands down this mod for just cause 2 is so fun to play with friends, the only thing i recomend is to have an option to get rid of the chat feed because it is very destracting. and also if when you die you dont always spawn in the air",
            "review_score": "1"
        },
        {
            "review_text": "This is great game. I always play this whenever i can, I like to play it with Pals i think it is a game for you to play around with friens and drive of cliffs",
            "review_score": "1"
        },
        {
            "review_text": "Blow each other up.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It keeps crashing on me??? The regular game works. ",
            "review_score": "1"
        },
        {
            "review_text": "I wish this game have goats, i like goats.",
            "review_score": "1"
        },
        {
            "review_text": "Just some good fun blowing things up with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Great Mod makes the game so much more fun",
            "review_score": "1"
        },
        {
            "review_text": "everyone should get this game its very crazy especially when u can use the boosts in every vehicle. sometimes in a boat u can read the world border going up with the boost ability",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAMR IRS SROOO GURD ET TOOK WAWAY MWY ABILWITYTY TOOI TYPES",
            "review_score": "1"
        },
        {
            "review_text": "Flew a pink barge through the sky which I turned into a cargo plane while trying to crash it into a building.  It didn't explode.  0/10 Best mod ever.",
            "review_score": "1"
        },
        {
            "review_text": "REally nice, but as of 16/12-13 it is a bit buggy.",
            "review_score": "1"
        },
        {
            "review_text": "If there is Coop game then this game is best game ever !",
            "review_score": "1"
        },
        {
            "review_text": "This is what hell and utter chaos means.  Just Cause 2 is a cheap, huge, and rather ♥♥♥♥♥♥♥♥ game were you do tons of stuff, but spend most of the game blowing things up. Now think: Would it be fun to do that, with 10.000 other players?  Oh boy, if it was, and still is. When this got released on Steam, some servers where 100% full, and some of them had the limit of 10.000 players. Now stop there for a second and think, because THIS is what GTA Online should have been. Not that crappy 16 limit-players ♥♥♥♥♥♥♥t.  There are no rules in this game. The map is huge, and it's filled with complete war-zones, with over 500 players killing each other for no reason. There are races, dance parties, and even Limo-demolition-derby matches. F#CKING LIMO-DEMOLITION-DERBIES, DO I NEED TO SAY MORE!?  This game turns into the best game ever when you actually get friends to play it with. You can go arround, with 10 people hanging of a combat helicopter, while the driver rains hell on the people under you, while you and your friends just shoot each other in the face. You can surf police-cars that reach 800km/h. You can even crash in the Lost island, and try to survive while one of you guys plays as a Sniping camping hunter.  Proper reviews can't review this mess. But I'll tell you, it's a hell of a mess, the one you end up loving. I would keep it playing, if my good computer didn't exploded, and my back-up one didn't had so much FPS-Drops with the game. The Multiplayer is free, and even if it needs the actual game, the game itself is cheap as ♥♥♥♥. There's no excuse to join the madness, and crash tanks into people's faces.",
            "review_score": "1"
        },
        {
            "review_text": "So much fun, like planetside 2 but in the wacky world of just cause!",
            "review_score": "1"
        },
        {
            "review_text": "hilriously good ",
            "review_score": "1"
        },
        {
            "review_text": "The funnest mod ever! Just the boost alone makes this game so funny. Its just made the mostly perfect game even more perfect cant wait for JC3 MP",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game expansion ever. #Explosians ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing Amazing. Adding to an already perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "naise gim, play with yer friends it will be moar naise",
            "review_score": "1"
        },
        {
            "review_text": "Pure, open world constructed chaos. WOrth every penny and then some.",
            "review_score": "1"
        },
        {
            "review_text": "Play this while there are still servers with 750(!) people playing on them simultaneously.",
            "review_score": "1"
        },
        {
            "review_text": "quite good, a few quirks here and there, only true problem is no civilians. with them around, this thing would be a ton of fun",
            "review_score": "1"
        },
        {
            "review_text": "Imagen a interactive Action Movie (Just Cause 2) Now make it multiplayer, and then.....   BOOOM!!! CRASH! BANG PEW! PEW! PEW!  [AWESOME OUTRO MUSIC]",
            "review_score": "1"
        },
        {
            "review_text": "Massive world, tons of vehicles and weapons, hundreds of online people roaming around... Too much fun, go play it now.",
            "review_score": "1"
        },
        {
            "review_text": "huge server with hundreds of people. what could go wrong",
            "review_score": "1"
        },
        {
            "review_text": "Fun. Much better than the actual game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, makes the Just Cause 2 experiance so much better!",
            "review_score": "1"
        },
        {
            "review_text": "What are you doing? Why are reading this? You should already be downloading this.",
            "review_score": "1"
        },
        {
            "review_text": "just try attaching a silverbolt to the bottom of a helicopter and try to take off whilst being carried... things get messy  just cant seem to alter server settings to destroy stationary vehicles... or infact any vehicle which kinda makes destruction derby pointless at this time - but it might just be me as it is the first server I have ever hosted  hours of fun to be had attaching random items to things... how long can you get a chain going?  also remember to set the bonus for PKing to something stupid, just to add an incentive...",
            "review_score": "1"
        },
        {
            "review_text": "Fun game! It is soo crazy that its really funny, so if you want to create a youtube video this would be perfect for laughs, especially the cars that can fly if you hold shift, it is also a cool game, I really enjoy it while playing with my friends, I would reccomend it to bored people who want to have fun, I would say to make this game better the creators should make it so you can go inside the houses and get more guns and grenades, etc. I absoloutely think this game is a 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;joined server &gt;got boat &gt;pressed lshift &gt;fun times were had  10/10 would achieve lightspeed again",
            "review_score": "1"
        },
        {
            "review_text": "Love, this game, especially with the servers with vehicle sprint...",
            "review_score": "1"
        },
        {
            "review_text": "This is just AMAZING!!! It does tend to crash sometimes and it is really laggy, but other than that 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "This multiplayer mod is just... madness. On most servers the only way to acquire money is to win races (or place as close to first as possible) and the races themselves are hilarious and quite challenging. There's something really funny about being in a race where other players are flipping through the air and exploding all around you while you're trying to dodge some trees or a nasty looking bump in the road. It's kind of intense.   You will run into glitches galore, and the occational CTD, but the people that made this mod are a very small team - the fact that this mod works at all is pretty amazing.  I would recommend Just Cause 2 without missing a beat - it's one of my favorite games of all time. The multiplayer is fun and free so I would recommend you check that out, too.",
            "review_score": "1"
        },
        {
            "review_text": "Pure insanity. I wish there was more to it, but also enjoy how broken it is.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most fun I've had with a Sandbox since GTA San Andreas",
            "review_score": "1"
        },
        {
            "review_text": "I bought Just Cause 2 just to get this mod. And honestly it is more than worth it. Just Cause 2 Multiplayer is incredibly addicting. I started it up and before I knew it two hours had passed. If you find a server with some people, it becomes very social very quickly. You will always have people to talk to and shoot the breeze with while you run around, get killed and blow ♥♥♥♥ up. I found myself running around the island, flying around in helicopters and flying jets making up my own stories in my head as I did so. It's very engaging.  If you buy Just Cause 2 for any reason, buy it for this mod.",
            "review_score": "1"
        },
        {
            "review_text": "Spawned a hovercraft in mid-air after my plane exploded and was hit by a flying boat doing 6000000 miles per hour  potato/10",
            "review_score": "1"
        },
        {
            "review_text": "lots of things explode with friends  boomboom/10",
            "review_score": "1"
        },
        {
            "review_text": "Modding at its finest :D",
            "review_score": "1"
        },
        {
            "review_text": "SImply put it: Multiplayer carnage.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game. Best time I've ever had in a mod since GTA:SA multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Dumb as ♥♥♥♥ but thats what makes it fun. Totes recommend m80",
            "review_score": "1"
        },
        {
            "review_text": "It's FREEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE",
            "review_score": "1"
        },
        {
            "review_text": "Utter chaos is only meaningful if 300+ players are ramming each other with limos. This is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Blow each other up.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "First when just cause 2 came out it was perfit then moltie came.",
            "review_score": "1"
        },
        {
            "review_text": "Why: Just cause 2",
            "review_score": "1"
        },
        {
            "review_text": "Dressed up like a Deadpool knock-off, flew in a tank, achieved zero gravity above a bridge thanks to a sports car, ceated a wind turbine out of a bus.  100/10",
            "review_score": "1"
        },
        {
            "review_text": "This game mod is batshit Insane and Fun as ♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "Best Multiplayer available out there! Pure Epicness!",
            "review_score": "1"
        },
        {
            "review_text": "Classy. MTA = Pwnt.",
            "review_score": "1"
        },
        {
            "review_text": "Flying boats... nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever :)",
            "review_score": "1"
        },
        {
            "review_text": "So awesome wish everyone had it",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, silly, fun",
            "review_score": "1"
        },
        {
            "review_text": "Do i recommend this game/mod? Hell yes i do! if you have played Just Cause 2, and want to wreak same havoc on Panay Island with friends, then get this mod NOW! Well, what are you waiting for?! get it! :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun but be careful the servers are hosted in America so aussie players get 400+ ping",
            "review_score": "1"
        },
        {
            "review_text": "more explosions than an islamist terrorist group  21/10  ",
            "review_score": "1"
        },
        {
            "review_text": "The acceleration physics are amazing. 715.8kmph/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is madness. And you have to play it.",
            "review_score": "1"
        },
        {
            "review_text": "How do you even describe this? Basically, take all the chaos and fun you had in just cause 2, add multiplayer support, add races and a demolition derby set in PAN-MILSAT, and even plane chaos and PVP all in one! It's Freaking Chaotic! If you're feeling lucky, head into a major server with hundreds of players, i guarantee you all spawns will be populated and you'll have alot of arguing idiots in the chat. Which is why i play on smaller servers. PLEASE download this. it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Works really well, even with hundreds of people on a server. Hardly noticed any messy pop-in or jittering, entire mod runs smoothly (60+ fps with autodetected settings). Also, it somehow loads faster than JC2 itself.  It does get really, really messy with tons of people in one spot, and there will be inevitable griefing.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game cuz i love it, haha i mean ilove this game cuz this game like a gta online and this game doesnt take a high specs. Im sorry my english so bad so thats all thx   Wanna play? Ask me :v bye hahha",
            "review_score": "1"
        },
        {
            "review_text": "This mod is a blast with friends. Create your own fun. Has the right amount of broken to be glitchy but not game breaking. We've spent many hours at our LAN parties just goofing off in this. It's usually our game to finish the day on.",
            "review_score": "1"
        },
        {
            "review_text": "Nice concept but need to add more contents",
            "review_score": "1"
        },
        {
            "review_text": "This mod is vero good",
            "review_score": "1"
        },
        {
            "review_text": "It comes free with just cause 2, so it's gud. 8/10.1",
            "review_score": "1"
        },
        {
            "review_text": "The new public beta is absoutley amazing, wingsuit, new grenades and guns, neon and a whole lot of other stuff.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Just Cause 2 just to get this mod. And honestly it is more than worth it. Just Cause 2 Multiplayer is incredibly addicting. I started it up and before I knew it two hours had passed. If you find a server with some people, it becomes very social very quickly. You will always have people to talk to and shoot the breeze with while you run around, get killed and blow ♥♥♥♥ up. I found myself running around the island, flying around in helicopters and flying jets making up my own stories in my head as I did so. It's very engaging.  If you buy Just Cause 2 for any reason, buy it for this mod.",
            "review_score": "1"
        },
        {
            "review_text": "blow ♥♥♥♥ up with friends",
            "review_score": "1"
        },
        {
            "review_text": "Really fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 2: Multiplayer Mod can guarantee you hours of fun, and if you have friends playing with or against you makes it all the more fun. With the vast map and the various terrains this game can make you feel like your experiencing it first hand. The only problem I have with this game is that its fun, but if you were to stop playing it for a couple days and play something else (Idk TF2 or something) and try playing it again it just doesn't pull you back in. However this is an amazing game, and with the humoungus map and so many players I get a suprisingly good fps. For example I was playing one day with probably about 40 other people and I got a wonderful 70 frames per second (However this might not be true for all PCs/Laptops). Either way I highly recommend this game, try it out and have some fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you like just cause 2 and multiplayer then play this its what the title says",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME 2010",
            "review_score": "1"
        },
        {
            "review_text": "Its like GTA, only cheaper and more explosions. You know what i take!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun!!!!!! It's great that you can play JC2 with your friends! :D",
            "review_score": "1"
        },
        {
            "review_text": "Probably better than the original game. Lol",
            "review_score": "1"
        },
        {
            "review_text": "Straight dope.",
            "review_score": "1"
        },
        {
            "review_text": "You can explode things as ninjas.  10/10 IGN.",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer is awesome :D",
            "review_score": "1"
        },
        {
            "review_text": "it is gud",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good mod for a good game its fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "Recommend it, has brought lots of fun and joy to me",
            "review_score": "1"
        },
        {
            "review_text": "Very,very,VERY Crazy game!! YOU MUST GET IT RIGHT NOW!!!",
            "review_score": "1"
        },
        {
            "review_text": "Cool freeroam. :)",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SUPER EPICILY CRAZY SO MANY BULLETS AND EVERYTHING SO MAN GAMODES LIKE TRON PEOPLE TRON!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Totally hilarius and amazing u should buy it",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting way to waste time.",
            "review_score": "1"
        },
        {
            "review_text": "I would highly recommend because it gives a chance to spawn insane randomness and throw into the clouds.",
            "review_score": "1"
        },
        {
            "review_text": "The minute of this game I got run over. And the next. And the next. 10/10 Would get run over again.",
            "review_score": "1"
        },
        {
            "review_text": "Too much fun!!!!  Am Setting up a dedicated 70Mbp/s server now!",
            "review_score": "1"
        },
        {
            "review_text": "VERY and I mean VERY well done mod. It's Easiest one of my favourite Mods that I've ever played. On that note,though, it does get boring at some points if ur not playing with friends, so You should consider having a friend to come play with you. Overall, It's a Fantastic Mod!",
            "review_score": "1"
        },
        {
            "review_text": "HOLY ♥♥♥♥ this game. Once you've completed the single player head straight over to multiplayer. You can drive boats at 700 km/h in the ♥♥♥♥ing air, have a shootout on the a ♥♥♥♥in flying strip club. Just buy the ♥♥♥♥ing game you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "A good Open World Game",
            "review_score": "1"
        },
        {
            "review_text": "I recomend this game to everyone out there. This game offers a lot of features and servers which are fun to play on. You can play on RP servers and War Servers!",
            "review_score": "1"
        },
        {
            "review_text": "I'd say it's really good, though it does crash quite a lot and so you might get angry because of that. :(",
            "review_score": "1"
        },
        {
            "review_text": "Brings the best part of Just Cause 2 (freeroaming and messing around) to multiplayer. Now you can cause chaos and do crazy stunts with your friends. Highly recommended, I'll play more of this than the base game.",
            "review_score": "1"
        },
        {
            "review_text": "this is a very fun game",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "say just cause 2... but SOOOO much better go on servers with hundreds of people!",
            "review_score": "1"
        },
        {
            "review_text": "This one of the best mods, i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "Flew into space in a tank 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great way to releave some stress. great looking textures",
            "review_score": "1"
        },
        {
            "review_text": "Step inside and hold on for dear life.",
            "review_score": "1"
        },
        {
            "review_text": "this game is just awesome!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Oh come on Someone can help me? Fatal exception occurred when launching JC2-MP:Just Cause 2 does not appear to be installed",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game but i have had a few problems when the game has crashed, not sure weather its the PC or game, but pretty sure its the game",
            "review_score": "1"
        },
        {
            "review_text": "Take the craziness of the singleplayer game and add up to 1000 players. The result? Complete madness! You gotta try it to believe it.",
            "review_score": "1"
        },
        {
            "review_text": "Well, just a few words for you. FLYING CARS and BOATS! Need evidence? Here is a fire truck flying :         YouTube™ Video:  just_cause_2.avi&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Fun, in the most crazy way possible.",
            "review_score": "1"
        },
        {
            "review_text": "Straight dope.",
            "review_score": "1"
        },
        {
            "review_text": "Madness personified. I played on a server with 400+ ppl just shooting everything and anything.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun with friends but you will enjoy a lot of fun alone too.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game to mess around on with you're friends. I play it so often.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for just messing around, playing with friends, and turbo boost on certain servers. Did I mention the grappling hook? In essence, a great open world game with tons of replayability due to the many servers and community. For the best experience, I recommend playing with your friends in a call. Why? Just 'Cause.",
            "review_score": "1"
        },
        {
            "review_text": "A great concept and a very decent attempt when building on something you have very little in the way of guts to prod about. I was a part of the open betas and I had a lot of fun with the factions system. When the guiding principle of this game is its namesake ' Just 'cos ', it really helps to be doing the crazy things with likeminded people. Be a roving militia or a pirate. Be a taxi cabby. Be an airline passenger. Race in a derby or participate in skydiving competitions. Or sit on a grassy knoll and snipe people who use the teleport function.  Just one question: In the release trailer, with the sniper taking out the helicopter, the chatter on the left was redacted. How much  racism and Ponies  did the community have to belch out in order for this to happen? Because I was there for a lot of it, and my faith in humanity took quite a hit before I learned how to hide the chatter proper.  In closing, the system is great and it brings a lot of emergent gameplay potential and frenzied excitement to what is otherwise a pretty lonely game. Just keep the chatter  off  and do not interact with  a single soul  unless you know them (and even then, get Ventrilo or Mumble). Because by-and-large, JC2MP citizens are like YouTube commenters, they're all entitled to their opinions and their anuses, and they tend to exercise both without discretion.",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 2...with multiplayer! When I first heard of this I would never of thought that it would work let alone be the most fun I've ever had in a mod! You have the entire island to explore with literally thousands of other players all racing, flying, swimming or just going on a grief massacre! Drive around exploring, fly with friends or just be an all-our ♥♥♥♥ this mod has everything to keep you from ever getting bored!",
            "review_score": "1"
        },
        {
            "review_text": "This is crazy. Especially if you only played Just Cause 2 on PS3 like me.",
            "review_score": "1"
        },
        {
            "review_text": "looks like it may be good, need to develop the multiplayer aspect much more ",
            "review_score": "1"
        },
        {
            "review_text": "Stupidly good fun. Once it stops crashing it'll be even better. So good.",
            "review_score": "1"
        },
        {
            "review_text": "Massively fun. Adds greatly to the JC2 experiance.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "good game with an awesome community",
            "review_score": "1"
        },
        {
            "review_text": "Awsome. Just fun to mess around in and do whatever you want. Even if it is kinda buggy.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "HELP!! I CANt UPDATE THIS GAME automatiic &amp; i dont see upgrade button ._. ?!! , WHY ? and HOW TO UPDATE now ? please help mee.. now my ver is .v.0.1.0 , #needfastrespon #sorrybad_english",
            "review_score": "1"
        },
        {
            "review_text": "who needs GT5 when u have this! super amazing game",
            "review_score": "1"
        },
        {
            "review_text": "Good fun, chaotic",
            "review_score": "1"
        },
        {
            "review_text": "I literally just bought the full just cause 2 pack for $18 and now its $3. If I could get some compensation money that would be pretty awesome considering the circumstances... :D",
            "review_score": "1"
        },
        {
            "review_text": "Just give back my soup.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the game itself is fun, and this mod makes it better",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun! Love all the custom servers but it does have a few problems such as not being able to see the people grappled on your car.",
            "review_score": "1"
        },
        {
            "review_text": "'Anarchy: The Video Game'  10/10, will keep playing.",
            "review_score": "1"
        },
        {
            "review_text": "i am unsure if i have even played single player yet, this mod is amazing, i just wish there was LESS servers so the community could be like the beta again... ahh the good old days. when joo hunting was not frowned upon. sniff :rcry:",
            "review_score": "1"
        },
        {
            "review_text": "Hands down most hilarious multiplayer game around. A++",
            "review_score": "1"
        },
        {
            "review_text": "I got a hovercraft to shoot in the sky continuously at 400+ km/h until I reached about 10K meters in the sky.   Then I jumped out and died.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game can not put down",
            "review_score": "1"
        },
        {
            "review_text": "A very fun mod to a very fun game! Its got its bugs here and there but its very enjoyable. Especially with friends.  Just Cause 2: 9/10  Just Cause 2 Multiplayer Mod: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Mod is so broken something is not working even if you restart the game. This mod is really funny with friends, But still worth of playing 3,5/5",
            "review_score": "1"
        },
        {
            "review_text": "you fly planes into buildings with a bunch of other ricos",
            "review_score": "1"
        },
        {
            "review_text": "to sum it up.THE AIRPORT.that is all",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game to play with friends. Lot's of stuff to do like derby, races etc.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is a very BAD GAME!!! Now i played this game for like an hour and got bored becuse it was all freeroam and no story. BUT!!!!! The Multiplayer is amzing i hope they make Just Cause 3 better.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever :)",
            "review_score": "1"
        },
        {
            "review_text": "Had alot of fun here, specially in Multiplayer mod.",
            "review_score": "1"
        },
        {
            "review_text": "Very good Modification. Abled me and my friends to Play on JC2 With eachother. Reccomend this to anyone who likes Just Cause 2.",
            "review_score": "1"
        },
        {
            "review_text": "absoulutely awesome, kinda slow fps though",
            "review_score": "1"
        },
        {
            "review_text": "boats are planes... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "press shift to turbo boost  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game just for this.",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of fun to play with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun Game I Recommend This Game 100% Great Game",
            "review_score": "1"
        },
        {
            "review_text": "I spawned RV's and drove them at mach speed into unsuspecting players. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this is nothing short of crazy with boats flying at 800kph through the air airport mobed with hundreds of players and the mile high club being bombarded by planes, tanks and everything else in the game this is just damn right made for phycos n maniacs",
            "review_score": "1"
        },
        {
            "review_text": "Forgot how amazing this game is. When it goes to £3 again everyone should buy multiplayer is just endless hours of fun",
            "review_score": "1"
        },
        {
            "review_text": "I havent played much but this is my experience  -Spawned just finishing the JC2 Campaign missions -Get run over by car going at unknown amounts of speed -Find boat and hit shift -Wonder where the hell I am 10/10 would accidently go to space again in a boat",
            "review_score": "1"
        },
        {
            "review_text": "You can destroy random things, kill your friends, destroy cars you like, get another one, fly off a blimp, jump out of the car, grapple back to the blimp, and then get killed by a noobish G9 eclipse using 8 year old 10/10 would happen again.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun. It's like a Saints-Row, GTA, and JC2 hybrid.",
            "review_score": "1"
        },
        {
            "review_text": "'Random Destroying 2' Now online with friends! Double the explosions, double the fun!",
            "review_score": "1"
        },
        {
            "review_text": "Had a race with my friend, he had a sportscar and I had a fishing boat. I won.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic, a simple leveling system could make this a beautiful open world action-mmo.",
            "review_score": "1"
        },
        {
            "review_text": "Yeh, it's good.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best thing in the world.",
            "review_score": "1"
        },
        {
            "review_text": "Insane game, the multiplayer mod is a must have for me. I honestly did not expect this game to be as good as it is but now whenever enough people are online, this is what we play.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to be in the same chaotic server as 2999 other people, with enough firearms and explosives to wipe the game world clear in mere hours? That's what I thought. Get this mod. Enjoy the chaos that ensues. They took the most fun game out there, and made it even better.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "world war 3 the game/mod",
            "review_score": "1"
        },
        {
            "review_text": "Was just minding my own business in the sky on the Mile High Club and then I get ran over by a yacht and I fall from the sky to my death. 10/10 would get ran over by a boat in the sky again.",
            "review_score": "1"
        },
        {
            "review_text": "Joined a random server with a max of 10k people, or something silly like that. Server has mod to hold shift, make vehicle go SUPER fast in direction it's facing...  Do a jump, hold shift: You now have a flying car.  10/10 would jump over mountain with a guy riding on top of my car again.",
            "review_score": "1"
        },
        {
            "review_text": "It's free and you can grapple your friend to a plane then fly that plane into another plane while explosions occur in the background.",
            "review_score": "1"
        },
        {
            "review_text": "cause choas.",
            "review_score": "1"
        },
        {
            "review_text": "Every server I try to connect to says it fails and asks if i'm sure the server is up. what should i do?",
            "review_score": "1"
        },
        {
            "review_text": "This mod is an amazing way to play with friends or just soloon multiplayer. If you Just Cause 2 but not multiplay give multiplayer a try!",
            "review_score": "1"
        },
        {
            "review_text": "Explosion and Player ♥♥♥♥fest",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun jacking off to he stripper skins is fun,",
            "review_score": "1"
        },
        {
            "review_text": "This game is... AMAZING! I played for a little bit to try out and had a great time, join huge servers with 800+ people and you will have the time of your life!",
            "review_score": "1"
        },
        {
            "review_text": "great game to just mess around",
            "review_score": "1"
        },
        {
            "review_text": "I pooed a little when a boat flew past me at mach 1, and careened into the side of a mountain.  explosion/10",
            "review_score": "1"
        },
        {
            "review_text": "It's funny when your character falls from a great height, then bounces after he faceplants.",
            "review_score": "1"
        },
        {
            "review_text": "The best open world single player just got better!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome mod, Great fun. It's better than GTA Online.",
            "review_score": "1"
        },
        {
            "review_text": "needs work and fixing but still a hell of a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "What GTA V online couldn't be.",
            "review_score": "1"
        },
        {
            "review_text": "i couldn't imagine a better game to have a MMO sandbox than this.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Also, it works quite well.",
            "review_score": "1"
        },
        {
            "review_text": "AH!!!! Best Mod ever!!! Grab some friends and Fly a Freaking boat in the air!!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you like to have fun and you aren't forever alone and possibly have a weird sence of humour. You HAVE to getr this. FREA&gt;KING HILLARIOUS! (MX Cherry Red, strikes aghain)",
            "review_score": "1"
        },
        {
            "review_text": "Best mod I've seen in recent years. Besides a few resolution problems I have experienced, this mod is top notch fun.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun multiplayer mod. Gets really derpy which I love. The boost is by far the funniest and best part of this whole 10/10 would bang",
            "review_score": "1"
        },
        {
            "review_text": "A GTA Online that you've always wanted. But with even more crazy antics and big explosions. Worth any time it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "All i need to say about the master piece of an mod is you can fly an boat at 2000kph and land it and building in an walk away from it a explodes and say to your self, 10/10 would fly again =3",
            "review_score": "1"
        },
        {
            "review_text": "Amazing fun, huge variety of servers including role play, freeroam and sandbox!",
            "review_score": "1"
        },
        {
            "review_text": "Great cheap fun! You can join a server with 200+ people!",
            "review_score": "1"
        },
        {
            "review_text": "just like call of duty, you just need a bad ping and to be ♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Insanity at its finest! ",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS AMAZING",
            "review_score": "1"
        },
        {
            "review_text": "its great just needs updated ",
            "review_score": "1"
        },
        {
            "review_text": "Wow. When I got Just Cause 2 I had no idea i got a multiplayer mod with it. Just Cause 2 is cheap to buy, but I think it's probably worth more than it is for sure. It's a great open world game with no boundarys. You can be good, you can be bad, you can go to the mountains, you can go to the city, you can get around in a car, you can get around in a plane, you can ally with people on multiplayer, you can kill them.  A fantastic game. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "you have to get this. Even if you dont like the FFA today, the fact that it has a Lua scripting system means it will be ridiculously good in no time. And it will be a relevant game for the next 5 years, just like Multi Theft Auto is still logging 6k concurrent",
            "review_score": "1"
        },
        {
            "review_text": "The best game!  11/10",
            "review_score": "1"
        },
        {
            "review_text": "It's like Just Cause 2 with boost",
            "review_score": "1"
        },
        {
            "review_text": "Loading goes on for ever, cant get into any servers. Mod is obviously not complete yet, needs work",
            "review_score": "1"
        },
        {
            "review_text": "Really fun. I like it very much, a bit buggy but still fun.",
            "review_score": "1"
        },
        {
            "review_text": "I was driving a speedboat then I hit turbo and it flew into orbit.  10/10 GOTY",
            "review_score": "1"
        },
        {
            "review_text": "Awesome , needs AI added, but other then that its a great buy!",
            "review_score": "1"
        },
        {
            "review_text": "I can wear badass clothes and fly with a boat. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this mod lets a ♥♥♥♥♥♥ game be less ♥♥♥♥♥♥ would reccomend",
            "review_score": "1"
        },
        {
            "review_text": "I haven't had this much fun with a game in a long time, to add the chaos of Multiplayer to the insanity of Just Cause 2 is simply brilliant. The performance is pretty good too, and I didn't encounter any serious bugs, so I can definitely recommend this mod to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "It crashed after a while,needs to get sorted",
            "review_score": "1"
        },
        {
            "review_text": "Love it! Just love it!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Multiplayer.The Best Is Graplling Hook so you can fly with your friens and get to the high building.the second you dont need to have good pc just 2 gb of Ram and 512 Grapich Card what is not really big req.Good Grapich just 10.00% score",
            "review_score": "1"
        },
        {
            "review_text": "This is some crazy ♥♥♥♥♥♥♥t 10/10",
            "review_score": "1"
        },
        {
            "review_text": "best multiplayer mod EVER!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "awesome mod(i have being waiting for it after 4 yearsLOL ",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "ITS JUST AMAZING LOAL ",
            "review_score": "1"
        },
        {
            "review_text": "gaben has blessed us with the Turbo Key.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, why haven't you played this???",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE It",
            "review_score": "1"
        },
        {
            "review_text": "Good game for a group of friends. server mods are decent enough on most servers.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun especially with friends. Gather one, two, or maybe even a few more friends and play this.",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 2 was a phenonemal single-player game. The MP mod does not lose any phenom, and delivers what it promises. I had figured that with large player counts the servers would have an unclean latency problem. Not at all. The players themselves have all been very patient with me (I occasionally had to ask what the code was to teleport some place) and seem friendly enough. My only issue is that there seems to be no NPC's or other AI. This is minorly noticed due to the high amount of server activity. I picked up JC2 for 2.99 and would gladly have paid more. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun :P",
            "review_score": "1"
        },
        {
            "review_text": "Can't play without actually owning Just Cause 2. Used to be able to play if the game was shared. This disappoints me but its fun nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best thing I've played in a while. It's complete insanity.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "So much action!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Pure, unadulterated mayhem. No excuse for not trying this if you have JC2!",
            "review_score": "1"
        },
        {
            "review_text": "The gods were all like, 'Alright lets just kinda make this mod.'. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I'VE NEVER PLAYED JUST CAUSE, AT ALL. HEARD ABOUT IT ON YOUTUBE, WENT AND BOUT THE GAME FOR 3$ TYHEN DOWNLOADED THYE MOD. IT'S VERY COOL. HUNDREDS OF PEOPLE JUST DOING WHAT EVER THEY WANT. I WAS HAVING A BLAST.........THEN THE GAME CRASHED. I SENT IN THE REPORT PUT MY EMIAL IN THE HEADER AND LOADED IT BACK UP KNOWING THAT THE MOD IS A WORK IN PROGRESS. I'VE HAD THE GAME FOR ABOUT 4 OR 5 DAYS NOW AND THE GAME HAS CRASHED AT LEAST A DOZEN TIMES. EVEN JUST STARTING A GAME AND IM FREE FALLING, WHOOP GAME CRASHED SEND REPORT........YET AGAIN. I'VE TRIED EVERYTHING TO GET THE GAME TO WORK......TO NO AVAIL :(:(:(:(:(:(:(:(:(:(:(:(:(:(:(::(",
            "review_score": "1"
        },
        {
            "review_text": "If you ever want something randomly amazing, here you go!",
            "review_score": "1"
        },
        {
            "review_text": "Nicely done fan-made multiplayer mod for a great game!  Pros: -Multi for JC2 - isn't that enough? -Server making is really good  Cons: -No npc-s (yet) -Crashes (understandable, this mod just came out)  ",
            "review_score": "1"
        },
        {
            "review_text": "The only game where I can use the term 'surf a flying boat' seriously.",
            "review_score": "1"
        },
        {
            "review_text": "while everyone's having fun with this the only draw i find is the sheer number of people ♥♥♥♥ing with you every step of the way no matter where you spawn in whatever server. i have yet to find a server that allows me to actually see what players are doing smoothly, rather than with an enormous amount of lag and quite frankly ♥♥♥♥ this ♥♥♥♥ cos i really wanted to enjoy it. it is fairly enjoyable but its ♥♥♥♥ing laggy to ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "If you can stomach the frequent inexplicable crashes, what you have here is a demented and hilarious sandbox that'll entertain for hours.  It doesn't have the complexity of GTA Online, but it brings grappling hooks and free vehicles so what's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game to play for about an hour or two and then not play for several months. Worth the $2.49 I got it for.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun! The prim reason I picked up Just Cause 2.  Driving around with friends, smashing up cars and all that - can't beat it! It's stuff like this that makes you wonder why it wasn't in the game to begin with.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely dirt cheap, beautiful, exciting, chaotic and life stealing.",
            "review_score": "1"
        },
        {
            "review_text": "Great Mod, When SinglePlayer is Boring, Play This!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game. Best time I've ever had in a mod since GTA:SA multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Don't take it seriously, and go on it with friend for max fun.",
            "review_score": "1"
        },
        {
            "review_text": "best game on steam",
            "review_score": "1"
        },
        {
            "review_text": "Great mod is great if you like games like gta and saints row ",
            "review_score": "1"
        },
        {
            "review_text": "This is what hell and utter chaos means.  Just Cause 2 is a cheap, huge, and rather ♥♥♥♥♥♥♥♥ game were you do tons of stuff, but spend most of the game blowing things up. Now think: Would it be fun to do that, with 10.000 other players?  Oh boy, if it was, and still is. When this got released on Steam, some servers where 100% full, and some of them had the limit of 10.000 players. Now stop there for a second and think, because THIS is what GTA Online should have been. Not that crappy 16 limit-players ♥♥♥♥♥♥♥t.  There are no rules in this game. The map is huge, and it's filled with complete war-zones, with over 500 players killing each other for no reason. There are races, dance parties, and even Limo-demolition-derby matches. F#CKING LIMO-DEMOLITION-DERBIES, DO I NEED TO SAY MORE!?  This game turns into the best game ever when you actually get friends to play it with. You can go arround, with 10 people hanging of a combat helicopter, while the driver rains hell on the people under you, while you and your friends just shoot each other in the face. You can surf police-cars that reach 800km/h. You can even crash in the Lost island, and try to survive while one of you guys plays as a Sniping camping hunter.  Proper reviews can't review this mess. But I'll tell you, it's a hell of a mess, the one you end up loving. I would keep it playing, if my good computer didn't exploded, and my back-up one didn't had so much FPS-Drops with the game. The Multiplayer is free, and even if it needs the actual game, the game itself is cheap as ♥♥♥♥. There's no excuse to join the madness, and crash tanks into people's faces.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good mod, but it's unstable as hell. Recomend it, but it crashes all the time",
            "review_score": "1"
        },
        {
            "review_text": "My god, this game is a bit too crazy.",
            "review_score": "1"
        },
        {
            "review_text": "EVERYONE GET THIS!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "THROW your 2 bucks at them when this game's on some kind of sale and you won't regret it",
            "review_score": "1"
        },
        {
            "review_text": "GTA style awesomeness with grappling hooks and parachutes; a humerous and fun time",
            "review_score": "1"
        },
        {
            "review_text": "Was really excited about this and looking forward to coop with friends destroying the world and playing through the game. one can only hope this will be an option in the future.Disappointed",
            "review_score": "1"
        },
        {
            "review_text": "just try attaching a silverbolt to the bottom of a helicopter and try to take off whilst being carried... things get messy  just cant seem to alter server settings to destroy stationary vehicles... or infact any vehicle which kinda makes destruction derby pointless at this time - but it might just be me as it is the first server I have ever hosted  hours of fun to be had attaching random items to things... how long can you get a chain going?  also remember to set the bonus for PKing to something stupid, just to add an incentive...",
            "review_score": "1"
        },
        {
            "review_text": "I would say this is just amazing. Freeroaming, Guns, Explosions, Killing, Being Killed, and spawning in every vehicle.  There is only 1 bad thing about it though. Crashing. Oh well, at least the developers of the game are fixing this!  My Personal Score: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I surfed on top of an ice cream truck travelling at 700 km/h only to be clothes-lined and insta-killed by a low hanging branch!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Words cannot describe the shenanigans I've encountered on this game... Upon spawning for the first time, I was immediately killed by an ♥♥♥ named: trollmaster9000 when he crashed his flying barge into me at the speed of a crackhead! Get this Mod! 1000/10",
            "review_score": "1"
        },
        {
            "review_text": "Joins Survival Server Gets 9x rekt Finds enough lockpicks for mini plane with friend is stuck riding on top of jet thru desert pranks friend by kicking him out of the pilot seat w/ no chute friend dies w/ all lockpicks rages defriends blocks never seen again 10/10 would r8 8/8 again ",
            "review_score": "1"
        },
        {
            "review_text": "Played this more than the actual game. - 11/10  ♥♥♥♥♥♥♥♥♥ with good graphics and gameplay - 11/10",
            "review_score": "1"
        },
        {
            "review_text": "press f to boost",
            "review_score": "1"
        },
        {
            "review_text": "this so amazing.you can change your charetor and all the things are freeeeee! ",
            "review_score": "1"
        },
        {
            "review_text": "i dont have quite the requirments for this game but i still find the ability to screw around as a chinaman with guns and the hookshot very fun",
            "review_score": "1"
        },
        {
            "review_text": "needs to get muuuch better. but it's a good start.",
            "review_score": "1"
        },
        {
            "review_text": "I drove a barge down the highway.",
            "review_score": "1"
        },
        {
            "review_text": "this is so much fun wow im loving it ",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should own this.",
            "review_score": "1"
        },
        {
            "review_text": "Went on a road trip on mopeds up a mountain, followed by at least 15 people.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "The game is a bit buggy, but fun to freeroam. No special tasks usually on servers.",
            "review_score": "1"
        },
        {
            "review_text": "very fun, especially boosting. the community of people as a whole are ♥♥♥♥♥, they just run around and kill each other but there are some friendlier people. still amazing mod for an amazing game",
            "review_score": "1"
        },
        {
            "review_text": "Flew helicopter into cliff at 600mph Didn't blow up  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Chaos at its finest.",
            "review_score": "1"
        },
        {
            "review_text": "Lol, whut?",
            "review_score": "1"
        },
        {
            "review_text": "Got on a server Fell down onto pavement Got in car Pressed F Flew into hill Spinning through air randomely  Hilarity insued Fell to ground Died  Repeat.  ",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I've had playing a game with no point ever. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Very happy with this purchase. Its very addicting and a great game to play during a lazy weekend. Some glitches hear and there with the maps, but overall very good. Recommend to those who seek a game to fool around in with friends. 4/5 stars",
            "review_score": "1"
        },
        {
            "review_text": "Why do you play it? 'Just Cause' You feel like it. Free Roam game with lots of fun stuff.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Even with all the flaws, lag, and all that bad stuff, it's amazing that something of this quality is simply a mod. I know what I'll be expecting out of Just Cause 3.  Better than sex",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't gotten this DLC and you have Just Cause 2, you're that one weird kid who buys a cake only to chew on the complimentary doiley. What the heck are you doing? Get the mod already!",
            "review_score": "1"
        },
        {
            "review_text": "this mod contains: -boats as rockets -boats as planes -boats as cars -boats as submarines -racists -people having fetish for black people -anti-semitism -polish -russians -genocide -explosions -rage quitting -debates about how ♥♥♥♥♥♥ COD is -buses doing 360s -flying like a squirrel -ISIS -GUNZ -flying cars  if u enjoy in any of these things GO BUY IT 8/8 m8 i r8 ",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. Great controller support. Have to find a quality server though. But once you find that, let the chaos begin.",
            "review_score": "1"
        },
        {
            "review_text": "me and my friend went around on a server pretending to be the military and calling everyone insurgents and killed them. AK-47/10, would kill taliban again",
            "review_score": "1"
        },
        {
            "review_text": "you can play it and tell me how to bec i dident really understand it",
            "review_score": "1"
        },
        {
            "review_text": "Awesome idea, mediocre execution. The servers are pretty bad (understandable) and the connectivity is abissmal, but otherwise its a cool concept and I certainly had fun with it.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "The reason to get this is in the title.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best thing I've played in a while. It's complete insanity.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun with friends. Just pure mayhem.",
            "review_score": "1"
        },
        {
            "review_text": "Just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Tuktuk, the ultimate vehicle",
            "review_score": "1"
        },
        {
            "review_text": "it dout work ",
            "review_score": "1"
        },
        {
            "review_text": "JC2 Multiplayer is better than GTAV's multiplayer. That says a lot.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "Very Good mod love it",
            "review_score": "1"
        },
        {
            "review_text": "This Is What You Really Expected From Just Casue 2 When It Was Coming Out.",
            "review_score": "1"
        },
        {
            "review_text": "That ♥♥♥♥♥♥♥ Turbo feature.",
            "review_score": "1"
        },
        {
            "review_text": "This is saintly",
            "review_score": "1"
        },
        {
            "review_text": "How 2 play : 1 - Join Nerdcubed's server 2 - Start a roadtrip in Peaceful 3 - Have fun",
            "review_score": "1"
        },
        {
            "review_text": "420/1337 wood grapple again",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. I got this game a few days ago and i LOVE IT!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "I'm flying a boat. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Like a cocktail of GTA online, steroids, explosions and mid-air jet fighter grapple c4 hijacks.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this on sale for 2.50. I bought it specifically for the Multiplayer mod and It didn't fail. This thing is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutley brilliant =)",
            "review_score": "1"
        },
        {
            "review_text": "soo better than anyother open world great eg of the epic times u can have : do shift and boost and having a shootout      720/1000000000000",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 2x1,000. When you get bored of sending the local population of Panau into the stratosphere, you can always send your friends into the stratosphere. Or the Mile High Club. That works too.",
            "review_score": "1"
        },
        {
            "review_text": "What's better then Just Cause 2 you might ask well that's giving it Online!!!!",
            "review_score": "1"
        },
        {
            "review_text": "great mod 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Free awesome multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Best free DLC you can get",
            "review_score": "1"
        },
        {
            "review_text": "You can fly a boat.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, makes the Just Cause 2 experiance so much better!",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun Game I Recommend This Game 100% Great Game",
            "review_score": "1"
        },
        {
            "review_text": "Cheaper, more exiting and more funny than gta v online",
            "review_score": "1"
        },
        {
            "review_text": "Just Cause 3: Multiplayer Mod was announce... get this, then get JC3-MP when it comes out.    Of the Closet   ",
            "review_score": "1"
        },
        {
            "review_text": "1. Join Server 2. Buy Boat 3. /boost 999 4. Fly faster than a plane 11/10 would fly again ",
            "review_score": "1"
        },
        {
            "review_text": "murder asshats in the server, blow them up. and hysterically laugh at their carcass.",
            "review_score": "1"
        },
        {
            "review_text": "Best mod for any Sinlgeplayer game I have played highly recommend this if you are very bored but amused easily ;)",
            "review_score": "1"
        },
        {
            "review_text": "Its free",
            "review_score": "1"
        },
        {
            "review_text": "Better then the actual game",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell.",
            "review_score": "1"
        },
        {
            "review_text": "Micheal Bay's Family: The Game                                                                                                                                                                                                                                                                                                                                                                                          10/10 ign",
            "review_score": "1"
        },
        {
            "review_text": "A bit like GTA V but with alot more, (only in VERY rare cases, cause of using gta v cheats to do anything), action.The graphics compared to some other games are EXTREMELY good. the grappel hook makes it a whole lot eaiser. But gta v is better.                                              HahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahahaHahahahahahahahahahahahahahahaha. You actually believed it didn't you?",
            "review_score": "1"
        },
        {
            "review_text": "It's fun if you manage to join a server with enough people. Most of the time I join one and run around for awhile without seeing anyone. Also, there could be at least some character and voice customization as well as added game modes. Other than that, the game runs smooth and the community is decent.",
            "review_score": "1"
        },
        {
            "review_text": "1. I log into the Multiplayer 2. As I parachute into the airport, the sounds of gunshots and explosions gets louder 3. I never make it to the ground due to the boeing I managed to catch in my chute 4. I then decide to grapple to the bottom of said boeing which works until we begin to race towards the sea 5. The boeing explodes but never fear, I manage to swim to a locals boat and *coughs* acquire it 6. I begin my ardous sail back to shore (turns out that fisher boats aren't that speedy) 7. I hear a sporadic burst of gunfire and turn to see a fleet off choppers descending upon me 8. I desperately mash my keyboard in the hope that I can evade them 9. Through my random hits I manage to press shift.... 10. Hell yes 11. I accelerate from 15kmh to 723kmh in about 4 seconds, at which point, my fishing boat became a missile heading straight towards the choopers 12. I explode and die, but nothing fills me with greater joy than seeing the rapid appearance of death messages of the pilots of the choppers 13. Why did this happen? Just cus... 2... Multiplayer Mod",
            "review_score": "1"
        },
        {
            "review_text": "i r8 8/8 fo thus gume, its very guD 4 u und meh m8 i dunt h8 m8 r8 8/8 m8 dunt h8 my nume is n8 m8 gut b8ed...m8( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)rekt lol( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Totally no glitc-oh and theres a picture of me sitting inside the headlights of my motorcycle.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, its like GTA IV, mixed with Farcry 3 controls are fairly easy, only real problem is there isn't too much to do except fly around and destroy things, an the controls can't be edited (as far as I have found) Fun with friends (less fun without)",
            "review_score": "1"
        },
        {
            "review_text": "You Should Get It, Just BeCause 2",
            "review_score": "1"
        },
        {
            "review_text": "chaotic mayhemic brilliant and explosians everywhere on nerdcubed fansevers its just amazing 100000000000000000 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Its fun",
            "review_score": "1"
        },
        {
            "review_text": "You can destroy random things, kill your friends, destroy cars you like, get another one, fly off a blimp, jump out of the car, grapple back to the blimp, and then get killed by a noobish G9 eclipse using 8 year old 10/10 would happen again.",
            "review_score": "1"
        },
        {
            "review_text": "how do you get this thing called a 'life'",
            "review_score": "1"
        },
        {
            "review_text": "Hell yeah",
            "review_score": "1"
        },
        {
            "review_text": "Theres a RolePlay server, theres a survival server then theres almost every other server which can let you destroy everything and everyone you believe is unworthy of existing on a small, unknown island in South East Asia.  ...Or you could just simply get an Assault Rifle and get into a firefight while a dozen planes and helicopters bombard the warzone.  Epicness: Potentally Infinite ",
            "review_score": "1"
        },
        {
            "review_text": "One of ,y fsvourite hobbies is blowing up my friends with rpgs.  Now I can do it in the game univers too.  So much fun to re-create 9/11 with your friends.  Running over innocent civilians is much more enjoyable with someone beside you in the car.  Also great fun to be a skydiving, tropical midget.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "it keeps crashing on me plz fix this avalanche studios",
            "review_score": "1"
        },
        {
            "review_text": "Its an really fun multiplayer game and the new update just keeps on crashing please please fix this instantly.",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome MP mod is so fun love it cuz of all of the chaos and mods in game just so much fun I can play for hours it take a long time for me to get border just love everything in",
            "review_score": "1"
        },
        {
            "review_text": "This game has amazing servers. Not something i was expecting. Its a very fun game. And multiplayer was very well done.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Not even worth a few cents If you look at the price, it says 'Free' Literally not worth cents b/c it's free",
            "review_score": "1"
        },
        {
            "review_text": "Perfect for up and coming jihadis, strap c4 to ur car, jump out and ALLAHU AKBAR, wait ♥♥♥♥ your supposed to stay in the car and die for your 72 virgins, well ♥♥♥♥ 8/10 Santa Approves",
            "review_score": "1"
        },
        {
            "review_text": "Top Tip - Play on the Nercubed server and type Alienware into the chat",
            "review_score": "1"
        },
        {
            "review_text": "This mod is amazing, it's beautiful. It's fun, getting a cargo plane and getting 10 other people to attach Tuk-Tuks to it.  The only bad thing is the massive amount of crashes. I just played for 30 minutes and the game crashed 3 times. I think this game is way too less demanding, and as a result, it constantly crashes.  But still, this is great. Aside from the crashes, at least.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT ",
            "review_score": "1"
        },
        {
            "review_text": "The reason why I bought JC2 for PC after having it on PS3. Glitchy, but really fun.",
            "review_score": "1"
        },
        {
            "review_text": "A game it is a good game for friends to play but it does crash a lot ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun to play with friend, also boost with boat is nice.",
            "review_score": "1"
        },
        {
            "review_text": "This game is realy cool, just becouse of one thing: Flying boats",
            "review_score": "1"
        },
        {
            "review_text": "Crash into stuff you've never crashed before with strangers or friends.",
            "review_score": "1"
        },
        {
            "review_text": "There isn't many games where I can kill 40 players ant then fly to a club 'a mile in the sky' in a fighter plane that I made randomly exist. Yeah this is great. Only issue is that I start to miss the NPCs and, it crashes a lot but, for a mutiplayer mod its pretty good. Great but, not perfect. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Super fun with friends. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awh frick yeah now i can do stuff i could have done alone",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly, this seems to have fewer technical issues than the root game :D",
            "review_score": "1"
        },
        {
            "review_text": "I FELT LIKE SATAN WAS CLIMBING INTO MY ♥♥♥♥♥♥ THROUGHOUT THE ENTIRE EXPIRIENCE",
            "review_score": "1"
        },
        {
            "review_text": "Looks pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Surfed a on a flying fire truck whilst taking down an airplane with a rocket launcher. 12/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun mod. it reminds me a bit of GTA multiplayer, only better because you can spawn whatever you like. Great mayhem factor.",
            "review_score": "1"
        },
        {
            "review_text": "Great. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very funny to play with friends! :)",
            "review_score": "1"
        },
        {
            "review_text": "i call this mod a What The ♥♥♥♥ mod.  well multi. found allot of trollers and ♥♥♥♥ers for me.  (no offense those ho like this)",
            "review_score": "1"
        },
        {
            "review_text": "&gt;enters a roleplay server &gt;spawns in the middle of a forest with a beach close &gt;it was midnight &gt;sees a abandoned truck, and drives it to the beach. the truck got stuck &gt;sees an option to salvage the money inside the truck &gt;apparently i got 300 money &gt;it starts to rain and me gets wet and gets slowed down &gt;hides under a gigantic bridge  &gt;walks for 30 min &gt;sees somoene inside a taxi &gt;bidiguilo: hi how to get a job? &gt;xXarvinXx: waht job &gt;bidiguilo: i want to be a police can u get me to a police deparment? &gt;he rams me with his car &gt;a helpful ingame tip appears &gt;'Press /call 911 to call the police to your location!' &gt;spams /call 911 &gt;some another guy comes in and kills arvin  &gt;rest in pieces arvin we will not remember you &gt;he began to shoot me with a assault rifle &gt;i tried to steal the car but then the police comes &gt;creamcake123: hey paulogamerBR what u doing  &gt;paulo manages to kill the officer and me  10/10 roleplay server simulator",
            "review_score": "1"
        },
        {
            "review_text": "keeps crashing 10/10",
            "review_score": "1"
        },
        {
            "review_text": "whoo so much fun",
            "review_score": "1"
        },
        {
            "review_text": "I Love the game but. ever since the last update ive been crashing everytime i launch the game.  Pls help i have a AMD Procceser",
            "review_score": "1"
        },
        {
            "review_text": "cant join my own server",
            "review_score": "1"
        },
        {
            "review_text": "Get in server with friends jump and ride on top of friends single propller plane jfc this is just like Sonic Adventure  10/10 would pretend to be Sonic and Tails again.",
            "review_score": "1"
        },
        {
            "review_text": "Decent, but crashes on amd's newer video cards cards.",
            "review_score": "1"
        },
        {
            "review_text": "I played the everliving crap out of this game on the Xbox 360. I picked it up on sale and got the multiplayer mod. Needless to say, I do NOT regret it. Fell in love with it as soon as I realized I could fly a boat through the air at 700KM/H... The amount of chaos you can perform on the campaign is multiplied ten-fold on multiplayer. It got so ridiculous I clipped into the wall of the airport after flying a garbage barge at the speed of light into the airport hanger. (Basically, it's awesome.)",
            "review_score": "1"
        },
        {
            "review_text": "Steam: Do you recommend this game? Me: *CLICKS ON YES SO FAST BREAKS MOUSE*  My first ten minutes: Dude what do I? I've never played this before. HOLY BISCOFF IS THAT A BOEING?! YES, YES IT IS AND ITS COMING RIGHT AT ME!!! RUNNNNNNNNNNNNNNNNN!!! (my friend is flying the boeing) NONONONONONONONO!!!!! BOOM  This game is hilarous and fun and is great and wonderful even if you've never played just cause 2 by itself (I recommend you play this and just cause 2 if you like explosions)",
            "review_score": "1"
        },
        {
            "review_text": "This is so much fun to stuff around in for hours on end. Get some friends (or even some randoms) and get an idea and keep trying until you do something hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "Best mod I've played to date. Great for goofing around or even some RP. What ever you're into, this mod has plenty of possibilities!",
            "review_score": "1"
        },
        {
            "review_text": "Best multiplayer game :)",
            "review_score": "1"
        },
        {
            "review_text": "pretty wild",
            "review_score": "1"
        },
        {
            "review_text": "Depending on the server you choose to jump into, the ensuing mayhem is always enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "cool beans",
            "review_score": "1"
        },
        {
            "review_text": "this game crashes on windows 10 (for me at least) on startup  but if you can get it to work its like just cause 2 with more people. it's good.",
            "review_score": "1"
        },
        {
            "review_text": "Crashes after crashes. Reasearch it online and nothing helped........  [update] will not work on Win 8++ . Latest window what suport this multiplayer is win7",
            "review_score": "-1"
        },
        {
            "review_text": "Crashing everytime, i think it might be because this game is ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "oh wow. don't let all these reviews fool you. they are way too positive!  me and my friends went and tried this game out, and we spent about 50% of the time trying to group everyone together, then we spent 20% murdering eachother and the rest trying to figure out what to do. there are these servers where you can build some type of base... but for what purpose? and there's also factions, which is.. cool i guess. the whole map is really empty and the crippling reality of having nothing to do hits you hard, boi!  to put it short... don't waste your money on the game just to play multiplayer. i'm sure the singleplayer is fun, but def not multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "Why i can't play Just Cause 2 : Multiplayer mod?",
            "review_score": "-1"
        },
        {
            "review_text": "Can't",
            "review_score": "-1"
        },
        {
            "review_text": "my pc should run this perfectly, without a breeze, but for some reason it crashes in game, doesnt load the in game menus but yet plays the non multiplayer game without a sweat? lmao",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not so good to me but it is kinda fun when you die your guts and bones come out its a bit stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "#Crash simulator 2015",
            "review_score": "-1"
        },
        {
            "review_text": "this is ♥♥♥♥ it stopped working after 2 weeks",
            "review_score": "-1"
        },
        {
            "review_text": "bad game it gave me bluescreen not good game bleh",
            "review_score": "-1"
        },
        {
            "review_text": "This was fun, untill i got ganged up on, every lobby i joined. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "it doesn\\'t work correctly for me",
            "review_score": "-1"
        },
        {
            "review_text": "I can't get it to work it comes up but then it just goes black and nothing happens ever.",
            "review_score": "-1"
        },
        {
            "review_text": "No shooting horses are in this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "The idea behind this mod is just ungodly great, but the execution of it just isn't that good. Multiplayer removes civilian traffic and cops(IIRC) altogether. Good servers are rare. Some multiplayer-unfriendly game mechanics become apparent with this mod. For example, if you want to have a dogfight in jets, you will have a very hard time keeping an eye on your opponent, because they dissapear after a short distance.  Overall, it had amazing potential, but i am dissapointed in the result.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful. Mexicans spawn kill you with machine guns and its a giant deathmatch. I was looking forward to explore the island with friends but i just endup getting killed by butthurt mexicans. It was a bad idea in the first place.",
            "review_score": "-1"
        },
        {
            "review_text": "I would rather recondition my ♥♥♥♥ witha tap and die set then Play this game any more.",
            "review_score": "-1"
        },
        {
            "review_text": "very good game just got it but when i open just cause multiplayer and when i go to look at server list theres no servers help me please",
            "review_score": "-1"
        },
        {
            "review_text": "Its a Scam. Why? Because there is NOT 1 WORD about all the Bugs in the Description. Its in an Early state, I know that because i followed that Project long before it came to Steam. But from what i see on steam i would never have guessed it would be such Bugfest. Aside from the Bugs and the Lags that are haunting some servers. The Description is also VERY MISSLEADING. The 'Chaos' of normal Just Cause 2 comes from Hordes of AI fighting you every time you attract their attention, BUT THERE IS NO AI IN MULTIPLAYER. At least i have not seen any. All in All a good idea. But early stage. And the marketing is questionable at best.",
            "review_score": "-1"
        },
        {
            "review_text": "crashes every 3 mins.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing at all what I expected, this mod simply lets you start your own UNPOPULATED server with up to hundreds of friends. But lets be real... Who has hundreds of COOPERATIVE friends? Sure you can join one of the majorly populace servers, but then you're going to get killed, you know it and I know it.   Just Cause 2 is a great game, don't get me wrong. But I got it specifically so I could enjoy multiplayer with friends hoping we could hookshot parachute across the island doing missions. However, as it stands, this mod is severely lacking. All effort is appreciated, but this is not a cooperative sandbox, this is an unpopulated slaughterfest.",
            "review_score": "-1"
        },
        {
            "review_text": "Not interested as you cannot play the game cooperatively in any way. The world is completely empty of all NPC's or missions, and it would've been a blast to play against all that with someone. Until that is possible, I'm just not interested.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a very laggy game so i stopped playing. only great if u hav high internet connection or a perfect gaming computer, dont bother then. also there is friendly fire so there are many spam kills. its hard to move around and teleport gets laggy but theres always someone there waitng to kill u. PRIVATE LOBBIES WOULD BE GREAT.",
            "review_score": "-1"
        },
        {
            "review_text": "For many people, crashes after just a few minutes of gameplay. If you're lucky you can go 20 mins before a crash.",
            "review_score": "-1"
        },
        {
            "review_text": "So, here's something fun I discovered that I wish I had known before getting JC2 just for the multiplayer:  There are no NPCs in the multiplayer mod. No cars driving around, no soldiers, nothing. Apparently, according to the mods, 'it's impossible to synch the NPCs' and the best you can do is download a script that may or may not make the game insta-crash.  Damn. I wasn't aware that synching NPCs across two players was an impossible feat! I mean, it's not like in any multiplayer game before or since could have NPCs or cars driving around between people! Obviously in Gmod when I spawn an NPC it doesn't show up to my friend because it can't synch! Obviously, there has never been a co-op game that wasn't completely desolate because it is just impossible to have AI synch up between two or more players. Or hey, in World of Warcraft, it's PVP *ONLY* because there is just no way to synch the AI together between more than one player so you can't fight AI together with your raid party, right? ........  Yeah, big ♥♥♥♥ing thumbs down for this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "i havent downloaded it yet",
            "review_score": "-1"
        },
        {
            "review_text": "Keeps crashing.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so ♥♥♥♥! ♥♥♥♥ this game, it is the worst thing since Pröpel's music. I never wanted to kill myself more than any time that whenn I received this ♥♥♥♥ing game. ♥♥♥♥ the creators of this game you should go die in a hole with the tablet selfie girl. she will ♥♥♥♥ your ♥♥♥♥♥♥♥♥ with her imaginary ♥♥♥♥ing ♥♥♥♥. and you will ♥♥♥♥ing love it in your ♥♥♥♥ing ♥♥♥. I don't even know what the ♥♥♥♥ I am typing anymore cause this is a ♥♥♥♥ game and should have never been made. I want a ♥♥♥♥ing refund for this ♥♥♥♥. Also this game is so ♥♥♥♥ cause it is not even in 1st ♥♥♥♥ing person. who the ♥♥♥♥ wants to play a game like this and not be in first person you dumb ♥♥♥♥ing cucks. and this is just a ♥♥♥♥ing copy of the ♥♥♥♥ing ♥♥♥♥♥♥ ♥♥♥ thing that I don't know the name of cause this person just ♥♥♥♥ing told me about it. and even Harvin thinks that this is ♥♥♥♥. Its like GTA and ♥♥♥♥ing horse ♥♥♥♥ combined. This game you can't even get the hoes/♥♥♥♥♥es.",
            "review_score": "-1"
        },
        {
            "review_text": "It was beta now it's alpha... The mod randomly crashes, commands don't work and you can't do anything because some players will kill you for no reason.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not much use...You can't really progress in the game co-op together. There are just some bad racing games and derby rounds, which is done better in games designed to do them. Collision detection is so off, and there is very little use in playing this.  If you like dicking around, it's better dicking around in garry's mod or minecraft.",
            "review_score": "-1"
        },
        {
            "review_text": "Load of crap, The mod lags more than any multiplayer game ive played, They should of just released it asap instead of dragging on tests when the community could fix it quicker.   everyone could still play it when they want that way. Give it a couple of months it will get good but not yet.  Played before it came to steam hence the hours.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes too much...",
            "review_score": "-1"
        },
        {
            "review_text": "Not many people online. And the populated ones were just a sandbox of flying around, driving around on land and sea not really seeing anyone else with no real purpose. Other than joining the occasional race with 4 people.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, but it crashes at least twice on every start up.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a fail attempt at S.A.M.P Yes it can be fun, but sadly it lacks anything interesting. most server you just spend time shooting each other.",
            "review_score": "-1"
        },
        {
            "review_text": "It never loads for me...",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes on startup.    0/10",
            "review_score": "-1"
        },
        {
            "review_text": "i played this for 10 hours and NOW I CANT LAUNCH IT BECAUSE WITHIN 5 SECONDS IT CRASHES. I've tried ♥♥♥♥ing everything",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥iest game ever, along with Just Cause 2. The game crashes on my computer and I have tried reducing settings, updating graphics crad drivers, nothing works. Asus mobo, 8gb 1833 mhz ram, AMD 8-core 8350 Black Edition CPU, Radean HD 6870 Graphics card. Hard drive space isn't an issue. If anyone has advice please let me know. The game is fun, until you are shooting at someone or just standing there and it just crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "It's sort of fun, and it's free, so there's no point not picking it up. But the zaniness of playing with other people quickly tires as you realise it has the same problem the singleplayer campaign had: repetition. Other games keep things fresh, oddly enough, by removing sandbox elements and tightly controlling what players can do, so that they learn to do it in new ways. This just makes you realise there's only so many road races, random shootouts, and airport disaster collisions you can be involved in before the game is dull again.",
            "review_score": "-1"
        },
        {
            "review_text": "It's crashed when i open it",
            "review_score": "-1"
        },
        {
            "review_text": "I wouldnt really recommend this game yet until it is released the full version, and yet, may alot of servers may come.   Pros: -Big wide open maps -Like an MMO -Servers are constructed well with order.  Cons: -Laggy, popular, and only one standalone servers like Real Life Roleplay Server. -Only be fun if you play with people you know. -Rules are though strict when it is constructed well with order. -Only few servers are avaliable. -Needs other then Ulars, Roaches and Reapers.  67% out of 100 An Average Score out of 100",
            "review_score": "-1"
        },
        {
            "review_text": "Big Map.  Big Guns.  Big Amount of Griefers.",
            "review_score": "-1"
        },
        {
            "review_text": "Game immediately crashes",
            "review_score": "-1"
        },
        {
            "review_text": "Last update, i cant connect to any server anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game :). Crashing on Windows 10 for me :((",
            "review_score": "-1"
        },
        {
            "review_text": "CRASH everytime I go on this game it crashes. WELL DONE",
            "review_score": "-1"
        },
        {
            "review_text": "Since the game is a good few years old there are only user run servers which is a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "'JC2-MP has stopped working' is now burned into my retina, permenantly.",
            "review_score": "-1"
        },
        {
            "review_text": "pretty dead no police online and takes ages to kill people, crashes every 2 seconds",
            "review_score": "-1"
        }
    ]
}