{
    "app_id": 259060,
    "name": "Dominions 4: Thrones of Ascension",
    "release_date": "2013-12-05",
    "developer": [
        "Illwinter Game Design"
    ],
    "publisher": [
        "Illwinter Game Design"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Strategy",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 1208,
    "negative_ratings": 113,
    "price": 26.99,
    "description": "You are a God! You are master and ruler of a loyal nation. You have unimaginable powers at your disposal. You have claimed this world as yours. But there are others who stand in your way. You must defeat and destroy these pretenders. Only then can you ascend to godhood and become the new Pantokrator.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/259060/header.jpg?t=1447359131",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: 1 GHz Memory: 1024 MB RAM Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is, no kidding, the deepest strategy game you may ever buy on Steam. The manual - and yes, you will absolutely need to read the manual old school style - is 295 pages, with the tutorial being about 24 pages of text and images. It's a complex, fiddly game, with a very dedicated community of players. If you can get a good group together, multiplayer is fantastic.   I will warn you that the game's UI is obtuse as Hell and the graphics will really put your dedication to 'gameplay over graphics' to the test. If you've never played a Dominions game, then be prepared to go down the rabbit hole of strategy.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite strategy games. Incredible depth and variety of gameplay, lots of varied nations and strategic options, great multiplayer support, interesting lore and backstory. Don't be turned off by the graphics, the game is at it's core an incredibly replayable in depth hardcore fantasy strategy game pulling it's inspiration from classic myths and legends throughout history.",
            "review_score": "1"
        },
        {
            "review_text": "Look past the graphics, it's all about the insanely deep strategic gameplay in a fantasy world.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best game you've never heard of.  Steam kept recommending this game to me based on other games I played, and for a long time I ignored it because I expected better graphics from a game this expensive. Then it went on sale one day and I took the plunge, and I haven't looked back since.  Dominions 4 is a turn-based strategy game about warring nations each ruled by a mythological entity (titan, monster, wizard, etc) that is trying to become a god. In the most commonly played game mode, this is accomplished by capturing a certain number of Thrones which are scattered around the map. In addition to granting victory points, each throne also gives some kind of bonus to your nation when you claim it.  There are dozens of different nations to choose from, and while the diversity keeps things interesting, balance seems to have unfortunately been a secondary consideration, and some nations are really better than others. Once a nation is chosen, the next step is to create your pretender, the previously mentioned creature that's trying to become a god. Each nation has a dozen or more pretender options to choose from that fit that nation's theme. So nations with a Norse theme can choose pretenders like frost giants or giant serpents, while Greco-Roman nations get a variety of different titans and monsters like the Manticore. Each pretender is also highly customizable, and how you build your pretender can have an enormous impact on how you play the game.  Once the game actually starts, turns consist of recruiting units from the territories you control and sending them out to conquer more territory. Which sounds simple, and even seems simple when you first start playing. But soon you realize there's a TON of strategic depth to this game. When you tell your units to attack a province, you don't control the battle directly. Instead, you issue the orders that you want your units to follow during the battle before the battle starts. So you might tell your frontline sword-and-shield infantry to take up a line formation at the front of the battlefield, hold position for the first two turns of combat, and then advance on the enemy, while your archers stay behind with orders to fire on any flying enemies that appear, for example.  You also recruit mages to perform your research and cast all your spells. There are literally hundreds of spells to research, which creates untold opportunities for play and counterplay - like I said, strategic depth. Again, balance doesn't seem to have been a primary focus here, and the fact is that many spells are rarely if ever actually used in competitive games, but it's always interesting to encounter spells you haven't seen before, or familiar spells used in new ways.  Bottom line: if you're a fan of complex turn-based strategy games and don't mind a steep learning curve, Dominions is as good as it gets. I started out playing single player exclusively, which is fine if that's what you're into or just looking to learn the ropes, but multiplayer is where this game really shines in my opinion. I would be remiss if I didn't point out the game's flaws as well, which include the general lack of balance I've mentioned before, the frankly unimpressive graphics, and a UI that often leaves much to be desired. That said, the good outweighs the bad here, and while the normal price point might be a little high given the lack of polish, I highly recommend grabbing this game when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I have not written a review for this yet? Hmm.  Dominions 4 is a True Fantasy game. The worlds are remind me of the world of Conan. You build armies, attach them to Leaders, and set forth to conquer provinces. Each province will add to your money per turn. Yes, it is Turn Based! YAY! Each faction is Very Different. Each deity can be configured in many different ways. There are spells, but mainly this games is about armies!  Spreading the Word of your chosen pretender deity is important. This can be done with temples you build in a province or by priests. Look out for Assassins! There is a nice small selection of buildings you may build in your provinces.  The AI can be quite a challenge. MASSIVE armies will clash in heated combat! Although you do not control your armies in combat, your pre battle setup is important.  The Thrones of Ascension allow you to capture cool resource areas. You can even win by owning a good number of them.  High Fantasy is awesome in this game. It is a little basic as games go, but this is one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "Dominions 4 is like shagging: your first time is very confusing, you are not sure what to do and how to do it and it ends before you get a grasp of it. But as you keep playing you get better and start to enjoy the complexity and beauty of the game. o/",
            "review_score": "1"
        },
        {
            "review_text": "If, for some reason, I were told I could only play one game for the rest of my life, this would be it. The variations are endless, the strategies multi-faceted, and the world background is beautifully crafted.  If you are a grognard, you must have this game!",
            "review_score": "1"
        },
        {
            "review_text": "An absolute masterpiece and highly recommended for any strategy and fantasy fans.",
            "review_score": "1"
        },
        {
            "review_text": "The most complex game in the history of humankind. If Civilization, Dwarf Fortress, and 2nd Edition Advanced Dungeons and Dragons (with its myriad sourcebooks) had a baby, this would be it.  You will play. You will lose. You will play again, and lose in a different way. Your people will be poisoned and plagued, and you won't know why. The next game, you'll poison and plague your enemies, and lose anyway. You'll try playing as unstoppable giants. You'll lose. Then you'll play as frost giants against a Roman Empire that falls apart in the cold. Maybe you'll win, maybe not.  Then, when all else fails, you'll play against the most deadly enemy of all... a human.",
            "review_score": "1"
        },
        {
            "review_text": "Dominions 4 is a strategy game with no single-player campaign. It's all based around huge-scale single wars with the goal of becoming chief God, in single or multiplayer, that just escalate in scale as they go on. What starts with armies of dozens stabbing with swords and flinging basic magic spells like flickers of fire soon escalates into hundreds and thousands of troops clashing, with mythical beasts of various origins roaring and rampaging as ancient wizards call down great storms that rock nations.  The gameplay involves managing your nation. After designing your pretender God you choose what to recruit with recruitables divided between normal troops and commanders who can control different amounts of troops. It's a little more complicated with that but the game is easy to pick up. You then direct your commanders across a world map, taking over, reinforcing and just conquering the whole damn world.  There is a lot of variety in what you can play and how you can play. You choose from playing in the early ages, middle ages or late ages. The later the setting, the less magic there is in the world but the more advanced technology is. Playable nations come from a huge variety of influences. Some are historical, some mythological, some fictional and others more original. Only in this game can you play Three Kingdoms-era China battling a Lovecraftian army of horrors.  Overall, it's a very deep game but easy to pick up, with tons of content that any strategy fan should pick up!",
            "review_score": "1"
        },
        {
            "review_text": "600 hours in almost 3 years :-)  Before I have tried multiplayer I have never even read the tutorial or visited the forums. Basically that meant that I have played it using only the most obvious magic ( e.g. fireballs, summon elementals and such ) and concentrated on learning troop strengths + weaknesses and developing battlefield tactics. I've propably spend 200 hours playing one nation in one age: Machaka in middle age. Why? It was one of the first I have tried and it had Zulu like warriors riding giant, no sorry GIANT Tarantulas. I've read many reviews and nobody writes about the terrifing noice those tarrantuals make, when they chomp their victims...Or how almost every spell has its own sound so the battle is like a strange symphony :-)  Other things people don't mention: 1.The developers are commited to make the game even more deep and complex, BUT they are also commited to cut on micromanagement where only possible, for example: to reaserch magic, to buy a new mage (this with a castle 90% of the time), to perform a magic ritual ( e.g. send winged monkeys to enemy province and capture a comander; summon bunch of ogres or dragons ), to send a magic item from one end of a map to another, to access the gem treasury (gems are needed for summoning monsters, crafting magical gear and using more powerfull battlespells), to send blood virgins to the central dungeon (you'll find out yourself what THEY are for, you rascals, you), to make the magic gear and maybe for few other things as well,  you need ONLY ONE BUILDING in that province! In other games you would need to buy 7 different buildings because thats the way other games try to achive complexity.  Another example: those troops that have lost their armor during a battle (there are spells with that effect like Rust or Acid Rain) get it back automatically afterwords providing there is enough resources in the province - its so automated that most players have no idea it even takes place!  Another example: in Dominions 3 there was an craftable artifact called Burning pearl(?). It had the efect that the commander wearing it would lose one point of life a turn but you would gain one fire gem. You could give those Burning pearls to all your commanders( after 20 turns maybe 40 of them? ) and then try to keep an eye on them so that you take the magic amulet from them after 9 turns, so they do not die because of it. Imagine the level of micro if you had 150 commanders :-) In Dominions 4 this amulet got scraped, we got Fire in a Jar amulet, that provides the mage with one fire gem during a battle. Nice, elegant solution.  2.The diversity of the game is greatly increased by the aviable mods, especially NationGen. I am currently passionately playing a Hoburg ( essencially warrior hobbits) nation. The blessed, sacred unit is a boar cavalery.They have swords and throw Tomahowks; I gave them fire bless so the Tomahawks are on fire when they whirl towards the enemy! I am sure the Boar's gore attack has a fire element to it as well, but the grafic does not show it :-(   This nation has also a deer cavalery unit, Heavy Infantry with clockwork armour ( there is game mechanic connected with the properties of the armor), a scout that is an assasin as well, flying cavalery with giant hawks and bunch of mages, commanders and infantry which seem vanilla in comparison but would be crazy interesting in other games.  NationGen mod can give you unlimited amount of new, unique nations, including the one where Velicoraptors ride to battle on crocodiles!  3.There is a certain beauty in the way a battle progresses in the game, especially in multiplayer. Before battle you decide how big the units should be (one soldier minimum, I don't know if there is maximum - the biggest I remmeber was 250 soldiers), how many of them and what their behaviour during the battle should be e.g. attack closest enemy or wait 2 turns and attack the archers and so on &gt;&gt; about 20 possible combinations. Making those decisions, you will face tradeoffs like: do I make one extra small unit and order it to guard my precious commander but this will result in small morale penalty for all the soldiers this general has under him.   When battle replay starts (you have no control over the battle during the battle) you see how different units move on the battlefield, how when they touch some of them melt under the assault like snow on lava, others stand the groung like a stonewall. Units get mixed with each other; some catch fire others get paralyzed; buffing spells change their color or opaqueness; they get covered and traped by nets, vines or the earth itself. You see how a line of tough, armored, veteran infantry sloughters the cheap militia before them but there is 4 militiamen for every veteran. In the center there is 1v1 fighting but militia gradualy envelops the flank of veterans. The last warrior in line faces suddenly 5,6 militiamen- he fights and dies, then another, and another. You see how the flank of the falange is crumbling, you see how the militia is about to anihilate the veterans (while losing 50 % of their number) when suddenly 5 tarrantula riders charge the militia. Their god pretender blessed them with weapons that are on fire and they make use of it. The giant tarantulas cover the enemy in spider webs, inject them with poison and terrify you with otherwordly screeching. The militia breaks, runs away only to get massacred by the pursuing spider cavalery. The veterans break and flee to - from a 30 man unit there is only 6 left and every one has a battle affliction: missing eye, crippled leg or unhealable chest wound. One of them has 7 afflictions and his stats are worse than a blind militiaman's. If only there was a way to kill him it would be a mercy. But there isn't so in next battle he is going to be part of the Archer Bait Unit...",
            "review_score": "1"
        },
        {
            "review_text": "I still suck at this game... but the level of depth in this game, on more levels than that of the gameplay itself, is amazing. I would not be surprised if I've only ever finished a single game of Dominions 4, before roleplay goals I set for myself before I started to play were achieved. I can't support the developers enough, in the hopes that one day Dominions will blow up and get a game with the level of depth we currently have but also with the aesthetics such a game deserves.",
            "review_score": "1"
        },
        {
            "review_text": "Man, a review huh. I wasn't expecting much from this game as I've bounced from 4x to wargames, and back again over time never really being that impressed. So let me write a quick love letter to this one, that I've been hopelessly addicted to over the past several days despite its flaws.   This game does not compromise on what it's supposed to be. It's a lovesong to the heydey of the past, and it's built without regard to any mosquito-like whining of the modern age. It never adapted except maybe to make controls easier, and it's so easy to love for it's somewhat rustic charm. If you played this sort of game in 1998, you will be well at home here.   It treats graphics as though they were petty things for lesser purveyors of the arts. Instead, each and every facet of the game is just rich with an 11 herbs-and-spices of flavor. Every 'pretender' God is interesting to read about, as is each civilization. As far as I can tell, they're all derived from one collection of lore or another, but they're adapted in such a way as to be interesting. Do you want biblical fanfiction? Norse mythology? The Deku tree? There's something for everyone here, and none of it is compromised to plebs that tend to fill modern video game audiences.   Let me also mention the depth here. This game is so incredibly deep that many complain about it. As a caveat, the depth may not be entirely perfectly crafted. I feel there are some imbalances between the value of units, and the sheer amounts of spells makes it unreasonable to have a good grasp on what any given casters capabilities are. However, I kind of enjoy the 'fog of war' this creates, and as my group of bros got this on sale, we're all kind of on the same curve.  DO BE AWARE. There are a LOT of things in this game that are never explicitly explained, and I absolutely recommend looking up a guide. I watched the first 5 videos in this guy's guide:         YouTube™ Video:  Dominions 4 Gameplay Tutorial Pt 01 (Intro and Setup)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It's graphically primitive -- downright ugly, even. The number of units, attributes, spells, and even the number of nations might be intimidating. The AI isn't exactly good at managing all that complexity, so if you're playing well and don't handicap yourself it won't be a great challenge. The developers are great at adding character and factions -- they love mythologies and it shows -- but sometimes not quite as good at maintaining balance.  However, there's a multiplayer scene and if you're not into MP (I'm not), you can treat it as a lovely magic-heavy sandbox with a ridiculous number of toys to play with. There aren't too many games in which you can raise a Hydra, magically give it the ability to lead troops, and then make him the prophet of your faith; or to take a Hoburg (think Hobbit...), give him a magical item that makes him larger, and then give him boots to (literally) walk all over his enemies. Or, say, for irony's sake summon an a powerful angel and equip him with weapons and armor gained only with the extensive sacrifice of virgins... if you want to play a drunk, demented (or both) god, this might amuse you. I find outlandish prophets and strangely geared units funny, and I'd rather drink instead of methodically optimize my research and armies, so this is what I tend to do.  If you'd rather play it straight and less goofy, and you want competent opponents, then there's the multiplayer mode -- either via PBEM, or with one player hosting a server.  While the game doesn't support Workshop mode, it's quite moddable (sprites and text files) when it comes to adding new units or factions or modifying existing ones. If you and your friends think that some spells are completely unacceptable, you could mod the game to make them inaccessible. Too cheap units could be made more expensive. And so forth. Heck, if you wanted everybody to start with a single-use unit named 'Nuclear Missile' that could teleport 10 provinces away and cast a kill-everything-on-battlefield spell but would vaporize after its first battle, you could -- you'd need to define the slay-all spell (presumably called 'Explode' or 'DEFCON 1'), create a unit with desired stats and a trait that makes it die after a battle, and rig it to autocast the spell when battle starts; and then you'd mod the starting forces for each faction to include the missile unit. It'd be a rather strange game, but you could.  And so forth.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's a labor of love that shines brightly for its depth, complexity, flavor, charm and moddability.  I originally found Dom3 (its predecessor) when I was looking for a suitable spiritual successor to Master of Magic, and while it's not quite 4x, it does scratch a lot of that itch, while bringing you into a whole new world of gameplay that is now its own itch.  Don't be put off by the dated graphics; there is still no game like this one, and it is definitely worth your time and money. The devs continue to keep up with it, adding new content and expanding its modability, and it's worth every bit of the price.  (Time played note: I don't think I need to say this, but you can probably guess that it is not the Steam version I have played. I have played and modded hundreds of hours between Dom3 and Dom4.)",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn based strategy games and can look past the old fashioned graphics, this game is for you. You create a pretender god, select a race (out of more than 75) based on our worlds mythologies and off you go! Ingame the possiblities are almost endless. Do you want to turn a simple goat, who was donated to your temple by a poor farmer, into a death mage, riding the winds on his magical carpet all the while wielding a battleaxe with a copper arm you mounted on its body and commanding an army of frostgiants? Well, with this game you can! With more than 2000 different units and monsters, over 800 different spells and over 300 different kinds of items you can do about anything!",
            "review_score": "1"
        },
        {
            "review_text": "The Dwarf Fortress of turn based strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "An EXTREMELY over complicated 4X game based around ancient mythology, history, and H.P. Lovecraft. You start out the game by choosing a map, age, empire, and then making a god. The game consists of three playable ages that show the development of the playable empires. The early ages have Magical and Nonhuman factions in abundance, while the human factions of the time are just discovering Copper and Bronze. This age also has the greatest amount of Magic, but also the least organised casters. The second age is marked with Human factions beggining to subjigate the assorted nonhumans with weapons of Iron and Steel augmented by enchantment. This age has a moderate balance of Magic and Organised casters. The Third age is a time were Man has all but destroyed the magical wonders of past ages. Magic is nearly drained from the world, but well organised wizards make do with what is left. After you choose your age, you choose your empire, Then make your God. Your God making sets how you will spend the next several hours of your life in this game. You select an available Deity for your faction, then get to choosing how strong it is in magic and what bonuses you get in lands were you are believed in. Say you're faction has very good yet expensive troops, yet poor magical researchers and practitioners so you can't get any late game spells, you would make your god have a dominion that boosts production and can cast what you need to be cast. FINALLY you are in the game after setting a few end game goals and options, and the real complicated hell begins. I think im going to stop soon so I am going to make this as simple as possible to summarise what you do in the actual game. Your first play through will just be throwing bodies at other bodies till you win or lose. Though what makes the game fun is the magic. One magician with some magical items and gems can single handedly destroy a quarter of an army, but what makes it complicated is knowing the exact stats of those items, spells, and how much your caster can take before fainting. I think this is way to long already and if anybody reads this far then I'm sorry if this was a mess. If you want to take the time to learn about this game and such then by all means get it.  (Alright, I've started playing multiplayer) The multiplayer in this game is really fun, but reaaallly slow. It work's on a basis of recieving emails for your turn, and sending in emails when your done. In that time it takes for everything to get done though, you can talk in depth with the people playing the neighboring nations. So pretty much the single player portion lets you learn the game and play it casually, while the multiplayer game gives you an entirely different experience with the same nations you've spent hours learning how to play and counter",
            "review_score": "1"
        },
        {
            "review_text": "Yes,yes and yes! If you like strategy games and Cosims and can live with simple grapics.Complex, game design shows deep thinking.Several hundreds of game changing spells, hundreds of units, outwit your opponents on the field, use assasins, unleash devastating spells on their realm.Sent agents, poison the wells,curse them! Necromancy, demons, angles, titans, mighty warmachines might appear and cause havov.Watch your carefully nurtured army to be smashed in minutes by your own panicked elephants.Hooked since months in my online group.^^",
            "review_score": "1"
        },
        {
            "review_text": "Here are numbers and jpgs. Thats it. 'Whats the plot twist?' you ask. Well, I hope you like sheer CONTENT, because this game will drown you in it, never to see the day again, because some ♥♥♥♥♥♥♥ just casted utterdark. Welcome to Dominions 4, where dreams and horrible, horrible nightmares come true.",
            "review_score": "1"
        },
        {
            "review_text": "If you want a deep strategy game that takes you hours to learn, more hours to master, and countless hours of fun, buy this game. I also love the historical mythology flavor of all the units. I have spent hours in this game and the previous just reading descriptions of them!",
            "review_score": "1"
        },
        {
            "review_text": "Dominions 4: Thrones of Ascension It's not you're average stratagy fantasy game, no. Most of the civilizations for example, are based on historical civilizations but are changed to suit a more mythological theme. Meaning, you wont be fighting elves, orcs and dwarfs, but rather giants and lizard men. And the use of priests and religious figures is also an almost prominent factor of the games main objective.  Story: The god of all has vanished and in the abscence of this supreme being, many 'pretender gods' have risen to take the throne above all. These pretender gods will raise armies, and fight eachother in brutal combat to ensure claiming the throne for themselves. You play as one of these pretender gods. You must claim the thrones of ascension to accomplish the goal of winning the game, however, you can also just dominate the land with your mighty armies.  How it plays: This game plays very much like a board game. You can see the map on a birds eye scale of the world and you can move different units to different settlements in a turn based manner where they can perform different tasks. Such as, spreading your dominion (being your influential power over different areas), killing off rebel forces in nearby areas or build temples, forts and castles for extra deffensive capabilities. This game can be delightfully tactical.  Units: There are many different units in the game. Each civilisation often has their own unique ones. But your pretender god is the most powerful a lot of the time. You can take your pretender god into battle, and it can increase the fear of your enemies more than anything which makes them more likely to flee the battle. Which is what happens a lot of the time, usually not all enemies get killed, they eventually run away. But the pretender god can be good for ensuring success in risky battles. There are then more weaker tier units you can simply use as cannon fodder, because of how cheap they are, resource wise. And then there are more powerful infantry and calvalry and as well as more powerful archer units that can be made for more resources. Different settlements may also allow you to recruit different units you can't recruit anywhere else. You can also make scouts and priests. Priests can spread dominion and scouts can swiftly move through enemy territory with ease.  Customization: As far as customization goes, you get to choose what kind of pretender god you would like. Different civilizations have different kinds of pretender gods available, and a lot look different in their own unique ways. Also all will have different stats and abilities, but those can not be customized. You simply choose a god, give your god a name and then you get to choose the game options which there are many, as well as many different maps to play on, making the game very replayable for most I imagine. Also game options include victory conditions, difficulty and number of AI, etc...  Graphics: This is not a game made for good or even half decent graphic design. The graphics are not that great, but that shouldn't be a problem for any gamer with a reasonably decent imagination. You play the game and as you play you can see everything that's going on inside your head and that's pretty easy to get into, and fun. If you do not have a good enough imagination the game will probably feel empty or hollow.  Learning curve: There is a big enough learning curve at first, but things start to click into place eventually and when they do, you'll be flying through this game. There is a tutorial in this game, but for me it was quite a poor one.   On a sad note: Diplomacy system is almost non-existent. To declare war means to attack someone. And the AI can declare war on you without even havind to attack you straight away. No sort of trade involved either, (But that seems okay.) or any kind of peace treaty can be made from what I have seen so far. Once war is declared, it goes on till one kingdom falls to the hands of the other. I wish diplomacy played a bigger role in this game it would make things a little more interesting, but then again, there can only be one winner.  Verdict: Tons of fun to play, if you have a good imagination and don't mind bad graphics. Steep enough learning curve, with poor tutorial. Can be very tactical, with vast amounts of units and civilizations and different abilities for each one. It immerses you in the story and goal to ascend to the throne above all gods. No good diplomacy system. More could have been added on to the soundtrack I guess, but that's my opinion. Many might disagree there. Loads of stats and information is given throughout the game on all main units and battles are done accuratly. Good AI from what I have seen.  All in all, it's a good game.  It's worth your time,  and can have some very epic and memorable moments.  8/10 I throughly enjoy this game. But I wish there was more to diplomacy. My imagination has done fair work on this game, but extra graphic design in certain parts wouldn't hurt at all. And having a bad tutorial mode can be a real pain. But, a lot of the positives really make up for it.  Hope this review helped!",
            "review_score": "1"
        },
        {
            "review_text": "What are the strategic implications of turning off the sun? If you ask yourself this often then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I spent my first 10 hours of the game crying about losing all my giants to Vanheim and Ulm berserkers then I worked out WHY I was losing my giants to them. Then I spent the next 5 hours crying about magic being too complex  10/10 game would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "In essence Dominions 4 is a very enjoyable strategy game that offers a very unique concept and experience. I thoroughly recommend this game for those who enjoy turn based strategy games, and D&amp;D players.  The game features well researched historical nations fighting alongisde their own mythologies, such as Japanese Ashigaru being supported by Tengu, or Viking raiders paired with dragons. These nations are led by your own custom god who radically changes the territory that he/she/it controls, wether by making it into a fertile and well ordered land or turning it into a disease ridden, unproductive region of unrest. Or your god can simply be a towering behemoth that smashes its opponents to pieces in battle. Both methods are completly viable. The final component is the deep magic system, with apocalyptically powerful spells and summonable creatures divided into different schools. Some nations have excellent soldiers but terrible mages, and vice versa. It is very rewarding to create your own deadly combinations of different nations, gods and magics; the amount of combinations is staggering. The game is still updated fairly often bringing more nations to the increasingly large roster. Furthermore, there are many mods to keep adding content to the game.  However, the game can be rather intimidating with a frankly inadequate tutorial, making a read of the manual essential. I had to lose several games before even starting to understand what was going on, and I'm still pretty bad at it. The graphics are certainly functional but they are not exactly good either. In singleplayer there really is no diplomacy to speak of, you are constantly at war with the other players - I think that the lack of diplomacy is the biggest issue the game has.  Ultimately, Dominions 4 is a great game that I greatly enjoy playing.",
            "review_score": "1"
        },
        {
            "review_text": "Well worth your money if you got friends to play with and dont mind less than perfect graphics. Main drawback is a very steep learning curve that can be helped by having people to talk to about it that already know how to play. Another way to get into the game is an excellent new gamemode called disciples where you play on the same team. Other than that I would say that you have to put in quite a lot of hours training with AI and trying to figure things out to get anything done in the multiplayer which in my mind is the actual game, while the AI are just there to try things out fast or get into the game ( I guess it is more or less the same for other 4x games too though). Finding multiplayer games can take a bit of doing also, especially if you want one with rules tailored to your taste. You might very well have to end up waiting a few months for one to start unless you host one yourself. If you are a beginner I wouldn't advice on doing that since I've seen several games suffer greatly the host doing strange things.  TLDR  Pros -More content than you can ever want. -No seriously you will certainly get bored of this game before you have to play the same nation again not to mention that same nation that have so many different builds. I have played this game for 350 hours and so far done a game with less than 10% of the factions. -Make your nation, customize and plan so much that no two nations are alike (unless you take a build from forums?). -Epic matches that last for a long time.  Cons -Epic matches that last for a long time. Can get irritating if you know you have lost and want to get out of the game or perhaps you got a holiday coming up and need to do turns with a laptop (other solutions exist too). -Epic learning curve, I don't think anyone truly knows everything about the game. Certainly not the developers at least.  In closing. Play for fun as the game is far from perfectly balanced. Multiplayer diplomacy is the main thing keeping the balance up. Don't be the guy always jumping on the same strong faction. Get as much as you can out of the game before you eventually get bored.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly complicated and enjoyable strategy game hidden under ugly graphics.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit hard to get into, but as soon as the initial hurdle is taken you have an amazingly complex mythological playground to explore.  Recommended for anyone who likes mythology and complex games that spawn great stories.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best 4x I have ever played, alot of depth, lots of interesting factions,",
            "review_score": "1"
        },
        {
            "review_text": "You can have an army of a hundred thousand Roman skeletons.  You can crush a hundred thousand skeletons in one turn with a handful of good mages.  You can be an immobile rock and laugh (or silently rumble anyway) as entire armies breaks their swords against you.  You can turn the whole world into such an awful place that your enemies will let you win rather than spend another turn playing.",
            "review_score": "1"
        },
        {
            "review_text": "Dominions is my favorite series of strategy games. I admit, it's a difficult game to get into. I still haven't really played this one much - I've spent much more time in Dominions 2 and 3 before there were any Dominions games on Steam.  In Dominions, I really feel like a leader, not just grinding through turns but planning things out. It's a simultaneous turn-based game, you everyone essentially draws up where their armies will go and gives each army tactics for how to fight.  Dominions 4 appears to be an improvement over Dominions 3 - the thrones feel like a good addition and there's a little less micro-management with the tax changes.  Overall, I've been stuck playing more casual games recently, but if you have the time to take on a serious strategy game, this is the game to play. I've seen enough to be sure of that.",
            "review_score": "1"
        },
        {
            "review_text": "////////",
            "review_score": "1"
        },
        {
            "review_text": "Very good and intresting turned based strategy. Do not let the simple graphics style fool you, the game is full of detail and vast in its size.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot to this game. Get over that learning curve and you'll have a blast. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Been a fan of Dominions since 2 and while 3 was excellent, 4 is even better. More victory conditions, more nations, while some are renamed, none have been removed, more spells, coop play with disciples, it all adds up to a great turn-based strategy game.   Not what one thinks of when you hear:'Fantasy strategy', it uses a plethora of races and creatures, even my personal favorite, the nation of R'lyeh based on H.P. Lovecraft's works!  Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most intelligent fantasy TBS games. Just discovering the history, ideas and tactics for each different nation is fun in itself. I only play SP, I find the AI adequate, which is usually considered to be the weakest point of this game.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;thinking you can walk through other peoples lands without consequences  Marveni doesn't care that you're a coward who's being chased around by another nation- he cares that you just stole his gold, maybe gems, and forced him to deploy some people to take the province back.  Imagine if Napoleon Bonaparte showed up in your kitchen, drank all your milk, and informed that he would be occupying the couch for a month because he was scared of the British. Also, in this scenario, Napoleon Bonaparte is one of 7 people you need to kill to become God, and if left alive he will inevitably turn on you.",
            "review_score": "1"
        },
        {
            "review_text": "Great turn based strategy game! Very in-depth systems and deep strategic decision making make for a very engrossing game. The devs also update and add content regularly.  The graphics are 2d sprite based but that's not the big draw for this game anyway, the strategic and tactical decision and consequence system is superb.",
            "review_score": "1"
        },
        {
            "review_text": "This game is literally the deepest and best fantasty turn based strategy game I've every played. Think Heroes of Might and Magic III meets the original Master of Magic. Forget Age of Wonders and Fallen Enchantress; they are a failed and pitiable attempt to capture the essence of what this game alone has successfully realized in recent years. Look past the rude and simplistic graphics and you will discover one of the best games of the decade.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, worth your time if you like large strategic games with a wide selection of possibilities",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game for those that are interested in very deep strategy games, without the fancy graphics.",
            "review_score": "1"
        },
        {
            "review_text": "I killed a Dragon with an army of goats. 10/10 Yetis.  This is the deepest and most time-consuming 4X strategy I've ever played, and I've played... a solid handful. If you don't enjoy extreme micromanagement, you should really pass on this.  Also, PBEM games can literally take YEARS. This is not hyperbole. Do network games if at all possible.",
            "review_score": "1"
        },
        {
            "review_text": "The 4th iteration of the Dominions series, it remains, as ever, a game for the hardcore multiplayer strategist. It is fantasy wargaming at its finest. Turn-based on the WE-GO system, in multiplayer this game will test your tactical and strategical skills as few others do, while juggling logistics based on an economy of ten to twelve primary resources, depending on how you count them. A plentitude of maps exist for the game and are available via mod-sites and, for those preferring randomness, it ships with a random map generator.  Sadly, the game is considerably better for multiplayer than singleplayer, as the AI is incapable of providing a challenge to any competent player: there are simply too many potential options to deal with in terms of magic; That said, a new player should expect dozens of hours of play before reaching a level where the AI can consistently be beaten on the highest difficulty setting and there's a live and vibrant multiplayer community for the game.",
            "review_score": "1"
        },
        {
            "review_text": "Very deep game, it looks like ♥♥♥, but that's actually kind of charming, it's a game that can sink it's claws pretty deep. There are many ways to become god, and this gives you many options.   The strategy is deep and demanding once you push past the surface, the AI is not amazing but fair enough to pose a challenge, it has an interesting take on team multiplayer. I've never played a strategy game Quite like this. over 7/10 solid game, will play for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Very complex yet fun strategy game. It's always fun to play a free for all or just a 1v1 vs a hated friend. Middle age Marignon and Ulm are great picks.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy games that I've ever played! Don't get fooled by the long manual and the people who say it's difficult to learn. Actually it's very easy to pick up, but quite difficult to master.  Cons: weak hud elements, few music pieces, no environmental sounds, very weak micromanagement aspect considering the few building options, random generated maps look a bit dull and should look prettier, lacks option to turn off map wrap-up's  Pros: easy to pick up, original and creative storytelling and writing, aesthetic and mature fantasy world without clichés, game requires imagination to truly work which is a brave deed and a real paradise for some, has maybe the best looking and one of the most artistically inspired pixel art I've ever encountered, great medieval music, consistent game world, great roleplaying possibilities, great tactical battles, very detailed unit descriptions with abilities and equipment, infinite replay value  I bought it on sale as I think the full price is a bit expensive, but I really recommend buying it. It is a game that has real values (like artistically) and is truly a paramount game which needs to be discovered.",
            "review_score": "1"
        },
        {
            "review_text": "Very deep game, it looks like ♥♥♥, but that's actually kind of charming, it's a game that can sink it's claws pretty deep. There are many ways to become god, and this gives you many options.   The strategy is deep and demanding once you push past the surface, the AI is not amazing but fair enough to pose a challenge, it has an interesting take on team multiplayer. I've never played a strategy game Quite like this. over 7/10 solid game, will play for hours.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what the hell I'm doing, but damnit if I'm not having a blast doing it.",
            "review_score": "1"
        },
        {
            "review_text": "'Recommend' isn't a strong enough word for this one. It's one of my top ten games of all time, and quite possibly one of my top three.  If you like massive TBS games, it's the massive-est--but the size isn't just bloat, it's gameplay. There are dozens of nations to choose from, and each nation is starkly asymmetrical. Many strategy games have multiple options for a starting nation that are different more in flavor than in overall strategy. This game has multiple viable strategies to win, *per nation*.   The nations in question aren't just run-of-the-mill fantasy fare, either. One of the two company founders is a religion professor, and the nations are based on a wide variety of historical and mythical traditions from around the world. There's nothing else like it out there.  TL, DR: It's one-of-a-kind.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely deep strategy game with 1000s of monsters, and spells.",
            "review_score": "1"
        },
        {
            "review_text": "A very innovative strategy game with a wide variety of interesting factions. It has an detailed and diverse lore based on various real mythologies and cultures. Battles take place in real time, and manage to apply an old school rpg feel (isometric 2d sprites rolling dice at eachother) to a concept of large scale battles. The number of factions, units, magic spells, and the customization of your god means there are almost limitless strategic possibilities.  This game probably gets lower numeric review scores because dominions 4 isn't much different from dominions 3, which isn't much different than dominions 2. I agree with this criticism, so if you own Dominions 3 the pricetag is not worth the upgrade. For anyone else interested in mythology and TBS wargames, a very unique and fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "Dominions 4 is just one of those games that sure, it doesn't have the amazing graphics of say Civilization or Europa Universalis but it makes up for that with a lot of depth, a ton of content and great replayability. The plotline for the game is fairly basic; Essentially each player is a godlike being called a Pretender, each controls a loyal nation and is battling to become the Pantokrator, or supreme god. To do this a pretender can either do it one of three ways; The first way is to conquer your enemies with vast armies which can take a long time depending on some of the maps, spreading your religion to the point it extinguishes the power of your rivals religion or the new victory condition for this installment, capturing the required number of Thrones of Ascension. Each throne grants you a special perk so to speak and also adds strategy to what provinces you conquer and when. Each nation exists in either one of three ages, sometimes all three. The sheer amount of units in this game is astounded and every single nation in the game is based on history, mythology or fantasy tropes (Although there are no stereotypical Elves or Dwarves at all really.) One of the best parts of the game is also the manual which not only contains information on how to play the game, but it also contains little bits of lore, developer commentary on the different nations and an entire roster of every unit in the game. It is even updated to consider in updates and patches. There is too much content for me to state in this review but the last thing I will say is this; If you enjoy turn based strategy games that give you that 'One More Turn' mentality and you can look past the dated graphics then this game is well worth the $35 asking price.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most detailed and deep TBS ever made.",
            "review_score": "1"
        },
        {
            "review_text": "While this game does have a very steep learning curve, it's definitely worth learning. The gameplay is solid, and I enjoy the graphics and music, but it's really the mechanics that fascinate me most with this game. There's so much depth and customization, and you can even find a modding manual on illwinter's website. That means you can customize the pretender god you play, the nation worshipping said god, the individual units recruited by that nation, and even the weapons and armor available to individual units. It's quite literally staggering. The price looks somewhat steep, but considering it's an indie game with a very small staff, I can sympathize. Try it out, chances are you'll find more than a few things you like.  One more thing I can say is that if you're still doubtful because of the price tag, go ahead and try playing the Dominions 3 demo first. You can find it at Illwinter's website, and rest assured that dominions 4 is somehow even better than its predecessor, so if you enjoy dom3, then dom4 will be great.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of modern strategy games lack real depth or choice. Dominions 4 is not one of those games. There are dozens of viable strategies to play in any faction, dozens of factions in each era, and three separate eras in which to play. The graphics may be simple, but the gameplay is so wildly complex and engaging that you won't even notice.   This is the best fantasy strategy game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is what created the MOBA genre, it deserves respect.",
            "review_score": "1"
        },
        {
            "review_text": "? the Fall 30 for TIME",
            "review_score": "1"
        },
        {
            "review_text": "Start the game. Create new game. Choose the race of mind-enslaveing star beings. Get a tentacle-faced deity. Enslave the creatures of the deep into one immortal army. March to the land. Open a star gate. Make your subjects go insane. Conquer the world with your lobotimized cannon fodder. Become the true god. Get killed by the horrors that come from beyond the star gate. Start over.  12/10 would enslave again.",
            "review_score": "1"
        },
        {
            "review_text": "I discovered Dominions when it was Dom2. That game was very hard to understand and play. Dom3 was much, much better and Dom4 (in my opinion) is a modest improvement. There is a lot to like about this game: building your god (I really like that part), discovering and using magic, and researching some of the over 800 spells. Not to mention several dozen different nations to play with and each of those in THREE ages (i.e. different ages of the world). I don't think it's possible to play the same game twice the same way; there's just too much diversity.  It's easy to take this game as a series of battles: win every battle, beat the other god(s) and you win the game. Wrong! It is about magic and if you don't utilize magic, you will lose. That alone makes it a challenging game to understand and play, and win. I really like that part of the game.  But here's the problem for me: It is a massively detailed micro-manager game. You have to check every thing in every province, every turn, and usually every army (or part of an army) every turn, and anything and everything else in every part of the game and almost every part of the map -- every turn! If you really, really like that in a game, this is one you must buy. It is fun, and interesting, and deep and complex...but after a while I find it overwhelmingly tedious.",
            "review_score": "1"
        },
        {
            "review_text": "Dont be fooled by the graphics, first and foremost. This game is very addictive and has a easy to learn but tough to master feel. Lots of variety in nations, set in 3 different area (early, mid and late) simple difference being most magic to least, least armour to most armour on units. Lots of nice mods to add differemt nations, maps, overhauls. Price may seem high however if you will sink 100+ hours into this game easy. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "The game has a very steep learning curve, however once you get used to the gameplay it's very enjoyable. the vast selection of 'leaders' is a great hook. It's fin playing a 'pretender god' and they have a massive list.",
            "review_score": "1"
        },
        {
            "review_text": "Good stuff! A+",
            "review_score": "1"
        },
        {
            "review_text": "How does this game work? How does anything work? Why is that man riding a giant ape? That is a giant pregnant mud lady leading an army of giant vikings. Oh no I've just turned all day into night with a magical throne. What is this game?  Dominions 4 is the greatest video game ever made. First things first: The manual is on the store page, go to the store page and click 'View the manual' Second: The manual is 400 pages long. Good luck you magnificent pretender.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the 2D graphics and hands off combat fool you, once you get into it this game is hella fun and addictive. With three ages to choose from and tons of nations to play as, along with randomized maps and community mods, this game will keep you hooked for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "You can play a giant armored and armed who leads his followers into battle with a roar, or a shut in mage reading over your books and summoning beasts of myth to fight your foes for you.  Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Dominions 4 is the best Turn Based Strategy I have ever played, and I have played quite a few. Its as simple as that. Civilization looks like a shallow pond when compared to the sheer depth of Dominions 4. I have spent over 300 cumulative hours on Dom 3 and 4 combined (Not all on steam). And I still have no idea what I am doing the majority of the time. I can play about 10 nations fairly well, and there are dozens I have not even looked at. You can spend a lifetime in this game and still, something will happen you have never seen before. While the graphics and GUI drive some people off, I promise, if you look past the pixels you will see a game of games.",
            "review_score": "1"
        },
        {
            "review_text": "Fun times, can be intimidating for a new player but totally worth it. Buy buy buy buy",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid and fun game",
            "review_score": "1"
        },
        {
            "review_text": "This game is very hard and not for the weak of heart, the gameplay is the result of a decade of perfectionment and it shows: there is simply a huge lot of ways to solve your problem: units, spells, artefacts, diplomacy ... you literaly feel like a god.  However having some help for combats would be a plus, it is really hard as is to see if your army is strong against your opponent's without a lot of experience of all spells, objects and units involved; which can bring you to sacrifice powerful units on your opponent because you did not know that his units are virtually invicible to yours. Having a detailled combat report (which spell/units killed which unit, how much gems have been consumed and by who, how much damage have been spared by the units armors...) could also help a lot for beginners like me ! Even being able to rewind the combats to assess by hand the damages and deaths could be of help.  Also too bad the graphics are so cryptics and ugly, especially the UI and map overlays, it does not help with the difficulty when you cannot assess at a quick glance the state of your dominion. Having a strategic map that looks more polished would probably make this game more enjoyable and while it would mean some work, it would not necessitate a 3D rework of any kind, just look at Heroes 2/3 for an example of 2D strategic UI that is beautiful, informative and easy to understand. Some ugliness lies also in the anti-aliasing abuse on every element, I understand it is probably to give more homogeneity to the sprites but it seems like a cheap trick.  It seems like a negative review but I swear it is not: this game is awesome, buy it if you haven't already, I just have to spare the rod and spoil the child ;)",
            "review_score": "1"
        },
        {
            "review_text": "At first glance Dominions 4 can look overwhelming but after time you discover a complex and incredibly deep game with more replayability than any other game out there. If you enjoy building up a civilization and conquering your enimies this game has it all for you. With non interactive combat this game may not appeal to those who enjoy RTS games, with the key to winning very much in the planning of a fight, do i have the right troops? the right spells? (there are so many) have i given the correct orders? these are just some of the things you need to consider prior to fighting. As you play more, you realise that a very important part to your victory is the decision around how you create your race, the pretender design and the magic paths are incredibly important. This game has so much depth and challenge that it should keep you playing for years.  Playing against other players is hard but challenging and insanely fun, with in and out of game diplomacy allowing you to create alliances or trick others into attacking one another, so much is possible. This is one of those games that doesn't appeal to people after a gorgeous graphical experience but it rewards those who love in depth games that require thought and tactics to get things done. Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "No doubt, this game ranks close to Dwarf Fortress in terms of complexity. That being said, it can be a really wild ride. The basic premise is that the Pantokrator (the Overgod, think Aao if you know Forgotten Realms), has vanshied. This leaves the lesser gods, demi-gods, demon lords, elemental kings, and even powerful 'mortal' beings struggling to become the new Overgod. The game focuses on recruiting armies and researching powerful magic to push back your opponents and become the only remaining God. The mechanics can take a bit of getting used to (think along the lines of Risk, but with more depth from the various unit types and magic) but there are plenty of guids and manuals available, as well as an active fan base that is very helpful when it comes to questions.  Also, all mechanics aside, you can play as frost giants led by the very physical embodiment of Winter itself against an undead Roman Empire led by a horror from the Void outside of reality. Why the f**k wouldn't you want to try that? Buy this game, be a Pretender God, and claim your rightful destiny.",
            "review_score": "1"
        },
        {
            "review_text": "After spending more then 150 hours playing Dominions 4 I feel I can now write a review.  Its an amazing game, still have not even come close to scratching the surface of this incredably deep turn based strategy game.   I was not convinced before I picked this game up, I watched at Lets Play on Youtube and that convinced me to give it a try. You should too you will not regret it.   I have over 800 hours on Rome 2, my most played game, and I can forsee Dominions overtaking that.  Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Its as good as it is complex....and i say this as somone who with almost 160 hours is still considered a noob",
            "review_score": "1"
        },
        {
            "review_text": "A timeless classic that will enter the hall of legends along with Master of Magic, Endless Series, Warlords, Master of Orions 2.   Just one more turn...",
            "review_score": "1"
        },
        {
            "review_text": "This game is complete ♥♥♥♥. I've had close friends for years hate me for smashing their cuck nations. Been playing it for years and I have more enemies now than friends. A friend drove by my work and cut my tires to my cars so that I wouldn't make it back in time to do my turn.    Only play if you are a man, the type of man they write about in the bible. Hold fast...",
            "review_score": "1"
        },
        {
            "review_text": "If you want a turn-based strategy game in a non-stereotypical fantasy world, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "While I've only sunk in about 4 hours of playtime when I wrote this, I sank in about 2 - 3 hours studying the massive 295 page manual (half of it's just spell / unit statistics, so only 120 pages or so of reading). While the process of reading this manual was a bit oppressive and a rather large time investment just to start playing, from what I can see is there is a game with an incredible amount of depth and replayability.   Just from the start you get random worlds and the ability to craft your own 'pretender' (basically a demigod) and then explore with the aim of conquering. There is espionage, assassinations, and management of your territories. Perhaps the only thing that's missing in my mind is diplomacy (it's a war game) but I for one never have really explored those aspects in games like this so nothing was really missing.  The difficulty of this title is steep, at least to someone like myself. What's good is that if you read the manual, you should be able to get several hours of playtime and experimentation before you start to get undermined by other nations. This gives you a good shot at your first playthrough to get a grasp on the basics before starting a hopefully more successful campaign.  The graphics are abhorrent, I won't lie, so if you need at least poor graphics to be satisfied I'd stay away. Graphics however are sacrificed for depth which to me, is far more important. There is so much complexity (but in a good way) to each aspect of the game: your towns (buildings, defense levels, dominion, etc.), the terrain, your soldiers (commanders, unit types, formations, leadership, items), and a robust magic system as well.   I could go on, but I already fear that this review is a bit incoherent as there really is a lot to say about the game.   [B}TLDR[/B]   Pros  +Great Depth of Gameplay, incredible opportunities for strategy. +Great Customization: Province Management, Commanders, Unit Types / Organization, Orders, etc. +Very Replayable due to custom game modes. +Tons of multiplayer options including classic favorites like Play By E-Mail and Hotseat +Rich in Lore and Mythology based upon real life mythology. +Tons of Unit Types, Spells, and Items   Cons  -Clunky UI, not reading / following the tutorial will make it very diffiuclt to get used to the controls. -Incredibly huge manual (295 pages, of which 120 pages are essential reading) that you really must read if you don't want to spend many frustrating hours of trial and error. -Absolutely hideous graphics, they really aren't good at all.     The game is purportedly very moddable and that's something I will explore as I get bored of the stock game as well!",
            "review_score": "1"
        },
        {
            "review_text": "just look at my playtime.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so deep that it will never leave you bored. The graphics are insanely simple, but all of the units are drawn. Sometimes it is hard to distinguish the units that look similar. Only the small differences make it clear which unit is which. But the random map generator draws so beautifully that it lets you forget every problem you might have with the simplicities. The music is terrific! You play them over and over hundreds of times and it still never gets old. The magic system is very deep. There are paths and schools with over 800 spells! Much of them are summoning, but there are rituals and combat spells alike, including global spells. The units are abundant, I have never seen a game before that has so many units in it, with detailed descriptions for each. By the way, the whole game is based on mythology. I can only recommend this game to others. Discover everything that was not written here, the journey will be exhilarating!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played it long to give a decent review but what i have played makes me feel like its well overpriced for what else is out there",
            "review_score": "1"
        },
        {
            "review_text": "Civilization maps &amp; resources + Risk troop stacking + D&amp;D RPG Items and Spells + Rome Total War troop combinations.  What do you get? Dominions 4!  I played a game for 3 hours and started to feel the burn of losing.  Where I started not knowing the map is continuously scrolling until 'mid' game. Then I realized, I could've won this a long time ago, I stacked my troops of minotars and centaurs, along with my 'pretend god' and marched them on the enemy castle, little did I know, that pretend god can die, and calling the god back takes AGES! So I thought, big whoop,  I got biggest army and there's only 4 squares left to take, I got all their forts.  Well guess the ♥♥♥♥ what?  They rule by politics, aka dominions, candle figures, and I saw the white candles turn black, and plenty, even though I held physical victories, they spread like communism in 1940s. So I pooled all my gold, hired all the mercenaries, and still got my butt kicked. Lesson learned, don't put your 'pretend god' on the frontlines, doesn't matter how decked out, how much spells and how much planning you put in him, he still needs an army.  Every general can be deployed with a personal strategy, if you don't like to micromanage (clicking repeated things a lot), this game isn't for you. Also you can claim resource points, build a fort, hold it down.  If you like civilization, rome total war, CK2 (combat side), dungeons and dragons dice rolls on hit, you got yourself a dominion.  I'm still :salt:y",
            "review_score": "1"
        },
        {
            "review_text": "If there was a game that kept play by email alive its this.",
            "review_score": "1"
        },
        {
            "review_text": "Where to start? This game is an absolute gem for 4x fans and strategy lovers, but the best way to summarize it is how one of the friends who introduced me to this game told me:  'It's like playing a chess match but overhelmingly deep, without any boundaries and in a fantasy lore world'  Learning curve is... well you never stop learning in this game, so much units, so much spells, so much posibilities... Keep in mind this game is meant to be played against other humans, but of course you have single player scenarios, just think of them as tutorials to prepare you for real war among gods.  So go on, make your pretender God, and fight others to win the Thrones of Ascension.",
            "review_score": "1"
        },
        {
            "review_text": "You're searching for a game, with background storys like history books, gameplay depth wich you would more expect of an pan and paper RPG than an Strategy game or a game where you can outsmart your enemys in many different ways while also have to keep your self prepared for alot of eventualitys, this game may be the hidden Jewel you might been searching for...",
            "review_score": "1"
        },
        {
            "review_text": "Malazan: The Game",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game for awesome people.  If you are a mythology buff like I am who also happens to enjoy games like those in Sid Meier's Civilization series (or Conversely Europa Universalis/Crusader Kings), as well as nigh on Dwarf fortress level learning curves, then this is the game for you.  - Preposterously deep (multiple ways to play an asthma attack inducing number of different races) - Mouth wateringly creative (A million spells of varying effects and quality) - The game really caters to the modding community. Lots of great stuff out there. - Faithfully (pun intended) retains the mythological feel of the various ancient faiths the game portrays.  Let me emphasize. There is no mythological figure too obscure. There is no faith's boogeymen left unjustly translated without all their crazy weird abilities. From sorcerous glamours, to shape shifting wolves/snakes/dragons, to religion not spreading unless you sacrifice some father's daughter at the altar of good intentions.  However it's not without flaws.  - Civ 2 era graphics. - It's not so much a learning curve as it is a learning cliff. With poisonous thorns growing up it and a pit of sharp legos below just waiting for your to fall. - Some nations can be more than a little imbalanced (Poor EA R'lyeh comes to mind). - Pretty pricey at 'half a Triple A game sans DLC'.  Bottom Line: If you've ever wanted to feel like a callous vindictive divine entity with absolutely no regard for the well being of your people beyond their immediate use for dying in your glorious name, then look no further than Doms4.  It's the authentic god experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, terrible graphics, this is a turn based play by email game. Watch some youtube videos on it if you are seeking some go at your own pace in depth strategy game this is the best. I hope in the future they don't rely on 3rd party providers of forums and servers. I recommend this to anyone looking to be creative and strategic that doesn't need more than sprites.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game with all my heart, the varieties between the factions is amazing, the choices are amazing, this game is one of my favorites strategy games ever, i am a graphics ♥♥♥♥♥ and i didnt even care for this game   10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the most deep games i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun, and I love the setting there's a lot of detail and subtle fluff here in Dominions 4.",
            "review_score": "1"
        },
        {
            "review_text": "Best game of its kind i have played. Dont let the looks fool you. Although i agree with others that it could use a bit of polish in the graphics department, i would never never trade game play for eye candy. Tired of buying all the new AAA titles looking for a challenge and burning up your graphics card in the process? Get This Game! It will burn up your brain instead as you struggle to choose between so many options... What race to lead, what leader should you play, which units should you build, where, what about magic research, narrow or broad, intense or as needed. Do I empower my leader or my other minions or hold on to all those crystals for actual combat? And thats just a tiny bit of what you think your in control of. Then there's all those other guys scheming against you and totally random events that can help or hinder you in small ways or out right be game changers. 53 hours on record as Im writting this review, and I've won exactly one game, on a small map vs one ai player on easy setting, totally by accident I admit (I had no idea the last move i was making was the winning move.) I see hundreds more hours of fun and frustration waitting for me. Trust me on this one, you wont be dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "Dominions 4 is a strategy game where you take the role of a pretender god trying to ascend to the position of Pantokrator, the true god. You do this by leading a nation of worshipers, taking your armies into battle against other pretenders, researching magic, managing resources and casting spells. The game is very complex and not the easiest game to play. It has a very thriving mod community.",
            "review_score": "1"
        },
        {
            "review_text": "Don't look past this game, It is extremely fun when playing with a friend or more. This game would not be fun to sit around and play against the AI forever.. If you buy this game make sure you have someone to play with.",
            "review_score": "1"
        },
        {
            "review_text": "Doing it for the badge. Great game, tho.",
            "review_score": "1"
        },
        {
            "review_text": "Great game wonderful game but hey the price is a bit high for it if you like strategy and a bit retro and fantasy world its a must but at least on a 60% off",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game. It's got a lot that appeals to me.  The big thing that makes me not recommend it is that it's a bit of a 'needle in the haystack' game. Most of what you do is going to be wading through the many many races, units and abilities to find the combo that works well together.  Once you do that there's a pretty decent turn based fantasy 4x in there, however I found the crunchiness to be too much for me.  Also the single player is dreadfully dull, my advice is to stick to play by mail games",
            "review_score": "-1"
        },
        {
            "review_text": "Deep game mechanics (is that so?), a lot of nations, stuffs, spells, etc. Developers still support this game. Disadvantages I have found so far are: lack of diplomacy against AI but some real ppl still behave less reasonable than bots, ridiculous possibilites of city extension (just couple of buildings to build - mainly forts) and the thing I hate most is being able to train the entire unit roster in a very first turn.  In the beginning I was amazed by the game but after while Dominions gets both repetitive and boring. The lore is great though.",
            "review_score": "-1"
        },
        {
            "review_text": "Purchased this game for it looked stimulating. Found myself lost the whole time almost as if the creators decided that they were going to make a game only for them to play and no one else.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game because it stated it was multiplayer co-op. Technically that may be true, but it is no simple task to play multiplayer. It is misleading to say it is a multiplayer game, as for most people that will be almost impossible to work out the network configuration. For a start you need a separate instance of the game running a server. You can't do that on your own machine or you get a bad packet error (and that's after working out how to run two instances). There's no real help for it, so the game is now essentially useless except single player, which would be fine, but that's not why I bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game, and I can tell someone put a lot of love into it, but the interface is so clunky and the graphics so one dimensional that I just couldn't get into it.    The best part of the game is the fight interface, but even that is reduced to blocky pixels moving across the screen like Pong.  I don't have enough imagination to make up for all that.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like the simplistic style of the construction, recruiting, and researching of this game. The battle strategy is OK.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow....this game is so left of center. Fun is not an option without knowledge of the series. Advanced Statistics was more exciting than this game. Back away if you are not a Dominions fanboy.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphically extremely poor. Waste of cash!",
            "review_score": "-1"
        }
    ]
}