{
    "app_id": 259600,
    "name": "Finding Teddy",
    "release_date": "2013-12-03",
    "developer": [
        "Storybird"
    ],
    "publisher": [
        "LookAtMyGame",
        "Plug In Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 19,
    "positive_ratings": 709,
    "negative_ratings": 147,
    "price": 5.99,
    "description": "We are currently working on Finding Teddy 2 !!Stay tuned, we are currently sending confidential preview versions to journalistsSpecial Offer : Buy Finding Teddy and get Free OST !In BriefThe revival of Point'n-Click.Graphics completely handmade, realized pixel by pixel.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/259600/header.jpg?t=1447359174",
    "minimum_requirements": "OS: Windows 7+ Processor: Dual Core CPU Memory: 512 MB RAM Graphics: OpenGL 2.0 compliant video card Storage: 90 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A beautiful. if short, point and click adventure game that will win you over with its charm, and stump you with its puzzles. The game is ripe with gorgeous artwork and phenomenal music. Don't let the simple plot lure you away; Finding Teddy is every bit as wonderful as it is beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Finding Teddy caught my eye as it showed a strange world a young girl finds herself in after her teddy is taken by a strange creature. Point and click adventuring seemed like it would be a more relaxed pace of gaming after the more action intensive games I'd recently played. For the most part, this game seems a bit split on how things go. There are elements I really liked and others that made pressing on feel more of a chore than something I'm doing for enjoyment, but ultimately I feel the balance is a bit too much into the negative to really recommend the title.  The pixel style graphics are charming in their own right and the colour usage seems pretty solid. The animations are mostly subtle but effective so I was very interested in what new sights I would discover. The audio is a bit mixed, as the various simple melodies that form part of the puzzles are interesting to hear sometimes but the actual background music felt too repetitive. The story is presented in a very minimal style - it's really just a tale of a girl seeking to reclaim her comfort in the form of her teddy and having to explore a strange unfamiliar world. There are some other story elements that creep into spoiler territory that are likewise effective without going into full cutscene mode for it all.  The puzzles are a bit mixed. Some are pretty clever and did make me realise how much sense a solution made after I'd done it. The puzzle involving the crocodile is the perfect example, which made me think of the items I needed and how. Then you get others that don't flow nearly as well. The game also tries a unique approach with music based puzzles. Some of these work very well too but those are mostly the ones with actual visual clues for those that can't quite get the pitch right, but others rely on sound alone and this can result in some major trial and error as you try to figure out the correct pattern (and hoping you're in the right area that needs it too).  The game isn't very big, where I clocked in at 1.6 hours for a playthrough. This doesn't take into account the new game plus the game apparently has or looking for any secrets. Unfortunately, what this does take into account is the lots and lots of running back and forth through familiar areas because sequential elements of certain puzzles are at opposite ends of winding paths you've already been through several times. Given that I was already backtracking a bit for things like picking up items I had previously missed and had to accept that as my own fault, the last thing I would want is to be forced by the game to do even more of that.",
            "review_score": "-1"
        },
        {
            "review_text": " Excellent! | Отлично!  A cute little adventure game. As some other people saying it's a bit hard to understand what the F to do at the beginning, but when you finally get it - you will be unable to stop playing untill the game's finished. I've beaten it four times now and the ending is still makes me so 'H A P P Y' ^_^ Strongly recommend, especially if you like adventure games.  Милая маленькая приключенческая игрулина. Как многие говорят - по началу может быть не понятно что вообще делать, но потом, когда наконец 'дойдет', от игры уже не оторвешься до самого конца. Я прошел игру четыре раза и концовка каждый раз делает меня таким 'С Ч А С Т Л И В Ы М' ^_^ Настоятельно рекомендую, особенно тем, кто любит приключенческие игры.",
            "review_score": "1"
        },
        {
            "review_text": "Finding Teddy is a pixel art point and click adventure puzzle game of musical proportions, It's like reading a good book before bedtime.   The Good:  + Concept behind the puzzles is original + Soundtrack + Challenging   The Bad:  - Cannot adjust in game music, it's either on or off - It's not readily apparent how some of the puzzles work - In the 'About the Game' summary it says there are no dialogs in this game. That's not entirely true as the final puzzles have you in a dialog with the antagonist of the game. Just a pet peeve.  This is a game taken back to it's roots, there are no boxes and boxes of dialog to click through to tell the story as the story itself is pretty self explanatory. Immerse yourself in a world knowing nothing about what your objective is or how things work, you will need to click and observe, a lot. Some puzzles are hidden but most rely on an alphabetical musical scale, therein lies my problem, you pretty much have to mute the game's score to hear the puzzle music which sort of kills the immersion.   All in all (after I was clued in to how the puzzles worked) I found Finding Teddy to be quite a relaxing take-your-time puzzler. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an adorable point and click with a female protagonist. The art is simplistic and fantastic. A little girl goes out into the wilderness (of her closet. lol) to retrieve her beloved Teddy. The puzzles are sometimes difficult, but not frustrating by any means. (Aaaand it has it achievements!!) It is a shorter game, so it is easy to get into. I highly recommend adding this delightful litte treasure to your Steam library!",
            "review_score": "1"
        },
        {
            "review_text": "Finding Teddy is cute, moderately entertaining, and very short. This is not your standard 'pick up five hundred items and mix them up until something sticks' adventure game. All the puzzles are pretty straightforward, although the music puzzles are slighty more challenging. There is no spoken dialog, and essentially no text either. The audio is pretty good, with decently interesting and sometimes creepy background music, and minimalist sound effects. I only got stuck twice, once because of an interface problem. My four-year-old son was actually able to complete a decent chunk of this game without me, to give you an idea of how simple it is. Still, not terrible by any means, just don't expect a lot.",
            "review_score": "1"
        },
        {
            "review_text": "A heartwarming tale of a little girl's journey to find her Teddy Bear. Finding Teddy is a simple point and click game involving some puzzle solving. To be honest, I had to play this game using the walkthrough for the first half, as nothing is really explained gameplay wise throughout the game. (I guess it's to add to the challenge, idk). Once you get the hang of the notes and type of puzzles, it becomes easier. It's a great little game to play casually and doesn't require too much of your time (or effort, depending if you use the walkthrough or not). So if you like point and click puzzle games, this is a great game to add to your collection.",
            "review_score": "1"
        },
        {
            "review_text": "Finding Teddy was an absolutely wonderful surprise. I had kept it on backlog for quite some time, expecting it to be a plain ol’ indie retro 2D platformer. In reality, it is a point &amp; click adventure with a light emphasis on music. The art style is extremely pleasing to look at and the sound is cute but can get a bit annoying at points. One of my favorite parts however, is that Finding Teddy does not suffer from the usual Point &amp; Click trope of being infuriatingly difficult to navigate. The game is short and sweet, perfect for a nice afternoon adventure. It’s really refreshing to find a great story that doesn’t overstay it’s welcome.",
            "review_score": "1"
        },
        {
            "review_text": "A short but beautiful and warm-hearted puzzle adventure game about a little girl seeking her Teddy bear in a magical land. The game has very simple mouse-based controls which mostly focus on some simple item puzzles and a slightly more complex music mechanic which is fun to use, very faintly reminiscent of Loom. A great way to pass an evening, though you need to listen carefully so play when there isn't a lot of background noise.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and short. Good puzzles for the most part. After you figure out how the music works it becomes worlds easier.",
            "review_score": "1"
        },
        {
            "review_text": "such a weird cute puzzle game. well worth a play :)",
            "review_score": "1"
        },
        {
            "review_text": "A creepy-cute style game. Foundation for puzzle is musical note, kinda hard for me, but can be solved by trial and error ^^",
            "review_score": "1"
        },
        {
            "review_text": "Such a sweet and beautiful game. A game that should be played for the artwork and the simple but eloquent puzzles. Also not forgetting the horrible deaths of this cute little character when you get a puzzle wrong. My only issue is that it is quite short, I would have loved to play it longer.",
            "review_score": "1"
        },
        {
            "review_text": "What an amazingly charming little game.",
            "review_score": "1"
        },
        {
            "review_text": "A short point and click adventure and a monotonous and disappointing experience. You get this little girl who is trying to get back her Teddy bear from a mysterious world, pleasantly designed, though lacking imagination. I enjoyed a lot the artwork, the soundtrack, but not the game itself. The gameplay is just tedious and the puzzles are simple and minimalist, the mojority of them tending to be ridiculous. Even the achievements are tending to be negative. You get the echivements for being killed by the creatures you're supposed to please, so if you're not supid enough to get killed by them all during your journey - you'll have to start it over, and this time 'remember' to die if you want the achievements. Another waste of time and money. Just doesn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Only planned to start it up and see what it was and I ended up playing untill I finished the game.   Finding Teddy is a fun little point and click game, telling a cute story about a girl trying to find her teddybear. Puzzles aren't that hard, but you can get stuck at times. It's easily fixed by backtracking a bit. The biggest annoyance for me was unlocking letters and them not showing on the music chart which resulted me making mistakes that could have been avoided.",
            "review_score": "1"
        },
        {
            "review_text": "Ok after this and Shelter... I don't think I will be buying any more Greenlight games................ I feed robbed and I believe I only paid the equivalent of 3 kinder eggs......... (Although they would have been much more fun)  The narrative could EASILY have been produced by a 4 year old (It may have been)  The graphics give you a proper headache, (imagine looking at all the colours in the rainbow flashing 100 times a second whilst hanging upsidedown naked)  The puzzles were lame as 'Use flying bug thing' on 'feather stuck in a tree' because I cannot reach it...  And in the end I didn't give a poo Where my flippin TEddy was, I just wanted to feed the protagonist to the singing bloody frog and wake up from this flippin nightmare!",
            "review_score": "-1"
        },
        {
            "review_text": "Very beautiful graphics in this point and click puzzle game. I took me a while to figure out the actual way to solve the puzzles, then it became just a really fun story to work through to the end. Spoiler: the end is not just retrieving my teddy.",
            "review_score": "1"
        },
        {
            "review_text": "Cute little short game 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Interesting little point and click puzzle game where the entire goal is to get your Teddy back - and while this in and of itself is a very selfish reason to be traveling through your closet to Narnia it becomes apparent that the only way to get Teddy back is by helping others.  The visuals are very neat and the game gives just enough of a hint at any one point to allow you to continue through the game with a little effort.  Would recommend this to indie game lovers as well as point-and-click fans.  ",
            "review_score": "1"
        },
        {
            "review_text": "A very cute pixelart puzzle game. Any fans of FEZ should try this out! Short and sweet!",
            "review_score": "1"
        },
        {
            "review_text": "Boring, ♥♥♥♥♥♥ snorefest of a point and click game. Wipe every inventory item on every interactible background piece until you win. Snooooooore.",
            "review_score": "-1"
        },
        {
            "review_text": "Although it is short but it is a cool game and worthes to try it .",
            "review_score": "1"
        },
        {
            "review_text": "Bad game. Not worth any money.",
            "review_score": "-1"
        },
        {
            "review_text": "This one is a complete abortion - it's an iOS game ported to PC and then flogged on Steam by some very entitled feeling hipsters who feel they deserve some money from PC gamers for performing ablutions on the gaming industry.   Gameplay - ported from iOS, it has a terrible UI, barely playable on PC, designer for hipsters, not humans. At best, it's reminiscient of games that did very badly on the C64, but with worse gameplay.  Graphics - Developer didn't bother, why should I? Oh yes, because writing this review is more involved than the effort those guys put in. Retro pixel rubbish, except they couldn't even maintain the fake accent properly, so from time to time they forget to use pixel graphics. Lazy, halfarsed mess.  Technical aspecs - graphics and sound are terrible because it's an iOS game. Doesn't run properly in any resolution over 1080p - even iPads do that - how bad are these developers?  My advice? Only buy this game if you can be sure you get the only copy, then shoot it, burn it, collect the ashes, shoot them, stir up the ashes with some petrol so you can burn them, then find the McDonalds the developer is working at and make him eat them. It's the only way to be sure.  I'm kidding of course - McDonalds would never hire anyone this incompetent.",
            "review_score": "-1"
        },
        {
            "review_text": "Such a charming little game, I went into it with no prior knowledge or any idea of what to expect and came out smiling :)",
            "review_score": "1"
        },
        {
            "review_text": "The story and puzzles were great, very short though, there is a New Game+, but it's really just the same playthrough with a couple more unlockable achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Unique and charming point and click adventure game, following a pattern similar to that of Alice in Wonderland. Easy to beat once you figure out the basis for the puzzles, and this is the most fun part. Very cheap, worth its money.  Cons: Contrary to the title, there is no Teddy Steam background, badge, or at least emoticon! I would go nuts on the badges for this if there were teddies in it.",
            "review_score": "1"
        },
        {
            "review_text": "What a terrific little game.  A couple caveats - It's quite short, and the puzzles are not terribly difficult. In a lot of ways it's more a proof-of-concept than a game.  Still, I loved it. The art and sound design are excellent. If the style appeals to you and you don't mind something that's heavier on the experience than the gameplay side of things, I can recommend this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "544",
            "review_score": "1"
        },
        {
            "review_text": "excellent. it was short, but sweet. Beautiful artwork and music, it took 2 hours to complete it but i really dont even feel jipped on that, i got this game for like $0.50 so that part probably doesnt apply, wait for it to go on sale. its a nice little game",
            "review_score": "1"
        },
        {
            "review_text": "That was kind of cool. I will play again to get the hidden things and final awards.  Reminded me a bit of games like Limbo, Flashback, Heart of Darkness, but without the action platforming.  Well made, nicely animated, great art style, good ambient and environmental sound effects.  I also really liked realizing that the notes were actually letters, and that I was spelling words.  Nice story as well. Glad I picked up the Finding Teddy bundle, this was a good playthrough while waiting for other stuff to download.",
            "review_score": "1"
        },
        {
            "review_text": "Short, cute and endearing, Finding Teddy isn't going to go down in the annals of point-and-click adventure game history, but it's a decent way to spend a couple of hours (or a couple of minutes if you're brilliant enough to work out all the answers instantly). It suffers a bit from fractured adventure game logic, particularly with regard to grasping the nuances of the core musical communication system which can be a bit befuddling until you realise the notes correlate to the alphabet and some of the puzzles are a bit random. But the graphics are bright and colourful, the protagonist is adorably sweet even when she's getting brutally killed (fortunately death is just a novelty in this game), the world is bursting with creativity and life and the ending theme of the story is surprisingly heartwarming- everybody needs a friend. A pleasant experience.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked this game. It was so cute and it made me feel so happy. Although, I had a hard time finding the orbs. Otherwise, it was an amazing game. I loved the ending. The entire thing you make friends on your way and it's just so cute. My favorite part is that the one who seemed to be the 'monster' was really just looking for a friend. I liked that there weren't any words and you had to use the notes to communicate with the other characters. I've been looking for something like this for so long. It really made me happy.",
            "review_score": "1"
        },
        {
            "review_text": "A short, charming point-and-click adventure. Relaxing sountrack too.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful in so many ways. Allows for, and creates a very relaxing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Whilst not the fault of the game please beware that Windows 8 systems with legacy ATI cards (HD3870 in my case) will report that the Open GL version is out of date the the game will fail to load. Have attempted to fix this with various strategys online but it involves back dating your drivers.",
            "review_score": "-1"
        },
        {
            "review_text": "Charming game with musical elements and a sweet story. Nearly Myst level puzzles and hidden items. Definitely provides a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This game tells a great little story. I love the randomness and how some of the puzzles make you think. It takes awhile to find all of the orbs so you can look at the artwork, but it's definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "'Aw, this all looks very cute and cuddly. The music is so pretty! The graphics are so pretty! Everything is so pretty! Hey, look, a friendly blob, I'm gonna say hi and see if he wants to be frienOH GOD WHAT IS HE DOING WHY IS HE EATING ME I'M DISSOLVING IN HIS STOMACH WHAT THE FU'",
            "review_score": "1"
        },
        {
            "review_text": "Very clever puzzle game that will require some out-of-the-box thinking. The art style and the soundtrack serve to give the player a nice, ambient experience. Finding Teddy is short, but this is a point in its favour: I feel like adding more to it would have made the game somewhat tedious, as there is quite a bit of backtracking and the puzzles can be a hard nut to crack sometimes  The only downside to this game is that it never communicates to the player how to play. I understand that this is a stylistic choice, and for the most part it works very well, but it took me a long while to realise how to use my companions. There was also one puzzle in particular that made no sense to me. Without spoiling the game, I can say that you find an item that can be used to cut one thing but not another, practically identical thing.  Definitely recommended. Note that you need to have sound activated in order to play this game properly.",
            "review_score": "1"
        },
        {
            "review_text": "A quick and super adorable point and click adventure. The artwork and animations are great, and it's just super cute. A++",
            "review_score": "1"
        },
        {
            "review_text": "Finding Teddy is a short but sweet adventure game. At first players may find themselves somwehat confused with some of the puzzles at times however I found that the puzzles are much easier to figure out wehn you don't spend too muc time on worrying about them and just try to explore and see what you can pick up. Once you pick the items up try experimenting with them in a logical way with the environment and you'll find your way through the game in no time.  The story is about a girl whose teddy is stolen from her by a monster through a wardrobe. Of course she wants Teddy back so she investigates the wardrobe and finds herself in another world filled with odd and familiar creatures among other strange things. The story was quite touching and I won't spoil it in this review - you'll have to play the game for yourself to experience it!  Artistically and musically, the game has a lot to offer. You can buy the soundtrack on this page if you would like and I would recommend doing so if you enjoy the soundtrack in the game (which, might I add, is very good and well put together and definitely suits the theme of the game). The art style reminds me of the SuperBrothers game, Sword and Sworcery due to some of the backgrounds and generally the pixellated kind of style. Also clicking with the mouse cursor is reminiscent of that game too. The art and music are both very well done and suit the overall theme of Finding Teddy well.  As for replay value, there are numerous achievements to unlock in this game, most of which can be obtained simply by playing the game normally. There are even achievements for dying (and death is very forgiving in this game, so don't worry)! Throughout the course of the game there are 15 fireflies to collect, I believe that there is 5 fireflies per area. Myself I could only find one and that was in a black portion of a cave which I came across accidentally - so I don't think that they are going to be very easy to find and you can of course skip collecting them entirely if you wish. There is also some bonus artwork to unlock once you collect fireflies.  I'd recommend this game to pretty much anyone - especially those that like the adventure game genre. Keep in mind that this is a point-and-click game and it originated on iOS so if you'd prefer to play this game using touch I'd say to go pick it up on the App Store instead. With that said the game has been ported over really well and doesn't feel like it needed to be any different as all the options are sufficient enough to play the game the way it was intended, which is great!  As a side-note, I'd even say that this game could be somewhat appropriate for children to play as it has that sort of Monster's Inc. vibe to it (looking at the screenshots you'll probably be able to see what I mean by that). However with that said there are a few scenes that could be considered violent or disturbing so please play the game yourself before allowing a child to play!  Overall I really enjoyed this game and as stated previously would recommend it to pretty much anyone for a relaxing adventure game experience. Personally I'm looking forward to more from this developer in the future as I was very impressed with Finding Teddy. I hope that this review has helped (and hasn't been too long....?) your purchase of Finding Teddy!",
            "review_score": "1"
        },
        {
            "review_text": "Finding Teddy is a short story, that, to me, is very fun.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend getting this game on sale, because it's very short. If you get it at low price, then I consider that it's worth it.  Finding Teddy is a beautiful and zen point-and-click adventure game. It has a couple of unique mechanics which make it interesting. However, none of the mechanics in the game are very well explained. I had to resort to looking at a walkthrough just because I had no idea I could do a certain thing.  Overall, it was still a nice experience - just a little rough around the edges.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing piece of  game  art about childhood and imagination of one girl. Another example of great atmosphere!",
            "review_score": "1"
        },
        {
            "review_text": "May be a short game, may be just so few gameplay, may be just so few story, the way it is presented is magical. Everyone who just loves a good presentation that wrotes more stories than there are actually written will love this game. And everyone with a good taste of Art. That is what this game is, it is Art Folks!.",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet. A very charming game.",
            "review_score": "1"
        },
        {
            "review_text": "An good adventure game, classy and efficient.",
            "review_score": "1"
        },
        {
            "review_text": "This was such a great experience! Highly recomend it!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting retro styled point and click adventure game with a unique puzzle solving mechanic. Quite fun with the odd little bits of sometimes morbid humor inserted.",
            "review_score": "1"
        },
        {
            "review_text": "A must-play game. If you're going to use a guide, only do so if necessary, as you can quite often figure out what to do with a little problem.",
            "review_score": "1"
        },
        {
            "review_text": "Due to its small size, I would recommend buying this game on sale, but I absolutely recommend buying it. An interesting take on a genre that doesn't often see its degree of polish (at least, not at the time).",
            "review_score": "1"
        },
        {
            "review_text": "As much as I recommend this game for being a quality product that works for what it does, Finding Teddy just isn't without its issues.  It's a point and click adventure game, but the movement is heavily restricted. You don't just click to walk somewhere, you only move when transitioning screens or picking up items, and you can't cancel these actions. So if you accidentally click on a transitional hitbox while clicking around for one of the game's many hidden collectibles, you're stuck moving.  The game also tells you nothing. I don't know what's with these types of games telling you nothing about their story and their mechanics but it works as well for this game as it did for Hyper Light Drifter (read: not very). Like that game, there's also a made-up language you have to learn. Mercifully it doesn't require a language course to master and is mostly based in regular alphebeticals, but it relies heavily on sound cues. So if you aren't good with sounds, you're not gonna have a fun time.  The game is also far too short. Not in the good way either, the only reason I barely scraped the two hour mark was because the game was so hard to figure out and I played it a second time in New Game+. I'd recommend the far longer (and far superior) sequel in comparison to this, but for what it's worth it's a great game if you really want it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is delicious, and nutritious!",
            "review_score": "1"
        }
    ]
}