{
    "app_id": 259620,
    "name": "3079 -- Block Action RPG",
    "release_date": "2013-11-14",
    "developer": [
        "Phr00t's Software"
    ],
    "publisher": [
        "Phr00t's Software"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 231,
    "negative_ratings": 231,
    "price": 3.99,
    "description": "3079 is a futuristic, open-world action first-person role playing game. All areas, buildings, items, quests and characters are randomly generated. You will find unique lands &amp; challenges. I hope you enjoy it!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/259620/header.jpg?t=1447359174",
    "minimum_requirements": "OS: Windows XP+ Processor: Dual-core Memory: 1 GB RAM Graphics: Dedicated 3D Hardware Storage: 100 MB available space Sound Card: OpenAL Support Additional Notes: Java 7+ from <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.java.com\" target=\"_blank\" rel=\"noopener\"  >www.java.com (uninstall old versions)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wasn't really sure what to expect with this game. It looked a lot like minecraft so I took a chance. That being said, it plays nothing like minecraft. Its a fun game, but not like minecraft where you can easily invest 40+ hours into the game. It does take a while to get a feel for the game, but after you do, its a ton of fun.",
            "review_score": "1"
        },
        {
            "review_text": "A decent game, a bit quirky in design. Gameplay can be a bit off putting at times when you are attempting to have someone follow you, or if you wander into high level territory. Other then some minor complaints the game is good",
            "review_score": "1"
        },
        {
            "review_text": "Just bought the game on Steam and holy damn does it look good. Not only does the world feel organic and full of dangers, but there's solid gameplay utilizing the best parts of both the building of Minecraft and item-searching in dungeon-diving of rogue-likes.  Also, it looks good 'n artsy. None of that Minecraft monotone but rather some creepy and original style to it. Randmization really makes stuff interesting in this game. There's definitely lots to see, meet and explore.  As to the difficulty, it's the game's strong point. This world is relentless and does need you to take it seriously. You need to acquire skill first, then items in order to survive and advance in progress-indicating levels and power.  But what I'm really looking forward to is what's in the future of the game. It does seem it could easily get some servers with communities similar to those of DayZ in order to make the game feel even more organic, purposeful and alive. Not to mention patches and mods.  It's a world ever at war. And you need to shape it.",
            "review_score": "1"
        },
        {
            "review_text": "Simple but oddly additive in its own way. Its a nice cheap game to just muck around with friends on.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on Desura when it came out, and I believe it came with a steam key. I'm friends with Phroot and I know he puts all he can into his games. I have about 20 hours on the Desura version.  This game mixes elements from games like Borderlands and Minecraft (you can build, although to a restriction). You start out falling from nowhere and a war is going on. You automatically teamup with the friendly race you desend upon, fighting against the Neanders. I won't spoil anything, but you can team up with them eventually.  In the middle of the war, there are these demons that are impossible to kill without a special blade. They are a bit rare, and you have to do missions for them.  All in all, it's a fun game and the multiplayer is still the best part. It does get old after a bit, and by a bit, I mean about 4 hours.",
            "review_score": "1"
        },
        {
            "review_text": "its good i very love it but there is a problem's i cant kill the demon spaceships any help please ? ",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely adore this game. But it's definitely one of those games that you either love or hate. True, some of the mechanics don't mix well. Look past that and you have a fun, expansive, action RPG that is definitely worth 7 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "While I admit, I was pretty sceptical going in, this game didn't half deliver. I've never had such compact fun in all my life. The grapple is super satisfying to use, and me and my friend basically just found ourselves traversing miles of landscape instead of actually progressing towards our objective. The building is kind of finicky, but once I got the hang of it, it was EZ. GGWP.",
            "review_score": "1"
        },
        {
            "review_text": "So I'm confused... shouldn't have something happened between 3079 and 4089 and onward? 1000 years seems like a ♥♥♥♥♥♥♥♥ of time for robots to evolve, conquor new things, move outward. Like the Borg for christs sake.   Anyway the generated Voxel worlds are beautiful. Well done 10/10/10/10",
            "review_score": "1"
        },
        {
            "review_text": "great game good gameplay but some of the quest are repetitive and the energy for ammo thing is annoying i would prefer a normal ammo system all and all id give it a 6/10 needed some inprovment",
            "review_score": "1"
        },
        {
            "review_text": "AIr dropped in a procedurally generated world with political factions at each other's throat, a blend between a cool sci fi vibe and a heavy dose of minecraft aesthetics throw in. FIrst person shooter with plenty to shoot at. I launched this game and just after looking at the handy keyboard map for key bindings I was hyped. However, probably because of of the procedural nature of this game's core design. I just ended up being air dropped shooting clumsily and running out of stamina and getting killed quickly. What I am getting at is, barrier of entry to this game is very high in terms of commitment to get to the good stuff, and after running around in circles, getting killed and restarting the game because I did not want to suffer a permanent disadvantage long term for a game while I am still learning how it works, I ended up quickly burning myself out and wondering why this felt like such a chore. Then I tuned off...  I recommend easy mode. Unless you have a very limited library, lots of time on your hand... I would also appreciate tips in comments to this review on how to overcome the shortcomings this game has, and wheter or not its worth bothering.",
            "review_score": "-1"
        },
        {
            "review_text": "I love it but it's not for everyone, look up some gameplay videos before you buy.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game after getting it in a giveaway and it has to be probably one of the worst games I have ever played. And I have played a lot of terrible games. So I very Highly do not recommend playing or buying this game.",
            "review_score": "-1"
        },
        {
            "review_text": "What seems like it's trying to be a 'big' game ultimately ends up feeling small and limited. 3079 is plagued by a number of issues, and the bizarre appearance of the enemies is the least of them. There are a few interesting or fun elements, but everything that 3079 does right, 3089 does better.  There is no reason to purchase this game. If you are thinking about getting this game, get 3089, instead. It's better in almost every way.",
            "review_score": "-1"
        },
        {
            "review_text": "This ♥♥♥♥ sux 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Like a bad Borderlands+Minecraft thing.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game with Indie Royale Alpha Bundle #1 (Along with Wyv &amp; Keep and Towns) and I didn't swap it to Steam until yesterday - but this game is awesome. Anyone can pick it up and play and enjoy it somehow - rpg fans, sandbox fans, or shooter fans. However, some of the controls can take some time to get used to. For example, I am used to 'E' being inventory in Minecraft, but also 'E' being use in Valve games, and I couldn't bind them both to 'E' or we would have a Zelda CD-I issue. So, I have to reach all the way over to 'I' for inventory. This issue is minor though. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this!!    4/10",
            "review_score": "-1"
        },
        {
            "review_text": "great uninstall simulator, 11/10, would uninstall again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is literal AIDS. It's Called 3079 because that's how many different kinds of STD's this game gives you.  If you want your ♥♥♥♥♥♥♥ to be safe, don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Ugly in every sense of the word. Character models, blocks, textures and sounds are all pretty bad. Great ideas here but most are poorly executed. On top of that its not very fun. One giant confusing mess. This might pass as a final for a collegiate game programming course but even then it probably wouldn't receive anything above a C. Worth a go if its free but definitely not something you should pay for.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game and it's not minecraft, so shut up.",
            "review_score": "1"
        },
        {
            "review_text": "This made me sad.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS, HORRIBLE GAME, HORRIBLE STORY, HORRIBLE GRAPHICS, SUPER SLOW AND IT SUX BUTT HOLE... I BOUGHT IT AND I WISH I COULD RETURN IT.... THIS GAME BLOOOOOOOWS -9,000 POINTS FOR WHOEVER MADE THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "This game is both metaphorically and literally, a large ♥♥♥♥ of content, jumbled into a chaotic mess for the sake of calling it creation and art. While it clearly borrows assets from other games, it also fails to establish any of its own. Between spending time on finding how to control the game, and then playing the damn thing, you've already sunk several hours into a game not worth playing. Once you've got to the deepest depths of the game, you feel as if you've only scratched the surface. 1.5/10 I do not reccomend this unsatisfying pile of crap advertised as a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game play. Can't play without looking at a game wiki. controls suck, runs in java and bugged otu multipel times. Not fun at all. Bummed me and my son out.",
            "review_score": "-1"
        },
        {
            "review_text": "Two warring factions in a state of constant tug-of-war over a blocky landscape with bases that can change hands between sides is a novel concept, and randomized loot à la Borderlands is nice, but there just isn't that much to do in the game, and progression isn't the most compelling. Graphics are very functional and kind of ugly, almost endearingly so. I haven't played this game's sequels, so I can't comment on the quality of those, though I've heard 3089 is a bit better. I would recommend this only to people looking to play an experimental actioner that's more proof-of-concept than game.",
            "review_score": "-1"
        },
        {
            "review_text": "A game that doesn't appear to go forward. The playability is poor, so the entertainment goes away fast.  The game has promising elements, and the concept behind it all is not bad. Maybe it just needed some adjustments to be better.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "A really janky game that is largely randomly-generated, repetitive MMO-style quests and which is more frustrating than it is fun. The feeling of improving gear and stats is undermined by a harsh penalty system and encounters that last too short to really apply much strategy towards (including the 'Block Action' portion of the game). The dev seems nice enough, and the sequel sounds like it's been improved upon, but this one is not really worth the headache. If you insist, try to find a tutorial first.",
            "review_score": "-1"
        },
        {
            "review_text": "3079 -- Block Action RPG is an interesting title. First off, I don't know if I would call it a role-playing game at all, it's more of an adventure FPS that has quests, equipable items, and skill increases...well, maybe that's enough to be an RPG. Either way, the engine and music in this game are very good. It's a very fun, sandboxy experience; however, as far as it being a game goes, it needs some work. The game is in desperate need of a tutorial, and it takes quite a lot of trial and error to figure out what you're supposed to do. Even after reading all the help menus and tips it took me three new game instances before I figured out to go into my inventory and turn of my jetpack to land instead of flying around aimlessly until I got killed by demons. The quests are also recycled a lot and it's pretty difficult to get anything done without dying.  That said, if we don't look at this title as a game and instead look at it as a sandbox engine and tech demo I'm pretty impressed. As stated above the music is *really* nice, and it's fun to play around in the engine for an hour or so (the grappling hook is my favorite). There's also a boatload of settings to go through (anti-aliasing, field of view, completely customizable controls - always a big bonus!) and a pretty simple multiplayer feature that hosts a local server with the basic game client.  Although I'd pass on recommending this game (unless you're looking for a well put-together sandbox game engine) I'm impressed with what the developer has created so far and am looking forward to future, more gameplay polished releases.",
            "review_score": "-1"
        },
        {
            "review_text": "when you first start out, it's not that fun; it's hard to start out. but when you do it can be quite fun",
            "review_score": "1"
        },
        {
            "review_text": "The game is not interesting, besides the bad gameplay and ugly graphics.",
            "review_score": "-1"
        }
    ]
}