{
    "app_id": 259810,
    "name": "Home Sheep Home 2",
    "release_date": "2014-02-17",
    "developer": [
        "Aardman Animations"
    ],
    "publisher": [
        "Aardman Animations"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Commentary available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 52,
    "positive_ratings": 104,
    "negative_ratings": 5,
    "price": 6.99,
    "description": "Shaun the Sheep's BAFTA-nominated puzzle game is back for a second baa-rilliant adventure! Join Shaun, Timmy and Shirley as they journey through over 60 levels of underground caverns, negotiate the busy streets of London and teleport through outer space all in search of the green, green grass of home.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/259810/header.jpg?t=1447359182",
    "minimum_requirements": "OS: Windows (XP, Vista, Windows 7) 32 or 64-bit Processor: Core 2 Duo (1.8GHz - although we have tested back to a Pentium 4 and it was playable) Memory: 1 GB RAM Graphics: It will work on all forms of GPU via the software rendering fallback (including Intel GMA and other on-board variants). Storage: 700 MB available space Additional Notes: The PC version is a native desktop application, taking advantage of the increased screen sizes and video card speed available. Supporting window or full-screen mode, with resolutions ranging from 640x480 to 2048x1536 it allows the player to enjoy the visuals in their full glory.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " A flufftastic game ewe've got to play!",
            "review_score": "1"
        },
        {
            "review_text": "Anyone for 'Shaun the Sheep'?  Well it is a game for fans, running through levels, as fast as possible to gain all three stars. Search for socks, getting game-pads, collecting some cakes for shirley... and this is a really little epic.  It is a game for fans of the series, and for kids... For them the game is highly recomendable. It is a 'jump and run, collect all the items'-game. For people who either dislike sheep, shaun the sheep or games that are 'simple' should try to make an achievement run - and then tell me again, this game is far too easy.  Timing is sometimes very important, so it can be a real challenge at times. Try it out yourself, and become a sheepaholic.",
            "review_score": "1"
        },
        {
            "review_text": "I love the game, it's sooo fun and cute, I absolutely recommend it for any fans of the TV series",
            "review_score": "1"
        },
        {
            "review_text": "While this game is also on mobile devices, I can say with some authority that it's actually better suited to computers. I have the ios version, and I only played a few levels before the controls annoyed me enough to stop playing. The game looks great on a bigger screen, and the controls work much better with a keyboard than a touch screen. In other words, despite being cheaper on mobile devices, it's worth your money if you like cute puzzle games with plenty of achievements. It's DEFINITELY worth your money if you're a Shaun the Sheep fan. StS fans will appreciate the familiar tunes, cute characters and good voice acting. Bonus points for disgruntled farmer appearances.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very cute &gt;w&lt; you have to use 3 sheeps to get through the mission Shirley, Shaun and Timmy are really funny  I love it !",
            "review_score": "1"
        }
    ]
}