{
    "app_id": 259910,
    "name": "Farming Giant",
    "release_date": "2013-11-06",
    "developer": [
        "Actalogic"
    ],
    "publisher": [
        "Toplitz Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Agriculture"
    ],
    "achievements": 0,
    "positive_ratings": 47,
    "negative_ratings": 172,
    "price": 1.69,
    "description": "The legacy of the critically acclaimed Giant games, already continued by the successful &quot;Train Giant“, highlights now the popular theme Agriculture up to a new level in “Farming Giant”, presented by UIG. In the best tradition of the giants-series the player will get a first-class business simulation crafted with a lot of details.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/259910/header.jpg?t=1528728657",
    "minimum_requirements": "OS: Windows XP / 7 / Vista / 8 Processor: 2,4 GHz Pentium or 100% compatible CPU Memory: 2 GB RAM Graphics: Nvidia Geforce 6800GT, ATI Radeon HD 3650 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows XP / 7 / Vista / 8 Processor: 3,0 GHz Pentium or 100% compatible CPU Memory: 4 GB RAM Graphics: Nvidia Geforce GTX 560, ATI Radeon HD 6970 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "This game is out since 2012, but has so many bugs which really kills the game. Crashing every now and then (found solution in forum saying to remove water and workers from building / field before changing anything = worked ). but then there is problem with cars, time to time they decide to stop moving for no damn reason. Definetly not recomended to pay for this game ....",
            "review_score": "-1"
        },
        {
            "review_text": "This game crashes all the time.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME. Too many bugs. Unplay.",
            "review_score": "-1"
        },
        {
            "review_text": "IMPORTANT UPDATE: when I wrote the review that you find here, I really hoped in a bit of work from the developer to remove some bugs and improve the game (it have potential!). And happened nothing... really nothing! This game is a good game with too many bugs and 'rough' point, and it's really sadly to say, I have to change my review and give a NOT recommendation...  ---  I haven't find any bugs of sort about the game: it haven't the best graphics, but it's also a sim/management game, so it doesn't bother me much, and the soundtrack is a bit strange, but still interesting. I understand if someone have problem with bugs, but... some reported bugs are (at least, for the last Steam edition) are simply non-existing!  For the rest, it's a simulation deeper than it might appear at first glance. You don't drive machines here, you develop a real business plan, with a consistent number of options and possibility. I't not also a simple game, and this if, for me, a good point. I'm playing it for several hours.  Normally, I will give this game a 7, but the fact that it is the only (true) simulation of this kind on the market, allow it to get a point... so 8.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome! There is some issues with crashing, but there are work arounds for this. You just need the patience to fiddle around with it for a while. For me it worked when I deleted all the scenario saves. It works perfectly now, and trust me, it took quite a while to figure out!  Even with the bugs, it's worth the price. It's realistic, absorbing, and though the tutorial could be better, it's pretty easy to learn and once you do, it's really fun. Build your buildings, decide if you want to buy or raise your supplies, whether you want to sell live animals or raw products and sell them or if you want to process them first... But remember, the more you have, the more you have to manage... Even if you're just growing crops, you have to watch the water, ph levels, your machinery maitenence... Where you buy your land affects those all...   If you love farming, or sim games, or both, you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "Needs to be removed from Steam. Does not work, Developers do not care... Remove it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game crashes and Steam does not seem to care",
            "review_score": "-1"
        },
        {
            "review_text": "It could have a much better and practical interface, to do things in this game is a little messy and even veteran rts-management players, like me, find difficulties during the first time playing.  If i could, i definely wouldn't buy it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Really fun game to play, sure it has it bugs but its still a well put together game. You just need to work around the errors and think why it crashes",
            "review_score": "1"
        },
        {
            "review_text": "First of all, if I could I would put 2 tumbs up, not because it deserved it, just because it does not deserved a 'Very negative' review. I think that a mixed review would be fair.  It's not a farming simulation like farming simulator, it's more like a farming management. You need to buy building, machinery, land and field. Hire and assign staff. Sell harvest, product, find contract, etc. There is no proper tutorial, but that's ok, you need to find out by yourself how the game work. That is something I enjoyed because it was not easy.   For sure that game have some crashing issues, but not that much. Save often and it's ok, it won't ruin the game. Maybe I was lucky. There is two thing you need to know tough (because - it look like / it's - a bug).  1 . Paved road is not considered as a road to connect your building, So don't connect to it exept one farm road to let your truck reach towns. 2. When you harvest, if you have an error message 'building not connected to road'. Maybe it is because you didn't assign your harvester to a place where it can unload the grain.   In summary, if you saved often and take time to learn the game, you have a good 10$ farming management game.",
            "review_score": "1"
        }
    ]
}