{
    "app_id": 259980,
    "name": "YOU DON'T KNOW JACK Vol. 4 The Ride",
    "release_date": "2013-11-05",
    "developer": [
        "Jackbox Games, Inc."
    ],
    "publisher": [
        "Jackbox Games, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Comedy"
    ],
    "achievements": 0,
    "positive_ratings": 56,
    "negative_ratings": 11,
    "price": 1.99,
    "description": "Play the game that many consider to be YDKJ’s most fun offering – The Ride! Already played it? Trust us, you've forgotten everything by now. For the fourth volume of the mega-award-winning CD-ROM trivia game show, the YOU DON’T KNOW JACK crew decided to throw out the YDKJ rule book and start fresh!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/259980/header.jpg?t=1478025930",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Processor: 500 MHz processor or faster Memory: 128 MB RAM DirectX: Version 9.0 Storage: 900 MB available space Sound Card: 16-bit sound card Additional Notes: The game runs at 640x480 max resolution.  Manually adjust your Desktop resolution if you want the game to fill the screen.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is my all time favourte YDKJ game. It's a little different to earlier games but it excells in almost every way. Cookie is the best and the writing is as hillarious as ever.",
            "review_score": "1"
        },
        {
            "review_text": "Its hilarious",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious!",
            "review_score": "1"
        },
        {
            "review_text": "The slightly different style of The Ride is bringing some extra spice to YDKJ. It's definitely one of my favorites out of the series.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. I have fond memories of playing this with my cousins. It's really hilarious and fun. Seeing as it's fairly inexpensive I'd reccomedn this if you want an out of the ordinary quiz show game.",
            "review_score": "1"
        }
    ]
}