{
    "app_id": 260130,
    "name": "Agarest: Generations of War Zero",
    "release_date": "2014-04-17",
    "developer": [
        "Idea Factory"
    ],
    "publisher": [
        "Ghostlight LTD"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Anime",
        "JRPG",
        "RPG"
    ],
    "achievements": 43,
    "positive_ratings": 248,
    "negative_ratings": 80,
    "price": 14.99,
    "description": "From the void, the gods of darkness and light created Agarest, a most perfect and divine world. As the generations passed, paradise sadly fell to the ravages of time. War darkened the skies and Agarest soon became a torturous hell as the gods divided and immense armies clashed, desecrating the once beautiful...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260130/header.jpg?t=1447359202",
    "minimum_requirements": "OS: Windows XP Processor: 2.13GHz Intel Core2 Duo or equivalent Memory: 1 GB RAM Graphics: DirectX 9.0c compatible graphics card with 64Mb RAM and support for v3 shaders DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows XP or later Processor: 3GHz Intel i3 or equivalent Memory: 4 GB RAM Graphics: DirectX 9.0c compatible graphics card with 128Mb RAM and support for v3 shaders DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "5/10  Agarest Zero is the prequel to Agarest: Generations of War. People who played the old Agarest will find that a few things have changed.   Starting with the good improvements. A fast-forward option during dialogue, fully turn-based dungeons with no more analog crawling or suprise encounters, and a slightly more informative esoteric book. A simplified version of the original Agarest is build into the game, and can be unlocked if you play NG+ on hard. As long as you get True End in the Zero universe, you will unlock True End in the Agarest vanilla universe automatically. You can unlock various vanilla characters and combine them into your zero party for maximum choice.  There are bad points too. For one, there are only two generations instead of five, although unlike Leonheardt who was stuck with a sword, you will have some control over Sieghart's weapon. The True End mechanic is also different, it being dependent on relationship scores and less than a handful of crucial storyline choices. You will not unlock the true ending unless you are familiar with dating sims; it is possible to get all nine women in the group to love you maximally, but unless you get somewhere close to that you won't get the true ending. The game is faster-paced due to less generations, but not fast-paced enough to warrent repeated crapshoots on the dating sim mechanic only to find out that you fail true end again and again. If you follow the True End guide for Zero on Agarest Wiki to a tee, it is a linear process and you can unlock it. But then Sieghart/Leonis will not feel like they have any consistent preference or personality. It will just be hardcore pragmatic metagaming.  On an important tangent, this game may be a little bit less friendly to female gamers than the vanilla game, because of the much more increased emphasis on the dating sim aspect. Women-to-women conversations in this game are also more superficial than vanillla. Female gamers can consider themselves warned.  It is a game with pros and cons, but if you liked the original Agarest then you might as well get Zero because it comes with a simplified version of the original game plus the interface improvements.",
            "review_score": "1"
        },
        {
            "review_text": "liek Japanese anime ?  want a kawaii waifu ?  go take the Agarest franchise available now for PC  the game might be a little repetitive in battle, but hell you can get to choose a waifu, get laid, make babies, and continue your legacy",
            "review_score": "1"
        },
        {
            "review_text": "Do you like anime? visual novel-like story telling? game difficulty with a curve akin to right angle?  Well do I have a game for you.   Jist:",
            "review_score": "-1"
        },
        {
            "review_text": "One of the few JRPG in the PC platform. Hundreds of hours of gametime awaits.",
            "review_score": "1"
        },
        {
            "review_text": "a very cool tactical turn based game, has a standar story but very long nice character creation with a waifu game included ( choose your wife, make a kid be happy)  you need to have a cool strategy for most bosses and enemies if you want to get better things in the game, nice crafting system, rewarding and more 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this series, I been waiting months for this to come out. It does not disapoint. It has all the great things of agarest and new ones like the cards. The tutorial is a bit long but this had lovely skip options for them. The combat is very similuar to the previous game in the series. The graphics are great, the sound very cute and I have found no lag, crashes or sound errors. I did find one glitch but it was not a game breaking one-in the second town at the adventurers guild it does a crazy split screen of the guild. It doesnt freeze or crash the game or stop you in any way. There is also some nice extras if you carry over your completed game from the first agarest. One which enables you to use a weapon that you can equip the capture spell early one. the characters are good one-mimi is down right funny and cute. The story line is good and also in theme of the series. the maps are the same layout of travel as in the prior game. warning there is alot of grinding in this game to beat the bosses even on normal setting..........completed game in 115 hours!",
            "review_score": "1"
        },
        {
            "review_text": "its quite an interesting game for JRPG/Anime lovers. Except a little bit too much of story telling at the start.",
            "review_score": "1"
        },
        {
            "review_text": "I like the second one a lot better because of cross edge's battle system, but it's still a very good game. You like tactical jrpg? -Buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "Having a hankering for a RPG I ended up picking up this title to scratch the urge. Am I disappointed? Yes.  The storyline is bland and generic and offers nothing intriguing or exciting to the player. At this stage I barely know what my goal is (other than looking after Mimel and picking up more (female) characters to add to my party) and I've no desire to find out. The parts that talk about the storyline are tedious and bland at best and ultimately unfulfilling for the player. A solid RPG should have the player wanting to know what the next twist in the game is; Agarest fails to deliver on that aspect. Considering playing on feels like a chore that I want to avoid doing at all costs.  The tutorial barely gives you the bare bones of combat which is simple enough to pick up despite being poorly mapped, and the character creation part is totally left uninformed. The player absolutely doesn't know what to do without the help of a guide and to be honest I have no idea what on earth I picked for the MC, Sieg. Combat gets boring and repetitive quickly. If you're a player who dislikes grinding there's no worry as you're forced to grind and play through fights just to get anywhere on the map.  Speaking of characters, the characters of the game are bland, dull and boring with predictable, mundane personalities. There's a womaniser without a hint of charm, a little mysterious childish girl and then there's the MC who is the equivalent of bread without butter. The voice acting and somewhat pretty character designs aren't enough to carry the personalityless characters through with the bland script. Another part of the game which is a little more fun is the dating aspect where you woo the ladies you pick up for your party. However, Fire Emblem: Awakening offers the same kind of game as Agarest but with a better script, a easier to follow plot and interesting characters.  For the most part, Agarest has a lacklustre script and a poor combat system which ultimately lets the full game down. A much more interesting story with more engaging characters is the minimum this game would need to carry it through with the current combat system. The pixel graphics are somewhat charming, at the very least.  My overall opinion? I wish I could refund this game and would do so in a heart beat if I was able to.",
            "review_score": "-1"
        },
        {
            "review_text": "Agarest 0 is a great game for rpg players especially if you liked the disgaea games. only bad thing is no english dub. overall its a great game",
            "review_score": "1"
        },
        {
            "review_text": "War,,, War never changes. But Waifu does choose from an assortment of Waifu as far as the eye can see.",
            "review_score": "1"
        },
        {
            "review_text": "lovely gameeeeeee............. if u love anime u should play this",
            "review_score": "1"
        },
        {
            "review_text": "First off , this game bears potential to be remarkable. That however , fails to keep up the motivation long enough to endure its biggest downside. of the 78 hours i played , 90% of the time were spent in battle. Not 'ever changing', challenging battles , that make you curious for more though. It is the same , boring strategy of the same long battle over and over trough the whole game, one hundred times fold. one fight may take 10-20 minutes , the number of fights between the bits of storry parts grow from just 3 to monstrous 15+ , and with monsters getting more hp and numbers, its only getting longer , but hardly more challenging or refreshing in any way. Further more , unless you paid for the DLC for a nice cut down of battle durations, you will likely end up forced to grind for materials - which are needed to craft the newer weapons and skills , because they can NOT be bought from the shop just like that. Unless you want to run around with your lvl 1 sword trough the whole game , you'll be forced to go repeat some dozen times of the battles you're sick and tired of anyways. Note also , that with those 78 hours i did not grind , because the addons came with a sale package. At first , i was motivated to make no use of them , however... the frustration with the sheer amount of time spent doing boring, long and repetetive battles ended up changing my mind. Note also , that after nearly 80 hours , i have about 20 more hours of gameplay ahead. If this game is played without resorting to DLC weapons , you're in for 120-140 hours of torture. about 14 hours of those are enjoyable content with storry and challenging boss fights. All the rest feels like a horrible content stretching mess , meant to make people pay extra money for DLC packages with proper weapons.  While i can't possibly know, wether you will not enjoy this extreemly unballanced ratio of mental torture and occasional fanservice, i can say for sure that i did not. For a game heavily relying on time spent in tactical battle , it lacks tactical variety.",
            "review_score": "-1"
        },
        {
            "review_text": "Now, I love rpg's and I grew up on turn based combat, but this game is severely lacking. You basically move from dot to dot on a map with very little variation. Each dot either represents a fight, a village or event. Oh, and I guess there are some quest dots you enter into that just contain the above. There's a solid amount of customization, but it doesn't seem to serve much purpose. In almost 10 hours there hasn't been one fight that required any effort.   Then there's the story itself. It feels like it could be interesting, if the characters weren't so cookie cutter and bland. You push through the drawn out fights to get to an event and you get terrible dialogue and hardly any real background on the story. Now I know 10 hours isn't enough to see the whole story, but it's more than enough to get the feel for the game.   So if you like repetitive battles, boring characters and ZERO exploration, this is for you. Everyone else should find something else.   Overall-4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Bad  Combat is shallow and confusing.   (Moving where the game tells you, instead of where you want to move? why even bother with making it grid based?)",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome Try It",
            "review_score": "1"
        },
        {
            "review_text": "It has crashed twice already",
            "review_score": "-1"
        },
        {
            "review_text": "The storyline and combat system is great in my opinion, took a while to get a proper understanding on how some things work, like capturing enemies, and some things I'm still a bit puzzled on, but it's great. The only problem I have with it is that combat feels a bit too slow paced. Like it takes 10-20 minutes to get through two battles and reach the next destination, well, that's what it feels like to me, I didn't time it. Anywho I guess it's becuase I'm eager to get to the next part in the story and these fights in the way are keeping me from my story so it's a bit annoying",
            "review_score": "1"
        },
        {
            "review_text": "I love this game sooooo much! i did not know about the whole 'Soul Breed' system until a friend told me, but i like the game more for it! xD ",
            "review_score": "1"
        },
        {
            "review_text": "this game is swag",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Old school FF style RPG's out there. Very in depth and many hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "The Prequel to Agarest Generations of War I highly Recommend yous tart from Agarest 1   The characters are Enjoyable and the game has alot of Depths .  ",
            "review_score": "1"
        },
        {
            "review_text": "a positively amazing game with a reasonablke amout of difficulty and story the stroy is amazing and spans two generation and the romances feel real like you actually had to earn them except every now and again the choices are a pain to even make because your ♥♥♥♥ed if you ♥♥♥♥ one off other than that this game is worth the buy and will take you some time to complete, the major dounside is the bosses all seem to posses ♥♥♥♥ing counter which can ik a character with over 4k health*cough cough* op and the micros spawn in the boringly stereotypical way compltely healing all the damage you just did to the boss in one move but other than ♥♥♥♥ like that which make your rage quit its an excellent game i give it a 8/10 for boringly stereoypical boss fights and if i never have to see the move counter again ill die a happy man, and now i must give this game a 10/10 because i was a backa and didnt advance train my peeps after i did that i was the one kicking the bosses ♥♥♥ up and down the battlefield singing falling in reverse songs as i laughed like light yagami when you get proof of valor and hit lvl 45 train them with the proof of valor and its smooth sailing gents 10/10 would develop god complex again, but this games bosses are stupidly overpowered with moves that never miss and instant kill you at full health that takes this game down several notches and is its greatest downfall, i am personally ♥♥♥♥ing done with the god damn game what the creator knows about balance can fit into a ♥♥♥♥ing thimble! enemies that easily do your entire parties combined health in a single set of attacks is ♥♥♥♥♥♥♥t! im running 20k health and getting my ♥♥♥ handed to me by a floating ♥♥♥♥ing ♥♥♥♥♥♥♥♥ bird! the boss battle with mimelia can easily be summed up as an effort in futility! she just jumps in the middle of my team and iks us in one move! how is that ♥♥♥♥ing balanced! very god damn enemy i run into has ♥♥♥♥ing ik moves and compltely overpowered attacks!",
            "review_score": "1"
        }
    ]
}