{
    "app_id": 260210,
    "name": "Assassin’s Creed® Liberation HD",
    "release_date": "2014-01-15",
    "developer": [
        "Ubisoft Sofia"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Open World",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 952,
    "negative_ratings": 698,
    "price": 16.99,
    "description": "Introducing Assassin’s Creed® Liberation HD, the striking chapter of the pre-American Revolution Assassin’s Creed saga which arrives for the first time on HD consoles and PC. With improved gameplay, a deeper story, and HD graphics, Liberation is an immersive and full Assassin’s Creed experience.The year is 1765.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260210/header.jpg?t=1532007147",
    "minimum_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 / 8.1 (both 32/64bit versions) Processor: Intel Core i3 2105 @ 3.1 GHz or AMD Phenom 2 X4 955 @ 3.2GHz Memory: 2 GB RAM Graphics: Nvidia GeForce 8800GT or AMD Radeon HD4870 (512MB VRAM &amp; Shader Model 4.0) Storage: 3500 MB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Supported video cards at time of release: Nvidia GeForce 8800GT or better, GeForce 9, GTX 200, GTX 400, GTX 500, GTX 600, GTX 700 series. AMD Radeon HD4870 or better, HD5000, HD6000, HD7000, R7 and R9 series.   Note: Latest GeForce drivers tested: 331.65 for all series. Latest Radeon drivers tested: 13.9 Legacy for Radeon HD4870 and Windows Vista, 13.9 for Radeon HD5000 and above.  Laptop versions of these cards may work but are NOT officially supported.",
    "recommended_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 / 8.1 (both 32/64bit versions) Processor: Intel Core i5 2400S @ 2.5 GHz or AMD FX 4100 @ 3,6 GHz or better Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 570 or AMD Radeon HD7870 (1250MB VRAM &amp; Shader Model 5.0) or better Storage: 3500 MB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Supported video cards at time of release: Nvidia GeForce 8800GT or better, GeForce 9, GTX 200, GTX 400, GTX 500, GTX 600, GTX 700 series. AMD Radeon HD4870 or better, HD5000, HD6000, HD7000, R7 and R9 series.   Note: Latest GeForce drivers tested: 331.65 for all series. Latest Radeon drivers tested: 13.9 Legacy for Radeon HD4870 and Windows Vista, 13.9 for Radeon HD5000 and above.  Laptop versions of these cards may work but are NOT officially supported.",
    "reviews": [
        {
            "review_text": "Originally, this game was made as an exclusive title for the Playstation Vita, but was later ported to other systems, like the PC. Yes, it's a port, and it shows.  It's supposed to be a HD game, but don't get fooled by that. Though the graphics are not ugly, there's loads of examples of low res textures everywhere. But the worst part, is that the FPS seems to be locked at some very low value, which gets VERY straining on the eyes. And that's my #1 issue with this game, it's painful to play it.  The new feature that makes this game different from other AC games, is that the main protaganist can change between 3 different 'roles', each with a suitable outfit for that role. The roles are Lady, Slave and Assassin. When playing a certain role, there are restrictions to what you can do, or extra things that role can that no one else can. For example, as a Slave, you can pick up crates and walk past guards unnoticed, if you don't take too long.  Sounds interesting? Well it isn't. It's a good idea that ends up being a barrier, and restricts you.  Else it's just more of the same. This game is often considered as a standalone addition to AC3, so if you've played that one, you already know a lot about what you're getting. Though it isn't nowhere near the size of AC3.  The low FPS is the main reason I'm not recommending the game. But apart from that, the rest is pretty much 'meh...' and not really worth spending much money on. If you're still interested, pick it up on sale, do not buy it at full price.",
            "review_score": "-1"
        },
        {
            "review_text": "The word for today is mediocre, that word describe the whole game.  -weak story (the ending was kind of ok in my opinion) -weak characters (just bad and uninteresting) -bad voice acting (oh man f*****g horrible...) -boring missions.  +changing persona. +the ending. +the mission with Connor was cool.    ",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend the game but with a huge caveat: of all the Assassin's Creed games I've played, this is by far the most buggy. Here's the bugs I spotted without even searching for them in my 31 hour play through: -Game controls locked up repeatedly when pressing the wrong button after B when being attacked by a wild cat. -Canoes about 30-50 feet floating in mid-air (unsuable). Restart game required. -Mounting and dismounting canoes often is more difficult than it should be. -The mission where you are supposed to scout out the three camps, I was a slave and looted the chests without alerting the guards. The subesequent mission where you are supposed to loot the chests therefore breaks because 2 out of 3 are still in looted condition. I have yet to find a way to replay the mission to reset the chests. -Game will only accept input from keyboard+mouse or controller at once; it does not accept both; moreover, when my wireless controller turns off and I turn it back on, the game switches to and stays in keyboard+mouse mode instead of going back to controller. -I've had a flickery static effect that usually only happens on level transitions keep happening over and over again. I had to restart the game because it was driving me batty. -When exiting combat and sometimes looting, the look controls often lock up while it is finishing a painstakingly long animation. Very annoying. -Typo on Lady Persona page. -It takes too long to open/close map/menu. When are developers going to learn to stop animating menu entry/exit?  I also have one general complaint that applies to Assassin's Creed III as well: get rid of or automate the trade system. It feels like work to use it which is a lot like Mass Effect 2's planet probing.  Despite all of that, I still recommend the game and the reason why is simple: it's better than Assassin's Creed III. Not as long, not as varied, and no manning the helm of a ship, but the story in this game was actually enjoyable and the new mechanic of personas and the addition of the whip was a nice change. Granted, if you're tired of Assassin's Creed gameplay, especially Assassin's Creed III, avoid this game. If you like Assassin's Creed despite this title's particularlly glaring shortcomings, by all means grab it, play it, and enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a Fair Game, good to play once through but not much replay value. Still all in all goood game, get it while it's on offer though",
            "review_score": "1"
        },
        {
            "review_text": "originally released as a tie-in for ACIII on Vita, this remastered edition of Liberation is pretty great, but not without it's flaws. it's ubisoft open-world formula at it's most restrained and very slimmed down. however, some things are too slimmed down.   the biggest let down, in my opinion, is the story and characters. i imagine that because the game was originally designed for a portable system and the audience that comes with it (ie. pick up and play for 10 minutes at a time), the concept had to reflect that and so a LOT of plot points and characters aren't well-developed.   that being said, it's still really cool to play AC with a rad as hell lady protag in a scenario that is often avoided by games. def recommanded on sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's like 'My First Assassin's Creed'. On the plus side, it's a small self-contained Assassin's Creed game; it comes with nice environments, nice clothes, the usual mostly-suave locomotion, and some (but not all) fun missions. On the downside, the plot is gibberish, the port from the Vita leaves it looking super-ugly, and the gameplay is often parcelled out in lamentably small portions. Plus, the 'strategic' elements are utterly pointless. Overall, I felt a bit disappointed, but you don't often get to play a black French woman in a game, so it was interesting for that at least.",
            "review_score": "1"
        },
        {
            "review_text": "I simply will not sit here and tell you the story, I won't spoiler, nor will sum up the game. I'll just say what I really thought of it. For some ♥♥♥♥ing reason that no one understood until today, Ubisoft remembered to spend a PS Vita game to other platforms.  For me, they could continue to work were an upcoming Assassin's Creed, and ensure that it won't be a ♥♥♥♥ like III was(Connor fans will revolt..).  ● And let's start out there, they could have released for PC, PS3 and XBOX 360 Assassin's Creed: Bloodlines, which would complement the story of Altair, but no, they had to go put the continuation of the worst Assassin's Creed ever, which basically is the DLC Black Flags: Cry Freedom. ● I know many people were bugging Ubisoft to make a game with a female character, I want it to happen. But I don't want a game made in months just to shut up the fans. ● I just think it was ridiculous lauching a game so close after AC IV. After such a good game, people will play it and will think 'R.I.P. Assassin's Creed'. ● Not that the story is that bad, because it's not, but it's monotonous. At no point you're gonna want to keep playing with that desire to know the story, if you have to go to sleep you will go, and you won't play the game for two or three days. And it makes me confused, being assumed fan of Assassin's Creed as I am, I did not understand the purpose. ● I even like Avaline, I find her to be strong and warrior, demonstrates some times be stubborn and that she believes in herself. Aveline has as much skill as Edward, Connor, Ezio or Altair, and she can still shake her ♥♥♥, huh? But, no one will remember it in a few months, no one will immortalize as they did with Ezio. No one will be crazy to get the game to go in search of collectibles, no. There is nothing attractive about it, not ♥♥♥♥ nor ♥♥♥ will save it. ● The graphics are not the best in the world. At the beginning I hated it, but some settings resolve this. I did not expect them to be TOP, as if someone thought that paying 20€ for a game that came from PS Vita and have the most power overpowered graphs, right? I like the scenery, I think that diversity is even minimally acceptable. ● The gameplay is typical of Assassin's Creed, it's fluid and at this level I don't think that I could criticize much. Being that came from a portable platform, the adaptation was very good. Just explain to me why that 'E' does everything, but it's ok.  I must confess that I was surprised with the game, it's not as bad as I was expecting. Initially I thought it would be about five hours of gameplay and bye, but I was wrong. However there are a lot of negative thing I have to point out, especially that the story is so boring. AC always scored in the story.. In addition to the circumstances in which it was launched in. For the fans, I recommend you play, but if you don't play, your not losing much, and neither will be happier because of it. Seriously, this somehow hurts to score an AC game like this, but after all that said I think they know that the classification is valid.  ★★★★★★☆☆☆☆ 6/10 ",
            "review_score": "1"
        },
        {
            "review_text": "further story for the series but not as fun as the rest still worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. I have to say that Ubisoft caught me by surprise when they made a female to be the main assassin. Sure there were female assassin's, but they were only backround characters. At first I was confused about the game when it started but as I continued playing it began to make sense and the storyline making sense and getting much more interesting. The graphics are amazing, the accents are perfect, and the historical sense is almost to completely accurate.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best AC's out there. Characters and storyline are brilliant, well developed and had you wanting more. Although there was a lot to do, I do wish this was a full length game.",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed: Please Make it Stop  That should have been this game's title.   If you like the formula, then this game is for you, but if you're in it for the story. Go read a summarization.   This game like all the otheres after Ezio's trilogy, is just run around and pick stuff up. That's all. Boring. Not worth it.   Unless you like crying yourself to sleep because you could've used that money to take your friends out for a nice coffee.   ",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoyed this Assassin's Creed. Changing Avelines outfits gives this game a new twist. Parasol gun ftw!",
            "review_score": "1"
        },
        {
            "review_text": "This is the first real shot ive given any Creed game.... WOW I really enjoy it and while sure it may have crisper graphics but nothing you havent seen from a well funded 2011-2012 game in the year 2014.... its affordable and the story is gripping and quite deep... Aveline is a crazy great character to play and has possibly the most intriguing back story i have witnessed in a long time of gaming! The fighting and climbing is slightly slower and grittier as Aveline is tall and solid but slender, still only a 70-80kg woman which they totally take into account! The climbing and fighting rely on finnesse and her ability to misdirect and avoid taking damage instead of the usual counter then become unstoppable i hear about in other creeds games.... Its political, smooth, gritty, realistic, quite beautiful, mature and frankly alot more fun than driving a pirate ship like its a formula one car in the pinnacle of unrealism that is the 'latest' creed to date.... Liberation offers alot more for alot less money and wont ♥♥♥♥ you off with complete and utter pirate nonsense....   Upon killing all CitezenE characters and unlocking the true story.... which isnt hard.... this game was a 9.5/10 for me... considering this games background and history that is a perfect score for any creed game i am not really fans of... this is refreshing, smooth and an incredibly interesting story that will keep you wanting to play just to find out the truth! Legendary Game...",
            "review_score": "1"
        },
        {
            "review_text": "The worst Assassin's Creed series so far..",
            "review_score": "-1"
        },
        {
            "review_text": "I wasn't really sure what to expect from this game going in. The PS Vita version got some pretty mixed reviews, so I was skeptical. Ultimately, Assassin's Creed: Liberation HD won me over. It's pretty short compared to the main Assassin's Creed games, but for only $20 it's ultimately a solid deal. The game plays mostly like Assassin's Creed 3, with the exception of the cool, new kill chain feature, which allows you to quickly target up to 3 enemies at once and kill them all in quick succession. It's fun. There's also a new take on the notoriety system called personas. Aveline, the game's protagonist, may change between 3 outfits that change how guards treat her. The standard Assassin getup allows for full mobility and equipment usage, but you always have your notoriety meter at least a quarter filled. Her slave disguise also allows free-running, but she's restricted to blow darts, her hidden blade, and a machete. She can sneak right into restricted areas as long as she looks like she's working, but socially unacceptable actions carry a much higher noteriety penalty than usual. Aveline's Lady persona, aside from making her look pretty attractive, makes her nearly impossible to discover in restricted areas, but the dress she is wearing prevents her from climbing at all, and allows her to move on foot at a jog at the fastest. She is also limited to just her hidden blade and a parasol gun. It was an interesting new idea that was mostly successful, but could have used a bit more freedom and variety in practice.   On the story side of things, the game is pretty irrelevant. I couldn't help but often question why Aveline was going through any of the scenarios I was playing. There's no sense of urgency to the game that drives the plot forward, unlike the main series. Visually, the game is pretty impressive. Again it's roughly on the same level as Assassin's Creed 3 in that regard. The game world itself is a decent size. Over the course of the game, you visit New Orleans, the Lousiana bayou, and Chichén Itzá: a templar controlled colony in Mexico. New Orelans is similar in size to AC3's Boston, while being a fair bit more colorful and varied. The Bayou is dwarfed by the Frontier, but it's still farily expansive and takes some time to fully explore. Overall, If you're looking for a little bit more Assassin's Creed to tide you over while you wait for Unity, Liberation is a worthwhile buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, everyone should try it ;)",
            "review_score": "1"
        },
        {
            "review_text": "ACLiberation was overall a boring game and the only reason one would have to play it is to play every AC game. Poor storyline and exactly the same gameplay as AC3.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels like AC2, with the combat/ free running system from AC3; now this is a awesome AC game",
            "review_score": "1"
        },
        {
            "review_text": "a bad port of the original assissins creed liberation here is why screen goes black when going to buy weapons and a bit buggy still overall a good game and great combat",
            "review_score": "1"
        },
        {
            "review_text": "This is okay,  As an Assassin's Creed fan. I think this is a good game! The game runs really smooth. I thought this game would have problems but it does not has problems at all. Well maybe a few for some people :(  The negative thing about this game is that I just don't like how the game starts. It just felt so boring when I played the first mission to be honest with ya.  But playing as a female character in Assassin's Creed is cool but I would like to play as Claudia Auditore. I love Ubisoft no matter what but I really would like to play as Claudia Auditore.  Graphics:8/10 Gameplay:8/10 Sounds:10/10 Controls:10/10  Multiplayer: Not in this PC Version :(",
            "review_score": "1"
        },
        {
            "review_text": "I think this game was released just to fill the void of there not being a new AC game every 6 months, and it really shows it. From my game experience it was really buggy and just unsatisfying to play. The story wasn't really that great either, but I guess it showed some insight to the time from a POV of a woman, that could be part of both the free people and the slaves, as it's a mechanic in the game. And finishing the game didn't give any satisfaction as well, or the feeling that it should continue forever like I had with Ezio trilogy, but I guess that we will never encounter that feeling playing an Assassin's Creed ever again. Or maybe Ubisoft has finally changed?  If I could go to the past with my present knowlage, I wouldn't buy this game. For really cheap maybe, but not really worth it. From 1 to 10 I would give it a meh!",
            "review_score": "-1"
        },
        {
            "review_text": "I got this after completing the Ezio trilogy, thinking nothing could top how much I liked them. This absolutely does. It runs 100x smoother, has more longevity, and above all, feels more realistic. I've thought time and time again that Ezio (and the other assassins) stick out like sore thumbs in their robes, and finally, it got addressed. Aveline can dress as a Lady, to blend with the elite crowd and charm/bribe guards into letting her in restricted areas. She can dress as a Slave, to blend with other workers and get in to places only slaves would be allowed, as well as being able to free run and climb in this persona. And thirdly, we can dress as an Assassin, but the attire looks more pirate/sailer in my opinion. The only downside is that in Assassin persona, you're always slightly notorious.   Another issue I've had with previous AC's is that you can't climb trees...the one thing even most regular people could climb. Aveline not only climbs trees, but can take advantage of hanging vines to swing from tree to tree. You also get a whip some 1/4 way in to swing from things with, and to catch and drag back enemies that might be running from you.   There are plenty of side missions, a large amount specific to each persona, which means you can switch as you please to do missions you're in the mood for. You make money in Liberation by using the ship trading system, which is pretty fun and easy to use.   My only qualm with this game is that it uses the newer fighting system, and I find it a bit player unfriendly.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: The latest patch appears to have fixed my initial control issues in my original negative review.   Other reviews cover the plot better than I can at this time. I've only been able to play about an hour of the game.  From my limited perspective, the game appears to work as any Assassin's Creed game should. Avoid detection, blend into the crowd, etc etc. The concept of switching clothing seems awesome at first, but I've all ready found pretty early in the game that this doesn't seem executed well.   The limitations of, say, the Slave Girl versus The Asassin make sense story wise, but makes for awkward play. I believe a different reviewer pointed out s/he would just wear whatever Aveline happened to be wearing at the time to get the job done. It's this disjointed execution of limitations that give rise to a more complicated combat system, but not really depth. If one were to pick at this thread a little more, it would seem odd how an assassin would lose access to tools simply because the clothing was different. Assassins are assassins regardless of their garb. I think this observation is part of the blocky combat issue noted by other reviewers. In other words, Slave Girl should be as effective as The Assassin and vice versus, but this is not the case.  It's still early for me in the game, and so for now, I will recommend the game because I'm enjoying it. If the game somehow completely breaks for me, I will note it here and change my recommendation if I feel its warranted.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game that I first played on the PS Vita. It looks very good in this HD version and is just as fun. I highly recommend it to anyone curious about the franchise or to any AC fans.",
            "review_score": "1"
        },
        {
            "review_text": "Originally released for the Vita, finally got a release on PC! I was waiting because as a fan of the series I like to have this one under my belt. To compare it to a full price release would not be a fair. It's about a good 7-9 hour side story during Assassin Creed 3's timeline/era. For what it has to offer it does it well. As like all other Assassin Creeds it sets out to tell you a great story and it accomplishes that, gameplay and mechanics stay true.   I can only really recommend this to die hard assassin creed fans, looking for a fix between mainstream releases. It's brings a couple new ideas to the table, but nothing absolutely amazing. The story like always is great, but as a change of pace it features a female lead. All in all give it shot and show Aveline the spotlight she deserves",
            "review_score": "1"
        },
        {
            "review_text": "Pros: +Connor is in this for a mission  Cons: -Weak story with the true story done as a optional side quest -empty missions. - The missions given feel more like a chore ",
            "review_score": "-1"
        },
        {
            "review_text": "I had fun with every single Assassin's Creed game, including 3. Wouldn’t necessarily want to replay them, but still. They provide for great spectacle, high-stakes melodrama, and stupid historical fanfic. This game had all the trappings of an AC game without really doing any of the things that make these games interesting. I’d love to read a bit about what went wrong, because the issues this game had were on a design level rather than anything to do with hardware limitations. A last moment rewrite eliminating a focus on Connor, maybe?   Also - it's hella crash prone, buggy, and really terribly designed in terms of color palette. Just dull greens and browns conspiring to overwhelm you in meh.   More in-depth impressions  on my journal  [xander77.livejournal.com] .",
            "review_score": "-1"
        },
        {
            "review_text": "A great game that is a great edition to the assassins creed series. its a must have game",
            "review_score": "1"
        },
        {
            "review_text": "ok it my be a good game but i dont even know but one thing i will say is DO NOT MESS WITH THE RESOLUTION SETTINGS!!! i wanted my resolution to be my whole screen so i clicked on some of the resolution and checked them out then i got the 'input not support' thing... so yea... i can no longer play the game and i was only on the bit where you chase the chickenat the start... i tried everything from re-installing it to validating files and checking the actual assassins creed liberation file and also loocking on google for help but no this is un fixable. i hope that one day they will make a patch or sumthin but yea i just wasted what? 15 pounds on this game to have it ♥♥♥♥ up and be un-playable so yea... thumbs down...",
            "review_score": "-1"
        },
        {
            "review_text": "Do your self a favor, just go watch the combined video on youtube. The lack of connection to the overarching story line is what hurts it the most.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like buggy movement, a bland story, and joyless gameplay, this is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Good graphic, nice quest and good BGM . But lack of things to do, should put more because its good side quest everytimes i do it. Hope next game have more quest and more option. Myabe should try consider put choice option like kill or not. Anyway overall its good 8/10. Thank you",
            "review_score": "1"
        },
        {
            "review_text": "Based on the same gameplay mechanics as AC3, this game achieves more good than it predecessor. Even though it is a ported game.   Disguises are really what makes the game more stylish, diverse and stealthy. Having played Hitman for the first time just recently, I realised how much a disguise can mean. And here, to be able to change is what the game really needs. Each disguise has different tailor variant, different weapons (sometimes not ownable by other personas), different blending, different notoriety. It’s a pity that by now this was only implemented in this game.   Fixed convoys and trade system. Now it calls for investments and regular check ups.   Underwater missions are really good and if you play the games chronologically, this will come before marvelous diving missions from AC4BF (technically, here they tested it out, the same they did woth Aquila in AC3).  Of course, since the game was small, the city is smaller, the ‘Frontier’ (here – Bayou) is smaller, the gameplay time is less, but it good since you don’t grow tired of it.  One of the most correct games in all the franchise, totally recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I was able to download and install the game without any issues. However, It is unplayable from a performance perspective. The game video and audio begin to chop from launch. I have tried almost every solution on the Ubisoft forum(I have found no official advice from Ubi at all) and have had no success. I am able to run AC: Black Flag on the highest settings without issue so I am hard pressed to believe it is a hardware issue. I would not recommend anyone spend money on this game. I wish it worked as I really looked forward to playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is honestly the worst Assassins Creed game I have ever played. The story has much to long for and it is drawn out with terrible plot lines and boring missions",
            "review_score": "-1"
        },
        {
            "review_text": "As an Assassins Creed fan that hated Assassins Creed III, I hate this game even more. The reason why I bought this game anyway was because I saw potential in the lead female protagonist. What I found was a boring story, boring unchanged gameplay, and boring characters. Yes, I know that this is a Vita port but I still expected the writing to be at least acceptably adequate. What we get as a result is a boring game with very little content. This was a total waste of money for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Just the way i like acs. I woulda say it's a combination between brotherhood and ac 2 and you gotta play as a girl, am lovin it so far. No glitches, no errors, 8.5/10!",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing, as all the games in the series, it blew my mind.",
            "review_score": "1"
        },
        {
            "review_text": "The lady has really nice boobs.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing i love it :D",
            "review_score": "1"
        },
        {
            "review_text": "three words L A G",
            "review_score": "-1"
        },
        {
            "review_text": "Hardly enjoyable storyline even for just 1time playing, its pretty BOOOORRRRRRRRRIIIIIIIIIIIIIIIIIIIIINNNNNNNNNNNNNNNGGGGGGGGGGGGG!!!! -_-",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics aren't so hot and there's glitches with the shadows on ultra. The voice and the animations don't match up very well in the interactions. The massive huge bubbles to show you where you need to be are incredibly obvious and look terrible, but hey, it's an ASSASSIN'S CREED title!",
            "review_score": "1"
        },
        {
            "review_text": "Worst assassin creed game. This is ofcourse a cross platform game. Biggest con was the bayou. A place that is 50% water is pretty hard to travel through. More useless collectables. Story is not good. Get this if you are a true fan and or are bored. I thought wearing a dress with an umbrella that shoots poison darts was interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "It's ok.",
            "review_score": "-1"
        },
        {
            "review_text": "Utter trash.",
            "review_score": "-1"
        },
        {
            "review_text": "+ not bad story + interesting character split between assassin/slave/lady + quick kill sequence move - if you plan to do 100%, you will suffer terribly by the bugs and other annoyance by the environment (for example defend the raft 100%)  - disappearing menus, or progresses, even at the start if something not happened as planned by the developers (for example made a throw at the start then the game progress been done and stucked between the start and tutorial part, so needed to start over); this is really RIDICULOUS how not been tested, it's unacceptable from an AAA developer company... - if you stuck by disappearing menus, game restart and mission restart helps most of the time, so you no need to start over",
            "review_score": "1"
        },
        {
            "review_text": "The over-arching story makes very little sense, in fact practically every story line portrayed in the game makes very little sense. There is very little lore/cannon that links this game to other AC series. If you're a fan of the AC series you wouldn't miss much by skipping this game. That being said this game is quick and easy so if it's on sale it might be worth picking up for a quick playthrough.",
            "review_score": "-1"
        },
        {
            "review_text": "typical ubisoft console port, as a casual gamer, i really liked it. its not deep, has the odd graphics anomoly and glitch, but lets face it, its a handheld game console port. with everything turned up, its beautiful, yet puts the hurt on my 4930k, SLI 970s, 80% usage(2560x1440). altho its locked at 60fps, even with vsync turned on theres a bit of tearing. controls are a bit clunky, but its not a fast paced game anyways. Uplay is tied into it, isnt a good or bad thing since i already have Uplay, but i really prefer DRM on STEAM to be STEAM only. bought it for $3, which is an awesome price in my books!",
            "review_score": "1"
        },
        {
            "review_text": "Really impressed with the port, and the effort they put into reworking the game for the PC. And it looks amazing and plays well on a larger screen. Much better than straining your vision on the PS Vita.",
            "review_score": "1"
        },
        {
            "review_text": "I have never played an Assassin's Creed game before, but this came up in the steam sale so I thought I'd give it a go.  This is quite possibly the worst game I have ever played. The controls are clumsy and I never felt totally in control of the character. I tried using both mouse and keyboard, and xbox controller but neither felt right. The story is so incredibly boring, the voice acting is terrible and the missions seem repetitive.   All I've done so far in the game is walk around, and now I've been sent to some mansion to kill some guy. I haven't even killed anyone in the game so far and now I'm expected to kill 8 guards with muskets. I don't even know what the controls are to attack, and because the stupid game doesn't even have a proper 'controls' section I can't find out.... so I can no longer play this game. After 15 mins of button bashing and dieing I am giving up.  Waste of time. I would say waste of money but I only paid about 2 pounds GBP for it, which is more than it's worth.  I'm not going to give up on the franchise though, I'll give black flag a go.... when it's on sale again",
            "review_score": "-1"
        },
        {
            "review_text": "I have experienced a stupid glitch that has rendered using a controller, impossoble. Sometimes, on launch, the game will crash. The gameplay is good. I love the game, but these technical problems make it impossible to play. Believe me. I tried playing AC Unity with mouse and keyboard. The mass amount of lag and crashes, plus the terrible mouse and keyborad controls, destroyed the experience. This game, might be tolerable because of the lack of lag. Not for me though.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played all the assassin's creed games and for a HD title, this is pretty nice. I liked playing as a female protagonist for a change and it was a great change to say the least. The story was fine and so was the gameplay. Its short and sweet. I would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "What we have here is a failure to communicate... with the simulation timer.  The story in Assassin's Creed: Liberation HD is incredible, I honestly don't understand how they started it off at such a low price originally. The persona (character) options also make for an interesting, realistic experience.  The problem is the simulation timing is off. There is a dizzying, herky-jerky, pause every other second, almost as if the frames are being rendered faster than the game mechanics can react. Every minute or two, it gets so backed up that it even loses input response. Many times I had my kill or jump timed perfectly, only to have the controller become unresponsive momentarily, leaving me able to do nothing but watch Aveline's ragdoll corpse jostle about.  It is worth noting that the story kept me playing all the way through, but it was only my 30 years out of 35 in gaming experience that kept me from hurling up my lunch evertime I played. Suffice it to say, a controller was nearly laid to rest from the frustration of this unlikely game engine glitch.  And before you blame my hardware... An MSI GT70-2PE Dominator Pro, with its NVidia 880 and 8GB of Video RAM, should be able to hand this 1 year older game, with the ease of pilfering confectionary treats from a prepubescent child (like taking candy from a baby).  Addendum (One week later): Having completed the game, I can guarrantee that the story is wonderfull, however the game suffers from egregious annoyances such as enemies attacking before they can be targetted, attacks from literally invisible enemies, random hangs when reloading guns, random roof edges in open, flat areas, and the previously mentioned severe lack of smooth simulation timing. These annoyances continue throughout the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Going into Liberation, I knew three things: that it was a port from the Vita, that it took place at the same time as AC3, and that it had a female protagonist. I had never played an Assassin's Creed game seriously before this one - I dabbled about a bit with Assassin's Creed II, but stopped playing after I found Ezio and Desmond to be thoroughly boring and unlikeable. Since this game was supposedly not tied into all the silly meta-narrative and didn't include a single appearance of Desmond or cartoonishly-evil Abstergo employees, I figured it was as good a time as any to stop laughing at the series from afar and play one of these games myself to see what all the fuss was about. Plus, it was five bucks on sale - what have I got to lose?  As it turns out, I ended up enjoying myself. A lot. More than I thought I would, and more than I was expecting based on the reviews it's been getting. The parkour system, even though it's been used as the framework for this series since the start, is still tons of fun, and I often just fire up this game sometimes and run around just to relax myself. Every animation is incredibly fluid and seamless - with just the push of a button, Aveline can scale wooden buildings, swing around a tree trunk as she runs across its branches, use lampposts and hanging signs as stepping stones to cross a street ten feet below you...it's all so much fun to watch and it's even more fun to be the one doing it. Sure, there are times where you can't grab a ledge you can clearly reach (the Bayou in particular is a bad offender in this regard) but for the most part, the free-running is sublime.  As the first female Assassin, and thanks to both her African and French heritage, Aveline is capable of changing between different personas with nothing more than a dressing chamber, each with a different set of strengths and weaknesses. The default Assassin persona is always at least a little notorious, but it's the best suited for combat and can use any and all weapons. The Slave persona limits the weapons and health, but allows you to blend in with groups of slaves - and since this is set during the American Revolution, slaves are in no short supply. The Lady persona has a massive hat and dress that allows Aveline to be seen as a respectable member of the nobility, but the hem of the skirt makes it impossible to do any kind of free-running and makes combat incredibly difficult. Each one is used throughout the story at different times, and all feel well-balanced and rounded - it's a great example of a game telling a story through it's mechanics alone.  Combat, however, is a different story. Enemies are really fickle and trigger happy, and guards will be more than willing to fire a musket as soon as you come within line of sight. And when you get a high enough notoriety, they practically send the whole force after you - and if you're in the Lady persona with just a hidden blade and no smoke bombs, you're gonna have a bad time. There are plenty of ways to approach an encounter, however - the hidden blade is the standard Assassin weapon of choice, but Aveline also has access to swords, axes, slave tools, guns, and assorted gizmos to work with in combat. Not all weapons are available for all personas, of course - you can't swing around an obsidian axe as a lowly slave, for instance - but as long as you keep on top of upgrades and stay stocked up on supplies, you'll have everything you need to get out of a situation alive. Most of the challenge in combat comes from timing your counters to do special instant-kill moves - it's a quick-timed event, but the animations look REALLY good.  Overall, I'm having a lot of fun with Liberation. It's substantial enough that I can play it for fifteen minute bursts to ease some stress in between classes with free-running and trading, but still engrossing enough that I can sit down and play it for hours on end. If all Assassin's Creed games are like this one, then I can see why people are getting tired of it after a while - but as for me, it's easily becoming one of my favorite games that I played this year.",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's hard to say. The game has good graphics and a good story but I just didn't enjoy playing it. I played it for a few minuits and turned it off because it just got boring. The story is pretty good and the graphics are decent. However, the gameplay is disappointing. I especially hate the controls, I know that it was originally made for the PSVita but they could of at least changed the default controls. Overall, it's not great. The combat is rubbish and so is the general gameplay. They should of kept it exclusive for the PSVita...",
            "review_score": "-1"
        },
        {
            "review_text": "Probably the worst Assassin's Creed so far. The narrative jumps all over the place, none of the characters are properly established, and the freerunning mechanic is glitchy, not helped by the annoyingly designed environments especially around the Bayou sections of the game.  Despite the 'HD' monicker the game is also ugly as a sin, the most essential character models have been updated but something as simple as the Level of Detail on distance, climb up to a tall building (A series staple) and the houses benath your feet will look like folded cardboard. There is no setting to alter this, and it is clearly a remnant from the Vita version",
            "review_score": "-1"
        },
        {
            "review_text": "When I first found out about Liberation, I was upset that it wasn't going to be available on anything but the PS Vita. Now that it's out on other platforms I'm even more convinced it should have been released like this at the start. Liberation is a great addition to the franchise. Aveline's story is great and compelling and pretty nifty how it ties in with Assassin's Creed 3. I believe it should be considered a part of the series among the rest, not just an add-on.",
            "review_score": "1"
        },
        {
            "review_text": "Well - I must say I was a little scared at first - mostly because this game is a port from mobile devices. I tried such game before - unfamous 'Deus Ex: The Fall' which... let's just say wasn't good. So this time I didn't expect to much from the beginning. But - I was positively suprised. The game is very nice. It is somewhat simplified comparing to AC 3 for example, but still pack a ton of fun. I liked the idea of persona changing especially, which allows the player to turn into three very different persons, with different skill and abilities - almost at will. And three different personas means at least three different ways to handle some quests (some, as the others are reserved for one persona only). Also - making the main character a female gives this game some different, unique feel... Finally, the lengh of the game is just all right - not to much (it is not a 'main line' game after all) and not to little (again comparing to only 2-3 hours long 'Deus Ex: The Fall'...). Definately something worth playing !",
            "review_score": "1"
        },
        {
            "review_text": "PROS: Changing persona  Amazing Music Score Collectibles Good Story Good Framerate Meet Coonnor FTW  CONS: Mediocre voice acting Missions are too Short Slightly Dated Graphics Game is too Short  Game narrative is plain lacking of climatic points  Conclusion: I do not recommend getting this full price since is a very short game.I got this game for rebate and i dont regret purchasing it . After i finished my playthrough i am still missing a fair amount of collectibles and side quests to do . Overall is a good game and thats all . Is not an amazing game like AC4 or Brotherhood. Also",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME CANNOT UNDERSTAND ITS OWN MECHANICS!  if you love the series its a great story note and the dressing room and different outfits makes it a working game but sometimes it is just plagued by bad mechanics, non working ledges, and invisible walls.",
            "review_score": "-1"
        },
        {
            "review_text": "Bland story, adgitating mechanics, poor level design. Overall its a lazy port which sabotoges itself from the very beginning.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Do not bother playing this one. It runs like ♥♥♥♥ and looks like ♥♥♥♥. It's buggy and glitchy, some bugs will even break your progression and forcing you to restart to achieve 100% sync.  The story is boring and confusing at times, the soundtrack is the worst of the series and there really is no immersion or atmosphere.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible acting, horrible sound effects, horrible voices, horrible and boring story line, great graphics. By far the worst assassin's creed.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe I am biased in writing this review, being a big fan of the Assassin's Creed franchise.  But I really believe this is a truly fun game to play, even for someone who 'accidentally' stumbles upon this game, never having played an earlier iteration of the game.  It takes about 20 hours to complete the game with 100% syncronization, which is more than adequate for the price required.  The graphics are better than would be expected for a Vita port. The ambience is not so engaging as previous games, due to the game being a conversion from the console, and the music is quite repetitive.  Still, as stated above, it is fun to play and it is a fine addition to your library of games.",
            "review_score": "1"
        },
        {
            "review_text": "cant even play",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a big Assassin's Creed fan (AC) you should play this (wait until it's on sale). If not, you should probably skip it. The fact that this is a port from a portable game is evident. The...production value is not as high as it is in other AC games. The voice acting and cutscenes are not great. The framerate also seems to be deliverately capped in some areas as 30 FPS and many of the missions are less than inspired. After the first hour, however, I thought the game really takes off.   I found Aveline to be the most likeable AC protagonist outside of Ezio (haven't played Unity or Syndicate). It's also nice to see a great, awesome female protagonist that isn't a sex object.  This game is much shorter than other AC games, which might actually be a good thing.",
            "review_score": "1"
        }
    ]
}