{
    "app_id": 260230,
    "name": "Valiant Hearts: The Great War™ / Soldats Inconnus : Mémoires de la Grande Guerre™",
    "release_date": "2014-06-25",
    "developer": [
        "Ubisoft Montpellier"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Atmospheric",
        "Historical",
        "World War I"
    ],
    "achievements": 0,
    "positive_ratings": 15650,
    "negative_ratings": 709,
    "price": 12.49,
    "description": "Valiant Hearts : The Great War is the story of 4 crossed destinies and a broken love in a world torn apart. Dive into a 2D animated comic book adventure, mixing exploration, action and puzzles. Lost in the middle of the trenches, play as each of the 4 strangers, relive the War and help a young German soldier find his love.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260230/header.jpg?t=1508345607",
    "minimum_requirements": "OS: Windows XP SP3 or Windows Vista SP2 or Windows 7 SP1 or Windows 8 (both 32/64bit versions) Processor: Intel Pentium IV 630 @ 3.0 GHz or AMD Athlon64 3000 + @ 1.8 GHz Memory: 2 GB RAM Graphics: nVidia GeForce 8800 GT or AMD Radeon HD2900 XT (512MB VRAM) DirectX: Version 9.0 Storage: 2 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Windows-compatible keyboard and mouse required, optional Microsoft XBOX360 controller or compatible",
    "recommended_requirements": "OS: Windows XP SP3 or Windows Vista SP2 or Windows 7 SP1 or Windows 8 (both 32/64bit versions) Processor: Intel Core 2 Duo E4400 @ 2.0 GHz or AMD Athlon64 X2 3800+ @ 2 GHz Memory: 2 GB RAM Graphics: NVidia GeForce 9600GT or higher, AMD Radeon HD3850 or higher (512MB VRAM with Shader Model 4.0) DirectX: Version 9.0 Storage: 2 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Windows-compatible keyboard and mouse required, optional Microsoft XBOX360 controller or compatible",
    "reviews": [
        {
            "review_text": "Valiant Hearts: The Great Wars tells you the story of 4 different characters where destiny brought them together. As soon you start the game the first thing you will notice is the simple yet very creative art-style from the world during dark times. With brights colors and a very warm design, soon you find that while the cartoon style may try to tone down some aspects of the true events of war, the pages of the Diaries as well the photographies from these past events may hit you. I dare to say that, depending on your sensitivity one or two can actually make you feel uncomfortable, but war never was a pleasing sight to start.  The soundtrack is quite simple but it’s strong enough to make a nice companion here and there or even on those tiny bits when you find a solution to a puzzle or when are about to discover something related to the main plot. You can expect one or two plot twists but it’s nothing serious, yet, the story managed to keep me hooked until the very end. I simply couldn’t stop until I found out what happened to them, and I’m glad for being able to experience this game from start to finish without feeling any sort of boredom. There was however, some emotions which brings the next point.  The game may offer a big contrast depending on who is playing and how someone plays a game. If you play for a mere completionist purpose or because you simply like to play videogames, you will find a 6-8 hours long depending on how much time you take to discover the solutions to the puzzles or if you are interested in collecting every hidden object. However, this game offers much, much more depth. It’s clear that the creators did their homework and worked hard to deliver great content for those interested in the culture of war. The “Facts” are filled with a variety of knowledge from all sorts of equipment, weapons, special events, conditions from the soldiers such diseases and locations where this war took place. Since a little bit of knowledge is always welcome I found this to be a satisfying surprise to see in a 2D game. Then there is the immersion. I felt for it and I’m glad I did. By letting myself 'fall' into the game I could enjoy the Story as it might be intended by the creators. A warm hearth will love the constant ups and downs that the player will experience. This game did not made me laugh, but it did made me smile quite sometimes and while It didn’t made me cry, it made me a bit emocional because they created a story showing the horrors of war, where when you are faced with a bit of hope, it quickly dies and you are in deep trouble yet again.   It’s not a fair story, there are no heroes, there is no right or wrong, only wrong because this game showed how pointless and destructive is the war. The letters who are based from real ones, written by the people back then showed how the quick turn of events made regular people into soldiers and how bonds like family and brotherhood can play a decisive role during such times.   I honestly hope anyone can play this game with a open heart and look at it as a mean, cruel time-machine who let you experience a tale of the horrors that happened during war and how love can patch a wound, offer hope or give the only strength to sustain such adversities when all seems lost and pointless.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is a puzzle-platforming game with a rather unique subject matter: World War I. Instead of shooting waves of enemies or commanding massive faceless armies as is the usual in most war games, Valiant Hearts instead decides to focus on the lives of several characters with WWI merely serving as the backdrop that changes their lives forever. The main cast of characters are Emile, a Frenchman getting on in his years who is conscripted into service despite his age; Karl, a German living in France who is married to Emile's daughter Marie; Freddie, an African American Creole who enlisted in the French military to avenge a loved one; Anna, a Belgian field medic who's father designs weapons for the Germans; and Marie, the daughter of Emile and wife of Karl who struggles to maintain her family farm as the war escalates.   This game is first and foremost about its story. Not just the written story per se; in fact there is very little spoken dialogue that isn't from the interlevel narrations and most of the in game diction is handled through speech bubbes with cartoonish graphics inside them along with body gestures. Rather, this game is about story in a much deeper and meaningful way, its about how these characters as well as the minor and even nameless NPCs are shaped and affected by the terrible war around them. It says so much with very little, letting the emotions and feelings of the situation grab ahold of you and fill it in itself. There's no egregious monologues or exposition or self-indulgent angst; just pure humanity in all of its forms, and it touches you in a very personal way because you really feel for what these characters are going through.  Now the game itself, as a game, is nothing too terrilbly spectacular: it is about a 10 or so hour game given or take a few more for finding all of the hidden items (it can't be an Ubisoft game without a hundred odd pickups, could it?) with basic sidescrolling and controls. You move left and right, can climb over ledges and sneak behind cover when permitted, perform context specific actions as well as character specific ones (such as using Emile's shovel to dig through tunnels), all while solving modest item based puzzles where you pull levels and turn wheels and blow up walls or unlock doors. It is honestly nothing groundbreaking or new, and the puzzle solving is broken up with a handful of obstacle course style driving levels (which are my personal favorite) and the occasional quicktime event. Nothing about the gameplay is truly spectacular, but it is adequate enough to serve its purpose and keep you interested in progressing.  However, while the gameplay might be standard fare, everything else does truly stand out. Along with the story, the game has a beautifully composed original soundtrack, as well as a few classical bits too (Brahms's Hungarian Dance no. 5, the French Cancan, Flight of the Bumblebee, and Night on Bald Mountain all play during the various driving segments). The art direction is simplistic and charming, but deceptively dark and grim when it needs to be (and given the subject matter, that is often). Backgrounds are beautifully illustrated and detailed, and character animations are smooth and well made. There are collectibles as said before, over 100 items spread throughout most of the game's 20+ levels which are divided into four chapters. These items are all historically researched and finding them adds an entry to the in-game 'Wiki' describing what it is, what it was for, and why it came to be during WWI. There is also more history to be found every level with short articles about what is relevent to the current level: be it a battlefield history, an elaboration on colonial army units, or chemical warfare. The game goes the extra mile to really help you feel what it was like to live during this time and in turn that helps you better associate with the characters in the story.  Ultimately, Valiant Hearts is a simplistic and unassuming puzzle sidescroller that has a LOT of heart and soul in it. Beyond the so-so gameplay is a gripping and upsetting tale of one the 20th century's greatest catastrophes, uncensored and unabashed in a beautiful package that serves to keep the past alive and help us never forget the tragedies that were had. Forgive the underwhelming gameplay and let everything else engross you and I'm sure you'll love it as much as I have. It is a work of art.",
            "review_score": "1"
        },
        {
            "review_text": " Valiant Hearts - The Great Feels",
            "review_score": "1"
        },
        {
            "review_text": " Valiant Hearts: a tribute to human compassion in harsh times   So much has already been written on  Valiant Hearts: The Great War  that it seems almost redundant to add yet another glowing review admiring all the things this game does so well. Situated in the First World War,  Valiant Hearts  is at heart a 2D side-scrolling adventure game with quite some puzzles added into the mix. While the gameplay itself is top-notch on its own (controlling the different characters is a breeze and solving the puzzles offers a decent but surely not too steep challenge), the true genius of the game lies in the way the story conveys all the emotions that can be linked to a catastrophic event such as the First World War.  The story tells in a gripping way the effect of the ware on four characters: a French soldier Emile, a German soldier Karl (the son-in-law of Emile, which offers a lot of possibilities for the story-writers), an American volunteer Freddie who gets befriended with Emile and a Belgian nurse, Anna, who tries to help and comfort as many wounded a possible, without looking if they are friend or foe. The game surely is not 'heroic' in any sense: it's not the (often false) heroism of the war that stands in the spotlight, but rather the life of different 'ordinary' people who try to survive amidst the carnage. If there is one theme that stands out, it's that of human compassion even in such horrible circumstances: not only does the nurse tend to all soldiers she meets, the familial relationship between Emile and Karl puts the French-German conflict in a completely different light. The unexpected but true friendship between Emile and Freddie offers yet another layer of interaction. Furthermore, on several occasions there are situations in which soldiers of the different armies help each other out rather than blindly slaughtering their enemies. You even get a dog as a companion, who helps out on many occasions and is often the key to solving a puzzle.  The story is told both during the actual gameplay and in different scenes between the chapters and portions of the game, and it turns out to be a true rollercoaster of emotions with a gripping, desolate end. It is rare for a game to move the player into tears, but  Valiant Hearts  managed to do so on more than one occasion. I truly felt emotionally shattered once the game had ended. Ubisoft Montpellier also went to great pains to provide a lot of historical background on the First World War, and it manages to do so without giving the impression one is playing a mainly educational game. It was a very smart move to introduce 'collectibles' throughout the game, which add a lot of information about daily life during the war and which can be picked up during actual gameplay. Together with the diaries of the protagonists and the historical facts which unlock when the game progresses, one gets a ton of interesting information.  There really is no reason not to try and probably love this game. I know that it is a Ubisoft game and that it forces to use Uplay, but believe me: the quality, also from a technical point of view of this game is miles above the big budget games Ubisoft have released over the past years. The only downside is that there are no Steam achievements, which could have been a very fine addition - the Uplay achievements, though well done by themselves, are no match for the real stuff. Be sure to use a controller for this game; the controls are nigh-perfect and very intuitive.  In every other department the game shines as well: graphically it does a very good job at conveying the often bleak atmosphere of the front - using a cartoonish comic-book style was a risk, but it pays off very well in the end. The sound department is even better, with a wonderful soundtrack and exactly the right background sounds at the right moment.   Essential purchase and gaming experience, a true classic of the adventure genre and a deep emotional experience. ",
            "review_score": "1"
        },
        {
            "review_text": "War makes men mad.  i know my sacrifice has not been in vain. I fought for my country and my liberty, my honour is assured. Since it is the will of God to separate us on Earth, i hope we’ll meet again in heaven. Keep me in your prayers.",
            "review_score": "1"
        },
        {
            "review_text": "Gave a better history lesson than my school ever did. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Now I Know why people hate Uplay.  Still Game is good.",
            "review_score": "1"
        },
        {
            "review_text": "Tired of popping headshots and celebrating war crimes?",
            "review_score": "1"
        },
        {
            "review_text": "the game is definitely worth your time and your money. a touching story that will not let go.",
            "review_score": "1"
        },
        {
            "review_text": "This game needs more sequels, Ubisoft!! Let Assassin's Creed rest for a while!!",
            "review_score": "1"
        },
        {
            "review_text": "The story of Valiant Hearts begins in 1914. Archduke Franz Ferdinand has been assassinated and Germany declares war on Russia in response. In anticipation of a war, France begins to deport all German citizens. Karl a young German farmer is forced to be separated from his family, consist of his wife Marie, their son Victor and his father-in-law Emile. Karl is forcefully drafted into the German army while at the same time Emile is drafted into the French army.  The story follows their journey of Emile and Karl as they try to survive a war neither of them want nothing to do with. Along the way they meet many wonderful characters, faced countless hardships and joyful moments.  The gameplay is a side scrolling game. You're controlling either Emile or Karl most of the time, sometimes other characters. Most of the time you'll be solving puzzles and picking up items to advance on to the next area, while following the story. Gameplay-wise it isn't incredibly difficult at all, if you're good at figuring out how to use your environment to solve the puzzles you should be just fine. Certain part of the game required you to sneak through behind enemy lines. So patience is more needed here than skills, other times you are required to dodge artillery shells which can be a bit frustrating until you learn the patterns. There are parts of the game where the game turned into short of a dodging game where many vehicles are chasing after you and you must avoid bullets, grenades and incoming traffic. Last but not least, there are quick time events. You will encounter them at scenes when you have to heal someone. They get progressively harder as you go through the game, the last QTE is quite difficult, at least for me.  The game does a wonderful job with the narration between loading screen, even though most of the characters does not speak at all, they only provide you with speech bubbles to portray the feelings and thoughts of each characters. The narrator does most of the heavy lifting. In the game you will be able to find many collectibles, that when you open up the menu, you can examine them and read about the history and interesting fact regarding the Great War. I highly recommend reading them, as it will enhance the experience. The music was very fitting with the game, since characters do not talk, the music help give you the sense of danger and sadness that you normally need words to describe. I have not encounter any game breaking bugs when I played it, the only bugs I encountered was one time my character was stuck in a ditch and I could not dig my way out of it, so I had to restart the chapter, the other time was when I was healing another character and an extra arm appeared out of nowhere on my character. But it was gone the moment the healing QTE was finished.  This game being one of the first games I played after the Summer Sale, I highly recommend this if you enjoy a grand, epic and emotional story. The only major problem I have with this game is that sometimes, certain part of the game might dragged on for a while, but others might be over very quickly, a bit inconsistency in pacing. There are many great characters that you will like, the way they accurately portray the hardships of warfare at the time is also a welcoming addition. It took me 10 hours to finish the game, but if you want to get all the collectibles. It might take you a bit longer. This game is definitely one of my Game of the Year contender, or at least for great storytelling. I hope if you already played it, that you enjoyed it. If you haven’t, what are you waiting for? =] ",
            "review_score": "1"
        },
        {
            "review_text": "It's a strange feeling, playing a game where you expect to cry at some point, but you start crying in a moment, when you absolutely did not expect it.  If the world had more games like this, noone would ever even consider waging war again.  Artstyle 5/5  Atmosphere 5/5  Sound 5/5  Gameplay 5/5  Characterdesign 5/5  Leveldesign 5/5  Story 5/5  Controls 5/5  One of the best 2D sidescrollers ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Please, play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Mechanically, Valiant Hearts has what it takes to be a fun, quirky puzzle/platformer/adventure hybrid. Instead, it takes on the First World War and all the associated brutality that came with it. And while it does a good job of driving home the differing perspectives, showing you the meaning of loss, and hammering you with the trauma of war, one can't help but wonder if the Great War was the right setting.  Games tend to demand three things: 1) player agency, 2) the feeling of progress, and 3) the feeling that the world responds to your actions. World War 1 presented correctly could never do that. You grow attached to the characters because of their clear relatable goals, but a proper picture of the war would leave them wholly unable to act upon them. And by placing your characters in some of the rare pivotal moments of what was otherwise a four-year intractable meat-grinder of a conflict, it feels like individual moments of heroism can really save the day. It stands in jarring contrast to the reality of the war: a bureaucratic nightmare where political expedience and officers' incompetence fed young men into machine-gun fire by the hundreds of thousands.  The game that was truly faithful to the war would kill everyone around you regardless of your actions. Your decisive push for new ground is turned back the following week. One day, your commanding officer gets it in his mind to secure glory by feeding as many of you into bloodbath of No-Man's-Land as possible. As you seek cover from machinegun fire, a howitzer shell bursts the thin strip of ground between you and a muddy crater and you drown in the blood, mud, and necrosis. Your commanding officer is later promoted for bravery. There is no rationality or narrative, just the slow drift of whole economies toward each other and a tectonic snap at the point of conflict. Valiant Hearts just barely scratches the surface of this.  It's hard to imagine any game in the traditional sense being able to convey that. Valiant Hearts does the best job of it I've seen, but it's still much too far from the truth.  I'd be remiss if I didn't mention that Valiant Hearts uses Uplay, Ubisoft's utterly needless third-party DRM and achievement/social system. It's less obtrusive than in some games but still ought to be removed.  ENDING SPOILER:   The last 'puzzle' does attempt to drive home more of the senselessness of the war by having a commanding officer shove your squad through increasingly brutal segments of a French counterattack. I feel like the solution may be more effective on other players than it was for me. The growing sense of despair, confusion, and hopelessness that comes from your commanding officer demanding you push through a literally impassable section may drive players to the horrifying conclusion that they need to mutiny against their own officer as the only way to survive. There was no moment of dawning horror for me since offing him was my very first response to meeting an impassable puzzle. People with less wildly anti-authoritarian bents might get more out of it.  ",
            "review_score": "1"
        },
        {
            "review_text": "What a beautiful game! A heartbreaking story, a wonderful soundtrack and the perfect art style to go with this game to capture the right atmosphere.   The puzzles are fun, not too easy and not hard, just right to emphasize on the story. One of the better games I played this year and I would even go as far to say that this is one of those must play games.  They did a great job to have this game as a means to get some more attention to the 14-18 war. Wouldn't mind seeing more games in this era.  The only negative I can come up with is the Uplay client, since I don't see the point of having it on steam, but don't let that stop you from experiencing this game!   TLDR; Play it!",
            "review_score": "1"
        },
        {
            "review_text": "This game was breathtaking and added humanity to both sides of the war which is rarely seen in war games. Rather than fighting against the enemy, each character has a different role and importance put into the war. In almost no case are the opposite side your clear enemy and you get to feel what the characters really stand for.",
            "review_score": "1"
        },
        {
            "review_text": "World War One is a conflict that is severely underrepresented in all forms of media, but for videogames, it is in an interesting position. Many cry that it would be too difficult to make a game about World War One ‘not boring’, or ‘not too difficult’. Ubisoft announced Valiant Hearts: The Great War quite suddenly late last year. A new IP from a AAA Publisher and Developer is always news. Valiant Hearts is not only a new IP, but is a 2D Sidescrolling Puzzle game about World War One. Valiant Hearts is the answer to the cries of “Not too hard” and “Too Boring”, as it is neither of those things. It encompasses great art direction, style, music, story, and atmosphere. It is rare to see a new game like this from a AAA publisher, and I am quite shocked, and pleased. If you are buying from Steam, as with other Ubisoft titles, it does require Ubisoft’s U-Play DRM service. In addition, for some, the length may seem short (7-8 hours for my first playthrough). However, for its price of $15 USD, the length is just right. Ubisoft was smart in pricing Valiant Hearts.   Valiant Hearts features four Protagonists, each with their own personalities and skills. Anna, Emile, Karl, and Freddie. Anna is a Belgian woman who was studying to become a Veterinarian in Paris before the war broke out. When the Taxi to the Marne began, she drove to the front and started helping the wounded soldiers of both sides. In game, Anna is able to heal wounded soldiers with a minigame that is reminiscent of Guitar Hero and Rock Band.   Emile was conscripted into the French army at the start of the war. He fought at the Marne, and was wounded and captured by the Germans. As a POW he was made to be a cook, and Emile has the ability to dig in certain areas. When general Mobilization by the French started, Karl (Who is Emile’s Son In-Law) was deported from his home in St. Mihiel and sent back to Germany. There, he was made to join the German army. Karl also has a wife, and young son whom reside at St. Mihiel for the duration of the war. Freddie was an American living in Paris at the start of the war. Driven by a lust for revenge, he joined the French army. Freddie has a pair of Wire Cutters and is able to cut through barbed wire whenever he pleases. As well, his strength allows him to destroy any obstacles in his path in one hit. These four people are brought together by a German medical dog.   The game is described as an interactive Comic-Book, and that is something I can certainly agree upon. Many sections of the game feature comic book panels showing something else going on as you are solving a puzzle or moving through the lines. The art itself, although it looks like it could be aimed at children, lends itself to a mature story about humanity and the true cost of war. It is a unique, fresh style that is surprising coming from a AAA publisher.    However, in some cases the Comicbook style is a detractor. For the first 3 chapters, there is a comic book style villain, and he mainly pertains to Freddie. There is a boss battle within each of these chapters, and each of them feels forced. They are extremely out of place, in what is otherwise a poignant story that does not paint one side as the villain. However, the epilogue to that portion of the story is a fitting conclusion. As well, Anna’s healing rhythm minigame can get tedious quickly. Had it been used less, or in each case shorter overall it would have been better.   In spite of those issues, Valiant Hearts: The Great War is a good game. It does not hold any punches in showing the senselessness and horror of the First World War. My favorite level is towards the end, at Chemin des Dames, during the Nivelle Offensive. With an officer to his back, threatening to shoot if he starts retreating, Emile is forced to charge forward and watch his fellow soldier be slaughtered. It is moments such as those that truly make Valiant Hearts a beautiful, poignant puzzle game.   The Dog is also used as a good puzzle solving tool. He is able to go through spaces too small for the humans, and is able to retrieve objects for the characters, and is also capable of pulling levers. He helps tie the stories of Emile, Karl, Anna, and Freddie together well. He provides something that they can all communicate with, and loves them no matter who they fight for, or what their beliefs are. It is also an interesting addition to the game, due to the prevalence of dogs that were used for war purposes during World War One, one of the most famous being “Sergeant Stubby”, who was a member of the 102nd Infantry Regiment, 26th (Yankee) Division. Showing that the war effected not only humans, but our closest animal friends, helps show the destructive power of The First World War, and war in general.    A detriment to some would be the historical accuracy in some places. Although the game is littered with facts (Hit tab in any mission, and historical facts relating to that mission will be shown. You can find a variety of objects in the game, and it will have a fact about that object, but more on that later). There are levers, anachronistic clothing, and objects abound (looking at that giant Chlorine Gas machine early on at Ypres), and to some that would be something to be put off by. Now, I am someone who is obsessed with World War One, and everything to do with it. However, in this case those sorts of things only enhanced my enjoyment of the game because it complements the comicbook style well, and helps keep the story and gameplay flowing at a good pace. An example of that would relate the story, as it would go nowhere if our protagonists were not allowed to freely move about the front.   I am actually a fan of the charge sequences, in which your character is running to the right side of the screen, and you must dodge shells and machine gun fire. It helps break up the game some, and to keep you focused. In addition to those sections, I also enjoyed the vehicle sections. There are two types of those: Tank and Taxi. The Taxi sections have you driving towards the bottom of the screen automatically, and you must maneuver the car around obstacles and enemies. They also seem rhythmic as they are timed with the song that is playing. My favorite of those is when Anna is driving her Taxi away from Paris, to the “Can-Can” song. The Tank Sections have you moving left and right, firing at obstacles and enemies. These are also a nice change of pace, and keep things interesting.   Something mentioned earlier was the objects that you can collect in the game. Some have noted that this seems out of place in a game like this, but personally I feel that the objects that you can find, and where you find them make sense. A lost Dogtag or Helmet dropped in the mud, a child’s gasmask in a cabinet in a bombed out building. When you pick up these objects you are treated to a factoid about them, and what ttheir context within the conflict was. It is an interesting way to shed some light on the war, and the objects that people used every day during the conflict.   In the end, I really enjoyed my time with Valiant Hearts: The Great War. It is a remarkable game from a AAA publisher, and although it does have some minor issues, they are dwarfed by the good things about it. The “Come Back” trailer for the game said this: “Lives shattered, love lost. One day a farmer, the next a soldier. Sent far from home, torn from their loved ones. These unexpected heroes are swept away into the Great War that rages on, always hungry for more. War makes men mad, but Humanity can shine, even from the darkest of hours. And those Valiant Hearts stand up fighting for love, friendship, and honor. To the point of sacrificing everything, even their own life. Some made it, some did not. These are their stories”. That is what the game is about, although names may fade, deeds and sacrifices never will. So those with Valiant Hearts, fear not, as your sacrifices are not forgotten.",
            "review_score": "1"
        },
        {
            "review_text": "10\\10, oh god, 10\\10. Game of the year. Cried like a little girl. Take a bucket for those tears.  ; _ ;",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts: The Great War Story  Introduction:  Valiant Hearts: The Great War (VH) is a story-rich side-scrolling puzzle platforming with some spotted action sequences. If that doesn’t make it sound unique let me assure you that it is. I am going to focus on the main aspects of this game to avoid spoilers so I will not be commenting on some of the specifics. I picked VH up on one of the Steam sales for a few dollars. This review relates to the PC version. Screenshots by me unless otherwise noted.   The Game  The Story – This is the big hero of the game. The story follows four individuals (and a dog) as their paths entwine from the beginning of WW1 to the end. The characters are an American soldier, a Belgium nurse, an older French father and his German son-in-law. I won’t say what happens to them as I don’t want to spoil anything. I will say that the stories are very well written and very moving. The characters are voice-acted well and during the six hours of play you will get to know them well. The actual game alternates between the characters as they go through the trials and tears of the war.   How to Play – Most of VH is played as a side-scrolling puzzler. Most challenges require you to find an item, use it in the right place and then move forward. Some puzzles are the turn valves, pull levers style. The majority of the puzzles are fairly simple but there is a hint system in case you get stuck. In addition to the puzzles there are also action sequences. Being set in WW1 most of these involve dodging artillery, sneaking past soldiers, throwing grenades or driving vehicles. Again, most of these action sequences are quite forgiving so that they don’t spoil the story with needlessly atmosphere-breaking difficulty. If you do get blown up by dynamite or captured by an enemy the game will rewind a few seconds so you never feel like you need to replay a long hard sequence and get that Groundhog Day treatment.   The Art – The graphics in VH are comic-book style. This is done very effectively with great animations. Although the game is 2D, there will often be animations in the foreground or background to set the atmosphere. The music is another hero of the game. Some classical music is used to create pacing in the action sequences such as The Flight of the Bumblebee. Other music is used in the puzzle scenes with great emotional impact sometimes.   The Education – Throughout the game there are loads of historical facts you can ready about. They explain how the war started, some of the battles that took place, the weapons used, and plenty of facts about casualties suffered. There are also over 100 hidden collectibles to find. Each one has a blurb about its historical significance. Furthermore, there are diaries of the main characters you can read although these are not historically based.   How I played it It is hard to say much about VH without giving anything away. The impact VH had on me was that within 30 minutes of beginning I was emotionally involved and eager to continue playing. I played the whole game within a week. The story was tense and well-delivered with numerous cliff-hangers to keep you wanting to play more. Near the end of most sections I’d hit TAB and read about mustard gas, Russian dog tags or tunnel warfare. I thoroughly enjoyed almost everything, particularly the puzzles involving the rescue dog, although the first aid sequences were probably the least enjoyable. The only other negative is that the controls seem a bit arbitrary at first, but within 15 minutes I had no issues doing what I wanted to do.   Summary  Valiant Hearts is an emotionally charged game where the story outshines the gameplay. This should be a must play for most gamers. 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Walt is   much   more useful than CoD dog.  In all seriousness, this game adds the human element into a war game instead of all 'pew pew pew, pew pew pew, I win' and that is so rarely seen that is well done. The characters bond together so amazingly and the driving mini games are just amazing with great music to go with them. Tears will be shed. Not maybe. They will.",
            "review_score": "1"
        },
        {
            "review_text": "It's really a wonderful game. It's a moving story complimented by pleasant visuals. One thing you should be aware of though, it's still a puzzle game. Most of the time that you're playing, you'll be solving puzzles. The game is laid out in chapters so it seems like a game that I'll play through one chapter at a time. The first chapter for me ran about an hour and a half. So far I'd give the game a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "A great emotional story, absolutely non-repetitive gameplay, good puzzles not frustrating (I normally dislike puzzle elements), beautiful gfx. This game worth the full price. DO NOT even think twice to buy immediately when in sale!",
            "review_score": "1"
        },
        {
            "review_text": "What a beautiful little game. There were parts where I thought it was a little to game-y for its own good, and thought some of the story and design choices were a little misguided, but the resolution more than made up for any of the little problems I had with it. It's one of the more important games to have been made as of late.",
            "review_score": "1"
        },
        {
            "review_text": "Some made it...some did not.   YOU should make it through the whole game. Besides Rayman the best Game Ubi ever did. Gameplay is just average, but the story keeps you going and going. Touching. Lasts for an hour or two after the finish...like only a small amount of really good games do.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend this game to anyone who enjoys puzzles, history, or just a good story. The tale of four normal people caught up in a horrendous, bloody, and ultimately pointless meat grinder of a war really brings a human element along with it. Despite actual spoken dialogue being somewhat rare outside of the narration, it's easy to connect with the characters as they try to survive The Great War with their (extremely cute) canine companion.  If you get this game (which, again, I very much recommend) then get a box of tissues. Actually, make that two boxes. To be on the safe side, of course. The game is a real tearjerker. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft this is what you're good at.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. No more words needed to describe this game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great, great and great again!!! I loved this game from start to finish, a 10 hours dip into WW1 and in a melting multi-character story about war's harshness, stupidity and senselessness.  At first glance, looking at its screenshots, someone could be fooled thinking this is a kid's educational game; but once you take the gamepad in your hands, you'll discover the comic style graphics are perfect for it, as every location is so full of character and detail. And when you'll hear the FANTASTIC instrumental soundtrack, so emotional and vibrant, you'll start to be captured by Valiant Hearts.  The gameplay is on the easy side indeed, the environmental puzzles and action sequences will not block your progress towards the end titles. But during the game you'll guide different characters and in some instances you'll have to switch between two or more of them in order to help each other. This brings a bit of diversification in puzzles and level design, which is not bad at all. I also think that difficulty and game length are perfectly and intelligently balanced, keeping you interested and never bored until the end.  Something that started as a small project to commemorate the victims and heroes that died 100 years ago in World War 1, in my eyes became one of the best games produced by Ubisoft in the last years, and one of my personal favorites. Not to mention all the very interesting infos about all aspects of WW1 the game provides to the player, from daily routines in trenches to the war's consequences on civilians. As someone said, this could be easily used as an educational tool in schools!  Please Ubisoft, continue to support this little projects of yours, Valiant Hearts is the perfect example of what a very talented team can realize with a small budget but great ideas. We love 'triple A' games like Assassin's Creed, Splinter Cell and Far Cry, but sometimes a brief but refreshing breath of wind is necessary. And you, hardened videogamer who's still dubious about VH, don't hesitate and click on that green button below, you'll not be disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most heartful games I've ever played. Don't expect awesome gameplay or badass graphics, this is a simple puzzle game. But it has depth. It's a game about people, normal people in war. You don't want better graphics, because the cartoony style is the only thing keeping you from weeping every cutscene. There's no glory in war. And this game shows you why. Prepare to be moved, prepare to be touched, and prepare a boatload of tissues.  Manly tears were shed? Oh, no, no... You will not shed manly tears. Nothing will be manly about the bawling this game will give you.  Not CoD/10. And that's a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "The French didn't surrender in this one.",
            "review_score": "1"
        },
        {
            "review_text": "This game shows the brutality of war better than any FPS out there.",
            "review_score": "1"
        },
        {
            "review_text": "I am not an uBisoft Fan...far from it...but this game deserves attention  How to review this without spoiling everything..  If you are looking for a action packed game, well, this game kind of has that, but it is NOT an action game, it is a puzzle game taking place along the German-French lines of WW1 between 1914 and 1917, and do they take you all over those lines. From Ypres to Vaquois to the horrendous Nivelle Offensive. If you know your history--or are a WW1 nerd like me--then you can guess what happens action wise.  The artstyle is great. For how charming it is, the artstyle quickly delves into the dark, muddy hell that was trench warfare. The main characters do not speak much, just one or two phrases in their languages...oh and a bark or two...but the atmosphere of the story, music, and even the artstyle is really something to digest. From the beginning, it does look like it is going to be a light hearted...until the Battle of Marn where the bright colours of pre-war jubilee quickly turn into the grey, brown, and red hues of hell, with each extra 'cell' (I guess we can call it that since it is a comic-book-style game) throwing in a great impact of emotion.   Thank god for the three driving scenes, those were a needed--and really, REALLY fun--break.  I almost cried at Vaquois, and I definitely stared blankly at the screen at the end.  So, unfortunatel, you need uPlay, but unlike the other games that require uPlay to play that I have...I actually want to complete this game.  Shame uBisoft can't make a game with this kind of story for their AAA titles.   ----  Side note: this game is what BF1 won't be.",
            "review_score": "1"
        },
        {
            "review_text": "A puzzle game that takes you through the battles of World War I. It's kind of weird to have a game where you can dodge tank shells by car to the tune of 19th century composer Johannes Brahms' Hungarian Dance No. 5 in one level, and be pulling soldiers out of rubble the next, but I never felt that the zany sense of humor in the game was disrespectful to the subject matter.  For some people, the inclusion of Uplay is a deal breaker. I'm not the biggest fan of Ubisoft myself, but I see no reason to hate it here. After you play the game for a certain time, it unlocks downloadable comics. For Far Cry 3, you unlocked wallpapers. You couldn't do that if it was just Steam, and it didn't get in my way in the least.  Four out of five Lennys ( ͡͡ ° ͜ʖ ͡ °) ( ͡͡ ° ͜ʖ ͡ °) ( ͡͡ ° ͜ʖ ͡ °) ( ͡͡ ° ͜ʖ ͡ °) ( )",
            "review_score": "1"
        },
        {
            "review_text": "One of the most important games of 2014 with a wonderful story, beatiful art and even better music.  Something everybody should experience.",
            "review_score": "1"
        },
        {
            "review_text": "Love the artstyle. Love the gameplay. Love the characters. Love the story. Love the puzzles. Love the GAME. Absolutely one of my favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful game. Amazing story. Fun, astonishing, just wow. Everyone who says he didn't cry at the end is a bloody liar.  8/8 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Breathtakingly tear-jerking. Even 'Brothers, a tale of two sons' comes second in these terms. Amazing art style, and storytelling to mach. And apart from that, educational in a way few could achieve. Truly a masterpiece, showing the horror of the Great War, the bravery of women, man and animals who took part in it, and the utmost futility of most of that effort. A show of the best and worst in human nature. This game should be part of the curriculum in high schools and universities, and a shining example of how to make games that are not only fun to play, but also leave a part of them in you for the rest of your life.   Simply put, play this game. Expect to cry.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is fun, engaging and terribly sad.   The puzzles were neither too hot nor too cold, but just right. Similarly the history nuggets were all the more appealing for the engaging caricatures, exaggerated art style and fantastical narrative.  Most all of my minutes while playing were enjoyable with the exception of those five after the ending when I was too busy crying like a champ.  10/10 would cry again.   ",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful game that takes you on an adventure thru World War I. Amazing story telling and brilliant characters including a cute pooch. With good side scrolling game play and arcade like bosses i would highly recommend this game for casual fun and no commitment gaming.",
            "review_score": "1"
        },
        {
            "review_text": "to be honest i didn't know how i would like Valiant Hearts at first, the gameplay was okay and i kinda liked the graphics but the story was just incredible don't get me wrong i am still not a big ubisoft fan but this one i think they did right. overall 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Atmosphere in this game is just breathtaking! Recommended to everyone",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful, introspective, and yet informative game with an involving storyline. A game that puts you on the shoes of charismatic characters during the terrible great war, It's easy to get involved with their hopes, fears and dreams while they struggle and you witness the terror of the war. It's more than a game, its a statement on the tragedy and senselessness of war. I cannot recommend it more. It's a short experience, but one that you surely won't forget anytime soon.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, many fun puzzles and great storyline",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful looking game with a beautiful story and some neat little puzzles. Well worth the play through.",
            "review_score": "1"
        },
        {
            "review_text": "This is truly a magnificient game. You sneed to play it.  It recounts the events of the first world war through the eyes of 4 protagonists.  It doesn't portray any nation as the bad guy but instead aims to show the effect of war on people.   I won't spoil the story but I can safely say, you most probably will cry.",
            "review_score": "1"
        },
        {
            "review_text": "Very Rarely in video games do developers touch the first world war, these days developers wanly focus on Modern warfare and these are mostly 3rd or 1st person shooters. Valiant Hearts does neither of these thing it instead focuses on a more narrative driven experience within a Semi 2-D world focusing on puzzles to progress the story. The story focuses on 4 protagonists. Emile who is a French farmer who becomes a POW during his first battle while searching for his son-in-law. Karl was German living in France before the war started. He is married to Emile's daughter Marie, both of whom have a son together. Karl is deported back to Germany when the war begins and is conscripted into the German army. Freddie who is an American soldier who enlists as an engineer for the French and vows revenge on the Germans who took away the life of his wife and Anna a Belgian nurse tending to the wounded soldiers on the battlefield. In the search of her father, captured by the Germans, she continues to tend to the wounded and find her father and finally there is the dog, an unnamed German shepherd who becomes a valued and trusted friend to each of its four human co-stars at one point or another throughout the game.   The puzzles often boil down to simply finding an item in one location and bringing it to another, though the context of these fetch quests manages to keep them interesting as you race to save civilians or use stealth to navigate behind enemy lines. The dog's presence also augments the puzzles in interesting ways, allowing you to control two characters at once, reach areas into which no human could fit or distract guards by simply being an adorable puppy. There are also rhythm mini games and these are used for the charging the trenches section of the game where you have to avoid enemy fire in order to progress. There are also similar section where you do the same in a car avoiding obstacles while the can can, can be heard playing in the background which is a nice touch. The boss battles should also be mentioned because while they are very smart takes on puzzles and bosses together they do seem to stretch they do give the sense of new technology in the war and having to overcome insurmountable odds.   But that’s not to say that all the games aspects are solid. The medic mini-game, however, is dull to play and forces your attention away from the action at hand so that amputating a soldier's arm is treated with the same rote monotony as giving a tired soldier a sip of water through rhythm quick time events. There can also be some confusing puzzles in late game but that should not be held against the game as the game does give you hints if it sees that you are stuck in a certain section and these usually helped enough so that the narrative could continue and move on to the next section of gameplay  Valiant Hearts: The Great War is a superbly titled game. It does its job of showing that war is one of man’s worst creations and how families were torn apart back then and are still being torn apart today by current wars. It is a valiant effort at a sincere depiction of war by developers whose hearts were clearly in the right place, telling a gripping story that is still respectful of its source. Final Verdict: 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Made me realise how terrible war truly is :'(",
            "review_score": "1"
        },
        {
            "review_text": "Buy it, might not seem like much at first but it will show its glorious light the further in you get.",
            "review_score": "1"
        },
        {
            "review_text": "Beside Uplay.....Its simply beautiful   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. We need more games like these. Some puzzles were pretty challenging. The story is really interesting. You are not a killing machine. You help people.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is, this was quite the experience.",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is, this was quite the experience.",
            "review_score": "1"
        },
        {
            "review_text": "Cannot recommend enough. No Words.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay switches between adventure game styled puzzles to several types of timed sequences and on-rail events. Some sections were a bit rough and required a bunch of tries but the game was never frustrating or difficult. Great story and really cool art style help make this a game I can easily recommend for just about anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Strong, emotional, thought-provoking.  Incredible art, dignified gameplay, complete with serious portion of soul. Combining dignity with violence, frenzy with almost poetical feelings, this may be the game we all have been looking for.  Unfortunately, I'm not sure whether a Rayman with WWI decorations would be enough to express the whole tragedy happened then and still happening now.  A vivid reminder what the war really looks like with extensive historical details. Get your napkins ready by the way, you're going to need them.",
            "review_score": "1"
        },
        {
            "review_text": "Best 2D adventure I have every played, perfection in every single aspect i.e Soundtrack, speech and gameplay. Will definitely play again, 11/10",
            "review_score": "1"
        },
        {
            "review_text": "A master piece in every aspect.\\  10/10, would cry for it again.",
            "review_score": "1"
        },
        {
            "review_text": "All my life i've been told men can't cry, I been lied ;_;  Lie down, try not to cry, cry a loooooottttttttt *sniff *sniff  Amazing game, it has a doge 11/10 110% of chances you will cry 11/10 Great game based on real life events",
            "review_score": "1"
        },
        {
            "review_text": "Amazing little game. I was pleasantly surprised by the strong narrative and character development. It tells a rivetting story through the eyes of 4 different characters caught in a largely untouched conflict in video game history -- WW1  Contains alot of factual information about WW1, so plays out like an interactive wikipedia entry. I was engrossed right through to the very end.",
            "review_score": "1"
        },
        {
            "review_text": "I dismissed this game at first because it looked cartoon-y. That was my mistake. It's a beautiful game and taught me more about WWI while having more fun than school could ever teach me.",
            "review_score": "1"
        },
        {
            "review_text": "Some of the game play is kind of annoying; it is basically a puzzle game; but it tells a story really well. It is one of the best games in terms of emotional story telling for the year, if not the best.  Also, fair warning, it does deal with the nastier side of WWI pretty bluntly",
            "review_score": "1"
        },
        {
            "review_text": "One of the most immersive and fun games I've played in a long time. Anyone who claims that games can't be art, needs to play this. It's a movie in itself, great story, great callbacks to actual history, and the driving minigames are some of the best fun I have had in recent memory.",
            "review_score": "1"
        },
        {
            "review_text": "Unlocked an achievement for petting a dog. 100/100",
            "review_score": "1"
        },
        {
            "review_text": "This is a game I think everyone should own. It is truly a masterpiece. 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "Alright so here's the deal, yes it requires Uplay get over it it's Ubisoft they're probably never gonna let it a game NOT have it by the looks of things. Anyway the game is relatively simple, it's a side scroller for the most part what do you expect? However, it's still a really good game and I'm enjoying every minute of it as I play.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is one of the most beautiful games I have ever played. It tells the stories of four very different people during the First World War and covers all the important battles and events of the war while mixing it all together into a great story of friendship, love and mourning. Historical items (found in the chapters and missions), diaries and historical facts 'educate' the player as a bonus throuout the game.  10/10, totally worth it!",
            "review_score": "1"
        },
        {
            "review_text": "This game... I quite frankly don't know where to begin. I went into it knowing a fair amount of knowledge about the first world war. I knew it was bad, and that good men and women died for very little reason. But this game, it put it into a perspective for me. You follow a few different characters setting out for different reasons into the war to end all wars. Each has a moving and detailed background, each has a personality and a reason to fight. You connect with them in a lot of ways, and the funny thing is that you'll never see their eyes.  I bought this game because I wanted a story. I was moved to tears from the trailer, and I knew I had to have it. I couldn't stop playing it, and so I beat it in a single sitting. I don't regret doing so, but I regret that it had to end. Between the visually stunning world, beautifully well used music and cues, tricky and interesting puzzles, and the sometimes comical action sequences, I simply could not stop.   That, and though I haven't researched it, I am quite sure this game is historically accurate to a T. Finding artifacts with detailed descriptions throughout the levels or just following the general story line, you learn just what it meant to fight The Great War.",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "This game made me cry like a ♥♥♥♥♥. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The finest example of how games become art",
            "review_score": "1"
        },
        {
            "review_text": "+ Beautiful art + Great music + Fun and simple puzzles  A great combination to learn history, since the game refers to the events of WWI  - You need Uplay account to play it, but it worth the trouble",
            "review_score": "1"
        },
        {
            "review_text": "I wish I didn't get this game only beacause Uplay will screw everything up, But the game play however is fantastic I just recomend getting the app",
            "review_score": "1"
        },
        {
            "review_text": "Not much gameplay to it, but totally worth it for the story, ambient and soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "1738/John Cena Such feels why did he have to get killed ",
            "review_score": "1"
        },
        {
            "review_text": "-&gt; TroubleShoot for this Masterpiece:  1-Put the ShortCut of UPLAY to run in Administrator mode. (so The game Can SAVE without corrupt) 2-If the game 'disapear' but it says that it still runing - Ctrl+Alt+Del + end the Valiant Heart Process and it will Magically apear in Full Screen.  Enjoy This Great Tittle! 10/10 PS: Hope People that had the same problem as i can see this.",
            "review_score": "1"
        },
        {
            "review_text": "Great story and artwork!",
            "review_score": "1"
        },
        {
            "review_text": "-Buy the game -Start playing it -Get really into the story and the characters -Play a lot since you love the game -Get to the ending -Start realising what is happening -Don't cry -Cry -A lot -End the game and cry yourself to sleep -Play the game again just so you have every collectable item -See the ending again -Cry even more than you did the first time -Write a review about it",
            "review_score": "1"
        },
        {
            "review_text": "Buy a pack of kleenex before playing this game. Amazing story.  Cons: Still crying.....",
            "review_score": "1"
        },
        {
            "review_text": "Played this game for a school project, because we had to. O boy, I just want to thank school for showing me this game. What an amazing game!!! The music and story are so so so wonderful. Thank you Ubisoft for this game. Make more like this one!!! Made me cry, but I guess its a good thing",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME &lt;3 . I can play it all day and all night =D , graphic is greate , gameplay is so good , music is masterpice . I just so so like this game",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Heart in a nutshell: MASTERPIECE",
            "review_score": "1"
        },
        {
            "review_text": "Very Story rich and immersive and music is woderfully composed for the situation. Best adventure and puzzle game ive played in a few years.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely cried within the first 5 minutes",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played. I love it all, especially how its not all 'MURICA'' and 'DIE GERMANY!' It shows an intresting, realistic perspective of the average soldier on both sides.  It is also the only peice of media I have ever cried at and im not ashamed to admit it.",
            "review_score": "1"
        },
        {
            "review_text": "The “I'm Not Crying, There's Something In My Eye” Award ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game has a gorgeous art style and the perfect musical background to draw you into an emotional story, with great puzzle solving gameplay to boot. A unique experience, both entertainitng and educational, that I am enjoying immensely.",
            "review_score": "1"
        },
        {
            "review_text": "Best quest I've ever played.9/10.Thanks Ubisoft Montpellier for the games they making.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts: The Great War is a game like nothing I have ever played. It is not the type of war game that commands you to kill and kill again; instead, it asks you to solve puzzles and play through a war story that is incredibly human in every sense. Mark my words, by the end of the game, you will feel emotion toward these characters and when a video game does such, it is quite special. If you're looking for a war experience akin to Battlefield/Call of Duty, etc. this game is not for you. If you are looking for an intense storyline that involves you on a deep personal and emotional level, Valiant Hearts: The Great War is a perfect match. I was a bit skittish purchasing the game in the first place due to the fact that I'm not a fan of puzzle games by any means but this game is so much more than that. Bravo, Ubisoft.. You made one hell of a game!",
            "review_score": "1"
        },
        {
            "review_text": "While not an incredibly lengthy story, it is very memorable.  There are a number of mementos to collect throughout the story and it can be easy to miss collectables if you aren't paying attention to your surroundings.  Diary entries from the characters as well as facts from the real war give you a better sense of what is happening during the story.  An amazing art style paired with a fantastic soundtrack make this one you will remember for a long time. Definitely pick this up if it's on sale. Highly recommended!!  So many feels/10",
            "review_score": "1"
        },
        {
            "review_text": "Made me cry 10/10 Perfect Masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "Heartly laughs were had Manly tears were shed Those Valiant Hearts We shall never forget.",
            "review_score": "1"
        },
        {
            "review_text": "It's like playing a historical comic book. Great interface, immersive story, educational, wonderful artistic style. Can't recommend this enough for indie lovers, and side-scrolling puzzle enthusiats. Possibly the best game about war I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Very simple but not easy game. Graphic are pleasing for the eye and and ending is a freaking tearjerker. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great",
            "review_score": "1"
        },
        {
            "review_text": "This game details the story of a French man, his daughter, her German husband, their Belgian friend, an American soldier, and their loyal dog, during one of the most traumatic events in human history; World War I.   If you're a history buff, you'll like this game. If you're not, you'll learn a few things. It takes some liberties with history but it portrays facts in it's own quaint artstyle. The gameplay mainly consists of non-difficult puzzles, stealth elements, and small quick-time events. But the beauty of the game comes from the imagery conveyed, the narrator, and the splendid musical score.  Also this game requires UPlay, but after playing through Valiant Hearts once.... ♥♥♥♥, I'd play it again on Origin, Steam, UPlay, Impulse, GWFL....   Definitely something that makes your eyes sweat and your nose runny, so prepare your tissues.",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft Montpellier really shows how a good 2D adventure(ish) game can be done. The fictional story is set in world war one and revolves around five people on both sides of the frontlines whose faiths are interwoven. The player controls each of them alternately and tries to help them make it through the horrors of war. He/She does this by solving small puzzles (get X to perform action Y to get Z for A, ...) and a series of timing events.  The game is narrated and plays a little bit like an interactive movie (although there is enough player controlled sequences to not count as one).",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, wonderful, amazing and awesome at the same time. + A very good story + World War I setting + Very emotional + Nice and fitting narrator voice + A whole LOT of background information + Ending could make you cry (at least it made me cry) + Nice characters + Well suited for everyone  - Gameplay could become repetetive after a while  = A game to be totally reommendable 11/10 - My absolutely favorite (story-based) game since I played it 'till the end  Nice job, Ubisoft!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Immersive story. Learn some history. Puzzles are cute - some were hard for my old reflexes.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good. Bunches of WW1 facts and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Oh . What should I say , the game is beautiful . Same idea for the game. The game tells the true story. The game is in some places cheerful , exciting and sad . The end of the game is so sad that I almost cried as he told in the letter. So so sad",
            "review_score": "1"
        },
        {
            "review_text": "first video game that made me cry for an hour",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts tells a beautiful story about a group of people helping each other during the war. It's a beautiful looking game and has a great soundtrack and interesting characters. Sometimes the controls can be problematic, but it's a small bump in an otherwise beautiful game through and through. Some of the puzzles will require you to think more than others, but it's definitely a game that all can enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "A game about The Great War. I feel that this game is more of an educational game rather than samething you pick up when you want a good story or good gameplay. Ofcourse this has a story too and it isnt fictional, it just wasnt quite something i could enjoy. Most of this game is filled with quite tedious and easy puzzle solving, but the cutscenes are good and the ending is very touching.  I would rate this 6/10",
            "review_score": "1"
        },
        {
            "review_text": "It is a game that focuses diffrent side of war than most games, it focuses on Horror of WW1, and fear of people that were in war. This is not a game for fun or very action packed, its more of story focused, puzzle solving, It is also a game that is trying to make you feel sad, it also got me before the end arrived, yup thx game you did it i was sad for a character. It is nice to see a decent and innovative game from ubisoft.  Rating: 'Kill me softly with theese bombs' ",
            "review_score": "1"
        },
        {
            "review_text": "A true master piece, this is not just a game but a story and reflection of the horrors of WWI. It made me cry 100/100. Must buy.",
            "review_score": "1"
        },
        {
            "review_text": "this game is sooo good.......i'd recommend it for anyone who likes a title with amazing narration and a very good OST even the gameplay is so amazing and a plus point is that you learn a lot about what went during World War 1 also love the way you get to pick up stuff that existed during that war  Let the shooter based games go for a while and try this out! :D",
            "review_score": "1"
        },
        {
            "review_text": "A great little bite sized game that you can sit down and play in about 4 hours. The game really stands out to me because of how much heart it really has and by the end how invested you feel in the characters struggles. It differs from traditional war games by not making the war about fighting a soulless enemy. The game is about helping the people who are being hurt by the war, allied, enemy or civilian. One part the stuck out to me was when you come across a stuck enemy solider in a mine, you help him out and you both work together to escape the mine. On your way out, you get caught by enemy soldiers and he saves your life in turn. The game really is good at putting the point across that you are fighting people who are in the same situation as you but were stuck on the other side of the line when boarders were drawn. The game is satisfying and emotionally engaging and has an adorable loyal dog following you around the whole time. The game and its puzzles are not particularly difficult and usually really easy to figure out but it fits the direction of the game and they are often worked into the story so I don’t fault it for that. I would recommend if you are looking for a short but heartfelt experience.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant and poweful. A breathtakingly beautiful reminder of war's all-encompassing destructive nature. Thank you.",
            "review_score": "1"
        },
        {
            "review_text": "This game was very well made from the puzzles to the stories. I've never been one for history but this game sure put me right in 1914. When a game can make you cry, well they did somthing right. It really does put war into prospective. The things that go on. It really makes you appreciate what you got. Totally recommend it. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game, plain and simple. Everything from the touching stories of the characters, that lure you in with a seemingly 'simple' art style will present very clearly the horrors of war. Also the facts the game gives you, the items you find will round off how life was in that horrible period of history. The puzzles are also fun and interesting, and won't bog you down and slow the progress of the story. In short, buy this. You will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most fantastic example of storytelling along with a smattering of lessons from history.  I finished the story about a half hour ago, and I'm not crying.  However, the only reason I'm not crying is because I ran out of tears about five minutes ago.  10/10 buy this game under all circumstances.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I enjoy reading reviews like these when deciding whether to buy a game or not, but I have to confess that I never bothered writing one on my own. Valiant Hearts: The Great War completely changed my mind regarding my laziness. Let me tell you why.  Do not let the thought of 'meh, sidescrolling 2D action-advanture' fool you for one second. This game is a masterpice of art, not trying to convince with an overly complex gameplay or hardcore-realistic graphics. The style of the latter, although not unneccessarily fancy, will grab you instantly and transport not only the setting, but also manages to mimick the atmosphere, from a sophisticated, patriotic and confident public opinion in summer 1914, the sudden realization about the implications of war for the individual, up until the despair when the perversion and intensity of the bloodshed rises, and the senselessness of these massacres becomes obvious. The five intertwined fates caught in this setting will grab you from the very first moment, each in its own way, as the protagonists strive to find their way through this madness in order to keep their loved ones safe and sound. Speaking of sound - the simplified, nonetheless emotional simplification of the different languages absolutely serves its purpose, accompanied by a soundtrack that will literally bring tears to your eyes as the stories draw to their close. Along the story, you will get (optional) background information, always fit to the situation your characters will find themselves in, and also find curious belongings of people whose fate has been decided before yours. Yet another positive aspect is the storytelling itself. The narrative elements are professional, authentic and touching, and not for one second cheesy. You will not be pushed towards picking sides at one point, as Valiant Hearts does not try to draw 'good' and 'evil' among the warring factions. What it does, though, is depicting war with all its consequences, not judging guilty and non-guilty, but rather its abnormality and perversion, and the suffering for the people caught in it. And it manages to do so in an astonishing and intelligent way.  To sum it up, let me recite my earlier statement: This game is a masterpice of art and definitely worth your attention. If you're tired of the 100th shooter and graphic orgies with cheesy heroism: Do not hesitate a second to buy this true gem and show game developers across the world that we do want more of this kind! I definitely do.",
            "review_score": "1"
        },
        {
            "review_text": "This game has fantastic art and music. It is simply a puzzle solver game with very limited game play mechanics, but this game is much morea bout an interactive story and World War One experience than anything else. I espeically enjoyed how some scenes had music alligned with the actions the player takes. This game had a fantastic emotional story and I felt that I really did care about the characters. It is also a great historical learning toll as it has alot of background information about World War One.   The game is only 6 hours long and has virtually no replay value. I overall reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Good puzzle based gameplay with a steadily increasing difficulty curve. Boss fights synchronized to classical music. Interesting art style. Phenomenal story that avoids nationalism and focuses on the individual.  Cons: UPlay required.  Notes: First time in a long time that a game has made me cry like that. Even though for the last half hour or so the ending seems inevitable it stills hits like a ton of bricks. Consider investing in a crying towel.",
            "review_score": "1"
        },
        {
            "review_text": "Can't Stop Cryin' :'(",
            "review_score": "1"
        },
        {
            "review_text": "Warning: you will cry.",
            "review_score": "1"
        },
        {
            "review_text": "I cried Ten outta Ten",
            "review_score": "1"
        },
        {
            "review_text": "I don't normally write reviews for games I play, but I think this game is really worth an exception.  Valiant Hearts: The Great War is a game that takes you through the historical event 'World War 1', and lets you play as the four characters Karl, Emile, Anna and Freddie.  Karl was born on May 6th, 1896, in a village near Strasbourg, Germany. He is a German citizen located in France during the eruption of WW1, and is in the beginning of the game deported to Germany and conscripted into the German army. Profession: unknown  Emile is the step father of Karl, and is unlike Karl, nationally French. He was born on March 12th, 1872.  Emile faces the same fate as Karl does, but is instead conscripted into France's Military Service. Profession: Emile's unique ability is, since his family has a history in the mining business, to dig gravel and make great tunnels that he can advance through and find secret items with.   Anna is a Belgian soon-to-be veterinary, born in Ypres on December 26, 1891, but after a head-on experience with the devastating effects of war, she decides that the human anatomy would be a more fitting profession for her. She becomes a paramedic and later advances to the front to help the ones who are really in need. Profession: paramedicine. Anna's special ability is to heal wounded soldiers, which when performed, puts the player in a quick-time event where you have to push the right arrow keys at the right time.  Freddie was born in La Place, Louisiana, on Feberuary 27, 1882. He enlists as an engineer for the French in the beginning of the war in order to get revenge on the Germans who killed his wife, Margaret.  Profession: muscle man and 'Barbed Wire Snipper'. Yes, Freddie is the only character to invariably walk around with pliers in his... pockets? Well, this gives him the ability to snip entanglements of barbed wire, set up by the opposing army to slow down your progression.  Walt (indirectly playable) is a German shepherd dog trained by the German military to do various task given to him. Although Walt would probably not be considered a 'playable character' by most people, when he is in your prescence in-game, he will help you solve puzzles, fetch items and distract guards whenever you want him to. Just throw an exhortation in his direction and he will comply without hesitation. Such a good dog. Profession: distraction, permeation and fetching. When there is a small space that you can't squeeze through, but there's an important item on the other side of it, Walt is the perfect companion for you. On a normal occation, Walt can distract a guard with his charm, making the guard turn his back towards you.  When you have passed the guard, you notice a hole in the wall, and on the other side, there's a stick of dynamite.  Tell Walt to squeeze through and fetch it for you, which he does, so you then can light it on fire and throw it at the guard, resulting in a blow that both takes out the guard, and blows away the door he was guarding. And the best thing of them all, he would never desert you. :)  Throughout the course of the game, you frequently shift between these four protagonists in order to solve various puzzles, creatively kill German (and sometimes even French) soldiers, dash through early 20th century warfarian terrain with a 'panzerwagen' invented by a kiddnaped scientist (Anna's father) held prisoner by German officer Baron von Dorf etc.  The game features an aesthetically beautiful artwork, collectible items that shows trivia about the item and how it was used during the actual war, facts about different cities' involvation in and management of WW1, personal diaries written by the affected characters in order to get to know them better. And last but absolutely not least, an immensely touching plot that, even if the coding and programming would be ♥♥♥♥, would most likely carry the game anyway.  With all that said. Would I recommend the game? Hell yes, I would. Don't ask any questions, just buy it already!",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this. It takes a while for the heft of the story to build, but it was deeply affecting. It somehow injects humor into the puzzles without taking away from the seriousness of the plot. The art and music are incredible. The puzzles aren't too simple or too hard. They feel just right to keep things moving, and never get in the way. Much of the time they are teaching you history without being too heavy handed about it. I need some time to reflect, but right now this is definitely a 2014 GOTY candidate for me. Just a perfect little game.",
            "review_score": "1"
        },
        {
            "review_text": "Good Story... Its good to see a game about war from time to time that is not just about killing...",
            "review_score": "1"
        },
        {
            "review_text": "This game is adorable. Made me cry. great puzzles. Please buy this. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not crying, there's something in my eye. ♥♥♥♥ the war.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is able to tell the horror of the war, while also finding hope and love amidst all the chaos. It has some charming puzzles and some interesting set pieces. You become invested in the characters, despite the only characterizations are their short simlish like one liners to each other and the narrator's story. Some parts near the end of the game get a little aggravating, only because it forgoes some of the gameplay you were taught to expect and essentially play a very patient and quick game of Simon Says, where I ended up losing and restarting multiple times because the reaction time was very small compared to the rest of the game. Though annoying it didnt deter from the overall experience. As you would expect, the story culminates in one hell of a feels train.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. I have never felt so much feeling and love when playing a game before. This game is addicting, action-packed, dark, sad, happy, informative, and brilliant. I finished it today and i have to say, great work on the game Ubisoft. I nearly cried at the end of Valiant Hearts: The Great War.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is a game with a potent message about the various themes of the First World War and human conflict in general. At the time of writing I have just finished the first chapter and I found it very enjoyable and really like the game so far.  I found that the level design, the difficulty of the puzzles, the characters and their particular stories were great and allow you to have lots of fun whilst developing an understanding of a conflict which began one hundred years ago.  To me, I found reading about all the various events, people, things and objects to be both enjoyable and a sombre experience. Reading about these things gives players something real to think about, that although seperated by history and one hundred years, we still remember the iconic images of trenches and the terrible bloodbath of the Western Front.  Given that it is going to be the one hundreth anniversary of 'The Great War' it is through things like Valiant Hearts that one of the many human tragedies of the 20th Century will be remembered.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply beautiful. Game play is kinda meh, but the story is simply amazing. If this were a comic book, novel, or movie, I'd immedietly by it and badger all my friend to see it.",
            "review_score": "1"
        },
        {
            "review_text": "'Valiant Hearts' is maybe Ubisoft's tribute to the victims (soldiers as well as civilians and aid workers) of World War I - and wow, was it an impressive experience! The player controls four different characters as they try to survive the war or help to survive. So it's a mixture of action, adventure and puzzle game which also challenges the player's skill and concentration. Don't let the comic book-like visual style confuse you: This game does not hide or relativize the horrors of this war. Sure, there are no deformed faces or guts seen in the game but still enough blood and corpses to keep serious and yet it's not glorifying the lust for blood.  In a time where one war ego shooter after another gets made, 'Valiant Hearts' touches the player's heart due to the characters and the constant reminders of humanity and kindness between (or even in the middle of) battles. Sure, the game has its funny and lighter moments, too. But they hardly ever make the whole story and situation look silly. The puzzles are quite easy but fun to solve. And the game gets more and more intense the further the player goes. You can also collect information about World War I, achievements and special hidden items which served special purposes back then.  And last but not least: This game can be a real tearjerker at the latest in the final chapter. In a nutshell: I can definitely recommend 'Valiant Hearts' to about anyone. It was a great experience of a game and I would replay it someday.",
            "review_score": "1"
        },
        {
            "review_text": "The feels",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've ever played!!! Beautiful game!!! Great story!!! 4 characters cross their paths on an amazing game about the story of the WW1!!! It's not about action game, it have puzzles and a great friend in your side, a dog that makes you company in your journey!!! Simple amazing!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game. Insted of just shooting and killing you actually solve puzzles. I would highly recomend this games to my friends. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't ready for the feels.",
            "review_score": "1"
        },
        {
            "review_text": "if u like history and on a mood for a really good story, then this is the game u wanna play. also great music too",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is one of these games every person needs to play. It is a beautiful game with a strong and emotional storyline that stops you for a second and forces you to think. It is a good game that takes you away from all the other bigger games where violence is the meaning of the game. This game is also about violence, but not the violence you create but the violence that the world once wittnessed. But it still takes it time to tell a good and beautiful story about a broken world.  Buckets for tears and tissues is strongly recomended! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is not like any ordinary game. This game is not anything, like you have ever seen before. Is a game that takes you to a journey of how horror war can be; how much impact each soldier can affect his or her life in an instant. Of how a person feels for the first time ever of what it is to be afraid-this-is hell.   HISTORY AND PLOT",
            "review_score": "1"
        },
        {
            "review_text": "7/10 (tl;dr at bottom)  Welcome aboard the feels train.  Altogether the game took me around 6.5 hours to complete. I took my time, got stuck on more than a few puzzles, and collected about 3/4 of the hidden items. This also takes into account the time taken to read all the Facts and Diaries. If you do go back and collect everything, you are looking at 7 hours - 8 if you're lucky. This might make some of you skeptical, considering the $15 price tag. Fortunately, the quality of the content in that short amount of time makes up for *some* of that.  - Pros -  1. As you can imagine, the game's strongest selling-point is the story (no spoilers here, don't worry). There are four intertwining arcs going on simultaneously, and they are easy to keep up with while not being too simplistic. It does a great job of focusing on the horrors and historical facts of the war, avoiding taking sides. Everything is shown in an unbiased light, as it should be. There were a few heart-breaking moments that had me and many others teary eyed. At times it could get a little... over-the-top? But it seemed to have a purpose and was necessary to progress the plot.  Another thing worth mentioning is the Historical Facts. There is a lot of good information to read about The Great War which can be accessed during the game by pressing Tab. These are entries seperate from the hidden items (which I will talk about later). I learned a thing or two from these, and the pictures from the war make it all very interesting and a nice addition to the game.  2. The puzzle gameplay is right at home here. A perfect balance of simplicity and complexity. Sometimes you will find yourself stuck, but in nearly all circumstances you can take your time to try and figure it out. If you need help, the game actually gives you Hints periodically. Most puzzles will require you to work with your side-kick, the medic dog Walt, and the mechanics for this work well. There also wasn't really a time where I felt bored or - even worse - annoyed by them, because they change it up throughout the game. They do seem to get a little more difficult toward the end too.  3. I think that the art does the game justice. It isn't distracting, adds to the immersion.  4. A very small part of the game is the collectibles, but it definitely is a pro worth considering. This is pretty much all of the game's replay value right here; it is easy to go back into previous Chapters of the story and find all the hidden items. I will not be doing that (Assassin's Creed was enough), but plenty of guides are available on Steam and the internet. The purpose for these is to give little facts about the era or the war specifically, and it's pretty educational. They also aren't very long reads, so it won't take away from immersion.  - Cons -   1. For the story being the main-selling point (and the strongest aspect of the game with the puzzles), the characters in my opinion were pretty flat. Part of this could be due to the lack of voice acting, which is a shame, because the voice acting that IS in the game is decent. Also, this weakness can be attributed to the story being told more through moments and actions. This is not to say you won't feel anything for the characters, but I feel this certainly could have been stronger. And the Diaries were a wasted opportunity to fix this. They all write the same, and feel more like a way for the game to help the player keep track of what is going on. In the end, my favorite was the dog. Walt's just such a cute badass mofo.  2. I'm tired of games needing several third-party platforms. If you're going to buy this game, just get it on U-Play and avoid the hassle.  3. Despite how superb the content is, the game definitely should be at least a few dollars cheaper than it is. I recommend waiting for it to go on sale before buying it. A fine game, but I don't think what it has to offer equates to the current price *unless* you're a hardcore fan of the genre.  ---  tl;dr While the story was a little short and could have been even better with more character development, mixed with the balanced puzzle gameplay it is the best aspect of the game. Mechanics all work smoothly, no glitches during my playthrough, and the hidden items are fun to find. When the game gives you a moment to take it all in, TAKE IT ALL IN. The art style is charming and fitting for an indie game. It's portrayal of World War 1 is not only accurate on a historical level but also on a deeper level. However, unless you're a fan of these types of games, wait for a sale.  I won't forget the story, or the feels it brought me, for a long time to come. And I &lt;3 Walt.",
            "review_score": "1"
        },
        {
            "review_text": "This game broke me. 10/10  'Futility'  Move him into the sun— Gently its touch awoke him once, At home, whispering of fields half-sown. Always it woke him, even in France, Until this morning and this snow. If anything might rouse him now The kind old sun will know.  Think how it wakes the seeds,— Woke, once, the clays of a cold star. Are limbs, so dear-achieved, are sides, Full-nerved—still warm—too hard to stir? Was it for this the clay grew tall? —O what made fatuous sunbeams toil To break earth’s sleep at all?  -Wilfred Owen",
            "review_score": "1"
        },
        {
            "review_text": "I instantly nominated Valiant Hearts for ''I'm not crying, there's something in my eye'' because I cannot recommend this game enough. I cried an ocean not a river...",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "A fantastically crafted historical-fiction light puzzle game that has beautiful graphics and an emotionally-charged story.",
            "review_score": "1"
        },
        {
            "review_text": "I am still crying",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. It shows that games are not a money. They are an art.",
            "review_score": "1"
        },
        {
            "review_text": "Made me feel like a piece of ♥♥♥♥. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "If you didn't feel at the end of this game, you don't deserve a soul. Uplay's still ♥♥♥♥ though. 7.9/10",
            "review_score": "1"
        },
        {
            "review_text": "tears",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly well made game - learnt a lot from it. Grab a bucket for them tears, because you'll need it.",
            "review_score": "1"
        },
        {
            "review_text": "You already know what this is.   This game has done everything perfectly. I have no problem with it at all.   I teared up a lot during this game.   I really dont know what to say am still in shock because of it.   Humanity/10",
            "review_score": "1"
        },
        {
            "review_text": "Had my eyes onto this game for since it announcement because i always love World War 1 / World War 2. When entering this game i was told a good story with some puzzling.  I got more then i expected, it is apuzzle game but man wow that story. With that music! please give them an award for the music, it is really magnificent! It really tells the story.  The story is based around World War one and the key moments liek the battle of somme, verdun and fort beaumont. But also some areas behind enemy and friendly lines. Because of the art style it really simple explained but they are not affraid to show how horrible the first World War was, like waling throught a field of half-corpses of french soldiers.  If your looking to get into a good story, here it is! (Had even to wipe away some tears at some moments) and please don't let the uplay thing let you down to not play this game.  A real highlight of the year for me 9/10 and again please award them for the music ;)",
            "review_score": "1"
        },
        {
            "review_text": "The good: This is a world war 1 game, the first ever i have played(i think) and i enjoyed the setting. The game contains alot of facts and trivia about ww1 that i found intresting. The story is good. Game looks great! Music is good but limited. Game ran great for me.  The bad: Story did not grab me until close to the end. Gameplay was too easy, and boring. It had a few 'puzzles' that frustrated me, but not many at all were difficult.  In summery: I have a hard time judging this game because the story did affect me in the end but i found the gameplay slow and a bit lacking. I thought the setting was really interesting and fresh! The naration was great but maybe i would have better or early'er connected with the characters if they had real VO and not just 'Gibberish voices'. It took me six hours to finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "It is difficult for me to write a negative review for this game because I find its goal absolutely admirable. The Great War is a notoriously difficult topic to approach due its complexity and, to a contemporary observer, absurdity. As such, the AAA industry is frequently guilty of 'WWII-fying' WWI (actually Valiant Hearts is also somewhat guilty of this to some extent). Incidentally I believe that some people will vehemently disagree with my assessment and believe me, I really wanted to love this game. At the very least, I would like to see other attempts at the challenge Ubisoft Montpellier set before themselves. Eventually somebody is bound to succeed at it.  The main problem of Valiant Hearts is the extreme inconsistency between the tone and the subject matter. This is the single worst conflict in human history, as horrifying to the people of last century as is to us today and yet this war is stylized here as a Franco-Belgian bande dessinée. You may argue that the cute cartoony style is used to attenuate of the sheer unspeakable terror of the war but if so, the stylization goes too far and robs the scenes of their impact. Valiant Hearts does attempt to redress itself towards the end with the mountains of corpses and hellish landscape of Chemin des Dames but this actually sends the wrong message by implying that the Nivelle Offensive was somehow worse than the rest of the war (if you disagree with this particular point, I invite you to compare this chapter with the depiction of Verdun earlier in the game).  While the story is at least serviceable, there are several things I wanted to point out. First of all, it is quite strange that the protagonists of Valiant Hearts include an old French farmer, a German expatriate living in France, an African-American who volunteered to fight in the French army and a Belgian faculty of medicine student in Paris. You can see the pattern here, right? Walt the dog is basically the only character who is not affiliated in any way with France. You may argue that this was a deliberate decision to allow the characters to meet sooner in the story but, by taking clear sides in the conflict, Ubisoft Montpellier made a big mistake. After portraying Germans as sausage-munching, beer-guzzling mustachioed villains throughout the first half of the game the developers did only token attempts to undo this stereotyping by the story’s conclusion. While I can’t blame a French developer for siding with France in a fictional depiction of WWI, the war requires a more nuanced approach and Ubisoft’s partisanship contributes to an industry-wide misrepresentation of WWI. It is downright irresponsible to draw from WWII archetypes to characterize Baron von Dorf. I don’t care that a 20th century French peasant is somehow fluent in English and appears to be the strongest man alive. I draw the line at Baron von Dorf however: the character belongs in Wacky Races, not in a historical drama.  When it comes to the gameplay of Valiant Hearts, I admit to being something of a fan. The list of influences is wide and varied, including titles such as The Incredible Machine, Commandos: Behind Enemy Lines, Metal Slug and the Sierra/LucasArts classic adventure games. Despite the simplicity of the controls scheme the game was quite varied and enjoyable, save a few trial-and-error action sections towards the end of the story. I do not actually have many complaints here. The annoying hint messages, which appeared whenever you stopped to admire the multi-leveled level art, were completely unnecessary and got in the way. Admittedly this is a minor complaint and in fact I can only think of one major gameplay issue: Anna’s QTEs. QTEs in general are something of a lazy shortcut, used whenever the designer wants to keep the player engaged in the game but can’t come up with anything better than timed button prompts. In Valliant Hearts Anna’s rhythm game sections are initially harmless but quickly overstay their welcome. More importantly, the ‘game-ness’ of QTEs actively distracts from the unpleasant nature of Anna’s actual tasks, which include applying stitches and even an amputation! In fact the game's finale is particulary impacted by these obnoxious QTEs. Fortunately the ending still has emotional impact due to the strength of the overall presentation.  Like I wrote at the beginning, I really wanted to like this game. It certainly has a lot of merit but for me the bad ended up outweighing the good. I think the aesthetics and 'game-y' aspect of Valiant Hearts clashes with the message it tries to convey. The desperation and misery of the human condition as it is conveyed through context, collectibles and historical footnotes throughout the game is frequently undermined by the chunky and friendly exaggerated art-style, silly mumbling voices and Walt’s disarming charm. I applaud Ubisoft Montpellier for attempting to convey the tragedy of the Great War to a wider audience but I find the results unconvincing and difficult to recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "What an absolutely beautiful game. A touching and spectacular story. Great characters. Solid gameplay. A gripping atmosphere. Fantastic dialogue. A great representation of WW1. Where to start? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts, was. Amazing, I cannot put into words how this game made me feel when I finished it. The price, the playtime, everything is just. Perfect. This game is what 2D games should be.   The artstyle is amazing, the game is very well true to the events of the First World War and teachers most about the events. (I would seriously read them as they come)   I haven't actually teared up at the end of a game before, this game is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game. I finished it in about 9 hours, and was hooked the whole time. The story is 10/10 and the ending made me choke up. Must play for puzzle fans/ww1 historians.",
            "review_score": "1"
        },
        {
            "review_text": "War... war never changes. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "11/10, would have something in eyes again.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game For Good People It Has Good Story And Has Good People Great Game",
            "review_score": "1"
        },
        {
            "review_text": "would kill that officer again.     ✮✮✮✮☆  ",
            "review_score": "1"
        },
        {
            "review_text": "this review can be finished by saying, 'BUY IT!!!!!!!!!!!!!!!!!!!!!!!!!'",
            "review_score": "1"
        },
        {
            "review_text": "MANLY TEARS WERE SHED 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Manly tears were shed.",
            "review_score": "1"
        },
        {
            "review_text": "Best part: The pigeons wear little Adrian helmets. So cute! 0_0 part: 'Quick, take cover behind that pile of dead Frenchmen!'",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story, great soundtrack, a forgotten war.",
            "review_score": "1"
        },
        {
            "review_text": "Highly reccomend this game. Probably the best game I've played in a while.",
            "review_score": "1"
        },
        {
            "review_text": "touching",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've played but I would like to see some wierd creative dlcs but still an amazing game, graphics are good this game is a master piece so worth the price",
            "review_score": "1"
        },
        {
            "review_text": "kinda like csgo but with less gun skins  11/10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't finished this game yet and want to take my time going through it. This game isn't about being difficult or offering a challenge. The core of this game is story. Although I dabble in puzzle games like Limbo and Portal you can figure out a puzzle in around 15 minutes of just tinkering.  When you hear about war and games you expect to be mowing down hordes of enemies or battling players online. The emotions of most war games are saved for trailers.  This game is the tale of different characters from different locations around the world and even tangles with one of the characters being forced on to the opposing side. A civilain called to war. I don't know if this comes into play yet and we be a major part of the story. But I am looking forward to finding out what happens to everyone.  Looking at the game at first glance you would think it was a game for children. But the stories of these characters are quite inspiring for people of all ages. It is some of the stories that are lost at war everyday.  ",
            "review_score": "1"
        },
        {
            "review_text": "The stoy is fantastic and the game overall is very informative; I learned a lot about WWI. The gameplay is varied and the art style is very cool. I'd compare this game's tone to the Grand Budapest hotel, it takes on serious dark topics but manages to have a playful tone that is never disprespectful. The only con I can think of is a couple of the chapters had some annoying parts that required trial and error. Overall definitey a must play.",
            "review_score": "1"
        },
        {
            "review_text": "this was a game that i loved in every way. i loved the art, i loved the story, i loved the music, and i cried really hard at the end",
            "review_score": "1"
        },
        {
            "review_text": "Definitely best 6 hours of my gaming career. 9 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts: The Great War Review.  Introduction: Valiant Hearts: The Great War is a 2D adventure/puzzle game by Ubisoft. The game is inspired by letters written during the great war and follows four characters journey through the battlefield. Each character has there own unique reason for being involved, but their story’s soon become intertwined.  Story:  The story is well written and clever in the way it brings our heros together. As you progress through the game you will unlock journal entries explaining why things are happening or what things are. Andthese entries aren’t works of fiction ether, they are all based on fact. All through the game you will be unlocking more and more of these, until you have almost a text book if historical information on the great war. Now I covered World War 1 at school, so a lot of these weren’t that interesting to me. But I like the fact Ubisoft has tried to not only make a game but educate the user too, that’s not to say the user need educating but its there for them anyway.  It seems a shame with Ubisoft taking this much time to get there facts correct, that they have chosen to use a completely fictions story. There are so many true stories that could have been just as heartfelt and at times tragic as this one, but maybe they were trying to avoid offending living relatives. I’m unsure of there motives, but feel the game suffers a little for this and that a true story would have inspired real emotion from the player.  Gameplay:  The controls are a fairly simple affair using the WASD and a few other buttons when needed. But as the game has no real twitch elements you never find yourself overwhelmed or out of your depth. There is the odd in mini game that requires timing, but its nothing too taxing and check points are mercifully regular if you do get it wrong.  You will spend much of the game going back and forward, slowly progressing as you solve puzzles. The puzzles aren’t that taxing ether, normally requiring you to find a key or gear for a bell tower. Its generally pretty clear what you have to do and that is the games biggest downfall, the puzzles are so liner that the challenge is somewhat lost.  That’s not to say its bad, but it does get a little monotonous running back and forth for the fifth time, or finding the handle for a leaver the tenth time.  Presentation:  The game has a pleasant style, with the art resembling that of Castle Crashers. The down side being that where Castle Crashers sprites are bright and colorful, these are a far more dull affair with grey and greens being the order of the day. Of course this fits far better with the theme of the great war, but can be a little bland.  The animation is good but basic, these 2D characters don’t have a massive array of movement at their disposal. But to be fair they don’t require it and what they do have is great. There’s nothing to blow you away here, but there’s nothing to hate ether. In fact I enjoyed the style very much.  Conclusion:  It may sound like I hate this game, but I really don’t. I like the game, but I don’t love it. I feel Ubisoft has taken a very hard subject and tried to make something not only touching but educational as well, in this goal I think they have only partially succeeded. Those who could probably do with learning from this game will most likely not bother reading the facts given, and those who have some knowledge will find them an annoyance. It really is a valiant effort by Ubisoft and the game is good, but I very much doubt you will want to play it for much more than an afternoon.  For more of my reviews see  Cyberus UK  [www.cyberusuk.com] ",
            "review_score": "1"
        },
        {
            "review_text": "  Sad, deep, but awesome story. This is not a Game with a story, but a story in the shape of a game.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into games with rich storyline then this is probably one you shouldn't miss out. Amazing 2D artwork and very smooth gameplay. What better way to experience a story than through video game.",
            "review_score": "1"
        },
        {
            "review_text": "Game is beautiful, nice animation, good story, and I realy like this game, in case IF I can run it through this terrible Uplay.  In 80% of the starts the game 'already runned' but I see nothing, and have to stop it through task manager. And run again. And again. And again.   But speaking about the game - when it works I really like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my favorties, probably in my top 5. Its different than games today. Games today are all about killing, nothing else. This has more than that. This is making new friends and finding your lost loved ones. Discovering how bad WW1(The Great War) was. Ubisoft made this game amazing. Highly recommend buying this game. Touched my heart...  Shutup about Uplay. You can earn points to get free stuff. Enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!  But you are forced to create an account on UPlay and all the good usernames are already taken. Like 'FUuplay' or 'IHateUbisoft'.",
            "review_score": "1"
        },
        {
            "review_text": "A not too difficult of a puzzle game, with an awesome typical French art-style and a catching story.",
            "review_score": "1"
        },
        {
            "review_text": "With it's captivating art style, beautiful soundtrack and well-written, realistic characters, Valiant Hearts will take you through an emotional and, most importantly, educational journey, where you learn that war, from the beginning of time, always brings needless death and suffering of people on both sides of it, ordinary people caught in the crossfire. That being said, nothing is essentially black and white, the one by your side might be a bigger enemy than the person you are fighting against, but the power of love never ceases to protect, inspire and push you to your limits. And this game succeeds in reminding you of one important lesson you might have forgotten - you should never stop fighting for it.",
            "review_score": "1"
        },
        {
            "review_text": "Great perspective.",
            "review_score": "1"
        },
        {
            "review_text": "A not too difficult of a puzzle game, with an awesome typical French art-style and a catching story.",
            "review_score": "1"
        },
        {
            "review_text": "Small beutiful WW1 themed puzzle game.  If you love WW1 themed games, Buy it.  If you love puzzle games, Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Small beutiful WW1 themed puzzle game.  If you love WW1 themed games, Buy it.  If you love puzzle games, Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Played for a couple of hours, but was not drawn back. Despite the story and personality this game has, the gameplay is bland. The puzzles are essentially pictures in bubbles showing you what to do next. The end result is that I felt as if I was just going through the paces to get to the next bit of story. Its hard to recommend a game when the game portion is so underwhelming. It's very short apparently, so if you feel like trudging through the interruptions to the story, you are not investing much.",
            "review_score": "-1"
        },
        {
            "review_text": "amazing game!!! Makes me cry every time ;( 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts: The Great War is a tragic tale of five characters that are drawn together during the First World War.   The game is a 2D side-scrolling platform title set on a stunning artistic backdrop comprising of puzzles and a powerful narrative throughout. It is a truly special title that not only succeeds as a great game; but provides a deep insight into the historical events of 1914-18 which educates and informs the user in an engaging way.  Your journey sees you undertaking the role of four playable characters; Emile, Freddie, Anna and Karl - each with their own story that intertwines into an absorbing tale. They are also accompanied by a faithful companion; Walt, who is a dog that helps along the way. The superb writing really makes you care about the characters and their experiences.   Valiant Hearts's stand-out gameplay aspect is puzzles - most of which are fairly basic but are all varied and great fun to complete. Despite the simplicity of many; they are superbly orchestrated. The general mechanics are easy to pick up and the controls are simple which make the experience a joy throughout. There are a wealth of collectables and achievements that ensure you explore every nook and cranny of each location plus many historical prompts which offer a deep insight into the real events of the war away from the game. These also contain real pictures and intriguing information that brings the colourful aspects of the game into a harsh reality of the tragedy.   Overall, Valiant Hearts: The Great War is a wonderfully presented product with a powerful story, excellent gameplay mechanics and impeccable visuals. Not only is it a fantastic videogame in its own right; it's a learning tool that keeps players engrossed in the 8 or so hours of play time available. It is a title that can be played and enjoyed by everybody.    *Note: uPlay is a requirement - I experienced zero issues using this DRM service on this game.",
            "review_score": "1"
        },
        {
            "review_text": "I... Uh... Got something stuck in my eye...",
            "review_score": "1"
        },
        {
            "review_text": "You want to know what is a war ? , play this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is really superb. While some levels break the immersion by giving rather difficult puzzles, some are extremely emotional, story driven and excellent. The creativity of the developers and designers of this game is out of this world. This game is a true gem in storytelling. It uses beautiful visuals and sounds to convey a message and its does that perfectly.  I highly recommend this game if you are looking for a unique, near perfect, story driven puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Its a breath of fresh air for Ubisoft.",
            "review_score": "1"
        },
        {
            "review_text": "U-play, the single most irritating thing, I have ever encountered. Y U no want me to play the game that I payed for. This is my review, I have no idea how this game is because I cannot crack the U-play code necessary to even launch it. I am super ♥♥♥♥♥♥. &gt;.&lt;  *update: I drew a turtle in the sand, and danced around it, only then would U-play allow me entrance to their special club. Once in, I discovered that the game is very nice to look at, puzzles are challenging, but not crazy. The stiff game mechanics can be a drag when everything has to be positioned 'just so' and your toon is on the wrong side of the valve, and refuses to return to the proper side. Occasionally, I got a feeling of 'not this again' regarding the repetition of a few actions, that were super fun at first, and then became 'meh'. Unfortunately, I still cannot rate this game up due to the U-play shenanigans. I have to pull up my task manager, and rapid fire end valiant heart tasks until the game decides to load, which is completely made of fail. Once I finish this game, I forever say F-U-play.",
            "review_score": "-1"
        },
        {
            "review_text": "i had a hard time because every time i clicked on it it would say its already running and i could not get it started",
            "review_score": "-1"
        },
        {
            "review_text": "T'was a good game. nothing else to say.",
            "review_score": "1"
        },
        {
            "review_text": "I agree that Valiant Hearts is a unique game. But I don't think it is that good.  In these days game developers tend to create games with charming artwork and touchy storylines. Like flash platform games about trying to reach your lover; which includes reading 524 line of love story. But is these really enough to make a game good? Is gameplay is that unimportant ?  After 4-5 hours, I stopped playing it. It was in my pc for a long time but I just didn't want to continue. Most games of this genre makes me want to spend more time, solve one more puzzle, save one more person. But in Valiant Hearts I; really didn't care.  Most of the puzzles in the game are childish and easy. Levels are designed like you can run around in enemylines and active battlefields. Game (in its story) tells you that war is terrible and really hard to get through. But in the action; you can just send your dog to that lever and you are done.  Try this game, but do not expect too much.",
            "review_score": "-1"
        },
        {
            "review_text": "BUYER BEWARE: Your first experience 'playing' this game will involve installing 3rd party bloatware/DRM called UPlay. If at any time the UPlay servers are down, you will be unable to login and unable to play the actual game. If any anytime you are offline, you will be unable to be logged in to UPlay, and you will be unable to play the game. Ubisoft sells the email addresses it collects from UPlay account creation. UPlay has been linked to save file corruption on multiple occasions.   The good news is that there are versions of this game that are available DRM free. Unfortunately the Steam version is not one of them. If you are ok with all of the above, by all means proceed with your purchase. Otherwise, look to enjoy this title elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game per say, well designed and a cute story.But the mechanics are not new, nor especially fun. The game is a bit to simple and gets repetative. I think it would fare better on a mobile platform.",
            "review_score": "-1"
        },
        {
            "review_text": "An amazing game, the gameplay is always changing. It also has a story with characters its easy to grow attached to. The ending was memorable, one of the best cinematic gaming moments I've ever experienced! Its on sale at the moment so get it immediatly!",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥, uplay..... What the ♥♥♥♥ are you trying to do? I pirated this game to see if it was worth buying. It was! So I waited to play it until I payed for it. Since I payed for it, I figured I'd just go through steam. WRONG, steam then opens ♥♥♥♥ing uplay, then you have to press 'play game' again, but then it wants to go through steam again.....? Luckily I only paid ~3$. But, yeah, I'll definitely be playing the pirated version, lol. This is a good game, but I can't recommend paying for it. Sorry, but uplay is just the worst!",
            "review_score": "-1"
        },
        {
            "review_text": "This is essentially a zany action arcade puzzle platformer that feels like it's intended to be edutainment for children. Effective, probably, for gently engaging and introducing an infant to the subject and history of WW1. Don't expect anything special if you're getting this for yourself, especially if you're even slightly versed on the subject of the War. In fact, the more of a history buff you are, the less you'll wind up enjoying the game. Good chance you'll hate it. From a mature adult perspective, much of the game is in horrendous taste.  As for the content and gameplay, some parts are polished with solid direction, conveyance, and quality control. Other aspects feel unfinished and detract from the overall immersion and narrative. Awkward design choices abound at the worst possible times. None of the puzzles are especially challenging, which is fine, but some come across as cheap or forced and will draw you out of the game at their silliness. Historical wiki snippets, collectibles, and diary entries accessed during core-gamplay are additional distractions that, though well intentioned, kill the immersion. By the end we found ourselves pretty removed from the experience, uninpressed with the predictable Hollywood conclusion, and happy to be done the game with no desire to ever play it again. It didn't deliver even a fraction of the feels one would expect prior to playing it if you've seen the trailer.   It's a nice game for giving people a general history lesson about WWI but the cartoonishness extends beyond the visual design and into aspects of the gameplay and plot. Arcade and rhythm action sequences are out of place and non-sensical. From a QA standpoint, it feels unfinished.  The music was excellent throughout and the visual style would be appealing if not for the ridiculous, occasionally tasteless action sequences and 'boss' designs.",
            "review_score": "-1"
        },
        {
            "review_text": "The game wont even start!!!.......T_T ",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even fu*king launch the game. Seriously, why is this allowed to be sold? Wish I could refund it.   !!!!!! DO NOT BUY THIS, IT IS RIDDLED WITH DRM AND LAUNCH PROBLEMS !!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I hear a lot about WWII and the horrors associated with it, but we don't hear as much about the first WW.  The story is fairly touching, and helps to highlight the brutality and cost of war. However, much of the message, as well as the game overall, is held back by inane game design and some situations that are there just to have some of the most contrived excuses to jam in a game.  The worst example I can think of is being conscripted by the German army, but you need to get your helmet, uniform, and equipment from the local army encampment. Only they won't actually give them to you. The soldiers and officers seem to do their utmost effort to prevent you from getting what they're demanding from you at the same time before they can send you to war. You're forced to do some bizzarre puzzle to figure out the combination to a door-safe to grab what you actually need.  If anything, Valiant Hearts is a good example of a game actually getting in the way of it really being great. Not because having a game is a bad idea, but just because it was so poorly executed.",
            "review_score": "-1"
        },
        {
            "review_text": "I have to give this game a negative reivew, based on my expectations of what I was getting going into the experience. My gripes stem from the fact that I found the narrative of the game to be one of its weakest aspects and some facets of the game to be a farcical deviation from the true nature of war, the exploration of which is something that this game advertises and uses to sell itself. I find the narrative especially disappointing considering the intensity of the hype surrounding this game's narrative from critics and users alike.   First, the fictitious aspects of the narrative that focus on the in-game characters suffer from some of the developer's design choices. Throughout the game, characters speak in muted volumes and the player isn't really privy to their speech and attitudes first-hand. This left me feeling like the characters themselves lack personality and are simply cardboard cut-outs onto which the narrator pastes a story. Nearly all of the character development in this game, something that I thought would be its strong-suit, is handled by the omniscient narrator, rather than the characters themselves. Again, this design choice leaves the characters a little bland, in my opinion.   To make the rather bland character development worse, I find it extremely disappointing how much content there is in this game that serves to remove the player from immersion. The bosses and puzzles in the game are the two of the worst offenders (see comments on silliness below). However, there are many others and by the time I got to the end of this game I was rather less invested in the story and characters than I thought I would be and I found myself fairly blase about their fate.   What I found most disappointing, however, was how the little bit of drama to be had in the story is ruined by the total silliness of much of the game. I was led to believe by nearly every article, interview, etc surrounding this game that it would be an honest look at the drama of WWI, the game's cartoonish art notwithstanding. Instead, the developers seemed to take many opportunities to undermine the seriousness of the subject they're covering. The shock and drama of families torn apart by war, death, and destruction is completely neutralized by Snidley Whiplash-esque villains, ridiculously out-of-place Rube Goldberg machines/puzzles in the middle of the gaming world, asininely stupid NPC's, main characters as soldiers that run around the front-lines of WWI w/ soup ladles and bare fists rather than rifles or pistols, and a hundred other silly breaks from the reality of the events of WWI. It isn't the fact that this game isn't 100% true to reality that bothers me; it's the fact that instead of adding to the drama of the story, many parts of the game detract from the drama b/c of their silliness.   All of this is capped by an ending that I won't spoil for anyone reading this, but I will content myself with saying that it is not true to the horror of WWI, as the scenario is presented in the game. At the last minute, the devs decide to pull their punches even more than in the rest of the game in order to provide a more palatable ending.",
            "review_score": "-1"
        },
        {
            "review_text": "Practically a non-game. The puzzles that are in this game are barely enough to slow down the progress you'll be making. I suppose it should be pretty plain that the story and look of the game are why you would buy this. Polished and short, I kinda liked this game, but I don't know if it will serve me any use to own a copy forever. Buy on sale or not at all.",
            "review_score": "-1"
        },
        {
            "review_text": "For a game which main plot is palced in one of the most documented event of our history (and which has way less controversy behind it) it somehow still required to go complete bullsh to make this plot doable. For my point of view its comlete disrespect to people who participated in that great war to make a game wich pretends to be historicly accurate when its not. It is so bad that i couldn't even finish because i couldn't stand it. Here are examples of my small gameplay time.  -German CAVALRY(his uniform) general in command of infantry regiment. -This exact General commands a Zeppelin which being an advanced german technology freely flying in deep of front lines avoiding all French Air forces. -During Game we see how our friends and just countrymans dying in front lines, civilian in bombardments, which still not enought for our protagonists to do smth harder to our foe than knock them off. Because the germans after waking up gonna be different people and wont shoot or wield arterly or machine guns at all, They will just flee home. -And last but not least, Back to historical innacuracy! I know you missed it. You remeber our fella General the Antogonist? So when you finally confort him, the CAVALRY General who basicly was in his Stealth Zepellin during whole conflict did not had neither his Revolver nor his Sabre. Just granades. You wanna know why? Because reasons offcourse. Because the person or people who called themselves a script writers DID NOT CARE about first world war nor you who bought this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Didnt realise you had to run Uplay to play 10/10 not making Uplay account not playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Did not even play the game yet.  Uplay sucks so much, I tried to login using an old account and was banned for 10min... Can't play the game I just paid for yet...",
            "review_score": "-1"
        },
        {
            "review_text": " Don't buy it until they fixed the keyboard bug (December 2014)!  Unless you have a gamepad, the game is unplayable. You cant use your keyboard as the game gets confused with other devices like joysticks etc.  It is a great idea but poorly coded and there is no action from Ubisoft to fix it as usual...",
            "review_score": "-1"
        },
        {
            "review_text": "I have to be honest on this one... Valiant Hearts was not what I thought it was going to be, and not in a good way. Critics seemed to make this game out to be some dark, emotional, and deep experience, when it is far from it. Being a history buff, I was very excited about this game and looking forward to what I heard from critics and the gaming community. Instead, I was dissapointed heavily.  Yes, the game mechanics are simplistic, but that's not what I have a problem with. If the story was as great as people said and what I was hoping for, it wouldn't have been a problem at all. Instead, the game is literally like an oversimplistic comic book for ten year olds. Imagine watching a movie like Saving Private Ryan where the main characters are chasing a bad guy who embodies every stereotype of a comic book villain. That's what you do in this game. The characters freely traverse the German/French front throughout the war, doing whatever they want, even though the majority are conscripted soldiers, and chase a literal comic book villain who flys around on a zeppelin that resembles something from a steampunk mag. It's not deep, it's not emotional, and it's not a realistic potrayal of war. It's childish.  This game had SO much potential, and it was wasted. Utterly wasted. The only interesting thing I could take away from it was all the interesting historical facts that are peppered throughout, and the collectible items you can acquire that give some background on every day soldier life in the time period.  If you're looking for a comic book from the 80's where a motley crew chases down an ultra bad guy with all the attached tropes and sterotypes that you could imagine, this one's for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Valient Hearts was an excellent game that I really did enjoy untill the worst could of happened. In the snow chase fight I had the unfortunate luck of running into a game breaking glich that prohibided me from continueing the game. The glich is that some of the rockets are not appeering(the music says they should be there) and the tank door is not opening. I really have been enjoying this game and really wish to continue playing it, but since this is a horrific game breaking bug I must rate poorly on this game. If anyone knows what I can do to make the game work again please message me on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ game and a complete waste of time.  No single minute was fun at all. Worst buy of all my 140 games.",
            "review_score": "-1"
        },
        {
            "review_text": "Valiant Hearts is an interesting puzzle game set against the backdrop of both sides in the First World War. While the concept is interesting and much history is provided regarding conditions, events, details and people in WW1; the game is sadly weighed down by its own gameplay.  Most of the cutscenes are not skippable, which would not be a problem except for Valiant Heart's various flaws and bugs due to the 'scripted' actions available with certain items. Solving puzzles in the 'wrong' order or picking up items at the wrong time requires that the player quit out of a level and lose all progress, in addition there are several moments in the game where re-usable/infinite amounts of items can actually cause problems for the game which once again results in 'road-blocks' to gameplay.  There are also small scrolling driving segments in the game set to various classical music pieces - These parts in particular stand out for their pacing and utter charm, requiring players to dodge obstacles in rhythm with the music. Overall this would be my biggest 'highlight' of the game.  In terms of replay value, you only have collectibles, and not the most interesting ones at that - Again, unless you are a fan of or take great interest in the events of WW1.  Overall I wouldn't recommend this game unless you can overlook the flawed gameplay and follow the charming visuals and relatively interesting story.",
            "review_score": "-1"
        },
        {
            "review_text": "My Great-Great-Uncle didn't die in World War One for Ubisoft to remake Call of Duty: Ghosts into a side scrolling puzzler.",
            "review_score": "-1"
        },
        {
            "review_text": "Ya. No.♥♥♥♥ this game. One ♥♥♥♥ing boss is ♥♥♥♥♥♥♥♥ as ♥♥♥♥. ♥♥♥♥ing hell.",
            "review_score": "-1"
        },
        {
            "review_text": "The simplest puzzles you could face and the game is all puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "At this point I cannot rtecomend this game. I had high hopes, But there seems to be at leats one killer bug that stope syou in your tracks (Anna not being able to pull the handle to get water). I've been trying to figure out hwo to deal with getting an answer from ubisoft about reporting the bug, but people are a lot quicker to take your money than to make sure the game actually works. And STEAM is of course no help either. The onlser I can come upw ith from a web board is to restart the entire game, but that means blowing all the time into it I have done.  Oh, and you'd think if they were going to make a WW1 game in France they would at least do some research about the war.  oh yeah, probably half opf the time spent playing was trying to figure out workarounds on the bug.",
            "review_score": "-1"
        },
        {
            "review_text": "The trailer was a sad and meaningfull one but I just dont find this game very fun, its just a puzzeler that its very not interesting.   4/10 Dont buy only if under 5$ on a sale",
            "review_score": "-1"
        },
        {
            "review_text": "It requires UBIsoft account, why i have steam, link it... I forgot my password and account name and the game has been suspended due to to many failed attempts.",
            "review_score": "-1"
        },
        {
            "review_text": "Every human on Earth that is old enough to grasp the concept of war, death, love and friendship, should play this game. A touching story that will remain with me forever. Absolutely brilliant. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game with a few minor mechanical issues.  The story telling and character development is first and forefront, with the sidescrolling, puzzle-sovling being secondary. I did not view this as a downside, but may be important to know what to expect before getting the game.  All the collectibles have a neat bit of history to be learned from them, but due to the simplicity of most just sitting on the ground, I tended to just spam the pickup button throughout the whole game.  The achivements are fair, and don't dictate how you should play the game.",
            "review_score": "1"
        },
        {
            "review_text": "Doubtlessly a masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game and music track. The game play was simple and it didn’t talk long to beat but the story kept me interested the whole time. The little history bits along the way were an added bonus. Was not ready for the ending.",
            "review_score": "1"
        },
        {
            "review_text": "I cried more then when I saw Red Dog  20/10",
            "review_score": "1"
        },
        {
            "review_text": "For those who like adventure, puzzle, history, and good narratives, I would highly recommend this one. Simply amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Superb game, had me hooked from the start. Simple yet addictive and educational too. A teacher friend of mine is hoping to use it in her primary school lessons!  Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "story is excellent, heart wrenching and sad, but the cute doggie made me smile couple times",
            "review_score": "1"
        },
        {
            "review_text": "BUY THIS GAME!!!!  But prepare to cry",
            "review_score": "1"
        },
        {
            "review_text": "Five stars...right in the feels.",
            "review_score": "1"
        },
        {
            "review_text": "I wholeheartedly reccommend Valiant Hearts to everyone. I'd go so far as to call it a very important game, as it is one of the most human, fair, and touching representations of World War 1. The art style is fantastic and the animations are endearing. The music is wonderful, and the gameplay is both intuitive and fairly challenging without being unfair. This game is about a different side of war. It's about the support roles. You spend more time helping your fellow human than you do hurting them in this game. The game also fairly portrays both sides of the war and scrutinizes both of them. I feel that all sides involved are lovingly stereotyped in a way that is more comical than insulting. You'll see Frenchman guzzling wine, surrounded by bread and cheese, as well as Germans wolfing down sausage and chugging beer, As someone of German descent, I found the stereotypes to be comical rather than offensive. The comedy of the game is very often in stark contrast to it's sadness and portrayal of human attrocities. I found that the game managed to convey emotion very effectively through this dichotomy. The endearing and comical parts truelly give credence the bleak and horrific parts and vice versa due to the sudden shifts between the two. Overall, this is a very human and different depiction of war that happens to be a fantastic game as well. I highly reccommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how to say, how much I loved this game.",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought that this game wouldn't really appeal to me but I figured I'd give it a bash in any case. I'm glad I did.",
            "review_score": "1"
        },
        {
            "review_text": "Where to start...  There's so many things this game did right. From thoughtful puzzles that actually bring satisfaction upon being solved rather than frustrate, to the tasteful music choices, to the drawn art of the game itself that is truly unique in the sidescroller genre.  Best of all, this game will teach you a thing or two about history with it's interesting facts and items that make the great war relatable to a modern audience. So many people shove the history of the first world war under the rug, and I for one appreciate how well this game did every effort to make you understand just how brutal or horrific this era of war was.  The story is emotional but could be better, but that doesn't mean you shouldn't buy this game.. worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft Montpelier have done something surprising with WW1 in this game -- they made it both a learning experience and a heartfelt story wrapped around a series of interesting challenges in one place. One of the most terrible periods in human history is treated with both respect for those that fought while telling its own story of bravery and heroism.  The game is saturated with historical factoids about the 'Great War' ranging from a brief look at how armies were organized to the muddy misery of trench warfare and the dietary staples of the common soldier out in the field. These are written in easily digestable form so you won't feel as if you're going to be quizzed at the end of the game and often don't pull any punches when it comes to revealing the horrors facing these soldiers day-in and day-out. You can read them at your own pace if you don't want to call them up while treating the wounded or dodging field artillery shells during play, too, and they also feature actual pictures to drawings of artifacts from the period.  Story-wise, the game revolves around four different people, each of whom have had their lives turned upside down by the war. Karl, a young man of German descent, is forced to leave his farm and his wife in France when the country decides to deport all German citizens in anticipation of hostilities with Germany. His father-in-law, Emile, is drafted into the French army. Freddie is an American who has joined the French army and is on his own personal quest for revenge. And then there's Anna, a veterinarian turned field doctor who is also on her own quest to find her father. And even though she isn't a character in the game, Karl's French wife, Marie, from whom he was taken from is also present in the game. All of them also share their experiences via diary entries that you can read at your leisure adding quite a bit to the atmosphere of how their lives all tie in together and the cameraderie that they share as friends and family.  The only one that doesn't have his own diary is Walt, a medic doberman dog that eventually befriends the characters and helps the player solve various puzzles in the game from flipping levers to grabbing hard-to-get items. He's a great lifesaver pulling more than his fair share of work with the player's help. And yes, you can pet him, too.  As for the actual game, it's a mix of puzzle solving and action sequences such as driving along to a choreographed obstacle course. The story bounces between the characters with puzzles centerd on their specific skills. Emile is great at digging and can tunnel his way on through to other areas when he can. Freddie can cut wire with his pliers and is generally a tough guy with a heart of gold. Anna is often called on to heal the injured by following along in a rhythm-based sequence. Also, don't let the cartoony graphics fool you -- the game doesn't sugar coat the horrors of war such as when Anna is asked to saw someone's arm off in a field hospital and you need to match the sequence to do it. Many of the puzzles often involve finding the right items to get something done, such as convincing soldiers to let you pass on through so that you can get inside a building and find another item that you need.  The actual puzzle solving isn't quite as exciting as the story, though, since it can sometimes feel as if you're going through a laundry list of things that you know you need to do anyway, but the presentation and the emotions that the game wants to bring out of you during the course of the game make up for that in spades. The music also provides a great backdrop and most of the characters only speak in brief grunts and ahhs with a few short lines to emphasize certain things, but it all works. The first thing I thought of was that it was kidn of like Scribblenauts only with a few voiced lines.  As for the actual length of the game, your mileage may vary, but it tooke me around 8 or so hours to get through. Once it's done, though, there's no reason to go back through unless you've missed a collectable somewhere or just want to experience the story again. Unfortunately, replaying a previous chapter will overwrite the only checkpoint the game uses to track your progress, so be careful about going back.  A surprising take on WW1 that no one else has really tried and a genuinely intriguing game. If you're interested in the history, a good story, and don't mind solving a few puzzles along the way, Valiant Hearts manages to merge it all into a remarkable time.   Just don't forget the tissues. You might need them.",
            "review_score": "1"
        },
        {
            "review_text": "It's not often that you get a game that actually pulls you in emotionally to this level.  Gameplay is simple and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Spoiler alert   I tried of sergeant who always pushing me to the front line. After that, I turned around looking at his eyes. When I walked closer to him, He killed me everytime.   Finally I got a chance to hit his head with my shovel!. I have no regreat. 11/10 would hit him again.   ♥♥♥♥ the war",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best game about the horrors of war ever made. The ending left me speechless and in tears. ",
            "review_score": "1"
        },
        {
            "review_text": "Where to start? This game is honestly really hard to sum up. It's engaging and immersive for a simple side scroller. But for some reason its simplicity is elegant. The art style is truely depictive. Its not a game of the normal mindset. In fact, it's a game based on the untold story. If you're not the type of gamer to enjoy a game that's more than a shooter with a deep heartfelt story. I will be honest and tell you to walk away from this game and don't look back because this game is exactly a puzzle solving heartfelt driven story. If you know and understand there is more to gaming than running around and shooting virtual dudes you will enjoy this game.  I will admit the soundtrack is amazing. It captures each moment in a way that gaming just seems to have lost.  The gameplay is puzzle solving with a timing aspect. If you're not the best at solving puzzles this game does offer 3 hints for each puzzle. At times it's simply trial and error.  Without spoiling the game, the story is from the 'What's going over there?' setting. The homefront wonders how the frontline is and vice versa. There are 5 Chapters to the game. Overall, you can beat this game in one sitting, but it's quite enjoyable. This game is a bit of a tear jerker. Even for a more hardened individual, it may or may not make you cry. But regardless of your emotional stature, you'll wonder who left that bowl of feels right there.  Just a heads up. If you have a dog. You'll love that furry K-9 even more at the end of the game. ",
            "review_score": "1"
        },
        {
            "review_text": "Thumb Up !",
            "review_score": "1"
        },
        {
            "review_text": "Best game i have played, the gameplay itself is amazing, and the soundtrack, the story is amazing, i love so mutch this game.  Thanks to the author its open my eyes :).  You Must buy this game it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful Game. You will cry.",
            "review_score": "1"
        },
        {
            "review_text": "By far, one of the most emotional war games I've ever played. This game shows another side of war that no other war game does. Instead of putting players in the role of a war hero, the player plays as a group of individuals who are get caught up in a war they never wanted and are brought together by fate. Not every character is a soldier but all have their own personal reasons for being involved in the war. The events that unfold appear to be plausible adding to the depth of the game, and creating a wonderfully thought out story. The 2D cartoon style is very simplistic but does not take away from the gameplay. I don't regret buying this when it was on sale. I hope to find and play more games like this soon.",
            "review_score": "1"
        },
        {
            "review_text": "Looked like a extremely good game but the only problem is when opening it it did the first thing it should when that was done it infact did not open i have looked on steam forums i did what people said to fix it, and poof it still doesnt work, i highly assume its uplay, or the game in general because i was hoping to be able to play a new game i bought(i checked the specs and it should be able to run perfectly fine) but instead all i got was the feeling of being ripped off and feeling like having this game bought was a total waste of money.",
            "review_score": "1"
        },
        {
            "review_text": "I am not good at showing emotions like happyness, joy or sorrow. Nor am I good at hiding them. this game truly made me feel and show all the emotions I had. The joy and fun of the small jokes in the game, confusion of historically incorrect uniforms at some points in the game, anger about how they steriotyped the germans in this game but the feeling that I felt the most and what I truly felt all the way was sorrow and compassion.  I litterly cried when I saw the ending. I was so sad of what happened and I felt so much sorrow of all those men that accually had to live trough the hell known today as ww1.  +10 million people died and about 80% of all the people returning from the front where missing limps, parts of their face or had mental issues like shellshock.  Although this game doesnt really care to much about portraying the events as what they accually where. the facts they added to this game are all true. keep that in mind as you read them troughout the game...  100 years on. we shall never forget...   10/10. one of the best games I ever played in my life.",
            "review_score": "1"
        },
        {
            "review_text": "Whimsical yet sad retelling of WWI with emphasis on gameplay over realism. Puzzles are pretty straightforward but manage to have enough variation so that the game doesn't get boring.   HonHonHon",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, tasteful game about the heroism and horrors of World War I. Beautifully done. I hvae nothing negative to say about this game",
            "review_score": "1"
        },
        {
            "review_text": "Very beautiful game with magnificent art and music. An emotional journey with one of the best endings I have ever experienced in video games.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good",
            "review_score": "1"
        },
        {
            "review_text": "'Proud to say, I cried at the end'",
            "review_score": "1"
        },
        {
            "review_text": "This. Was. Heart warming, the wonderful story, and it really made me feel sad inside during certain parts of the game, This is coming from someone who isn't easily affected by emotional stuff. This game also captured the essence war. Compared to call of duty, and other war games, this game is where you could truly feel like your on the battlefield, and you don't even do shooting stuff in this game! I recommend this if you want good puzzles, and a spectacular story.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely stunning and athmospherical game with historical facts about WWI. It takes the player through a beautiful 2D adventure and into 5 different stories of war fates that are intertwined. The different perspectives of countries, people and also the animals in the war takes the player right into the historical setting and gives you the feeling that nothing is right or wrong, good or bad. It is moving to the very and where I sat crying.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the story, and I have to say... awesome. The game itself isn't challenging, and the puzzles aren't going to keep you up all night to figure out. However, I feel that the relatively simple gameplay speaks to what I feel is the purpose of this game: to commemorate the centennial of the first world war through a thoughtful story that is digestible to a wide audience. I have so much to say about his game, but I think you should just play it!",
            "review_score": "1"
        },
        {
            "review_text": "The story, characters, animation, gameplay, most of all soundtrack, and narration is really good. Would deeply recommend when it goes on sale. I personally loved it deeply.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great really addictng but uplay sucks",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most interesting war game I've seen. It's completely not what I've expected. A puzzle/adventure, were you spectate and play the lives of 3 soldiers. Heart breaking and sad, but cool and badass!  I think 2d goes really well with this game. Even though it is cartoonish and looks very childish, you'll never even realize it after you start playing  10/10  Would play again if they made one for WWII",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts: The great war.  Gameplay:  The gameplay of Valiant Hearts is quite interesting. During the years I've spent on this planet, I've never seen something quite like it. You get dragged into a very dark and sad atmosphere, while you spend countless hours attemting to get behind enemy lines. It's easy to get stuck in some parts of the game, but in case of distress, you have the hints that can actually help more than you think, without actually revealing the gameplay. The game also has a slight sense of humour. Exaggurating sergants shouting so loud you can even see their spit is like a spark. It makes you a little bit happier to see how ♥♥♥♥♥♥ off they are, taking the game less seriously before more action begins. The German soldiers are also somewhat amusing as well, much like most of the other NPCs in the game. Everyone is based off of stereotypical traits, but not in a discrimitative way.   Story:  The characters in this game are people you get emotionally attached to, especially in the relation between Emile and Carl.  The story is touching, and it makes one actually realize how ♥♥♥♥ed up the first world war actually was. Due to these characters, you actually WANT to spend your time playing this game. No doubt. It's one of the few games that are worth its price.  What I personally do not like:  U-Play. Simple as that. If the game is on steam, I would like to use it on my account here and not sync with some ♥♥♥♥♥♥♥t game cloud system that I don't like. Making a seperate account that I will in my life, never use except for this game.   Cutscenes. The cutscenes in the game are actually not too bad, but the texture is what annoys me. Seeing halways pixelated characters in cutscenes is really a cockblock to emotions imo. The fact it's there is not much a problem, but the fact that ubisoft didn't fix this by making the textures bigger or use vector is what annoys me. Not all of the cutscenes have this problem, but even if it does so happen that the characters in the cutscenes are kind of pixelated, it doesn't actually mind me that much. I just write this in case someone will get ♥♥♥♥♥♥ off in case they see a pixel and it's a big problem for them.  In all, it's actually a good game. I don't want to sit here like a ♥♥♥♥ and act as if I would not buy a game because of the graphics. Best 15 euros you will ever spend. ",
            "review_score": "1"
        },
        {
            "review_text": "the puzzles and gameplay is ok. Nothing special, but if you can look past that (and Uplay) it has a fantastic history to tell, and the soundtracks is just beautiful.  oh, and get a bucket...  ",
            "review_score": "1"
        },
        {
            "review_text": "The most awesome game about war I've ever seen. Just buy it. Ubisoft made very good game. And here you can WATCH DOG!",
            "review_score": "1"
        },
        {
            "review_text": "A fun, classic adventure game with a non-intrusive educational aspect. Also a premium-level feel trip at the end.",
            "review_score": "1"
        },
        {
            "review_text": "im not gonna lie, im about 16, and this made me cry. if u dont wanna cry, dont get the game. the story was good and the characters are well developed (except for freddie). although if u enjoy history and a good story-telling, its worth the $15",
            "review_score": "1"
        },
        {
            "review_text": "Truth be told, this game isn't as good as I expected -- but that's because I expected it to be overwhelmingly excellent, when it is in fact just very, very good.  My main objection would be that the overall tone -- which is solemn, moving and quite dark -- is constantly marred by a weird tendency towards cartoonishness, and not in a good way, but rather a jarring way that seems at odds with the story. The Germans, especially the 'big bad' of the game, is portrayed as an over-the-top buffoon, and the technology that should be truly terrifying -- artillery, chlorine gas, tanks -- is instead very steampunkish and silly-looking a lot of the time.  Nevertheless, overall it works, and is an excellent adventure game even if it's not *quite* the total masterpiece of a WW1 tale that it wants to be (though it reaches that height on a few occasions).",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, you can really empathize with the characters and the dog, omg the dog. I can truly recommend this game for someone looking for something new, someone who likes to pay attention to the stories and the plots of the games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing. It has everything a perfect game needs. Fun characters, captivating storyline, and of course, an amazing setting. When I first saw this game, I knew what I was going to get would be good. But damn, I didn't expect it to be THAT good! I was expecting about 30 minutes of gameplay, since most games with 'compelling' stories are extremely short. No, this game lasted me a good eight hours! It wasn't drawn-out or anything; every single minute of those eight hours was spent on a piece of an amazing story that I absolutely loved. The only problem I had with the game was those 'rhythm' parts. At times, they could almost induce quite a rage. But in the end it was definitely worth it. Of course, the fact that it uses Uplay may seriously affect others, but I highly suggest you overlook that, and just buy it! I have said it before, and I will say it again; this game simply has an amazing story! It's nothing short of a masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "Except this game can't 'live' without uplay, everything else is perfect... A touching game, nice story, beautiful music, you live to know how rude the war is...",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best stories in a game I have ever seen, Valiant Hearts is simply beautiful. The characters and backgrounds are amazingly rendered and provide a great atmosphere to the game. The only real downside is it makes you use Uplay, but other than that, I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "For what it lacks in dialogue, it more than makes up for it in very powerful imagery. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely gorgeous gameplay and atmosphere! the music fits in nicely and adds ambience to the story. Well worth its 14.99!",
            "review_score": "1"
        },
        {
            "review_text": "valiant heart the great war made me cry 10/10 this was a great game it almost fealt like it was based off a true story",
            "review_score": "1"
        },
        {
            "review_text": "loved the Game , great story and fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Prepare for manly tears T.T  the game is absoutely beautiful , the music score is perfect, the art style just goes perfectly. it rarely bugs for me execept for this one time towards the end. the only this is just uplay... though i will just bear it, only for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts - The Great War is beautifully sweet and charming. You will find youself laughing and crying at the sametime; all while gaining a better understanding of the human suffing on a personal level that war brings.  It is a puzzle style game with a unique art style. I really hope that this is the start of a series of games!",
            "review_score": "1"
        },
        {
            "review_text": "I have no words for how emotionally powerful this game is.   If you like a good story backed up by solid (but not rediculously hard) puzzles and a catchy asthetic, then pick it up without hesitation. It may be a little short, but it's not a game you will forget easily.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even care for side scrollers, but this had me hooked from the start! If you like deep emotional story telling, with action and puzzles, than this game is for you. It leaves you immersed with rich, factual history. Game play is enjoyable, and the soundtrack fits every moment. The only time it feels corny is during some of the chase scenes. It's really refreshing to see developers that put real effort into story telling.   Final score: 9/10 Amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!... (UPlay should go away)",
            "review_score": "1"
        },
        {
            "review_text": "What a game. Utterly charming, relentlessly moving. Very few games are able to pack so much emotion, all across the spectrum, into five hours. I simply can't say the right words to do this game justice.   Just buy it. Buy it, play it in one sitting, and let the emotion sweep over you.",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzles. Good story. Amazing art and visuals.",
            "review_score": "1"
        },
        {
            "review_text": "'I cried like a real man'",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you feel feelings. I consider that a good thing, And hey learn a thing or two about the other World War that doesnt get talked about as much.",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you smile, this game will make you cry. The range of emotions you can go through with this game is quite astounding. It has a similar feel to Telltale games in the sense where you participate in a narrative.   It is definitely worth playing this in one sit-through for the sake of immersion.   Well worth the money even when not on sale.  A must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderfully written, beautifully directed, superb music and a gorgeous art style. A short but worthwhile experience, much like this review.",
            "review_score": "1"
        },
        {
            "review_text": "What kind of game is it: - Valiant Hearts follows intersection stories of four characters during Germany’s invasion of France during World War I.  Story synopsis: Very similar to a point-and-click adventure, but you have direct control over the characters.  What's good about the game: -Most puzzles are fun and an appropriate level of challenging.  -Story and character development very deep. -Variety of game play throughout, ranging from standard, Monkey Island like, puzzles to rhythm game mechanics. -The soundtrack is great and particularly fun during the taxi’s get away stages. -Dying puts you back very close to where you left off. Cuts down on the challenge a bit, but would have been far too tedious if you had to start a whole stage over again.  What's novel about the game: -The integration of educational material into the game was superb.  -Incredible blend of drama into a historically accurate stage; Band of Brother quality entertainment.  What's bad about the game: -Minor nit picking: the nurse’s mini-game could drag on for too long sometimes. -Some puzzles are tedious, requiring lots of time just running back and forth, but only a few -I lost interest in the diary entries very quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphics and drawing. Beautifully made. Worth. Every. Penny.",
            "review_score": "1"
        },
        {
            "review_text": "Great storyline, comely graphics, especially beautiful music and of course it's fun to play. Play and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this 5 minutes ago, and I've spent every one of those minutes trying to compose myself.  You grow more and more attached to the characters over the time you spend playing them. All the time, things seem to get worse and worse for them. The game drags you through grittier, and more war-torn places as it goes on, to give you a sense of how things progressively deteriorated throughout this 'Great War'.  The ending made me weep. I was tearing up for a few moments before it came to an end, but the last speech pushed me over the edge and I started to cry. I've only just stopped really, whilst writing this review.  A truly brilliant title. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": " Valiant Hearts: The Great War",
            "review_score": "1"
        },
        {
            "review_text": "Loved it, Very entertaining if a little easy. :)",
            "review_score": "1"
        },
        {
            "review_text": "i finished watching the credits with tears",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game so far , but this ubisoft Uplay thing is required and has caused me some issues . Great game but Uplay bulshit ruins it a fair bit . Only get this game if you REALLY want it ... cause getting uplay ♥♥♥♥♥♥♥t installed aint worth it .",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. It has a payload far greater than the gameplay itself, and it delivers.",
            "review_score": "1"
        },
        {
            "review_text": "It's a sad game, and by end, a brutal as well. The puzzles are slightly repetitive at times, but overall a great game. Although I didn't sit down and beat it one sitting, I highly suggest you do. It's a short 5-7 hour game, and it's one hell of a roller coaster.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "I had never heard of the game before but I bought it for less tha 5 € on Steam. Oh boy was it the deal of the year ! This is a 2D platform game. This is a story driven game that will make you attached to the main characters from minute 1 of the game ! 4 stories, 4 heroes, 4 destinies meeting during the First World War. The graphism are great especialy if you like the comic strip style. The puzzles are not too difficult but you'll sometimes find yourself wondering what to do. The collectibles along the way are a good idea as the bring an historical value. You'll want to collect the objects and read the history behind them.  The story it self, i will not spoil but it will hit you right in the feels.   If you liked Deadlight, you will love this game.  Great game to have in your library ! 10/10 will wait for the next one !",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "What a great game! I'd fancied this for a while and as it came up in the Ubisoft sale I thought I'd get it. Glad I did. The graphics speak for themselves, some brilliantly drawn scenery and great cartoon style animation make this a superb looking game. Sound is great too, with some excellent use of music, and general 'mumbles' from the characters, rather than real speech. There is speech in the game, with a narrator keeping you informed of what's going on in the war and to other characters as you play.  You play as one of four characters, each effected by the war (WWI) and linked together in some way. Gameplay has you solving mini puzzles, thrown in with small arcade sections. The puzzles are not too taxing, just enough to make you stop and think for a minute, before you move on. The flow of the game is really well thought out.  If you can get this on the cheap, do it. It might not be your usual kind of game, but it'll drag you in from the start.   Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly well done game. The pacing, the story, the emotions, just really very good. I'm not sure I've ever played a game that moved me as much as this one did. Definitely worth playing",
            "review_score": "1"
        },
        {
            "review_text": "Europians yelling at a dog in funny accents for 8 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Best game i have ever played. I had tears at the end of the game.The puzzles were amazing the storyline was great. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved the items and history tidbits throughout the game, they make it feel like a museum-within-a-game without being boring. Add to that a solid story, great soundtrack, and engaging characters and you've got a fantastic game. Oh, and prepare for a trip to Feelsville at the end.",
            "review_score": "1"
        },
        {
            "review_text": "i dont get it, if the war was so great y did video games forget it? best ♥♥♥♥n game ever",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game all around. 10/10 would cry again",
            "review_score": "1"
        },
        {
            "review_text": "The feels.",
            "review_score": "1"
        },
        {
            "review_text": "Such a fantastic game overall, fantastic puzzles, fantastic soundtrack, fantastic art style. Everything is great, please buy this game",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Should be played in every school!  +Nice graphics +Great atmosphere +great details  +alot of background info about the real history +Insanly good Sound Design +Good price -Sometimes bad controlls -U need Uplay, wich is actually a pretty slow/ugly  There is nothing more to say. Just insanly good.",
            "review_score": "1"
        },
        {
            "review_text": "Good story, great atmosphere and sound design. Nothing motivates you to solve a puzzle like playing as a battlefield nurse and hearing the constant sounds of wounded soldiers crying out for your aid.  I will say that the story was hampered by the main protagonist. From the game's outset, it appeared that the developers were telling a story in which the main villain was the environment (war) itself. That it was a sad and tragic time in our history, but when they introduce us to a cartoonish military leader, it really undercut what was happening in the game.  Basically, I would play sections as these various characters as they work together and overcome the day-to-day struggles that became common in the chaotic hell that is warfare. As a player I would feel closer to these characters right up to the point that the main villain came back and spoiled everything. I didn't need a game-world manifestation of evil when my characters are living it in every sequence of the game.  Still, this is still an excellent game, falling just short of great.",
            "review_score": "1"
        },
        {
            "review_text": "By far the greatest game I have ever played. If you're not shedding a tear of frustration or sadness, you're being enthralled by the amazing story, or being immersed by the beautiful music. I give this game the utmost respect and suggest you play this amazing masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "To much feeling :,( .Best game.",
            "review_score": "1"
        },
        {
            "review_text": "Wow what can I say about this game accept pure genius wow it packs a punch thats for sure detail and graphics are amazing the story will hit your heart and make you want to continue on to the end. Fun and challeging puzzles and runs perfect on my PC I recommend this game to all who love adventure and a ground breaking story within a game its on sale now I just picked it up for $3.00 on sale from the original price of $15 and I would have paid the full price and some without a doubt great game just buy it you wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "The Gameplay In This Game Might Not Be Like In Most War Games But The Story And History Behind This Game Is So Amazing That It Leaves You Mouth Open At Every Cutscene Untill The End Of The Game",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant story driven game with mild puzzles thrown in the mix. If you are a hard core puzzle loving gamer, probably give this a skip. However, if you enjoy good (albeit sad) story, this will be right up your alley.  Beautiful game, highly recommend.  I hope success of this game has showed Ubisoft that maybe you can focus on one AAA game a year and release more of these gems alongside.  Great experience",
            "review_score": "1"
        },
        {
            "review_text": "This game Requires UPLAY from UbiShit. What you buy on steam is just a game key. This needs to be more clearly identified. Great game, get a key on sale from steam. But realise that it is not a steam game. Thumbs down for the big red attention grabber.",
            "review_score": "-1"
        },
        {
            "review_text": "Literally the only game that I can fully remember. It's a little short, but it's worth every single second you put into this game. The only game that I have cried about, the ending is the saddest thing I've ever seen. No ending can ever beat this game.",
            "review_score": "1"
        },
        {
            "review_text": "Deep, give you the feels. In my top ten favorite games. Amazing game in genral 11/10-Jacket 12/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Wont let me log in. It gives me the key code. I press play and nothing happens.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 .. would learn history and cry again.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth $25, but for $5/10 I would definitely recommend it.  One play through is enough. There are ~6 items to collect per scene but are not required, so for completionists there is room for a second playthrough.  Around 6 hours gameplay for a single play through.",
            "review_score": "1"
        },
        {
            "review_text": "Tears. I haven't had a reason to cry in nearly a decade, but when i do it's because i can't supress it any longer. Don't get me wrong, this game is entertaining.  The puzzles are by no means insurmountable but still offer a good challenge. What makes this game stand out from every other puzzle game is the fact that you can't escape the setting: The war. Or it might be more correct to say that the war is the centerpiece and the puzzles serve as more of a distraction. Everything you do and every character you meet has something to do with the ongoing conflict. What little joy you find in the characters small victories is often as short lived for you as it is for the characters you play as.  With that said, you will find moments in Valiant Hearts that you can't help but remember fondly. You will find yourself with a (hopefully) better understanding of the horrors of war. But above all when you reach the end of Valiant Hearts, don't be surprised if you find yourself crying. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful on so many levels. The art, the story, the music, the history, and the emotions all make this game perfect.",
            "review_score": "1"
        },
        {
            "review_text": "This game should be educational material, on its merits of delivering a personal story while illustrating the horror that is war, along with providing a good amount of historical evidence. Can't get any better than this. Wholeheartedly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A sad story about four people living in 1914 who were forced into the war. It truly shows the devastation that is war and shows all the immoralities that come with it. Putting father against son in certain situations this game has an amazing story and beautiful art style. Although it is short the puzzles are quite interesting if not exactly hard and it has great replay value thanks to the collectibles",
            "review_score": "1"
        },
        {
            "review_text": "Love the history and story elements of this title, but the puzzles eventually feel too repetitive for me. I still want to finish it to see the rest of the content, but not enjoying the 'gameplay' any more. Maybe it will be better for you.",
            "review_score": "1"
        },
        {
            "review_text": "Like many others I really wanted to like this game: there's nice music, pretty, cartoonish graphics, information about WWI...I mean what's not to like?  Uhmm...the story maybe? This game tries too hard to make you cry, I mean really, really hard, like chopping onions in your face, pulling your fingernails hard and, call me stonehearted, but it fails miserably.  It's a tale of four war heroes (victims ?) whose stories intertwine and use up all the cliches in the book from orphaned children to hurting puppies. But even without the cheesy storytelling there's also: - mediocre at best puzzles (with a lot of running to-and-fro because you need object A that exchanges for object B that you get for object C) - the underwhelming level design that basically has you do the same missions three times over with slightly different settings (if I suck at the fist race level, I'm probably not going to improve by the second one 2 hours from now where the sole difference is the colour of the sky) - little to no background on the characters so you don't really get to build a relationship before the game puts them in seemingly impossible situations. (I mean, how am I going to shed a tear for *insert character name here* if all I know about him is that he can walk, run and sometimes change his clothes?) - I'm not one to say no to the ocasional deus-ex-machina, but this game makes a religion out of the technique. You build suspense by getting above mentioned character in said impossible situation that you can't see a way out of. Poof! Out of the blue the skies clear, they're saved and all is well again. By the look of this, you'd be surprised how so many people mananged to die during the WW - if your OCD compels you to collect all the items, you're most likely going to have a bad time what with them being hidden behind bushes and walls (that you obviously can't see behind), and blending so well with the scenery you'll start thinking maybe the game's glitching since you can't pick up more stuff - it's not that I mind having to go through Uplay to launch the game (too much), but does it really have to take 4 minutes on the clock between it registering that I've launched the game and actually launching it? *** On the whole, I'd just head for the Wikipaedia page, read up on the WWI and save the money. Or maybe I'd buy if for a kid who's into war and stuff and likes comics and is just starting out in the puzzle solving bussiness. Yeah, maybe I'll do that.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic music, beautiful art and a very touch story about the horror of war and the valiant heart of men.  ",
            "review_score": "1"
        },
        {
            "review_text": "I've read the reviews, many of which are positive little negativity at all. I followed some instructions to buy the game, play through the end, and cry. I told myself I wouldn't cry, but oh my gwad I surely did. So many tears, the music was beautiful, the narrator's voice was perfectly set. The historic background made me pick up a damn war history book again, and thus I cried again.   'War makes men mad' - Emile",
            "review_score": "1"
        },
        {
            "review_text": "So far I haven't played the whole game through but the parts I have played through so far has been amazing. The characters, the history and the gameplay makes this into being one of the most fun and enjoyable experience of all. I am a person who enjoys compelling story, gameplay and characters and I can say I found all that in this game.   I can recommend this for those of you who enjoy a bit of a puzzle gameplay, its not hard or unforgivningly hard but rather just use your eyes and mind and you will advance without a problem.  For those of us who love a great story I will recommend this game for you. Besides handling charaters background and history good the setting in The Great War (the war to end all wars) is absolutly splendid. I found myself encrossing in a lot of history from different country during the WW1 and I just can't help but wonder why I never found out about these facts during my school years. I would say for those of you interested in viewing WW1 in a different light you may want to give this game a chance.   Overall I'm in enjoying this game immensily and I will continue to play this game as soon as I am given more time in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, incredible story, beautiful animations, and a lesson in history all should take. A must-have.",
            "review_score": "1"
        },
        {
            "review_text": "Most of the puzzles are easy if a bit tricky and some need timing or great aim. Few got me stumped and asking, 'Okay what now?!' because sometimes, it isn't really obvious until someone (ahem walktrhoughs ahem) point out what you gotta do for that scene.  Also, Walt is the best. But beware of onion ninjas. Damn onion ninjas.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i have ever played. Its super emotional and exciting at the same time.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've never had the opportunity to play a true WWI game until Verdun. I've always been a fan of war history, and wow have there been plenty of WWII games out there.  From the part I played, I suspect this to be a moving and involving story. I very much appreciate the historical facts on battles, tactics, and such to suppliment the story.  The story I don't know much about - but war does terrible things to good people. I'll have to update this review when I've played more. I can't think of how this game could not get a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "So I know that a majority of the reviews are talking about how you will cry. And in all reality, you will. I know I did. But there's more to this game than tears and sadness. There are uplifting moments to mirror the ones that knock you down. Yet still there is more than that.  Pros: -Visuals: This game is simply a joy to look at. -Music: Personally this game has one of my top 5 favorite music scores. -Story: Really captivating, I had a hard time not finishing in one play through. -History: I enjoyed the little snipets of history this game provides.  Cons: -Freddie needed more of a resolution for me.  If you think you might like the style of art in the game, think the music is good, or simply want to feel some emotions, I wouldn't hestitate to make a purchase. You won't have any regrets.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is awesome! buy it!",
            "review_score": "1"
        },
        {
            "review_text": "the first game to get me to almost cry for some strange reason hahaha   10/10 well worth a cost + great animations/drawings",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting departure for a major game publisher. It is part game, part meditation on the nature of war. It breaks you out of your everyday, consumer/worker bee mindset for a moment, and reminds you of the full extent of the forms reality can take. The fact that a generation of people had to face this is so easy to forget in modern times.  Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games I ever played. It may not have the best gameplay or the hardest puzzles, but it has an excellent artstyle and a tearjerking story.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game, Cried like a ♥♥♥♥♥. Will do again at some point.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Good job.",
            "review_score": "1"
        },
        {
            "review_text": "Nearly done this game, have enjoyed its adventure style of game play that has authentic elements for those that are looking for infotainment. Great art style and is respectful of its content.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game, worth every peny",
            "review_score": "1"
        },
        {
            "review_text": "Great game, a lovely design with fun and engaging puzzles. just buy it already",
            "review_score": "1"
        },
        {
            "review_text": "Do I recommend this game? Since Steam pushes me into a binary yes/no system, I have to go with Yes. It's a game worth playing, a game I'm glad exists, and a game that's worth it's low price point.  Follow-up question, is the game any good? Well, yes AND no. The art design is terrific. It moves briskly; I breezed through it in three days. The subject matter is commendable, as World War I is so often overshadowed, not just in games, but movies, books, etc., by its bigger and less morally ambiguous sequel. It also presents the war primarly from a French perspective (hi Ubisoft!), through there are also American and German playable characters. Valiant Hearts also might be the least violent war game I've ever played, as the gameplay primarily involves things like pulling fellow soldiers to safety, escaping a POW camp, avoiding shells and mustard gas, and a reoccuring emergency medicine rhythm game. Sure, you blow some stuff up too, but that's mostly just the gung-ho American character Freddie, and even then the focus is mostly on protecting other soldiers. The history is well-researched and well-presented, so the game feels educational without feeling like an exercise in unending dispair.  But a little more despair would probably strength the game's emotional impact. At its worst, it becomes an outright cartoon, for no real reason other than to tack on some cliche game-y elements. I can't get fully invested in the horrors of war when I'm also chucking sticks of dynamite at the evil German Baron's steampunk war machine like I'm Wile E. Coyote. I'm not opposed to ridiculousness, but pairing it with intense human drama requires a good sense of the way a story should flow. Valiant Hearts has no flow. It only considers chronology when deciding which setpiece to tackle next. They could have gone for escalation, they could have gone for endless drudgery, instead every new scene feels completely random and disjointed from a character point of view. I ultimately had a hard time connecting with any of the characters, even as the inevitable tragedy starts to play out. Weirdly, I wished there was LESS gameplay, because it felt so detached from the story.  A good effort and still worth your time if you think you might be interested, but not a must play by any means.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, with a beautiful story. Get ready for a roller-coaster ride of joy and sadness, shockers and celebrations, and eyes full of tears. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well.....damn. Just finished it. Just fantastic, start to finish. Hard pressed to think of a better story in a game, anywhere. Kinda speechless at the end.  Just....damn.",
            "review_score": "1"
        },
        {
            "review_text": "Them feels :(",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a lot of emotions and history.  definitely worth the money, even if it is on Uplay.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful art, interesting WWI facts and amazing story. ",
            "review_score": "1"
        },
        {
            "review_text": "I can't put into words how much of a masterpiece this game truely is. I've spent quite a while playing games and this has been by far the most memorable of ones I have had the privilage to enjoy. Without any doubt I highly recommend giving this one a go.  Story was most assuradely 10 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "This, Is one of the best games Ubisoft made, and the best game I've purchased so far. The amount of feelings I have experienced while playing Valiant Hearts is above any limits. I am a grown man, and this is the only game that made me cry... It is worth all the money it costs, and if are hesitating either to buy this game or wait for a sale, unless you're completely broke, buy this game right now. The story line is very realistic, and you learn a lot of historical facts while playing, but that's not new for Ubisoft. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "great puzzle game and was a wonderfull storyline",
            "review_score": "1"
        },
        {
            "review_text": "great story ! got the game for 3 bucks, well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "'Thoroughly powerful and moving' falls flat in the name of this game. At its end, however, that is all I can come up with. Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very good story. The mechanisms are net and clever. The gameplay is very enjoyable. This game is kind of a big puzzle but within war context. It has historical data which make it even more real.  Overall, for its cost, it's a great game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Fantasic. Really well executed. Made me laugh, made me cry - can't recommend this enough!",
            "review_score": "1"
        },
        {
            "review_text": "Great game about the great war.",
            "review_score": "1"
        },
        {
            "review_text": "Exceptional game. Wonderfull story telling, and music come together to create a story you can get lost in.",
            "review_score": "1"
        },
        {
            "review_text": "I never found a game in my life that actually brought a tear to my eyes, with such little dialogue, it moved me far more than any story i've ever heard. Salute to the troops that died for their respective countries.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible gamme.",
            "review_score": "1"
        },
        {
            "review_text": "amazing story. great animation and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "buy this game if your bored of all of your games",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game the story is good i do find some bad things in it but it's not that bad i would give it a 9/10 so i would replay the game again",
            "review_score": "1"
        },
        {
            "review_text": "Made me cry like a little b*tch. I'm serious.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, unique artwork and a touching story all add up to a winning combo. Not very long, but still satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "The time it takes to complete the game times the amount of time everybody played this game=  the time it takes to stop crying",
            "review_score": "1"
        },
        {
            "review_text": "Awesome story, Amazing art style, GREAT game in short.........only problem is that, midway through the game, the screen becomes watery and blurry. Purty sure it has something to do with the monitor....",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game through and through. A rich story told through cutscenes and gameplay. Beautiful presentation and animation. Simple gameplay that remains varying and creative enough to keep you engaged and challenged without distracting you from the story. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly beautiful game with a very touching story. Get it in a steam sale!  Comes with uplay though.",
            "review_score": "1"
        },
        {
            "review_text": "Very great game and very emotional, but does anyone know how to fix the part where you have to drive and dodge bombs and bullets. It always stops the music and the only sound is when you turn the car left and right (it makes a tire screeching noise)?",
            "review_score": "1"
        },
        {
            "review_text": "Everything is amazing, story, art style, music.....  10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I was surprised at how the story and music flowed exceptionally well. I was never much for comic book type games but this game changed my mind. Definitely a must for gamers that like war based games like myself.",
            "review_score": "1"
        },
        {
            "review_text": "Short but great story.Worth a buy",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game, is wonderful how Ubi has focused in bringing an experience more than only graphics.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game carried mostly through beautiful art and animations, a stellar soundtrack, and a strong narration. The puzzles are pretty simple, but require a bit of thought. It flows very seamlessly and fits the context of the story. I didn't even realize it was a puzzle game until about a third of the way through. It does a great job of teaching you the mechanics without breaking immersion.   Some parts of the game feel kind of slow and unimportant, but really picks up in Chapter 3 and 4. You grow attached to the characters thanks to the narration and the brilliant job at capturing the setting. You really feel stressed, tired, sad, and even angry about this war.   While usually simple, the puzzles are pretty well done and require some outside thinking, though at the end of the day it mostly comes down to collecting items in the right order, spotting patterns, and timing actions. The gameplay isn't exciting at all, but the story, art, and music are fantastic.   8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Want to play a good game? This is a very good game. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "One of few Ubisoft games made from heart and not for money. Based on World War I diary, it tells emotional story of few soldiers during the First World War. Basically side scrolling adventure game based on puzzles and narrative is really great to look at and play. Only if they deleted main villain from game who seems cartoonish and does not really belong into such game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "A simple, yet emotionally charged game. One of the best (as in, tear-inducing) endings ever.",
            "review_score": "1"
        },
        {
            "review_text": "heartbreaking story, lovely artwork, simple but extremly atmospheric game expirience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best and the most emotional game I have ever played. If I want to highlight something from the game it has to be the good story and the excellent soundtrack, I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the best adventure game I've ever played. Great story with really well matching music and graphic style, while still having engaging and fun gameplay and puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "6 hours well spent",
            "review_score": "1"
        },
        {
            "review_text": "Great game but sometimes we do not know what to do as the hint generate quite slow",
            "review_score": "1"
        },
        {
            "review_text": "Never bothered with the problematic installation. Can't launch the game with the Play button greyed-out. Registered with uplay and already. It's very disgusting if a game company forces you to register online through their portal just so you can launch the game. Should have read more about this game to avoid frustration. Uninstalled and refund submitted!",
            "review_score": "-1"
        },
        {
            "review_text": "Tears were shed",
            "review_score": "1"
        },
        {
            "review_text": "I cried.",
            "review_score": "1"
        },
        {
            "review_text": "As a history fan, I adore this game. With all the little bits of trivia about the Great War, the art style, the heartbreak of the split families, the vengeance, the love, the death. This is not about the politics of war, but about the people of the war. There nothing really challenging about the gameplay, it's actually as simple as you can get. But the story is so beautiful, and clearly the intention was for people the learn about World War I, to see that even when there is pain and suffering, people still have hope. Anyone who doesn't have even a little bit of love for Valiant Hearts is dead inside.",
            "review_score": "1"
        },
        {
            "review_text": "Most EPIC game that i've bought this year. Brilliant atmosfeer and gameplay with a lot of historical background. One small bug in chapter 1, when fullscreen is enabled the car is driving into a loop. Restart the game in window mode and the car drives to the end.",
            "review_score": "1"
        },
        {
            "review_text": "This is the 1st and maybe the only game i regret buying on discount, it totally worth for the full price. Nice 2D graphic, prefect BGM that match the game, simple yet fulfilling gameplay and the story is legendary.",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a full review, and NOT a first impressions review like all my other reviews, if you want a better full review, then please read better reviews then mine",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game, this is a trial. A trial of emotions, a trial of awareness, a trial of wits, connection, loss. There's so much in this game that it is impossible to just let it sit by. Everyone needs to play this, not watch someone else play, but play for themselves.",
            "review_score": "1"
        },
        {
            "review_text": "Its an emotional rollercoster",
            "review_score": "1"
        },
        {
            "review_text": "A very good companion game for Battlefield One. A good glimpse of the other side of war.",
            "review_score": "1"
        },
        {
            "review_text": "5/7 one of the Good newer Ubisoft games.  kinda sucks that it requires Uplay.  rewarded 'I'M NOT CRYING, THERE'S SOMETHING IN MY EYE' award",
            "review_score": "1"
        },
        {
            "review_text": "Good story",
            "review_score": "1"
        },
        {
            "review_text": "really good and better than expected",
            "review_score": "1"
        },
        {
            "review_text": "This game went in unexpected directions, and really tore at my heartstrings. That is not a typo, by the way, I meant tore, not tugged. I don't want to give spoilers so I won't say when or why it happened; however, suffice it to say, I had to abandon the game temporarily to get tissues. This game sucks you in with compelling characters and a rich story. It was well worth my time, and I believe it would be well worth yours!",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the story and I have to say one thing: This is something more than just a game. It's a deep emotional experience, like watching a well made movie in the cinema.  It will make you lough or cry, you will be amazed and scared. Sometimes you may even feel like a little hero. Kudos to the develpers from creating a beautiful piece of art (because it is art) and to Ubi for taking the risk to publish it. I wish more games like this were created more often. Best 6E spent in a loooong time.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big strong who has never once felt, but if i were to want to do, this would.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Great story! Great music! Many emotions! 10/10 would play it again Also, I wasn't crying, there was something in my eye.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts: The Great War is a beautiful and touching puzzle-adventure game about how people's lives are affected by the horrors of war. The game not only has a great looking art style but also an amazing soundtrack. It's a must play.  The only bad thing I can possibly say about it really is... Uplay... Damn it Ubisoft.",
            "review_score": "1"
        },
        {
            "review_text": "So poetic and very sensetive! 10\\10 for plot",
            "review_score": "1"
        },
        {
            "review_text": "Touching. Moving. Valiant. Strongly recommended for those who are not afraid of being kind.",
            "review_score": "1"
        },
        {
            "review_text": " great script, stunning art amazing game!  worth your time and your money,   a piece of art ... should be in every library .",
            "review_score": "1"
        },
        {
            "review_text": "A Great History Lesson and so many great Facts and images about The War",
            "review_score": "1"
        },
        {
            "review_text": "History buffs and feels buffs must try this game  10/10 would cry again",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful and amazing game. I would buy it ten times if I had to.",
            "review_score": "1"
        },
        {
            "review_text": "Just to let you know your going to be sad while playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a touching story.",
            "review_score": "1"
        },
        {
            "review_text": "Immersive gameplay, amazing soundtrack, among other good stuff. Strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "No more words left for this game. It is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "You owe it to yourself and to the memory of those who pay the ultimate sacrifice for us all to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. The gameplay is basic, and actually isn't much beyond that which you would find in an online, free flash game.  But that's just mechanics.  Instead, the narrative and story is wonderful. The art is lovable. And overall, you will have a fantastic experience you want to finish, but are afraid to continue as you fear for the characters.  A deep, enjoyable game to play for 3-4 hours, with several elements that detract from the game and so many that make it great. Support Valiant Hearts.",
            "review_score": "1"
        },
        {
            "review_text": "This game was beautiful. I thoroughly enjoyed myself the entire game. The artwork is beautiful. The soundtrack, especially on opening and credits, ranges from beautiful to mesmorizing. The characters were lovable. I loved the facts it incorporated, and how it gave you backstory on the history it had within the game. The ending was heartwrenching and beautiful, and this is the first game that has ever made me cry. I'm frankly at a loss for words and am having a hard time reviewing this game decently. All in all. Absolutely fantastic. I love it. I definitely reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "I preordered Valiant Hearts and I am glad I did. I just completed chapter 1 so I have not beat the game, but it is quickly becoming one of my favorites. Many of the reviews that came out for the game depict it as lacking in storytelling, gameplay, and overall emotion. I can say without a doubt that it is not true. The story is compelling right from the first few minutes, and even though it is heavy at times, it manages to maintain a light mood that keeps it from getting too depressing. It is a brave thing to have made a game about WWI, and I think they have created a fantastic story overall. The gameplay is going to be lacking if you compare it to modern day shooters or war strategies, but that is the entire point. The gameplay is the way in which you interact with the story and characters within the world. It is there to add to your experience, and though it is not particularly challenging, you still feel rewarded when you solve the story driven puzzles. Overall I would recommend the game to anyone looking to play a game with a more artistic design and that want to experience a story, rather than play a game. My only con is that the diary entries are hidden in the pause menu with very little indication they are there, but they are very crucial to understanding the characters as they progress through the game so I highly recommend reading them.  ",
            "review_score": "1"
        },
        {
            "review_text": "Very reflective of the first world war. Based on a great amount of fact and expressed the horror in war. Was well worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant heart is one of those games that you just need to play to be able to really see why it's so, so, sooooo good. I really recommend that you buy this game if you can afford it.",
            "review_score": "1"
        },
        {
            "review_text": "In my case I found Valiant Hearts/Soldats Inconnus Mémoires de la Grande Guerre one of the most touching and well, unforgitable videogame I'have ever played! Most games that are set in the World Wars have a mind of killing, shooting, and well, your charictar is a beast. Here, your charicters are not super captain Mericas. No they have troube climing ledges and throwing items. And the graphical art style is amazing, smple, but amazing! The puzzles combine WW1 catostrphys and just, puzzles! The amount of connection that you reach with these charictars are amazing! I fealt like they were real! Now as I don't want to spoil anything, I want to say that the ending of the game, was, well. It was a tisue box dispenser, so touching it almost made me cry. And the amount of fealing you have threw the game it is, wow! Now the cons. The puzzles may get a bit boring, at least I found, but it was only 1 or 2 puzzles, and thats all I found bad. The games cut seens are amazing as well. There is no real voice acting just some 'Yeah' 'Merica' 'Hmmm''s And you do get a pet dog, and, he is awsome. You will find connections with this charictars threw out the game, because this game has such an awsome storey and the time period is perfect. If I was in IGN or PCGamer. I would give this game a 11/10!",
            "review_score": "1"
        },
        {
            "review_text": "The game is mildly educational, with the collectibles being museum-like reminders of what the war was liked for everyone involved. Diaries and information about different aspects of WWI taught me quite a lot, and it's disturbing to think that 100 year old bombs are still at risk to hurt people.  This game uses a lot of point-and-click-type puzzles, some of which are very annoying. Some of the puzzles also include waiting, which doesn't feel very satisfying to complete. The story is still quite excellent, though the characters could definitely be a bit more polished. The ending makes it sound like there's going to be a sequel, or a similar game based on WWII, but this game also feels like it could use a bit more polish and time.  As of this writing, it's $15 on Steam, which I feel is currently slightly high of a price for a ~6 hour game that has some cheap time extenders to it. I would most definitely recommend this game when it goes on sale for &lt;$10.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great story, much better then ubisofts latest triple a title. Love the art style and music. Freddies and Annas stories could have had better endings but all in all 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable puzzle game, but does have a few frustrating stages. Won't tax the brain cells too much, but personally I enjoy that as I don’t want to get stuck and preventing from continuing. The storyline is good and very moving in places",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest game stories I've ever had the pleasure of witnessing. The imagery, the iconography, the story itself makes up for every gameplay fault (I'd be hard-pressed to recall any real faults with the gameplay), and the ending is a true tear-jerker.  Not only that, but the game contains many facts about the first world war beyond the iconography of trench warfare we are all familiar with. Yes, this is an educational game, but with the beautiful story and the gorgeous presentation, you won't forget what it teaches you.",
            "review_score": "1"
        },
        {
            "review_text": "Such an awesome Game. So many Things to learn about the WW I and this story is just amazing and so sad. It rlly was hard to play through, fighted against sheeding tears.  Its a good Game for everyone, if i would be a Teacher, i probably would share this with the Kids. (So many learning opportunities).  Audio 10/10 (Such an awesome Voice for beeing dramatic and serious) Video 10/10 (Some would say this looks garbage, but its rlly good and dont need to be 3D) Story 10/10 (would give it more on this part, if i could)",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing.. though some might not like the graphics (not being 3D) or the amount of puzzles in this, the story and the characters are what sets it apart. It makes you feel the sorrow and anguish that the characters feel. Yes, it's not a long game but it is worth every second playing it.",
            "review_score": "1"
        },
        {
            "review_text": "the game itself can be completed within about 8 hours, if not less, but take your time, read the diary and the historical logs, this is unlike any game i've played before!! It's educational (if you want it to be - eg, by reading the logs) Or can be just a nice little puzzle game. you get a real feel for the charactures and will deff be left with a lump in your throat at the end. loved it!!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story, really captivating.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game even though its very very very sad i love it i rilly want a sequel and the end guarentees a sequel if ur willing to wait after the credits :D PLAY THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Strong story about I World War with interesting historical facts",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is beautifully written, designed, drawn, and voice acted. The story is sweeping, grand, and truly wonderful. That said, there is one huge, glaring flaw: Uplay. Ubisoft forces you to download their horrible Uplay software in order to play this game, which is attrocious since Steam should be more than enough to handle a simple point and click adventure game.  Anyway, if you can ignore the fact that Uplay is horrible, this game is one of the best adventure games ever written, and I can't recommend it highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "'A generation of men who, even though they may have escaped shells, were destroyed by the war.'  Valiant Hearts : The Great war is short and gameplay-mechanics wise, not all that much is new or exciting, but the visuals and story it is packaged in is stellar and will move you to tears.  This game follows the lives of several fictional characters from various parts of the world whose paths crossed throughout the first few years of World War I, or as it was known then, 'The Great War.'  Emile, the grandfather. Karl and Marie, his son-in-law and daughter. Freddie, a man seeking revenge for the death of his love, Anna the battlefield nurse and student, and a service Doberman dog named Walt whom each of the characters interacts with throughout the game.  The game is primarily a sidescroller action puzzler. You run around beautiful hand drawn environments with incredible detail and figure out how to solve puzzles such as how to re-route pipes or grab a key out of reach or trick a guard, or avoid being caught by a light. Sometimes, as the battlefield nurse character, you will have to engage in Parappa/Guitar Hero (without the guitar) button press sequences to heal someone. In still other instances it is something akin to a bullet hell game with little chase sequences where you must avoid obstacles while flying toward you from the camera while driving directly toward the player. Sometimes (especially with the nurse bits) this can get a little repetitive, but thankfully the world created for the player is beautiful and melodic which enables the game to still easily keep you engaged.  One interesting bit - this game takes place almost completely before the U.S. became involved. It mostly revolves around the conflict as it occured between France and Germany. There are moments and a character that stray from this but for the most part it focuses on those 2 countries' roles in The Great War. Seeing as it is Ubisoft Montpellier that developed this title (located in southern France in the city it is named after, Montpellier), it's pretty easy to see why this was the case. I found it fascinating because as an American, our history books mostly seem to only focus on our own country's role in any significant war.",
            "review_score": "1"
        },
        {
            "review_text": "Quite the emotion turner. You learn the consequences of the first World War and are put through the scenarios that people had to go through in that rough time. If you enjoy learning about the World Wars (Mostly the first one.) and are not afraid to see the true horrors that come with it, it's a game worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "great gameplay amazing artwork amazing soundtrack amazing story i really recommed this game",
            "review_score": "1"
        },
        {
            "review_text": "It is a nice change to see a game about the war (the first World War!) that isnt a shooter.And as a Person that always took a certain interest in WW1 it makes me happy to see that it also tries to cleverly teach people about the things that happened back then, And while the integration of the Historical facts might not have been perfect, everyone interested in the Topic can easily pick up one or two facts about WW1. Some sacrifices have been made in the game, but they were neccessary to find a good balance between having fun with the game and being educated.  I would recommend this game to everyone that has even the slightest interest in WW1",
            "review_score": "1"
        },
        {
            "review_text": "This is the type of experience that makes you rethink everything you know about gaming. It isn't so much about the gameplay (which can be frustrating at times) but more about the story behind it. Though the game does have some flaws with it's control scheme, if you are on the fence about whether or not to purchase this game, it is very much worth the purchase price",
            "review_score": "1"
        },
        {
            "review_text": "This may be one of my Games of the Year. It has brilliant puzzles, great characters, fun gameplay, an amazing soundtrack, and what I think puts it in my 'Must Play Games' catagory, the storyline.   The storyline is brilliant. It switches to one of four characters each level: Karl, a young German man who lived in France, exiled and forced to fight for Germany to get back home to his wife and son, Marie and Victor, Emile, Karl's father in law and probably the nicest, most helpful man drafted into the French Army, Freddie, a new friend of Emile's and an American soldier who joined the French Army to get revenge, and Anna, a Belgian nurse who wants to help the wounded and find her father.   The switching between characters makes the storyline feel dramatic and amazing; one minute you're watching a cliffhanger of a cutscene where a character may or may not have perished, and you switch to another character who does something important to the story during their level so that you pay attention during the level and not rush through it to see what happens to said other character.   And let's not forget the dog. The loveable Doberman Pinscher dog medic named Walt. His gameplay is essential to finishing puzzles, and his story is essential to your feelings because no one ever wants the dog to die, unless you play Call of Duty and murder attack dog after attack dog. Walt is my favourite part of the game. He connects all of the characters even when they aren't together at those moments. Although destiny and friendship is the theme of the game, Walt is the embodiment of those themes.  Overall, this game is a must buy for everyone. Not just storyline fans, puzzle lovers, history buffs, or dog huggers. Everyone. This includes the die-hard fans of Call of Duty or Battlefield, or any other shooter, so that they know what they cause whenever they pull that virtual trigger. I rate this game 9.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "I dont know if its just me but in one of the very first parts *SPOILERS* he has to push a ammuntion crate to keep one end of a lever down to get to a high place ive seen people do it and it takes to my count 5 seconds but in my game i only have 3 seconds i cant get past that part but other than that the game looks amazing the artwork is stunning for 2D and if you can get you game to work I'd highly recomend this game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer: Punctuation/gramar is not my strong points. &lt;-Probably some mistake there. I do not know where to begin... This game is/was amazing. It is under rated buy it.&lt;- that's the TL;DR version. It exeled at delivering a great story. This game is a 2D Puzzler/Platformer with the platforming only used to move around (no jumping puzzels!!!). There are some downsides to it though It is only four to five hours and the fact that the story is delivered so well that it is so memorable kind of takes away from the replayability. The difficulty of the puzzles can be either insanly easy or difficult (Its difficulty goes up and down more than the stock market). If you can look past those two small complaints you should buy it now and if not now, next time it goes on sale. Oh yeah, Uplay :(.  Second TL;DR: This game was gr8 m8 I r8 8/8.",
            "review_score": "1"
        },
        {
            "review_text": "Valient Hearts is simply amazing. The art style is very nice, the story is touching ,and the gameplay does not detract from the game in any way, but most of all it adds a human element to war that almost every other war games misses. I would recommend this game a thousand times to anyone interested in history or a touching story.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing. The art style and story are both phenomenal. They just pull you in to the harshness of WWI without it being over the top gorey. The gameplay is a bit slow and lackluster at times, but it's fine during the key moments. My only real complaint is that the climax is one overly long quick time event.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, a great story, great graphics...  Even if it would cost 30€, still worth more than other games.  Ubisoft, u did a great job.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "I laughed, I cried, I pondered, I worried, I was shocked... I was reminded of what war does to humanity. I gained even more respect for what people went through about 100 years ago.  I also realized Ubi can still make great games once in a while when they manage to stray from their yearly AAA titles. This game is funny, emotional, satirical, artistic and a joy to play. If you stumble upon it, play it. It's a gem.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I was always skeptical about Ubisoft and their scriptwriters, but after Valiant Hearts I saw them in a different light. Main musical theme was the first to draw my attention. Then came excellent recognizable graphic that reminds of indie-games. And great plot… I can’t even call it a plot, it’s a story or a novel. Really worth novelization. No spoilers here, you just have to play it… to live it! Great game, it brings back hope. Ubisoft’s fav of all time 9/10.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "It was very sad but the game art the game play is fun and awsome I would like to see a sequal but bring back the dog please. And at least in the next one make it where a certan someone had evedence of something o.-",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I would connect with this game like I did. 10/10 would recommend to everyone.  NEVER CRIED THIS HARD :'(",
            "review_score": "1"
        },
        {
            "review_text": "Other than some audio sync bugs...this is a good game to get. A good break from Ubisoft's mainstream games",
            "review_score": "1"
        },
        {
            "review_text": "I've had this game for about a week, but have only managed to play for 30 minutes because of UPLAY issues. Such a shame because I think the game really has potential.   So I'll still recommend the actual game, but UPLAY ruins the experience.",
            "review_score": "1"
        },
        {
            "review_text": "It is a diamond! With great soundtrack and interesting puzzle elements. 10/10, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "The story, the music, the feels. Play the game, it's great.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a thrill ride the trailer makes it seem like it may not be sad. But the ending really got to me (hopefully like many others) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful tale set in the bleakest years of the early 20th century. It breaks your heart as easily as it warms it and is the only game I've played to date to elicit some emotional reaction out of the burned out husk that is my soul.   Follow the journey of five ordinary folk, whose lives are shredded in the knashing teeth of the Great War, through puzzles, over the top boss battles (no pun intended), and rhythm-based driving/surgery sequences.   The cartoony art style is an incredible medium for contrast. Starting the game in cheerful and colorful environments and ending in grim, blood soaked nightmare fuel is a brilliant display of the horrifying effects of the First World War.   Grab a box of tissues and a good pair of headphones and get ready for one heck of an emotional ride.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game was an emotional wreck for me.   Finally we get a world war (or any war really) well represented in gaming. You end the game not thinking: 'Yeah! That was awesome, war is cool.' But seeing how horrible and atrocious it is. The environments, the background, the music, the art, the details, everything is very well crafted. You feel bad not only because of your characters and their stories, but because of everything that is happening around you. It's not just about the stories and interactions between them (which are awesome) but about much more. It all comes together really well. The developers make you feel the war and, as the game progresses, that becomes more and more obvious, with more details about it. And that is only possible because the story is much more than a main line between a bunch of people. That's what makes it so worth while paying attention to and experiencing it. Everything comes together, characters, stories, background, environment...  The use of violence, as it is indeed a terrible war, is done really well, without it being over the top, intrusive or unnecessary. It feels very much real and down to earth.  As for the gameplay, it really blends well with what the developers wanted to show you and make you feel. It's simple, fun and it works well. It's almost like an adventure game (without the point and click). It is definitely not a shooter as it relies more on puzzle solving and occasionally 'quick dodge sequences' (those are not quick time events). Even the collectibles are well added into the lore. Instead of being random stuff you collect for achievements they make sense and make you learn more about the war and what type of equipment soldiers (and civilians) had, adding an extra detail that I can really appreciate. You can really see that the game was done with utmost care. I'd welcome a more challenging gameplay but it really wasn't the main focus and I can understand that.  Other than that yeah, as many have said, making you install UPlay is terrible but that is the Ubisoft way now... And that being the negative thing about the game says wonders about it, don't you think? :)",
            "review_score": "1"
        },
        {
            "review_text": "Good graphics and story, but was little bit borring for me. Not recomend for grown-ups.",
            "review_score": "1"
        },
        {
            "review_text": "This is an experience that everyone should play, and one of, if not the best games about ww1 in my views",
            "review_score": "1"
        },
        {
            "review_text": "This was a very good game, beautiful artwork, the animation was smooth, and the story really got you involved with the characters. The historical facts and information along the way was really interesting, and a lot of stuff I didn't know about was listed. I will admit, I cried at the end ;_; Overall a good game for a casual player, or someone who just enjoys history.",
            "review_score": "1"
        },
        {
            "review_text": "I heard this game was heart touching and alot of people cried at the end... So I prepared myself... or soo I though...",
            "review_score": "1"
        },
        {
            "review_text": "This game will crush your ♥♥♥♥ing soul. It's a tragic story made sadder by the reality of the conflict. The developers worked with several historical societies to make the history in this game real, and that's the part that makes you feel the weight of everything that happens to the characters. This game is not only a work of art, but it's one of the most raw and genuine educational experiences in recent memory. Play this game. I mean it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not bad, but there are some bugs, for instance: when you are chased by a big tank which is throwing bombs (in chapter 3), there's a bug, which causing that you can't destroy that tank, because game closes in a loop, so the tank will chase you and throw a bombs without end in a same way.",
            "review_score": "1"
        },
        {
            "review_text": "Don't pass this game, it's a fantastic story about World War 1 with an ending that will make you cry, unless you have a heart of stone.",
            "review_score": "1"
        },
        {
            "review_text": "Arguably one of the greatest games I've ever played. Not particularly complex but tremendously engaging and educational. Add in the wonderful blend of characters and a story that shows the true horrors of war which (at least I feel) has been lost in the industry. A must play for all.",
            "review_score": "1"
        },
        {
            "review_text": "Best game i have ever played, it isn't as boring as i would expect, actually, it is everything less boring. (it looks boring but it isn't) It's quite impossible to not cry... :/ Altough some things could be optimized i totally recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly moving, the actions you take as a character really feel like actions you might actually take as a person. While some of the actual 'mechanics' of the game feel a little shoe-horned in, the important mechanics serve to push the story forward quite well. Definitely worth playing in the centenniel of The Great War, and I encourage everyone to give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "A hauntingly beautiful game; perfectly captures the irony of being a soldier; the beauty of serving your nation, and the sheer, disgusting horrer that is total war.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is overall an enjoyable experience, whether playing it out of historical interest or just for its simple old-school gameplay and beautiful art style. Its story is, for the most part, ludicrous and improbable; but at the same time its warm and deep. Characters develop well in spite of a near-total lack of dialogue. It does however, fail to deliver the emotional punches it so often teases the player with. The gameplay is very simple, mostly consisting of collecting objects in order to progress through an area. There are also throwing mechanics and neat uses for the dog, but the real variety comes from each character having a particular skill, or style of gameplay. Emille uses a shovel for some nail-biting tunnelling sections. Freddie uses wire-cutters and also drives a tank at certain stages of the game. Anna's sections consist mostly of driving sections and QTEs when healing people. And Karl's sections focus more on stealth. These means that while the gameplay is very simple, there's also a huge variety of things to do and one never really becomes tired with the game. One should also recognise the large amount of collectibles and historical fact-files present, giving any history-nut a lot to dig through. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Currently loving the game and the artstyle. The only problem im having with this game is the endless loop when Anna and Karl are being chased by a French tank, this problem for me is ruining the game as i am, at this point, unable to complete the game.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed playing this game.  There are different characters, whose paths cross during this touching story. Very well chosen artistic style for such a game. The music is beautiful.   Throughout the game you are able to read historic facts, although i must admit, i read only a few. There are also additional thoughts from the characters, which are added to the diary from time to time while you progress through the game. Here again, i haven't read all of them, but i still think they were interesting.   There were a few times, where i needed a bit more time than i should to solve a task, but i wouldn't say that the game is hard. The game tells a story, it doesn't have to be challenging. And you can always choose to read the help, which will pop up if you take too long to solve a mission, i think (it is timed somehow).  I will most likely play this game again.  Do i recommend this game? -Yes.",
            "review_score": "1"
        },
        {
            "review_text": "A Heart-Warming story, with some great mechanics aswell as gameplay. All in all worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Superb game. I say this game is 9 out of 10. Would be 10/10 but now I'm completely depressed.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Love this style of gameplay and hopefully they come out with another one!",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game with a strong, heart wrenching narrative. It also serves as a valuable lesson into the horrors of WW1 a little covered period of history in terms of video games.  The art direction is the true masterpiece of the game, the detail &amp; atmosphere created is truely stunning. The main characters are all beliveable &amp; while it would have been easy to produce a story focusing on just the allied side of the story, Valiant Hearts manages to weave a tale showing that all the sides were effected in this terrible tragedy of the 20th century.  While the puzzles are somewhat simplistic &amp; the gameplay sometimes takes second place to the narrative. The story is so strong it compelled me to finish this game in one sitting (just under 7 hours) to see it through to its conclusion.  The real standout star is the doberman 'Walt' who you find in a German camp early in game. There's been dog characters in high budget video games before but they really nailed it here. Outstanding character design &amp; behaviour.  While the full price of £12 might be a little steep. The production values are clearly there seperating it from a regular small indie title &amp; it'd be a challenge for anyone who appreciates good story telling not to get a little teared up!  As an aside, the one problem I have with this game is the UPLAY implementation. Terrible! Don't understand the need for it, we've paid you for the game, just let it run through Steam.",
            "review_score": "1"
        },
        {
            "review_text": "An intimate view of World War 1 life. The horrors people faced as well as the overall history of the time.  I took more away from this story than any textbook. I'd definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "So emotional, graphically appealing and enthralling that it is cleary a top game for 2014. I would recommend this game to anyone wanting a story that leaves you feeling amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Simple but great gameplay, great art style, and great story. The only negative I could muster up is Ubisoft's annoying UPlay. If that doesn't bother you too much, you'll have a great time playing this!",
            "review_score": "1"
        },
        {
            "review_text": "The first time I have played a war game from the French perspective! This game is a beautful 2d side scroller with light puzzle elements. It took about 6 hrs to beat. (which is good given my limited playtime) The story was great, the setting was great, my only complaint was the controls. The arrow keys to move? I haven't used those since duke nukem 3d (the origial). Truely a great game! Je parle oui! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful story, music, art, characters. 'Gut gemacht!'",
            "review_score": "1"
        },
        {
            "review_text": "One of the better stories I've ever heard - many feels. Also has amazing title music.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game if you want a surprizingly accurate quick and dirty overview of the first three years of World War One. So far as I was able to tell, as giant Great War nerd, they only got one fact wrong, which is when gas was first used (It was used on the eastern front before the Germans tried it at Neuve Chapelle, but it wasn't very effective against the Russians since it was so freaking cold the stuff froze soild. Oops.)   The game starts slightly cartoon-y, with pursuit of a fictional German general, Baron Von Dorf, driving the plot. This was probably a good choice, since the player gets to learn the game mechcanics without their mood being pulled down too far. After Von Dorf is defeated, the game takes off the gloves and punches you in the face with the misery of the war; as it's set during what is definitely the nadir of hope for the Allies and actually a pretty damn desperate time for the Germans too, it's very appropriate! Just get ready to bawl you eyes out at the end of the last playable sequence.   Be sure to read the facts attached the historical item collectibles! They give a lot of context to the daily lives of soldiers and civillians during the war. The war happened a hundred years ago, and some of the things you collect really drive the point home how foreign that time is to us moderns.   The gameplay is pretty easy, so you can let your older war-nerd relatives loose on this without expecting too many pleas for help. The replay-ablility is... not great, but you'll get a soild ten hours or so of puzzel solving, artillary-shell dodging, rythem following entertainment out of it.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent puzzle game with a strong antiwar message. It wakes you up to the fact war is the biggest scam ever perpetrated on humanity. How do the ruling classes manage to dupe and scam normal people into a state of near-slavery where they are forced to kill and maim complete strangers?  While the puzzles aren't that difficult, they are pretty well thought out and provide a good brainstorming opportunity between more action packed sequences. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "/////",
            "review_score": "1"
        },
        {
            "review_text": "Great Story !!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, great story and also at time complicated puzzles. Would recommend to most of my friends.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. It uses UPLAY. This may be a sticking point for some people. I have enjoyed this greatly. I would recommend at full price, assuming you already have a UPLAY account.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing. Challenging puzzles, characters you actually get attached to, a beautiful soundtrack, great story. Interesting bits of information about the war available to read as you progress gets you that much more involved in the story and educates you (at least me anyway) along the way. An emotional rollercoaster (in a good way) and one of the best games I've ever played. Cannot recommend enough.   Just play it. And don't be afraid to cry. :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have played in awhile. I honestly was moved to tears at the end. Highly reccomend.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "In short: This is just a wonderful game.  Get it, play it, enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing and fun. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "1. Lie down 2. Try not to cry 3. Cry a lot all aboard the feels train.",
            "review_score": "1"
        },
        {
            "review_text": "Very nicely done game! I loved all the details, atmospheric content, and music put into it. Just a beautiful masterpiece, Thanks for such a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Great animation, fun game play ( no shooting or jumping ... interesting for a war game) learned a lot about WWI and ... so . much. feels",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Game with Good Storyline",
            "review_score": "1"
        },
        {
            "review_text": "Just brilliant game. I really liked it for its story and soundtrack. The only thing I didn't liked very much, was taxi missions, because these missions had to happy soundtrack, it almost makes you laugh at some point, but it's only my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not normally a fan of the puzzle/adventure genre, but this game keeps things moving and tells a powerful story. Definitely worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "The story compels you to play until the end. It was worth paying for it.",
            "review_score": "1"
        },
        {
            "review_text": "Only buy this game if you like good games.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished it... Gorgeous !  If by any chance, you missed some hours of history classes... this should help you understand how ugly wars are. This game makes you feel WWI from inside... Had to fight my manly tears... failed at the end.  Great Game !",
            "review_score": "1"
        },
        {
            "review_text": "Well, did not expect to find what I did in this little gem. A refreshing but simple take on war and the damage it causes. The hand drawn graphics and classical style music is fantastic, the narration is great and the dog (Walt) is ♥♥♥♥ing adorable. Only drawback was it was fairly short, depending on how fast you solves the puzzles and if you replay for collectibles. Well written and somewhat educational; it's a war game that focuses on surivival, why people fight and the cost of sacrifice. Levels consist of puzzles, dodging obstacles or using stealth to avoid danger. It displays the harsh reality of war, the horror of battle and the bonds that persist or form during a time of a struggle, all without being gore drenched and spewing salty language. Highly recommended for history buffs, or people that are sick of games that are mowing down 1000's of aliens, foreign people or zombies. It's different, it's wonderful and refreshing way for a video game to tell a war story.",
            "review_score": "1"
        },
        {
            "review_text": "SO... MANY... FEELS... TRY NOT TO CRY A LOT.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most Hearttouching games i´ve ever played! There is no need to say more...",
            "review_score": "1"
        },
        {
            "review_text": "One of the best all around adventure story games released in the last few years.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent mix of story and history lesson with beautiful art. Very worth trying.",
            "review_score": "1"
        },
        {
            "review_text": "What a surprise this game was! Excellent pacing for the story, and never let up on the emotional front. I recommend this game to anyone interested in hand-drawn, 2D sidescroller games. I hope to see more games like this come out with this quality.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT ARE YOU DOING LOOKING AT REVIEWS!?!?! BUY THIS GAME! BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and emotional storyline, fun puzzles and fantastic art style.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  The story progresses nicely and really sucks you in  Visuals are pleasing and there are hidden items to find if you're into that kind of thing  This is a well-made, must own game",
            "review_score": "1"
        },
        {
            "review_text": "It's a little gem ...",
            "review_score": "1"
        },
        {
            "review_text": "An amazing storytelling game. Not only I had fun but now feel a better educated person in History.  Is a simple yet beautifuly crafted game.  Thanks Ubisoft Monpellier for such an amazing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Its a pretty decent game. Its a puzzler thats well integrated within a story.     SPOILER: The dog lives.",
            "review_score": "1"
        },
        {
            "review_text": "This game focuses on telling the stories of its five main characters, but still has something you could call 'gameplay' unlike the recent wave of 'walking simulators'.  I thoroughly enyojed the six hours it took me to finish it - not because the gameplay is good - it's not, but it's there - but because the story is as gripping as it is tragic.",
            "review_score": "1"
        },
        {
            "review_text": " Review For Valiant Hearts",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful Game, I think it is my fav game ever!  Wonderful story and design.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, beautiful artwork, good gameplay, ♥♥♥♥♥♥ic soundtrack, the voices could use a little work, all round though, fantastic game. -1 for the fact it's by ubisoft  9/10",
            "review_score": "1"
        },
        {
            "review_text": "It is an amazing game, if you own a PC.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great experience you're going to have because YES you don't know it yet but you WANT to buy this game !",
            "review_score": "1"
        },
        {
            "review_text": "A simple game with minimal gameplay puzzle mechanics, but a charming story. Interesting facts about WWI. Has Uplay so if you can't stand ubisoft don't purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing art and incredible storytelling.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool historical puzzle game. Enjoyable, interesting and poignant.",
            "review_score": "1"
        },
        {
            "review_text": "A poignant story with an amazing art style. It's a great story and living proof of how good the adventure game genre can be with deep characters and well written story lines.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, and I loved every second I played. It's more akin to a visual novel really, as the puzzles are very simple and the action sequences are all on rails. The story is wonderful, and is easiy worth the purchase price. However, I can't recommend it for two reasons:  1) I didn't get to finish the game due to a common game breaking bug at the end of Chapter 3. Apparently Ubisoft vowed to fix it, back in 2014. 2) Uplay is required. The game cannot be played without Uplay, and all Steam does is launch Uplay for you.",
            "review_score": "-1"
        },
        {
            "review_text": "This game will give you chills as long as you have some sort of heart. Really beautiful story telling and artwork and the puzzles arent childish. Read the historical stuff that is attached to the items you find throughout the game too, the stats and stories really drive the point home, that war is the dumbest thing ever created by us monkeys.",
            "review_score": "1"
        },
        {
            "review_text": "This review is not about Uplay. This review is not about Ubisoft. This review is about the game.  If there was any game from Ubisoft that would counter the argument laid out by Roger Ebert of the Chicago Sun Times, it would be this game. Not only is it art, it's reality. It's history.  This game must be played by all. This game requires you to stop being stubborn/ignorant/childish and accept the realities of this world. War, no matter how it's played out on TV, the news, movies, books, or history can truly reflect it's dehumanizing nature. Pitting people against each other for some imaginary maluable lines that were created by the powerful hundreds/thousands of years ago to keep people in check.  This game is about emotion. It's about puzzles. It's not too hard, yet it's not too simple. If you want to find everything it'll require much more dedication and time from you. If you just want to play the story it'll take about 8-10 hours.  I was always wondering what everyone was talking about with the emotions. And then the end hits you. Even if you can't keep the story straight, or who each character is and what each character does. Once the ending hits, it doesn't matter. You see the reality of war and the toll it has on real, living, breathing people who have friends, family, children, brothers, and sisters.  If you read this far into my review, you're probably not going to be one of those people who is an ignorant Call of Duty player.  I implore you, even if you don't care about finding objects (which I enjoyed because it provided insight into what life was like back then -- each object is something that soldiers used on the field), buy this game, and more importantly finish it. If you really rush, it can easily be completed in five hours. Two weeks max if you put your mind to it and say, 30 minutes every other day.",
            "review_score": "1"
        },
        {
            "review_text": "It is a FANTASTIC game. The story telling is amazing, very compelling cast of characters all the way around. The art is amazing as well. For all you history buffs out there this game is definately for you! WORTH YOU TIME AND MONEY FOR SURE.",
            "review_score": "1"
        },
        {
            "review_text": "Balanced length-to-variety and appealing artstyle. I didn't like the minigames (such as dodging bombs in a car) all that much, but they didn't spoil the game on the whole for me, either.",
            "review_score": "1"
        },
        {
            "review_text": "The first time i ever emotionally cried at anything in a 3rd person point of view. 10/10 would play again...",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle game I've ever played in years. It's like a comic book has come to life. Not to forget its a feels game! I had to perform a harakiri to feel manly again.  Game: 10/10 Graph: 10/10 Feels: 20/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the most empathic games I've ever played. Sidescrollers/quests are of a 'meh' genre in my opinion but as long as there's a strong story behind a game, count me in. Puzzles are extremely easy, some moments are a little annoying like the last gauntlet but all those are overshadowed by the strong narrative.  By the way, I hate Ubi as a production company, beats me how they managed to make such a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "I want to give this a mixed review as it's removed one of the greatest features an ubisoft game has ever had... 'Uplay not required to play'. But alas, they removed this great feature... Ah well, atleast it's ubisofts best game, not saying much, but atleast it's got that going for it.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the game and boy it was so amazing. Not to mention tHE FEELS. I really love the gameplay, the puzzles, the soundtrack, graphics, art, the extra tidbits like history of the war. This game is just too amazing and too good.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly educational sidescroller that is story rich. The soundtrack is incredible.",
            "review_score": "1"
        },
        {
            "review_text": "This game owns a special place in my heart.",
            "review_score": "1"
        },
        {
            "review_text": "Great for anyone who is looking for a strong narratively driven indie game. Would highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A must play. I don't have the words to describe this amazing story/game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "So sad ;_; Awesome game though! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I cried when playing a game.",
            "review_score": "1"
        },
        {
            "review_text": "This game came out at a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Login Simulator 2014. Get rid of Uplay maybe?",
            "review_score": "1"
        },
        {
            "review_text": "This is a simple platformer game, with easy-to-solve puzzles, so I'd recommend it even for those who are not really into platformers (like myself). The real strength of the game is its' atmosphere and story.  Overall the story is not too long, it can be finished on a single day, as every time you finish a section you want to know what is to happen next. The voice-acting felt unique to me and the narration is really on point. The art style really fits the mood of the game. But WAIT I left the best thing to the end, the soundtrack. Even if for the price I'd have just got the soundtrack of the game I would still be happy. The songs are always appropriate, and immerse you into the story more than any other aspect of the game. Why am I saying that?! Well, SPOILER:    The most prominent part of that is at the end of the game, when Emile commits mutiny. Minutes before you actually have to do it to progress I've already tried to kill that ♥♥♥♥♥♥♥, as the action and especially the score made me furious at the horrors of the battle.     All in all, I can recommend this game for everyone as the story and the experience worth both your money and your time to spend on.  9/10  PS.: Read all the diary entries, historical facts, and item descriptions, all of them are really interesting and informative.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;expects it to be short and dull &gt;sobs when it ends",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game both story wise and game play wise.",
            "review_score": "1"
        },
        {
            "review_text": "If you're cheap like me, get this game on sale now. If its not on sale, get it anyway. BUY IT, DOWNLOAD IT, AND PLAY THE ♥♥♥♥ OUT OF IT IN ONE SITTING SO AT THE END, YOUR FINGERS ARE DYING, YOUR HEAD HURTS AND YOURE CRYING.   10/10 would recommend to everyone and anyone.",
            "review_score": "1"
        },
        {
            "review_text": "The story and soundtrack are extremely moving. Also, the puzzles were creative and a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just right in the feels!",
            "review_score": "1"
        },
        {
            "review_text": "This is without a doubt one of the most heartwarming and heartbreaking game i've ever played. It is a well composed story that portraits the terror of the great war while at the same presents love and friendship through an beutiful artstyle.  The only thing that holds this game back is its gameplay that is simple platform-puzzelgame. But if play this game it should not be for the gameplay, but for the beutiful story this game beholds.  Can't recomend it enough!",
            "review_score": "1"
        },
        {
            "review_text": "This game presents a far more meaningful war story with more lovable characters than what was given in BF1. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would break my heart into a million pieces a million times over for this game",
            "review_score": "1"
        },
        {
            "review_text": "The storytelling in this game is amazing. I've played it through several times now and I still cry every time. The puzzels are also really fun to figure out and the art style is fantastic",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should play this game some time in their lifetime. It is truely a masterpiece. I hope someday it gets a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "inmersive storyline, fun puzzles, captivating art style, smooth gameplay and best of all: Dog companion is useful 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beat the game, cried for hours.",
            "review_score": "1"
        },
        {
            "review_text": "A beautifully simple yet moving game.",
            "review_score": "1"
        },
        {
            "review_text": "Valiant Hearts is a side project of Ubisoft and what a great side project. While not particularly challenging, the game provides a few puzzles that will stump less experienced players for a while, and the player is well rewarded for making progress. An interesting storyline showing the different and overlapping paths of the main characters, littered with interesting information about the Great War, which is both thought provoking and at times poignant, focussing on the human impact of the war rather than on the guns and glory on which so many other games tend to focus. It won't take you long to finish the entire game, but it's well worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "Tears in my eyes........  Marvelous game.",
            "review_score": "1"
        },
        {
            "review_text": "The most gut-wrenching experience I've ever had playing a video game. Every piece of this game's design - the rough, ink-like art style, the muted color scheme, the powerful score, the panic you feel as you frantically try to cut through wires to escape gunfire and run from incoming shells (on top of how slow the characters feel sometimes) - builds the horrific, sobering image of the Great War. I felt worried and desperate while playing medical Dance Dance Revolution, somehow. This game should be required playing in school, and for anyone even a little curious about the sheer scope and awfulness of World War One.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome 2D adventure game, rich story and historical information. I wasn't prepared to be hit in the feels. Must play!",
            "review_score": "1"
        },
        {
            "review_text": "This puzzle game follows a handful of characters set in WWI. Some sections are fantasy, like when a main villain drives a dirigible around in an attempt to kill you, but other parts are terribly real. This game is cute but heartbreaking. It will leave you with tears in your eyes.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game! not as complex as most triple-A title single player games, but that doesn't change anything. This game is a very heart felt puzzle game that gives a wonderful insight into the horrors and bravery of World War I. It is a wonderful game for almost any age. You won't regret your purchase. Boonty guarantee!",
            "review_score": "1"
        },
        {
            "review_text": "Short game with an emotional story, nice music and some puzzles. You also get some information about the first world war.   In the end:  1. Lie Down  2. Try Not To Cry  3. Cry A Lot",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very in depth and beautifully brought to life. The sound track is just as good, it brings out the environment even more.",
            "review_score": "1"
        },
        {
            "review_text": "This game is art. Wonderful graphics and animations with suitable soundtrack, great game mechanics and story. Definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A sidescrolling puzzle game set in the Great War. Does not contain propaganda against any particular state or nationality, only against war. The story is about people trying to survive the mayhem. The game contains a lot of factual background information about the events the characters are part of in the western front trenches and countryside. Not a very long game, but quite worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say.. Fantastic game, incredible and heartbreaking story, beautiful design and soundtrack. It's a game like none other, and if you don't have it already, buy it. Believe me it's worth the few dollars (or euro's, pounds, .. ) and you get to play one of the best games you'll ever see.   ",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the most emotional games out there. Does the opposite of most war games and really tries to show how painfuil everything is. Great art style, the cartoony style makes it slightly less heartbreaking. Recommended if you don't mind shedding a few tears.",
            "review_score": "1"
        },
        {
            "review_text": "My Review for this Game and experience, One of the most cunning and beautiful games about family and friendship during the war showing the true horror of war and how ti rips you, your friends and family apart. How it will destroy humanity. These characters of firends and family suffered the most horror and suffered tragic losses even when they aren't a soldier themselves, they were still affected deeply by the pain of their family memebers and friends who served.  This Game shows everything that war is, no glamorisation at all, showing the true colours of war. Blood, Death, Madness and Suffering and a whole lot more. Its representing how both sides felt, both The Entente and the Alliance showing both pain and suffering by both. It is factual, true events took place as well as even including facts with story boards about the parts of the war and the battle that took place.  This game made tears come to my eyes as i grew attached with the characters and understood them with their bravery, their heroism and also their suffering. This is one of the games where I cried and became emotional which is quite rare for me but, I'm not the only one in this situation as others have experienced the same feelings as me.  The game may not be a long first person shooter where you can play it all the time, but a short campain which can be completed in 5-7 hours of gameplay and even longer if you wish to get all the little pieces you can find in each chapter. As short as it is, it packs a punch and you can learn alot from this game about what WW1 was all about.  Stop complaing about Uplay, there is no point crying over it and being a sook. The game was well worth the price on sale but perhaps wait for it to be on sale rather than getting it for its original price as it is a bit expensive.  All in All i loved this game and really enjoyed the puzzles and the connection and learning I developed with the characters and chapters of the game.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game, set in WWI, that includes:  -clever gameplay  -excellent comic book art  -emotional music -a touching story that will leave you sorrowful. Highly recommended!",
            "review_score": "1"
        }
    ]
}