{
    "app_id": 260380,
    "name": "Ninja Cats vs Samurai Dogs",
    "release_date": "2014-02-21",
    "developer": [
        "Eutechnyx"
    ],
    "publisher": [
        "Eutechnyx"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Tower Defense"
    ],
    "achievements": 24,
    "positive_ratings": 24,
    "negative_ratings": 13,
    "price": 3.99,
    "description": "TIGA award nominated Ninja Cats vs Samurai Dogs combines the addictiveness of a tower defence game with the depth and tactical variety of a Real Time Strategy title. Choose your side in a fast paced and frenetic battle for canine or feline supremacy!Leading an army of Ninja Cats or Samurai Dogs has never felt so compelling!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260380/header.jpg?t=1447359221",
    "minimum_requirements": "OS: Windows Xp, Vista, 7 Processor: 1.6 Ghz Memory: 2 GB RAM Graphics: OpenGL 2.0 Storage: 700 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "So for anyone doubting to buy this, let me be clear. Yes this is a mobile port. So if you dislike these games, just avoid this one. Now for anyone else who wants a review for this game let me continue on:  This is a lovely little game. I really like it. First of all, it's just simple Tower Defence. So imagine a lot of gameplay style like Plants vs Zombies and Ironclad Tactics. You build certain building, you deploy units and they fight with the enemy. Each unit has his strong and weak point, like I said simple Tower Defence. So if you like these kind of games. You're on the right track.  Next thing I wanna adress are the graphics and the sound/music. Don't expect anything fancy here, again it's a mobile port so you have to work with that. Yet I have to say the graphics suprise me very well. Both the cats and the dogs have very good looking sprites and the units are easy to reconigize. Also the music is what really sells me in this game. Remember Okami or Okamiden? Well that kind of music is what you are gonna get in this game, it really helps to strengthen the mood.  So anybody looking for a fancy story? Well, I have to hold you there. Nothing to big of a story here. Also the controls are still set to the phone version, so swipe and wipes are expected to happen. One note I have to attach to that one is, that in some cases that might cause slight problems with Windows 8. But you can work around that.  I would really recommend this game to people who loved Plants vs Zombies or Ironclad Tactics.",
            "review_score": "1"
        },
        {
            "review_text": "Ok so no one seemed to be able to write anything up on this without seeming like a troll so here goes.  Game clearly is a port, it does have limitations, virtually no settings available apart from sound controls, ALT tabbing will take the game out of fullscreen (easily fixed by pressing ALT Enter afterwards), keybindings are locked (although this does not matter because the game is easy to control by default), and pressing ESC at any time will close the game immediately.  Theres the bad part, clearly not a huge amount of effort went into porting it, but its still playable.  The Good part, the tactics are reasonably deep, the game is not easy, comes with a fairly complicated advancement tree and from what I can see so far, quite a few missions. The tutorial explains everything in a natural way that is easy to learn, but hard to master.  Also, to the people complaining about the requests for the player to 'swipe' over a building, saying that this is impossible for a PC, they are idiots, who did not actually attempt to simply drag their mouse from left to right using the left mouse button. That is what swiping means, and despite the general lack of features, swiping works just fine.  Overall for this towerdefence genre, given its price at about 3-4 USD, this game is easily worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay! What I would expect from a actually good and fun stradegy of it's kind. Top notch for a small project and good start to a game company! Thanks for the game look forward to updates, NC VS SD 2, multiplayer, new mission, etc. if any in future as well as this companies new games put out!",
            "review_score": "1"
        }
    ]
}