{
    "app_id": 260430,
    "name": "The Four Kings Casino and Slots",
    "release_date": "2015-06-01",
    "developer": [
        "Digital Leisure Inc."
    ],
    "publisher": [
        "Digital Leisure Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Online Multi-Player",
        "MMO",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases",
        "Partial Controller Support",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Massively Multiplayer",
        "Simulation"
    ],
    "tags": [
        "Massively Multiplayer",
        "Free to Play",
        "Casual"
    ],
    "achievements": 56,
    "positive_ratings": 2056,
    "negative_ratings": 948,
    "price": 0.0,
    "description": "The Four Kings Casino &amp; Slots is a rich social online multiplayer casino gaming experience. Play all of your favorite casino games like Poker, Blackjack, Roulette, Craps, Baccarat, Slots and more! Meet friends, climb the leaderboards and win rewards to customize your avatar.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260430/header.jpg?t=1547577978",
    "minimum_requirements": "OS: Windows 10 Processor: Intel Core i3 Memory: 4 GB RAM Graphics: Intel HD Graphics 4000 DirectX: Version 10 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DirectX Compatible Sound Card Additional Notes: A 64-Bit OS may be needed depending on your available RAM.",
    "recommended_requirements": "OS: Windows 10 Processor: Intel Core i5 Memory: 8 GB RAM Graphics: NVIDIA GeForce GT 630 or Radeon HD 7950, or equivalent rated DirectX: Version 10 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DirectX Compatible Sound Card",
    "reviews": [
        {
            "review_text": "UPDATE::: The devs have seen it fit to immediately ban me from their discusson board after this review was posted. For that I warn folks who have issues to be careful speaking up. Seems this Dev likes their dirty tricks when they don't want their filthy laundry aired out.   This is my final review edit. After enough time with four kings, I have decided they have completely lost touch with the fanbase who supported them from day one. Just as they did on playstion home for six long years.  Im going to be honest here, I'm not liking the way things are going. I thought after they had their time with playstation home, we'd see changes that showed they learned their lesson last time from customer feedback.   I remember a time when DL had a casino on ps home, it was an avitar social world with literally hundreds of mini games and places to chat and play. Game themed rooms and more. They also had a casino there and they did the same thing with chips there. The games there were PLAUGED with bugs and cheaters, very little was done. However they had no issue releasing an apartment for over 50 dollars that came with the same games you already had access to in their casino and they REFUSED to change the pricing even with such negative feedback. Oh and might I add, the people who were stupid enough to buy it lost those items anyway when ps home closed it's doors this past march.  People lost thousands of chips with no rembursement, and the tournaments were a joke. You had to pay 4.99 for a tournament bracelet with no guarantee of any reward. Just a pat on the back for those who didnt make the cut, while they pocketed their real money.   I was much happier with this game during EA. Now? Theyre making the game completely un fun by catering to the new players they want to spend money. Bingo nerfs are beyond terrible.  Im now seated at a progressive game with over 25 players. The pot would usually be over 100k. It isn't even breaking 40k right now...and rp payouts are the same as the main floor games.  The people who bought in during early access are being pushed away to cater to the casual player with a spending problem.   I have taken a break from four kings and returned today to see if the nerfs were truly as bad as they say, I'm unhappy to report they are far worse than what players are complaining about. I remember sitting at bingo for hours, and not having this back of luck either. One could say it comes and it goes, but this is just ridiculous.   I was quick to respond to a gent who made a post on how this game is not only exploiting potential gambling addicts, but nothing more than a cash grab. I really would like to recall that person's username, so I can apologize and say they might be right.  Because the players who bought into this game and made is possible for it to even make it out of early access are being disregarded. If this is what developers plan to do to people who buy into their games in order to support a title, I am swearing off EA games entirely. Because this seems to be a NASTY habit with devs on here. They bend over backwards during EA, but after they get your money all bets are off.",
            "review_score": "-1"
        },
        {
            "review_text": "*Edit - I removed the con about Bingo because it seems they have been working on it constantly for the better. *Yay*   Alright, so I figure ill just say this is by far one of the better free casino style games i've played. So with that being said, ill give you all a Pros/Cons list.  PROS 1- *AMAZING COMMUNITY* - the devs are vocal with the community and are actually in game talking with players, I had a great conversation with one not long before posting this, which made me decide to actually post this review. This alone should be enough for you to at least check out this community.  2- Assortment of games - Games from Video Poker, blackjack, Keno, Slots and various table games. Pretty much you'll find the most common table games   3- Atmosphere - The piano music playing casually in the background while playing Baccarat. Or when you walk by the bar and see some players having a casual chat about their luck. This game completely nails the feeling if being inside a casino.   Cons - honestly not really things which ruin the game or make it bad, just small quality of life things which can honestly be patched in over time. *shortly before this posting the bingo room had a patch already fixing one of my biggest gripes*   1- Running animation - good lord the run cycle on player models.... I just feel they need to be redone completely.    There's some various tiny things with the player model and items, but its so minor I don't feel the need to bring it up.     Overall feeling about the game?? I highly suggest anyone thats interested in playing an accurate casino style game download and try playing. You have nothing to loose except your chips if you're not lucky!! Like no joke, its free and amazing for what it is. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the most fun I've had with a free game in a while. There are lot's of games to choose from. An immersion element definitely exists. The developers definitely made the experience feel authentic. The gameplay is smooth, and if you play with friends, this game will provide you hours of entertainment. Whether you're a casual player or competetive, there's something for everyone. If you don't want to waste your chips, there are plenty of opportunities for free games, not to mention you get 250 free chips every 15 minutes.  Some of the negative reviews I have read did not represent the game properly. Download the game, grab a couple buddies and find out for yourself. It's a free game. Try it out, I definitely recommend it.   ",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a decent casino game which is fun, stable and playable with friends, keep looking, because this is not the game you're looking for.  The game is not stable at all, I felt like I was testing an unreleased game. Out of thin air crashs, freezing game tables, countless lost chips due to casino's errors, took away the tad bit joy it created.  Shall I mention that the BJ dealer is cheating like %80 of the time? Let me. This one time, I am playing table limit, my hand is 20, dealer's upcard is 3. OK, losing is something possible and acceptible, even in this situation, but what is 3 + 2 + 2 + 3 + 6 + 5 = 21? How's that even possible? Every single time I hit on 12-13 I bust, when dealer hits, it's a 21.  I've been playing BJ and frequenting casinos more than seven years, and believe me, I've never seen a shameless blatantly cheating BJ like this.  Video BJ is weird though, I presume devs forgot to fix that machine, nearly %60 of the time dealer busts.  Video Poker? Scam of the century. Lot less profitable than real casinos.  It's a game after all, one should get free chips to sustain a cashroll, or enough to create a base when outta chips. (which is a strong probability with cheating machines) All you get is 1000 from daily if you've log in on consecutive days, 250 free chips every 15 minutes, or various amounts from daily tasks (average 800 chips daily).  Oops, then what you gonna do? Can't even borrow from friends! 'You should buy chips', they say. Dude, if I want to pay for chips, I'd be at a real casino, not here. And what happens if I gain more chips? Nothing. I can't even give away my chips, which is totally nonsense.  But give the guys some credit. The whole concept of casino is about sucking money, and here you see casino combined with f2p, it tries to suck even more. Way to go, devs.    Overall, decent graphics, nice variety of games, cheating AI, scamming devs, borderline braindead community. Stay away from this game as far as you can.",
            "review_score": "-1"
        },
        {
            "review_text": "Easily one of the best social gambling games Ive ever played. You create a character, roam around a casino and play various casino games such as Roulette, Slots, Blackjack, Poker, and so on. You unlock items for your character as you play games and reach milestones and get achievements. There is zero pay 2 win aspects to the game. Its free, you have the choice to buy chips, but you arent forced to. Not only are you not forced to buy chips, you get free chips every 15 minutes plus free chips from doing daily/weekly activities which vary from playing 5 hands of Blackjack to just simply changing your outfit.  All in all this is an extremely fun and addicting game and the fact that its free2play is a huge bonus. This game does not deserve the negative reviews it has recieved so do not listen to the reviews. Download the game for yourself and give it a try. Better yet, grab a couple friends and gamble together!",
            "review_score": "1"
        },
        {
            "review_text": "Okay, it's like you're in the casino. Alot of games including blackjack , poker, bingo , craps , roulette and slots.  You have your own avatar which you use to walk around and transision yourself into lobbies of the respective games mentioned above. Apparently , the only 'endgame' as in a real life casino is to win big. But in this game , the chips you win e.g poker , i was in a table and by slowly eliminating the other 4 players ( due to their arrogance ) I won everyone ( you can see my screenshots ) ended up with 150k + chips poker ingame. ( we all started with 50k ) When i exited i had 20k chips on me while before entering i had 6-7k and gave 5k to enter the game.   No clue how the chip thing works but still.  Also , only way to spend your hard earned chips is by buying clothes. But not with the chips. With another currency i'm still unfamiliar with.  Graphics are meh Lag is fine You get lost in the games !Players started cursing at one another!  It's free , worth trying out if you like casino games.",
            "review_score": "1"
        },
        {
            "review_text": "I loved gambling games on console with my real-life broseppis' back in the day. Caesar's Palace &amp; Golden Gaytime Nugget on PS1.  I played this at my last clan marathon &amp; I was overwhelmed with how nice this game is. I made good coin on the Chocolate wheel, tables &amp; Keno. I encountered no bugs, no problems, no errors.. Character creation is super dank. Art style is super dank too. I bumped into 100 people online, tables were full. The game was a joy to play.  I hit the 'Follow' button on all the games I own. This gives you notifications about updates, news &amp; patches etc.. I installed this game close to the release date. I'm absolutely astounded by the dedication of these Devs. They've persisted through a great deal of negative reviews &amp; since inception they eat, sleep, breathe, repeat this game. They have released new patches almost every day now for weeks.  This is free.. there is no pay2win element. Grab a friend, make an account.. go play.  10/10 would Fedora tip again.",
            "review_score": "1"
        },
        {
            "review_text": "I like it. I'm broke already, no different than in RL.",
            "review_score": "1"
        },
        {
            "review_text": "Love it! Play WAY too much haha",
            "review_score": "1"
        },
        {
            "review_text": "Well, I will update this review and recommend this game, it can be played without spending any money and you can choose which games you want to play.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is nice. I enjoy the real casino vibe it carries. Almost all of the social aspects of the game fall totally flat. Like your complimentary apartment, and the dance club. There are zero reasons to go there. I walked around the apartment and you can't do anything except sit on things. I didn't even notice any customizable aspects to it.   Pros.   Real Casino simulator in how you walk around and play the games. Seems like most of the games simulate real life fairly well based on my experience with those games. Poker is always agaisnt players so it is the 'fairest', although it falls victim to all fake money poker games out there.  Cons.  Blackjack. Holy crap... the blackjack.   This game however is totally broken. The dealer draws to 20 and 21 an INSANE amount of times. It regularly draws to 20 and 21 with 5 and 6 showing. The worst cards it can get. The dealer also ends up with 20+ so often that you simply can't win even a 30 minute sitdown of basic BJ play. I have played basic BJ rules, and in real life you can expect losing streaks of up to around 6 hands in a row. More then that gets mathmatically inplausable, although 7 or even 8 could technically happen if you played for long periods of time. This game however has gone on multiple 10+ hand losing streaks. I have seen three 10 hand losing streaks in the last 2 days alone and Iv only dared play it a handful of times. These happen in less then 20 minutes of playing. The odds of this happening should be impossible, but it happens regularly. 10 unwinnable hands in a row when you play basic BJ. I always play solo at the table to exclude any player errors. Do NOT play BJ in this game. Unless you are only going to play 3 or 4 hands and pray for a win. But for real long term tight play, its useless.",
            "review_score": "1"
        },
        {
            "review_text": "Yay lost everything in 10 minutes XD",
            "review_score": "1"
        },
        {
            "review_text": "Quite a good game for its current stage.  some Cons are that you have to create an account in-game aswell :/. but thats not too bad. i'd like the game even tough i only played like 30 minutes. i tried to join some poker tables but they where all full. and i didnt understand on how to join another lobby.  but it's still a good game and for me the best casino game on steam!",
            "review_score": "1"
        },
        {
            "review_text": "I'm actually finding this game very entertaining,have not HAD to buy anything as of yet and that is a BIG plus!! Finding the lag in some areas a bit bad,but other than that i really recomend this to all the poker players out there that just want to relax and have fun for a bit.",
            "review_score": "1"
        },
        {
            "review_text": "It is still very buggy, especially during table winnings and calculation transitions. However, the feel of the game is pretty solid. I think improved avatar movement and camera from a first person view could add to the immersion of the poker and blacktop tables.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best casino game I've played so far! Totally recommend it. Hope to see more interactivity, the main reason why its so interesting because you get to interact with players. The developers are really helpful and attentive to the players. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game!!! I found The Four Kings Casino while searching for a game i could play together with my son ... and i've found the best place to play several casino games, hang out with my son &amp; meet other people from all around the world :). It's a very addictive game... a place where i wish to come back every day and whenever i can to play &amp; meet my friends. There are slot machines and other machine games like video poker or video Blackjack, you can play Bingo together with up to 40 players, play Blackjack, Poker or War at 6 player tables and many other games. There is never a moment of boredom as you have many goals such as daily &amp; weekly tasks, Tiers, Steam &amp; In-game achievements, tourmnaments, and more. If you should get tired of playing &amp; chatting you even have a hotel room where you can have some time for yourself. True, this game also has bugs and glitches, such as people getting disconnected (if you loose chips don't worry, i've lost many and all of them have been refunded), but this game has a good Team of dedicated Developers who care about making this game a wonderfull experience for everyone :)",
            "review_score": "1"
        },
        {
            "review_text": "The devs have officially fixed all the problems I've been having with this game and will now get my A+ apprroval. Played for a bit with a single crash or bug.",
            "review_score": "1"
        },
        {
            "review_text": "The devs have officially fixed all the problems I've been having with this game and will now get my A+ apprroval. Played for a bit with a single crash or bug.",
            "review_score": "1"
        },
        {
            "review_text": "i like alot about your game but i don't like that there is only one free poker table and noone moves off it to give anyone else a turn to play it and i would like to see a bartender and have music playing or a dj in the night club. give people more of a reason to hang out instead of just gambling all the time make more social actitives  ",
            "review_score": "1"
        },
        {
            "review_text": "Keeping in mind that this game is free. It's not bad - You get chips every 15 minutes i think it's about 200 you get so you'll be able to play the slots or blackjack - poker is a bit more expensive. You get chips for doing little tasks - you get chips daily too so they give you enough to make it interesting  However the creators do need to make money so don't expect to be swimming in chips because it won't happen (unless you're willing to pay) But all in all not a bad game",
            "review_score": "1"
        },
        {
            "review_text": "GOOD game for getting ready for the real thing",
            "review_score": "1"
        },
        {
            "review_text": "ilike it  and ihope u add 3cards poker and 5cards poker",
            "review_score": "1"
        },
        {
            "review_text": "Buggy at times but are still a pretty decent betting game",
            "review_score": "1"
        },
        {
            "review_text": "Really liked it!",
            "review_score": "1"
        },
        {
            "review_text": "very fun game very addicting",
            "review_score": "1"
        },
        {
            "review_text": "This game is epic, it allows one to learn games responsibly and have as much fun as in a casino from my perspective. Better odds also, didn't lose 3 games in a row at low stakes and don't even want to try anymore.",
            "review_score": "1"
        },
        {
            "review_text": "This game is rigged, great concept, but too bad they want you to pay for chips. Terrible for people with a REAL gambling addiction. I have a good feeling I could go to Vegas and win more than you can in this ♥♥♥♥♥♥♥t game. Don't gamble, highly unrecommended. ♥♥♥♥ this game. I'll rewrite this review when I don't lose to the dealer who got 19 to 21 roughly 15 hands or so in a row. Give me 20,000 free chips, then I'll give this game a good review.  EDIT: Got lucky at poker and blackjack, now I'm rich. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun casino MMO. Basicaly F2P with free chips available every 15 minutes &amp; daily.  If you want to gamble VIP, it's probably needed to buy chips at some point.  Devs are active and pretty supportive.  9/10 - first such game I've seen on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, fun and entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Very chill, but fun game :)  Very good with freinds.  10/10 råted by igNnn xddddqvikskopz",
            "review_score": "1"
        },
        {
            "review_text": "Lots of free chips, and if you were inclined to spend money then the rewards vastly out number the cost. Generous devs and a great community.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Social, aesthetic, leader boards, etc. I love it, thanks for the free fun.",
            "review_score": "1"
        },
        {
            "review_text": "Kill ur time, if u have plenty...",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Keep in mind, it's still early access, and its FREE! Needs more variety of games, there is only one of each type(888 Video slots, Jacks or better Video poker, jungle Video blackjack) and it will be GREAT! I do like the social aspect, I love casino games, but this is the first I've played with other people online :)",
            "review_score": "1"
        },
        {
            "review_text": "As someone who is new to gambling, i was able to understand the different games from the Help Section each game has. Aside from gambling the Social Aspect can be fun when a big mass suddenly starts dancing on each other. Con is this got me addicted to gambling",
            "review_score": "1"
        },
        {
            "review_text": "IT FUN",
            "review_score": "1"
        },
        {
            "review_text": "Alot of fun specially with friends favorite thing to do is dance on the stage as a old black man in a blue hoodie mumbling hotline bling",
            "review_score": "1"
        },
        {
            "review_text": "can't stop play",
            "review_score": "1"
        },
        {
            "review_text": "I was totally shocked by the game. I expected a badly made Unity game but in reality it is a fun 3d based Casino that has many different game types and also has a feature where you can have your own room inside of a casino that includes a usable toilet.  You can also win money really easily but just as easilly lose it. on the bright side you can get free chips every 15 mins.",
            "review_score": "1"
        },
        {
            "review_text": "Mostly a small but fairly true to lfe casino game, though the Blackjack does not have wins for 5 card monty which i find a pity and I also disapprove of the dealer being allowed more than 5 cards to to make its 17 in Blackjack",
            "review_score": "1"
        },
        {
            "review_text": "I went into this game expecting total ♥♥♥♥♥, but it's actually surprisingly fun. Especially with friends.  You get to customize a character, you have your own hotel room, the environments are beautiful, and the games are pretty damn entertaining. I expected to have microtransactions shoved down my throat at every turn, but the starting money is generous and unless you really suck at gambling, it's hard to lose those starting funds (free chips every 15 minutes, free bingo games, chips lying around the casino, and dailies/monthies help earn anything lost back as well). Only other transactions were minor and completely optional, mostly cosmetic.  I don't have many complaints, honestly. I hope to see this game grow and improve, as there's plenty of ways they can expand the experience. I might actually put money into the game purely to support the model they have going. Keep up the good work, guys.  In short: 10/10 would make friends ragequit by beating their ♥♥♥ at bingo again.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of enjoyment when you have nothing else to do. I'm not too sure about all the crazy head things that people are choosing to reflect their personalities. It just might be something more to it. But, hey, to each their own. Great game!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addicting game.",
            "review_score": "1"
        },
        {
            "review_text": "Who needs rehab when you can gamble fake money?  Then put in real money to earn more fake money?  10/10 gambling problem confirmed",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun out of ten.",
            "review_score": "1"
        },
        {
            "review_text": "Got a nice feel to it, cool to be able to walk around among the players and sit down and join the tables or just go to ur hotel room and relax. Also alot of ingame customisation for ur avatar which is nice.  And ye u win if ure a playa (poking Video BlackJack T-shirt) =)",
            "review_score": "1"
        },
        {
            "review_text": "Really Fun if ure into gambling",
            "review_score": "1"
        },
        {
            "review_text": "now i can gamble all my money away without gambling all my money away!",
            "review_score": "1"
        },
        {
            "review_text": "Played it so far it looks to be cool reminds me of hoyal casino that game was a blast you guys should add horse raceing",
            "review_score": "1"
        },
        {
            "review_text": "Thank you for feeding my gambling addiction.",
            "review_score": "1"
        },
        {
            "review_text": "game not bad for a free game havnt had any problems like lots of others have had game is what it is something differ to play  ",
            "review_score": "1"
        },
        {
            "review_text": "It is fun. #gamble",
            "review_score": "1"
        },
        {
            "review_text": "not bad for a free game...just to burn out time btw where is the BACARAT table?",
            "review_score": "1"
        },
        {
            "review_text": "After going around and more you realize well this is fun and all you need to do is socialize with the community and this game has taught me how to play certain casino games yes theirs bugs and stuff but still it doesnt mean the game isnt bad really sense well the developers are doing their best and also most of the community is nice so feel free anyways this is a really fun game to play on in your spare time.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of games, lots of clothes, lots of big wins!!! and lots of big losses!! Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "It is exactly like playstation home with gambling 100% free to play are you can buy chips. you get 250 every 15 minutes and missions to get more chips so kinda hard to run out. The game is kinda buggy do to it being first day but highly recommend this game to people who like to gamble. They seriously have everything in this game",
            "review_score": "1"
        },
        {
            "review_text": "4ever loading screen, 10/10  edit: tbf i'm using a dino cpu",
            "review_score": "-1"
        },
        {
            "review_text": "I came to play craps. The mechanics of betting craps does not work. I'm pretty dissapointed. but this could always improve in the future hopefully.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly helpful GM staff, social community and solid gambling games. If any bugs occur, the GM staff are more than helpful. Would recommend over most other gambling games.",
            "review_score": "1"
        },
        {
            "review_text": "5/5 Stars. It is a great game free or not. There is a nice social aspect and a wide variety of games for people to play. I also enjoy how the game tells you the rules of the games. The daily and weekly tasks are a great way to earn extra coins and keeps you learning new things about the game. They have cool events like a real casino. Once when I was playing, they had a free bingo game. Definately entertaining if you like casino games or slot machines.",
            "review_score": "1"
        },
        {
            "review_text": "this game is really good for waisting spare time you have. It has a really nice style very similar to Playstation Home on the ps3. The only thing thing i dont like it that the clothes you can buy are mostly over priced and need to be lowered, but to be fair its realisitic. i would rate this game a 6/10 maybe 7/10 if the clothes get lowered",
            "review_score": "1"
        },
        {
            "review_text": "This game has more problems then a bad dream. If not glitch or flying around in blue room or remote does not work or mouse and takes your money.I have made report of the ♥♥♥♥ never getting fixed I was really liking the game tell ♥♥♥♥ started. I say thumb down to this crap!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Really good game to relax. If you like Casino Games, Poker or Card Games in general with a bit of Character Role play into the mix, you´ll love this game. The only thing that is bad on the game is the optimization, its not very good, but its playable if you find the right settings for your machine.  I´ll rate it a solid 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun way to hop in and waste some time. 8/10 Would play lose all my chips again.",
            "review_score": "1"
        },
        {
            "review_text": "I had a dance party in the bingo room...  ...with a group that looked very similar to Nsync  and there's poker too!  ---------------------------------------------------------------------------------  Okay, for reals, this game is good! I have never found any gamebreaking bugs anywhere or I have never been forced to pay at any point (heck, the only things I've found that you need to pay for were the cosmetics.)  Pros: Decent explaination of how to play the various games.  Emphasis on the SOCIAL aspects of the games. Note the bingo room dance party.  Virtually nonexistant microtransactions. You can buy clothes that do nothing if you would like to support the dev.  The game throws more free money at you than a rapper in Scrooge McDuck's money bin. No joke, one of the tasks says 'Get your free daily credits -&gt; Get 250 free credits' They give you money FOR GETTING MONEY  Cons: Its nigh impossible to join a poker table. There's so many people trying to play the 'Daily Free Poker' that it looks like a rugby game  I know this is nitpicking but I wish there was rave music in the Nightclub but thats just my opinion, take it with a grain of salt.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game where you can gamble with friends and have fun. Chips are not too bad to earn and are not too expensive to buy.",
            "review_score": "1"
        },
        {
            "review_text": "Its realy nice to kill time",
            "review_score": "1"
        },
        {
            "review_text": "Good games and graphics but games crash WAY too often. Do not spend actual money till they get this fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "an incredible shame that this is the only multiplayer gambling game on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "lost several thousand dollars sitting on blackjack tables due to glitches where things stop working and having to leave the table. Considering I paid $5 for the currency its not 'alot' but it is annoying and if it was a larger investment I would be marching to guest services and ♥♥♥♥♥ing to high heaven,..",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a macho sissy.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure why there are so many positive reviews for this game, because I gave it way more of a chance than I would normally for such a lackluster game.   The graphics are taxing on my hardware, despite them being at their lowest. (for reference I can run Planetside 2 at 35FPS with this rig.) That is beside the point though. There is a game here, where you can go almost anywhere you'd go in a normal casino, and you get 250 free chips every 15 minutes. The theory is solid, but the execution is inevitably boring.  Walking around with 400,000 chips from my slot jackpot, I found that there was absolutely no way to splurge my money. I played literally every game in the casino 20 or so times and still couldn't throw away my money. That's not a bad thing, but normally in my situation, a player would be having major fun. I think it's the fact that there is NOTHING to spend chips on aside from the crappy games that take forever to even get going. Once I got into the VIP area, I figured all of this would be different... but the VIP area is just the same as the non-VIP area with 2 different games and the same level of boredom. I would say the rating system kept me going, but there was no actual pride to be had with it... yeah I'm tier 12 at poker.. what do I get? Nothing. Tier 25? Nothing. Lets not delude the fact that even if there were a prize, there would be nothing to do with it  In summary, the game is a borefest with a casino skin. If you like sitting around pretending to play poker and blackjack, then this game might be for you. But if you are a normal human being who enjoys mental stimulation... Steer clear of this waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "I NEED THE F***KING NASA COMPUTER TO PLAY THIS GAME D: 11/10 I STARTED TO DANCE AND EVERYBODY DANCED WITH ME :D",
            "review_score": "1"
        },
        {
            "review_text": "Urgh, why? The premise of this is an interactive casino game, but most web-based casino games already have chat, 3D avatar 2nd life style avatars with crappy models do not cut it in 2015. Worst of all, the game simulates real-life casino problems of full tables and waiting times, which invalidates the whole point of playing fast games online in the first place. Would-not-play-again.",
            "review_score": "-1"
        },
        {
            "review_text": "Now all they need is to let you cash out real money......",
            "review_score": "1"
        },
        {
            "review_text": "GG. Got addicted to gambling",
            "review_score": "1"
        },
        {
            "review_text": "This game seems really cool. The problem is that i cant sign up. it say's when it sends the verification email it states 'We promise that it has been sent' in the home screen. when i look at my email, it's not there at all. normaly, a game or subcriptoin will have a link to resend the email. This game say to use a different email adress. not all people have two email accounts! sometimes you get kids who want to play, and probably only have partial acsess to his dad's or moms account. and if it doesnt send the email, there out of luck. they cant play. i would only reccomend this game if you have more then one email account.",
            "review_score": "-1"
        },
        {
            "review_text": "Due to a bug with the game system and its machines giving a higher payout than the devs wanted they took away all the money that i earnt playing for hours on this game without any warning. This is a ridiculous and stupid way to deal with the problem. If the devs are just going to mess about with the players then it isnt worth playing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "After your start coins are gone you have to buy more, or do daily tasks, some involving haivng coins to start with, or stand at an ATM every 15 minutes for the free 250 coins. Since Bingo is 3500 coins PER GAME, you will be hanging around for hours just to play. Pretty much a game of microtransactions.",
            "review_score": "-1"
        },
        {
            "review_text": "Microtransactions on top of microtransactions on top of microtransactions. Don't be fooled by the 'free' price.",
            "review_score": "-1"
        },
        {
            "review_text": "It can be a very good game but unfortunately the games are rigged or i am the most unluckiest person in the world!",
            "review_score": "-1"
        },
        {
            "review_text": "It can be a very good game but unfortunately the games are rigged or i am the most unluckiest person in the world!",
            "review_score": "-1"
        },
        {
            "review_text": "fun game but chips are a little hard to come by so play smart",
            "review_score": "1"
        },
        {
            "review_text": "From the ashes of Playstation Home comes The Four Kings Casino and Slots.   When Home's closure was announced near the end of 2014 its 3rd party Devs, one of which was Digital Leisure, freaked out and quickly started up new projects since their easy cash stream was about to go bye-bye. Digital Leisure opted to turn their Paradise Springs Casino area into a stand alone game. So they rebuilt it and renamed it The Four Kings Casino and Slots. As an attempt to lure Home users to it they decided to try and emulate Home. Sadly though they decided to emulate Home as it was near the end of its life. So the game is a bit shoddy, users suggestions are ignored most of the time, and they're more interested pushing cash store vanity items that have sod all to do with a casino (like pets and doofy avatar zoning in and out animations).  Like Playstaion Home was, this game is something that could be fun but is ruined by the cheap cash grab mentality of the Devs.  Cannot recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "sucks but its free",
            "review_score": "1"
        },
        {
            "review_text": "Rigged, all they want is your money...",
            "review_score": "-1"
        },
        {
            "review_text": "i give this game one black guy giving thumbs up out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with friends! Enjoy playing for hours.  One of down falls is and i want to see changed would be you can't play poker with a friend if you are on the same ip.  Oh and if im pay for the auto dobber to mark spots the least you can do is cfg it for each board, i'm sick of removing the wrong marked spaces.( I mean really i work harder removing the wrong space than i would just dabing the spots myself)!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "-1"
        },
        {
            "review_text": "super fun. not as rigged as other casino games.",
            "review_score": "1"
        },
        {
            "review_text": "I have played facebook casino games with better odds than this. Buggy to the point that tokens won't be paid out, happens alot. Just no, hit the unistall and i will be promptly walking away from this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Talk about rigged much, this game begs you to pay for chips. I have played this one both the PC and the PS4 and both times the winners are people who openly admit to spending money on the game in order to win. One guy won bingo then proceeded to say 'Shame f2p people can't win as easy as I do, oh well I paid lol' The concept is SPOT ON and I would love to play a game like this on a regular basis but the fact that the games take all your chips until you are forced to buy chips is absurd. If the DEVs can get off their high horse and let EVERYONE play the game with the same odds then I cannot recommend this game.   (They even advertise that if you join VIP you will be able to get more perks and money.) There is no hiding their greed for money.",
            "review_score": "-1"
        },
        {
            "review_text": "I played for less than an hour, mainly because I tried the poker and it was so rubbish compared to another online poker game I play often that I lost any interest in going further. The cards are not clearly outlined, I hate the interface.",
            "review_score": "-1"
        },
        {
            "review_text": "You'll keep losing untill you buy chips. Casino always wins",
            "review_score": "-1"
        },
        {
            "review_text": "I actually like this game, very buggy and needs time to fix tables glitching, etc etc. but you can always file a bug report and get your lost chips back. I've had some good fun on it. Played most of the games I like and go for bingo when I've got extra chips. Should be a very fun game when its stable. Edit: Banned on both accounts for having 2 accounts. never abused them just played more aggressively on one. Pretty stupid considering i put cash in on this game a couple times",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not a honest game. I sat and lost almost 200k in slots in one sitting. I'm sure a lot of people lose a lot of money at slots, but i seriously doubt that at 1000$ per spin, i lost it all with no winnings over $200 per win. I highly recommend going to another server to play gambling sports.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks ♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Typical casino game, never ever f**king lucky.",
            "review_score": "-1"
        },
        {
            "review_text": "Four kings is awesome !!!   there is a wide varietey of slot machine's to choose from and a small selection of mini games , the graphics are excellent and the side menu make's it very easy to adjust the graphics.   This game is very reminiscent of the casino in the game Test Drive Unlimited 2 . Sadly four kings doesnt take place in hawaii or ibiza , the game really doesn't   specify the location of the casino.",
            "review_score": "1"
        },
        {
            "review_text": "Waste your life without wasting your money!",
            "review_score": "1"
        },
        {
            "review_text": "very nice I lost my life savings simulator",
            "review_score": "1"
        },
        {
            "review_text": "Having a blast with friends, really polished for a game that i only found today and only seems to be 3 patches in.  edit: Got banned for no reason rip",
            "review_score": "1"
        },
        {
            "review_text": "I have found this game to be really simple.   PROS   - Good Avatar Development (You can customize your character very well)  CONS   - Slot Games are very limited   - Table Limits are quite high   - Variety of Table Games is Low - Games Bugs Out occassionally causing you to restart game  - Apartment is limited in funtionality   - No Mic Support (Basically you only talk with text)    If this game is completed its garbage, however if this is still be worked on it's a good start that can be very good when finished.",
            "review_score": "-1"
        },
        {
            "review_text": "After like 30 minutes loading, I got into the game. Soon after that, the game crashed.  Kewl~",
            "review_score": "-1"
        },
        {
            "review_text": "I mean, it's free to play?",
            "review_score": "1"
        },
        {
            "review_text": "Really no report or contact after you choose a new username for me!!! I supported your game and actully gave you $. I am not going to play with the creepy name you decided to choose for me. I like the game style but until you fix my username I am out and I will post this viral with screen shots of how other players pass your filter but I anger someone in poker and nipple is offensive?",
            "review_score": "-1"
        },
        {
            "review_text": "Simply put, it wouldnt even let me get started. It claimed i already had an account which was false, and when i tried to change whatever password it thought i had it just kept coming up with error messages. It's nothing but a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Really enjoyable free game",
            "review_score": "1"
        },
        {
            "review_text": "Game cheats. I won a bunch of money, over 100 grand, and then it crashed.  Went back in to find half my m oney was gone, and then I didnt win a single hand or spin for litterally 30 minutes.   Rigged. Just like Vegas.  10/10 realistic 10/10 fustrating 10/10 burn the place down, it took all my damn money.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has an extreme amount of lag and crashes very often.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically you have to pay for ingame chips as all things dont pay out",
            "review_score": "-1"
        },
        {
            "review_text": "ABSOLOUT ♥♥♥♥♥ RIGGED TO BALLS SO THAT YOU HAVE TO PAY REAL MONEY IF YOU LOSE YOURS. IF YOU LIKE TO WAIST HOURS OF TIME ON A RIP OFF FROM PLAYSTATION HOME THAT LOOKS TERRIBAL WITH CHEESIE CRAP MUSIC THIS IS STILL NOT THE GAME FOR YOU, I ERGE YOU TO FIND SOMETHING DIFFERENT TO PLAY DONT BOTHER WAISTING YOUR TIME EVEN LOOKING AT THIS GAME IT IS A WAIST OF SPACE ON THE STEAM PAGE IT ISN'T EVEN WORTHY TO BE FREE. THIS GAME IS SO TERRIBAL THAT EVEN BORRIS JOHNSON WOULD NOT PLAY THIS! IF YOU LIKE YOUR LIFE DONT DOWNLOAD IT. THIS GAME IS ABOUT AS FUN AS AN ANURISUM WHILST RECEVING A LAP DANCE FROM SUSAIN BOYEL. CUSTOUMER SEVICE IS AS USEFUL AS A TURD FOR SHOES AND THEY ARE JUST AFTER YOUR MONEY THEY ARE MORE CORRUPT THAN BANKERS AND I WOULD LIKE TO CALL THEM THE SAME BUT SWAP THE (B) FOR A (W).  JUST A BLOODY MONEY GRAB!!!   UNINSTALLED.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible ervything is high priced and you really dont win much. Bought 50,000 coins and they are gone. Theres not many games to play also. Needs lots of work",
            "review_score": "-1"
        },
        {
            "review_text": "I lost all my money against a women with a horse's head 10/10 would play again if only I didn't sell my house",
            "review_score": "1"
        },
        {
            "review_text": "The Games are over priced, you only get 250 chips ever 10 - 15 min. if you max bet on alot of games you lose. Bngo is hard to win at. the only tables that are kinda easy to win at is War and craps but you have to bet high to even break even. they offer 400,000 Chips if you pay $20 and 5,000 Chips for $0.99. Once you run out of chips you have to stay ingame to collect your 250 chips from the machine. I both Dont Recommend and Do Recommend this game. If you cant afford to buy chips then this games not for you. But if your able to buy chips then play away. Ive been bankrupt 4 times and had to stand in the game for over an hour just to even have chips to play any game. Bingo prices start at 1000 chips and go up to 5000 chips.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall fun concept, however if you have the misfortune to run out of cash the game becomes very not fun. Basically you get to hang around for 15 minutes doing absolutely nothing waiting for a measely $250 (5 hands of blackjack). Sure you can Play 'Free poker' ... ONCE per day. Or free slots ONCE per day. At least free bingo comes up about once an hour. Can't see what would be harm in allowing Anyone with sub 1K chips in free pulls on the Free slot or to play free poker... but I guess they just want you to get frustrated and pay real money for fake money... that or just quit.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall fun concept, however if you have the misfortune to run out of cash the game becomes very not fun. Basically you get to hang around for 15 minutes doing absolutely nothing waiting for a measely $250 (5 hands of blackjack). Sure you can Play 'Free poker' ... ONCE per day. Or free slots ONCE per day. At least free bingo comes up about once an hour. Can't see what would be harm in allowing Anyone with sub 1K chips in free pulls on the Free slot or to play free poker... but I guess they just want you to get frustrated and pay real money for fake money... that or just quit.",
            "review_score": "-1"
        },
        {
            "review_text": "They say the house always wins and thats true with this game. I am pretty good with blackjack but i constantly pushed or lost because they pulled a 21 out of their butt. Anyways i like how its multiplayer so you can play with friends, but thats about it. Overall a waste of time and no even your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun and social game! Feels almost like a real casino:)  10/10 would gamble again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is clearly extremly pay to win if you have any gambling problem what so ever dont download this game its fun for 5 minutes a day if that thats about it otherwise get ready to go bankrupt in rl.",
            "review_score": "-1"
        },
        {
            "review_text": "blackjack it UNFAIR AND THE DEALER WINS TO MANY HANDS HOW CAN THE DEALER REPEATEDLY GET 21S to my 20s???????? dealer gets lots more blackjacks then i do if it was randoms the dealer and i should get close to equal amotnu of blackajcks",
            "review_score": "-1"
        },
        {
            "review_text": "Compared to other 'cashinogames' this game its really hard to run a profit on most things, as it should be imo.....  alas there arent that many different slots and such, but this game is only starting so yeah.....  imo, its quite doable free... if youre not gambling too high heheh.  i was always looking for osme casual game where you can fil lsome inbewteen time with, this is perfect. it eats up my monies, but like i said, a casino should be like that. if it were too easy to profit, then the point wouldnt be there right ? :D",
            "review_score": "1"
        },
        {
            "review_text": "Played bet my chips lot it all couldnt play",
            "review_score": "-1"
        },
        {
            "review_text": "decent game lots of fun except for the community in general. my lady was stalked by this guy.. following her everywhere, getting between her and machines, wearing a horses head. finally i said something politely about him moving on and he cusses me out.. and I'M the one that gets reported and warned for abusive behavior in chat. their monitoring of the community needs TONS of work.",
            "review_score": "-1"
        },
        {
            "review_text": "Too hard to be VIP I wish there is Baccarat for non VIP'S",
            "review_score": "-1"
        },
        {
            "review_text": "Can't log in. Try to reset my password, Say's Email Wrong.  GG. IGN 10/10. I Personally 0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Ummm... yea... you dont give a pop up on what the commands are for each game?  Go back to the drawing board, noob game devs.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun, but it can get a little annoying. It's a basic simulator so all the games work fine, but I cannot seem to find Baccarat in the casino, which is a shame because I really like that game. There's also no way that I've found to turn off the notification when players join and leave the server, that can get really anooying really fast when a lot of people join all at once.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is hard to start because apperently it cant accept my email address i tried ot play this game but it fails and is hard just to get started. this game this game is bad",
            "review_score": "-1"
        },
        {
            "review_text": "Really boring casino simulator - only one type of slot, for example - also a terrible memory hog.",
            "review_score": "-1"
        },
        {
            "review_text": "Really boring casino simulator - only one type of slot, for example - also a terrible memory hog.",
            "review_score": "-1"
        },
        {
            "review_text": "I have 1 hour of game play on this game and I haven't even gotten to play it. There was a problem making a username. It said the username was available but then it would say 'invalid username'. I played with this for a little bit and tried using usernames like 'gfsnhjs6885' and it still did the same thing. Then, when I finally got it to work, I never received an email. I checked my junk mail and everything and even tried to resend the comfirmation email to my email but it didn't show up. But when I finally got the email (after trying for an hour) it wouldnt let me log in. It would say 'logging in' and it would say like that for 20 minutes until I would restart the game and it would do the same thing again. I also uninstalled the game twice and it still isn't working. Do not recommend. This was a waste of my time.",
            "review_score": "-1"
        },
        {
            "review_text": "Now I can visit David's gaming tables resturant and casino without having to leave my house!!! Thanks David!",
            "review_score": "1"
        },
        {
            "review_text": "the things i dont like about this game.....  1.) theres floating coins in mid air to collect if you want them 2.) the store shops have very bland names 3.) not even a great variety of slot machines 4.) you can say whatever you want even if its racism 5.) the left shift key makes you walk instead of run 6.) there's no voice chat, everyones mouth is zipped shut 7.) you just slapped down some boring things and tried to call it good. then you demanded money so we can play more... uhh uhh.   the things i did like about this game.....  1.) the music is o.k i guess and doesnt need to be changed 2.) i liked the stair case fountain 3.) the place looked clean  the things i would want to see in the game.....  1.) the ability to drink, and eat, and go to the bathroom 2.) a men's and womans bathroom area for just that 3.) fancy store names 'be creative' 4.) the ability to use voice chat 5.) the ability to jump off the balcany if i wanted to, and when i land i want a limp look that would heal over time as a consesquence for jumping 6.) more better slot machines. ive played way better casino games than this. double down casino on facebook is what i like, and they know how to offer slot machines 7.) if i didnt know, please make the ability to own a house, or a vehical, or whatever",
            "review_score": "-1"
        },
        {
            "review_text": "I sat at free poker table for 20 min to get in and suddenly it says full.....1 word....Blows!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Updates every day, slow software. Not worth the download. Tired of the updates mainly. Every. Single. Day. There is an update whenever I open steam.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ THIS G@y GAME! I said ♥♥♥♥! and I got banned! it's a piece of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "very good nice game",
            "review_score": "1"
        },
        {
            "review_text": "Game is very good. Needs better music or the option to add your own.",
            "review_score": "1"
        },
        {
            "review_text": "very nice graphs",
            "review_score": "1"
        },
        {
            "review_text": "This is a great way to pass time and keep you outta financial trouble xD kinda... however, there needs to be more buy-in options for the poker tables. All the ones accessible by non-vip users are locked at 5k or are FREE, change some buy-ins 10k, 15k even 2,500k let me gamble more chips! ALSO the prizes are underpaid at the poker tables, 2nd place in a 6 ring 5k poker table will only make me 1,250k profit, that's crap! I spend about 30 mins on a game for that? not worth it really. It'll make poker a lot more enjoyable, trust me! - Jay",
            "review_score": "1"
        },
        {
            "review_text": "only good things to say - just stay away from the crazies although they are in the minority",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy the choice of games available. It's nice that other real players are wandering around the Casino. It seems like there is a cap on the Craps table money wise at 4000. I could be wrong or not high enough exp. or skill wise to play at a higher table..I just hope the cap doesn't remain 4000. I would like to eventually make 20000 chip bets..Good game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun. I don't like to gamble and I'm saying this. It gives you enough chips to fool around, and test out some games. If you're good you can turn those chips in to a winning streak, and never spend a real dollar! Every 15 minutes you also get a free stack of chips to play around with, so you can just keep trying your luck for free. I've even been considering putting some real money down and entering big pot poker tournaments. I even have a new strategy for Craps in the real world! (Don't try this unless you plan on losing money at the real casino anyway.) Very fun, very easy, free, socail, and better than anything you can find on things like facebook! ",
            "review_score": "1"
        },
        {
            "review_text": "take me back ps3",
            "review_score": "1"
        },
        {
            "review_text": "I installed it, 'played' with Jerma on his stream for 10 minuites, then uninstalled.  gg",
            "review_score": "1"
        },
        {
            "review_text": "Great game to pass the time away!! Easy to play.",
            "review_score": "1"
        },
        {
            "review_text": "A casino without leaving your seat. My favorite type of gambling.",
            "review_score": "1"
        },
        {
            "review_text": "I was playing video Blackjack, I had 2 hands split, all still in play, &amp; it froze right before it got to the dealer. I've read other similar reviews, &amp; I don't find that to be very good business practice; distributing a game people can sink money into, while it's still not fully polished. Fantastic concept for a game though. I can only hope they amend that with future updates. Otherwise, I see that as criminal",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and chill game",
            "review_score": "1"
        },
        {
            "review_text": "a pay to win game crap what a weak atempt at home just a knock off",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are nice, folks are friendly enough. If you're looking for a 'quiet' mmo or just a lovely little casino simulator then by all means you can't go wrong. It is free after all.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know if I'm addicted to gaming or gambling now  9/10 would dance in the nightclub for chips again",
            "review_score": "1"
        },
        {
            "review_text": "You want a digital casino that mirrors the real thing? Come on in.",
            "review_score": "1"
        },
        {
            "review_text": "fun game , lots to do . too bad i ran out of cash but that life",
            "review_score": "1"
        },
        {
            "review_text": "Four Kinghs has a good selection of Games but mosy always it is imposibile to win consistently.",
            "review_score": "-1"
        },
        {
            "review_text": "you sight is great and the place is great but the hackers mess up the whole experience. you need to have spys in the poker room and watch for crashing and the cheating that happens",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a great casino game this is it. Sure it might not have as much as some others, but it's multiplayer and is the only one I know of where you actually have a character and walk around the casino. Most of the bad reviews are just people complaining about losing, but that's what gambling is all about. You win some you lose some. You get a good amount of chips and as long as you manage your bets responsibly you probably won't run out. After 16 hours, I've only gone under the starting amount a few times, and not even by much. They also have a really comprehensive FAQ and great steam Forum presence/response time.",
            "review_score": "1"
        },
        {
            "review_text": "I like this casino and would recommend it. It would be very nice however, if they had a much better selection of slot machines.",
            "review_score": "1"
        },
        {
            "review_text": "LETS GET RIGHT IN TO THE WALLET",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun. free too ",
            "review_score": "1"
        },
        {
            "review_text": "I love the idea of this game, love the features of it, its great fun, great socializing. However I have an issues on the main thing that should be adressed, that ist he chips. The chips should be made more simple, 100 to start, then have tables that limit to 5 bet, to max. Dont have a structure but be made small.   The main thing that this game needs is a bank chips account, it be nice feature for players to deposit it in a bank vault and withdraw the need for gamble, this brings a true casino experience and can calculate their bets.  The money thing needs to be made more simple. This advice, though may seem like a small meaningless thing, will axcually make a huge difference to indivuals wanting to invest in this game.",
            "review_score": "1"
        },
        {
            "review_text": "..... How do I put this...? It's like being in an actual casino without having to pay any fees (if there are any in casinos, I never been into one so I wouldn't know if they had fees or not when entering), all in the comfort of your own home. Also, you can meet people on this game and play the various casino games with them. I played this on a console once, so I am adding the time I was on a console wtih the time I am playing it now. And so far, I think it's really good. Then again, I haven't been through everything yet so I may review this again.",
            "review_score": "1"
        },
        {
            "review_text": "Theyve made a lot of changes to make the game better, i have edited my review.. It is quite fun if you like casino oriented games.",
            "review_score": "1"
        },
        {
            "review_text": "error not logged in to steam... meanwhile im playing this game through steam",
            "review_score": "-1"
        },
        {
            "review_text": "Good fun, a few things require money but if you wanna learn how to play casino games then this is a good place to try. (Without it costing you a fortune)",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the game very munch before the last verision change, a series of vip wheels vs a percentage marker, made the game very confusing. Many players I know in the game agreed, with this new format as being confusing. The curiclure icons makes you guess, as to where you really are in the game. This makes the VIP progression extreamly confusing.",
            "review_score": "1"
        }
    ]
}