{
    "app_id": 260530,
    "name": "So Many Me",
    "release_date": "2014-07-17",
    "developer": [
        "Extend Studio"
    ],
    "publisher": [
        "ORiGO GAMES"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Action",
        "Strategy"
    ],
    "achievements": 30,
    "positive_ratings": 84,
    "negative_ratings": 6,
    "price": 11.39,
    "description": "A charming puzzle platformer starring Filo and his band of misfit clones as they attempt to save a world threatened by an ancient, malevolent evil. Using their combined powers, Filo and his fellow Me must puzzle their way through a land of exotic creatures, devious traps and evil minions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260530/header.jpg?t=1447359238",
    "minimum_requirements": "最低配置: 操作系统: Windows Vista, Windows 7, Windows 8, Windows 10 处理器: Intel Core™2 Duo Processor, AMD Athlon x2 Processor 内存: 2 GB RAM 图形: NVIDIA GeForce 7600 series, ATI Radeon HD 2400 series DirectX 版本: 9.0c 存储空间: 需要 1 GB 可用空间 声卡: DirectSound compatible (DirectX 9.0c or higher)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great visuals and gameplay. There are hats and boss battles too, lots of stuff to unlock and explore basicly. The puzzles can be challenging sometimes and this is a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "Just played it a little but I can say this game is awesome! It's cute, it's funny and very simple to play. I was really needing to play this kind of game :)  EDIT: oh yeah... the puzzles are difficult :( not that it's a bad thing :)",
            "review_score": "1"
        },
        {
            "review_text": "A really like the demo and bought the game a while ago, I left it there as I think it leverages too much on extremely precision platforming and puzzles that can end up being frustating because of the above reason. I like the challenge but nearly every single part of the game is precision platforming (when I say precision I really mean it, nearly at the 'pixel' level or you just die and repeat).   It is a shame as the graphic and characters are brilliant and I would have surely enjoyed it if it was a super mario style game more than a serie of frustating levels.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! Worth the money. Its a very cute game with so many levels.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely love this game. i love the characters, everything is so cute and its relaxing to play. really enjoyable :)",
            "review_score": "1"
        }
    ]
}