{
    "app_id": 260650,
    "name": "Cold War",
    "release_date": "2014-01-08",
    "developer": [
        "Mindware Studios"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Stealth",
        "Cold War"
    ],
    "achievements": 0,
    "positive_ratings": 117,
    "negative_ratings": 68,
    "price": 4.49,
    "description": "Steal weapons. Improvise gadgets. Evade capture. Uncover the conspiracy.The Story:On the run and fighting for your life, you are freelance journalist Matt Carter. Twelve hours after arriving in Moscow for a routine story, you've been stripped of all possessions, beaten unconscious and thrown into the KGB's political prison.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260650/header.jpg?t=1490776649",
    "minimum_requirements": "OS: Windows 98/ME/2000/XP/7/8 (x86 and x64) Processor: 1.7 GHz CPU Processor Memory: 384 MB RAM Graphics: DirectX 9.0 compatible, NVIDIA GeForce 3 (NOT GeForce 4MX) / ATI Radeon 8500 or better with 64 MB Video memory card DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectX 9.0c or better compatible sound card",
    "recommended_requirements": "OS: Windows 98/ME/2000/XP/7/8 (x86 and x64) Processor: 2 GHz CPU Processor Memory: 1 GB RAM Graphics: DirectX 9.0 compatible with 256 MB VRAM (GeForce 4Ti or higher) DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectX 9.0c or better compatible sound card",
    "reviews": [
        {
            "review_text": "First, don't mind my record times. I played it while offline.  I give this game 7/10. This game seems to be stealth game but in later levels you can play it like Call of Duty and the stealth system in this game is not good too. The good things about this game are twisted and excited story, many creative tools that you can craft them and I like idea of camera that can use as weapon as well plus the fact that main character is reporter making this idea is very creative.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't fully tested the steam version, but I have played the retail one. A thousand times. Long story short, you play as a guy named Matt Carter who is an undercover reporter and journalist who goes into Moscow to photograph a meeting with the Russian president. Then things go wrong. The game is a third person shooter which seems to, at times, feel much like the classic Deus Ex, where you can run into a room guns blazing, sneak in the shadows and knock people out, or just get from one door to the next. The conspiracy in here buffs up the plot quite a bit. If you can find this on sale, do it. You may get a couple days of gameplay out of it, depending on your styles. I'm glad I found this on sale. I'm just now picking it up after a couple years of not playing it. The game is from 2005, so if you don't care about graphics and prefer story and gameplay, this is a good pick. X-ray cameras were never this much fun.",
            "review_score": "1"
        },
        {
            "review_text": "this game is astonishing for its price, it has themes you will find in other games that are about stealth. it was worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Just don't make the same mistake I've done... Stay away, don't get it -_-",
            "review_score": "-1"
        },
        {
            "review_text": "just bought this game but mouse doesnt work, any tip to fix it? Cant even play it. Do steam do refunds?",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like it but this is rediculously bad. Avoid at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "So crappy.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay, waht should I except but... Okay, I paid for 1.24€ for getting this game. But this game has so poor AI that I want getting paid for seen it. Its een worse than in Driver 3. And worse than normal bots in PAYDAY 2 (I mean bots, not enemies. And by normal I mean without better bots mod.). They hear you and be like 'hey, whats there' and then they don't even want to look behind themselves. There are no options meny except for resolution. Only good thing in this game is that I can refund this. Okay there's another good thing: I can uninstall it. 2 out of 12 000, wouldn't recommend.",
            "review_score": "-1"
        }
    ]
}