{
    "app_id": 260750,
    "name": "Neighbours from Hell Compilation",
    "release_date": "2013-11-07",
    "developer": [
        "JoWooD Vienna"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Comedy",
        "Casual",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 1639,
    "negative_ratings": 51,
    "price": 8.99,
    "description": "INTRODUCING THE GAME OF NEIGHBOURHOOD NASTINESS AND COMMUNITY COMMOTION! Living next door to you is a real Neighbour From Hell and it's now time to have your revenge! This compilation includes the original Neighbours From Hell and it's sequel Neighbours from Hell 2: On Vacation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260750/header.jpg?t=1484346494",
    "minimum_requirements": "OS: Windows XP / ME / 2000 / 98 / 7 / 8 Processor: Intel Pentium II, 233 MHz Memory: 128 MB RAM Graphics: 3D graphics card compatible with DirectX 8 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows XP / ME / 2000 / 98 / 7 / 8 Processor: Intel Pentium III, 500 MHz Memory: 256 MB RAM Graphics: 3D graphics card compatible with DirectX 8 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "First, let's talk about Steam release.  This compilation includes the original 2 games of the series. You may seen other games which have numbering from 3 to 7, but those were made by other publishers and aren't exactly official, from what I know. (Most of them are quite ugly and didn't bring any evolution/revolution to the formula of the first game)  This Steam release is a simple and flat 'put game as is'. This can be blamed on that new publishers have no access to the source port or other materials. Thus you will not find any trading cards, achievements, widescreen or any optimisation at all, not even Steam Overlay work in this one. On good side, the game should still work on modern computers.  Now the games themselves:  Neighbours From Hell 1 is point'n'click quest in which you control Woody as you make him sneak around the house, avoiding being seen by Mr. Rottweiler, and make traps, which usually involes first collecting an item in the house and then applying them to the object in house. Some traps may lead neighbour to another nasty trap. Oh, and tip-toeing around Neighbour's pets.  Beating the game by getting minium requeirement of traps is quite easy. Beating it by finding and applying every trap in every level is simple as well. But what make the game the real crunchy puzzler is getting 100% rating on each level. To do this you are required not only to make use of every trap, but to make sure that Mr. Rottweiler get in as many of them in a row before he cools off from previous trap, resulting in him breaking down on each new one (with animation of him almost breaking his back). The timing, order of tricks and placement of traps which can be put in any room (items like marbles) to connect faraway traps is everything there, making you actually think and plan there.  The second game then takes place outside of house on various exotic locations. Sneaking is no more, gone are guardian pets. System of multiple lifes were added, so you aren't immeditly screwed when Neighbour sees you for the first time. And this time your life is made harder by a sudden appearance of mom of out bully, who keeps an eye and fists for you as well. Shame that she mostly spends her time either sleeping or shopping.  This time around getting the golden statue, which is equalient to what 100% rating was in the first game, is much easier, as Neighbour rage now stores on a meter that can stack 'breakdowns' from other tricks and it cools down much slower. So it's a simply matter of making trap ahead of neighbour path non-stop, with no real thinking. Instead the game concentrates more on the figuring out tricks themselves and their activating, with some tricks working as part of 'combo'. Still, no real puzzle.   Now, the games are overall quite fun, with great music which fits to the game goodly and the joyful graphics that use prerendered 3D assets, which are greatly animated. It especially shows with a cartoony characters that the second game is full with. My only complaints would be same repeating breakdown animation for Mr. Rottwell in the first game, which was varied nicely in sequel, and how underplayed neighbour's mom is in Vacations, who could be less passive.  OH, and one of more important things: If you are fan of the slapstick humor (and slightly black one), then I am sure that you will be holding for your belly in this game from laughter.",
            "review_score": "1"
        },
        {
            "review_text": "IT'S JUST A PRANK BRO           ps: i played this game so much when i was a kid",
            "review_score": "1"
        },
        {
            "review_text": "An old game AGAIN i think everyone remember that.",
            "review_score": "1"
        },
        {
            "review_text": "I played these games growing up. I bought them not because they were nostalgic, but because they are so good, I want to play them all over again. The neighbours from hell games are very very good; even though nowadays they look more like games for the tablet rather than for the pc, that does not change the fact that they are incredible.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you Steam for bringing back this game! I was hoping to play it again for a long time... You guys brought my childhood back! I have played this game more than 10 years ago, but I am still enjoying it now!   I was hopping for these games to be released on Steam: - Comandos 1  - Army Men RTS  - Tom and Jerry (the fighting one)    That would be AWESOME if you guys can make my dream (as well as everybody else) happen!",
            "review_score": "1"
        },
        {
            "review_text": "My oh my, the feels!  The second I saw this game on Steam, I couldn't resist buying it. And let me tell you, I don't regret a single second. Not only because it's always been a great game, but it was also ten times cheaper than the time I searched through every single video game aisle of each store in a gargantuan mall as a kid, just to find this game. It amazes me to see how this game can still be enjoyable after 13 years. The nostalgia I felt as I stepped into Rottweiler's home to give him hell... GOOSEBUMPS!  All those feelings aside, even if you've never played this game as a kid, even if you're lacking the element of nostalgia, I'd say this game still is pretty fun. If you would enjoy a good ol' slapstick/physical comedy filled game, that is. Then I'd definitely recommend you to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Concept 1: Break into your neighbor's house, then sneak around and play dangerous, cruel tricks upon him for cheap laughs. Try to queue up multiple tricks for bonuses in order to beat your own high score.  Concept 2: Stalk your neighbor on vacation and torture him all over again.  Short, simple, slapstick-y. If that's what you like, that is what you will get. Acceptable value at under $5 and not a penny more.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely hilarious game, with an original concept (doing pranks to ♥♥♥♥ off your neighbour), and giving the player ideas for any future pranks.",
            "review_score": "1"
        },
        {
            "review_text": "Game like no other. Brings back memories. Soundtrack is awesome, especially the second game's music. The whole concept of playing pranks on the terrible neighbour is great, from planning the tricks, to watching the neighbour's reactions. The only thing was that some pranks got repeated so many times it wasn't funny anymore, like the egg in the microwave one. But overall this game is fun and hillarious. Would recccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Oh god this is a classic right here.",
            "review_score": "1"
        },
        {
            "review_text": "I played Neighbours From Hell way back when it first came out on CD-ROM, over ten years ago. I later bought the sequel (also on disc) after it came out. It seems to me like if these games had been first released within the past few years, they would have been more widely known. These sort of games seem like prime 'meme material' and the kind of thing that would thrive on the modern internet.  Neighbours From Hell might as well be called 'Trolling: The Game'. The entire premise of the game(s) revolves around playing pranks on your fat alcoholic neighbour as part of the reality show in which you star. The whole objective of the game is essentially to make his already-miserable life even worse. The angrier you make him, the more points you get. The pranks start out relatively mild (drawing on family photos, egg in the microwave, clogging the toilet, etc.) but as you progress through the game they become more complex and unique (shorting an outlet and electrocuting him, for example). The game can get boring at times, but usually there is a new and unique prank right around the corner to keep you entertained.  The first game confines you to the neighbour's house, starting with just the first and second floors. As you progress through the game, you will unlock more floors and rooms to access. The second game, however, is far more expansive and takes you to multiple places as you follow the neighbour on his vacation.  Overall, these games are great for some stupid fun. Replay value is unfortunately pretty minimal, as once you've discovered everything you can do, there is limited enjoyment in re-watching the effects of the same pranks over and over again. But the first time through each game is well entertaining, and figuring out the various pranks definitely incorporates a fair amount of puzzle-solving elements (especially in the second game). While these elements are not overly-expansive, they do force you to think a bit. I would recommend this game to anyone looking for a few hours of cheap and stupid fun.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game i don't really like the second game but the first one is the best",
            "review_score": "1"
        },
        {
            "review_text": "oh, memories",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, though too short.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "le childhood, motherfcker, u has it?",
            "review_score": "1"
        },
        {
            "review_text": "This game is garbage and in not fun at all",
            "review_score": "-1"
        },
        {
            "review_text": "Brings back memories.",
            "review_score": "1"
        },
        {
            "review_text": "I have played the Neighbors from Hell compilation (which my family still calls 'Neighbors from Bleep') a lot of times and enjoyed it when I was little. It has some problem solving to prank the neighbor. It is sort of a television show setting. To advance, you need to play all of the pranks. The compilation comes with 'Neighbours from Hell' and 'Neighbours from Hell 2: on Vacation.' Both are built well and you can tell there was a couple years in between the release of one and two. When I found it on Steam, I had a HUGE feel of Nostalgia. Then, I took it upon myself to buy it. I still have the original copies, but they won't work on my computer from how old they are. Anyways, the game structures are nice. The puzzles aren't too hard to solve in the first. The puzzles are more difficult in the second. This game is a TON of fun. It is quite nice to have this game on steam now for more people to discuss.",
            "review_score": "1"
        },
        {
            "review_text": "One of my childhood games..nothing ever comes close to this",
            "review_score": "1"
        },
        {
            "review_text": "Very cute game, I remember playing it as a kid. Makes you hold your breath in anticipation at times.",
            "review_score": "1"
        },
        {
            "review_text": "As a bundle for the full price, I can't decide if it's worth a purchase, but two games with the price cut down to 2,50, it is.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game LONG ago and then I saw it on steam on sale and immediately bought it. It's a casual game where you play as Woody to play pranks on your beloved neighbour. It's a lot of fun to play and worth it if you can get it on sale.  Good Luck and Have Fun! Cheers... ScreechDrummer.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game. Simple game play good graphics and audio. I enjyoed the game due to its easy nature",
            "review_score": "1"
        },
        {
            "review_text": "After playing this, I must ask;    who's truly from hell here?  ",
            "review_score": "1"
        },
        {
            "review_text": "Neighbours from Hell is a classic point and click comedy game inwhich you take the role of a vengeful neighbour looking to get his own back against his vulgar neighbour who lives next door to him.  Neighbours from Hell is a short and sweet game, if you want to pass the time without struggle or worry, with around 20 levels or so to keep you entertained.   The base of the game is to explore your neighbours house for items and such you can use to pull off traps and pranks against your unsuspecting neighbour who fall right into them, the more you do this, the more his rage bar fills and if you can hit the limit, he'll blow a fuse and have a mini breakdown! Do this constantly for a nice combo and earn a higher rating on every level. Later levels get significantly more challenging as you'll eventually utilize stealth in order to sneak past your neighbours howling pets and unlock more rooms of the house to deal more cruel tricks and traps. It's pretty much as simple as that, it's a slapstick comedy game inwhich you play as a good guy turned cruel as your humilate, torture and prank your horrible neighbour...  Now if only I could do this in real life against my vile neighbour...  A classic and simple little game that I'd rate a solid 4/10.",
            "review_score": "1"
        }
    ]
}