{
    "app_id": 260710,
    "name": "Dark Fall 2: Lights Out",
    "release_date": "2013-12-03",
    "developer": [
        "Darkling Room"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 34,
    "negative_ratings": 16,
    "price": 4.49,
    "description": "Three men once manned the lighthouse on Fetch Rock, but they vanished without trace on New Year, 1900. No-one knows what really happened to those three poor souls, and no-one is brave enough to stay in the lighthouse, alone, after dark. Except you...travel to Fetch Rock Island, and discover what really happened...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/260710/header.jpg?t=1531221992",
    "minimum_requirements": "OS: Windows XP or Windows Vista Processor: 1 GHz Processor Memory: 256 MB RAM Graphics: 3D graphics card compatible with DirectX 7 Additional Notes: Mouse, Keyboard",
    "recommended_requirements": "OS: Windows XP or Windows Vista Processor: 1.4 GHz Processor Memory: 512 MB RAM Graphics: 3D graphics card compatible with DirectX 9 Additional Notes: Mouse, Keyboard",
    "reviews": [
        {
            "review_text": "After completing Dark Fall: The Journal, I was very eager to try out Lights Out. This game did not disappoint. I was a little bit suprised at the science fiction tone that the game took near the end, but it did not spoil the overrall experience.  I really don't want to spoil the story. Suffice it to say, you begin in 1912, then travel to 2004, 2090 B.C., and finally 2040 A.D. to solve a mystery surrounding the lighthouse on Fetch Rock.   I love the look of this game. My favorite parts of the game is when you are first discovering the lighthouse in 1912. The attention to historical detail is wonderful, and I enjoyed learning about the responsiblities and the characters themselves. It is also, in my opinion the creepiest part of the game. Exploring the lighthouse proves to be a dark and somewhat claustrophobic experience. You hear the ghostly voices of the men who have disappeared. There is great use of ambient sound, slight hints of a musical score, and sound effects. With this game, the scares come with the general creepiness and uneasy feeling of being alone and yet not alone in a lighthouse at night.  The puzzles can be somewhat tricky. Imagine if Myst were a horror/ghost story. The interface is the same as Myst which may annoy some, since you have to be at the right angle to be able to see/find key objects or solve puzzles. The puzzles will require taking notes, since there is not an in-game journal. Also, you will be reading a lot! It is very apparent what to take note of, especially if you have played Dark Fall 1.  This game has been said to be weaker than Dark Fall 1. I don't think that is very fair. The location is different and the story has more of a science fiction feel, due to the time travel. However, I do not think that this game should be called worse. It is different, and it is a fun play. I know I will definitely be playing this in the future...it'll be a lot easier since I saved all my notes!   ",
            "review_score": "1"
        },
        {
            "review_text": "+ thrilling game with an interesting story - rought graphics, but that wasn't bothering me - at times a bit tricky and frustrating tasks",
            "review_score": "1"
        },
        {
            "review_text": "Bought the bundle of 1 and 2. Dark Fall 2 locked up with flickering screen right at/during the intro. Was not able to play.",
            "review_score": "-1"
        }
    ]
}