{
    "app_id": 261180,
    "name": "Lethal League",
    "release_date": "2014-08-27",
    "developer": [
        "Team Reptile"
    ],
    "publisher": [
        "Team Reptile"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Fighting",
        "Local Multiplayer",
        "2D Fighter"
    ],
    "achievements": 23,
    "positive_ratings": 5196,
    "negative_ratings": 346,
    "price": 9.99,
    "description": "Lethal League is a competitive projectile fighting game where you have to hit an anti-gravity ball into the face of your opponent to win. The ball speeds up with every strike, up to explosively extreme velocities. Play intense local matches with friends and foes, challenge yourself in the singleplayer mode or battle it out online.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/261180/header.jpg?t=1539615005",
    "minimum_requirements": "Минимальные: ОС: Windows XP Процессор: Core 2 Duo or equivalent - 1.5 GHz or higher Оперативная память: 1 GB ОЗУ Видеокарта: NVidia Geforce FX, 6x00, 7x00, 8x00, 9x00 and GTX 2x0 and newer. ATI Radeon 9x00, Xx00, X1x00, HD2x00 and HD3x00 series and newer. Intel® HD Graphics Место на диске: 1 GB Дополнительно: Videocard must support GLSL to run the game. Be sure to use updated video drivers.",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7 Процессор: Core 2 Duo or equivalent - 2.0 GHz or higher Оперативная память: 2 GB ОЗУ Видеокарта: NVidia Geforce FX, 6x00, 7x00, 8x00, 9x00 and GTX 2x0 and newer. ATI Radeon 9x00, Xx00, X1x00, HD2x00 and HD3x00 series and newer. Intel® HD Graphics Место на диске: 1 GB Дополнительно: Videocard must support GLSL to run the game. Be sure to use updated video drivers.",
    "reviews": [
        {
            "review_text": "'Let's make a 2D game that's like tennis with dodgeball, and every time you hit the ball it gets faster' 'Cool, but what's the speed cap?' *laughs*",
            "review_score": "1"
        },
        {
            "review_text": "This game takes the old school two-button skill games and gives it a flavor like no other. It's like being put in a racquetball room with dodgeball rules. The ball can get to ludicrous speeds! But if there is any lag at all whatsoever, it will be difficult to achieve.  There's a baller OST (not many songs though), a nice variety of stages, mostly aesthetic, but still provide a variety in size and significant difference with candyman's special--and a handful of characters with subtle but important differences in their traits.   I highly recommend this game as it is online play, amazing with friends and absurdly addicting for such short matches!  I hope there will be a way to chat with opponents in the game, at LEAST in the lobby. You can not communicate to them not to start a match because you are waiting for more people or if you want them to ready up for the game.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "Are you throwing a party? Yes? Buy this game, beat everyone, have no friends. Are you a 78 year old woman living in New York? Yes? Buy this game, beat everyone, acquire friends, beat them too, lose those friends. Are you dead inside? yes? Buy this game, beat everyone, sell your kidney on the black market, save someone's life, regain your soul, acquire friends due to the regaining of your soul, beat them too, lose all your friends.  All in all cat litter is a bad air freshener and Santa Claus is the leader of the illuminati.  -Wizard (on crack)",
            "review_score": "1"
        },
        {
            "review_text": "My friend hit the ball so hard it broke the fabric of reality...and my face.  10/10",
            "review_score": "1"
        },
        {
            "review_text": " Review in English/Spanish  Análisis en Inglés y Español:",
            "review_score": "1"
        },
        {
            "review_text": "Made me get the Peppermint-Tea out. Made me love friends. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is a truly hillarious, over the top take on pong and fighting games.  The general concept is to defeat your opponentt and reduce their stocks (think smash bros) by smashing them with the ball. The ball will deal damage to your opponents after you hit it, but can be hit by them, which can then cause it to deal damage to you. As in pong, you keep rallying the ball back and forth, with it getting faster and faster until one of you is hit, at which point you lose a life and the ball resets.   What sounds like a very simple concept rapidly becomes a hillarious series of 'Oh ♥♥♥♥!' moments in which the ball is going so incredibly fast that you'd think it impossible to hit, but then someone does, and it gets even faster.  Throw in a bunch of colourful and creative characters and stages, along with an incredible sound track, and some very fancy and flashy visual and sound effects that wouldn't feel out of place in an Anime or Manga, and you get an enjoyable and hillarious experience.  Would reccomend playing with friends (up to 4 player) for added hillarity and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great party game. Perfect pick up and play, low learning curve. This game deserves to be hugely successful.",
            "review_score": "1"
        },
        {
            "review_text": "holy ♥♥♥♥ing ♥♥♥♥   10/10 would hit the ball as candyman 30 times in a row and have it travel through walls every time again",
            "review_score": "1"
        },
        {
            "review_text": "Stylish anime smash bros dodge-baseball with sick jams, my dude.  Could play endlessly with friends.",
            "review_score": "1"
        },
        {
            "review_text": "How to describe this game ?  Well .. Take Super Smash Bros + Pong + Jet Set Radio = Lethal League ...  One of the best game i never play atm !   10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "👌",
            "review_score": "1"
        },
        {
            "review_text": "You should buy Lethal League. It's got the charm of Smash Brothers, and the balance of Street Fighter. Plus it's a deliciously creative game, and if you know me, you know how much I love creativity.  It's replaced Smash and Rockband as 'The game I pull out for my friends when they come over.'",
            "review_score": "1"
        },
        {
            "review_text": "forget rust on mw2 this game is where you really settle a 1v1 GETIT!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game.  There has been many complaints about the lag but it works perfectly most of the time. In 30+ something hours, I only entered two or three online matches that were laggy. For some reason it lags with a friend of mine in private matches but no one else. Honestly, the fun is worth the lag. Favorite game on steam so far. Only problem with this game is that there isn't enough people playing it. I'm not saying that to praise the game, the community is seriously small :(  Edit: Wow it's been a long time. Still my favorite",
            "review_score": "1"
        },
        {
            "review_text": "This may possibly be one of my all time favorite games and I have barely played at all!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun. It can go from 0-10,000 real quick and its fun as hell. Especially if you're playing with friends over skype or irl and you've made the ball go so fast that the screen is shaking and you can't even see it anymore but you both gain god hands and are able to keep slamming it at each other going faster and faSTER UNTIL IT IS JUST SO FAST THAT YOU BOTH TRANSEND TIME AND SPACE BECOMING ONE AND YET ALSO TWO, CREATING NEW UNIVERES WITH EVERY SUCCESFULL HIT UNTIL THE BALL DISSAPEARS AND IT IS JUST THE TWO OF YOU SURROUNDED BY THE BLUR THAT USED TO BE THE BALL BUT YOU CAN'T STOP SLAMMING THE BALL THAT WAS ONCE THERE BUT IS NOW- a good game, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I hear everyone saying 'It looks neat, but not at that price.'   It is worth the price. It is very, very good. Everything about it feels good to do, and even when you're at vastly different experience levels from your oponent you can get a win that doesn't feel unfair for either side. It goes about eight layers deeper than the trailer shows - specials, parries, bunts, clashes, it's all good and it all works together seamlessly. The community is still figuring out how to really go nuts with them, but they're finding better and better tech.   Get in here.",
            "review_score": "1"
        },
        {
            "review_text": "Forget Counter Strike Global Offensive  This is the real competitive game",
            "review_score": "1"
        },
        {
            "review_text": "An exillerating, complex and fun game, Like an insane pong/dodgeball mixup, Takes a while to get used to or master but is worth it! Highly recommend to those who want to play something interesting and fun.",
            "review_score": "1"
        },
        {
            "review_text": "What a fantastic game! I love simple games but full of style. In this game you and your friends one bounce a ball in the others, almost like a dodgeball. Each time the ball is hit it is faster to a bizarre speed. The game is very fun to play with friends. The graphics is very clean and a bit retro, with large images in pixel art. The characters are well diversified and very cool. The soundtrack is flawless and so important that there is a stereo in the game interface.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun enough on its own, but get a few friends together and it's a great time. It put me off initially because it's a bit hard when you first start out, but you'll pick it up quickly. When you do, it's a great time.   P.S. you might want to rebind your keys when you first start out",
            "review_score": "1"
        },
        {
            "review_text": "It's Super Smash with a ball. C'mon and slam.",
            "review_score": "1"
        },
        {
            "review_text": "this game... is amazing my only problem with it is the connection i have with most people online and that barely anyone plays in my region and it accasionally takes forever to find a game,  but on the other hand if you have a few friends to play with this game is a blast to play even if it takes forever to get in a match cause the singleplayer is enough to keep my attention this game is one of the amazing games on steam and deserves more love and attention! :D",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is a competative baseball/dodgeball hybrid that supports up to four players in one match. With each strike of the ball, the speed is doubled, sometimes even quadrupled (and in serious cases, maxed at one million). Maybe you and a few friends sit on the couch and hit the ball back and forth a few times. Maybe it's you and a stranger online. Regardless, every hit and dodge are anxiety and adrenaline riddled. With more than four friends who've enjoyed this game with me, we've never experienced any rage or upsetting losses, only awe at how insane it is to bunt the ball at such ridiculous speeds and then pelt it right back at the poor soul who bashed it towards you in the first place. Each character has a special ability that makes the matches all that much more interesting once they've filled their blue bar. Beware Dice and Candy Man. There's also an interesting secret character which you can play as in local matches; I'll let you google the code for yourself.  My friends and I give this game a 10/10 for competative shenanigans and I give it a 9/10 for the minor network bugs.   Worth the price, but I'm glad I snagged it on the humblebundle for a buck.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fighting game, it's pong, it's expressive, it's a party game, and I never would have bought it if I wasn't introduced to it at a party, because trailers have a really hard time capturing why it's so much fun. The gameplay lives off a wide array of mechanics that are all accessed by basic movement keys and 2 more buttons. Different characters don't only have unique special abilities as showcased in the trailer but also subtle differences in the way they move, their hitboxes and the angles in which they hit the ball. At first, the game is just enjoyable without having any clue of what's even happening, but once you play more you get an idea of how high the skill ceiling actually is. To become a master, you don't only need high knowledge of/experience with the characters and perfect reactions, but also the ability to read, surprise and outsmart your opponent.",
            "review_score": "1"
        },
        {
            "review_text": "Try to imagine Pong, crossed with the 2D Fighter genre, in a baseball setting. That's what this game is. If you like fighters, this game is right up your alley. Bonus points if a friend already plays it.",
            "review_score": "1"
        },
        {
            "review_text": "i stick my dik in this game every day because its awesome",
            "review_score": "1"
        },
        {
            "review_text": "Good gosh this game is one heck of an amazing ride.  Your goal of the game here is to use your ball (it becomes 'yours' when you hit it) to take out your opposition. What starts as a decently paced back and forth versus match quickly can turn into a frantic twitch batter as the ball flies feverishly across the sceen with each successive hit. The game is smooth and intense, the controls fluid and responsive, and I without friends now. Totally worth it. Do yourself a favor and get this game! Better yet, do everyone a favor and get the 4 pack so more of us can game together.  Gosh I love this game, and you will too!!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely my pick for the most fun to be had in a game in several years! Lethal League is a projectile fighting game which starts off easy to learn, then quickly scales into either a chaotic mess of fun to be had with your friends or a very interesting competitive experience. With a gameplay system that's much deeper than it would seem at a glance, Lethal League provides fun to whoever is willing to give it a shot, and I'd highly recommend you fork out a few bucks for the game that keeps on giving.  It being a multiplayer game, it does suffer from the usual lack of opponents issue when you want to play against someone in less than ideal circumstances. The art of the game certainly isn't particularly striking or unique in any way, just enough so to serve its purpose. Lethal League also suffers from a lack of diverse content, but that's forgivable as what content there is has been polished to a mirror shine.  Every shortcoming listed is easily ignored in favor of a Higher Fun, and you should definitely get in on the chaos everyone's talking about!",
            "review_score": "1"
        },
        {
            "review_text": "Nice to play with friends! :)",
            "review_score": "1"
        },
        {
            "review_text": "0/10  False advertisement. There is in fact weak ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "For those with a love of timing, battle, and quick reflexes, enjoy this wonderful piece of projectile fighting.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absurdly fun. Easy to pick up and play and getting better takes some genuine practice and focus. Feels a little pricey at $14 but grab it for yourself and 3 friends at $10 a piece and you've got 3 more reasons to love the game.",
            "review_score": "1"
        },
        {
            "review_text": "A great indie fighting game that combines the neutral game mechanics of 2d fighting games like street fighter and mortal combat, and the fun factor of the smash brothers series.   Pros: A fun experience for people who enjoy fast paced, crazy fighting games. Relatively cheap, only $20 at the time of posting this. Great and helpful community.  Cons: High skill ceiling, many people that are still playing have been for almost a year, and very good players with 400-500+ hours are usually going to be found in online matchmaking Unranked matchmaking, there's no ELO system of sorts, so you can play anyone from the range of a braindead squirrel, to a winner of 20 tournaments. Low player count in matchmaking, Lethal League usually does not have a high player count, and they're not always in online matchmaking, so you will sometimes keep matching up against someone you don't want to play against due to them being the only person online who you can play.  Regardless, Lethal League is an incredibly fun and surprisingly complex fighting game, and if you're willing to put in the time and effort to get good, it can be a very self rewarding and fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game to pass the time with friends, although it will randomly break sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "So, I normally don't do this as I usually like to play 10 hours in a game before I write a review, but I cannot help this. This game is SOOOOOOOOOOOOO good. Writing a review on a game without 10 hours isn't really a good review because people think you haven't played enough, but I just cannot resist. GET THIS GAME. I HIGHLY suggest this game. I bought and and I have no regrets. Buy the game and play it. You won't regret this, promise.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing because of its easy to learn mechanics, awesome music, fantastic art style, and fast play feeling.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with friends, really funny, i love hard memes. Only 6 characters and soundtrack is repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "Date: 2/4/16 Review Number: 9 Game: Lethal League From (Creator Publisher): Team Reptile Played On: Steambox (Steam Controller) Steam Price as of Review: $13.99 Total Time played: 45 Minutes Review:  Admittedly, this is not a game that has come up on the randomizer. In fact, I think I have decided that once every nine or ten days I think I am going to play a game of my own choosing, in order to balance out the reviews, and to keep me from going crazy. So I figure the best way to start off my ‘player’s choice’ series would be Lethal League, a multiplayer smash fest from Team Reptile. Now, I admitted earlier that I really wasn’t that big on fighting games, and in fact often just pounded the controller like I was asking for another beer at a crowded bar hoping the other guy walked into my punches. I confess now that there was one unmentioned exception to that statement, and that was the classic Nintendo 64 version of smash brothers. I actually spent a significant amount of time refining my skill in that game, partially because it was a fighting game I was actually fairly decent at, but more because it was oodles of fun, and a great game to play with friends.  Fast forward a decade and change, and we have Lethal League, which is a rehashing of the typical multiplayer chaos on the screen everyone pounding controllers while jumping up and down and ‘accidentally’ kicking each other while playing sort of game, only this time with the added fun of dodgeball rules added in. See, instead of simply smashing each other directly, players instead knock a little color coded ball back and forth with the goal of hitting someone else, knocking them out until the next serve. Difficulty is added as the ball’s speed increases every time it is hit, giving players a reward for timing over button mashing. Each character even has their own special move, from Dice’s occasional arcing of the ball over everyone's’ heads to candyman’s wall-looping trick, each character has a way to frustrate everyone else playing. And with both online and local multiplayer modes possible, this game will give you enough play value to make it worth any amount of money, and eventual frustration over whoever picks Latch. Can’t recommend this one enough, folks. Have fun!  Game’s Fate: Kept. Also installed on the laptop. Never know when you want another round Buy/No Buy: Buy. Heck, Buy a multipack and send it to all your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League focuses on its core mechanics, ball speed and hit lag, and does these very well. The game is a blast to both play and watch, with DBZ levels of intensity when you reach the higher ball speeds. It's ridiculous, over the top, and I love it.   Problems with the game are mainly the lack of players, but this game is perfect for local multiplayer.  The movement is excellent, and it feels good to play.  Definitely worth your while.",
            "review_score": "1"
        },
        {
            "review_text": "LETHAL LEAGUE HAS -good music -fun gameplay -fast balls -local multiplayer and online matchmaking -big balls -tight controls -candyman",
            "review_score": "1"
        },
        {
            "review_text": "A great new style of game about hitting a ball back and fourth fast enough to break time, space, and stable friendships. Great multiplayer and soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend! SOOOOOO fun i nearly sweat out of my eyes from how intense my friend and i were screaming and having a good time, i would buy this for anyone! Every person would love this game! 11/10. Thanks Obama",
            "review_score": "1"
        },
        {
            "review_text": "Imagine smashing a ball faster than the Millenium Falcon into your friend's face. This is that game. 10/10. Would smash again.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you based crocodile.   10/10   Like smash and pong had a super hype baby.",
            "review_score": "1"
        },
        {
            "review_text": "Lethal league is an amazing 2D fighter about hitting a ball at eachother,, like pong on drugs. The style is at first weird, but I started to love it, especialy the soundtrarck which is amazing, paticularly Klaas Veen - Ordinary Days. The gameplay is perfect, including a level-up system which unlocks new 'flavours' which change the look of the characters, and a suprisingly difficult Challenge Mode hidden in the extras.  BUT... I do not reccomend this game unless you have at least 1 other friend who owns it and is willing to play with you, as there isnt enough people for online matchmaking to work effectively.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ridiculously fun if you play it with the right [competitive] people. The art is gorgeous and the character design is pretty wonderful. The whole game is like Smash Bros + Super Dodge Ball + the art/music dusting of Jet Grind Radio. The only downsides is that I wish there were more characters, and changing resolution in the game seems to be really finicky when playing it on my television- for whatever reason.  Did I mention the music is fantastic?",
            "review_score": "1"
        },
        {
            "review_text": "It's definitely balls-to-the-wall.  It makes Windjammers look like a breeze.",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and fun once you get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "Dodgeball. Pong. Smash Bros. How could it not be great? 12.7/10",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game but the thing that is missing is that the is not that mutch characters but everything else is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played too much of the game, but I can assure you this game is worth your while. I mean that is if you like fast paced and intence party combat games with great music and satisfying yet simplistic controls. Each playable character is unique in their own way, along with skins you can unlock for further customization. As far as anything else the game seems to lack an extensive singleplayer or much in the ways of collectables, but it sure is a bundle of fun! It's a game that's easy to pick up, but a bit challenging to master!",
            "review_score": "1"
        },
        {
            "review_text": "short version: worth the buy  long-ish version: great multiplayer game that brings smash bros to mind in it's relatively simple yet chaotic gameplay. the kind of game thats easy to learn and hard to master. characters skills leave a nice twist on the gameplay. awesome soundtrack. art is pretty neat, especially when the ball really gets moving. leveling system unlocks skins, which is nice, but nothing game changhing, obviously. overall just a pretty fun game for fighting game fans looking for something new and different, but i doubt that it would ever be played hardcore mlg like street fighter or tekken.   one thing to note, however, is that i DID buy this with 2 friends, so i've been playing with them pretty exclusively; if/when i get around to trying more of the single player or trying random multiplayer i'll update the review, but i wouldn't count on it since i'll probably forget/am incredibly lazy.  solid 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "The goal of this game is to be the best mans with the most fasts.  But what this game really teaches you was that your mans always had the fasts deep down; you just needed to believe in yourself to utilize them.  11/10, emotional masterpiece of the year.",
            "review_score": "1"
        },
        {
            "review_text": "ordinary days",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is a super fun, Smash Bros style (not objective wise) game that is extremely fun with friends. Now, if you don't have friends, maybe you shouldn't pick this one up, as the BOTs are fun, but not near as fun as playing with someone you know. While playing with my friend, with other people watching, I heard many 'dude that was awesome's or histarical laughter as someone gets hit by a super easy ball. The gameplay consists of hitting a ball back and forth between 1-3 other players, if you hit the ball last, it is outlined in your color and is lethal if it touches the other player. The other player has to hit the ball back to make it their color and to try and get you. This simple gameplay leads to hilarious moments where people get lucky shots and send the ball back even faster to the next player. The ball speed is really fast and sometimes hard to predict when you first pick up the game, so you can feel a real sense of getting better as you play the game. Super fun game, the AI is good, but not outstanding, pick it up if you have friends to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "Fun even against hard bots- WHAT THERE IS NO WAY HE HIT THA-*DEAD* WHAT THE **** WAS THAT *ragequit*",
            "review_score": "1"
        },
        {
            "review_text": "A game of dodgeball and Super Smash Bros just had a baby, and that baby's name is Lethal League. It's excellent; I can play this game for hours and not get tired of it. Lots of competition. c:  If you're into 1-4 person fighters with a twist, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good",
            "review_score": "1"
        },
        {
            "review_text": "basic 'fighiting game' that is actualy fun to play. If you have friends to play with even better  Buy it on sale",
            "review_score": "1"
        },
        {
            "review_text": "To start off. This game is defenitly different than your average 2D fighter. With a very simular aspect of a Super Smash Bros. game, It's A four-player game with a objective that's not beating up another player until their health gauge is gone. Instead your hitting a ball at intense velocities slowly creeping up in momentum until one of the players hits it back faster or is knocked out by the ball. This is where it gets insane. Each character, despite its low roster, has special abilities to either make the ball move faster or cause insane mix-ups on the other players. They all have simular properties to SSB characters: like fast falling, Dash Dancing, and floaties. The big thing that you need to learn in this game is not really the technical prowess, but learning the frames of the game, predicting where the balls is going to go, and timing every hit correctly.   Aside from all this jibber jabber, this game offers minimal stuff to do aside from leveling up, unlocking skins, and comepleting a offline challange mode simular to a arcade mode of somesort. The online takes a while to find any kind of matches including 1 on 1 or a free for all battle but I have yet to run into a match where it's just miseriably laggy.   If you want a hype, over the top, different 2d fighter game; play this, enjoy it with your friends or go online and smash some scrubs. I'd definintly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Pong+Smash Bros+Jet set radio= AWSOMENESS",
            "review_score": "1"
        },
        {
            "review_text": "This game is gud for me thank the lord gabe n",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is a combination of a fighting game and pong. Easy to learn and fast-paced. Great game to play with friends. In my opinion it is not worth the full price of $13.99, but definitely worth picking up during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Bunting a top-speed ball is what I imagine being God feels like.",
            "review_score": "1"
        },
        {
            "review_text": "Well, time to uninstall all other games in my Steam library. Gotta learn how to beat the ♥♥♥♥ out of Candyman.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy fun game. Glitches out for me in 4 players some times but its amazingly fun. Recommended to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing.  Easy enough to learn it in few minutes. Hard enough to be enjoyable when playing versus other people.",
            "review_score": "1"
        },
        {
            "review_text": "An awsomely fun ping-pong with your friends. The intensity it gives you is amazing. You'll be craving more the more you play.",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is one of the most original fighters I've played in a while to the point where I'm not even sure if it could be called a fighter. But, its lack of content (especially in the singleplayer front) makes this game only worth it for a few laughs with friends.  The story is non-existent in this game, but the characters you get to play as and the stages you play in are really interesting and have a very unique style reminiscent of something like Jet Set Radio. The world presented in the stages looks very interesting but you never get to explore it or get to know more about it. Nevertheless, they make for a good visualizer inbetween rounds for this game's excellent soundtrack.  The gameplay revolves around a ball which you hit to make it turn your color which means that any players hit who aren't the same color (assuming you're in a team battle) die instantly. They can hit it again though and make it go faster and faster and faster until someone is hit. This game is so simple yet so mind numbingly complex in its mechanics that it welcomes players from any skill level. Casually, this is a fun game to play with up to 3 friends. Competitively, this is a game riddled with mechanics to be discovered and tactics to be used. This is the perfect balance for any fighter.  But then there's that. This isn't quite a fighter... This is more like 'Super Pong Bros.' in a way. But unlike the Nintendo money machine, this game isn't riddled with content, unlockables or anything really to make for a solid singleplayer experience. This game's only content as far as I'm concerned is playing with friends and to some extent online play. It's unusual mechanics don't really make it pro tournament and competitive play material, although I could see it entirely.  In the end, Lethal League's mechanics more than make up for the lack of content, and while its visual aesthetic can be called archaic for some, it can be seen as artistic. The diversity in the very small roster of characters is there, albeit not too game changing since the only change is usually only the special attack that can be used after 4 successful hits on the ball. Skins and trophies are there for a singleplayer experience, but... I wouldn't advise you playing this game unless at least one friend would play with you as well.  Worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "Hitting a ball in 10 mph is pretty easy. Now try hitting a ball going 200mph at you bouncing on the walls up and down. 12/10 would miss again",
            "review_score": "1"
        },
        {
            "review_text": "Imagine playing dodgeball in a box where the ball is constantly gaining speed.",
            "review_score": "1"
        },
        {
            "review_text": "bring lethal league to evo 2015, this game is hype as ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "No other game has ever made me literally scream in absolute terror and excitement",
            "review_score": "1"
        },
        {
            "review_text": "It's only good because of Candyman's crouch pose.  Only narrowly breaks through with a weak 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this is pvp pong  12/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. Behind it's deceptively simple premise lays a large amount of depth for an indie competitive multiplayer game. Whether you're looking for a good game to play with friends, or something to practice and learn, it's well worth the $14 price tag. Anyone that is dismissing this thinking it's just a port of a flash game, think again, since this is quite the gem.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even own this game.",
            "review_score": "1"
        },
        {
            "review_text": "'dis game ♥♥♥' - K9999 'Like a beautiful deadly baseball dance' - commentator from Combo Breaker 'Nice' - the black and white Candyman  8.8/10 PewDiePie played it  s h i tpost aside, here's pretty much the game: boring if you plan on doing nothing but single player/challenge. seriously, don't pirate the game, it doesn't support anyone and the game is super stale; not of course adding in the ai doesn't live up to any player worth their salt. not fun if you're casually going into qm. alright if you plan to play casually as a couch multiplayer game (replayability's gonna be low if no one plans to learn game mechanics fully). nice if you get involved with the community (learning or not, still good to talk to people instead of playing faceless randoms). lovely if you plan on learning the game, getting along with community (tourneys and steam chat, dog :D), and trying to improve your playstyle.  game's palettes/character flavors/skins, stages, and music can be replaced too, so you can mix things up if it gets stale too quick.  oh just to let folks know honestly, online's pretty wonky. game might crash and an alt+F4 might be necessary (if others don't follow). still good connection and can be fun online privately.  tl;dr this game's competitve. full replayability depends on you. mod things if you hate them that much, you baby. don't like? well then I guess that's fine, go back to gmod you nerd. 9/10 please don't hate the community for trying :c  EDIT: NVM GAME SUCKS!! -BAD MUSIC LIKE WHAT THE HECK IS THIS SKRILLEX NONSENSE -BAD GAMEPLAY LATCH HITBOXES ARE STUPID -BAD COMMUNITY WAIT ♥♥♥♥ I DIDN'T MEAN THAT -BAD CONTROLS MAYBE THAT'S JUST MY KEYBOARD NVM BRB -GOOD CONTROLS OK IT WAS THE KEYBOARD TOTAL SCORE = 79/104 YEAH SURE IT WAS ALRIGHT",
            "review_score": "1"
        },
        {
            "review_text": "The ball broke the sound barrier, and starting traveling at mach 7 speeds,while playing as a googly eyed pacman and cyborg crocodile. GOTY 10/10",
            "review_score": "1"
        },
        {
            "review_text": "My friend Jim threw the ball at 513 speed, I blunt it, threw it back at him. He's dead, Jim!",
            "review_score": "1"
        },
        {
            "review_text": "I have to say this a very fun game.. gets some Friends together and play all day get the all some lol's  love the look of the game. WHO Needs a story line not this game just get some buddys togather and have fun  got the 4 pack for my Friends.thay all love it.  one downside :P NO Hamster Internet or it well lag very bad... thats it ^^   this is a allsome game  ",
            "review_score": "1"
        },
        {
            "review_text": "I bought this because i thought it was about hitting testicles. I'm also into BDSM. 10/10 played it anyways",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League, despite its simplicity, is an amazingly fun and challenging game. I am horrible at reviewing games due to me being somewhat of a moron, but this game is so simple to play, that even people who are not fans of traditional fighters (Myself included) will absolutely love it's simple but challenging to master gameplay.   If for some reason it's TL:DR for you, 10/10 game, get this ♥♥♥♥ now.",
            "review_score": "1"
        },
        {
            "review_text": "Addiction is a very serious problem.  BUT SO IS A CYBERNETIC ALLIGATOR. WHO WILL SAVE THE WORLD FROM THIS MONSTROSITY, IF NOT ME?",
            "review_score": "1"
        },
        {
            "review_text": "You hit the ball, the ball hits back",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "  I love this game. truly love the simplicity, and how good I am at it. Definately reccomend it if you like a simple game. Super fun and easily addicting.",
            "review_score": "1"
        },
        {
            "review_text": "Best ever game to play during Dota 2 queue time.",
            "review_score": "1"
        },
        {
            "review_text": "It´s funny as hell so get your friends and play this game",
            "review_score": "1"
        },
        {
            "review_text": "If you're having a tough day, this game is a pretty good way to vent :)",
            "review_score": "1"
        },
        {
            "review_text": "A couple of hours in its 2014-08-28 wanted to try out multiplayer, but there were no players playing it. I'd recommend it playing with friends, or buying it for less. All though a great and fun game! 8/10 Would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is a work of art. The superb way every ball forces you to calculate parries perfectly, the many varied balls with hunderds of unique balls, everything comes together to make what is certainly the greatest ball game, ball hell game, and fighting game of 2015.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun party battle game!  Lethal League has the vibe of smash brothers, pong, and super dodge ball. A great game to talk trash with friends while sharing a screen, or playing over the internet. This game deserves to be in everyones library.",
            "review_score": "1"
        },
        {
            "review_text": "I love Rakugaki Smash Radio and all of its BAAAAAAAAAAAAAAAALLLLLLLLLLLLLLLLLLLSSSSSSSSSSSS",
            "review_score": "1"
        },
        {
            "review_text": "This game got me off of heroin 11/10",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr: buy this game. Heck, buy the four-pack and get some friends in on the action. You'll have a blast.  This game is an odd mashup of things like Tekken, Super Smash Bros, Pong, and a bit of Dragonball Z mixed in for good measure. If you get a couple of friends and all play together, this game is one of the best times you'll collectively have. I haven't played in the open multiplayer so I can't vouch for the online community, but playing against friends is simply fantastic. The online multiplayer will occasionally desyncronize when starting a match, but it only takes about 10 seconds to exit the game, restart it, host a new lobby, invite your friends into it, and restart. The desync error also is not particularly common, certainly less than 10% of matches will have this issue. Not a serious detraction from the overall game.  There are, however, two things missing: a replay system and a spectator mode. There are many situations where it would be nice to have a replay so you can answer questions like 'How did that shot hit me?' or 'That was an awesome move, can I see that again?' I hope the devs will eventually include some form of replay management. The inclusion of a spectator mode would make this game viable for some tournaments and casting. I doubt it'll rival things like LoL or DOTA for popularity, but at some events it would be great to have a Lethal League tournament going on as a side-attraction or something.",
            "review_score": "1"
        },
        {
            "review_text": "10",
            "review_score": "1"
        },
        {
            "review_text": "Not enough naked people, I guess there a few. Not nearly enough though",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on sale quite a while ago - and at that point my only experience was with single-player. I held off on a review, because I would have thumbs-downed it.  Why does this title have overwhelmingly positive reviews on Steam?!    It must be played with controllers on a couch with local multiplayer.  This is where this game shines. There is alot of screaming and shouting and laughing. Lots of twitching. Great fun.    Pros:  +Excellent concept - bringing such a fresh breath of life to stale fighting games +Brilliantly simple controls - no tedious combos to memorize +Characters each have their own specialties - it seems subtle, though +Music is pretty good   Cons:  -While this game is crazy fun, there is wasted potential at this point IMO, I really think there is TONS of room for expansion, such as: -Needs more playable characters -Needs better artwork, IMO -Needs more playable levels -Needs more gameplay modes (only 3 right now)  Overall, the fun factor is pretty much through the roof with this title. If you have couch coop opportunities, this is a no brainer.",
            "review_score": "1"
        },
        {
            "review_text": "get to hit other peoples balls  10/10 ign",
            "review_score": "1"
        },
        {
            "review_text": "I definitely reccomend this game, it's really fun but the thing is that there's a lot of bugs because it usually takes a little bit to find a game and sometimes once it loads the game freezes and it says I loose connection but once the game is fully functioning it's amazing af definitely reccomend it ;)",
            "review_score": "1"
        },
        {
            "review_text": "How to play Lethal League:  (This recipe needs four people to play with)  -Launch game -Join game with friends -Start game with friends -Crash -Launch game -Join game with friends -Start game -Crash -Launch game -Join game with friends -Start game -Crash   This game is really awesome. Tennis like elements mixed with combat straight outta smash bros.   Here is the run down. Take a ball, four people, and throw them in the arena. The only way to KO somebody is to hit them with the ball. Simple. fast paced, and the game can get crazy at some points. Be for warned, this game is meant to be played with four people. its just not as fun all on your lonesome. Granted the game has an online function to play against people anywhere, but trust me, its way more fun in a group of buddys.  Also, the game has a bangin soundtrack. I could listen to the songs on replay while I do other stuff all day.  All and all, Lethal League is a fun fighter that harkens back to the days of original smash, while throwing in a new mechanic at the same time.Definently an under-rated gem on Steam.   Get some friends. and smack some balls into their faces.",
            "review_score": "1"
        },
        {
            "review_text": "Subtle controls depending on timing &amp; easy 2-button combinations make this a party game anyone can pick-up &amp; play. Don't be fooled by the seeming simplicity, as the game is elegantly complex. Take 'Pong' &amp; add Handball / Dodgeball elements with a cartoon twist of intense speed madcap &amp; you essentially get 'Lethal League.' The graphics has have a mid-90s 'Street Fighter' look &amp; feel to them, which is quite suitable. Seeing the ball is important &amp; this works well for gameplay. The voice acting is good &amp; actually quite funny at times. A well timed taught can really mess with your local competitors just as much as a well met swing sending the ball spinning. The music is cool. Even people not used to playing video games can get a kick out of this one. Recommended as easy to pick-up and play, yet challenging to master. I would love to see an expansion with more characters, or a sequel, but the game is near perfect as is. Actual LOL fun~",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would baby ♥♥♥♥♥ about candy man again",
            "review_score": "1"
        },
        {
            "review_text": "First thing first: This game is not perfect. It has online problems. sometimes if you can't connect with other players the game will crash all together, but the game boots up extremely fast.  This game however, is an absolute blast to play. Super easy controls, great music, cool characters (Candyman especially), nice visuals that are easy on the eyes even though the game is batshit insanely fast. While it may not have a lot to offer, it offers a ton of replayability.  Easily recommended.  TL;DR Alright online, but fun as ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game. Simple to learn, hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "'Its like Skyrim but with dogeball' -IGN (ign r8s this m8 8/8)",
            "review_score": "1"
        },
        {
            "review_text": "Take dodgeball, speed it up 1000 times and apply a fresh coat of Jet Set Radio.  -Fun as hell gameplay -Great netcode -Great soundtrack -Great aesthetic -No weak ♥♥♥♥  Buy this.",
            "review_score": "1"
        },
        {
            "review_text": "So this game is only just released today, and you might think, 'How can he write a review so early after release?' Valid arguement, but counterable with: the game is super short and super simple. I am not an expert at this game, far from it. But the games' mechanics are very easy to learn, infact the tutorial is ~2 minutes long. That being said, I am going to continue playing this game for quite a while, it feels absolutely WONDERFUL to smack the ball around, especially the faster it gets, and you start shouting at the screen to get it. The price point is imo too high, 14 isn't pocket change, considering how much the game actually has inside. I got super hyped and bought it anyway, but that decision is up to you. The online connection is phenomenal, very very few cases when it felt off or jumpy. If I didn't know I was alone, I couldn't tell that the players weren't right next to me. One big probelem though is that if it desyncs, then it's just about over for that room. But i've only had that happen once in the ~16 games I've played as of writing this. Now, if they added Local Play, this game would be completely worth the price, hopefully they add that feature. If you're worried about dumping the cash to pick this up, wait till it goes on sale. Even 10 would be good imo, but I also thought 14 was an acceptable loss",
            "review_score": "1"
        },
        {
            "review_text": "played with friends. i dont have friends anymore.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "I feel like playing squash in a dance club. The music is great but you need really good reflexes.",
            "review_score": "1"
        },
        {
            "review_text": "Please buy this game it's literally Smash Bros.' gameplay with Jet Set Radio's setting/style and ludicrous speeds.",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "A fun and funny game to play with friends~ How fast can you hit the ball?? ",
            "review_score": "1"
        },
        {
            "review_text": "A fun and funny game to play with friends~ How fast can you hit the ball?? ",
            "review_score": "1"
        },
        {
            "review_text": "I play the game. I die because the game didnt read that i clicked on jump. I quit the game. I click on support to refund the game. I realize i have played it over 2 hours. I ♥♥♥♥ing love my life",
            "review_score": "1"
        },
        {
            "review_text": "Let's get down to the basics of playing Baseball Chaos Dunk Simulator 2014. You hit ball. Your opponent hits ball. You both hit ball harder until Chaos Dunk happens. Or until one of you decides the time for dying to an impossibly fast baseball is now. So, yeah, 10/10 would buy 20 copies of for giveaway",
            "review_score": "1"
        },
        {
            "review_text": "this is probably one of the best games i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "Why do you not have this game yet? Just buy it. You'll see...",
            "review_score": "1"
        },
        {
            "review_text": "FUNNY GAME ,addictive",
            "review_score": "1"
        },
        {
            "review_text": "NINJA BASEBALL BAT MAN",
            "review_score": "1"
        },
        {
            "review_text": "FIND THE COMPUTER ROOM",
            "review_score": "1"
        },
        {
            "review_text": "I gave this game many chances to improve me because of the overwhelmingly positive reviews, but I've come to the conclusion this game does not work well with the controller. I've tried using both a steam controller and x360 controller and this game has the weirdest problems with my controllers. Whenever I press left on the analog controller, it would pause the game. Also, the game was clearly designed for keyboad and mouse because when you use the controller the analog stick becomes a pointer and in order to select your opponent in a CPU game you have to click this little narrow box. It's very unintuitive. If this dev really wants this game to take off like Rocket League or some such (this game was recommended to my because of my love for RL), they need to make the interface with the controller more intuitive and iron out many bugs. At it's current form, I can't recommend this game for people with controllers.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: - Solid gameplay. - Online works well. - Relatively balanced characters. - Game is pretty easy to start playing. Cons: - Mileage may vary. Heavily dependent on how dedicated you are to playing in a box. - Taunting (personal hatred) - Playing game with people who know what they're doing can be very disheartening.  Would I recommend this game to an ordinary person? Not at all. The price is honestly insane. But would I recommend this game to a person who enjoys competitive games? Yes.",
            "review_score": "-1"
        },
        {
            "review_text": "you can hit your friend with a baseball going at over 1000 mph and then hit them again in the face with a metal bat",
            "review_score": "1"
        },
        {
            "review_text": "Fun but not worth playing as of now do to lack of servers.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game, I just don't know if I can recommend it.   Pros: - I love the art style, it's awesome and the art is awesome, from the characters to the stages. - The music is also really great. - Gameplay is interesting and a different take on traditional fighting games.  Cons: - Finding lobbies is difficult - The mechanics don't have a ton of depth  At the end of the day, I was already bored of it after a few hours. Trying to find lobbies just to play a fighting game with not much depth to the mechanics wasn't worth it to me. I'm not sure if the concept of a 2 button fighting game is supposed to be a selling point, but to me it wasn't. There's no combos, no blocks, no grabs, and nothing that really gives you the rock-paper-scissors aspect of fighting games you expect in the genre.   If you're new to fighting games and don't expect much in the way of depth of mechanics, this would be fine. For me, it's not enough. I wish I enjoyed it more though, because the art and the soundtrack are all amazing.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't do online multiplayer, there's too much risk of running into a pro gamer who wants me to suffer. So this game was kind of a bad choice for me, and it doesn't help that the one single player mode has a butt♥♥♥♥ ♥♥♥♥♥♥♥♥ AI companion in at least ONE level. Shame, it looked like a genuinely great game.",
            "review_score": "-1"
        },
        {
            "review_text": "  It's like Super Smash Bros but the characters are homosexual and you hit around a weird pinata for like 10 minutes until everyone dies. The soundtrack is annoying and Candyman is an annoying cuck and pisses me off.     10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hype 2 : The hypenining",
            "review_score": "1"
        },
        {
            "review_text": "This is just personal preference. I didn't like the style of the game, the mechanics weren't terribly interesting, and the audio was probably the worst part of the experience for me. All that being said, I know that this is just stylistic preference and I could see how some people might enjoy this game. Just not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Multiplayer only by the looks of it. Got it in a bundle so no great loss.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow. Just wow. A very shallow 'fighting ball game' that only has online and versus modes (for obvious reasons). It's like playing ping pong with ♥♥♥♥♥♥♥ that only play using power ups. Got it from a bundle and now I can forget about it. If you absolutely adore the art style (lol) or the reckless ball bashing (pun intended) don't still buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "I was enjoying this game. I really was. It's fun to play.  At least, it WAS fun to play until my character, Candyman, started screaming the d word because I lost. And not just once... he screamed 'D**** it, d**** it, d**** it!!'  This really made me not want to play this game again. I wish this was removed. Like, please, give us an option to turn off cursing. There is the option to turn off voiceovers, but where's the fun in that? I like hearing the characters... except when they curse. Again, please give the option, at least, to make the game more kid-friendly and enjoyable for those who don't like to hear cursing.",
            "review_score": "-1"
        },
        {
            "review_text": "what the ♥♥♥♥ is this",
            "review_score": "-1"
        },
        {
            "review_text": "Very limited, boring as ♥♥♥♥, oh and the community is 4 years old when it comes to online.",
            "review_score": "-1"
        },
        {
            "review_text": "probably the ♥♥♥♥♥iest mlb game out there   cant beat the king",
            "review_score": "-1"
        },
        {
            "review_text": "Suprisingly a really fun game, current only downside is sometimes it fails to connect everyone to match so you have to restart game.",
            "review_score": "1"
        },
        {
            "review_text": "I've only put around an hour into the game, but I feel like I have the basic concepts of it down. It reminds me of Super Smash Bros. meets pong, and it is a whole lot of fun to play with friends and online matches with randoms. The more you play the better you'll get, as it always goes with games like this. I would absolutely love to see a sequel to this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a ridiclious ammount of small time fun, and I would not hesitate to go back to it if someone asked me to. Rounds can last anywhere from milliseconds, to minutes.  If this game goes on sale, it's a definite yes from me!  The only problem I would say is that there isn't a tremendous ammount of people online, so try to bring friends. That's the best way to enjoy the game anyway!",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome. very addictive. seems a lot like smash brothers. would love to see new characters and game modes in it. i would definetly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "i recommend this game for anyone its fun challenging and never gets old 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, especially if you can get 3 or more friends around the screen on some game pads.",
            "review_score": "1"
        },
        {
            "review_text": "Smash Bros needs more... more.... balls.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent. A little laggy at times, but I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Its fast paced, intense, and absolutely oozing with style. The netplay works great in-game, but the lobby system is a little hairy. The game shines in multiplayer but the single player arcade mode is fun too. The soundtrack is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "This game relates in the concepts of: -Jet Set Radio: Music and Art style, Character Design -Super Smash Bros.: Original 4 Player Fighting Game, Anauncer, Character Select Screen, Replayability. -DiveKick: One hit kill. So use caution... -PONG: Ball Physics,   At first this game seems pretty simple, dodge the ball and hit it to the oponent, and that is pretty much it really...  Newcomers to the game will get hit by some slow moving balls, trying to see the ball coming towards them. The fact is, that the ball will reach incredible speeds, making it litterally impossible to see coming. However it is not impossible to predict. The fighting term 'yomi' is a perfect word to describe this game, 'yomi' meaning predicting your opponent's actions.  Although this game doesn't make it totaly impossible, there is a bar at the bottom of the screen that will fill up during a hit, sometimes quick, sometimes slow. Once it fills the ball will fly out. many players abuse this to hit the ball in the same place, I assume programmers saw this so they created a shield you can activate for a brief period at the cost of your meter, from 1/4 to full. If the other player hit's this, he will be stunned and sent towards the projectile, most of the time...  This game has tons of replayability, I really recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Incredibly satisfying to play with friends, even 1v1. A gameplay that always renews itself based on different characters having different angles of 'attack' and different special abilities. The character design might not be the most revolutionnary, but the level design is solid, with small changes in room dimensions to, once again, change the pace of every encounter. And last but by no means least, the music is absolutely amazing!  If I could compare this to anything, I'd say it's a less violent, more satisfying Super Smash Brothers, without the charismatic characters.",
            "review_score": "1"
        },
        {
            "review_text": "In addition to the sweet music and simple, yet well-made graphics, this game has a surprising amount of depth, and requires quick reflexes in addition to precise timing. If you like games with all the above, then highly consider getting this.",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is easily one of the most competitive multiplayer experiences you can have. This purely skill based game is some of the most fun you can have with a room full of friends.  The only real con to this game is the online matchmaking. There are simply not enough people that know about this game, so it is kind of hard to find a full room (let alone in your region). Tell your friends and send copies out as gifts.",
            "review_score": "1"
        },
        {
            "review_text": "Endless hours of fun and excitment from this game. The feeling of joy when you first beat the boss of the challenge mode.   10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Smash Bros with a ball. Enemies become easy prey when you play Renekton.",
            "review_score": "1"
        },
        {
            "review_text": "Start at 11pm play till 6am so I guess you could say its good",
            "review_score": "1"
        },
        {
            "review_text": "Most Unique fun fighter ive played since well... Smash bros. Baseball+Dodgeball+unique characters= Good game..... Also theres good music",
            "review_score": "1"
        },
        {
            "review_text": "Jumped into a ball going so fast it looked like a line and hit it won the round and never felt so hype  this game gets a.. I Shouldent be Alive/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Mechanics are pretty solid. If you enjoyed Super Smash Bros you will probably enjoy Lethal League.  Needs more characters and personalization though.  Games got potential. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, probably one of the best multiplayer experiences I've had this past year. It's a projectile fighter, so your aim is to hit the opponent with a projectile (in this case, a ball). Simple, right? Well, you have different ways to hit the ball, directions you can aim it, and specials specific to your character that make each matchup intense. Games can be over in a second once the ball starts moving fast, or even in the first ten seconds if you play right or predict your opponents' moves. There's immense satisfaction in each return, and the game really excites you with the euphoria of good returns mixed with the rush and fear if your opponent somehow still returns the ball that you just shot at him at 10000 mph. It's sort of similar to in the projectile match between Link and Ganon in the Legend of Zelda, except you die if you screw up once. There's a few game modes that you can switch between, and there are some options to tweak your matches. The options are a little limited, but honestly, the game is so fun that you won't really even need to switch things around to have a great time. Definitely check this out sometime!  With online play: I have had some problems with online battles with friends (game freezing up after stage select, player randomly disconnecting after game), but none of these problems were fixed in under a minute and didn't occur that often. Local play is also supported and is a blast!",
            "review_score": "1"
        },
        {
            "review_text": "Pure fun. thats all this game is if you have 3 other friends and feel like having a good time then pick this game up its hilarious ill be playing this game for a lon while.",
            "review_score": "1"
        },
        {
            "review_text": "P-please help..  This game.... Is a whole different kind of drug that you probably shouldn't get your hands on ( In other words, buy the damn game ). It's one of the most addictive games I've ever played. Also, ignore my current hours. I've invested at least 7 hours straight of this game offline. yes, STRAIGHT.  TL;DR - If Super Smash Bros had sex with pong's wife, this is the result you'll get.  The game is so simple yet so hard at the same time. The goal of the game is to knock your opponent out by hitting a ball that can ricochet and bounce off of the walls. The more you hit the ball, the faster it goes. So after you hit the ball around 20 times or so, the match will turn into a cluster♥♥♥♥ of eternal schorcing hell. Surprisingly for a small and simple game like this, it's quite hard to master as there are certain mechanics that are surely there for you to learn. Mechanics? In a game like THIS? Well, each character you play as has their own special ability to hit the ball a certain way. Once you get good at using these abilities, you can really start to think competetively by finding different tactics to knock your opponent out. ( Seriously, I can actually see some sort of competetive gamemode in the future where people can rank up and all that. )  The only problem I have with this game so far is the lack of content. Now don't get me wrong, I LOVE the characters. I just wish there were a lot more to choose from. Same with maps. There's a couple different gamemodes you can play; free for all, team, and strikers ( Which is basically team mode except you don't take damage from the ball and you have to defend your team's 'goal' ). I wish there were more modes, but these modes are already super fun as it is. Other than all that, I feel like it's a solid game. It's definitely a time killer and a fun game to play when you're bored out of your mind. You'd be very surprised at how much time you'll actually be spending on this game once you start playing for a couple of minutes.",
            "review_score": "1"
        },
        {
            "review_text": "it's really fun, and possibly competitive but, like the majority of video games, gets boring after several hours. sure, it's worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "HUAH, LOOK OUT!!",
            "review_score": "1"
        },
        {
            "review_text": "This is eSports!",
            "review_score": "1"
        },
        {
            "review_text": "To put it simple, buy this game. This is so freakin fun, it's hard to describe. There's never been anything like it before, and thats one thing that makes it so enjoyable. The characters are all unique, but hopefully they will be adding more. The music is on the level of Jet Set Radio awesomeness. The game itself doesn't have much content, but the gameplay makes up for it. Some games get so intense it gives you chills. I can definitely see this game being an E-sport one day. Try to get your friends to buy it and you will have even more fun. I recommend this game as much as I can. Buy it. Now. Seriously, now. You still haven't bought it? Why are you still reading this? BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun multiplayer simple short round action. I played locally with 3 players / controllers, and it worked great. This is basically a new sub-genre of fighting games. There are no long button combo chains like in traditional fighting games (which I hate). It's simple, more so than Towerfall even, but it's a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Think 'Hyper-Pong' mixed with a healthy dose of 'Super Smash Bros.' and a side of 'Divekick' and thats what your getting with this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "do you wanna rage hard? well here is a game that makes you wanna kill your fiends faster than mario party",
            "review_score": "1"
        },
        {
            "review_text": "Ten outta ten. Very well made.  Great music",
            "review_score": "1"
        },
        {
            "review_text": "A twisted, ethereal insight into the underarm-sploodge-drenched testosterone hell, like a reflection off the gilded gold buttocks of Richard Nixon. Impeach this game.",
            "review_score": "1"
        },
        {
            "review_text": "ITS AAAAWWWWEEESSSOOMMMEEEE 'Jesus Christ'",
            "review_score": "1"
        },
        {
            "review_text": "Let me premise this review by saying that this is the most fun I've had with a game in a long time. It's definitely worth picking up if you're playing the single player matches or online 1v1 matches. Don't get me wrong, I absolutely recommend this game. However, if you're looking for the crazy 4 player online matches, chances are you'll be disappointed. This is one of the most laggy games I've ever played when playing with 3 other people, it's entirely unplayable in that respect. In a game like this, where precision means everything, the lagging completely ruins the experience. Other than that, this one's a blast.  EDIT: It has now gotten to the point where even 1 v 1 is too laggy to play. This has to be fixed for me to continue supporting this game.  This is me begging you to fix the lag issues. Please, I love this game, don't make me have to not recommend it....",
            "review_score": "1"
        },
        {
            "review_text": "THE CANDYMAN CAN!    ((Best game ever 1950-3000))",
            "review_score": "1"
        },
        {
            "review_text": "Super addicting game. It's like classic Street Fighter + PingPong .... Extreme Ping Pong Fightaaaaah!!! Even though it offers only 6 Playable Characters it adds a TON of Sking for those 6 (or Flavours as they are called in the game). It supports Onlinematching giving you the possibility to play against players world wide or with a friend. It's also Controller Friendly and it's extremely easy to understand. I would rate it 7/10 - Baratta",
            "review_score": "1"
        },
        {
            "review_text": "Remember those old days? Yeah you know, when Pong came out? That entertained so many people back then. Want to play pong again? Except... you don't? Wanna play something NEW? Like pong but Super Smash bros.?  Then, please, get this game. For only about 14 dollars you can get one of the most addicting, exciting, and fun of the year! Every cent is WORTH IT! If you get your friends to play with you too then it's EVEN MORE FUN! LETHAL LEAGUE! OMGYOUNEEDTOGETTHISGAMEASSOONASPOSSIBLE!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty rad! I can't really see anything that I dislike about this game, it's just too fun!! XD",
            "review_score": "1"
        },
        {
            "review_text": "1 000 000 speed,I BECAME DEATH,oh ♥♥♥♥ he hit it,WHAT THE ♥♥♥♥ IS GOING ON   yes I recommend",
            "review_score": "1"
        },
        {
            "review_text": "Balls. Fast balls, big balls, ferocious spinning balls, flaming balls, balls with eyes and a billycock, faceful of balls, balls galore. This game has more balls that you could ever want. BALLS.",
            "review_score": "1"
        },
        {
            "review_text": "What you see is what you get, if you see amazing fun gameplay you get that you see a lsd trip you get that",
            "review_score": "1"
        },
        {
            "review_text": "Pong on crack - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it will get crazy",
            "review_score": "1"
        },
        {
            "review_text": "Its literally if Smash Bros and Pong has a really ugly baby that people idolized because it was a child of 2 nonliving things that where both video games yet it still manages to get up every morning and not feel miserable about its horrible life.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. A simple concept that is masterfully excecuted with excellent skill-based mechanics. Soundtrack is awesome. I'm just ♥♥♥♥♥♥ that a half hour after I bought it it went on sale.",
            "review_score": "1"
        },
        {
            "review_text": "it's a pretty good game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game especially when playing with friends!",
            "review_score": "1"
        },
        {
            "review_text": "although at the moment i only have 5 hours on this game, by the time anyone reads this i will probably have 20 hours on this wonderful game. Lethal league is thrilling game that can build suspence in the player and intensify the moment of a serious match or can enlighten the player in a casual match. I rate this game 9/10 for its wonderful soundtrack that I keep on finding stuck in my head, creative and well balanced characters, unique gameplay, and its tastey visuals. The only reason i did not give this game a full 10/10 is because it is best to get if another friend has it. Playing with a friend is when this game is at its best. I give a thumbs up to the creaters of this game!",
            "review_score": "1"
        },
        {
            "review_text": "fast paced local controller co-op makes this game worth every cent. my first time playing this with a buddy made for some very intense bouts, recommend this to anyone looking for something to play sitting on your couch with a friend who isn't familiar with pc gaming.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun, simple to learn but hard to master. It's like ping pong and marvelVcapcom had a baby. Characters have different skills, playstyles, and some cool and goofy personalities. Some hit the ball different angles, some characters jump higher, some lower, some double jump, some climb walls, some ride their skateboard across the roof. It's fun trying out all the characters and seeing which one fits your playstyle. The online match making works great 99% of the time. There are times where it will take a few minutes to match you up with another player but that only happens to me if it's really late in my time zone. Any other time I can find a match within seconds. The soundtrack is awesome all around. I have my favorite stages but overall all of them have great music. Not to mention some of the stages are different in size so it affects your playstyle and forces you to adapt. There is a practice mode where you can improve on your timing and you can also play againt the computer and adjust the difficulty level. There is also an arcade challenge mode. This is a mode where you fight through all the other characters with a final boss battle. It's not very challenging but it's nice to do once. There are different modes (free for all, strikers, and teams) Strikers is trying to hit a target on the opponents side. Everyone online plays free for all but it's good to have the other game modes as options to play with your friends. What I love the most about this game is how intense games can get when the ball is going super fast. Very satisfying moments when you win those fast paced battles.   There is not much I dislike about this game. I would like to see a few more characters added. I would also want to be able to set the online games to different modes. Everyone online plays free for all which is the funnest game mode in my opinion, but it would be nice to do some 2 vs 2 online with random people. Once in a while there's lag but its rare and most likely due to one of the players internet connection being bad. Game has crashed a few times but I wouldn't call it a problem. It's happened just a few times in the many hours I've played.  Recommendation: Buy at full price. If you like ping pong, if you like fighting games, if you like intense fast paced gameplay then you'll have fun with this one.  Pros  - Different Characters with varying playstyles and skills  - Easy to learn hard to master  - Intense and fun gameplay  - Different game modes  - Up to 4 players free for all makes for some chaotic games  - GREAT Soundtrack that meshes very well with the game.    Cons  - Wish there were more characters  - Online matchmaking could use more customization",
            "review_score": "1"
        },
        {
            "review_text": "It's very fun, and addicting, however no game is without it's flaws.  Turning control seems extremely random (sometimes it lets you turn mid-air, sometimes it doesn't) I have no idea what causes that.  Online multiplayer is pretty choppy in movement and animation compared to the bot matches/local multiplayer. This didn't really surprise me, but it is pretty bad when the ball gets to the point of 1 frame windows to hit it.  Other than that, it's a great arcade style game, with good music, animation, and gameplay. Even if it's not on sale, consider picking it up.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Sm4sh but balls",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is a mixture of tag, baseball, and deadly power. The game is fun and fast paced but after a while the limited features make it repetitive. For those who wish to have a quick escape and test of reaction time then this is for you, I am split between recommending and not because of how bare it is. If there are more features and characters added then I will back this game 100%.",
            "review_score": "1"
        },
        {
            "review_text": "Pong meets baseball with the art style of jet set radio. WORKS FOR ME!",
            "review_score": "1"
        },
        {
            "review_text": "For those who really want to kill people by ramming 1 million miles-per-hour balls into said people. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Super fun, whacky take on a blend of pong and 2D fighting. Great competition online and indescribably hype playing playing 4 players local too!  I didn't have much issue with lag or anything like that online.  The controls are simple, but, in a similar way to Smash Bros, the mastery of those controls can go on and on. You can really become an expert at your movement and positioning to set yourself apart from the other players. It's not all just goofy, non-sensical mayhem.  The music is great; coherent with the cel-shaded art style.  All-around, a very cleanly polished game in terms of art and mechanics, that ultimately provides a thrilling experience.",
            "review_score": "1"
        },
        {
            "review_text": "best 15 dollars ive ever spent in my whole life (on a game of course)",
            "review_score": "1"
        },
        {
            "review_text": "Want chaos? Want fun with friends? dude get this damn game then you can't get any more craziness then this.",
            "review_score": "1"
        },
        {
            "review_text": "the other guy is in russia and i can still play against him with no major lagg problems!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun for both casual players and hardcore fighting game players. Interesting characters and amazingly fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I've force quit this game with Alt-F4 almost every time I try to play it out of nothing short of pure rage. for the love of all things holy get some friends to play with and never, EVER play against bots or attempt the challenge mode. Unless of course you enjoy watching them cheat you into defeat after defeat after defeat, only to give you a condescending roll-over-and-suddenly-stop-trying courtesy win.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and addictive",
            "review_score": "1"
        },
        {
            "review_text": "local play is awesome....",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun game, easy to learn hard to master.  ♥♥♥♥ING AMAZING soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": ":doggie: Simple, fun, great game.  If it's more than 5 doler, don't get it. If you don't have someone to play with and talk sh!t to, don't get it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Wish it was on xbox as well! (hint) 9/10",
            "review_score": "1"
        },
        {
            "review_text": "if you dont like this game, i think you need to have a jaw breaker.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and Unique, but gets repetitive/stale after a few hours. It's unfortunate because the first time playing it's a blast.",
            "review_score": "1"
        },
        {
            "review_text": "the most intense butt-ball game of your life",
            "review_score": "1"
        },
        {
            "review_text": "sick soundtrack 10/10 hit the balls rly fast",
            "review_score": "1"
        },
        {
            "review_text": "I definitely recommend this game.  Why?  PROS : Soundtrack  Gameplay Character design  CONS : Volvo pls ban dis gaem cuz 2 confusing 4 new players.  (In other words : I have no cons to add because this game is just one of the best fighting games I've ever played MK is always No 1 of course).  PRO TIP : Also tell your best friend (If you have any) to buy this game.  WARNING : THIS MAY END YOUR FRIENDSHIP AND IM NOT EVEN RESPONSIBLE FOR THAT, GO FIND BETTER FRIENDS IF YOU EXPERIENCE A SITUATION LIKE THAT. ",
            "review_score": "1"
        },
        {
            "review_text": "Baseball + Speed + Dodgeball + Characters + Specials = Awesome.",
            "review_score": "1"
        },
        {
            "review_text": "A game where dodgeball, baseball, and technically pong are all together? This game is nothing but hype. Was recomended by Maximilain_Dood. It was worth my money. Fantastic game! Im really addicted to it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing amazying!!!",
            "review_score": "1"
        },
        {
            "review_text": "PROs: + 4 multiplayer (both local and online) + simple concept and controls yet very fun and open to different gameplay + The strikes and the movements in general are very powerful and satisfying + smooth animations + voices + music  + i like all the characters without exception + neo geo vibe + I found players online within a couple of minutes but maybe due to fact that i bought the game during a sale.  steamcharts.com  suggests there arent many people playing it online  NOT PROs/CONs * ps3 controller was not correctly mapped by default. I had to do it manually  CONs - only 6 characters - theres a solo ladder and a practice mode, but solo gameplay is kinda lacking - its charming and it is the fruit of a very skilled artist, but the characters has been drawn in paint - online works well, but there are no lobbies or chat - you can't just play while waiting for somebody to connect. You have to wait in the waiting screen",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ is the best.",
            "review_score": "1"
        },
        {
            "review_text": "High speed and fast paced. Even the slightest amount of lag will have you screeching bull♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I can see why many people would enjoy this game; unfortunately, it lost my interest rather quickly. The concept is well done and original, but both the character options and game itself were too limited for me.   Lethal league seems like the kind of game that can have a fair amount of depth, but only if you invest in it (which I was not drawn to do). I'll probably play it some more, but only in short bursts.  Based on my own preferences, I can only recommend this game if you're looking for some quick fun with friends (and it's on sale). I'm only writing this review as a warning to those who see the Overwhelmingly Positive score and immediately assume this is worth a buy – watch videos on YouTube before your purchase, as you may have the same issues as me.  If I play this some more and discover some hidden love for it, I'll update this review.",
            "review_score": "-1"
        },
        {
            "review_text": "Can we take a second to appreciate the frickin awesome music in this game?",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "A must try with some friends, fun &amp; hilarious !",
            "review_score": "1"
        },
        {
            "review_text": "As ♥♥♥♥ing hard as a witches teet but its fun so hey why not",
            "review_score": "1"
        },
        {
            "review_text": "It's good, I like it a lot. The gameplay is a lot deeper than it seems. There's a few mechanics implemented by high level players that make them God-like in the competitive scene. Fun with friends, for sure.",
            "review_score": "1"
        },
        {
            "review_text": "In my first online game, I suffered a cardiac arrest from the intensity...   19 out of 10 would die of a heart attack at age 19 again...",
            "review_score": "1"
        },
        {
            "review_text": "DAMNIT DAMNIT DAMNIT  A+++ good game v fun it's like playing melee without the stigma of playing melee",
            "review_score": "1"
        },
        {
            "review_text": "is rly gud, I hit my friend with a 500 mph baseball and we both screamed",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, it managed to eat all of my 8GB of RAM and crash windows. 10/10 2015",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best game on steam",
            "review_score": "1"
        },
        {
            "review_text": "This game would be the bee's knees if multiplayer were more stable. Instead of traditional servers they just link you up to other player's Mcdonalds wifi. Very laggy, sometimes glitchy. Other than that one issue, this is an A1 fighting game.",
            "review_score": "1"
        },
        {
            "review_text": "Played 30 minutes and I already love it. It's snappy and has clean controls. The music is awesome. The concept is a clever and simple one that works amazingly well. The game does a brilliant job of making you just feel really good when you make contact with the ball though the charater animations, ball deformity, ect.  Personally playing with a gamepad has been preferable, although with only two buttons for attacks it's not difficult to play with a keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "More than i had expected. Lots of fun, its one of those games you can play (and for sure have fun) when everything else is sucking ♥♥♥ at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a sucker for 2D Games but...  This was exeptional, I mean, It doesnt seem like much but this game provided me with so much entertainment before I realized it I was entering tournements and competitions all over the place.  Its a fast paced 1v1,1v1v1, 1v1v1v1, or 2v2 kinda game. A few gamemodes and ball variants to make the game interesting. How does it work? Well, Imagine a fighter like Street fighter, and make the characters wield bats. Alright, now remove the ability to directly attack them and throw a high-speed ball in there instead. Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly fun :D",
            "review_score": "1"
        },
        {
            "review_text": "Just, unbelieveable, zany fun. A great game for anyone who likes smashing metal balls with a skateboard, a giant bass-hammer, a ping-pong paddle, all at blistering speeds that'd make you think you're ripping apart space and time itself. Even if you don't like sports, or fighters, or even smacking things around, this is a must-have for any variety of gamer out there.",
            "review_score": "1"
        },
        {
            "review_text": "A real gaffsters and goofsters type of game. Extreme ping pong dodgeball helljam extravaganza.",
            "review_score": "1"
        },
        {
            "review_text": "How it was made  1. Make a game about hitting balls 2. Give it cocaine 3. Give it kool characters 4. give it gud moosic 5. give it gud maps 6. Add colors to characters 7. Profit.",
            "review_score": "1"
        },
        {
            "review_text": "it went fast",
            "review_score": "1"
        },
        {
            "review_text": "Way fun for a simple game. Definitely worth playing with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Best practical application of exponential growth ever. Because you hit people in the face with it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's like the non-smash player's smash that isn't smash at all. Great music (literally funkin amaze), cool characters. (Haven't seen a fan fic yet.) I only cry when I get destroyed in .6 seconds by a lvl 136 switch. And I cry when I realize how few people play it now and that I wish I was into it when it first came out. A great buy, at the price of bad timing. Well did team raptor. ;_; maybe a lobby basedatch making system is in order. Relight the fire inside everyone to play this game again.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best sports game ever made! SUCK IT EA!!",
            "review_score": "1"
        },
        {
            "review_text": "nobody plays it and the only players that do play it live in africa",
            "review_score": "1"
        },
        {
            "review_text": "Good to killing time",
            "review_score": "1"
        },
        {
            "review_text": "this is a very good game, i have a lot of fun, the problem is that there is not enough ppl playing online",
            "review_score": "1"
        },
        {
            "review_text": "Fenomenally enticing gameplay formula for a fighting game where you don't actually fight. Tough as nails to master and with a perfectly chosen soundtrack. What would make this better would be a better budget spent on an expansive single player and more characters (even paid dlc would be great!).",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely FREAKING EPIC HYPEEEEEEEE, REKING FRIENDS SIMULATOR.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is ONE OF THE MOST FUN AND ADDICTING GAMES EVER. #Sonata4Life [Edit]: Screw Sonata #Raptor4Life",
            "review_score": "1"
        },
        {
            "review_text": "Turn this into a drinking game...  Whatever the rules might be...  You sure as hell wont be disappointed.   11/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game Easy to learn but hard to master Fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Highly Competitive and Definetly ahould get more credit for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "I want to start by saying that this game has been the best 15 bucks I have spent in a while! I played this all night with a friend and there were no online connection issues. The action is intense, the strategies you can come up with make the game complex, and when you get down to it, the is just FUN! All the effects create a sense of tension and hype and all the unique characters keep the matches interesting.  |Hype/10| YOU SHOULD BUY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "If you have friends to play with, buy it NOW! If you don't have friends to play with...BUY THIS GAME AND I WILL PLAY IT WITH YOU.",
            "review_score": "1"
        },
        {
            "review_text": "Its like Smash Bros. and All-Star Slamming D-Ball had a baby. This game is glorious.",
            "review_score": "1"
        },
        {
            "review_text": "I saw on a page by the developers a list of highlights about the game. It's last bullet point was 'No weak ♥♥♥♥.' My response: delivers.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredibly hype. It would be sweet if more characters and areas were added, as well as a more diverse soundtrack. The game has potential to be so much more.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced awesome fighting game! This game is all about reading your opponent, counters, counter-counters and awesome super powered smash hits!",
            "review_score": "1"
        },
        {
            "review_text": "LETHAL LEAGUES THE FUNKIEST ♥♥♥♥ I HAVE EVER PLAYED IN MY ENTIRE LIFE",
            "review_score": "1"
        },
        {
            "review_text": "A deceptively simple fighter at first glance with a somewhat unique spin on the genre.  Upon closer inspection it's a blisteringly fast exercise in ABSOLUTE HYPE. Your nerves will fray as you pounce on a 25000kph ball and deliver it right back your opponent's throat at double the speed. You will scream glorious victory as your enemies are pulverised by an object moving faster than sound, and bask in the lamentations of their women.  10/10 the speed is real",
            "review_score": "1"
        },
        {
            "review_text": "Simple, fun, addictive. Totally worth the full price",
            "review_score": "1"
        },
        {
            "review_text": "It's only been one day, but i'm already completely in love with this game. The feeling when you get the ball going at almost the speed of light is awesome, the character designs are awesome, and the game design itself is awesome. I do have one minor problem with the game though, one being that it seems Candyman is stronger than the rest of the characters at the moment, although that could very well be my imagination. Other than that, the multiplayer is just as fast as the challenge mode, with little to no lag in matches. If you were a fan of divekick or just like fighting games in general, I highly reccomend this.",
            "review_score": "1"
        },
        {
            "review_text": "I aboslutely love Indie games. This one is definitely one I recommend others to play.  Unique 2D combat. Fly EDM Tunes for BGM. Fluid Controls. Local Co-Op.  Though it lacks content, developers are adding more over time for free. Giving this indie title an 8/10 due to originality and replayability.",
            "review_score": "1"
        },
        {
            "review_text": "OOOOOOOOOOOOOOOOOOOOOOOOOOOOH ♥♥♥♥ IS THIS GAME GOOD. IF YOU INTO SMASH-BROS-LIKE FIGHTING GAMES THIS IS A FUN ONE. IT'S GOT AWESOME SONGS FOR EACH STAGE AND THEN IT'S GOT REALLY GOOD VISUALS AND ♥♥♥♥ THAT MAKES YOU GO WOOOOOOOOOOOOOOOOOOOOOO.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to play with friends! Has a local and online modes, both are up to 4 players and are extremely fun!  Really easy to learn the basics, but getting the timing right is not that easy (well, for me at least. And I'm not that good with games anyways, so don't count on that bit too much.)  Singleplayer has a challenge mode where you go through a line of opponents. It's really great, too.  I don't think I have anything bad to say about this game, but who knows what's wrong with it. I'm just writing this to say, that yes, this game is good in every aspect from my point of view. Try not to just count on one review, and go through videos, more reviews etc. to know if you really want it.",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I've had with any fighting game next to Smash. Now we wait for more characters.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought pong could get this intense",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't want to run in my PC. please help",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, Indie game to play with your fiends.",
            "review_score": "1"
        },
        {
            "review_text": "Marchettoni.Edoardo Aad me i had a lot of fun",
            "review_score": "1"
        },
        {
            "review_text": "This is the hypest sports game I've played in my life.",
            "review_score": "1"
        },
        {
            "review_text": "played game alot thought i was good ran into a guy named raised sassy eyebrows my ego got to me played him lost to a pro cryed in a corner 10/ball death would play again",
            "review_score": "1"
        },
        {
            "review_text": "Great for those who have good reaction time  -Requires prior gaming skills -Great way to pass the time -Fairly easy to learn  Overall I'd give it an 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Is good fun with mates :D",
            "review_score": "1"
        },
        {
            "review_text": "Best way to describe this game is Super Smash Bros meets TF Dodgeball.",
            "review_score": "1"
        },
        {
            "review_text": "A game about hitting your friend in the face with your balls. Need I say more?  10/10 would ball again",
            "review_score": "1"
        },
        {
            "review_text": "omfg one of the best games i've played buy it if not for the game then the music 100% recamend",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, fast paced fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is preety awesome,  Really fast passed and preety awesome characters and music.",
            "review_score": "1"
        },
        {
            "review_text": "Definatley a Jet Set Radio feel with a fighting game twist. Ive already thrown away an hour without even realizing it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "smash bros. + dive kick + pong = lethal league",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced? YES! Smash Bros. atmosphere? YES! Immerseful music? YES! Awesome characters? YES!   If you enjoy all of the above, this game will be perfect for your taste because the fast pacedness of the game and the music really makes this game addictive. Been playing it for about a day now and I find it absolutely addictive and is one of those hidden gems which people really need to know about.   I rate this game a 9.5/10! ♥♥♥♥IN' AWSESOME!",
            "review_score": "1"
        },
        {
            "review_text": "Apples are natural you don't need to wash it off before you eat it. Just go ahead and bite it ya dingus.      For Your Health.",
            "review_score": "1"
        },
        {
            "review_text": "Pong with Smash Bros with ULTAMITE INTENSITY!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "singsing promotes your game very well. at least thank him.  10/10 would fight singsing",
            "review_score": "1"
        },
        {
            "review_text": "This is an extremely fun game especially when it gets to high speeds and I would highly recommend this game to anyone. However, the lack of people playing the game and lag are the only downfalls to this great title, but overall, the best game of 2014",
            "review_score": "1"
        },
        {
            "review_text": "Very fun 'play with friends' game. Thank you my friend who gave me this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lethal League is unique, as far as I’m aware. It is, at heart, a fighting game that got confused somewhere along the line and wondered what it would be like if it was Pong. There are a set of characters, each with a unique move set, and their sole method of attack is manipulating a ball so that it hits their opponent. Every hit of the ball makes it faster and, thus, harder to avoid or hit back. Each player has a set of lives, one of which is lost each time they are knocked out by the ball. Once your life counter hits zero, you’re out, until only one player (or team) remains.   You can read the full review here!  [spiritoftherobot.wordpress.com] ",
            "review_score": "1"
        },
        {
            "review_text": "candyman must have his jawbreakers spiked with cocaine and steroids",
            "review_score": "1"
        },
        {
            "review_text": "best gam evr but it gay",
            "review_score": "1"
        },
        {
            "review_text": "Honnestly, this game is like crack to me.",
            "review_score": "1"
        }
    ]
}