{
    "app_id": 261510,
    "name": "Tesla Effect: A Tex Murphy Adventure",
    "release_date": "2014-05-08",
    "developer": [
        "Big Finish Games"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "FMV",
        "Detective"
    ],
    "achievements": 0,
    "positive_ratings": 865,
    "negative_ratings": 121,
    "price": 14.99,
    "description": "Tex Murphy is the last of the hard-boiled gumshoe detectives living in dystopian post-World War III San Francisco in the 2050s. Tex is an honest and good-natured private investigator with a penchant for bourbon, cigarettes and getting himself into trouble.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/261510/header.jpg?t=1554202871",
    "minimum_requirements": "OS: Windows XP,  Windows Vista, Windows 7, and Windows 8 Processor: 2 GHz Dual Core Memory: 4 GB RAM Graphics: NVIDIA 200 Series DirectX: Version 9.0c Storage: 15 GB available space Sound Card: Direct X 9.0c compatible device",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I had never even heard of Tex Murphy before getting this game in a bundle. The last game that came out before this one came out when I was eight years old and we didn't even own a computer at that point in time, so I was completely clueless about the series before getting it in my library. I read about and thought it sounded interesting and like a relatively quick game so I downloaded it first to give it a try.  I am so happy that I did. It is so much fun and now I definitely want to check out the rest of the serious when I have some extra money. It was funny and kept my interest for the entire time it took me to finish it. Of course there were things I didn't understand and there were several call backs to the other games in the series that meant almost nothing to me but they weren't a vital part of the game and it didn't really take away from gameplay. It was a nice little insight into the series and a brilliant ploy to make me want to buy more.  The game feels dated. It's graphics aren't the best and who really used FMV like that anymore? But that's the beauty of it. Tex is an old-fashioned man in the future and this game is much the same. To be honest, it's refreshing. There are actual characters in this game, not just flashy designs to distracts you from how boring everyone is.  Of course being a puzzle game, it can become an exercise in frustration. I played on gamer mode which disabled all of the hints and the ability to skip puzzles. Some of the objects you have to find are ridiculously small and without the flashlight hint it can take awhile to find them amongst all the background clutter. And the last puzzle of the game is enough to make you want to tear your hair out. But in general, I enjoyed the game all the way through.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first FMV game. The game is similar to a point-and-click adventure wherein you explore your environment, pick up stuff, combine, and then use to solve puzzles, however you are in a first person view, using WSAD to move.  I was genuinely entertained during the first half of the game, but as I went along, the puzzles seem to be drawn out, and items are scattered on the map on some of the most obscure places possible.  I cranked up the brightness to the max in order to even SEE all corners of the rooms - there is a flashlight but it is very time consuming to sweep every inch of the map.  This process is very tedious and for me it takes away from the fun of the game - I barely stayed because I wanted to see the ending to this Tex Murphy Adventure. The cheesy down-to-his-luck private investigator storyline made me hang on and finish the game.  I recommend this to the fans of the genre. Other adventure fans, pick up when it's on a bundle (like I did) or when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game really scratched the itch for me--I love adventure games, especially ones with full motion video, though I somehow missed out on the Tex Murphy series back in the day. Playing Tesla Effect, I kept thinking--man, we are REALLY missing out by not having more FMV in modern games. Live actors, especially likable ones with a good script to work with, add so much emotional depth to a game that just can't be delivered via 3D models. Furthermore, the FMV is integrated here very smoothly into the gameplay, and even when the segments run long, you're so invested in the story that you don't feel the game is playing itself.   I guess the game won't appeal to everyone, but I am very happy to have found it. I played it through to the end without ever feeling bored or frustrated. Furthermore, all of the nods to the older Tex Murphy games (they include a lot of the footage from those games in the forms of flashbacks) have whetted my appetite to try them out, too.   This game is more focused on story and characters than Myst or Riven and the like. It's also helpfully broken into 'days,' which you can get through in an hour or less if you don't have all day to play. The dseigners also did a good job providing you with just enough areas to explore and options to try that you don't get overwhelmed, yet still feel that you're the one solving the case.  In short, I really enjoyed this game and highly recommend it to anyone who likes adventures. One thing's for sure--if I ever see a new Tex Murphy game on Steam, I'm buying or pre-ordering that baby. This game would've been well worth paying full price and then some.  ",
            "review_score": "1"
        },
        {
            "review_text": "Best. Game. Ever.   Scifi, good humour, story rich, puzzels, mystery, great characters, good special effects. I haven't played a point and click this good since Dune 1.   I even got my face slapped twice by two different women in the space of 10seconds. The realism is uncanny.  I can't recommend this highly enough. I have no idea why metacritic only gave it 68%, they need their heads examined.",
            "review_score": "1"
        },
        {
            "review_text": "I love the idea of this game. The story and the actors made this game work. I highly recommend it, you will definitly have fun and ask for more.",
            "review_score": "1"
        },
        {
            "review_text": "Tex Murphy hasn`t missed a beat. Hoping this will be only the start from this excellent rebirth. I remember getting every one of the series. Martian Memmorandom came on a stack of floppies. Best adventure game I have ever played to this day.",
            "review_score": "1"
        },
        {
            "review_text": "This game is far more than your average point and click adventure game. The puzzles are fun, varying, and quite difficult at times, but what really makes this game is the witty script writing and excellent live action acting. Tex's constant commentary and one liners really help to keep the game enjoyable when working your way through some of the harder puzzle environments. The game also does offer a number of dialogue choices which do affect your interactions with characters, and the game's ending. A really pleasantly surprising game.",
            "review_score": "1"
        },
        {
            "review_text": "I really missed Tex Murphy games and this is a modern Tex Murphy game. If you have any interest in the old point/click adventures than I would recommend this game to you.",
            "review_score": "1"
        },
        {
            "review_text": "As a Tex Murphy fan, I was stoked after hearing about the newest installment, and boy was I eager to play! But after playing half-way through, I found myself questioning whether I should even bother finishing the game. It was only through sheer force of will and a weird, nostalgic obligation, that I managed to see it through to the end. *sigh* So where to begin?  Let's first talk about the things it did well:  Revisiting Chandler Avenue and reuniting with the old cast was a treat for old Tex Murphy fans like myself. And honestly, I didn't mind the mediocre graphics, as it felt reminiscent of the old Tex Murphy games. The FMV sequences were well-done for the most part, and I enjoyed exploring areas without running into loading screens or having to change discs. (I know I'm throwing a bone here, but it's the little things that count, right?) Unfortunately, that's where the good ends. Now on to my personal gripes:  What's with the talking, Tom Servo gadget? In the beginning and throughout the game, I was questioning the purpose of this supposed 'character'. Other than the tutorial, and occasional out of place quips, it didn't really add to the story - or much of anything else for that matter. Tex's inner monologues could have easily replaced this character - so why even bother with this?  When initially exploring your apartment and Chandler Avenue, you come across seemingly random objects which upon closer inspection, will play back clips from the old Tex Murphy games. While it's a nice trip down memory lane for fans like me, the references seemed out of place for the game's story. I understand the intent, but the clips felt rather shoe-horned in, and were unnecessary to the story's progression - not to mention confusing for those who are new to the franchise.  In terms of game-play, the pixel hunting wasn't a big deal for me. What was a big deal was having to cope with: 1. Awkward and unpredictable stealth mechanics (which will kill you) 2. Navigating security systems via clunky controls (which will kill you) 3. Dealing with random enemy patrols with questionable aggro radius (which will kill you)  All the while looking for obscure objects hidden in the environment to progress further in the story. It was an immense frustration, and made me want to quit several times--it was just, not, fun. Now if the stealth mechanics were actually fleshed out and developed, I don't think it would have been a problem. As it was however, the deaths felt cheap, and you can't help but feel as if the game is working against you.   The story...oh man, the story. For the record, this contains *SPOILERS* - so don't say I didn't warn you. The story picks up where the last game left off, with Tex suffering from amnesia from the past seven years. Now it's up to you to figure out what happened. Pretty straightforward, right? As you progress, you're introduced to more characters from your 'previous' life that you have no recollection of.  However, one of the major flaws of this game is that you never fully interact with ANY of these new characters...at all! I found myself scratching my head, trying to put names to faces and their overall place in the timeline of events. When I asked questions to folks around town, I had to remind myself who the heck 'so-and-so' was and why did I care? Overall, the story telling suffers from a severe case of exposition. You are TOLD who these characters are, and what your prior relationship with them was, but in terms of experiencing these relationships first-hand throughout the game and having meaningful interaction with any of them? Pfft! Forget about it. This is because the characters are either:  A.) Dead B.) Soon to be Dead C.) Meet in 2-3 FMV scenes only to be never seen or heard from again   The game lacks context in so many areas, that as a player I was left struggling to put the pieces together. On top of that, the game adds soap opera-esque plot twists, as if the story wasn't convoluted enough! (Chelsee was actually the daughter of Margaret Leonard but was given up for adoption because of....reasons. And J.T Donnelly was actually the past incarnation of Tex Murphy... WTF? Seriously?! What does ANY of this have to do with ANYTHING! *slaps forehead*) Jesus, in terms of trying to make sense of the story - don't even bother. The way the game plays out, it's like getting handed pieces of a jigsaw puzzle, and asking you to piece it together - in the dark, while riding on a roller coaster.  TLDR: I really wanted to like this game, but even as an avid Tex Murphy fan - I felt this was a bit of a disappointment. It had potential, but with frustrating stealth mechanics, convoluted story-telling, and dangling plotlines with no resolution or relevance to the story - I cannot in good conscience recommend this game.  I hope that if future installments are made, they get rid of stealth/patrol sequences, tighten the story (less plot holes please!), emphasize more character building and interaction, get rid of 'transition' characters (i.e. Tom Servo, Ariel, St. Germaine) and rely less on references from the older games -- it will make it infinitely more enjoyable.  If you're a Tex Murphy fan, pick it up when it's under $5. I can't see spending more than that. If you're not a Tex Murphy fan - skip this one, and instead pick up 'Under a Killing Moon' - it's dated, but it's definitely a solid and entertaining game.",
            "review_score": "-1"
        },
        {
            "review_text": "Man. Let me start off by quoting your exact thoughts: 'What the hell is this game, how did I get on this store page and what on earth am I doing here? Do I own this? Why?' Well. Please read on, because that's exactly what I thought. This might just be the next best thing in your library.   I came into this game, not knowing what to expect at all. I had bought just another Humble Bundle, and this game happened to be in there. I selected one of the titles which had a pretty interesting name. Tesla Effect: A Tex Murphy Adventure.  I had absolutely no idea what kind of game this was going to be, and then I looked at the screenshots. They looked like actual photo's, or videos. Interesting. Decided to give it a go and download it. Booted it up, and man I was hooked.  The game just keeps hitting you with witty remarks, thinks that break the fourth wall, but in a good way. Heck, here's an example. When examaning a wall in this game, at one point Tex says 'Is this the fourth wall? Because I don't want to break it.' It's just plain hilarious, and yet interesting. I love point-and-click adventures, and this takes it a step further.  At first however, I was not at all impressed with the quality of the game. I loved the dialogue, but the acting and whatnot from pretty much any actor other than Tex, felt out of place. However, the story was intruiging enough to keep me playing, and I gotta say, it was worth it. After a while I got accustomed and didn't even mind the acting; here and there it's bad, sure, but it's got it's own vibe.   This game is so refreshing from any other game I've played. I would absolutely recommend you checking this game out. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "If you have a single adventure gaming bone in your body, you owe it to yourself to play this game. Storywise, I've always considered the Tex Murphy games to be some of the best in the business, and this save-the-world-(again) scenario once again delivers. The acting and the green-screen effects deliver the same B-movie aesthetic that made Under and Killing Moon and Pandora Directive so memorable, except everything looks so much better.  And, as always, Chris Jones *is* Tex Murphy. He, more than anyone/anything else sold the Tex universe, and it's great to see that 16 years on he can still give us a Tex worth rooting for.",
            "review_score": "1"
        },
        {
            "review_text": "Well ... Great ! I had a little fear before playing cause I LOVED preivious tex games and ... Well it's really a true, fantastic tex games, good music, good scenario, fair graphics and all the nostalgia of old tex are here ! VERY GOOD WORK !",
            "review_score": "1"
        },
        {
            "review_text": "This game is underrated, and if I did a list of top ten games of 2014 I would put this on my list. I have never heard of the Tesla effect series until I played this game and this game was a new experience for me. The game has an interesting story, well developed characters, especially the main protagonist Tex Murphy and thrilling asmophere that drawn me into the experience.  FMV's are often making fun of, of how crappy they are and there comes a time when a game amazes you and this is the game. The downsides are the puzzles but happily some are easy to pick through and others you wish you didn't press the skip button and lost points (Yes watch out for that) Overall good game and I would recommended it. ",
            "review_score": "1"
        },
        {
            "review_text": "Tex is back! Straight from 90-s to a modern world. Same Tex, same charm, same gameplay. Maybe it's nostalgia, maybe some games and charecters never get old. But hell yeah! Tesla Effect is something that walked in a room looking old, but everyone who are modern shuted up and admired it. Great new instalment to infamous series of adventures.",
            "review_score": "1"
        },
        {
            "review_text": "2050 noir. Video (as in games of 90-s) and 3d graphics combination. The story is nice. Awesome, especially for those gamers of 90-s. )",
            "review_score": "1"
        },
        {
            "review_text": "Tesla Effect: A Tex Murphy Adventure is a great game that plays more like a movie. This game is especially enticing for those of us who played Under the Killing Moon, Pandora Directive, and Overseer for the nostalgia effect. With plenty of in game references to the aforementioned titles and the same campy-corny humor that we've come to expect and love from good ol' Tex Murphy, its a great game for both returning fans and new players alike. The cinematic scenes are in HD and look great and the in-game graphics are above average. Finally, the puzzles are challenging, but for casual gamers there are options to be able to skip the harder puzzles to allow the game to proceed without causing too many headaches. Definitely worth the price!",
            "review_score": "1"
        },
        {
            "review_text": "I'm just going to say it this was an awesome adventure......  Well 16gbs and it gave us nothing but a classic hd comeback of tex murphy. I played the other games as a kid wanting to be a police man but the games gave more the a taste of what it could be lol's. Humor and puns are the game plus a flashback to my childhood when you see the easter eggs all over the city. It's worth playing this beacause its a diffrent adventure game from all others plus all the endings are awesome / funny as hell but in serious the game is worth every penny to play comn and join the case as tex murphy!!!!!!!!!!!!!!!!!   Pros;  Humor is really good here.  The game feels like a movie.  Really makes you scratch your brain?.  Music is solid in this game.  Cons:  Goofy game all togther.  Makes want to flip tables sometimes it's diffucult  -Hope this review helps It's a great game!!! P.S play the other tex murphy games before this !!!!",
            "review_score": "1"
        },
        {
            "review_text": "Wow! A great throwback to the classic Tex Murphy! Definitely a genre of game that you don't see a lot of anymore. I'm happy that the fans made this happen. Hopefully this isn't the last we'll see of Tex!",
            "review_score": "1"
        },
        {
            "review_text": "If'n you liked the previous entries in this B-movie Noir series, then you'll enjoy this one as well! Here's hoping they make another.",
            "review_score": "1"
        },
        {
            "review_text": "This one should've been a Telltale game. Excellent wrtiting, characters and acting, sadly spoiled by some pixel hunting. Easily recommended if you dig the style.",
            "review_score": "1"
        },
        {
            "review_text": "Point and Click adventure games were never my style, but i actually had fun with this one.  Something about the clever narration just Draws me back in. I may have to give the older ones a try. :D",
            "review_score": "1"
        },
        {
            "review_text": "I would like to thank all the developers for bringing back all those memories. I would like to thank the big P. I. in the sky for making this possible. I would like to thank all the supporters who helped this game come to life.  For years I never thought I would play another Tex adventure. A tear drop came out of my eye when I saw Chris Jones again. A manly tear, of course.  11/10, would drop my gun out of the window again.",
            "review_score": "1"
        },
        {
            "review_text": "Good Ol' Tex Is Back:  If you're a fan of old school point &amp; click adventure games, you probably know who Tex Murphy is. For those that don't, Tex Murphy is a perpetually down on his luck, old school, wisecracking private eye, in the vein of Sam Spade. The games take place in the near future, but with a distinctly Film Noir vibe to them. They are a series of FMV-heavy point &amp; click adventure games where Tex generally starts out with what seems like a simple case that leads him into conspiracies and wacky cults seemingly over his head. Through a combination of investigative skills, wit, charm, and dumb luck, you, as Tex, must solve the case and save the world.  This game, 16 years after the release of the previous Tex game, Overseer, is a Tex game through and through. It plays just like the old games, albeit better looking and with a more modern interface. The gist is still the same and the game has the same self-depreciating humor of the old Tex games. It also packs a ton of fan service. If you're new to the series you will miss a lot of references, but they're not critical to the enjoyment of the game.  Like any point &amp; click the game is filled with puzzles. Most of them aren't too difficult, but there's at least some challenge to some of them. Best of all, none of them are completely nonsensical, they at least make some sense, even if it is in a cartoonish way. Like previous Tex games, the game is very heavy on dialogue, even more so than most point &amp; clicks, and you have options to how you want to talk to people, generally giving you options to try to be charming, be a smartass, play it straight, and so on. You also get to make some choices during the game and there are multiple endings. I've only gotten one so far, but I intend to play the game again in the future to get the rest.  The game took me a little over 14 hours to complete, which is pretty meaty for a point &amp; click. In my experience, most point &amp; clicks last 8-12 hours.  Visually, the game is a mixed bag. The FMV video is super high resolution and quite nice, while many of the textures are kinda low res and sometimes clash with the FMV. It;s not exactly a big budget game so I'm more surprised by how great the FMV looks rather than how low res the textures are.  On the audio front, as in previous Tex games, the voice acting is all over the place, from amateurish and cheesy to professional and high quality. This strange mix has always worked before in Tex games, and it works well here as well. I think because the game doesn't take itself too seriously the cheesy acting winds up being a plus rather than a negative.  Overall, it's a very enjoyable game. If you're a fan of Tex then it's a no-brainer. In fact, whay are you still reading this? You should be playing the game right now. If you're a fan of point &amp; click adventures you will most likely like this game. If you don't like point &amp; click adventures, this game won't change your mind.",
            "review_score": "1"
        },
        {
            "review_text": "This is like a basic 90's games for 90's kids who dont go outside and stick to this new 90's game. Danm i love the 90's.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for dirt cheap and didn't expect it to be something I'd be putting some time into. But, 6 hours in and I'm determined to solve it the mystery! Eventually..",
            "review_score": "1"
        },
        {
            "review_text": "Good old Tex.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a gamer ever since I convinced my reluctant Grandfather to let me touch his Ti-99/4a computer. He was boasting how he just got the new expansion box for it that allowed him to use 5 1/4 inch floppy disks. I had no idea what he was talking about back then. He hadn't even transfered his programs over to it yet so when he let me try out his newest horse racing game I had to type commands on the keyboard. Then put a cassette tape in the cassete player that was hooked up to it and press play and wait till it loaded. Then type run. I was hooked. I have grown up over the years and I have played and watched games grow up. Baby pixels to toddler Sprites just learning to crawl all the way up to vector formats and todays complex 3d images and the begining of VR. Sorry for the long preamble but I just wanted you to know a little about my gaming history before I gave my opinion on this game, which should already tell you how much I like it because I always mean to write reviews but never actually get around to it.  I have played some of the old Tex Murphy Adventures and a few other FMV games as well as many many other types of games and to date......Now don't get me wrong it's not newest game or has the best graphix engine and it isn't perfect but this game is one of the best games I have ever played in my life. I woke up this morning, had my coffee and looking for anything unproductive to do today on a day off I started Playing Tesla Effect.  Right off the bat this game shows it has something for everyone. A New gamer and looking for a fun time killer with out Impossile to solve puzzles keeping you from enjoying the game to its fullest choose the casual diffuclty level and get hints and ocassional options to skip them. Hard core gamers selecting gamer mode wont get hints or be able to skip difficult puzzles. I started playing this game and could not tear myself away until almost midnight after completing and seeing one of the games endings. Your choices steer the game to your final destination. Even if you haven't played any of Tex's previous games the flashbacks still add a great touch to the game. The comedy and sometimes Mr Bean like antics kept me smiling and wanting more keeping my boredem away. Like all FMV's should the cut scenes add such a movie like quality that most of the time I felt like I wasnt really playing a game but experiencing a movie that I was trying to craft. I couldn't wait to see what I made happen to me next!  Unlike a lot of todays games (even with the best game engines and artwork) this game did not make me feel like I was doing the same thing over and over again, but kept me entertained,on the edge of my seat, cracking up and eager for more. I hope they make more! Weather you are a Hard core gamer or just looking for something to pass the time you should play Tesla Effect. It's what all FMV's dream of being.",
            "review_score": "1"
        },
        {
            "review_text": "Brings me back to the glory days of the 'Future of Video Games' when Sega Saturn launched FMV games. However, this is the only game that has successfully melded the game and full motion video. All other previous hybrids I have played before have been misreable failures.  And even though I hadnt heard of Tex Murphy before this game its very easy to jump right into the story, identify with Tex, and realize that the pulp and noire feel just works seamlessly. Tex really needs no intro. Prior to starting the game I feared there was going to be too many references that were inside jokes from previous chapters of the Tex Murphy saga. Im glad to say that this stands alone well and everyone can get the same level of enjoyment whether they were very involved with previous storylines or are a total newcomer like myself.  Easily a 4.5 out 5 stars. The half star deduction will be explained later. But its nothing that should stop you from getting the game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, very engaging and interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia to the MAX. While I never even heard of Tex Murphy prior to this game, it does make me want to go back and play the older ones. The FMVs are the great, using the advances of the past several years. The 3d graphics are notably dated, reminding me of early 2000 games. But we arent here for the graphics, it would be like playing CoD for the story. The story is excellent, given its goofy/campy nature (which I feel makes it even better, too many games these days try to make themselves to be more serious and profound that they really are). The plot is something right out of the 90s-00s cyperpunk genre. I could rattle on and on about this game, but I wont. So Ill just give it a good thumbs up. If you like cyberpunk, film noir, have about of nostalgia for 90s-00s games and/or point/click adventures. This is a good buy for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is your 2014 Game Of The Year.  Yes, its old school. Yes some of the graphic can be a little dated and the 'NPC's' are not of the state of the art.  Big deal.  This game trumps all recent adventure titles in the past 10 years and makes the much ballyhooed The Walking Dead look like a indie turd by comparison. For 20 bucks, you will get 15 hours of pure-gaming-bliss.  I was a backer, and I was a fan of the original Tex titles, but this is the best Tex EVER, beating out the legendary Pandora Directive. You owe it to yourself to buy this game, grab a nice drink, a bag a chips, a pair of headphones and some quality alone time with your PC.  Out of all the games being made today, with the huge budgets, advanced graphic technology and women used as sex objects, its refreshing to see this game, with an amazing yet mature storyline comne out that puts the rest of the industy to shame.  Bravo Chis Jones and Big Finish, this game rocks, now don't wait almost 20 years for the next one, we backers will back you as long as you need us and as long as you keep making games THIS GOOD!",
            "review_score": "1"
        },
        {
            "review_text": "If you ever had the privilege of playing Under A Killing Moon or any Tex Murphy game you WILL love this game! I was thrilled to hear that a new Tex Murphy game was comming out. Bought it the day it was available. For what this game goes for it's a sure thing.... Money well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Often when old series are revived in modern installments, the gameplay is changed or dumbed down to appeal to modern audiences, leaving fans alienated. Not so with Tesla Effect. The gameplay is more or less identical to the last few efforts, for good or ill. While not as fiendishly difficult as Under a Killing Moon or TPD, there are still puzzles to be found sprinkled throughout the game. There are many surprisingly well-acted and high budget, high-resolution FMVs, some great humour and alternate endings depending on some decisions taken. Weaknesses are the length and the way the story seems to fizzle out half way through (many major plot events are simply left hanging).",
            "review_score": "1"
        },
        {
            "review_text": "Just finished TE and found it to be one of the most enjoyable games I have played. Now, fair warning, this is a point-and-click adventure game, so if you do not like that type of game, then you probably won't love it the way I do. However, if you do like that genre, this is a wonderful game for you. If you played any or all of the Tex Murphy games from about ten years ago--Under a Killing Moon, The Pandora Directive--then you are in for a double treat. Many of your favorite characters are back, and Tex is played by the same actor with all the wisecracking and corny P.I. jokes (of course). One of the things I got the biggest kick from is the flashback sequences drawn from the old games triggered by objects in the environment (remembering how Tex got a hole in the brim of one of his fedoras was one of my favorites). The flashbacks appear to be the FMV from the old games displayed in a little letterbox in the center of the screen. The new FMV shot for this game is high-def and full screen and looks and plays beautifully. There is a casual mode for beginners with hints as to what to do next and objects that are needed for the story highlighted by Tex's trusty flashlight. More experienced adventure gamers are going to want to play without the hints or the object-highlighting, but either way this is a great ride--especially if you played any of the earlier games. I played without the help, and while there are a few items that took a bit of work to find and a challenging timed puzzle at the end of the game, I only had to rely on the Universal Hint System two or three times.  So a great point-and-click adventure for anyone, and a special treat for Tex Murphy fans from earlier games, Tesla Effect is not to be missed.",
            "review_score": "1"
        },
        {
            "review_text": "As the time of this review I got 2/5 endings, with save files for the other 2. Tesla effect is like that old quote from batman 'he is not the hero we want but the one we need' In the days of over-hyped dlc fests that need DOD level processers to meet the base requirements, we have something in my opinion that is a game of the year that took gamers coming togther and producing something quality. Is it perfect no but it proves games don't need to be 60$ dollars and need alot of horse power to have good characters and a very good story.   If you have never played any of the old Tex Murphy games, you will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "LOVED IT! It was a long wait and it didn't disappoint. Same ole Tex, ya gotta love him. It was so great being back on Chandler Ave again too. I played several times to get all the paths and endings. Between myself and my friends and grandkids we have logged a lot of hours playing on my computer.I have been a Tex Murphy fan for decades and could no longer play my original games on disk on the newer windows computers. I was happy to find Under A Killing Moon, Pandora Directive, and Overseer available for streaming here as well. I am also enjoying replaying them again. They still hold up as great games and are not disappointingt me. If you like a good story and lots of just plain FUN to play you'll love Tesla Effect.",
            "review_score": "1"
        },
        {
            "review_text": "Got this as part of a humble bundle, and boy am I glad I gave it a shot. If you played 90s point and click games, have a soft spot for cheesy jokes and acting, or even just appreciate bad movies or watch MST3K, this will be right up your alley. I imagine that this game was a dream come true for fans of the series since I loved it and hadn't played any of the prior games. Took me a little over 10 hours to complete one playthrough and since the story was Interesting enough, I'll be playing this again for a different ending!  PROS: Great point and click adventure Good puzzles (not the best, not the worst) Great video, music, and design quality Interesting story Good amount of humor Plenty of references to prior games that won't confuse those that aren't familiar Some of the actors are quite funny  CONS: Largely story based (as point and clicks tend to be) Some of the acting is lackluster, or unbelievable Some locations are utilized too little or too much, making you stay at some places much longer than others Some pieces to puzzles may not be intuitive or may be hard to find Most, if not all, deaths in the game are attributed to cheap deaths that you can't really avoid without dying first",
            "review_score": "1"
        },
        {
            "review_text": "Its brilliant, played it with a friend over e few evenings, solving puzzles, figure out what is next, and watching the story unfold,  add some beer and you'll get a great time.  Do not care about the graphics, this game is not about that. ",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the old Tex Murphy games, you'll enjoy this game too. Only downside for me what the framerate improvement kinda made this game hard to play for more than 30 minutes at a time without getting vertigo. My dad, who was the biggest fan of the series, couldn't handle the game even with the settings adjusted.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't quite finished it, but i made it a good chunk in.  I'm really enjoying this game. Its unique in a world saturated with twitch shooters. The story is engaging, and the UI is my favorite as far as Adventure games goes. After this, im going to go back and check out the other Tex Murphy games",
            "review_score": "1"
        },
        {
            "review_text": "It was not boring or awful. I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "Being someone who has played Tex Murphy games since the second one, I enjoyed Tesla Effect and confident to recommend it to other folks who have played the earlier ones.  For the folks who have yet to, I recommend playing the the original FMV Tex games first otherwise you won't get to appreciate this game as much and make the mistake of writing it off as another mediocre Steam game.  It's not perfect. The first half of the game was a sublime mix of FMV and 3d adventure gaming, but during a point half-way in the game, the FMV and humor gives way to puzzle minutiae, which turned me off. Thankfully the game gives you the option to bypass most puzzles in case you want to see how the story plays out without beating your head against the wall.  It's a throwback to 90's gaming, warts and all, and I hope they make a sequel!!",
            "review_score": "1"
        },
        {
            "review_text": "never played any of these games before, got it as part of a bundle. Played a bit and wow, strangely engaging and rather funny. So yeah, on my limited playthrough sa far it seems pretty darn coolio.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't quite finished it, but i made it a good chunk in.  I'm really enjoying this game. Its unique in a world saturated with twitch shooters. The story is engaging, and the UI is my favorite as far as Adventure games goes. After this, im going to go back and check out the other Tex Murphy games",
            "review_score": "1"
        },
        {
            "review_text": "movie 80% gameplay 20%",
            "review_score": "1"
        },
        {
            "review_text": "Old school game wich stays true to the previous games, full of humor and fun puzles but with better graphics and gameplay. So if you are familiar with Tex Murphy this is a must have/play game.",
            "review_score": "1"
        },
        {
            "review_text": "I played two previous Tex Murphy adventures when I was younger: Killing Moon and Pandora Directive. This new game is better than both of them. It still features most of the original cast that you know and love but vastly improves on the control interface. Gone is that clunky old 'push the mouse button to move, use the arrow keys to look up and down' interface. It's now a streamlined WASD movement configuration that everyone is used to by now. It still has the great puzzles and sense of humor. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Just as fun as I remember. Two thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "Coming in as someone that's never played the other Tex Murphy games I can say this was an abolsutely wonderful experiance! And I'm going to play the others because of it.  ",
            "review_score": "1"
        },
        {
            "review_text": "A fun game, with good duration. In casual mode the flashlight highlights liftable objects and provides a hint system, which I had to use a couple times because I missed interactable objects in the environment (like a light switch at one point, which was very obvious in retrospect). Full of goofy characters and fun.",
            "review_score": "1"
        },
        {
            "review_text": "I never played the other Tex Murphy games, so I can't tell you how it stacks up against those, but this game is great by itself. It delivers. I was looking for a game to immerse myself in for a few hours, in order to forget about the real world for a while, and this game is just that. Tesla Effect has a compelling storyline, interesting characters and locations, with puzzles that are challenging, while at the same time, not requiring a super-genius I Q to solve. It is well worth the purchase price.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first video video game. I think I approached it properly, with a comfortable chair and my trackball. I enjoyed the cutscenes the most, but the puzzles came a close second. This game is not for everyone, but if you want a different, HILARIOUS(if you like the cheese) ride then get this game! If you have a hard time with the game and you just want to enjoy the cutscenes dont be afraid to use a walkthrough guide. Sometimes a quick glance at a walkthrough guide can help save you tedious-time.",
            "review_score": "1"
        },
        {
            "review_text": "It's the best game of the series. It's Tex in HD!",
            "review_score": "1"
        },
        {
            "review_text": "One word :  Amazing  More than one word: Brings back so many wonderful memories about the games I grew up playing. The FMV just feels right for this and I felt like I was part of the game. Not just playing it. I felt included. There is a baby mode for me that will help you and a mode of everyone else that will not hold your hand.  Very funny and very cheesy. I would highly recomend. I also think it would make an awesome Sandwich.  Need to find the other games now XD.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 for most cringy acting ever TOPKEK",
            "review_score": "1"
        },
        {
            "review_text": "As someone who grew up playing computer games in the 90s, Tesla Effect offers a fantastic return to an era when the capabilities of the computers of the day were pushed beyond their boundaries with spectacular results. While Tesla Effect won't tax any modern computer, it still offers a compelling game with good graphics, which will hopefully stand the test of time.  I'm a diehard Tex Murphy Fan. When I first started the series with Under a Killing Moon and its four CDs under DOS, I was instantly hooked. Having played the games that followed, I was always keen for more, so when Microsoft bought Access and effectively killed Tex Murphy, especially after the cliff-hanger that ended Overseer, I was devastated. Thankfully, due to a successful Kickstarter campaign, we now have a conclusion to that story, with spectacular results.  Tesla Effect continues the same formula as its preceding games, which is actually not a bad thing. If you've ever played Under a Killing Moon, Pandora Directive or Overseer, then you know what you're getting into. In terms of gameplay mechanics, Tesla Effect benefits greatly from being produced in the modern era, with fantastic graphics and a solid control system in place that's a massive improvement from the clunky controls (relatively speaking) of the prior games.  Tesla Effect continues the trend of Full Motion Video (FMV) embedded within a digital game world the franchise was famous for, which offers a great experience. While most games these days tend to use digital models for people, Tesla Effect, and its preceding games, capture real actors and place them within their digital environments. This provides for (IMO) a much better story delivery method, which has always been used to great effect in the Tex franchise.  While the game can be played stand-alone, it's probably better if you jump back to Overseer as its story bleeds into Tesla Effect's to a degree. There's plenty of homage to the franchise, which should bring great excitement to fans (Which I certainly loved!), but it may not have the same effect on those who've never played the series before.  Tesla Effect essentially boils down to a detective adventure game within a 3D world you can explore. It is loaded with lots of puzzles for you to sink your teeth into, as well as a witty story rife with choice. You will be expected to look closely at the environment to find elements to assist you on your quest, which at times can be a little irritating as the items are either obscure, or blend into their environments a little too well, but the reward for correctly identifying, combining and utilising the items is satisfying.  All interactions with characters are provided through simple but vague options which you can choose. Importantly, the game is designed such that the choices you make as you interact with the characters have the ability to shape the game's ending, which is nice. Each of the options provides an interesting and often humorous reply from Tex, sometimes leading to your downfall if approached poorly.  For fans of the series, all of the key actors are back and this is absolutely fantastic. It's great to see so many actors from the franchise put their hands up to recast their roles after such a long time, which provides great continuation for the series and continues to anchor the game in the franchise's world. The new cast members for this game, such as 'The Soup Nazi', also work well, but there are also a few other well known celebrity actors included in the game too, much like in the earlier games.  Overall, if you're a Tex Murphy fan, most definitely pick this up. If you've never played Tex Murphy games before, you owe it to yourself to try out what was, in my opinion, one of the greatest gaming franchises of the 90s. If you’ve never played Tex games before, pick up the preceding three games and give these a go too. While their graphics become increasingly dated and ordinary with age, their stories and detective mechanics are what really make them shine, and therefore, still worth pursuing.  Tesla Effect: A Tex Murphy Adventure, is a game I most highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I have never played a Tex Murphy game before but I must enjoy I really enjoyed this one. The little flashbacks to earlier games, the campy videos. As lon as you don't expect something too serious, this should be enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I buy this game for a bundle and this game very good what i expected.Game graphics and real world actors very good looking together in the game.Story very funny and gameplay no boring.Puzzles very good balancing and actors very very good acting.If you want this game dont think and buy.You dont be regret.There is a very funny game and gameplay and a lots of easter egg.",
            "review_score": "1"
        },
        {
            "review_text": "Is this cheesy oldskool FMV adventure game? Of course it is, but if you go searching for a Tex Murphy game this is what you should be expecting anyway. I had about 10hrs of fun with the game and can recommend it. Just be sure you know what you're getting into. Both the puzzles and the graphics are nothing to write home about, but if you're looking for old school FMV Tex Murphy you should not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "This is an old school gaming title that I really appreciate since I'm a big fan of Tex Murphy adventures.",
            "review_score": "1"
        },
        {
            "review_text": "I would give this neutral if I could, but when I thought if I'd recommend it to a friend, the answer's probably no. If you like Tex Murphy out of nostalgia purposes, then go ahead and buy it. The game really is funny. I definitely chuckled sometimes, but there were other times when I was super frustrated playing this game. My computer just doesn't run this thing well. There is massive lag and framerate issues. Now my computer isn't no prize chicken, but it can run Skyrim, Fallout, Civilization, and other graphic intensive games. The graphics of this game don't even hold a candle so it's a wonder why my computer can't play it. As for gameplay and story, it is just 'Eh.' I kind of had to force myself to continue.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is hard for all the wrong reasons, which sucked the joy out of the great story.",
            "review_score": "-1"
        },
        {
            "review_text": "Potential game-breaking bugs forcing constant reloading trial and error nonsense. Don't think outside the box and don't do anything before the game tells you to. Play at your own risk.",
            "review_score": "-1"
        },
        {
            "review_text": "  'Oh, an anvil. I'm sure it'll come in handy later.'   (actual game quote)  What sinks this game, after all, is its inept game design: 95 percent of the gameplay consists of  A) tedious, sometimes frustrating pixel-hunting for silly objects that are employed in unprecedentedly obtuse ways: 'find all baseball cards to unlock safe' / 'clean petri dish to open locker' ..... game is from 2014 but more reminiscent of 1980s text adventures.  B) an absurd mishmash of cobbled together logic puzzles, which feel hopelessly tacked-on and completely disrupt any stylistic, thematic, and gameplay cohesion. It's painfully embarrassing when the developers suddenly insert an entire Ancient Egypt section with puzzles like the  river crossing problem  and probably think this is a great idea.  Your role is always confined to abstract, low-level problem solving that has  nothing  to do with the story itself. The story is neatly told through high quality FMV cutscenes while you are searching for screwdrivers, sausages and nose hair trimmers in low quality 3D environments.  Tyrannosaurus Tex. It's one, huge dinosaur of a game with graphics from the early 2000s and gameplay from the early Pleistocene. Like  Duke Nukem Forever , this is a game that came out 15 years too late and, maybe, should have never been made in the first place.",
            "review_score": "-1"
        },
        {
            "review_text": "The writing makes my head hurt.",
            "review_score": "-1"
        },
        {
            "review_text": "Tesla Effect is bad in so many ways.  Visually it looks like a game from 1999. The acting and actors' makeups in video scenes are horrible. The dialogues are super cheesy and the story consists mostly of cliches (the main hero has amnesia - wow, who'd expected this in a videogame!). The UI is absolute garbage and looks like it was designed by a hundred different people - everything falls apart.  Overall, it doesn't feel like a new game about Tex Murphy. It feels like a game from 90s remade in 2010s. This will probably please the old fans of the series, but if you are not one of them, stay clear of Tesla Effect.  ",
            "review_score": "-1"
        },
        {
            "review_text": "et is better a game then tesla effect",
            "review_score": "-1"
        },
        {
            "review_text": "one of the most horrible games out there, bad graphics, awful mechanics, the puzzles are getting boring, just a waste of time, this game does not deserve a single dime.",
            "review_score": "-1"
        },
        {
            "review_text": "no idea what the ♥♥♥♥ this is",
            "review_score": "-1"
        },
        {
            "review_text": "I have not played this game through yet, but I have reached day 6 until now and find its story not only amusing but also intriguing and fascinating. It holds many mysteries, chuckles and grins, and a lot of great private investigator clichès. The story - at least up until where I got - keeps you riddling and being at that the puzzles are mildly challenging, too, yet nothing compared to Myst, which in my opinion is unsolvable without a walkthrough.  So in comprehension if you are a fan of detective stories and 1940's-60's ones at that and want to see them transitioned into a very well woven athmosphere of this era set in the future of 2050 be assured this game will not let you down.",
            "review_score": "1"
        },
        {
            "review_text": "Good old Tex Murphy. Ok so the 3d portions of game doesn't look the best for today's standards, but the videos and the rest of the game still has the Tex Murphy charm.",
            "review_score": "1"
        }
    ]
}