{
    "app_id": 261530,
    "name": "Lifeless Planet Premier Edition",
    "release_date": "2014-06-06",
    "developer": [
        "Stage 2 Studios"
    ],
    "publisher": [
        "Serenity Forge"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Walking Simulator",
        "Adventure",
        "Atmospheric"
    ],
    "achievements": 15,
    "positive_ratings": 2129,
    "negative_ratings": 635,
    "price": 14.99,
    "description": "PREMIER EDITION - While seeking life on a distant planet, an astronaut discovers an abandoned Russian town. He suspects his mission is a hoax until a mysterious young woman saves him from a strange and deadly phenomenon...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/261530/header.jpg?t=1515116801",
    "minimum_requirements": "OS: Windows XP Processor: Core 2 Duo or AMD equivalent Memory: 1500 MB RAM Graphics: NVIDIA GeForce GT 430 or ATI equivalent DirectX: Version 9.0c Storage: 900 MB available space Sound Card: DX9.0c compatible",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i3 or faster Memory: 3000 MB RAM Graphics: NVIDIA Geforce GT 640 or faster DirectX: Version 10 Storage: 900 MB available space Sound Card: DX9.0c compatible",
    "reviews": [
        {
            "review_text": "I wish I could recommend this game, since it does have a certain beauty. But in the end too many negative bits sucked the fun out of it for me. It just felt tedious towards the end. Here is what is good and bad.  The good:     Beautiful Landscapes:  You basically “run” (more on that later) through a series of truly well-drawn landscapes. The graphic textures are not always the greatest, but overall you get some stunning visuals. Especially the vertical elements can be quite remarkable.     Atmospheric Sound/Music:  Minimalistic, but appropriately used. Simply good.    The not-so good:     So… much… walking… :  Unfortunately your movement speed is not very high. Which means that you transverse above mentioned landscapes step by step by step for what simply feels way too long. It certainly contributes to the atmosphere of solitude/lifelessness (because very little is happening while you walk). Just, that is not a very neat atmosphere to build up. The whole thing is compounded by the fact that:    The  story does not move forward:  Most of the time you are running somewhere you are doing so without much motivation, but simply because you are following the only viable way through this world. Not everything has to be open world, but at least give me a reason why I should now be traversing the lava level. God, I felt with my character when he character said “I demand answers! Now!” some hours in. Neither of us would get any for many more hours.      Unmotivated Discontinuity:  Sometimes a new level begins without any discernible transitions from the last. Example: Last minute it was daylight and you were standing on a cliff. Next second you are in a canyon and its night. Eh, what?     Puzzles are way too easy:  Most of the game you are following a giant “follow me” trail of glowing green, the only challenge being to keep your motivation for these long minutes. Puzzles are sparse (which in itself is a bit of a problem for a puzzle platformer), and never pose the slightest challenge. Like one-moveable-object-besides-one-landmark-easy: move object to landmark, done. When you get stuck, this it is very likely because you overlooked a required booster pack that is hidden a few hundred meters back. And who explores slightly off track at this walking speed?     Abilities are arbitrarily removed:  At some points you get a cool booster pack. Not only does it allow you to solve some platform puzzles, it also allows you to move quicker (yay!). Now you can spend an hour flying around with this thing in one level without a problem. But as soon as you cross a line the game declares it has run out of fuel (regardless of how long you have been using it). This is feels completely arbitrary. Similarly, sometimes the plot will decide you need more oxygen, regardless of when you refilled last or what you have been doing in the meantime.    Overall, a tedious experience with some visisal perks. Did not go into the story becuase it might be subjective, but personally I am not blown away.",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: There is a Premium Edition FREE upgrade for current owners in 2015 so buy now!  TL;DR at the bottom.  Lifeless Planet is an incredible game filled with atmospheric joy and a story that only gives you just enough to figure out what is going on. You play as an American astronaut that is sent to explore a planet that your readings suggest is brimming with life. Upon arrival you find that this planet is nothing like you expected. It houses strange secrets of past explorers and a nation trying to find the perfect life away from Earth only to find that meddling with things they don't understand almost never ends happily. An interesting mix of casual exploration and platforming, it keeps things relatively fresh most of the time. You should feel the want to get to the end to see how everything pans out and what the mysteries of this Lifeless Planet are, but at the same time your feeling of eerie isolation and the ambient sounds of the world make you want to take your time looking at the planet and chilling out as well. I became lost in the isolationist atmosphere and didn't want it to end.   If you peer at the store page for this game and look at the user tags you would think that this is a game in the same genre as Dear Esther and the other 'walking simulator' sorts of games. In some instances this is accurate, but in Lifeless Planet you have more than just your feet to work with. You are in a space suit with a jetpack! So while this game is semi-casual most of the time, there are a fair amount of platforming situations in which you must use the jetpack to make some pretty intense jumps now and then. I wouldn't say that this is extremely difficult to do, but you don't just walk from point to point here like a 'walking simulator' would suggest. Not only that, but there are puzzles that you will come into contact with that force you to ponder the environment a bit as well as some technology to help you solve these puzzles. So it definitely delves into much more gameplay than just walking from story point to story point.   Besides the tags being somewhat misleading, that META Score is completely off base in my opinion. Lifeless Planet is a fantastic game with a fantastic atmosphere, a cornucopia of map changes that will give you an explosion of color in some areas that is intensified by the more “Lifeless” areas you will find. The game has about 20 different areas with about 15 of them feeling like something completely different from the rest. Each area can be blown through in 10-15 minutes if you want to unless there are puzzles to get through, but anyone that enjoys looking at scenery and taking their time to explore game worlds should find more joy. (While discussing the want for even more little discoveries outside collectibles like random gravestones and such to add to the flavor of the world on the forums the developer said that they will be adding in more of this in a future patch.) It is not open world, but the areas feel wide and spacious enough that you will be able to wander a bit. Not to mention that there are some collectible items such as minerals and documents found in the game to give you a reason to check some of the back corners. Documents, which add a great deal of the story aspects to the game tend to be on the main path, however so you shouldn't miss any of these.   The soundtrack is used sparingly, but feels like when the music comes into play it is escalating the situation and your feeling of isolation and the importance of where you are. It creeps into the feeling of the game and gives you the impression that it is pushing you towards an important moment when it begins to quietly chime in as you move forward. Most of the time, however the isolation you feel is intensified by the ambient sounds of a barren world. Winds and other strange sounds like rocks falling while looking into a great chasm add to the effects of your play.   The story is mysterious, creepy, and interesting. While the main protagonist is your view into Lifeless Planet, you can hear the echos of others throughout your exploration in documents. Some documents contain a sound file in which you can read along as a Russian speaker transcribes it in their own language. It is a Russian speaking voice from someone native to the language as well so it feels authentic. Based solely on the game's title graphic, it is obvious that there is a Russian aspect to the game, but a Russian aspect from the Soviet Union of old. While you are an astronaut from the United States, and there is a Soviet Union background within the game, it does not delve into politics of any sort, nor does it make any statements about either of these nations, or any conflict they had other than maybe a passing note here, or there if necessary to understand the story within the game. The story is one of DISCOVERY, and what it would be like for someone to travel many light years away from Earth and to explore a new world. Their excitement with seeing new forms of life, as well as their struggles with dealing with the unknown.   The best part of the story to me, however is your own discovery of something else being there, and your interactions with it throughout the game. Very little communication is had as you feel it out and it brings an aspect of humanity to the game that is wonderfully done I feel. Without talking, or actively communicating you do feel a sense of closeness to something while making your way to the end. It is too spoilerish to discuss it really, but it is something I feel should be mentioned because the impression you will get mostly looking at this game is that you are fighting the planet and the story is just one of looking at the past more than anything else. This is a major part, but there is the sci-aspect that all good sci-fi stories have in which humanity and human experience comes into play.   Graphically the game is solid and gives you a great many screenshot opportunities. The game uses a bit of a filter on it that you would see if you were on such a place to blur it up some, but it is clear for the most part. On the outside of the FOV you will see blurring on the edges, however. Even on fantastic the game looks very good, but it is definitely not a AAA title quality level of HD graphics. For an Indie title they are great though and they fit the game perfectly.   Gamepad support is good and is preferable to me while playing the game. I used a PS3 gamepad with Xbox 360 plugins and it worked fine the entire game.   The game is predominantly bug free from my playthrough except there seems to be a bug with an Achievement that the developer has said will be addressed in a patch coming soon. There is an Achievement in which you must collect all documents in game, but as of now it seems the few of us that have looked for this final document to unlock the achievement cannot find it. The document is known to exist from the game files, but does not appear to be in the game anywhere. The developer is quite active on the forums and said they will fix this soon so there should be no worries here.   TL;DR/BOTTOM LINE: Lifeless Planet is a great game that will appeal more to a casual gamer from a gameplay standpoint, but to a wider audience of gamers who like sci-fi mysteries, exploring new worlds, and feeling the isolation of a lost planet. The developer, David Board and his team should be proud of their work and congratulate themselves on an epic and unique game. I loved it all the way through and plan to play it again. There is an Achievement to beat the game in under 4 hours, so it could be completed in under that time, however it would be a complete waste to blow through it that quickly. It took me close to 10 hours to finish the game taking my sweet time. There is an Achievement for playing 10+ hours in one game as well too, and I got that without actually having to just idle the game so it is possible to spend over 10 hours in it easily.   9/10 Space Suits",
            "review_score": "1"
        },
        {
            "review_text": "A damn fine adventure game with platforming galore and some basic problem solving (well really basic). Well worth taking for anyone that enjoys undergoing a journey into the unknown and doesn't mind getting right up after failing their jumps time and time again.  Though underscored a bit the game is not just an adventure to understand what's going on with this strange planet but also to understand why our astronaut took his one way journey into an alien world in the first place. All is revealed to the determined, fear not.",
            "review_score": "1"
        },
        {
            "review_text": "Slow Pacing, uninspired platforming and a serious lack of any kind of challenge.   I watched a let’s play of the early access version of this game (kurtjmac) and decided to jump right in to the full version as I love sci fi mystery games. I wish I had just waited and watched the full let’s play to satisfy my curiosity. The trailer is a fantastic teaser for a game that drops dead as soon as first early access chapter is finished.  This game is DULL. It peaks early with the abandoned town and then it slowly drains all the wonder and drive out of the story with predictable platforming, boring action and empty character interactions. Oxygen is a joke, you are told that you have 8 hours oxygen upon filling up at a tank but I’m certain that you could leave the game running for days and it would not run out. But it just so happens that It immediately *runs out* as soon as you are within sight of a refuel point. This along with the temporary jetpack fuel powerups, that also immediately run out once you have completed the soul sucking large jumping sections only add to the predictability of this game. The puzzle sections are just as coincidental too. Need a way to climb up on that ledge? Don’t worry I’m sure there is a perfectly rounded rock nearby that will be happy to help.  After 2 hours I didn’t care about finding out what fantastic twist awaited me at the end as from what I could make out it was just going to be a disappointing as the journey.  This game will suck a lot of people in with a great trailer and an even better early access teaser, I recommend you give it a miss and satisfy your curiosity by just watching a let’s play instead.  Edit* I've just realized how ironic the name of this game truly is  Edit* Ha had a total brainfart with the use of ironic above",
            "review_score": "-1"
        },
        {
            "review_text": "Let's be clear here: I didn't dislike this game, but I wouldn't really recommend it to anyone, either. The love and care of a single man is shown in beautiful atmospheric music and, occasionally, the environments. However, this isn't enough to carry the whole game.  PROS: - As I mentioned, GREAT music and occasionally magnificent environments - Draws you in - Interesting story - Enemies are awesome  CONS: - The jump and the fact that the game is built around it - Put the rock in the hole puzzles - Very noticeable changes in quality - Poor pacing  Lifeless Planet's first hour drew me in; I wanted to find out more about the mystery. I was genuinely curious. But as the game continued, bits of story were more and more sparse and rapidly decreasing in cohesiveness. By the end, I found the story component of the game intriguing but not quite satisfying.  My first impression of the graphics were that they were pretty mediocre; in fact, I even thought the game looked pretty ugly in one of the first few environments, approximately an hour in. Then, suddenly, the next level was gorgeous, colour-rich, and stunning to look at. Unfortunately, the game kept going back and forth between beautiful and meh scenery. While the music really helped me enjoy the game, the change in quality sometimes broke the immersion.  But man, were the enemies cool. I loved them. I won't give anything away, but if you're into interesting enemy design, you'd probably like this game.  My least favourite part of this game was the jump (as well as the mechanical arm, but that part felt rushed and rather dumb). The jump was SO annoying that I became increasingly frustated with the mechanics of crossing a simple path. Some environments paired with the jump simply did not work, and it was infuriating just how simple the platforming I was screwing up was.   Even the extended jet-pack time mechanic, by far the most fun thing in the game, kept being taken away at convenient times after I'd stopped needing it; same with the threat of running out of air. It doesn't seem real, but like it's an in-game scenario. The puzzles were occasionally interesting, but were basically never challenging, which saddened me. Some moments in this game were really cool, but it feels like a mixed bag.  In the end, I liked this game somewhat. The story definitely had some interesting parts, and I was invested enough to want to battle the jump out to the end. I'm not completely satisfied, but I am hopeful for what the creator could make with more money and resources.",
            "review_score": "-1"
        },
        {
            "review_text": "Nifty little puzzle platform game that keeps you interested for the brief time it takes to work through it. Not a bad way to kill five hours.",
            "review_score": "1"
        },
        {
            "review_text": "Very Nice to play to (:",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT READ THE GAME DESCRIPTION ON THE STORE PAGE, IT'S FULL OF SPOILERS  7.5/10  Not a typical game with full of actions. Despite the lack of actions, the engaging story was able to compensate it. Mindblowing story. (Since it is very story-oriented, DO NOT READ the game description on the store page, it's gonna spoil some of the major plots)   Took me 4h to finish it. I don't think I will replay this anytime soon.   Beautiful atmosphere and soundtrack. Some minor and semi-obvious puzzle. Although the game is not truly open world, but the emptyness makes the game feels huge.   Probably not worth $20 but highly recommend on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing, exploring this world just keeps getting more and more intreasting. you never know what your gonna see or find. The Atmosphere is just mind blowing. im hooked, i cant stop playing it. Controls are very simple to learn and use. i highly recomend this game",
            "review_score": "1"
        },
        {
            "review_text": "Well, Lifeless Planet is the best game I played after Stanley Parable and one of the most better game I played ever. On a games market suffocated by videos for people too lazy to think, unproperly named games and done with ridiculous huge budget, the Lifeless Planet it's like an oxigen dose for people with the brain inside, and a proof the money and number of developers does not matter to do the real quality but only passion for a game idea and development. Thanks, Dave, for your ambition and perseverance.",
            "review_score": "1"
        },
        {
            "review_text": "Lonely, surreal, haunting. This one is well worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "An unfortunate case of a game's quality not living up to its potential. The potential I see for a game like this lies in its story and atmosphere, but neither manage to impress all that much.  The story is minimal, or at least stretched thin enough to seem minimal, and has the foundation of something compelling. Unfortunately, most attempts to heighten the plot's mystique fall flat in the earlier sections of the game. Really only during the last quarter or so do things become intersting, but by that stage I'd already lowered my expectations for overall narrative quality.  Secondly, and arguably more importantly, everything about the game screams that it is an absorbing atmospheric experience. The title itself is a statement of setting, game environments are left wide and sweepingly open, and the camera typically soars right over the player to focus on the vistas surrounding them. The problem is that these environments and vistas really aren't visually impressive. From the barren, stretched textures of the distant hills to the matte, ill-defined features of human characters, the graphical fidelity here is on par with something out of the PS2 era. I was honestly a little shocked to learn this was a 2014 release after being so thoroughly underwhelmed by the visuals.  Despite these gripes, it's not like the game is aggressively bad. There are good moments of contemplative silence and solitude, and many of the puzzles and progression bits are logically well thought-out. In this way, I think this game feels more like a proof of concept in the state it's currently in. It feels half finished; technically functional but not polished at all. I can't recommend it for the $20 price tag, but it is at least worth playing through once if you can grab it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "A great game, fantastic atmosphere, great music, nice gameplay, but a bit too expensive, game takes about 4h 2 complete... but i think its worth it, idd wish i could erase my memory of the story, and do it all over again, its an amazing story tyvm for the story, hope 2 see more like this. =)",
            "review_score": "1"
        },
        {
            "review_text": "Intresting and fascinating. It makes you reflect alot on how you are and what your moral standings are at.",
            "review_score": "1"
        },
        {
            "review_text": "Do recommend with all ny heart, but to those, who enjoy listening to long monologues and explore an empty world only full of memories and diaries. Even though the story is not quite smooth and there is too much empty space to overcome while exploring, game is still beautiful as well as it's story.",
            "review_score": "1"
        },
        {
            "review_text": "Tells a very short but interesting and original story. There's a handfull of jumping puzzles and occasional 'press buttons in the correct sequence' puzzles to solve to be able to advance the story. The path is pretty much linear but allows you to do a little bit of exploration in some of the areas. Visually the game is just about OK and the controls are about the same level.  If it had been a full price game I would have been furious due to how short the game is. I played it through in less than 4 hours, and that includes spending at least one hour trying to recover from what I believe is a glitch in the game that could have been avoided if there was a proper save function implemented instead of the automatic checkpoint save system. If there was a 'Maybe' option I would press it, don't buy if you want an adventure that will keep you entertained for a long time. ",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game! Really immersive, simple to follow, and a pretty cool concept.",
            "review_score": "1"
        },
        {
            "review_text": "Good story. Great emersion. Desolate, but visually stimulating landscape. Once you start playing you won't stop until you beat it. This ones a must buy folks. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A great sci-fi adventure game from start to finish. Casual and relaxing. Quite linear but with enough exploration that it doesn't feel like you're being forced down an 8 hour long corridor. Superb stuff and a sci-fi must have for fans of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game! -Rich atmosphere! -The story is very good, and its not your run of the mill sci-fi story...  -Gameplay is not too intensive or action packed, but there are quite a few puzzles and getting around is pretty fun! The game just seems to flow, so its not that bad!  Also - Get in the mindset that this game is more about enjoying the atmosphere and story. (Don't worry, there is enough gameplay to keep it from being a walking simulator ;)    SO all of that PLUS its an indie title.  This is a beautiful debeut release for Stage2 Studios, and I DIFFENTLY look foward to their future releases.",
            "review_score": "1"
        },
        {
            "review_text": "8/10  The atmosphere sucks you in and gives you the creepy feeling of being somewhere you definitely shouldn't. But at the same time, the need to explore and know more about what happened to this deserted landscape with some kind of previous habitation will drive you to check out every corner that this lifeless planet has.   The story is very very interesting and the climax is worth finishing this game.",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend buying this game, It is one of the most thought provoking and intriguing games that I have stumbled upon. The plot is complex and wonderful and as you progress through the game and learn more about how the planet came to be this way, the more you want to play. If this were a book I wouldnt put it down till it was finished. Definite buy.",
            "review_score": "1"
        },
        {
            "review_text": "very hard to define this game. overall the graphics are rather boring, the action is very repetitive.... you basically just walk/jump around through several different landscapes.... however, I really enjoyed every minute of it. I have to admit that the game is rather short, and I think it should not be longer.... the story is rather intriguing. the atmosphere is really, well ... atmospheric! somehow there is a constant dread, and the story is so well told, -although there is not much story really to it - that I really wanted to know what is going on....  Overall a very unique game.....  Pick it up when it's on sale, the length does not justify this price... the game, however, is definitely a worthwhile experience.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet is quite a compelling adventure exploring puzzle game with platforming. The environments in the game ar vast and the locations you goto are many.There are a few gameplay elements added that add to the fact you are a astronaut such as need to replenish oxygen and need to use suits jump gets. As you progress ingame a certain amount of time passes as you get from point to point so you will play from day to night.Ruins of what you find wil be found everywhere as well as signs of what happened.  The storytelling is done quite well and is more original than one would think.I can say the environment &amp; puzzle/platforming meld quite well pulling you into the immersion exprience the game has. The puzzles are not too difficult at all,but there are some areas in the game where one can tell a slight design flaw based on if you mess up to much and cannot reset making you have to start from ur last save point area or checkpoint.  Other than an annoying major bug where the save &amp; quit function can become unacccessible the game is solid though a bit laggy at some parts. The game auto saves when you get to certain areas and there are checkpoints throughout your play so you hardly have to backtrack to much if something goes wrong. Get it on the cheap, or pay the full price, game is worth playing if you like the adventure/explore platforming puzzle gamess.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't a challenge, the mechanics aren't good, the puzzles are too easy, basically you just follow the greentrail till the end of the game. You get no sensation of danger and the creatures that try to kill you are too easy to avoid. The only good thing about this game is that it is really relaxing comparing to FPS, so i recommend it if you want something easy to play with a singleplayer experience But in the end still a good game, if you buy it with a discount.",
            "review_score": "1"
        },
        {
            "review_text": "A facinating game, albet a bit short. I plowed through it in one play session lasting about 4 hours. It is very hard to put this game down once you take it up. The fact that the menu wouldn't let me hit 'Save and Quit' for some reason was only a small contribution to my one shot playthrough.  The story reminds me very much of the 50's though 70's era sci-fi books I loved to read as a kid, and while it is not the most challanging game (the hardest puzzle only took me a couple of minutes to solve, and the hardest challanges of navagation took me less than 10 tries), the storyline is definately enough to make this game worth playing.  I would recomend this game to anyone who loves games that have a story to tell. If it's all about the dynamics, the visuals, or the killing for you, though, this probably isn't your game.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, I really enjoyed this game. A lot. It's everything I would want in an indie sci-fi.  The positives are that it really genuinely feels like an alien planet and the atmosphere is really good. The music really worked well for me. I enjoyed the story.  Now, if you're expecting this to be a AAA game with Crysis level graphics you may be disappointed. But from what I understand this was a kickstarter game and mostly developed by one person over the course of a few years. So keep that in mind before reading too much into some of the less positive reviews.  This is more of a platforming game than a walking simulator. The puzzles are pretty straightforward and easy. If you get stuck it usually just requires a bit of backtracking or paying closer attention to stuff. I didn't have too much trouble with it.   People say the game is short, but it felt reasonably long to me. Dunno if it has a lot of replay value.   Minor nitpick is that the transitions between levels are not at all seamless, you end one level it like hard cuts to a different area where it doesn't seem like it's all that connected to the previous level. It may be daytime in one level, then when the next level starts it's suddenly nighttime.   The textures are a bit low resolution and sometimes feel a bit dated. It may not satisfy you if you expect photorealism. It feels like it might be a bit older of a game at times because of this. It's fine for an indie game.  Overall I just had a lot of fun and I can recommend this to sci-fi fans, especially if it's on sale. Although it does have some tense moments, it isn't that fast-paced for the most part, definitely more exploratory. So it may not appeal to you if you enjoy twitchy games where timing matters a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Hmm, The story (and music) are the best parts of the game, actually more of a nostalic love peom than a story. but this is what kept me going; I wanted to find out what happened. However, I never really got sucked into the story the way I did with 'Ethan Carter', 'Dragon Age' or even 'Darksiders'. Many questions are left unanswered as well. The background music was good and would occcasionally pique my interest but never be obtrusive.  Visually, 'Lifeless Planet' is ..lifeless, and that is a shame as this game begs for some stunning vistas. Alas, I found the landscape dreary, monotonous and cartoonish. Comic book graphics in this type of game were OK 12 to 15 years ago. Today, something like the visuals of 'Dear Esther', 'The Vanishing of Ethan Carter', or 'Talos Principle'/Serious Sam would have added a couple of notches to the game. I felt the gameplay was unimaginative, dated, tedious. No puzzles that you would call puzzles just endless jumping, jumping and oh, don't forget jumping. Trying to find the right angle for a jump is not a puzzle, it can become an irritant however, and is used by some developers to merely extend game time.  And a quick game it is, most will finish well within 8 hours with no replay value. I payed $19 and feel ripped; this should be a $5-$7 game. Overall 65 out of a 100. Worth playing but so much potential was missed. By the way, don't bother exploring, there is nothing to find. I don't recommend at $19, under $10, maybe",
            "review_score": "-1"
        },
        {
            "review_text": "Farted my way across the planets surface and immediately found life, 10/10 would fart again.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet is an odd little beastie, ill-suited to the industrial production line of today's gaming world. Of course, this is what makes it all the more endearing. The premise is instantly appealing and the ability to just wander this strange, seemingly lifeless world and its mysteries is fun. It's always linear, but the open spaces (compared to your little astronaut chappie) are vast, and rarely do you feel funnelled. Maxed out, it's also rather pretty, with a neat DOF effect and the only decent film grain I've ever seen in a game. The most exciting weapon you find is an extendable arm - woo-hoo, I hear you cry - but LP is a game that reminds you of the simple joys of the gaming days of yore, such that every opportunity to use said arm, brought a little cheer to my heart. Oh mechanical arm (thought I), how I long to reward you for your reachy-button-pressing and green-rock-thing-lifting by taking you back to earth in place of my missing wife. It also has a functional jetpack, which is 5/10 straight out of the box.   Overall, while some may find this a little empty, dwell on the title and you may realise your error. It looks nice, has great sound design, solid controls, great variety of areas and a story which reveals itself over 3-4 hours as you explore firsthand and discover the relics on the planet, rather than being battered by hours of cut scenes and terrible dialogue. It's something of a cross between Dear Esther, LucasArts' The Dig and classic 2D platformer Another World. LP may not be very challenging, but it has charm and immersion, and you really feel for the lonely little astronaut chappie. Is he the first to visit this world? Is the planet really lifeless and, if not, do you get a refund? Is his story real or just lovesick hallucination? And if you have a jetpack, who cares? 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Before I say anything, consider this: the game was basically built by one guy. That’s a tremendous amount of work considering, that it’s a 6-hour game.   Gameplay It’s a very-very-VERY simple game, more like a simulator where you control this little man in a space suit. He moves around and jumps, on occasions interacts with simple objects and that’s about it. It doesn’t have much of a character. He does comment on his surroundings at times and reads some documents that he finds but it’s nothing close to a fully developed character to have a bond with. The game itself is noticeably uneven, being exciting and tight in the beginning and getting more and more stretched out, unoriginal as you progress. About half-way through the game I started to feel impatience when again I saw some long distances that had to be covered just for the sake of extending playtime. The last chapters felt plain empty to say the least.  I also felt that so-familiar irritation that bug games like Alice: Madness Returns – you know the time when you have to jump from one ledge to another but the normal jump is too short whereas the double jump leaps you way over it and into the abyss below. Be ready to swallow a decent amount of this. Other than that it’s working, doesn’t crash and if taken as it is – a simple game, then you won’t be disappointed.  Design The game felt like Kairo. It could have been named ‘Kairo 2’ or ‘Before Kairo’ or something. This means that the environment felt very artificial and made of elements that don’t blend so well with each other. Now, that might be a good thing. This way you can create a game that feels abstract and Lifeless Planet, despite of it’s realistic setting de jure, felt abstract. The elements felt unnatural and out of place, think of it as Dadaism or postmodernism in art. In Lifeless Planet this conflict felt deliberate.   Everybody knows what a lifeless planet looks like, right? It’s a barren wasteland of sand and craters. The game starts out with the common idea of such a planet but how long can you show this before the player tires? No long. So, in every new chapter the design does get a little more daring, yes still trying to hold on to a sane image of a wasted planet and it was curious and funny to observe how the designer gave in to more and more of absurdities until it became a complete fantastical vista. This makes you give credit to games like Borderlands and Rage, which managed to hold it together.  If you happen to have played with Unity’s terrain creator then you will get some flashbacks from the kitchen side of game development. I never noticed that in a game before and can’t say that I liked it. It felt like seeing the first clumsy experiments of a digital painter who tries out Photoshop’s default brushes.  Verdict After all the whining and complaining I still recommend the game. Why? Because it felt chill and because then you know what one person with little help is able to create. Most of all I disliked the running around but everything else I’m ready to accept. I have far deeper issues with games from bigger companies.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great soundtrack. i found it very immersive and i enjoyed it thouroughly.",
            "review_score": "1"
        },
        {
            "review_text": "Just beat the game and I was very impressed with it. It is about 4-5ish hours long. At first I was skeptical but it quickly won me over. It is very atmosheric with great music and visuals but the thing that impressed me the most was the storyline. It starts of simple but gets very immersive as time goes on. Reminds me a bit of old Heinlein or Asimov Sci-fi books. I will admit there are times the controls and physics mechanics could be better but happens sparcely. I would definitely recommend it and if it ever goes on sale most defintely buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet is pretty much that, a desolate wasteland explorer/jumping puzzle game. You will find very few structures along your journey. The graphics are average, with only 3 maps standing out. Unless you're an achievement buff and want to find a few mineral deposits, there is no real reason to go out of your way to explore the maps because .... there isn't anything there. Also, if you're an achievement buff, is not a good idea to explore on your first time. 1 achievement is a 4 hour playthrough on your first try. Problem is that, after you do this game 1 time, you won't do it a 2nd time. The puzzles are done. There isn't any more exploring you can do. Thus, the player effectively gets PUNISHED for exploring the 1st time out.  All the jumping puzzles are extremely easy to do, except for one jumping puzzle where its at night and visibility is nill. I LOVED that map and made sure to not have my brightness too high so I could enjoy the difficulty. Got lost :).  The story info dumps are interesting and not exactly overwhelming to read, so do so. For an $8k budget kickstarter game, this wasn't bad. I DID spend about 4 hours 15 minutes on the game proper (left the game on and did some things so it reads 5 hours on Steam). I think this is a $10 to $15 dollar game, not $19, but you have to be the judge of that.  Do I recomend this game? If you're an explorer, jumping puzzle fan (mostly explorer) I tentatively recomend it. Though, as I said, you probably won't play it twice.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game the puzzles are a little easy but you really get into it all music the areas and story are just amazing havent actually played a game in a while that has kept my attention and made me wana go back and play some more. witch with this one i do.  cant wait to finish it. hope they release some more games like this love it.",
            "review_score": "1"
        },
        {
            "review_text": "Not hard to play, is more story than game play.",
            "review_score": "1"
        },
        {
            "review_text": "Where to begin... The game itself is decent albiet convoluted so its probably easiest to make a list of pros and cons to stop spoilers Pros: Rockhound badge Atmospheric Rockhound badge Keeps you wanting to see the end Cons: fairly linear no chapter selection have to uninstall the game for one of the achievements (more than likely at least) story is fairly convoluted transitions from one area to the next can be fairly jarring  Overall this game felt like it didnt know if it wanted to be a horror game or tell a story and it did not really accomplish either by the end. A good story lets you suspend your belief but that did not happen much past the first two areas. But it did have a rockhound badge....decisions decisions. I suppose Id say get this game when it goes to $10-$5, its definetly a different experience but a meh one.  6/10 would collect rocks again ",
            "review_score": "1"
        },
        {
            "review_text": "A puzzle platformer with some adventure elements thrown in. The adventure-y parts aren't too hard, you shouldn't need to resort to a walkthrough. The parts that are challenging are the kind that don't need a walkthrough anyway, jump timing, figuring out where to jump and in what sequence.  The story is innovative, and doesn't get in the way of playing the game. The cutscenes are short and to the point, which I like. They didn't work too hard on them and you don't have to work too hard watching them either.  But jumping and jetting are basically the whole game. Catch it on sale if you can, I'd say $10 is a reasonable price for it.",
            "review_score": "1"
        },
        {
            "review_text": "Mixed review for this one. I don't think it would be worth the money for the full-priced game, but on special or as part of a bundle... sure. I grew up reading a lot of sci-fi, so I was expected more from the story to be honest. And there was really only one type of 'enemy' in the game with really long, slow levels. Seemed as though it was intentially designed to be tedious to get from point A to point B. And if you don't like jumping puzzles, this game is certainly not for you... about 95% of the puzzles consist of jumping from platform to platform. And if you miss one step, you have to start all the way back at the beginning again. Also, the textures in the game were recycled over and over again, so the environments got really old, really fast. Not as immersive as I was hoping for. Oh well, still an ok time waster if you want one. Start to finish is between 4 - 5 hrs.",
            "review_score": "1"
        },
        {
            "review_text": "not the most challenging of games, but a solid atmosphere and engaging story, despite a rushed ending.",
            "review_score": "1"
        },
        {
            "review_text": "Fabulously atmospheric and puzzling little adventure game with simple gameplay dynamics and effortlessly beautiful surroundings.",
            "review_score": "1"
        },
        {
            "review_text": "I finished the game, and it is a truly enthralling story. Also, the 'things' at the end are scary as ♥♥♥♥, nearly froze when I went around one of the last bends of the game.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting, artistic exprience. A game? not really. Think of this as an overpriced interactive adventure. I wouldnt pay more than 5 dollars if I had the chance.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little game to pick up on sale. Its short (Has an achievement for finishing in under 4 hours), but is well worth a playthrough.  Its graphics are average, but it makes up for it with some excellent music. It really sells the forlorn feeling of being alone on a dead world.  The gameplay is simple, a combination of 3d platforming and simple puzzles. Its fine though, because you're playing this to uncover the story. Each scrap of dialogue and each found note leaves you wanting to find the next.  I would suggest waiting for a sale for this game due to its length. Just know what you're getting, a short, simple sci-fi platformer game with excellent atmosphere, music, and story. A great way to spend an afternoon.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. I could not stop playing. Yes, the puzzles are really simple and the controls can be a bit awkward. But the atmosphere, setting, story, ambience, music, sense of wonder just kept me going and going till the end. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, it draws you in so well. The atmosphere is great, although i have not completed yet and the story is not fully understood i am enjoying how it is slowly feeding me details on what happened. controls are sound enough, the graphics are really nice, the music captures the mood perfectly.  Definetly recommend",
            "review_score": "1"
        },
        {
            "review_text": "It wasn't as horror based as it appeared to be in the trailers, but I still loved it",
            "review_score": "1"
        },
        {
            "review_text": "Loving this game. Great atmosphere and great backing track.   Love the puzzle solving which is well quite easy but adds to the enjoyment of the game. Reminds a little of 'Two brothers' but playing as only one charcter. :)",
            "review_score": "1"
        },
        {
            "review_text": "An involving and atmospheric journey reminiscent for me of Andrei Tarkovsky's film 'Solaris'. Addictive and involving. After I finished I sort of missed my wee pal in the spacesuit.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Talk about underrated game.   4.5 hours of my evening just evaporated into this game. And I couldn't be more pleased.   This atmospheric puzzle platformer was an enchanting experience, mixed in with a subtle and absolutely sublime soundtrack. The narrative and method of telling the story kept me completely engrossed in the game, and left me pressing on until the eventual and rewarding end.  Only two puzzles out of the many actually had me stumped. I'll say this, I'm terrible at puzzle games, and this game does not hold your hand, however the puzzles become fairly intuitive as you press on. But beware the 'forest'.   The platforming and controls were quite solid, and one unique thing to note was the characters 'building up speed' as you continued to hold the directional button. Which is a mechanic you should familiarize yourself with, as it becomes important in a few of the platforming portions. There were maybe 3 platforming sections that irritated me, mostly because I didn't know which way to go, but one in particular was due to my inability to time my jumps. I don't fault the game for this at all.  If you have 4-5 hours that you want to spend having a unique and pleasing experience? Then buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Game was kinda glitchy for me. Had to restart areas a couple of times. Checkpoint system is God awful. I saved and quit when was I was about halfway done with an area and then when I restarted later it put me back all the way at the beginning of the area. Ridiculous!",
            "review_score": "1"
        },
        {
            "review_text": "If I had to descirbe this game in one word it would be 'competent'. The major failing is the gameplay which is fairly anemic ; the puzzels are easy and the platforming is a bit middle of the road so by the end of the game it can feel a bit tedious. Like with some other puzzle platformers you will eventally a point in the game where you will think 'Okay that was easy, but how was i supposed to find that?' Thus the gameplay isn't the major selling point. However I can recomend the game because the setting is well designed. I liked travelling across the planet and seeing the remains of what was a once thriving planet.They story of how a vivid planet turned desolate is done pretty well. For the most part I feel I got my money's worth , but I can undestand why you may want to get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet's story is orginal and invigorating. DO NOT WATCH A PLAYTHROUGH if you want to get the full immersion of this game. The graphics need work and the game still has alpha-bugs it also sometimes has flow issues.  I would like to see a remake made with more people and maybe add survival and co-op features. I.E finding oxygen repairing the suit. The remake should be polished with good graphics and more sound effects. However, this game is a great first. I would like the remake free to people who already own lifless planet and if new people buy it, they get lifless planet 1 and 2. Finally, I would LOVE A PREQUEL  All in all I give this game 3.5 out of 5 stars. It is worth playing and has a great mix of creaps, jumps, and bumps. I look forward to seeing more from these authors",
            "review_score": "1"
        },
        {
            "review_text": "This is such a neat game. The story is quite gripping, with a mysterious theme. Every aspect of the world really brings home the 'alone' feeling, which is eerily exciting. The sounds and music of each area also contribute greatly to the lonely mindset. The controls are all solid and feel exactly like one would expect them to; The objectives, while not exactly obvious (not saying this is a bad thing), all feel meaningful and contribute to the story.  Overall, this game is worth a buy if you enjoy edge-of-your-seat suspense,  massive  and seemingly endless vistas, quality story (that you actually have to think about, vs. it all being laid out for you like many games), or all of the above. I give it 2 lifeless thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "This was a very relaxing beautiful game. As a gamer who has been around since Pong hit the scene, I appreciate the beauty of the games more than I do the actual game itself at times. I wish it was more open world so you could explore a little deeper. There is no difficulty to the game, very linear and no replay value unless you want to earn all 15 achievements. Overall I recommend it. I wish the game itself was longer. I also would like to have seen a better ending to the game. Maybe another chapter or two to make the ending feel more complete. Hats off to the team responsible and look forward to more in the future.",
            "review_score": "1"
        },
        {
            "review_text": "It's been enjoyable so far - like an episode of The Twilight Zone... wamdering around and discovering.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know what this game was about when I bought it. I picked it up because I was curious why everyone was playing it. The game has an original fresh feel to it. The fictional story carries you from one area to another like a leave on the wind. During your travels you will learn that man is not perfect.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not usually into slower moving games but this was so beautifully done. And such a great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game,have fun and enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "More of a playable story rather than an indepth game, but the storyline was great and I continued on to try and figure out what the heck was going on! I finished in about 6hrs, but you could either shorten or expand based on how much you want to explore. Beautiful music :) The controls are a bit funny sometimes, but I found myself laughing every time I died in some stupid way, so all in all, a very good time!",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of the  Stalker  series or Andrei Tarkovsky's oeuvre you might enjoy this... or you might come away from it feeling like the developer shot for  Solaris  (1972) and came up  Solaris  (2002), patching the cracks with a narrative epoxy derived from the bargain bin of  Lost  (2004) instead of the deeper and more consistent Eastern European science fiction referenced throughout.  Early visual teases evoking Pink Floyd's  Momentary Lapse of Reason  set a misleading supernatural tone that undermines the science fiction bedrock of the narrative. Key gameplay elements function as foreshadowing - if you see an oxygen drop in the distance you'll learn you have just enough time to beeline for it before you die; when you find jetpack fuel you know it'll run out as soon as you've cleared the jumping puzzle that it portends. Air and propellant are otherwise infinite, which neatly avoids the tedium of 'survival' resource management. Jump cuts between levels are frequently immersion-breaking and serve as reminders that despite a very Open World feel,  Lifeless Planet  is a linear platformer with few, if any, rewards for exploration beyond the path set by the narrative.  Pretty, minimal, and functional, with very low replay value -  Lifeless Planet  is a short game and a short  story . The brief runtime (or rather, walktime) combined with shallow gameplay and a personal distaste for certain elements of the narrative lead me to  not  recommend the game at the list price, though I certainly recommend checking it out it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The game is a third person platform and puzzle solver. Puzzles don't really challenge the user too much. The platform essentially relies on your ability to fing jet pack boosters. Things that you need are never far from you though and only take a little effort to find. Story line is a little predictable though. Cant help but feel let down a little by it personally as it promises much but fails to deliver. RATE 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A lot of life for a lifeless planet.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished it, and unfortunately I do not recommend it. I bought it influenced by several glowing reviews right after the game was released. Well, all those reviews seem suspect to me right now. Game is way overpriced, it is worth maybe a couple of dollars, and nothing more.  Story is pretentious and ultimately uninteresting. It's like a bad episode of The Twilight Zone.  Voice acting is pretty bad, at least the English parts. Some mechanics make you scratch your head and just feel rough and unfinished. Like the mechanical arm, which is just a gimmick that adds no value to the game...  Extremely linear and very easy, to the point of insulting your intelligence.  I feel bad for all backers. This game is pretty rough and underwhelming. ",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a light and casual game with an interesting storyline to follow, this is a good game. While I don't think its worth full retail price its definitely something to consider during the sales.  The music was beautifully done and contrasted well with the gameplay. Parts had you on edge wondering what was going to jump out at you next, while other levels were laid back and you could enjoy the view. The scenery for each level was amazing, I especially liked the volcano and how it was in the background for the levels after that.  The gameplay itself is not difficult at all, I'm really not into puzzle games but the simplicity of this made it more of a parkour and follow the green glowing path. I think the gameplay was a little too slow paced for my liking in parts. You travel from A to B and thats pretty much all you can do.  The storyline does make up for a lot of its downfalls. The concept and plot throughout the game kept me playing until I could see how it all ended for myself. It definitely went a different route than I expected with the plot which was exciting to see unfold, I think this was definitely the main reason why I kept playing and why I am writing this review now. Its original and refreshing to see something so out of the ordinary for gaming.  I'm recommending this because despite its problems I did enjoy what it had to offer. I'm happy to have supported the developer and hope to see another game from them with the right improvements.",
            "review_score": "1"
        },
        {
            "review_text": "This game was good at the begining and it just kinda fell apart a litlle in.  If you like horror games you might like it.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm Rather Enjoying this game. so far as a reviewer and a youtuber. it's a different type of game i wouldnt usually play but i am enjoying it non the less. theres variances where it feels like a horror game, or a survival. and sometimes a Puzzle game all rolled into a atmospheric enviroment and music. on a planet far from home with a limited oxygen supply.  i do reccommend people to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet has a great concept and pretty good story. The game play is not as good overall and the puzzles (which are mostly jumping-related) are pretty straight-forward; there's a bit too much walking, although sometimes it is used to good effect to build up anticipation. Unfortunately, one of the big, early reveals has been mentioned in a lot of reviews, etc. about the game and I wish I hadn't known about it ahead of time. Ultimately, its a fun game that's really carried by the concept and the story, but its short (under 4h), so there isn't the depth to the story one might hope for and it probably isn't worth $20, but definitely worth $10-15 if you like third-person concept/story games.",
            "review_score": "1"
        },
        {
            "review_text": "15/6 IGN you can walk in this game.",
            "review_score": "1"
        },
        {
            "review_text": "While the puzzles aren't at all difficult, the game has an excellent story and loads of atmosphere (heh). The surroundings were also at times pretty breathtaking. Loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Basically there's content for about 30min's, stretched to 5-10h  Stephen King's The Stand revised edition: The desert crow who lost it's wings I woke up in a desert craaa craaa, what's this I see in the horizon? It's glowing, I like glowing things, lets walk. ...., ...., .... 'some time later' I spotted a ravine, there's nothing on the horizon where should I walk, left seems like a good choice.  1. 'some time later' sporting through the sand like a snail, i get stopped by an invisible shield, what's this Im wondering, could it be the end of the world. Dissapointed I turn around until I find my path again. 2. 'some time later' back at the ravine, lets jump, *ouch* forgot I have bad leg mechanics I cant really walk and jump. Lucky I can respawn at an earlier state 3. 'some time later' finally made it, I managed to get to the glowing item, I hear voices in my head. And whats this another glowing thing at the horizon, I like glowing things, lets walk 'some time later' steps 1 to 3 until you feel read to go to step 4 4. 'some time later' Im getting sick of walking lets just get there allready, but man there are some nice vistas on my sides, ouch *forgot I have a bad neck mechanics* can't look sideways, and i don't really have time to stop and look I have walking to do! 'some time later' steps 1 to 3 until you feel ready to go to step 4 or 5 5. '5-10 hours later' and some glowing things later, I like glowing things! - The End",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent game for any sci fi fan. Tells an interesting story that is worthy of being turned into a movie. i loved it.",
            "review_score": "1"
        },
        {
            "review_text": "no words to describe this game, but...  i love it, i love it, i love it. tThis game inspired me to greater things and the rich, oh so rich story is so amazing i want a sequel  I WANT A SEQUEL, i need one  i cant ruein the games story so im not gonna put any spoilers. i will say U NEED TO PLAY IT",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting, well-written concept. Unfortunately, it falls a little short on the design and execution of the product - so much so that you can almost feel what David Board had intended with it, but didn't manage to pull off entirely.  I'm still recommending this game though, as you can really feel the level of scientific literacy in the writing, and the story gives room for some interesting afterthought. The best part about the game, is perhaps discussing the story with other people, afterwards. It also has its moments where the ambience strikes the right chords, making for some memorable events here and there. But they are a bit far in between, which is a shame.  Perhaps if he had been a little more experienced in game design, this could have been a really great game. You can feel that there's a lot of influences from places like Stargate, Alien, Space Odyssey and perhaps even a bit of Shadow of the Colossus? But it all wraps together in an, unfortunately, slightly monotonous jumping 'road-trip' where not that much happens throughout it.  I'm not sure if I can say that it's entirely worth the 20 euro it costs now, but you should consider it, if you ever see it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a perfect indie game.  When I first noticed this game I knew instantly that I will like it. It was not the graphics but the idea that made me to want to play this game.  The game is actually simple. You have to manage to go somewhere on each level. Not an open world game, just go that only way and learn what the story has to offer. A few minigames that makes you wanna just skip them but the story is the arrowhead.  To the cons it is that you somewhat have to do certain things only to specific moments like they tell you to do something you do it and then you can not do it again like you forgot how to do it...  Anyway the story is really nice and that could be a movie idea...",
            "review_score": "1"
        },
        {
            "review_text": "I would safely recommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. If you like exploring awesome new places with an emmersive sound track and a thrilling story you really need to play this. Awesome experience",
            "review_score": "1"
        },
        {
            "review_text": "I really dont think this is really much of a good game. U just run around making ur way through beautifully designed enviornments, but like the main thing ur doing is just running around and it gets very boring. Interesting story but kinda cliche and not very interactive at all. I would not recommend this game for its current price especially",
            "review_score": "-1"
        },
        {
            "review_text": "At firs i wasn't convinced by the gameplay of this, but i have to admit after a few hours of gameplay that is an intriguing adventure, enigmas are not too complicated either and the experience is quite pleasant, honestly i was a great passionate of point and click adventures, but after 20 years playing them i got bored, I liked instead the way this adventure is proceeding. I reccomend it in bundle or on offer, i bought it with the last humblebundle for 10 dollars and it's worth.",
            "review_score": "1"
        },
        {
            "review_text": "How do you feel about sticks? Well, I was ambivelent about them before playing this game, and now I find them annoying. Lifeless Planet mixes up the whole, walk, jump thing with random sticks that shoot out of the ground and kill you. Some that will kill you are an obvious 'danger' red, while the safe ones are brown, but every now and then the brown ones will kill you too. And just to mix it up occasionally there will be no sticks around until one suddenly spings out of the ground to kill you. I assume these are clipping issues, but it's annoying and not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved the game the music and the story but the graphics are so bad seems 10 years old game .. and it don't worth 20$ ..  you are just following a track to guide you through the journey .. total 6.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "It pains me to put a 'not recommended' mark here. (Also was not an early access contributor). The game starts out with a brilliant concept, beautiful visuals and atmosphere.  It quickly turns into jumping puzzles. Then more jumping puzzles, then vaguely timed jumping puzzles. Then jumping puzzles in the dark with no clear path, leading to keyboard-snapping frustration. I approached this expecting an exploration/story/adventure game, in the same vein as Dear Esther. The first hour or so of that game is exactly that, until it jumps off the rails and becomes Slender with jumping puzzles.  The one thing that kept me on task to finish the game were the visuals, straight out of 60-70's era sci-fi, beautiful and eerie. Come for the visuals, leave before the jumping puzzles make you kick the wall.",
            "review_score": "-1"
        },
        {
            "review_text": "Only bought this out of nostalgia for 'Journey' 7/10",
            "review_score": "1"
        },
        {
            "review_text": "To start things of, leave this game be. It's an unrewarding walking/trampoline simulator. With the many bugs and glitches, this game doesn't feel worth the 20 EUR.",
            "review_score": "-1"
        },
        {
            "review_text": "An exploration game with not much to explore. The story premise is pretty interesting at first but later on it becomes a terribly boring. I'm also pretty sure they could come up with more interesting ideas than searching for 2 parts of the key to unlock the door puzzles.Other puzzles are more like put A into A or press X to continue.   Controls are clunky and unresponsive and whole 3d platforming bit is really frustrating. It feels like trying to jump onto the highest mountain in Skyrim instead of finding proper path there.  I know it's an indie game, but if the game is about exploring the world you could expect it will be a bit better looking, and that you'll find more interesting locations on the way. The visuals remind me of a Colobot game back from 2001 and the Colobot was actually a pretty good game on it's own. I went into this game hoping the story and exploration part will be great, but when those fail there even isn't a nice environment to grab your attention.   I like that kind of games and I love the sci-fi setting, but unfortunately this one isn't interesting enough for me to spend more than 1 hour in it. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "An exploration game with not much to explore. The story premise is pretty interesting at first but later on it becomes a terribly boring. I'm also pretty sure they could come up with more interesting ideas than searching for 2 parts of the key to unlock the door puzzles.Other puzzles are more like put A into A or press X to continue.   Controls are clunky and unresponsive and whole 3d platforming bit is really frustrating. It feels like trying to jump onto the highest mountain in Skyrim instead of finding proper path there.  I know it's an indie game, but if the game is about exploring the world you could expect it will be a bit better looking, and that you'll find more interesting locations on the way. The visuals remind me of a Colobot game back from 2001 and the Colobot was actually a pretty good game on it's own. I went into this game hoping the story and exploration part will be great, but when those fail there even isn't a nice environment to grab your attention.   I like that kind of games and I love the sci-fi setting, but unfortunately this one isn't interesting enough for me to spend more than 1 hour in it. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "In this game you're a fat little astronaut jumping and bouncing from rock to rock, listening to logfiles about another horrible incident. Personally, I can't care about these anymore. Something went wrong on planet asshat, humans died, probably their own fault. Humans are stupid, that's a new one.  Taken as a sightseeing adventure (personally, I love these, walking straight foward for 10 mins doesn't bore me) the quality of the vistas is a little uneven. Some are truly amazing - the screenshots on the store page prove it - and have a sense of place, others look like randomly generated pudding 'hills' without any physical substance.  Puzzles are very astronauty, they are about fixing things and survival, you do stuff with barrels, rocks, overcome obstacles. Sometimes you press a button and a platform moves.  As far as I've seen, there is really no combat in Lifeless Planet, something I approve. It focuses solely on platforming (imagining that Mario is under that helmet made the game more fun for me), path finding, problem solving. It could have been the Martian Chronicles 64 or something else Ray Bradbury would have played in his lifetime.  But I can't recommend it.  Because there is barely any challenge. Pushing a button near a platform that then starts to move made me feel like a lab rat in a very linear obstacle course. And finally because it didn't make me feel lonely at all. I can't tell why exactly. Maybe because steady progression, simple, solvable problems create the opposite of feeling lost.  I haven't finished the game yet. I'd really like to. But it bores me with linearity, engineering puzzles and a worn off, logfile driven story.",
            "review_score": "-1"
        },
        {
            "review_text": "Running and jumping and more running and jumping and when you've finally had enough there's more running and jumping. You literally run and jump across an entire planet. Strongly do not recommend. It's a propaganda piece. Not worth any amount of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite a decent sci fi game with a lot of atmosphere. You play an astronaut sent with his crew to land on a distant planet but of course it all goes wrong. The astronaut wakes up to find his crew missing and the lush fertile planet he thought he was landing on is almost completely barren. To make things stranger he soon discovers a Soviet era settlement and the mystery goes from there. This game is pretty much a walking simlator though it does have a lot of sections where you have to jump across platforms and a few basic puzzles.  Good Points: - The atmosphere in his game is great and is brilliant in creating a feeling of isolation as you explore the games barren alien world - The story is pretty decent. There was enough mystery there to suck me in keep me playing. - Voice acting is good too and adds well to the games atmosphere.  Bad points: - As i mentioned ,despite a good few jumping sections, this game is pretty much a walking simulator and there isnt much here in terms of varied gameplay - Pretty short though to be honest its about the right length. Any longer and it wold have felt drawn out. Not much replay value either.  Overall its an alright game that might be worth picking up if you dont mind walking simulators. I would recommend picking it up on sale as it didnt feel worth the full price.",
            "review_score": "1"
        },
        {
            "review_text": "The game was fantastic, it had a simple story line, but the world was very beautiful and it was full of so many different things to do, like try to carry the tnt throughout a whole level just because I'm that weird",
            "review_score": "1"
        },
        {
            "review_text": "A little disappointing. The atmosphere and music are amazing. The graphics are very good. But the 'puzzle' mechanics are slim and quite disappointing. Of course, this is an exploration game based on story, so not many puzzles are needed. However, the story is a bit weak.   Starting out really well, I found this game pretty much a downer by the end. The final bit with the giant halos is really interesting but throughout the journey, I just found myself wanting to finish up the game to get it over with.  SPOILER The idea of a distant planet founded by russians with a mysterious plant controlling woman is cool and all, but it's backstory that is uninteresting and simply weak. First, the voice acting is terrible and really unnessessary. But the astornaut leaves earth. Why? There's some bit in the end of how he loves his wife, but we aren't ever explained the purpose of that. The entire backstroy of his dying wife is useless and the story would have worked better if it solely focused on the the mysterious planet.",
            "review_score": "-1"
        },
        {
            "review_text": "The trailer made me a little curious about it because of the sovietic reference (this is not common in games). But it was a little frustrating.  1. Lifeless Planet is not an 'exploration game'. You just have to walk forward, climb huge rocks and follow the weird girl. You can't explore much (it's not a open world game - you will find lots of dead ends) and you just have to believe that if you keep going forward and forward, something good will happen.  2. Gameplay is really awful. In the game, is not easy to do simple acts, like move little rocks in the place you want, operate the robotic arm or jump in the platforms.  3. The story is interesting and it's what keeps you playing - I wanted to understand what was the explanation for all that mess in the planet. I liked the misterious atmosphere (the thoughts about life and existance) and the fact that the astronaut does not have to fight some alien monster (he's just an astronaut).  But the bad things, in my opinion, don't let you feel the good things of the game. If Lifeless Planet was shorter, it would be better, but still far away from being a good game",
            "review_score": "-1"
        },
        {
            "review_text": "A very good story, even if drawn out a bit. A very good game.",
            "review_score": "1"
        },
        {
            "review_text": "I've been meaning to review this game for a long while now. It's been a while since I have played it, but I did finish it and enjoyed it. It has a cool sci-fi story but ends up being a linear 3rd person platformer, which may seem to some to be an odd presentation to what is basically a sci-fi adventure, but it worked well enough for me. As I said, the game is pretty linear but maintains an effective illusion of having immense and mysterious environments to explore. Again, it worked for me. I would compare this to some solid, little known sci-fi flick you might find on Netflix that you've never known about before but that you enjoyed. You may not rave to your friends about it, but you were glad that you saw it.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game. I honestly did. The premise and the creepy atmosphere set against this huge, awe-inspiring backdrop both made the beginning of this game feel so unique and exciting. I hate to speak badly against such a small indie studio's efforts but ultimately Lifeless Planet is more boring and frustrating than it is enjoyable.  It's most praiseworthy element is the story it tries to tell. You are an astronaut stranded on a desolate planet, discovering abandoned human settlements and structures whilst trying to find your crew. The first hour and a half or so captures the mood perfectly. It is genuinely unsettling to wander through this world and slowly unravel the mysteries of those who came before. However, after a certain point, the pacing just falls off dramatically. There are no new developments in the story for nearly an hour, and the atmosphere wears paper-thin.   You will find yourself becoming irritated at performing the same weak platforming sections and avoiding the same old boring dangers. The puzzles are also a joke - childishly simple little sections of putting the only X object present into the only Y hole available. On top of this, the controls are awkward and will lead you to many any unfair death.  Unfortunately, I haven't even been able to finish the game. Despite all my complaints about the gameplay and mechanics I still wanted to see the story's conclusion (after suffering through all LP's faults I think I deserve that) but no. I think I'm still roughly a couple of hours away from the end, but thanks to a glitch on one of the last hammy, awkward puzzles, I can't progress any further.  I was lucky enough to get this at a discounted price, but if you want to spend £15 on a buggy game with an (at first, anyway) intriguing and promising story riddled with boring exploration, puzzles and jumping, this is the game for you. Otherwise, I cannot recommend Lifeless Planet.",
            "review_score": "-1"
        },
        {
            "review_text": "If you can get passed the frustration, slow pace of the game, lack of any real content besides decent scenary, and can overcome countless failed jetpack jumps, the ending will knock your socks off. Seriously.  For whatever this game hopes to accomplish, it is justily done in the end.  Bravo. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've had this game in my library for a while and finally got around to playing through. I had played a bit of it and dropped it after thinking it looked cheap and plain. I was wrong. Graphically not something to write home about, and understanding that I am not a platforming fan- this game was outstanding none the less. A very well written story. Long enough to be interesting and short enough to not overstay its welcome. Very impressive indie fare. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing game, great atmosphere, and an interesting story on the planet. One would think I rushed with my achievement for completing under 4 hours, but then I didn't truly explore for all the little bonus items, I played for story. For that, it is easily worth the $10 I spent at time of purchase. Would recommend for someone looking for a light game on their downtime.",
            "review_score": "1"
        },
        {
            "review_text": "This game would make for a good lead-in for a Survival game, but as it stands as an interactive narrative, it holds up well.  ",
            "review_score": "1"
        },
        {
            "review_text": "Lovely discovery and story with great visuals.  Downside: somewhat wonky controls.  Overall, it was a totally enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful landscapes combine with an often minimalist soundtrack as you solve physics and other puzzles to make your way through the game. In a nice change of pace from FPS games, I became totally immersed in the mystery, slowly unfolding story and history of the planet.  I came across the odd glitch (I could see through some border scenery when close, sometimes got caught in between small rocks and had to reload the checkpoint), but not often and nothing that spoiled or broke the game.  I absolutely love this game. If you want a game where you can chill out and explore cinematic landscapes with an awesome soundtrack, this one should be for you.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: The story was interesting and unique. I enjoyed playing this game quite a bit. I especially loved the design of the Ancients' technology.  Cons: Just be aware... The physics can be a bit buggy at times, and the GUI has some glitches which caused me to crash out once or twice. Also, on occation a broken level element would force me to get real creative in order to salavage my progress and be able to continue on with the game.  Finally, at certain times my framerate would drop suddenly under 10 fps. I also noticed quite a bit of screen tearing. I tried running it both on SLI and just on a single card, but it didn't seem to have any effect, neither did changing the graphics settings from high to low. It was quite distracting, ruining the immersion of the game's atmosphere, not to mention very disorienting.",
            "review_score": "1"
        },
        {
            "review_text": "The music and atmosphere are quite good. The overall story of the game itself is sound, although it could use more content. The jumping/jetpacking to get across problems (the main game mechanic) gets tedious after a while, and after a while the areas start to blend together. The price itself would dissuade me from buying it again, but if you can get it at a nice discount, or in a bundle, it's well worth getting even with the flaws mentioned.",
            "review_score": "1"
        },
        {
            "review_text": "A neat, atmospheric exploration game.  Gameplay: The puzzles are few and not really difficult, but I don't find that to be a negative as I played the game for the exploration aspect. The control of your character is the only thing that feels a bit... off. Music: Tasteful, dramatic and really suites the game. Story: Nothing like a short jaunt through a decimated alien world. GFX: The atmosphere of an alien world is really portrayed well. The only thing lacking in this department is the female character, her model is a bit stiff and lifeless (no pun intended).",
            "review_score": "1"
        },
        {
            "review_text": "Good game rich story worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric and visually striking. Worth playing through. The game can be completed relatively quickly but the story and the ambience created in the game make it seem like you've spent a lot longer than you have.",
            "review_score": "1"
        },
        {
            "review_text": "Picked up Lifeless Planet on sale, then played straight through it in one sitting.  It's definitely a walking simulator, with intuitive puzzles, but the story holds together well and never feels like it's getting old.  I clocked in around 4 hours, which felt like the 'right' amount of time for the game.  ",
            "review_score": "1"
        },
        {
            "review_text": "A drab and boring platformer that would have you believe it is an open world. In truth, there is only one (and often narrow) path and very little interesting to see. The platforming mechanics are often flawed, bouncing you back if you're close to a wall.  Good - There's a story in there, if you can suffer the hours of platforming and running around.  Bad -Tacked on mechanics (needing oxygen when you enter an area with an oxygen tank, losing the jetpack fuel as soon as you finish a platforming area) -Empty and uninteresting environments -The camera will point you in a random direction after changing area or respawning, potentially sending you in the wrong direction since everything looks alike. -The main mechanic, platforming, isn't even well done or interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "Lot of long walks, but stick with it, it's great.",
            "review_score": "1"
        },
        {
            "review_text": "A drab and boring platformer that would have you believe it is an open world. In truth, there is only one (and often narrow) path and very little interesting to see. The platforming mechanics are often flawed, bouncing you back if you're close to a wall.  Good - There's a story in there, if you can suffer the hours of platforming and running around.  Bad -Tacked on mechanics (needing oxygen when you enter an area with an oxygen tank, losing the jetpack fuel as soon as you finish a platforming area) -Empty and uninteresting environments -The camera will point you in a random direction after changing area or respawning, potentially sending you in the wrong direction since everything looks alike. -The main mechanic, platforming, isn't even well done or interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "I have a s***load of missing textures... Everything is purple,... even my helmet... I checked google but I could not find any solutions /:  took all the fun out of the game...  HELP PLS ):",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible pretentious game. I was hoping for the wonder and exploration here, but what we got here is an uninspiried monotone jumping-game. Thats all you do, hop from one rock to another, almost no variation!  Pro: + at times the visuals look good (not great, just good) + Soundtrack is fitting + native controller support with a good standard layout  Con: - there is little to no gameplay here. Puzzles repeat annoyingly often and you walk for hours! - it is one of those where-da-hell-do-I-have-to-go-game - jumping.....thats it, you jump platforms for almost 90% of this game which is very boring btw - the story is horrible, boring and has a bazillion plot holes - 'show, dont tell' --&gt; the story is completly told via texts that you have to find in the game, I mean who in the right mind would 'hide' texts that tell the story!  - a totally dead end story sub plot about the protagonists wife.....it leads nowhere..... - developer attempted to make this game look more than it is. He is trying too hard to appear artsy - controls can feel sluggish at times - there is no exploration! this games level design is at its worst. We have a linear path in an open world with stupid dead ends build into it.......what is the point? - never have I encountered something cool or worth looking at, you will be totally disinterested - when-is-this-going-to-be-over-feeling  This game is really bad. Its playable, but not worth anybodies time. Check out some other games that deliver way more worth your money!",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept but boring gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Very atmospheric and entertaining. It's definitely not the hardest game, but it's an incredibly well-told story through the medium of a video game. It was short (it took me 4.7 hours, and I took my time), and there wasn't any point where I got stuck for more than a few minutes, but the story it tells is worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "This is not for the hard core action gamer, to be sure. It is, however, freaking gorgeous. a lot of time is spent in journey from one plot point to another, but if you can temporarily let go of your achievement oriented paradigm, and enjoy the view on the way, there's plenty to drink in.  I just got it today (Jim Sterling sent me) and haven't finished it yet. --- I just finished it, and am very satisfied. only, now I want to...You know what? I''m not about to spoil anything here. you'll probably see what I mean just before the credits. This game is like ICO for astronaughts. --- Dear Devs of Lifeless planet, Sound track please! I love the Tangerine Dream / Crystal Method feel of the music. It's just so damn, short! the music fades out right when I'm starting to really feel the groove. I'd love to have a key to press to let my little astronaut sway along with me.",
            "review_score": "1"
        },
        {
            "review_text": " Lifeless Planet  is a beautiful, bleak game that ultimately fails in an impressively wide variety of ways. The game has significant problems with story, environmental design, input controls, game-play mechanisms, and graphics. And some of the problems would have been solved simply by adhering to industry standards. (Why, oh why, does a game with long, intricate jumping puzzles offer no means to safely pivot in place?) The few times when the game creates a legitmate opportunity for discovery or an  ah-ha  moment, it sabotages itself with poorly tuned controls, deadening repetition, or, in one case, the protagonist's internal monologue explaining—for no reason—how to solve what could have been a fun puzzle.  Even the Steam achievements seem designed to make the game less fun. There  is  an achievement for playing this 5-hour game for 10 hours (whee?) but  not  for completing the game (speedrun excluded). Even Jonathan Blow, who seems determined to free gamers from being shackled to their persuit of achievements and allotted a scant two achievements to his 2016 masterpiece   The Witness  , made sure that one of those two achievements was for reaching the end. In not acknowledging completion, the creators of  Lifeless Planet  seem positively mean-spirited.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting game, the story is short, the graphics of the game is good. But I still think that the game is not worth $ 19.99.",
            "review_score": "1"
        },
        {
            "review_text": "Big fat thumbs down from me. You spend huge chunks of time holding down W, and occasionally jumping. There's little danger, except when you miss a jump and it wastes your time. There's so little game, yet a lot of walking to do.  The problem is that even with the limited mechanics it could perhaps make up for it in immersion or atmosphere? But it doesn't really, other than a pretty decent score. I don't know anything more about me or my mission in the last 3 hours than I learned in the trailer. It hasn't developed any character or given me a reason to give a ♥♥♥♥ about anyone. But it's called Lifeless Planet, so you think the planet would be the star, but it's just such a boring place to be. The story itself has been pretty meh so far, and the collectables dull so finding things isn't a reward, and generally it takes so long to trek anywhere off the path that you won't want to bother.  And what's the point of the oxygen mechanic exactly? You're running low! Quick, get to the container that's really close and probably on the main path!  Fantastic trailer though.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good game. The game is about a man who has a mission to explore a planet when suddenly his ship Crashes.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but still very buggy.",
            "review_score": "-1"
        },
        {
            "review_text": "Story is well made. Controls are bulky adding the feel of being the man in the suit, but it has too many bugs. I would recommend it if you enjoy walking for at least 3 hours while a small amount of puzzles. Overall great concept and ideas.",
            "review_score": "1"
        },
        {
            "review_text": "Different, good story line, not too hard (I'm hopeless at platformers) interesting puzzles, a very engaging game.",
            "review_score": "1"
        },
        {
            "review_text": "The game has a really interesting story that kept pulling me back despite the control issues that made puzzles and parkour far more difficult and frustrating that it should have been. I enjoyed the experience and am glad I finished it, but the lack of clean, responsive control made the journey less than it could have been.",
            "review_score": "1"
        },
        {
            "review_text": "The game gives you an mazing feeling while exploring the planet that is really lifeless, however, has some forces trying to kill you. Not only you observe the planet, but also the deeps of the explorer's mind. One of the best games that touched my heart so far.",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice and pretty time waister. No real thought required. Just looks at the scenery.",
            "review_score": "1"
        },
        {
            "review_text": "Finished just now,  It's really difficult when it comes to review games like that. Story and atmosphere wise, very unique experience. I think to say - a spiritual experience is not overstatement, especially towards the end. There is even the 'Ayahuasca Snakes' reference (the green fields chapter). If you like and appreciate Stanislaw Lem's books (especially Solaris) i would strongly advise to check it out.   Artistically game suceedes at creating the atmosphere and feel it's aiming for. Not disturbing ambient music and sounds, vast landscapes and wind. The jetpack sounds like someone is brushing the floor but that's me being picky ;).  Gameplay wise - well, that's where the game fails a bit. What 'The Jounrey' accomplished in a perfect sense, 'Lifeless Planet' is struggling with. Controls are a bit poor. Both platformer and exploration parts can be frustrating or just not as exciting or satisfactionary as in the other title mentioned. I felt bored at times. Some levels are too big and the fairly simple riddles become very repetive at times. Personally, i think the game should be about 5h long and that would give me a better experience, but then probably some people would complain that it's too short, so that's my private opinion.   Overall - beautiful experience, average game.   I would prefer to watch a movie based on this story, rather than play it.",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunatly, nearly every aspect of this game, from the visuals, to the story, to the sound editing, leaves something to be desired. However, I still enjoyed making my way through the vast environments and discovering what this game was all about. While the idea of a planet exploration game seems like it could be rather easy to pull off,   Lifeless Planet  proves that it   is   easy to pull off, but difficult to make it very good. Yes, it is easy to make everything tan, and yes, it is easy to arrange a bunch of rocks to make a jumping puzzle. However, it is difficult to contain the player in a space without just surrounding him with cliffs, and it is difficult not to keep giving the player the same problem to solve over and over. Even though no aspect of this game sticks out except for the general idea itself, it's still good, but leaves plenty of room for improvement.",
            "review_score": "1"
        },
        {
            "review_text": "A good game with a fantastic atmosphere and a solid gameplay. I would recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good little game. Yes it is short but not in a bad way. If it were longer, it would get repetitive. The audio is excellent with good voice acting and ambiance music. The graphics aren't great but you feel like you are on an alien lifeless planet. The story is a little odd but not bad at all. Overall i enjoyed this experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing! I mean the storyline was there, the graphic quality was there, and the gameplay was just fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Buy it... its dead good",
            "review_score": "1"
        },
        {
            "review_text": "I really like this type of game. Atmospheric heavy game with cool environment. But with this, I never got into it. A lot I think depends on the music with was absent for most of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I wish the review system had a middle option between tumbs-up and thumbs-down. I would use it here.  I love the atmosphere, and to start with that's all the game is: exploring a strange place, and piecing together what's happened. It's geninely creepy, which I wasn't expecting. It's also beautiful. There are puzzles, though they're not the focus and they're not difficult (for the most part), they just add something to the exploration.  So why am I so mixed? Because there are so many frustrations: sometimes, arbitrarily, you suddenly run out of air and have to quickly dash for an air tank, despite having been told you have 8 hours of air left a mere half-hour earlier. A confusing section where everything is pointing that you should go one way, when you actually have to step off a cliff and go around the back. Sometimes things kill you when you're already out of range. I finally gave-up when I repeatedly failed a tricky platforming section where the platforms try to kill you, and I kept missing the platforms because the controls are so floaty.  I would have forgiven it and carried on, were it not for that last platforming bit. Still, I got it in a bundle, and for that price, it was worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet benefits from simple 3D platforming with minimal cutscenes, allowing the player to discover the world as she moves about within it. The environments don't push the limits of PC hardware, but they are quite evocative (in their own way) and are well worth exploring.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet imidiately starts the story on an astronaut along with two crew members going on a journey to a planet that is believed to be habitable for humans to settle on. Upon arriving to the orbit of the planet, somethign went wrong and the main protagnogist of the crew wakes up on the planet that is lifeless and doesn't sustain any oxygen for a human to survive on. The explorer must keep resuppling his oxygen with modules that were sent on the planet before hand and locate his two crew members. Upon exploring the planet the astronaut learns he is not entirely alone on the planet. At first this may seem like a sandbox game where you can explore the entire planet upon travel when in reality this is a linear walkthrough but does provide great sites to witness. The plot is very heavy on atomsphere and environment with occational music that gives the game a haunting presence. As you progress in the game you learn more about the planet you are on along with some puzzles that gives the game a challenge. The pros on the game is that it pays homage to 2001 Space Odyssey and other survival in space related films. The cons on the game is that it lacks a map or compass system, which could help me in moments where I felt I was getting some where only to end up in a dead end. There's times when there's no indication where I'm suppose to go and found myself jumping and running all over the place. With those issues aside the game is good in it's own right and highly recommended to fans of survival games. While those who expect something that's action oriented won't find it in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Played LP today in one sitting, which took me around 5 hours. The first impression was great and the game felt so mysterious. At some point you start to jump alot more and get to know the possibilities into the game. Level design and sound was great and worked fine together. At some point the game felt like neverending though, it became a bit too much repetitive. If it was a bit shorter it would be better.   I recommend this game for everyone who likes to explore and loves a mysterious atmosphere.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is not awful, but it's also not very remarkable. At its core Lifeless Planet is a low-budget, high-concept 3D platformer with some minor puzzles along the way. It's incredibly linear with little incentive to explore. The models, textures and animations do not impress.  The story unfolds through some good enough voice acting and bits of text data found along the way and is INCREDIBLY FAMILIAR (there is a portal opened to another planet and BAD THINGS HAPPEN). Also your wife got hurt or dead or something, but it doesn't really matter.  Still, this game does provide some fun in the form of walking forward and double-jumping for a few hours. If that sounds fun to you then buy it on sale and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Too easy, you just follow the green tracks and jump a little. The ending was poor and didnt explain the story or the link to searching for his missing wife.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of walking, some fun platforming, and light puzzle mechanics, enhanced by great music and sound design.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game at all, it manages to create an eerie atmosphere which always keeps you hooked to see what is around the next corner. There are ominous clues to puzzle over as you explore the planet, and while there is little in the way of action, the game has various hazards and obstacles to overcome throughout your adventure. The limited time on your oxygen levels add a sense of urgency to stay alive and does a good job of providing a challenge. Definitely worth picking up during a sale for all those who like adventure/sci-fi games.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game, this is a brain cancer. 3/10 (I have seen worse).  Your typical mission will be to walk 5 kilometers, occasionally jumping on rocks, to press a button and watch miserable cutscene. Gameplay and level design are low-budget raw-quality 90's-ish shameful trash. Visuals sometimes are ok (enough to look appealing on trailers), but mostly screaming 'typical Unity's garbage-encrusted heightmap'.  It could be decent, if it was 30 minutes instead of 5 hours, and 8-10 times cheaper. It feels like they wasted at least half of budget on voice actors and engine licensing.",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't recommend this game. I had gone into it with an open mind, sci-fi being one of my penultimately favourite genres of story, and Lifeless Planet looked just like something I had been waiting for.  The story was interesting, but far too slowly told to keep my interest throughout my playthrough. There is too little substance and information in the datalogs you find, spreading the plot out too thin as you explore. Virtually everything you need to know plot-wise is told within the first half-hour or so into the game, and you find little to no closure until the very end. The gameplay is in focus more than the story at many points, and the gameplay its self is nothing to write home about.  While it does have a great ambiance, especially several stages near the beginning, it quickly boils itself down to two different elements of play: running forward and jumping for the platform sections, and finding a way to move an object from one place to another to trigger an event or operate a machine. Virtually the entire game feels like it plays out in these two ways with little variation in an attempt to keep it interesting.   Bugs were also prominent in my playthrough, having had to restart on several occasions due to getting stuck in the landscape and clipping errors that prevented me from completing important plot puzzles until I reloaded a previous save.  The landscapes are definitely striking on occasion, in particular the scenes in the beginning of the destroyed, sand-covered Russian colony. But much to my dismay they too quickly broke down into little more than arrays of high cliffs and barren valleys. While an effective way to portray a 'Lifeless Planet', it gave very little to look at or take in which is something I would have hoped to occur since the gameplay leaves you running forward for a vast majority of the game.  The sound design is alright. The low tones of the cello really do accent your...loneliness and the lifelessness of the planet, but the music is almost negligable as it often disappears beyond the background noise and SFX. The Russian voiceovers in the data logs are a welcome addition though!  Ultimately though, I would definitely NOT recommend Lifeless Planet. In my eyes the price tag of something is dependent on how much fufillment I get from a game (I had no problem paying $15 for Journey even though it had only a two hour playtime). Lifeless Planet should be a budget $5-$10 game at most but $20 is FAR too steep for this game. Get it on sale if it appeals to you, because I can't see it being worth the steep price point towards most players.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of the collectables are documents that you have to read. Some do have a voice over, BUT IT'S IN RUSSIAN. Grab it on sale. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Very cool game. I paid $10 for it and got way more entertainment out of it than I thougt I would. There are a few challenging puzzles. The backstory is awesome, explained through finding recordings and documents. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless planet is a somewhat linear exploration platformer game that focuses mainly on story and atmosphere. You play as an astronaut that took a long journey through space to a reach a planet that could be colonized by the human race. You, and the rest of your crew crash land on what was supposed to be a lush green planet with breathable oxygen. Instead, you arrive at a vast and lifeless wasteland. There is evidence that someone has been here before you (spooky..). The environments are big, and there are a lot of logs that are written by your character, and that you pick up as you progress through the game to further the story. The sound is quite good and really helps set the mood. The platforming bits are a little too easy, but get more fun when you activate the extended jetpack. Some very minor puzzles too. It took me around 3 hours to finish the game at a casual space. Not that high replayability, unless you want to find all of the secrets, and every log. It was quite alright. I would strongly suggest waiting for a sale if this game seems interesting to you, before purchasing it.",
            "review_score": "1"
        },
        {
            "review_text": "Jetpack simulator 2014. In Lifeless planet, play as Buzz Lightyear on a quest to restore the planet... sorta.  It mostly functions as a wide ranged 3D platformer. Easy (but not terrible) puzzles. With all due respect, this game is very good. The atmosphere is well made. However, I wouldnt call the game as a whole a $20 game, im glad i got it on a sale for $8. The story is what I most wanted out of it given the premese of life on a lifeless planet. In a way it delivered, i liked it. I wont tell the developers how to do their job, but i felt like it could use more detail on the story. Everything happens sorta quickely and sometimes seems odd. Other than that, really liked this game, but its really short for what you pay for. It also seems odd to have an acheivment wanting you to finish the game in under 4 hours. Thats sort of a bad sign for how long the game is... and also having achievments for dying certain ways and another one for not dying. I guess im just nitpicking though. The game is good. Id just prefer people wait untill its on sale rather than feel ripped off.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't so much a game as it is an interactive storybook that you follow along with. It's a lot of fun to get lost in for a few hours, especially if you enjoy sci-fi. There is not much gameplay here, but the simple platforming and jumping I found to be decent and I liked that the game lets you go at your own pace. Price is a little steep, and the story itself isn't really fleshed out to the extent I was expecting it to be, so throw it on your wish list and buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible. This game is excellent. Immersive, emotional, and surprising. The gameplay is simple and engaging. The story is compelling, but also sparse and not intrusive. There is plenty of empty space, as there should be in a game where you are a lone astronaut on a desolate planet.  I found the puzzles to be the perfect amount of challenging. I got stuck a few times, but never reached an infuriating level of frustration. I felt a true sense of reward upon figuring something out.  Lifeless Planet is a very linear game. I actually found this to be quite refreshing. Compared to today's sandbox, procedural, open-ended games, this one stands tall in its assertiveness. Even though there is usually only one way to go in this game, I never felt limited.  The atmosphere is breathtaking. So immersive. Tense and frightening at times.  If you're interested in an innovative and interesting science fiction aesthetic &amp; story in an engaging, non-violent game, you must buy Lifeless Planet. We need more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful visuals, good story, and OK gameplay are ruined by horrible bugs and technical glitches. On Mac OSX, at least, there are enough cracks in the facade to constantly pull me out of the game environment and make me worry that I'm going to cause a problem by wandering off the beaten path. This is supposed to be a game about exploration, but in the end the bugs (and artificial barriers / invisible walls, which you constantly run into) strongly discourage exploration to the point where I gave up on searching for the 'bonus' mineral deposits because I was too afraid of breaking something. And even when I try to 'get everything right', some bugs in the event sequencing still showed up; I've given up on completing the game because one of the final puzzles appears to be broken (a required action somehow never got 'triggered').  With a story and atmosphere this beautiful, I really wish I could recommend Lifeless Planet. But a good game needs a positive player experience, and I found Lifeless Planet frustrating and disengaging more than anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Haunting soundtrack. Engrossing story. Beautiful landscape.  No, there isn't 300000 collectible items in this game nor anything to really explore 'off the path' to sate your appetite if that is what you need. However, if you don't mind a lot of jumping, then get this. The story truly is worth it and the atmosphere of the game is stunning.   If you dream of being a geologist one day, get some practice in with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lifeless Planet seemed interesting at first, but soon revealed itself as a very dull 3D platformer without enough substance to make it atmospheric or convincing.       Gameplay is dull and lacks interesting game mechanics.  Vast majority of gameplay consists of running and jumping, which is typical of any platformer. Except in this case it's as basic as it sounds - running and jumping. You can make your jump higher or longer with the help of a jet-pack, but that's it. Level design also doesn't evolve past basic jumps, and 'puzzles' are about as complex as 'go there, push button'. The biggest challenge you'll face is finding where to actually go, since game's bland-looking environments make it easy to lose which way you're supposed to go and where you just came from.      Immersion is held back by unconvincing story and visuals.  Story seems intriguing at first, but severely lacks detail. It feels like a very early single-page draft that was never developed further. Planet's environments look just as unconvincing and lack detail, which is made worse by graphics that are 10 years out of date.       Soundtrack is one thing that was done well.  While music is nothing mind-blowing, it's still a nice mix of atmospheric drone-ambience and powerful string pieces. They play at just the right moments and to a good dramatic effect.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game. Give it a 9/10  Would be perfect if they shorted it by 1/2 and made the worlds more detailed, and interesting.   Perfect voice acting Perfect story  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ive ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The story is really good, the game play is also, it has a awesome feel to it, you can in a mood of space and unkonwness",
            "review_score": "1"
        },
        {
            "review_text": "Really cool, worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Overall I enjoyed this game greatly, although there are some caveats. Although Lifeless Planet is referred to as a 'walking simulator' it doesn't neatly fit into that category, insofar as there is a LOT of platformer action throughout.   The Good: The story is what is at the core of this game, however and it is pretty awesome. The way it is slowly told throughout the game keeps your interest up. The visuals also match the narrative very well--they help set the mood and whomever designed them did an outstanding job. The game's length is also great...not short by any means, but not so long that things get drawn out needlessly. I enjoyed the fact that despite the vastness of the world, the correct path is fairly evident (in most cases). Also, the storytelling elements (notebooks, recordings, etc.) are not hidden--i.e. you do not have to scour every corner of the map (which can be vast in some areas) just to look for 'clues' or narrative elements.  The Bad: The platformer sections, however, are very hit or miss. I appreciated this element of the game, but the experience was undermined in places by the game's most obvious flaw--the controls. I played Lifeless Planet both with Keyboard/mouse as well as the Steam Controller. Control of your character could be very sloppy in places, making certain timed jumps extremely difficult to execute. On one section, I literally had to try to execute 6 consecutive jumps well over 50 times. This particularly section was poorly designed and the fact that your avatar 'drifts' was borderline unfair and marred the experience. Although not consistently a problem, when your avatar is in a tight environment, the camera perspective is every bit as poor as the original Alone in the Dark from the early 90s. Finally--and this is sort of inexcusable--there are a number of areas on maps where you can 'get stuck.' If you happen to jump in some areas (e.g. between rocks or next to a structure) you can be stuck there and have to re-load from the last checkpoint. I have no idea why some of these negative elements were not patched, but expect to encounter them and be annoyed.  Verdict: I really liked the game and would highly recommend it to folks who enjoy slow, story-rich 'walking sims.' The story, not the platformer elements, are what makes the game so watch the trailer and if you feel drawn in by the narrative, you'll probably really like Lifeless Planet.",
            "review_score": "1"
        },
        {
            "review_text": "If you're not a superficial gamer and can enjoy a game that has a well done story that you have to extract from it, you will enjoy this game immensely.",
            "review_score": "1"
        },
        {
            "review_text": "Picked up this game tonight on sale for just under $7. I played for 5 hours and completed it. I couldn't put it down! If I had to sum this up in one sentence: A jumping puzzle, platformer with minor puzzles to solve along the way and a fairly interesting story. The music accompanied the atmosphere perfectly, graphics aren't all that fancy but get the job done. Would love to see this game redone with better graphics and visuals! My only complaint is the controls can be hard to handle in certain situations (when you jump, you keep moving forward until you hit something; which means you need to plan each jump carefully). But there were only a few jumps where I needed more than one more try to make, and it never took me more than 3 tries. (hint: Sometimes there is an easier path to take).   The story is rather strange. But, considering you're on another planet I guess anything is possible. But it was interesting enough to compell me to want more. There were 2 maybe 3 areas where I wasn't sure where to go and it took me a bit of running around to figure it out. (hint: In the volcanic area, look in every direction and make sure you've gone down every path... you'll get out eventually).  All in all, this game was well worth the sale price I paid (probably not so much the regular price due to only being 5 hours (for me anyway) to complete. But definitely glad I bought it. Replay value is probably nil since once you've completed it and know the story, it won't interest you to go through it again - not immediately anyway.  I'd give this 4 out of 5 stars. Grab it now if it's still on sale. It's worth the few bucks to kill 5 hours. :)",
            "review_score": "1"
        },
        {
            "review_text": "= Please note that this review was originally meant as a reaction to AshenRowan's review = = We seem to find the same pro's/con's, but in a minorly different measure of importance = = Leading to a different recommendation total =  Review: After having finished the game, i agree with most of what AshenRowan said.  - The music/ambient sounds were wonderful. They acted out the exact role they're supposed to; drawing the player further into the game, rather than just being distracting random music. While never truly noticing any sounds/music, i always felt it there. As strange as this may sound. Think of it as air: you know it's important, you know you're always inhaling it, but you never really realize or appreciate it as such.  - The scenery, especially in cinematics, were beautiful. I have to say, however, that i don't completely agree with the comment on the graphics quality being a lot worse at times. I noticed (pretty late) that the image quality seems to be directly linked to the center of the screen. Looking directly at parts of the scenery seem to brighten, sharpen ánd enhance the overall quality of that specific part of the scenery. The point that's actually sharp is pretty small though. (Please note that i have my graphics set to 'fastest', as i'm working on a laptop that doesn't fully accept its own graphics card)  - The enemies are absolutely awesome! The design is wonderful, and they're placed at good locations in the game. I find some points about the enemies quite confusing though. Some seem to be programmed to follow a specific path, while others seem to act either at random, or to your movements. Don't get me wrong, i wouldn't consider this a Con, it's just... if you don't know, it can be a bit confusing, i guess.  - I didn't really mind the 'Put the rock in the whole' thingy, to be honest. However, this could've been made a bit easier, or at the very least, they could've taken out the cinematic leading up to the necessary equipment.  - AshenRowan seems to have encountered more environment issues than i have. I agree that some parts of the environment doesn't work well with the intensity/air-movement of the jetpack, but that's a matter of feeling it a few times, and it'll be fine until the next time you need to slightly alter your technique. Only once have i encountered a seemingly solid piece of environment to be completely intangible. However, again, after knowing that, i managed to jump that gap with the second try.  - There's one thing AshenRowan didn't say in his review, that seems pretty important to me: the end. It doesn't seem finished at all. There were so many things i still had to do to feel like i had completed the storyline, but it seems that only one part of the storyline is officially considered the storyline? and that one honestly only seemed minorly important, considering how the storyline developed throughout the game.  | In conclusion, i also agree with AshenRowan: I'm not necessarily satisfied (especially due to that last bit), but it's a very enjoyable game. And if you don't feel like playing for a while, and you're in a fully safe spot, just leave the game open and enjoy the ambient sounds and the music while you're busy doing other stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Really good immersive sci-fi game. Very engaging with an interesting storyline. You won't regret spending time in space.",
            "review_score": "1"
        },
        {
            "review_text": "The story is amazing, the soundtrack is amazing everything is amazing in this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Some very mediocre platforming, weak script, barren surrounds like it was whipped up in a week, and on and on. Very forgettable, or easily skipped.",
            "review_score": "-1"
        }
    ]
}