{
    "app_id": 261700,
    "name": "Eryi's Action",
    "release_date": "2013-11-19",
    "developer": [
        "Xtal Sword"
    ],
    "publisher": [
        "Xtal Sword"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Indie",
        "Anime"
    ],
    "achievements": 32,
    "positive_ratings": 1086,
    "negative_ratings": 152,
    "price": 3.99,
    "description": "One fine day, Eryi went to eat the melon that she had been SO looking forward to... but it was nowhere to be found! Then she noticed a note on the table. She picked it up and read: &quot;Your melon looked delicious, so I took it. From Farta X&quot; Fuming with rage, Eryi set out from her house to get her melon back from Farta.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/261700/header.jpg?t=1552195872",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 10 Processor: 1 GHz Memory: 512 MB RAM Graphics: DirectX-compatible Graphics Card DirectX: Version 9.0c Storage: 200 MB available space Sound Card: DirectX-compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'd recommend this game to anyone who doesn't feel that every game must be beatable for the first time without dying. Because, that's just not what Eryi's Action is all about.  Before you buy / play this game, you should know what you're getting into.  This is a troll puzzle / platformer. It will kill you as most traps you don't see coming until they're sprung on you, and then you need to figure out a way past them. Most of the time, this is easy. Sometimes, the solutions could stomp you for a while - I ended up using a walkthrough to get past a few traps.  That said, I found this game quite fun, and the traps funny the first time they killed me. Afterwards, I'd laugh at myself for falling for the same traps over and over after forgetting they're there, while I'd hurry from the checkpoint to the latest revealed trap.  My favorite traps are the multistage ones, where you think you have a way past them, but that just springs another trap :)  P.S. This game is *not* one of those 'tough as nails platformers.' Some parts are moderately hard, yes, but nothing close to what's required in the likes of Super Meat Boy, They Bleed Pixels, Electronic Super Joy, or Gianna Sisters.",
            "review_score": "1"
        },
        {
            "review_text": "Too damn funny game which was fully loaded with trolling traps. Never play this if you a kind of player who rages easily on games.",
            "review_score": "1"
        },
        {
            "review_text": "What a cute animation, you may think ?? just do not let this cute animation fool you &gt;_&lt; Easy to play: -Walk and die -Jump and die -Even you standby, you'll die -Die in the vase -Die by fan of the windmill -You'll die at anytime Stuck at the first level about three and a half hours, it's over 9000 than Super Mario 10/10 still play again and again until pass the first level",
            "review_score": "1"
        },
        {
            "review_text": "Eryi's Action is totally a SUPER MASOCHISTIC game with thousands kinds of silly ways to die...yet somehow I enjoy the gameplay! Cute painting style and creative design of tricks through the trials offers me a lot of fun and a great sense of accomplishment.  Last thing, if you could play this game without any swearing for the first 2 hours, you would probably be the one who has the best self-cultivation in the world...lol  Eryi's Action [6/10]",
            "review_score": "1"
        },
        {
            "review_text": "Do you think it's a simple and cute platformer? Oh no, Eryi's Action is hard as ball because everything in game is trying to kill you. Yes, backgrounds too. But it's pretty nice and playable.",
            "review_score": "1"
        },
        {
            "review_text": "Now that i finished this ♥♥♥♥, i can die with a smile on my face.",
            "review_score": "1"
        },
        {
            "review_text": "A rage platformer game in the same way as Cat Mario or I Wanna Be The Guy but easier with some puzzle parts. Really fun and enjoyable, and honestly, I was expecting this game to be bad just by the screenshots.  Sometimes it doesn't tell all. I found myself many times laughing because I died like a fail (or more likely laughing of rage) The game has 10 levels, it's quite short and a level editor would be awesome, I think, if you like it.. Some achievement are senseless and one is glitched, but that doesn't matter.  Anyway, if you like platformers in general, more likely challenging ones, take this one.",
            "review_score": "1"
        },
        {
            "review_text": "When people say something like Dark Souls is the hardest game ever. They have no idea what they are talking about. This game gave me PSTD. I can't play other platformer without expecting spikes to pop out of the only platform in the middle of a long bottonless pit.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the cuteness fool you. Lucifer and Luigi had a fling, and this is that demon spawn. The only way it could be more evil is if you were timed. You will die.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "The name of the game is patience, happy thoughts, and more patience. I really like the idea for this game, fans of platformers will have a great (so, so painful) time being killed for all the habits you have built up. You are forced to relearn platforming in a non-traditional way, I enjoyed it for the most part. Unique game that is worth a chance for the challenge seeking gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Hi! Do you like to rage? Do you like anime? Do you like raging to anime? PERFECT, Then this game's for you! Eryi's action is a nice platformer with lots of traps to stop you from reaching the end, It's fun but sometimes really annoying, overall it's a good game to burn some free time. ^^",
            "review_score": "1"
        },
        {
            "review_text": "Its a game from hell, if any one played the version of 'super Mario' where you cant win than they know what I mean, but apart form being a evil, fun, bone breaking jet exciting its a nice creation.   Its evil jet so brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty much an anime Dark Souls",
            "review_score": "1"
        },
        {
            "review_text": "OMG... Fun game, had to play it in short bursts though to avoid overfrustrating myself. The hardest game alive. i Hate this Game... :D . Don't do it, save yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This game is literaly hitler. Did you enjoy Kaizo Mario? DO you enjoy little anime girls getting hurt? You sick ♥♥♥♥.  10/10 wuld play again.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't laughed at being trolled so hard in a long time. You can't walk a few steps without dying, and it's glorious.",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome! ;D and fu****g annoyin.",
            "review_score": "1"
        },
        {
            "review_text": "Once you've experienced the emotional high AND lows from Eryi's Action, gift it to a friend for them to try!  - Gift it to a person you hate! - Send it to that 'unflappable' guy! - Present it to someone who's bored! - Give it to a 'hardcore' gamer!  This game is not for the softcore/casual gamers. Be prepared to die a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely great game, I played it in Japanese along before the english release and the steam release is even better. You need to understand that it isn't meant to be like boshy. This game is all about enjoying the hilarious ways eryi dies. If you like/understand japanese humor it's much better. Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addictive game but i don't recommend it to anyone with weak nerves.",
            "review_score": "1"
        },
        {
            "review_text": "Eryi's Action helped me with some pretty big fundamentals for video making. Particularly how to turn two hours of failure into an entertaining 15 minute compilation. It also made me want to break things and drove me to drinking.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Eryi's Action helped me with some pretty big fundamentals for video making. Particularly how to turn two hours of failure into an entertaining 15 minute compilation. It also made me want to break things and drove me to drinking.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "So I must warn those who want to buy this game. It's not easy, but it's funny. It's literally, painfully funny at times. If you are looking for a game that's honest and kind to you, then leave now. this game lies, cheats, and steals from your parents while murdering your first-born long before conception.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing hilarious and basically Cat Mario Redux: Just In Case You Thought It Needed To Be Even Harder, also known as Cat Mario 2: Electric Boogaloo. Everything, from you to the enemies you get constantly murdered by (which will happen on average every 1.5 seconds) is a kawaii-uguu, rainbow-puking, flower-♥♥♥♥♥♥♥♥ ♥♥♥♥♥♥♥ taking part in the extremely sadistic Moeshit Apocalypse of You Dying A Lot Except Also Kawaii or Something.   On multiple occasions you will get completely brickwalled by seemingly impassable hazards and roadblocks that you have to work around, often inventively and in unexpectedly hilarious ways. Every time you start up the game you begin in Eryi's house and have to evade being bonked to death by falling pans that will virtually always outsmart your movements and send your negative lives remaining count that much closer to infinity. You can even get killed while on the world map, because even the background props have murderous intent: there is pretty much nothing in this game that can't or won't deliberately kill you in some bizarre way.  So on the one hand there's you screeching and raging at the absurd difficulty of this game as a more or less perfectly programmed torture simulator, but on the other hand the outright unpredictable ways in which the game communicates to you just how much it hates you are literally nothing short of hilarious. This is a game about dying literally thousands and thousands of times, and you're more likely to get into a plane crash and be abducted by aliens at the exact same time than you are to clear this game without dying even once. You can't pull off a perfect no-miss run in this game because you were never meant to: nobody was. Otherwise you wouldn't have infinite lives and a counter that's always more than willing to rub in your face the number of times you've died. The object of the game is not preventing your death count from continuously rising, but solving platform puzzles which can be bypassed only via methods comparable to the unintentional exploits that let you fling yourself outside of the world map in the N64 version of Zelda OoT, except this time they're both deliberate and lying in wait to be discovered to hilarious effect.   I don't think this is a kind of game you can just rate out of 10, so I won't. I just think it's positively hilarious and enjoyable unless you're literally some tryhard moron who thinks platformers are SRS BSNS or some ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Its not that bad. I only died 670 times.",
            "review_score": "1"
        },
        {
            "review_text": "this game will make you filp tables and break controllers this game will trick you in the most ♥♥♥♥♥♥♥ off way possible  8.7/10  needs some more levels",
            "review_score": "1"
        },
        {
            "review_text": "Cute animation style aside, this game is rather frustrating (in a good way): somewhere around the level of Super Meat Boy in difficulty, but in the style of I Wanna Be The Guy (that game's way more frustrating and involved, I think). You just have to keep playing, else you lose your progress toward the end of the level. What's that? A crystal, suspended in a place I can't reach, surrounded by traps? Behind the goal post? Hm. You've gotta play around and figure out the tricks to get everything.",
            "review_score": "1"
        },
        {
            "review_text": "It's obvious that this game wants to kill you from the first time you play it... Heck, the developers don't even hide it; in fact it's the opposite! Picture Super Mario Bros hell bent on killing you... Gameplay wise it’s well balanced, sound is adequate to a little annoying but its the gameplay that shines here... It's almost like a puzzle game too: you realize this when you try to figure out how to finish the 1st level!!!  Recommended!!! ",
            "review_score": "1"
        },
        {
            "review_text": "It's cat mario all over again. &gt;w&lt; time to die~~",
            "review_score": "1"
        },
        {
            "review_text": "Just a little, lighthearted platformer.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a monument to every annoying, frustrating, BS death you've ever experienced in a platformer. No two methods of dying are the same, and this game will utterly troll you anywhere with yet another creative way to die. You start out with two lives, you'll probably finish in the negative hundreds. That aside, the difficulty in the normal game ranges from 'moderate' to 'fairly tough', and some sections will force you to problem solve.  If this game has a drawback, it would be the length it's a pretty short game. Otherwise, the graphics are clean, the controls are fantastic, and it makes endless dying fun again. I had my own epiphany in the second level when, after crossing an entire screen's distance without dying, I doubled back to make sure I hadn't missed any opportunities for death.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would ragequit again",
            "review_score": "1"
        },
        {
            "review_text": "Eryi's Action is a trapformer. A normal platformer with traps that come out of nowhere to kill you. But rather than being tough as nails difficult, the game has a bit of a puzzle element. A trap is sprung. Most likely you'll die. Then you just come back and try to figure out how to beat it now.   A lot of people would say it's frustrating. I would agree that it can be frustrating but only if you come into the game expecting to just run through it like a normal platformer. Like all trapformers, it's a game of trial and error, skill and observation. A good majority of the traps are pretty obvious to spot.  The game obviously isn't for everyone but I think it's a fun game. If you are interested in the game, let it be known that it's a trapformer and you'll need to be more than just cunning and skill to get through. Patience, perseverence, and paranoia will help.",
            "review_score": "1"
        },
        {
            "review_text": "It's cute, funny, challenging, frustrating, and rewarding. If you touch spikes, your girl gets naked! There need to be more games where your girl gets naked, as that was my favorite part.",
            "review_score": "1"
        },
        {
            "review_text": "A story about how Green the maid got her big phat butt",
            "review_score": "1"
        },
        {
            "review_text": "lol Trap every where  ",
            "review_score": "1"
        },
        {
            "review_text": "In Eryi's Action, the story goes by the fact that the Fairy Farta had stolen Eryi's melon and the goal is to retreive her melon back by going through a ridiculous amount of worlds, defeating enemies, dying a few hundred times, and solving puzzles.  For this game, I introduced this game with a few friends in hopes that we could all suffer together. And I was right. However, going through a majority of the game myself, it's very fun and unique to see that this game entwines multiple styles of gameplay throughout, including racing, sidescrolling shooter, and more!  By the end of the game (defeating the last boss) I had accumulated 754 deaths in this game. 11/10 would die again. and again. and again. and again.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, I finally beat the game with -316 lives.  The deaths are just not your fault at all (unless you have a bad memory) - they're all due to the level design. Each death is comically absurd, because they happen beyond the expected mechanics of the 2d sidescrolling platform genre.  This game is basically 'map memorization', however, maps are segemented by frequent checkpoints, to keep annoyance to a minimum. The levels aren't 'hard' like they are in games such as Super Meat Boy, but more of a puzzle setup. You instantly die at a spot, and then you have to remember where that spot is, as well as figure out how to get around that trap.  There are crystals 'hidden' in every level, which are placed in really hard super ultra mega challenging spots. None of them are easy to get - I was only able to get one of them. I assume the '??????' on the main menu opens up when all crystals are collected.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game A lot of die Undressing  And other fun  -500 lives 8/8 wud di agin",
            "review_score": "1"
        },
        {
            "review_text": "supertrap anywhere TT_TT better than dota 2 eveeeer L O L ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Game Of The Year.",
            "review_score": "1"
        },
        {
            "review_text": "Harder than Dark Souls.  More moe than Dark Souls.  Got killed by a man in a frog suit.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This Is a Fairly Hard Game But its Fun i recomend it too people that have played catmario and or unfair mario its a fun game filled with cool pussles and traps ",
            "review_score": "1"
        },
        {
            "review_text": "While a lot of attention is given to how hard the game might be as it attempts to trap you at every conceivable turn, I was LMAO 90% of the time. You know the rule, 'You have to know the rules before you break them?' Xtal Sword has shown they know the game play rules inside and out. So while a few Nintendo Hard NES games may have had me throwing tantrums and controllers back in the day, Eryi's Action had me enjoying almost every minute of it.  Just a fair warning: You *will* come across moments that will have you abusing your input method of choice. But that's just part of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I was hoping for a Mario-esqe platformer to relax with. What I got was a Mario-esqe platformer that made me curse like a sailor.  Everything about this game, from the controls, to the cutesy graphics, and such, is just fine. I really can't say anything about them other than they work well.The game runs smoothly enough and there is your standard challenge present in platformers. That is, until you find out that box happens to be a bomb, or you run back to a platform to escape an enemy only for it to pull back on you.   This game is pure, unadultrated ♥♥♥♥♥♥♥t, but in a fun way. The challenge doesn't come from needing your reflexes to save you or for you to speed through enemies. The challenge comes from within; you end up second guessing yourself way more than you should. It isn't a bad thing though; unlike other games where puzzles and trials are often vague and misused, in this game that is the intention, which is to troll the living hell out of the player.   The genre needed a shake-up for some time and a game like this does it in a fun way. It twists normal platforming conventions on their head and takes advantage of our familiarity with it to do so. Many of us grew up with platformers, so to play something like this is a breath of fresh air.  It's really embarassing to die to the first goomba in the first stage of any Mario game. Here, dying right off the bat just gets you warmed up for the long road ahead.",
            "review_score": "1"
        },
        {
            "review_text": "This casual platformer is a soothing experience.  Such a wondrous game to play when you're having a bad day. It's calm, light hearted, and you'll enter a peaceful trance while playing this.  I also really like the message behind this game, it's all about trusting people, trusting your environment, letting your mind go free and stop hassling yourself with unpure thoughts of undecision and fear.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Holy f*ck, is this game hard... it's funny, but having to learn everything by heart is not my thing any more...",
            "review_score": "1"
        },
        {
            "review_text": "This game is evil, but it is so good: Hidden block to make you die if you jump, fine, you jump over it to dodge it ? No ! It bounces you to the ceiling spikes and kill you, there is no escape. You jump backward to dodge spikes, lightning shoots up ! Spikes fall from the ceiling again, just go back to dodge ? NO ! They fall TWICE, just so you don't think you're safe on the first go.",
            "review_score": "1"
        },
        {
            "review_text": "Harder than Dark Souls.  More moe than Dark Souls.  Got killed by a man in a frog suit.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Eighth circle of hell.",
            "review_score": "1"
        },
        {
            "review_text": "The good: A nice visual style, unique enemy designs, decent parodies of a few genres here and there.  The bad: There are some pixel-perfect jumps that you have to get JUST RIGHT. This wouldn't be so bad if the whole of Eryi was what you were considering when you were making the jump. But the hitbox does not incorporate part of her feet and (during the final boss) the very top of her head, which makes figuring out where she'll collide with enemies, projectiles, and the ground itself, iffy to say the least.  It's a fun little rage platformer if you're into that. But be prepared to break the connection in your head to her body and her hitbox. Keep this in mind during the last boss fight especially and don't be afraid to let her toes touch the fireballs that the boss shoots. It's really the only way to win.",
            "review_score": "1"
        },
        {
            "review_text": "lol Trap every where  ",
            "review_score": "1"
        },
        {
            "review_text": "This game hates me. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "A cute Platformer with hundreds of traps waiting to be walked on, repeatively.",
            "review_score": "1"
        },
        {
            "review_text": "I consider this an Unteaching device, all our instincts from games like Super Mario are now bad things. The game is a platformer good I get it, the snag is that this game co-wrote the guide to cheap kills with battletoads, this game harkens back to an age when developers didn't care if you finished the game. But hey! It's colorful, quirky, and has a difficulty curve like a sheer cliff face.",
            "review_score": "1"
        },
        {
            "review_text": "it's always been the water levels that are the worst in any game. well worry no more! now you can hate ALL the levels with the same amount of prejudice as the water level!  alternate game title: WHAT COULD GO WRONG?: I Don't Know What I Was Expecting  12/10 git gud",
            "review_score": "1"
        },
        {
            "review_text": "I had fun. Not that fun but I'd say this was ok. At first I was really irritated about the fact that there were no clues for the traps but when I just accepted, I got accustomed to it.   +) Very clear environment.  +) Each stages are very short, which is good considering how the game works.  +) Some stages are in forms of different genre. They were very pleasant surprises.   -) There are no clues for the traps. You just have to get caught and die. That is the only way to know about it.",
            "review_score": "1"
        },
        {
            "review_text": "-Died 65 times to get past the 1st lvl -1st time died in the world map  10/10 Bandai Namco should take note of this difficulty for their Dark Souls 3.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game in an indie bundle and honestly knew what I was getting into from the start. Did not expect there to be such a terrible lack of control polishing. I could excuse the whole game if the hit boxes matched the objects they were attached to and if the controls weren't total crap. I enjoyed the idea that this game presented and if it were cleaned up it would be a great game but with the lack of controls and proper hitboxes I'd give this game a 2/10. Its only redeeming quality is the initial idea of the game. The gameplay itself is terrible and lacking. I would even rebuy this game if it was polished and presented as a completed game. This should be taken as constructive criticizm that you shouldn't release a totally unpolished game.",
            "review_score": "-1"
        },
        {
            "review_text": "To put it bluntly, I GOT STUCK on the water level, which is Stage 4, and I can't do the Swimmer achievement. And I can't get to the save flag beyond it without getting 'Fished' because swimming up too high puts me in the spikes, and swimming too low puts me in the strong current before the flag and pushes me down.   And I was playing this with a game controller. What kind of idiot puts strong currents around a Save flag like that, especially since I'm trying to point as far to the top-right as I can go and mashing the jump button?  How freakin' strong did you make the water current? Since I can't make any more progress...  Then I had to put the game down. I know some water levels are ridiculous in a sense, but this is pushing it too far.",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't like dieing over and over again to learn a pattern to finish a stage, leave this game alone. You might not even get out of your house twice in a row!",
            "review_score": "-1"
        },
        {
            "review_text": "Uniquely awful, this game is a classic styled platformer done in a Demon's Souls style, where you have to play the game and die repeatedly to learn how to beat it. Clumsy styling, poor graphics and repetitive gameplay sink any chance this game has of rising above mediocrity. I doubt people would own this game if it wasn't included in bundles or if it didn't come with steam trading cards. Absolute garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a troll.  Moving the girl feels cumbersome and clumsy. This is in no way fun like 'I wanna be the guy'. There's not even an option to play in fullscreen. Just two ugly black stripes to the left and right.  Waste your time and money on something better. If you like hard platformers you should look into 'La Mulana' here on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Super Mario Bros on nightmare difficulty, with potato quality resolution.",
            "review_score": "-1"
        },
        {
            "review_text": "drove me mad got a save file of a friend :)  cat mario copy!",
            "review_score": "-1"
        },
        {
            "review_text": "* Start the game * Enter the first area (not the first level yet) * Die within 5 seconds ... * Once you passed this .. eh.. TEST? ... get into the first level... * Die within 5 seconds ... * Get past this barrier/trap/whatever * Die within 5 seconds ... * Continue this dumb 'gameplay' idea forever troughout the whole game  This game feels like ' Runner '. If you don't hit the correct button/direction at the given time, you start all over and over.. and over again. For a game like Runner this makes sense.. but for a game that looks like a Mario clone.. this is really wrong!   I'd rather suggest to play Runner or maybe ' Bloody Trapland ' where you at least know that you're in for some serious headache!   I only got this game because it was in the IndieGala October bundle.. i would never buy this game directly nor would i recommend it to any friend!",
            "review_score": "-1"
        },
        {
            "review_text": "The music is really annoying. The graphics are definitely second rate. The game's difficulty is supposed to hard but that doens't neccesarily make something a good game. I'd return it if I could.",
            "review_score": "-1"
        },
        {
            "review_text": "Under the cute visuals and absurd difficulty lies a generic platformer that any person with even the smallest experience in game making can cough up in no time at all. This would feel sloppy if it were on Newgrounds! The animation is choppy, the controls are slippery and the fact that they are asking for five bucks for this is just insane. This game offers very little new to the sea of platformers, with the only thing worth mentioning is its absurd, mind numbing, keyboard breaking difficulty. Let me provide an example: I tried to leap onto a platformer to get a diamond and a wall suddenly appeared in front of me and blocked my path, which resulted in spikes appearing above me and killed me. Or how about this example: I tried walking out of my house and a sea of pie pans fell from the sky and killed me. Or this: The game told me to jump into a vase to teleport somewhere and I was teleported into a spike filled pit and died on the spot! You know how people are always saying that games like Five Nights at Freddy's are only bait for people that makes walkthrough of them getting scared? Well this game is bait for people who make walkthroughs of them rage quiting! There is no logic, reason, strategy, thought, or effort but into the difficulty. Its noting more then a trial and error simulator where you have to memorize where all the traps are. I died over 40 before I was half way through the first level. 80% were not my fault because a bed of spikes or killer plants suddenly appeared beneath me or a the ground fell out from under me, or the game straight up LEADING ME INTO A DEATH TRAP. None of this is the slightest bit fun and is only VERY annoying for lack of better (and four lettered) words. This game was an absolute waste of money and utterly unenjoyable. Cute visuals be damned, do not under ANY circumstances get this God awful POS.",
            "review_score": "-1"
        },
        {
            "review_text": "Eryi's action is, hands down the least enjoyable game I have ever played. Many of the reviews I have read have described this game as funny, or have said that this game trolls the player. The thing about trolling is that once it is over, you can laugh about it in hindsight. That is not the case with  this  piece of sh*t.  This game goes out of it's way to kill the player in some of the lamest ways imaginable. Newsflash for you jokers over at Nyu Media/Xtal Sword : 99.9% of the gamers out there don't  LIKE  getting killed. The final straw for me came at the end of the first level. I hit the goal, and as I went to exit the screen a spiked ball fell and killed me.  Not funny. Not funny and certainly not cool. Who wants to play a rigged game?  Not only am I saying this game is pure and utter sh*t that you should avoid, but I am uninstalling this crap off my computer. I just wish I could get the $5 I wasted on it back.",
            "review_score": "-1"
        }
    ]
}