{
    "app_id": 2620,
    "name": "Call of Duty®",
    "release_date": "2006-10-13",
    "developer": [
        "Infinity Ward"
    ],
    "publisher": [
        "Activision"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "World War II",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 1555,
    "negative_ratings": 117,
    "price": 14.99,
    "description": "Call of Duty® delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2620/header.jpg?t=1450407165",
    "minimum_requirements": "OS: Windows 98 / ME / 2000 / XP Processor: Pentium III 600 MHz or Athlon 600 MHz processor or higher for systems with Windows 98/ME, Pentium III 700 MHz or Athlon 700 MHz processor or higher for systems with Windows 2000 / XP Memory: 128 MB Graphics: 3D hardware accelerator card required - 100% DirectX 9.0b compatible 32 MB hardware T&amp;L-capable video card and latest drivers* DirectX: Version 9.0b (included) Network:  Storage: 1.4 GB of uncompressed free hard disk space (plus 400 MB for Windows 98/ME swap file, 600 MB for Windows 2000 / XP swap file) Sound Card: 100% DirectX 9.0b compatible 16-bit sound card and latest drivers Additional Notes: 100% Windows 98/ME/2000/XP compatible mouse, keyboard and latest drivers Multi-player Requirements: Internet (TCP/IP) and LAN (TCP/IP) play supported Internet play requires 56kbps (or faster) modem and latest drivers LAN play requires network interface card and latest drivers Important Notice: *Some 3D accelerator cards with the chipset listed here may not be compatible with the 3D acceleration features utilized by Call of Duty. Please refer to your hardware manufacturer for 100% DirectX 9.0b compatibility. *Supported Chipsets All ATI Radeon cards All nVidia GeForce cards Matrox Parhelia",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Brings me back! Do you remember when Call of Duty felt unique? When Call of Duty wasn't looked down on and 'laughed' at? When it wasn't the butt of the joke? pepperidge farm remembers, that's why we recommend that you play this classic maybe you'll remember too.",
            "review_score": "1"
        },
        {
            "review_text": "Mother of God Dis game. The Ambience is thrilling The Game says so much without so much as a word from our characters  great story great gameplay great ambience   just buy it..Hope that activision drops the price on this baby",
            "review_score": "1"
        },
        {
            "review_text": "Call of Duty is a first-person shooter from Activision, the first game of its franchise.  Call of Duty set in the second world war, D-Day on and after the invasion of Normandy. In Call of Duty, you can play as three nations with America being the first, you play as Private Martin of the US Airborne Division dropping behind enemy lines before D-Day is happening. Then as the British you also play as the British Airborne assaulting the Pegasus Bridge while as the Russian you take part in the harsh Battle of Stalingrad and beyond with the Red Army. You will use many world war II weapons like M1 Garand, MP-40, Bren, Thompson and many more.  Call of Duty graphics may be old, but it still good, the characters acting are good. For an old game it runs smooth and without issues on newer operating system.  Call of Duty is a good game, a good start for Call of Duty series since this is the first of the series. Good old game, I recommend this.  Rating 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Call of Duty is a first person shooter set in World War 2. We start off as a simple American rookie in boot camp where we are thought the basics of crawling, shooting and reloading. Before you know it you are sent right to the heat of battle and left to fend for yourself as your allies are too busy trying to survive to help the recruit. It was a pretty cool intro that immediately reminds you that you are just a simple soldier not John Rambo. There is no regenerating health but instead you must rely on health kits to restore your health. It forces you to play much more smartly and knowing when to duck and hide while letting your allies take the fatal wounds in your stead. You are very rarely alone and will have allies watching your back throughout most of the battles.   Unfortunately your allies can prove to be just as fatal to your as the enemies. They will occasionally block your path while you are under fire and have a habit of looking into your barrel while you are trying to line up a shot. You are not allowed to shoot them since the gun won't fire when you aim at them but they somehow find ways to get killed by your bullets. They are not completely awful and will frequently save your life but they can be quite a burden at times. Later on you will also play through the eyes of a British and Russian solider which have completely different feel and take place simultaneously to the American war efforts.  Each nation has their own unique set of weapons but the Germans use different guns so you will run out of ammo and have to rely on scavenged German weapons in all three campaigns. The British campaign is the weak point of the three as you will usually be “infiltrating” some place but it always ends up with you killing tons upon tons of enemies by yourself or with a few allies which feels very out of place from the chaos of the other two campaigns. Chaos is where the Russian campaign exceeds. It is very brutal and you better pay attention to what people are saying and duck when you hear them say so or you will without a doubt die. Your comrades won't even equip you with a gun, just a round of ammo and tell you to run up a hill where the Russians are being slaughtered by the dozens. Gods help you if you stop running to collect a gun and some more ammo, they will assume that you are a coward that froze up and gun you down killing all sense of comradery between you and the people at your back.  Gun play is top notch and is very fluid. All the guns feel unique and sound very powerful. It is truly a pleasure to the ears to hear the battle around you and everything comes together to be very immersive. The Germans have far superior aim than your allies and it can be annoying how accurate they are with anything in their hands including mounted machine guns. Your allies are pretty capable when they are rushing toward the enemy but as soon as they are stationary they suddenly have the aim of a drunk Stormtrooper. You are equally as accurate as the enemy with most guns and are capable of leaning sideways without moving which is very useful. Up to two weapons of your choice can be carried along with your pistol and grenades. It does present a problem when there are tanks in the area and you are forced to carry one since your allies are always extremely reliant on you even if the anti-tank launcher is right next to them.  Graphics are obviously dated and it does not support modern resolutions out of the box. You will have to tweak the config files a bit for HD. It is surprisingly pretty tame on violence. There is no gore and the only blood is a small burst when shot that quickly evaporates. Music is great, sound effects are incredible and voice acting is pretty good too minus the Russians. Multiplayer is only played by a few dozen people and it's alright. Nothing special but it is pretty fun though expect a challenge from the veterans that still play this game. You will not be on foot throughout all of the campaign, you control a tank for a brief mission and will have to occasionally shoot out of a moving vehicle. The latter can be a bit frustrating since you do not regain health and have no way to avoid damage other than shooting them before they fire a shot at you.   This is still a great title that holds up well to this day. The only feature that would be odd to modern FPS gamers is the health kits required to survive but other than that you should be able to fit right in. All the things that make a game like graphics, sound effects and gameplay work very well with each other in this title and it makes it a immersive and brutal experience throughout. This is definitely not the Call of Duty to get if you want to play multiplayer though. Outside of the campaign there is nothing else to do and there is no incentive to replay it again so it is the type of game were you play through it once and delete it. It is one hell of a ride though and highly recommended to those seeking a single player World War 2 experience.",
            "review_score": "1"
        },
        {
            "review_text": "The one and only 'Call of Duty' game that implemented a health bar for the player. It is not the average 'run and gun' military fps where the message 'you are hurt, take cover' is constantly displayed. A true masterpiece of the series that describes the atrocities and the horrors of the war, it is punishing experience that I strongly recommend to give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "The Original and one of the best. It's been just over 10 years since I played this game last. It looks like it is running on Quake III Engine as were many games of its time. Based on WWII, you play as the Allies; US, UK and the Soviets. Use guns of the time, drive tanks, shoot with Panzers, anti tank rifles, even get shot by Soviet Sargents for running like a coward (as they were told at that time to keep on advancing, don't turn back or you will be shot) - even the fact that the soviets were either given a rifle or ammo was there! This is the Call of Duty without auto health regeneration, you have to find those health packs. Towards the end of the game, some footage is shown (although later CODs like Call of Duty: World at War has more footage). I wouldn't expect Multiplayer to exist. I'm giving a thumbs up because I like this game, liked it before too, otherwise the story is pretty short for the value for money.",
            "review_score": "1"
        },
        {
            "review_text": "Finished Call of Duty after all these years having it in the library. Watching the end scenes of Russians and Americans shaking hands, and celebrating victory over Nazi Germany. You look back now and wonder, how did the US and USSR become such hated enemies after both fighting two common enemies - Germany and Japan.",
            "review_score": "1"
        },
        {
            "review_text": "I remember the first time I played this game. The way I felt playing it didnt change at all. Oh, Lord, It's so nostalgic. I love the golden age of FPSs. This game is awesome. and in fact there ARE servers on, unbelievable. I like everything about WW II games and it all begun with Call of Duty(¹).",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Be me &gt;Nazi kills one of my NPC friends &gt;Go into a bloody rage and murder all the Nazis for hurting my buddy &gt;Accidentally shoot one of my other NPC buddies thinking he was a Nazi &gt; I have made an unforgivable mistake  &gt;Step into a minefield &gt;Die with honor   Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "This is it, the first call of duty, and it was great then, and its still great now, pretty much. Ok where to start? well I really want to go over single player first. I bought the game for really for single player but you can still find server's sometimes. You start of in US army basic training. and cap. Foly shows your some old propaganda signs that look better then half the graphics in *insert newest call of duty here*. you then run the trainig corse and crawl under live fire. and do not forget what happed to private Bell, he did not keep his head down. then its wepons training. Your first taste of battle is d-day. as private Martin, you land in france and act as a path finder. over all the american missons are great as all the missons, but its the russian missons we talk about the most. There are car chase's and secret missons and mass attacks, and its all more realistic then QTE gubbins and granade spam. For full price it might be worth it but I know it was for me, its up to you to choose. It runs great and I do not think it has ever crashed. I play it on windows 8.1. this game is a masterpiace and all you really need to do is play up to call of duty 4 or world at war, then stop.",
            "review_score": "1"
        },
        {
            "review_text": "Best Call of Duty ever made. Would still play this game in 2014. If you are looking to play one of the best FPS games from back in 2003 then here's the game for you. There is actually recoil in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Ah, the nostalgia. This game was some of the most fun I've ever had in terms of video games back in the day, and still holds a great singleplayer campaign. For me personally, this is one of the best installments of the series mostly due to the good memories, but also the quality campaign and fun multiplayer maps.",
            "review_score": "1"
        },
        {
            "review_text": "ok, i have played this offline and non-steam. this is an old game. the graphics are old. the actul game is quite good. plenty of story missions and the multiplayer is kindov active(exept in australia) and its DLC united offensive is great.   BTW friend me if you are in australian and want to play Call Of Duty:United Offensive",
            "review_score": "1"
        },
        {
            "review_text": "Even the credits are amazing. There is no valid reason not to own this game.",
            "review_score": "1"
        },
        {
            "review_text": "  Back to old times",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! As a CoD fan, you must get it no matter it's pretty old, it's really better than every new CoD coming out every single effin year (effin tired of that)! I played it alot in my childhood, and enjoyed the gameplay for long time. Speaking of the soundtrack - i really enjoyed it too, sounds well, it's really atmosphering, especially, the ship mission! Multiplayer here is the best too, ♥♥♥♥ off bloody kids who wants 'Player progression and mour awsum tings'!! Also, the game is open for modding, already played alot of Community created content like 'Codoom, Modern Weapons', even tried to make my own mod, but i was lazy. Of course i can talk about the DIFFICULTY OF MODMAKING! It's bloody easier, better than Half-Life! That's all from me, and the last words - Probably i can say it's the best CoD from IW ever! (Same goes to CoD3, it was the best CoD from Treyarch ever)",
            "review_score": "1"
        },
        {
            "review_text": "Ok, I played all of the COD series (accept 3) and this and united offence could be very much top of my list. It is a very good game, and can still hold its ground against some of the sequels. I think this is one of those games in COD series where ACTIVISION didn't rush to put out but to perfect it. Now look at COD, a sequel every year with changes just to the story line but nothing else, love COD 1 and would recommend to any players to test their skills. OH yeah, did I mention your health does not regenerate, haha, love this game, I played this game back in 2006 and I bought it again, that's why of the low play time.",
            "review_score": "1"
        },
        {
            "review_text": "'With age comes wisedom' ",
            "review_score": "1"
        },
        {
            "review_text": "Very Intresting Multiplayer and Story.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest FPS game of early 2000's. Great atmosphere,scenario and gameplay. ",
            "review_score": "1"
        },
        {
            "review_text": "Call of duty was really fun. Charging towards enemy lines, through bombardment it was really thrilling. Plus considering the release date, the story and the battles this game provides is unparallel. I really enjoyed it.   +) Easy aiming.  +) Good story.  +) Sufficient healing items and ammo.  +) Reasonable mapping.    -) While recording it twitches a lot. Almost the entire time.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game brings good memories back. As for 2003 year game, it was simply amazing. You play as a soldier in American, British and Russian campaign . Great graphics, solid presentation of historic WWII battles, great gameplay, awesome music. The very first game in the amazing Call of Duty series. I'm glad I've played it. Highly recommended!  I have completed the game on all 4 difficulties at least once. Basically, Greenhorn, Regular and Hardened all differ in the amount of damage enemy A.I. is dealing to the player, however, on Veteran, not only enemy A.I. is dealing the same, if not slightly more damage to the player than in Hardened, but there are also no health pickups whatsoever! So the only way to beat this game on Veteran is to abuse quicksave/quickload function, which, thank goodness, is very well implemented. R.I.P. F5 + F9",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the best of the series. When I claim to not be a Call of Duty player, I'm not talking about this one. A fantastic classic I would recommend anyone who appreciates history to play.",
            "review_score": "1"
        },
        {
            "review_text": "Good, old-fashioned Call of Duty. THE FIRST ONE EVER RELEASED. I remember playing this back when I was like 8 on my dad's laptop. It was amazing then...and most definitely still is today.  The servers online are almost always full with an abundance of peeps playing.   You'll never go wanting with this game.  It's original. It's a classic. And it beats out any CoD game to date.",
            "review_score": "1"
        },
        {
            "review_text": "i like the driveby scene where u pop all the skinny-♥♥♥ germans rite up da ♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Those good old days when FPS still have REAL campaign...... won't come back again, nevermore.",
            "review_score": "1"
        },
        {
            "review_text": "Always when I play Call of Duty I feel satisfied. This game is perfect !, better than newer Call of Duty´s now. Atmosphere is absolutely amazing. There are still players playing MP. I will come back many times to replay story. Hope there will be more Call of Duty´s like this.    Just one word: Masterpiece.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Call of Duty. You can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Call of Duty as it should be. Boots on ground, real events and locations, and no bullpoop. Just shoot some Germans and win the war! Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay: 8/10 Graphics (Based on Release Date): 8/10 Performance: 10/10 Story: 7/10 Soundtrack: 10/10 Feeling: Less Dark than the Other WW2 CODs. I love it. 10/10 Setting: 9/10 Weapons: 6/10 Controls: 7/10 Animations (Based on Release Date): 9/10 Nostalgia Factor: 10/10 Wildcard - Progression: 7/10  ------------------- OVERALL: 9/10 -------------------  Please get this game. Easily part of the best COD's to date. I love WW2 Call of Duty's. SURE Battlefield 1 is coming out, but everyone is asking for another WW2 COD. Call of Duty has always done WW2 better than Battlefield. I just hope Treyarch/Infinity Ward realizes that :/  Still get this ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "My childhood",
            "review_score": "1"
        },
        {
            "review_text": "probably the best of them all 9\\10",
            "review_score": "1"
        },
        {
            "review_text": "The beginning of the dream...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The first two levels in the Soviet campaign trumps everything else in the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "I never played the earlier CoD games and I am having a blast. These games are a real treat. I don't know what happened to the series over the years, but Infinity Ward/Treyarch need to go back to their roots. the IW did an awesome job with their WWI series. The soundtack is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "this game is from my past and i love it",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as MLP, but still good.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. You should pay up to $25 for this game.",
            "review_score": "1"
        },
        {
            "review_text": "For 9.99 I get blank screen thnks alot for taking my money!!!!! got it long time before your comments",
            "review_score": "-1"
        },
        {
            "review_text": "wont open up!!!!!! I press play then says safe mode? yes or no it still goes to a black screen. only when I press the space bar does it go back to say play . I wish I could recommend this but doesn't work",
            "review_score": "-1"
        },
        {
            "review_text": "This ESRB has nothing about language, which this game has.",
            "review_score": "-1"
        },
        {
            "review_text": "where the f... is UNITED OFFENSIVE?",
            "review_score": "-1"
        },
        {
            "review_text": "The campaign is mediorcre, but the multiplayer is bad. There are NO servers online, I would expect more people because this is, you know, THE FIRST COD GAME. So when I create my own server, I die after aproximately 30 seconds from no one.   Simply put, this game is bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Been playing CoD for years and years and i keep coming back for the Bolt Action rifle action! Great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and really shows how the franchise evolved (or in some cases devolved) and it almost beats Medal of Honor Allied Assault as one of my favorite WWII games. This game gives you what you want awsome action and fighting many Nazis. The levels are big but some of them are really hard specifically in the British campaign. There is even multiplayer with mods to modernize the gameplay. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Offers an arguably more difficult campaign thanks to the lack of regenerative health. Many of the missions were quite poor and involved simply going from point A to B with no real stand out moment or climax, several times i had to ask myself 'is that it?' when the mission ended. Honestly thought the game was underwhelming and it would have left me disappointed only for the final mission (the storming of the reichstag, though nothing compared to its counterpart mission in World at War, was awesome) and the russian lads speech in the final cutscene. Also the 'No cows were harmed in the making of this game' disclaimer which i found quite witty. Overall it wasn't terrible but still a shadow of the latter releases, granted it was released in 2003 but COD 2 in my opinion offers a vastly more enjoyable campaign. EDIT: I know it's irrelevant from a reviewing standpoint, but Danny O' Dwyer said the mission I mentioned above was the first time he cried while playing a video game.",
            "review_score": "1"
        },
        {
            "review_text": "This is where it all started, no one plays it though becuase COD2 is pretty much this but better.",
            "review_score": "1"
        },
        {
            "review_text": "- Just buy it. ",
            "review_score": "1"
        },
        {
            "review_text": "Call of Duty.   Intended to be called Medal of Honor Killer it lived up to its name. The game is brilliantly paced, immersive and challenging.   The old health system can at times make the game more intense but frustrating at the same time.  If you can look past the old graphics and technical issues your in for one of the most original and memorable Call of Duty experiences yet.",
            "review_score": "1"
        },
        {
            "review_text": "The best game from my childhood, when i play it a lot. Got it for 9,99€ from HumbleStore as WarChest bundle which includes Cod: UO and Cod 2, so i think it is a great deal :) I recommend it for collectors.",
            "review_score": "1"
        },
        {
            "review_text": "I bought it for the United Offensive expansion pack.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The most memorable FPS I played in my life. I wouldn't mind a remastered edition.",
            "review_score": "1"
        },
        {
            "review_text": "A great shooter for it's time. I wouldn't recommend it now since it's so old unless of course your a huge fan of WWII.",
            "review_score": "1"
        },
        {
            "review_text": "like to swap for this game",
            "review_score": "1"
        },
        {
            "review_text": "best cod ever :) played it since it came out, did competitions in it cant recommend it enough best time ive ever had gaming!",
            "review_score": "1"
        },
        {
            "review_text": "The game that challanged the master (Medal of Honor: Allied Assault) and emerged victorious.",
            "review_score": "1"
        },
        {
            "review_text": "If you like WW2 you will like this and its just like any call of duty except with WW2 guns",
            "review_score": "1"
        },
        {
            "review_text": "The original call of duty, still fun many years later. It might be dated but it's still one of my favorites.  There are three campaigns (USA/UK/RU)   Definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "the only main flagship installment in the cod series not to be on the xbox 360 at the time of this review which is kinda wierd cuz all of cod but one game has only lived through one console cycle",
            "review_score": "1"
        },
        {
            "review_text": "an interesting look at how far gaming has come. good gameplay, ♥♥♥♥ poor ai and story. the levels are almost episodic, leaving a severe lack of cohesion.  i do not recommend this game unless you want it for a CoD collection and/or for the sake of nostalgia",
            "review_score": "1"
        },
        {
            "review_text": "Good. Questionable 90s graphics though",
            "review_score": "1"
        },
        {
            "review_text": "Good times",
            "review_score": "1"
        },
        {
            "review_text": "Very different than the future CODs When i played the SP it was very different than the other CODs i've played and it almost feels like a different game altogether and the story teaches you a lot more about WW2 and the hard times soldiers had to go through. A downside to this game is that there is no ranked multiplayer and you can only play with friends who also have the game but i guess that can be excused for it is a 2003 release.  To conclude, if you want to play a good PC game and maybe not have a very powerful computer to run 'newer' games or just want to re-live old memories from playing past CODs this one's definetly for you.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game mainly for the nostaligia, one of the first FPS games I've ever played, I still remember as a 8 year old playing this game, having major no knowlege of second world war history. I only knew when I was playing as the Americans fighting Germans and that's it, I still repeat the Soviet half of the campaign as I remember it being my favourite part of the game. I remember being shocked while on the transport boat off to fight the Germans, I didn't know I was playing as the Russians when I was 8, but knew I wasn't playing as Britain or America. This game showed me the real, gritty part of war, the true face of man, this was probably the reason for my big interest in history and why I'm currently learning Russian, truly a game that will stay in my heart forever. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Before Exo Suits, Care packages, explosions every 5 seconds and a blockbuster amount of drama and insanity, there was Call Of Duty and it's idea of World War 2. You honestly can't go wrong with the classic.   10/10 Captain Prices.",
            "review_score": "1"
        }
    ]
}