{
    "app_id": 262080,
    "name": "Iron Soul",
    "release_date": "2014-02-26",
    "developer": [
        "BluBee Games"
    ],
    "publisher": [
        "Effat Effati"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Sci-fi"
    ],
    "achievements": 25,
    "positive_ratings": 9,
    "negative_ratings": 46,
    "price": 3.99,
    "description": "Discovery of a new Goldilocks planet has led to the creation of a new type of army: One that is made of metal and steel. One that can’t feel pain or fear. One that is said to be our only hope against a possible alien invasion.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262080/header.jpg?t=1447359352",
    "minimum_requirements": "OS: Windows XP SP3 or Windows Vista Processor: 2.0+ GHz or Equivalent Processor Memory: 1 GB RAM Graphics: GF6800 Minimum Or Compatible Radeon Card DirectX: Version 9.0c Storage: 1800 MB available space Sound Card: DirectX Compatible Sound card",
    "recommended_requirements": "OS: Windows XP SP3 or Windows Vista Processor: 3.0 GHz or Equivalent Processor Memory: 4 GB RAM Graphics: GF6800 Minimum Or Compatible Radeon Card DirectX: Version 9.0c Storage: 1800 MB available space Sound Card: DirectX Compatible Sound card",
    "reviews": [
        {
            "review_text": "I....don't really reccomend this game. Robot is as cool as it will get, and this game is as Indie as it gets. Not to mention the old door opening and closing sounds, which are definetly from the first half-life games as it is. As well as the lab sounds. Combat broken. And who stands still while flying in the air and kicks?",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing special. Combat and movement systems could be made better.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm an atheist, and even this game made me pray to God to make it stop.",
            "review_score": "-1"
        }
    ]
}