{
    "app_id": 262190,
    "name": "Zombeer",
    "release_date": "2015-01-30",
    "developer": [
        "Moonbite Games",
        "PadaOne Games"
    ],
    "publisher": [
        "New Gravity Laws"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Nudity"
    ],
    "achievements": 12,
    "positive_ratings": 134,
    "negative_ratings": 36,
    "price": 3.99,
    "description": "In the near (and some might say, lucky) future, there is a pandemic transforming the world’s population into zombies. That’s not the lucky part – it’s this: Once bitten by a zombie, the only way to stave off the infection is drinking beer!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262190/header.jpg?t=1552306700",
    "minimum_requirements": "OS: Window Vista® (SP2) / Windows® 7 (SP1) / Windows® 8 Processor: 2.00 GHz Intel® Core™2 Duo or similar Memory: 2 GB RAM Graphics: 512 MB DirectX® 10—compliant with Shader Model 4.0 or higher DirectX: Version 10 Storage: 3 GB available space Sound Card: DirectX 10—compliant (5.1 surround sound recommended) Additional Notes: Windows-compatible keyboard, mouse, optional controller (Xbox 360 Controller for Windows recommended)",
    "recommended_requirements": "OS: Window Vista® (SP2) / Windows® 7 (SP1) / Windows® 8 Processor: 2.00 GHz Intel® Core™2 Duo or similar Memory: 4 GB RAM Graphics: 1024 MB DirectX® 10—compliant with Shader Model 4.0 or higher DirectX: Version 10 Storage: 3 GB available space Sound Card: DirectX 10—compliant (5.1 surround sound recommended) Additional Notes: Windows-compatible keyboard, mouse, optional controller (Xbox 360 Controller for Windows recommended)",
    "reviews": [
        {
            "review_text": "5/10   5% Alcohol. 100% Heart - Zombeer Protagonist  I would also guess some crack cocaine and cough syrup was involved in the making of this game along side zombeer, the fictional beer that slows down the effects of zombification. What we have here is a charming little game with some major issues  The Pros: - Art Style - I like the look of this game, for some reason the beetlejuice cartoon comes to mind, although I could be very wrong with that comparison - The Soundtrack - great music, even if some of the tracks feel misplaced in certain sections. - Drunk poopy humor - stupid humor that isn't all that funny, but amusing. Although the second to last cutscene in the game was extremely funny, anyone who has played this knows what im talking about . - well placed videogame/film pop culture references - by far my favorite part of this game. very tastefully done .  The Cons:  The Gameplay - I cant really say I had much fun playing this game. It felt clunky, the melee combat is awful, and 2-3 weapons you have are really boring. the only time i had remotely any fun was when some cool music would kick in during a section, but it would abruptly end in an awkward way - XBOX360 CONTROLLER PROMPTS FOR INGAME QUICK TIME EVENTS - THE BUTTONS SHOW UP AS 'JOYSTICK BUTTON 0' OR 'JOYSTICK BUTTON 2' FOR THE QUICK TIME EVENTS!!! WHAT!?!?!? HOW CAN THIS HAPPEN IN 2015 WHERE A 5 YEAR OLD GAME LIKE AMNESIA ACTUALLY SHOWS IT AS 'A' OR 'X' FOR THE INGAME PROMPTS . THIS REQUIRED TRIAL AND ERROR FOR THE QUICK TIME SCENES WHICH IS UNFAIR AND THE MOST ♥♥♥♥♥♥ OFF I HAVE BEEN PLAYING A GAME IN A LONG TIME.  - drinking zombeer throughout the came became repetitive and boring. I would have liked a brief explanation of how the protagonist gotten bit. I know a game like this doesn't require an in depth story, but it just seemed stupid - worst end arena boss battle ever - Every round ended with a quick time event, and if you died in the last round you had to start at the beginning of the arena battle, I felt that was unfair for a game like this , for it required you to wait around to do the same boring quick time events - Quick Time Events in general, completely pointless. You can mow down zombies and beat em up with ♥♥♥♥♥♥ face to face, but one single zombie runs at you from down the hall and you have to run into a room via quick time event and if you fail it he kills you? again why its so pointless  The hardest part of writing this review is deciding whether to give this game a thumbs up or down. even as i was writing this I still hadn't decided which one to choice. With all this said, I have a hard time recommending this game. I did enjoy many aspects of Zombeer, but I didn't really have much fun playing the game, and having fun is kind of an important aspect. I give it a 5/10. Its not a bad game, not a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "This might be a decent game. Unfortunately, the use of a software cursor in the control scheme makes precise control of the character virtually impossible. Played with the sensitivity both on my mouse and in the in-game slider, didn't make much difference. Might be better with a game controller?",
            "review_score": "-1"
        },
        {
            "review_text": "- Super Edited! -   After playing the game some more, I think that thanks to the updates that have been put into the game from the developers has actually made the game more enjoyable.   Gameplay can get pretty repetitive after a while and the graphics aren't going to wow you in anyway but for a game that really was just a port from the PS3, it's not all that bad. It's got a sort of Postal charm to it after a while and the gameplay though repetitive can be pretty fun in so stages were you get a new weapon.   AI is pretty dumb though, I know they are Zombies but they are dumb as bricks but it adds some charm to the games overall appeal. The models are pretty strange as well, and jiggly zombie boobs... that's all I'm going to say about this one.   The humour of the game is sadly where I'm going to fault this game, it's pretty bland and it's pretty obvious what the joke is and it ends up coming out as stail. The Simpsons joke in the game was okay but really wasn't hilarious.    Thanks you to the developers for being kind for a change instead of denying criticism like most modern 'indie devs' now a days. You guys seem to take it to heart and actually really enjoy making games and I have to say that I was a bit angry before but playing the game over again, it's not a bad game, it's very good but I'd have to say some of the flaws do hold it back.   7.5/10  Good game, even though it has some flaws.",
            "review_score": "1"
        },
        {
            "review_text": "I will keep it simple and say its a alright game. The only thing I enjoy about the game is that its different from any other game I have played before or seen on steam. Only worth $5 imo",
            "review_score": "1"
        },
        {
            "review_text": "Zombeer: Graphics look's Nice, Sounds Nice and Music is Alright. I kind of waited three year's to play this game, I Green lighted on Steam Greenlight way back then. It's not a Horrible game and It's not a Great game. The game is like a Love Letter to All type's of Movie's, Show's, Game's and Comic book's. The biggest Down side to the game is the Aiming System or Hit Detection: When trying to hit a zombie in the head with the Pink ♥♥♥♥♥ it's like 'Yeah Good Luck With That' Cause I know I'm aiming at their head and I see the cross hair circle is where it need's to be to hit them in the head. With that said and Done I will say just play it on Easy or Normal, I did Normal cause I tired doing Hard but thats when I first notice the Hit-Aim is off that is when I went with Normal. I also picked up Zombeer for 20% off of $9.99 so all I paid was $7.99 I Do &amp; I Don't Recommend Zombeer I went with Yes cause it's a Fun little game to play and their is no middle ground for Yes or No. Now down to business Zombeer is a 6 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. Just what I wanted, a shooter thats fun and not to serious (call of duty). Yeah its short but a good short.  Pros: Fun, boobs, a lot of movie referance, sexy, one liners,   Cons: Pop ups or Tips disappear up way to quick (maybe a second), controls (got use to them), Final boss was frustrating  This is a solid shooter for a good or rainy weekend. Can't wait for part 2 (and more boobs)",
            "review_score": "1"
        },
        {
            "review_text": "Really Fun to play with a nice soundtrack. If you are bored of AAA FPS and need some funny wtf fps style just go for this game. Nicely made with Unity its one of my favorite indie game made with it.",
            "review_score": "1"
        },
        {
            "review_text": "Game gives absolutely no ♥♥♥♥s.  69/13 2spoopy",
            "review_score": "-1"
        },
        {
            "review_text": "Zombeer is so bad that it's so good. You really want to know what happens in the sequel (if there ever will be a sequel for this game!) and there are so many refrencess and easter eggs you will ♥♥♥♥ your pants.  But I would never buy it for 10€ and wait for the sales to come and oick it up.  If you are tired of all the modern fps then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "this game has beer what more do you want",
            "review_score": "1"
        }
    ]
}