{
    "app_id": 262150,
    "name": "Vanguard Princess",
    "release_date": "2014-03-03",
    "developer": [
        "Tomoaki Sugeno"
    ],
    "publisher": [
        "eigoMANGA"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Steam Trading Cards",
        "Captions available",
        "Steam Workshop",
        "Partial Controller Support"
    ],
    "genres": [
        "Sexual Content",
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Fighting",
        "2D Fighter"
    ],
    "achievements": 0,
    "positive_ratings": 1975,
    "negative_ratings": 773,
    "price": 3.99,
    "description": "Vanguard Princess is a classic 2D fighting game that features an all-female cast each with their own unique fighting style. Choose from ten girls with unique fighting skills and pair them with a powerful partner to form an unstoppable team.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262150/header.jpg?t=1525419364",
    "minimum_requirements": "最低配置: 操作系统: Windows 10, 8.1, 8, 7, XP, 2000 处理器: Pentium III 400MHz, 128MB RAM 内存: 1 GB RAM 图形: Graphics card with 32MB Video RAM 存储空间: 需要 470 MB 可用空间 附注事项: DirectPlay must be installed for Windows 10 PCs",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My Dad Gave Me A Straight Look In The Eyes And Simply Said 'You Stole My Credit Card For This?' 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Vanguard Princess was the best game I have bought in the last hour. I have found it to be both noisy and brightly colored. It will occasionally react to keyboard input, although it is crucially missing the 'Just dispense the tradng cards already' button. Rumor has it that that will be in the next DLC.  In combat, you must choose the direction of attack and movement (presumably combined because moving in one direction and attacking in the other would weaken the dimensional infrastructure), and the type of attack (Weak, Normal, Strong). My personal favorite is 'Weak' - because really, why bother with an attack unless it's a really weak one.  Character selection screen needs some work, as you can't get a really good feel for the interpersonal relationships between the primary fighter and her assistant or cosmetologist or whatever the second girl is supposed to be for. I mean sure, Kaede can use 'Godspeed Bloodbath' (actual in-game move name, BTW), but is Hilda really down with that? She really strikes me more as a 'heavy on the bloodbath part, ease off on the Godspeed', so you know, maybe some ideological differences down the road there.  I would recommend this to anyone who enjoys pressing the attack key quite often. Also if you feel that the current crop of games have too many pants-wearing characters. Because they don't have that in this game. Overall, a good design choice, as the money that could have been spent on pants went instead to some stellar voice acting talent. When they grunt with exertion or make a surprised exclamation, it's like you are actually there. More to the point, it's like real life because there are no apparent audio controls.  Finally as a service to those who were looking a 'how anime is it'? breakdown: It is slightly more chibi than Skyrim, somewhere between Farming SImulator and Payday 2 in kawaii and moe, and more loli and ecchi than DOTA.  Bottom line: If you DO like anime and DON'T like pants, you'll like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the anime visuals and the weird reviews fool you, this is a solid fighting game, with an unique gameplay.  It's worth having, I'd say give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game when you just want to relax and pull some combos. With no online capabilities or a serious competitive community supporting this game, I can't find myself reccomending this game. However, it's a fun game to relax to.",
            "review_score": "1"
        },
        {
            "review_text": "The fact the developer is still putting things into the (at a slow rate) is really cool and shows that there are developers that actually care about their games and their community.   It's a '2 on 2' Japanese fightan game with cute anime girls. The game is pretty barebones only having a vs and arcade mode, so no story, which isn't really the strong point of fighting games.   I'm garbage at fighting games but I can say that the controls are good, but since it's an indie I don't really expect fight sticks to work 100% on the game. Keyboard works perfectly fine.  Free content and updates is cool, the fact that this game was developed by one guy, Tomoaki Sugeno, is amazing. Props.  Its not really expensive so anyone could pick this up if you like cute anime girls and fightan games.",
            "review_score": "1"
        },
        {
            "review_text": "Such a little tiny anime fighting game, is fun and kind of addicting but you'll get bored of it probably in a couple of hours.",
            "review_score": "1"
        },
        {
            "review_text": "A very solid doujin fighter. Netplay is available to those who don't mind a small hassle.",
            "review_score": "1"
        },
        {
            "review_text": "Nice ♥♥♥♥ 10/10 would be a weeb and fap again.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot of panties in it, if you like that then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Don't know what I'm doing wrong but I can't make my character move, became moe sandbag simulator",
            "review_score": "1"
        },
        {
            "review_text": "Nice fluid gameplay, hot chicks and nicely drawn graphics. What more can you ask for ? For this price, it's a must-buy for beat-em-up fans who enjoy a little bit of fanservice too. (and seriously, we all know why we are browsing this storepage. ;) )",
            "review_score": "1"
        },
        {
            "review_text": "This is a Fun anime fighting games, i like fighting games and i love anime so putting them together is awesome, i really had fun playing this game, it lacks on mode, its only got arcade and vs modes but its still a really fun game i think, i have fun playing it when i do",
            "review_score": "1"
        },
        {
            "review_text": "pirated this a while ago, played like 14 hours of it, felt bad, decided to buy.  ~Highly recomend a controller (like the usual fighting game .... keyboard sucks for it). ~Arcade mode is pretty fun. ~kawai characters (myjam) ~♥♥♥♥ ~buy.  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "A great Japanese 2d fighting game.  Good points:  - Graphics are nice  - Music is excelent  - Works great with PS3 controller  - Decent selection of characters  Bad points:  - Cannot go fullscreen in Windows 10  - Graphics are not HD  - Short game",
            "review_score": "1"
        },
        {
            "review_text": "+Fighting +Manga +Girls +FIGHTING MANGA GIRLS :P :D  Using controller is definitely recommended....",
            "review_score": "1"
        },
        {
            "review_text": "Fun little mini game. with pantie shots included.",
            "review_score": "1"
        },
        {
            "review_text": "i like to play this game to make a good masturbation but if you dont want to masturbate dont play him . but the girl with pink hair have the ♥♥♥♥ with a awesome smell like a fish or idk how to say but ok",
            "review_score": "1"
        },
        {
            "review_text": "I have to ask, what is the difference between the original and the Directors Cut?",
            "review_score": "1"
        },
        {
            "review_text": "Great fighting game, really fun and nice range of characters and assists. They still update it and hope for more to come in the future.  Forgot to add I have a lot more hours but mostly play multiplayer with my friend which you can find in the steam guides.  Eri is best, donutsuuu~",
            "review_score": "1"
        },
        {
            "review_text": "Panty shots &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Generic anime game without basic fighter menus  The Good: - Trading Cards - 'muh anime' (moe assists) - EASY and BASIC - Trailer's not lying-- it's just animated fighting (don't expect a PACKAGE with all the bells and whistles, that's all you get; overpriced? that's probably why the steam cards go for so much)  The Bad: - No fuzzy controls --&gt; pad/stick ftw, keyboard is a pain in the ♥♥♥ - lack of user interface / menus",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would lose again",
            "review_score": "1"
        },
        {
            "review_text": "The FBI isn't coming after me...right? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pick a Waifu,Fight another Waifu then brag about how your Waifu is better.   This game is great.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got my ♥♥♥ kicked by a girl not wearing any underwear.",
            "review_score": "1"
        },
        {
            "review_text": "Full of panties 11/10 GOTY",
            "review_score": "1"
        },
        {
            "review_text": "It's an excellent 2D fighting game. The fights went pretty fast and unless you know your character, it's hard to know what you are doing. However, once you mastered the controls of a character, fights became really intense where your reactivity is brought to its limits. Moreover, it's a trully beautiful games, using japanese manga style graphics (which I love). Musics, voices and sounds are also good and manage successfully to instaure a good atmosphere. I must insist on the fact that it is a hard game, a VERY hard game, and it is really pleasant to see one which can resist you because those games are really rare nowadays. But, this statement is also a drawback as, in hard mode, the final boss is sincerely unbeatable (I only manage to beat him twice in more than 10 hours of playing). This is the main flaw of this game : its final boss is just going to drive you mad. I do not understand the interest of setting a boss like that, because, that character aside, there is really a good balance between the different fighters. But, Hilda, the final Boss, she is definitely broken. Of course the final boss is powerful, but it should not be that much. Fact is she can attack you from distance instantly and without any pause. She can also teleport when engage in hand-to-hand combat. So, I do not know how the IA of character is made, but she will keep spamming lasers and explosions without any delay from the other side of the arena, and if you manage to get close, most of time she will teleport instantly. Appart from having hulk as a boss, playing Vanguard Princess is very refreashing and amusing. Combos are well thought, and the game has a good lifespan. An excellent game for a small price, I encourage you to buy and play it (I recommend you to play with a joypad because some techniques are very hard to make using keypad only).  8/10 according to me.  PS : if you want to see what the boss is really capable of, buy the DLC ;)",
            "review_score": "1"
        },
        {
            "review_text": "Skullgirls with less skulls and more girls",
            "review_score": "1"
        },
        {
            "review_text": "Kawaii and never eat my cpu.  10/10   ",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would fap.... srry.... PLAY again",
            "review_score": "1"
        },
        {
            "review_text": "now before i actually start the review i wanan say that if you don't have a controller you shouldn't buy the game because the controlls for a keyboard are pretty ♥♥♥♥ and if you change them they reset everytime you start the game.  +Fast combat +Boobs -♥♥♥♥♥♥ keyboard controlls",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a pretty good game, but with some issues.  Theres not a whole lot of moves per character, if you have issue with that. I don't as I prefer this as it becomes to much for me to remember a large or long move list.  Just like with Skullgirls I really like the art in this. Nothing looks blurry, the colors are nice, and the art in general is great. Bobbing bewbies are delicoius on some of the characters. The only issue I have is there are times when you can lose characters in a mess with the background.   I think it maybe best to use a fight stick with this. Trying to do the moves in this really fatigued my thumb and left hand in general. I really don't usually play fighting games as they tend to be pretty disinteresting, usually you get stuck being knocked around and need to spend hours upon hours of time you will never get back learning on how to counter this in order to get to a point where you can have fun, unless you know other players at your level of play or around there which is definetly nice but unfortunately theres no online play in this release, just local and singleplayer.   In general the game seems pretty cheap, not so much the actual game but the menus and stuff around the game seemed cheap the biggest issue being the game only running in a pretty low resolution. I couldn't find anywhere to change the settings but it wasn't a huge issue to me but your milage may vary. Also theres no ingame move list, and to pause the game you press in the right stick which is weird as hell to me.   Its not a fighter I would dump hours into especially without a move list accessible while in game, but I like it. It seems pretty cozy as a singleplayer fighter and since I probably got for next to nothing it was probably worth it. Not saying its a good fighting game, but its a good enough game to play occasionally and just waste some time with while beating on titular anime babes. Unfortunately no Peacock QT.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand why some people are rating this game so poorly it isn't a bad game at all...  Pros: -Smooth Animations  -Super Flashy Specials  -Smooth Gameplay (For those that are complaining about that lack of large combos etc. they clearly don't see that Vangaurd Princess is a more defensive fighting game than the likes of Skull Girls, Street Fighter, etc. Your goal isn't to hit 40-something hit combos (unless your Kaide) thats why every attack hits so hard)  Cons: -No Netplay (unless you use the freeware version and MTSP)  -Not much of a Storyline (but who plays fighting games for the story anyways?)  -No IN GAME Tutorial, there is a tutorial but it is a PDF file that you can find wherever the game was installed.  -Poor Pacing on single player mode (The final boss fight ramps up an insane amount as far as difficulty goes, my first time playing this on Normal Mode I had no issues until the last couple of people and then when I finally hit the final boss I ended up having to retry a good 10+ times before I finally beat her the first time...)  -Practice Mode is Stupidly Over Complicated to set up and for whatever reason flatout doesn't work if you are playing as Hilda...  Final Verdict (7/10): If you are a fan of fighting games and already know the basics I'd reccomend picking it up it's fun as hell especially with some friends to play with, however if you are new to fighting games or aren't a big fan of fighting games that don't have large flashy combos you may want to look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "I have really old laptop that most of games lags (and even when I writing this review steam lags) and I wanted play fighting game on this laptop so I bought this and when play I don't have lags (except intro).  + Can play with keyboard Anime style Can easily beat story Nice graphics (at least for my pc)  - Don't show pc control in game Can't change sound voulume Can't go into fullscreen (at least on mine pc)",
            "review_score": "1"
        },
        {
            "review_text": "While I do enjoy the battlesystem of the game, it's not possible to use a arcade stick or the D-pad for some weird reason. The only way to play/move the characters is using the analog stick or the keyboard, and I dislike using either for a fighting game. Changing the buttons used for up/down and left/right is not possible. I hope, that they'll fix this, because, to be honest, I have enjoyed playing the bit that I have played. I'm not going to give the game a negative recommendation because of this problem either, because it's a personal preference. And Well, i like this Anime Game, make remember me back in to 90's year. i Love This game, Character in this game is very cute, kawai and yeah it's good for Anime Game Fans, this is not a VN Game, but Fighting Game.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Glorious Panties!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, but lacks polish. The game runs in a windowed mode at all times, and the control scheme for keyboard play is pretty bad (A controller is advised). There's no obvious training mode. Also, the only time your movelist is visible is during chracter select, making it hard to remember specials (can't pause to see them)  Despite this, the game is fun. Both the art and music are really good, with animations being fluent and eyecatching and music being crisp and memorable (Love the guitar riffs). All the asthetics help the combat feel powerfull and fun.  For the price, I'd say the game is well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Well... where to start. This game is pretty simple, though I myself is personally horrible at arcade fighter games. I can not and I repeat can not do any of the cool combos that were intended. It is smooth overall and all the little technicalities are really fun to play with. Did i forget to mention skirts fly up all the time! Panties are all over the place! that is a plus to some people, though it dosen't particularly matter to me as it is all just eye candy. Though I do believe there is a free version of this game somewhere on the original creator's site. So I suggest you people that plan on getting this game go check that out first instead of buying it.",
            "review_score": "1"
        },
        {
            "review_text": "very good game , 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Simple and functional arcade fighter. Sometimes hard to tell what's going on. Comes with DLC that uncensors it (not safe for West)",
            "review_score": "1"
        },
        {
            "review_text": "I really like the concept. and Story. I also love the characters.  The button mechanics is a little off, and the final boss is ridiculously hard!!!! &gt;:O  but if it goes on sale, def worth it to snag up!!   its fun if you like cute anime girls &amp; dont mind a challenge for a boss fight!  (which i still have yet to beat on normal. i can t even imagine the boss on hard) O.o Aiigoooo~",
            "review_score": "1"
        },
        {
            "review_text": "Get a proper gamepad or arcade stick for this title. While it plays fine with the latest keyboards, those still using vintage PS2 inputs might find it hard to execute proper move sets. VP lacks the refinement of AAA fighting games, but if you're looking at something along the ecchi side of fun, don't pass this over.  Its playble on Windows 8.1 as far as I am concerned. You need to install Direct Play.",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Make sure to map the controls if your playing with a keyboard, because you'll have no idea what you'll need to press in the beginning. Unless you have a controller.   Awesome to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "i found this game really cool",
            "review_score": "1"
        },
        {
            "review_text": "took me 1 hour to figure out the controls and that was just how to pause anyway",
            "review_score": "1"
        },
        {
            "review_text": "Originally freeware, now it is localized and bug-fixed. Overall, a decent 2D anime-style fighting game that really requires some skills to beat AI.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, but it lacks ♥♥♥♥ to do. The roster is tiny and there's nothing to do other than the arcard mode. It plays nicely and is very nice to look at, though. I recommend this game to the obvious people who'd enjoy it. This is by no means a gateway experience for people who don't like anime-fanservice, cuteness, or fighting games much. You'd probably come out hating those things more. Fortunately, I love fighting games and cute anime sexploitation.  Wish there were more side-lolis to choose from, I don't really like any of their abilities. The combat could have a bit more depth in the combo system/attack variation for my tastes. The game lacks any resoultion options and pretty much looks like ♥♥♥♥ at widescreen/expanded. Also there's an error which I'm experiencing that freezes the game when fullscreened.   Final boss is a mother ♥♥♥♥er.   アニメの美少女とファイティングゲームが好きな人なら、このゲームも好きかもしれない。皆のパンツが見えるからね。。。",
            "review_score": "1"
        },
        {
            "review_text": "Getting screenshots of panties up close is really hard in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics: +Kawaii +Attractive style techniques -Max Resolution is low +Animations move smoothly  Gameplay: -Local VS. is not a good idea +The moves are nice -Controller needs adapter  Overall its a good game if you're looking for an attractive arcade game. If you're looking for a solid figthing game then this title isn't for you. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "+ Graphics Music Stages (Beautiful, varied backgrounds) Character choice (Fighting styles to suit any type of player) Short and sweet special attack list for each character Fewer instances of 'inescapable' combos than other fighters Arcade mode is not impossible (unlimited continues)  +/- Little backstory, Lots of fanservice No Steam achievements (Some like the prestige, others don't like the pressure to 100% complete a fighter)  - No (official) online support No (native) D-pad support on gamepads (you will have to use xpadder or similar if you don't like analogue sticks or keyboard controls) Lack of game options (just local PvP and Arcade) Full screen doesn't work properly on W8/8.1 (windowed full screen works)   7/10 - Worth it, but best to wait for a sale.  Update: You can fix the full screen issue by downloading Borderless Gaming 7.8 (free) and adding the game to its favorites list.",
            "review_score": "1"
        },
        {
            "review_text": "game play imo is pretty solid. Combos are a little difficult to pull off (its a good thing). Controller support is a little wonky. Im using this old logitech controler that worked. Artwork is awesome! and the sound track is pretty good. not sure i really need the assist characters though. I got through the game not using them (thats just me). i would like to see an online feature (im sure everyone does).   for what i paid i say its worth, the game play is very good it just needs a little more content.   i give it 10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "If you like fighting games like street fighter or king of fighters but more cooler I will recommend this game. 200/200",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me loli cancer.",
            "review_score": "1"
        },
        {
            "review_text": "Its hard to beleve this game exists, but it does and its not bad if you have a friend pick it up and play for a moment.",
            "review_score": "1"
        },
        {
            "review_text": "If you like games like Street Fighter, King Of Fighters or other 2D- fighting games, check this one out. There is some issues with full screen, but use Borderlessgaming software if necessary. Worth the money :)",
            "review_score": "1"
        },
        {
            "review_text": "Excellent graphics and great animations but poor optimization and no online. I think there's a mod somewhere that you can use to play it online with your friends, but I'm not sure if it really works. Definitely not worth your time if you're looking for a tournament level game, but it's pretty fun as a casual fighter.  Wait for some bundle or a Steam sale.  PS: Lilith is waifu tier. PS2: You can see her panties.",
            "review_score": "1"
        },
        {
            "review_text": "Lolis, fanservice, pvp. What else do you need?",
            "review_score": "1"
        },
        {
            "review_text": "I've no idea what I'm doing. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it's pretty good, but not as good as Cory in the House for Nintendo DS",
            "review_score": "1"
        },
        {
            "review_text": "Its amazing,but you must play it with a controller. And yes this game is pretty hard for a person that is new to figting games.",
            "review_score": "1"
        },
        {
            "review_text": "Porn.",
            "review_score": "1"
        },
        {
            "review_text": "Waifu fighting game with lot of pantsu shots.",
            "review_score": "1"
        },
        {
            "review_text": "in this game I can beat up little girls without getting arrested like last time",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't recommend this to someone who's rather new to the 2D Fighting genre since the enemy AI is rather hard for beginners.. The final boss is also hard AF, with all the teleports and laser spams, you can't even get close to her.. I only managed to defeat her once in my 3 hours of playing this game.. (I got this game already before i bought it on Steam.) The controls itself is rather easy to understand, took me around 1 hour to actually be able to string my own combos.. Also somehow I had more fun playing this game than playing BlazBlue, even though BB is better made and bolsters more fighters, something just sucks me into this game.. Maybe it's because Lilith is literally Minase Iori from the iDOLM@STER? Nyeh, maybe, I'll get to it later.. All in all, IMO, this is a reaaallly well made game.. and considering that this used to be a doujin game, to have made it on Steam is, just wow.. Now, getting to the good and the bad parts of the game..  The Goods: &gt; Assist system? That's new.. &gt; Pantyshots, nyeeess~ &gt; Graphics are pretty neat. &gt; Lilith = Minase Iori from the iDOLM@STER (Doll? Check. Shiny Forehead? Check. Headbutt? Check.) &gt; Hard AI makes the game challenging, but frustrating at the same time.. &gt; I don't get people's review about this game not working with their gamepad. The game is very responsive to my gamepad, controls are smooth. &gt; Old styled graphics = Good framerate and smooth gameplay~  The Bads: &gt; No Online Multiplayer. &gt; No Training mode. (You can just do local VS mode though.) &gt; Pause screen didn't show combo list, I got around the wiki for the movelist. &gt; Unbalanced characters. (Lilith too OP, pls nerf.. So this is why they made her into a DLC..) &gt; AI too hard, pls nerf.. &gt; Too many DLCs, why not buy the original doujin version of the game? One disc, and it got everything except Hilda in it.. &gt; The story of the game is not so clear, unlike BB who mindfuks you with all the time paradox and yadda yadda, the story mode is....... Short on text? maybe.. Yes, I'm the kind of guy who puts the story over graphics..  But despite all the bad things about this game, I would still recommend it.. Why? Because this game is challenging AF.. The hard AI will make you rage, I'm sure, but once you get the hang of this game, there's the sense of accomplishment, and you would want to fully master all the characters in this game.. Also, this is a 2D Fighting game, featuring cute girls, lolis, an idol (oh wait, wrong game てへぺろ~ ) piledrivers, brainbusters, laser spams, and lots and lots of rage quits.. You have been warned......",
            "review_score": "1"
        },
        {
            "review_text": "Was having gamepad issues but my arcade stick worked fine. Game seems legit very footsie and ground base no air juggles and heavy mix ups. Has its grappler, projectile, and keep away characters you also have an assist character of your choice.",
            "review_score": "1"
        },
        {
            "review_text": "I'll be frank with anyone reading this. I didn't know what to really expect from this game since my stigma with fighting games on PC's is a lingering issue, though I come from a long LONG history about them: One Must Fall 2097 and FX Fighter come to mind. Now with that said... I know more and more fighting games are slowly making their way onto Steam, and that's awesome! Show your support with that trend and get this game.  Let's also just get some of this stuff out of the way: As you can see from the screenshots, yes... there's a bit of loli going around and scantily clad women--but come on, this is video games we're talking about and a fighting game of this degree needs no explanation or attempt in being subtle... because this is a damn good fighting game. Put the visuals to the side and let them appeal later on, and you'll be all the better for it.  This is a fighter I'm trying to wrap my head around because just in the first few minutes of it, I instantly fell in love with it. The animations are beautifully rendered, the sound design is astounding (we're talking late 80's, early 90's sounding arcade sound design here! Just listen to Luna's guns and you'll know exactly what I'm talking about!) and the combat is pretty on point. The drawback is that the game is very... PAINFULLY even, barebones.  There are two modes, Story and VS Mode--but no online mode. Story mode isn't exactly your typical 'Story Mode' from other fighting games which try and set up a story. This is more like a straight up Arcade Mode than anything as you hit up any of the characters and take them for a spin. It's a shame really that there is no online mode because I would definitely love to take up a match against someone else in this game!  The game also only has 10 characters, 15 in acuality, but 10 you can actually play as and 5 which are your support class characters. You can't switch to these support class characters, they are there solely for what they're supposed to be: support. Now as for the action in this game? If anyone remembers playing the ORIGINAL Guilty Gear on the Playstation, you've got a pretty good idea what this game feels like. If you haven't, I'll say that this game offers a unique feel and spin on the typical fighting game repetoire. Each character feels unique and play VERY differently from one another, and you'll most likely gravitate to one character that suits your play style or how comfortably you smash around on the controller.  The game isn't without flaws however... given the very bare bones aspect of the game, there are points where the AI will always have the advantage over you and juggle you around. And in a way that might add to the challenge of getting used to the game's fighting system but other people may find that disagreeable.  Still, for what the game has, it does everything very well and looks extremely good doing it. It has some disadvantaging quirks but I wholly support more fighting games coming onto PC and to see the company behind this particular title to push something bigger and better down the way for me to pick up, because I'm already a fan of this awesome little game with big potential!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun 2D fighter, well worth the $5. I suggest using a controller instead of the keyboard though.",
            "review_score": "1"
        },
        {
            "review_text": "great game for what it is, i just wish there would be an update to fully support fightsticks and controllers and such.... also online would be really nice, also would be great for more characters and such..  anyway its a really good game just wish there was more to it.",
            "review_score": "1"
        },
        {
            "review_text": "i ♥♥♥♥ing hate this game but i can't stop playing it 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Like two harlots on a bender in Atlantic City looking to pull a trick or two, to feed a habit that long since has been out of control.",
            "review_score": "1"
        },
        {
            "review_text": "g-SCORE: [2.2]  This is the only fighting game I own... and I'm keeping it!  g-Rating Categories:   &gt;&gt;gameplay [3]  I don't play any fighting games so it's impossible for me to say if the combos were 'good' or 'bad,' but, to me, all was very fluid, intuitive and fun. Basically all of the characters use the same button combinations, which made it easy for me to get in and play any character. Each does have her own style though, so fight accordingly.  &gt;&gt;graphics [3]  Excellent, and I mean excellent art style. Loved the animations, and each of the girls'... ahem... looks ^^.  &gt;&gt;gui [1]  Pretty rough in terms of knowing which buttons do what when navigating the menus. Character selection was fine, but other than that I couldn't find save, or even an exit option.   &gt;&gt;glitches [3]  All good here. Solid.  &gt;&gt;gasp [1]  The story sucks, but meh. I wasn't expecting much. At least they tried to give it a backdrop, and each of the characters has their own motive and some relationship with one of the other fighters. This area is the game's weakest link.   Best possible score is a [3.2].",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE IT. MY BONE BREAKING GRAPPLER SATAN LOLI TRUMPS AAAAAAAAALLLLLLLLLLLLLLLLLLL.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 senpais recommend Vanguard Princess for your daily dose of desu",
            "review_score": "1"
        },
        {
            "review_text": "Fighting, shmiting, the important thing is it has cards! Lots of sweet anime cards which are in demand on the market!",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice little game to pass the time, though it's best played with a controller. I would suggest it , but I don't feel that it's great enough to be worth the full $5. If you feel it is, go buy it, if not, wait for a sale.  The size of the game is pretty small when compared to some of the other games I spend most of my time on, and it's a nice little time-waster while I wait for my other games to download.  I'm not entirely familiar of what makes a good/bad fighting game, though I did find the movements quite fluid. As a 2V2 fighting game, I feel that this was a decent buy for me.  Final Verdict: Good game, 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Get the pantyshots DLC!",
            "review_score": "1"
        },
        {
            "review_text": "Apparently this game offends many people, which means it's great.  Would play again. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE SO MUCH THIS GAME &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This game has its flaws, many of them. Aside from that though, I picked it up for $3 roughly. Matches are fun [hard to master the skills]. Story is almost non-existent but their little one-liner's had me laughing out loud. Beautiful cast of girls with hilarious premise. Cheap. If you play fighting games with your friends, pick this up if only for the laughs you will get.",
            "review_score": "1"
        },
        {
            "review_text": "Being fan of fighting games since 1991 I can't recomend this one. Great graphics, smooth animation. Decent enough combat mechanics. Also there is neat story to discover. Of course, roster could be bigger. Also I would like to play with some dudes instead of only women. To top it all of price is sweet",
            "review_score": "1"
        },
        {
            "review_text": "More fun than i thought it would be, could use a dpad function for the gamepad though",
            "review_score": "1"
        },
        {
            "review_text": "the only people who like this game are stupid weebs who haven't touched an actual fighting game",
            "review_score": "1"
        },
        {
            "review_text": "LOLI, OPPAI, PANTSU and more!",
            "review_score": "1"
        },
        {
            "review_text": "Game has good art, good animation. decent character roster,some pretty decent tracks, and a very interesting 2 on 2 fighting system.  The downsides to the game are it only has 2 game modes. First one is story, which plays like every other fighting games arcade mode. Other game mode is versus which lets you play against another person locally (meaning same computer). I wouldn't mind this limitation too much, however, the game has a learning curve and not having a training/practice mode to experiment and try out some combos potentionally hurts ANY fighting game.   More things wrong with the game is the highest res is something like 640x480. Can be window or fullscreen, however, when you go fullscreen, the menu bar blocks the health bars.  Aside from the complaints I have for the game, it's a decent buy for $4",
            "review_score": "1"
        },
        {
            "review_text": "Loli + Oppai + Pantsu and many more. SO MUCH WIN .   Replay factor: 8 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Little did you know this is actually the best game on steam.",
            "review_score": "1"
        },
        {
            "review_text": "I always wanted to pay for this game, and now i can! this fighter is worth it if you have someone to play with locally as it doesn't offer much outside of Vs and Arcade/Story. What really brings me into this game are the visuals, they're sometimes stunning and i forget its all pixel art. There are a lot of all girl fighters out there, this is one of the better ones to me, it has interesting designs that stand out from similar games. Gameplay wise, It takes a lot from Street Fighter, and this is a good thing, it at feels responsive. Again the a draw back here is the lack of game modes, but hopefully things will be added in the future.",
            "review_score": "1"
        },
        {
            "review_text": "This game is no mere fighting game. It is a dangerous journey of self-discovery, but an important one. It is a ticket to ride to a far-off land. A strange, bizarre, sometimes even frightening place. A place where two-dimensional beings walk the land. A place full of peculiar hair style decisions, bright colors and the sex fantasies of reclusive Japanese animators and artists. A place containing not just vanguard princesses, but bubblegum crises, robots that drill through universes, homoerotic vampires being pursued by muscular men with magic demons, dandy guys in space, little girls running item shops, the most convoluted fighting game storyline ever written, women who interact through games of Match 3 and Hyperdimension Neptunia.  Ready yourself as you step into this world, for I cannot promise you will come out the same person you are today, if you ever emerge at all. You may find yourself becoming unnaturally attached to one of the many denizens, claiming a so-called waifu, or a husbando, or some bizarre mix of both, and collecting frivolous merchandise to line the walls of your personal cavern of kawaii. As you descend into this world, you may find yourself growing distant from those around you, only being able to form a connection with those who have entered into the breach with you. However, should you accept these consequences, then it is time to enter the world of anime.  Be wary, my friend. Not all kawaii desus are as moe as they may first seem.",
            "review_score": "1"
        },
        {
            "review_text": "its just there and yeah just BOOM",
            "review_score": "1"
        },
        {
            "review_text": "inb4 insecure ♥♥♥♥♥♥s blast the game because it makes them feel like a pedophile when it's just your average Jap fighter. Also why did you buy the game if you took 2 seconds to look at it at the store page? Clearly any idiot can immediately see what kind of game this is just from one drawing alone.  Oh well back to fapping",
            "review_score": "1"
        },
        {
            "review_text": "A pretty Good J-Fighting Arcade Title for the PC. It's better to pay for this game than to take any risks. Normally, I prefer the Classic Arcade Mode over the Story Mode in each New Arcade Game so I enjoy them the way it was MENT to be played as if it was the Japanese Cabinet Version.",
            "review_score": "1"
        },
        {
            "review_text": "Vanguard Princess is fast paced, the controls are responsive, attacks are wild and flashy, and the animation is really well done. I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game so far, bought DLC as well. Even on Easy, the Story mode bots put up a SERIOUS fight toward the later end of the story. Favorite character: Natalia.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous artwork. Catchy music. The mechanics and gameplay is easy to pickup for fighting game newbies like me.",
            "review_score": "1"
        },
        {
            "review_text": "It took me a while to realize the bugs that plagued this game. Originally, a freeware game, this game remained very similar to the freeware version. First off, there is a compatibility issue with Windows 8. Any system with Windows 8 or newer cannot launch the game in full screen mode without the resolution messing up. Adjusting the settings and Windows compatibility mode does not resolve the problem.  In addition, the story for this game has no plot devices. Compared to other 2D fighters, it failed in all aspects. With a cluttered UI, unorganized story mode, and confusing versus mode, the game is a disaster. The only appeal it has is the girls and the 'kawaii' theme. However, this appeal is also lacking too. Until Vanguard Princess gets a major overhaul, steer clear of this game.  Rating: 0.5/10 (5%) No Achievements Game Done.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I was promised a fighting game with anime girls. What I got was a disater. A badly coded, unpleasant, repetetive, useless game. No tutorial or practice mode whatsoever makes it hard to understand, what is going on, or even possible. (I played Skullgirls, in any way better, buy that one). The lack of options, rebinding keys, or even resolution change is inacceptible. This game would have been 'ok' in 1994. But not today, or anywhen within the last 15 years. Do not buy!!",
            "review_score": "-1"
        },
        {
            "review_text": "My friend bought me this, he also bought me bad rats. Take this as you will.",
            "review_score": "-1"
        },
        {
            "review_text": "This game looked pretty great at first, but to be honest it's a catostrophe. This game has beautiful graphics, but the overall design and execution is terrible. The controller support is very badly made. The controls for keyboard are very badly designed (TFGH wtf?), and on top of all this there is no obvious back or exit button; Instead you have to clse the entire game. The story is about a girl who somehow miraculously survived an airplane crash and then somehow grew up to become a 'beautiful woman,' with no explantion on how she got out of the terrible situation she was in. She then gains magic powers and the government now wants to exploit these powers. This game could have been really fun and enjoyable if it weren't for the many flaws it has in its design and story.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start by saying that if you are into fighting games and cute anime girls this will likely be up your alley and this is a well done in terms of a fighting game (so long as you know what you are doing.)  That being said this is why I would not recommend this as of right now (I am hoping some patches will come down the line that will allow these issues to be fixed)   *First off, the game will literally have only two options if you are not checking the window options (This can be bad seeing that it has a full screen though you will not likely use this and I'll explain why later) Those being arcade and VS. IF you accidently choose arcade there is no back button. You WILL have to choose a character start it up then restart the game or restart it by closing it and re-opening it. There is an opening cut scene and it does respond to every input so mashing the controlls to either reset or skip the intro is like saying yes if it gets to the choosing screen. (ALMOST EVERY BUTTON IS LIKE CHOOSING YES). If you are wanting to train however, you will likely be having to look up a guide because there is no quick way to get to it and you will have to be using a second player remote regardless. Also if you want to change anything because even if you do activate practice mode, it will have a timer for some ungodly reason.. You will have to go up to tab on the window to fix the timer. Also prior to going into a VS match (the only way you can get practice mode) You will not see your characters move sheet and nor will you see it going into the game. You will literally have to either write it down or have another window open to try and deal with this. (Sorry if that comes off as lazy but I havn't dealt with this kind of stuff in a game I paid for since the super nintendo era...)  *Second off the game does say it has full controller support. This is half true, if you are like me you may be using a xbox 360 wireless controller to try and play this. First off the remote will work, however you better be good with your d-pad otherwise you will likely have to find a program to fix this issue (there is a guide recommending a program that will cost $9.99 unless you plan on getting it another way) Also if you have a second xbox 360 controller... TOO BAD! The second controller won't. For some reason the game always picks it up as the second. This might be due to my Nostromo pad but if I leave that unplugged while starting up the game it will cause the xbox remote not work at all.(Second controller thing might just be me but the fact I am dealing with this means that certain drivers will ruin the game. I have many other games that do not like nostromo but usually unplugging it fixes it. This one doesn't like it at all.)  *Third the game will easily begin breaking and or crashing under any stress. This means if you plan on checking out the costumes or want to skip cutscenes you will quickly learn not to. Also if you try to place it in full window mode it will begin to flicker (at least with me this does) And it's not something that is fun for the eyes. It's fine if this was in beta but.. it looks like this has been released for a few months with dlc.   I would much rather prefer to recommend this than to give it a bad review but... well the game needs so much needed love and I'll just leave it at that.   ",
            "review_score": "-1"
        },
        {
            "review_text": "My puberty was way too long ago to recommend this horrible game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really cannot tell anything more, except the game is not responding to my keyboard or mouse clicks, only thing I can do is press ESC button twice to skip brand names who created this... ahm game. Anyway then Intro starts and BAAAAAM, I been forced to watch that 2 mins long intro for 5 times as I were trying to press any button after, as it told me so... Unfortunatelly... Duck my life.   Ugh, also it doesn't have fullscreen and when you force the game to be in fullscreen via windows options it goes ugly.   Not going to recommend this to users who have Windows 8.1, haven't tried this on other Windows versions aaand thanks for the 5 cards, they mean to me more than this game ever going to mean.",
            "review_score": "-1"
        },
        {
            "review_text": "Been playing this game a while (since before it was localized) and after putting enough time in it you just learn that its not a very good game. Multiplayer and practice mode are deeply hidden in the game, alternate costumes follow the Marvel style guess what button gets you what costume, and combos 100% rely on juggling an opponent in the corner. There is no proper way to handle zoning since the invicibility frames on a parry are stupidly easy to punish and parrying serves little purpose since all it does it open your opponent up for an attack with extremely low frame startups, which you can't follow up with due to the poor combo system.  Just stick to KOF/Blazbad if you like 2D anime fighters and stick to USFIV and DOA if you like 3D fighters.  fap+uninstall/10",
            "review_score": "-1"
        },
        {
            "review_text": "Vangard Princess is a decent fighter lacking standard functionality. All the options which there is very little of can be changed using the menu bar. If you are playing in full screen, you have to switch to between display modes. Even the full screen mode does not work properly as it only display in a larger window. Controller support is functional but lacks digital pad support.  There are only two modes for Vanguard Princess, Story and Versus...that's it. There is no proper training mode, challenges or online play. The game only offer the bare minimum. I can only recommend to those who plan to play local. Other players are better off with something like Skullgirls.  Vargaurd Princess is a freeware game in Japan and it is very evident. Considering the game is being sold outside Japan, I would expect more polish. It is a shame because Varguard Princess is a good fighter but it lacks the standard functionality a paid product should have. I cannot really give it a recommendation without an exception which is reserved for the local play. For everyone else, there are better fighters to choose from even if you have to risk the higher price.   Just because a free game is an import does not automatically warrant a price on it but that is clearly what happened with Vangaurd Princess. The developer seized the opportunity to gain profit by lazily releasing a freeware game. If want to know how to transfer a freeware title to a full paid product, just look at Cave Story which not only added new modes but also had an overhaul in graphics and sound. Vanguard Princess has no additions to warrant a price it.",
            "review_score": "-1"
        },
        {
            "review_text": "There were some things that stood out to me immediately upon playing this game, and while the artwork is great, and the girls are unbelievably cute, that's no excuse for some of the most important features this game is missing, ESPECIALLY since they're basic fighting game features.  One of the first things I like to do in a fighting game is hit up training mode, which this game lacks, to familiarize myself with the controls, which by default, are incredibly awkward, even if you use an Xbox 360 controller, like myself. It makes it somewhat annoying to have to go into the arcade mode or the non-existant versus mode to be able to get familiar with a character and how she works (Multiplayer seems to be local only, which in this day and age, is a big no-no for any fighting game). The controls can be customized, of course, so the awkward controls can be fixed, but the interface for it could stand to be adjusted so you can tell what button is being mapped to where.  This game also lacks the Steam interface, so people can't really take screenshots and show them to friends, but if anyone wants to see what the game looks like, the store page does a fine job of that.  So one of the bigger deal breakers for me with this game was the obvious lack of online multiplayer. I'm not someone who enjoys playing VS the AI over and over, and I certainly don't play them for the 'deep' story, multiplayer is always the main selling point for me in a fighting game, because for me that is where the fun is at. I believe you CAN play this game in multiplayer, but you have to work for it, which just doesn't seem worth it to me with how many steps are involved, and the fact that this game would have no servers should you go through with it.  That said, the game is fairly pretty to look at, the girls are very cute, and the movesets are pretty interesting and fun. The game has an assist system, which is a bit reminiscent of Marvel vs Capcom 1, only your assist doesn't run out. It has nice voice acting, and some nice stages, and the artwork is great so it has that going for it.  Personally for $5 (lower during sales, of course), it's certainly not a bad deal if you don't mind just playing through story mode and ogling pretty girls, but I just can't recommend this without a proper training mode or online multiplayer. It certainly does have some huge potential to be a great fighting game, however.",
            "review_score": "-1"
        },
        {
            "review_text": "'Additional Notes: 4-button game controller (Optional)' I don't have a controller. It's not even funny. I went through hell trying to complete the game on the easiest difficulty.  The in-game help was completely useless. If you input the exact combination that they tell you to, it doesn't work. Simple as that. I spent a considerable amount of my overall playtime just figuring out how to get the combos to work. BEST OF ALL, the combinations are only shown at the character select screen. Nice UX design. After searching through forums and wikis I figured that a handful of the inputs were probably impossible with my keyboard.  I especially love the boss fight. What I like to do is stand at the far left of the screen and watch my character get barraged with explosion after laser beam after assist after another assist after another assist followed by more laser beams and explosions, rinse and repeat. Until I die. Again and again. The more I actually tried defeating hilda rize, the more keys on my keyboard started flying out. I obviously stopped playing after this... only to try the entire 7 or 8 levels of arcade mode again with another character to find a similar result.  It's like they weren't even trying to make this game PC optimised and user friendly. The keyboard support from what I experienced was basically non-existent. Sure, I can discover some spammable sure win moves to get through the first 6 or so stages, but that hilda rize isn't going anywhere. What is this, a Gameboy Advance game?  &gt; 'Not user friendly' Haha there is no back button Tutorial only shown at character select screen Where is my steam overlay Cannot quit arcade mode without closing the window  Overall what I can say is that I got tricked into buying this solely by the visuals and the thought of 'Oh, I haven't played a fighting game in a while!' Following this nightmarish experience, I'm just going to steer clear from fighting games for a long time now.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game. Pretty cool soundtrack though. Whatsup with the final boss?",
            "review_score": "-1"
        },
        {
            "review_text": "Who the hell makes a game without fullscreen?",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ menus, only windowed, 2 modes, cluster♥♥♥♥ battles with characters everywhere (background, support characters always on screen), ...",
            "review_score": "-1"
        },
        {
            "review_text": "It's just not very good.  The basics are fine, but the polish isn't there. Many characters' movesets aren't fully defined, input errors are easy and frustrating to make, and hitboxes feel wonky. There's a lack of well-defined controls so you just have to 'wing it' often. The assist option is unimpressive and feels forced to add something different beyond very simple movesets and no intricate neutral game. Even the story is bad, and we're talking about *fighting game stories* to compare.  That's mechanics. Now let's talk interface. Sweet lord, the interface. If you don't play this in windowed mode, may the powers that be grant you mercy. Lazy input lag added to the feeling that this was rushed out half-baked. I've played emulated games more responsive. No excuses for it being a one-man dev team -- ZUN has been running Touhou for years as a solo artist, and his games function perfectly fine (even if they were programmed drunk).  Oh, and the only point of the DLC is to add panty shots. No revamped movesets or frame data updates, no adjustments to user feedback. Just panty shots. I'm glad the dev knows what's important in his game.  I got it free in a Humble Bundle, so I thankfully didn't throw a bunch of money at it. Go play anything else. Like Skullgirls when it's on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "While the characters are pretty well designed, the combat isn't great.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this from GMG for $2 and still feel like I wasted money. Despite the lovely sprite work and creative characters, this has some of the worst fighting I've ever had the displeasure of experiencing. It feels unwieldy at best, the screen is a cluttered mess, and the game lacks any real options or true practice mode. To call it 'bare bones' would be too generous. I'll stick with Skullgirls and KoF, thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot in good conscience recommend this game to even my worst enemy. I'm sorry, but this is perhaps the worst 2d fighter I've ever played, and that's really diappointing. I really wanted this game to be good, I even got all the dlc so I could play it entirely from the start. But don't follow my footsteps. There are problems in every aspect of this game.  There is no way to adjust or mute the sound. The plot and dialogue are mediocre at best, a generic plot with a dues ex machina that only really differs in one dialgue and the very ending.  If you go into vs against a standstill enemy, and master the moves, then SOME of the following can be bypassed. But not much.   Gameplay: The gameplay can be broken down into three things. The AI, balance, and controls. All three are completely broken in this game. The AI will spam attacks constantly, and with the final boss this means no way to get in close to her. They each spam their specials and support, all of which have some way of being unstoppable. For example: There is a character who can deal 35% of your max health in one hit that has the range of the entire screen. There is another whose specials are all grabs that cannot be stopped mid-grab. The final boss' attacks are all at range, with the closest being just further than the melee-only character's heavy attack. The support lolis will stun you just long enough for the spamming AI to get a hit and stunlock you. This creates a fight that REQUIRES you to either button mash or spam your own move, both of which will fail unless you also get very lucky. There is no balance whatsoever. As I stated above, there is a character with a max range attack that deals 35% of full health per hit, and has to be ducked to dodge. The final boss has the exact same attack, and so many attacks that can hit you no matter where you are that she can combo you in three hits to kill you right when the match starts. That character's AI will spam it quite often, locking you in place. The grab character will complete the grab whether you attack her halfway through or not. Any attack hitting her will just trigger it. The final boss will spam ranged attacks and her support to the point where even standing up is near impossible.  The following is what can be bypassed by vs mode. The controls are the ultimate sin of this game's gameplay. The AI and unbalance could be bypassed if it were actually possible to play well. But the controls are set so that you have a light, middle, and heavy attack buttons, as well as a parry button and a support button. There is also a button that is literally set as the 'no action' button. Meaning yes, there is a button that's sole purpose is to do nothing. This would be fine, except that hitting combinations of the light and middle attack buttons will trigger the parry, despite there being a button specifically for that. Given how difficult it is to avoid the AI's broken attacks long enough to actually attack, making a really easy mistake and wasting an opening with a parry will lose you the match very easily. Add to that how the controls for super moves and specials don't read quite right (though this could admittedly be my keyboard's fault) and the result is a necessity for spamming a single special move just to stand a chance of surviving.  The control explanations are useless, as they call the buttons A, B, C, and X, yet when setting controls it doesn't say which each button equates to. It simply tells you what the button does, but not if it's meant to serve as A, B, C, X, or anything else. In other words, using any special whatsoever requires a lot of trial and error just to figure out, and in the middle of being stunlocked by the AI, that's very difficult.   In the end, you'll end up finding a special for each character and just learning the timing for each character's standing up so you can spam it without them being able to get you into a stunlock yourself.  Hopefully this game will get a major overhaul and balancing, but unless it does, don't buy it unless it's on a really good sale. I really hate giving negative reviews to anything, but this game needed one. I'm sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "Why the ♥♥♥♥ would I want a fighting game that doesn't support arcade sticks.",
            "review_score": "-1"
        },
        {
            "review_text": "Why is it that the graphics on the store look so much better than the real in game graphics? This isnt a real question, this is my whole review. Why?",
            "review_score": "-1"
        },
        {
            "review_text": "It's poorly made and theirs not much going for it. It's the same old run-of-the-mill fighting game.  Despite the great animated sprites and vibrant colors, it's not too good.  This one is kinda rough, the controls are not what you think they are, their pretty bad.  Next game please..",
            "review_score": "-1"
        },
        {
            "review_text": "'A boring game with technical issues; pass.' 3/10  This game would be decent if it weren't such a horrible piece of trash. Which is a shame, because I could actually see myself enjoying 'Vanguard Princess' if it weren't for so many technical issues. For starters, the game says that it has 'full controller support' but when plugging in a 'Microsoft Xbox 360' controller, arguably the most popular controller used on PCs today, it doesn't read the left stick correctly, and it results in the cursor constantly strafing to the right, making the game unplayable. Strike one.  Also, when putting this game into full screen resolution, the colors become incredibly distorted, forcing you to run the game in a much smaller window. Who the hell wants to do that? 'I didn't buy this nice big screen just to run games in windowed mode' is what I imagine many people have said out loud as a result of purchasing this game. It seems to me as if the makers of this video game aren't too good at making video games after-all. Pity, with so few fighting games on Steam, and this game having some similarities to one of my favorite fighting games of all time 'Marvel Vs Capcom 2', 'Vanguard Princess' is just a big let-down. Strike two.  So finally, sick of messing around with the controller and trying to get it to work, I shut off the support, and mapped the keys using 'xPadder'. It works! Hooray! And...this game is pretty boring. The characters are all women, something I don't particularly enjoy, the combat isn't terrible, but grows old very quickly, there is no tutorial, there are limited attacks, the game is just bad. It's a shame I put so much effort, a few minutes, into trying to get this thing to run properly. Oh well, at least I got it for free. Which is more than I can say for some of you out there. Just know that whatever you do, for the love of god, don't get this game. Strike three, yer out!",
            "review_score": "-1"
        },
        {
            "review_text": "this game is rather poor, the controls are kinda wonky and the combos hard to follow thorugh with.",
            "review_score": "-1"
        },
        {
            "review_text": "If it would actually run properly I would probably give it a positive review.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice doujin fighter, but the lack of modes, options and controls make it a hard game to recommend. It def looks and feels professional enough at first glance, a little more bells and whistles as well as more modes would make this a great addition to a game library. as far as it stands now, it's Hardcore fighting fans who need everything only.",
            "review_score": "-1"
        },
        {
            "review_text": "Online multiplayer, training, and tutorial mode as well as support to all existing controllers and fightsticks please. I just discovered that my HORI Fighting Stick V3 barely works with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "If it would actually run properly I would probably give it a positive review.",
            "review_score": "-1"
        },
        {
            "review_text": "It's Waifu Shaq Fu, a free ware game with some minor bug fixes with a $5 price tag slapped onto it.",
            "review_score": "-1"
        },
        {
            "review_text": "Start of the Game, Not Bad 1. Garret is a Duchebag 2. At Chapter 7 i Lost my saved game due to a Bug 3. When i grabbed a body to hide it in a corner i glitched the wall and died. 4.Story Starts well  End of the Game, Very Bad 1. Garret is still a DucheBag 2. What is the point on having so much stuff to level up if you can only level up half by the time you end the game! 3. This is just a catch items simulator (Sadly) 4. The end of the Story sucks Hard 5. Garret is a Duchebag",
            "review_score": "-1"
        },
        {
            "review_text": "I was promised scantily clothed anime girls who would fight and those fights may or may not break into acts of the sexual kind. Insted i got clunky controlls, weird graphics, and no sex scenes.  4/10 -3 for no sexy scenes =1/10",
            "review_score": "-1"
        },
        {
            "review_text": "It's a shame that there is no middle choice between thumbs up and down, because this game in my opinion is stuck right in the middle. The presentation looks wonderful! The graphics look gorgeous in my opinion and the controls are responsive.  That was the good part. Now to the things that weren't so great.  I should mention, this game used to be a japanese freeware title and from what I've heard, the only diffrence is the english translation of the game. That's the only change apparently and I highly believe that because aside from the good graphics, the game is barebone when it comes to options or rather there are no options at all. You only have a Story and VS-mode. There are no actual options for the game and in order to get to the training-mode, you have to pull off some really annoying stuff which requires you to have two gamepads connected to your PC. Why is that a thing?!  The game really comes of as a product that is suppose to be free, but you paid money for it regardless. Despite the decent graphics, the developer made no effort to justify the price tag. The english translation is no justification at all, because the game is so basic with it's menu and controls, you would easily understand everything despite the japanese language.  In my opinion. If there really isn't any change to the freeware version aside the translation. Then search for that one instead and waste your money on something that has something to offer.",
            "review_score": "-1"
        },
        {
            "review_text": "Dear creators - please go back to MUGEN while I'll go back to Skullgirls that did a similar game with style. Controls are limited and sticky. AI is horribly paced. At least I bought it on sale and the character graphics aren't that bad.",
            "review_score": "-1"
        },
        {
            "review_text": "not bad for thoose like arcade game but lack of chara development and menu still lack of option for now not recommended",
            "review_score": "-1"
        },
        {
            "review_text": "All I wanted was to see the pretty pixel art but the UI and controls suck so much I didn't finish arcade mode with the yoko ripoff rip",
            "review_score": "-1"
        },
        {
            "review_text": "Simplistic. Lacking depth in gameplay, combos, and story. About what you would expect from four dollars, but still disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible Tutorial. Hard to tell what's happening on screen.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is incredibly misleading. Advertises as a 2 on 2 fighting game, and steam claims 'Local Co-op'. This is all lies. You cannot play alongside a friend, only play AGAINST a local player. The 'second member' of your fighting team is a support character who seems to do very little for you.  Character designs are generic, resolution is very small, controls are badly set up by default, interfaces are shoddy and irritating to navigate. The only nice thing I can say, is the visuals/animations are pretty.  Overall, TERRIBLE game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is straight up garbage. Like, just on a technical level, it's missing so many features and does so many things wrong. First off, you can't use the d-pad. AT ALL. You're forced to use the analog stick. And anyone who plays 2D fighters can tell you that the analog stick is the WORST possible control method to use. Even worse than the 360 pad's subpar d-pad. There's no option to change resolution, there's no modes outside of Story and VS, it's just such a barebones, lazy game from a technical standpoint (it actually makes it all the worse that the character sprites are so well animated when the rest of the game is awful) that it's no wonder they're only charging five bucks for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Such a waste of time!",
            "review_score": "-1"
        },
        {
            "review_text": "I only write reviews for games that I have finished, and tried different modes of the game. So despite the fact that I haven't actually spent too much time on this one, I've beat the game a few times, and I have also tried playing local versus game with a friend. Let's just say that I don't thumbs up or down a game with 0.1 hour into the game.  I find that there is just too many problems with this game. First of all, the game only run in 640x480. I don't mind it all that much, but this game seems to have decent animation, just seems like a waste that you can only play in such low res. And one of the biggest issue I have with this game is the navigation of the menu. It is so broken. Once you select the characters, you go to the next screen to choose difficulty mode; and you can't go back to the previous character screen once you are at that screen. That is not that big of a problem, but the thing I hate most is that I personally haven't found a way to properly exit the game. When you pause the game, the screen says that I have to press Start + A + B + X + Y to exit...Seriously, can't they just make it like any other game where you can just press start, and a menu comes out for you to exit the game. And not only that, the problem is that it won't work all the time. I'm using a Xbox controller, there shouldn't be that much compatibility issue. So at least for me, I always have to alt-tab, and close the program from my desktop to exit this game.  Now about the actual gameplay. I've played many 2D and 3D fighting games before. I won't say I'm a fighting game master or anything, but I just have to say there is nothing too special about this one, other than the fact that you have a 'sidekick' to assist you. The only thing I like a bit about this game is that getting to the boss doesn't seem to require too much time. It's only 6 stages, then one boss stage. I have easily beaten this game on normal difficulty without continuing, that's thanks to one of the character's overpowered moves that I was abusing.  Even back in the 90s, when a developer/publisher port an arcade fighting game to the console, they always pack with many different game modes in the game, for example, things like gallery mode(movie, still pics or sound clips). Well, not that I really care about that kind of stuff, but you can see that the developer/publisher created those to encourage you to replay the game more, and unlock different stuff in different game modes. (And don't forget, fighting game is all about replay value). Now I understand this is a low budget and cheap retail game, but I just hope that maybe adding a training mode...or even just an option menu would be nice.  To sum it up, broken menu navigation, barebone game with no extra, somewhat unbalanced characters, low res graphics...and the list goes on. I just don't see any replayability for this game, so I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "FRANK YOU PIECE OF ♥♥♥♥ WHY?",
            "review_score": "-1"
        },
        {
            "review_text": "I was more amused by the 'clever' /v/tarded reviews than I was amused by the game.  Also, I do not find the /v/tard reviews amusing.",
            "review_score": "-1"
        },
        {
            "review_text": "It's ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "A fighting game, but the issue I have is that it's a fighting game of skill and not button-bashing. You need to memorise the moves as you fight against a computer who is completely unrelenting in it's offensive stategy.   The animation is very well done with many cute female leads with a somewhat more unique anime opening. However in many ways it seems this game is geared towards a certain audience too. It can be fun with you master the controls, but I was only able to make them work with the controller.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is ♥♥♥♥ing stupid",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty cool if you're into the sexualization of young girls.",
            "review_score": "-1"
        }
    ]
}