{
    "app_id": 262120,
    "name": "Toy Soldiers: Complete",
    "release_date": "2016-02-17",
    "developer": [
        "Signal Studios",
        "Krome Studios"
    ],
    "publisher": [
        "Signal Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Action",
        "Strategy"
    ],
    "achievements": 32,
    "positive_ratings": 505,
    "negative_ratings": 164,
    "price": 10.99,
    "description": "Command your Toy Soldiers in multiplayer or co-op with Toy Soldiers: Complete! Bring your toys to life in this action-packed, strategy-based game bundle with the original Toy Soldiers, Toy Soldiers: Cold War, and its DLC’S – Kaiser’s Battle, Invasion, Napalm and Evil Empire.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262120/header.jpg?t=1455739267",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Intel Core 2 Duo 2.0 GHz or AMD Athlon 64 X2 2.0 GHz Memory: 2 GB RAM Graphics: nVidia GeForce 8800 GT 512 MB or AMD HD 4830 512 MB DirectX: Version 9.0c Storage: 12 GB available space Sound Card: DirectX 9.0 Compliant Sound Card Additional Notes: 3GB Memory required for Windows Vista, Windows 7 and Windows 8.",
    "recommended_requirements": "OS: Windows 7 SP1 Processor: Intel Core i3 3.5 GHz or AMD A4-Series 3.4 GHz Memory: 4 GB RAM Graphics: nVidia GeForce 8800 GT 1GB or AMD HD 4830 1GB DirectX: Version 9.0c Network: Broadband Internet connection Storage: 12 MB available space Sound Card: DirectX 9.0 Compliant Sound Card Additional Notes: 4GB Memory recommended for Windows Vista, Windows 7 and Windows 8.",
    "reviews": [
        {
            "review_text": "Toy Soldiers was a fun game on the Xbox 360 with me killing thousands of toys to march towards victory! A few year went by with TS: Cold War being released but for the most part I had moved on from the 100+ hours of thee original TS. Then I saw TS: complete on steam. Those nosatalgic memories flooded back seeing TS on PC! So I bought the game (and yes I knew it was Early access) and began to see some problems. First of all the game is locked to 30 FPS which isn't a big deal to me so I looked past it. But when playing I saw that the game wasn't very optimised for mouse and keyboard. The key layouts were weird to say the least but again it wasn't a big deal to me. So I complete Cold war, now I move on to my WW I toy chest...   Wait what... What in the hell did they do??? ARE YOU KIDDING ME!!! THEY F***** UP TS 1... HOOOOOW? I mean like... Well like... AAAAHHH!!!  (3 minutes of freaking out later)  Ok, now that I'm a litte bit more calm let me tell you what they did... They copied over the units and the engine of Cold War... Like no joke, let me give you an example... In cold war you could get a 'special' ability for killing so many soldiers in a certain amout of time, those ablities could be nukes, lasers, AC 130's ect... So in TS 1 I got a 'special' ability, and guess what it was... A MOTHER F***** ORBITAL LASER... IN WW I NON THE LESS... *facepalm*... And thats not it, like i said units (being turrets) changed form what was originally in TS 1... When I looked at the game it wasn't the same game I played for so many hours... It saddens me to see how little the Devs care for the game, If you're a fan of this game from the 360... Don't buy this game, you'll only be disapointed... :(",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to be able to upvote this game, but I can't. The Cold War content all works fairly well, since I imagine it was more or less a direct port, but the WWI campaign is still a crapshoot. Occasional glitches and crashes. Bosses don't work right, they shoehorned the Cold War gameplay/turrets into it, but left the maps designed for use with the old turrets. They barely tried to make the new vehicle rules work with the old maps, and the old vehicles all work like ♥♥♥♥ in general now. And this is all nearly a year after official release. So, if you want to play the Cold War content only, this is fine. Unfortunately, if you are more for the WWI half, and were hoping to finally be able to play it co op on PC, don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Toy soilders is a tower defence game in which you try to stop the enemy waves from going into your toybox. Your soilders come from a machine gun nest all the way up to anti aircraft machines, each having their own specific enemys to kill. One feature that stands out the most is if that last wave wasnt so good, you can replay it or 5 waves ago an enemy went into your toybox and you want a 100% health at the end, you can replay it. Even if you own the first one, this is the game to own since it includes the first one with all its add ons",
            "review_score": "1"
        },
        {
            "review_text": "Can play vs in private match it keeps crashing on both ends",
            "review_score": "-1"
        },
        {
            "review_text": "you get toy soldiers 1 and toy soldiers cold war for cheap, a great deal if they fix the bugs",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game but quitting the game causes a black screen that can't be taken away unless I restart my PC so I had to refund it.",
            "review_score": "1"
        },
        {
            "review_text": "░░█▀░░░░░░░░░░░▀▀███████░░░░  ░░█▌░░░░░░░░░░░░░░░▀██████░░░  ░█▌░░░░░░░░░░░░░░░░███████▌░░  ░█░░░░░░░░░░░░░░░░░████████░░  ▐▌░░░░░░░░░░░░░░░░░▀██████▌░░  ░▌▄███▌░░░░▀████▄░░░░▀████▌░░  ▐▀▀▄█▄░▌░░░▄██▄▄▄▀░░░░████▄▄░  ▐░▀░░═▐░░░░░░══░░▀░░░░▐▀░▄▀▌▌  ▐░░░░░▌░░░░░░░░░░░░░░░▀░▀░░▌▌  ▐░░░▄▀░░░▀░▌░░░░░░░░░░░░▌█░▌▌  ░▌░░▀▀▄▄▀▀▄▌▌░░░░░░░░░░▐░▀▐▐░  ░▌░░▌░▄▄▄▄░░░▌░░░░░░░░▐░░▀▐░░  ░█░▐▄██████▄░▐░░░░░░░░█▀▄▄▀░░  ░▐░▌▌░░░░░░▀▀▄▐░░░░░░█▌░░░░░░  ░░█░░▄▀▀▀▀▄░▄═╝▄░░░▄▀░▌░░░░░░  ░░░▌▐░░░░░░▌░▀▀░░▄▀░░▐░░░░░░░  ░░░▀▄░░░░░░░░░▄▀▀░░░░█░░░░░░░  ░░░▄█▄▄▄▄▄▄▄▀▀░░░░░░░▌▌░░░░░░  ░░▄▀▌▀▌░░░░░░░░░░░░░▄▀▀▄░░░░░  ▄▀░░▌░▀▄░░░░░░░░░░▄▀░░▌░▀▄░░░  ░░░░▌█▄▄▀▄░░░░░░▄▀░░░░▌░░░▌▄▄  ░░░▄▐██████▄▄░▄▀░░▄▄▄▄▌░░░░▄░  ░░▄▌████████▄▄▄███████▌░░░░░▄  ░▄▀░██████████████████▌▀▄░░░░  ▀░░░█████▀▀░░░▀███████░░░▀▄░░  ░░░░▐█▀░░░▐░░░░░▀████▌░░░░▀▄░  ░░░░░░▌░░░▐░░░░▐░░▀▀█░░░░░░░▀  ░░░░░░▐░░░░▌░░░▐░░░░░▌░░░░░░░  ░╔╗║░╔═╗░═╦═░░░░░╔╗░░╔═╗░╦═╗░  ░║║║░║░║░░║░░░░░░╠╩╗░╠═╣░║░║░  ░║╚╝░╚═╝░░║░░░░░░╚═╝░║░║░╩═╝░",
            "review_score": "1"
        },
        {
            "review_text": "Toy Soldiers: Complete Garbage",
            "review_score": "-1"
        },
        {
            "review_text": "This is my first review so please muddle through it with we! :) I enjoy the game. I played the original Toy Soldiers on Xbox 360 as well as Cold War. I remember back in the day I was enchanted by the fun of the cartoony men and wind-em-up tanks. The little pop of a toy as I nailed it at 100 meters with my sniper tower. The tension of that one enemy troop nearly making it into my beloved toybox. I poured a lot of time into the 360 version. It was fun.   Now on my PC rig I have that same pleasure! The game is still fun. For me the biggest pro in favor of this game: the shear time pleasing experience. It is a basic tower defence with good character. The controls are fluid and easy to use(with a controller). The environment is somewhat destructible and generally nice to fly around. The base setup is well thought out and variously flavored.   However, this game does suffer from a few technical errors. The frame rate is generally good but can be susceptible to some drops. A few bugs here and there, but nothing to really turn me off to the game.    To round up, the game is fun. It has a nice feel even though it can be a bit buggy. So, if you can not stand a few bugs, this title is not for you. But, if you are looking for a good title that is a bunch of fun, certainly pick this one up on sale. Cheers!",
            "review_score": "1"
        }
    ]
}