{
    "app_id": 262260,
    "name": "Jets'n'Guns Gold",
    "release_date": "2014-02-05",
    "developer": [
        "Rake in Grass"
    ],
    "publisher": [
        "Rake in Grass"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Shoot 'Em Up",
        "Great Soundtrack",
        "Action"
    ],
    "achievements": 22,
    "positive_ratings": 969,
    "negative_ratings": 130,
    "price": 4.99,
    "description": "Jets'n'Guns is a heavy piece of ground shaking rock blasting action with graphics and special effects that will blow you eyes out! Enjoy yourself in almost-insane action adventure of saving the universe from the deadly threat of more than 270 unique monsters in the campaign of 43 levels.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262260/header.jpg?t=1478690297",
    "minimum_requirements": "OS: Win XP/7/8 Processor: 1GHz Memory: 1 GB RAM Graphics: OpenGL compatible Storage: 110 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is the hidden gem of arcade shooting games.  - Good level design - Many ships upgrade - Great soundtrack - Massive destruction",
            "review_score": "1"
        },
        {
            "review_text": "Ah yes... this game.  My dad originally bought this game once it came out on the Rake In Grass website awhile back.  Just have to say this game is literally THE best side scrolling shooter I've ever played ever, and once I saw it was on Steam, I bought it instantly.  The laughs and amazment are still here with this game and it's REDICULOUS gameplay and difficulty, amazing soundtrack, and AWESOME visuals.  Buy it, holy ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I love 2D sidescrollers,already had this game non steam,but i just love it so much i had to buy it again,just the music is enough to make this game badass and ofcourse the weapons,levels and ships are also very nice.",
            "review_score": "1"
        },
        {
            "review_text": "I'd forgotten how good this game is; I played it for hours back when it was first released. If you like side-scrolling shoot em ups, or just crazy shooting mayhem in general, you really can't go wrong with it. Fair warning, it's damn hard! Play on easy if you can't take the challenge, but normal is just enormous fun. When you die, you're back in the action within a couple of seconds, and you'll thank the devs for that because you'll die a lot. The gameplay is complete madness, everything is trying to kill you, and when you shoot down anything or blow up any ground installation, the guys manning it stream out or fall to their deaths, and you can smear them across your windscreen or riddle them with plasma as you wish. Sounds gory, and it is, but it's pretty mild cartoon violence unless red pixels horrify you. Before long (ie. 5 seconds onto the start of the level) there are bullets, bodies and pixel blood spots flying everywhere, explosions and crashing planes triggering more explosions, all set to a rockin' heavy metal / chip soundtrack that still sounds great. If that doesn't appeal to you, you should probably seek therapy! Gameplay wise, each level begins with a shop where you can buy, sell or upgrade your weapons and a selection of fun components that do everything from highlight wanted bounty hunters to earning you millions by streaming your exploits to a TV show (!). More mundane components do things like improve your hull or heat dissipation. The varied selection of weapons, bombs and ships is essential to understand if you want to progress in the game, particularly on the harder difficulties, because specific ship / weapon setups are much better than others at handling certain levels, the fun lies in trying different combos. Can't get past that bit on level 2? Go back to the shop and try another combination. I suppose the only downside is due to the age of the game it doesn't support multiple resolutions, although you can play it windowed at native res or full screen at whatever resolution you're using. Frankly it looks fine, the art holds up well, and once the chaos begins you'll hardly notice.  So yeah, it's just about the most fun you can have while scrolling to the right. Highly recommended if you're remotely into this genre.",
            "review_score": "1"
        },
        {
            "review_text": "Right when you begin the game, the title screen tells you that it is 'the ultimate fiery and bloody experience'. That would be a nice way of describing this game.  It's 'ultimate' because it is a really fun game with really cool mechanics backing it. It's 'fiery' because the graphics are incredible for what it is, with enemy craft swarming you mercilessly, shots flying and explosions covering the screen in fiery death. It's 'bloody' because the pilots of such enemy craft will pop out of their ships and explode into bloody gibs when you shoot them down and ram your own ship against them, laughing like a maniac. And to top it off, the soundtrack is pure high octane awesomeness courtesy of heavy metal band Machinae Supremacy, whom you may know from other awesome soundtracks like Giana Sisters: Twisted Dreams.  All in all, a game that no shoot 'em up fan should let pass. This is, with no room for doubt, the best western shmup made in all of videogame history.",
            "review_score": "1"
        },
        {
            "review_text": "A great side scroller shmup with amazing music that most people seem to overlook.  The two most glaring flaws of this game are that some weapons are just way better than others, and that replaying the game is encouraged, but there's no speed up button, making some stages feel like a slog.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the finest shoot 'em ups ever made!!!! I remember playing this back on an old Mac and having a great time, just as good today!!! I seem to remember being able to replay levels to earn money, maybe removing this was part of the re-balancing. Anyway, incredible game, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Bought three copies the instant it appeared on Steam. This game is fun as hell and rather replayable. Don't be fooled by its ugly graphics. Also, awesome music by Machinae Supremacy. You need this.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, funny jokes and a lot of action.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda-hardcore old-school side-scroller with terrific music. And sense of humor. And lots of blood, and dozens of levels, and metric ****ton of weapons, and space hot-dog as a possible ship (horrible, actually), and secret level where you can kill spammers. Basically, the best and last of its kind, I haven't seen a better one since JnG original release 9 years ago. A word of advice, don't flatter yourself and start the game on easy or normal, you'll have a chance to replay the higher difficulties (and then the hardest difficulties) as NewGame+ and the game can be brutal in the start. Don't be afraid to experiment with ships and loadouts (and don't forget you can and should upgrade the ship's systems), you can always sell everything at the same price you bought it - a simple mechanic that surprisingly few games uses right - and at least several levels need specific loadouts for you to be effective.  The negative side is that the game was released 9 years ago. The gameplay has aged very well, the graphics - not so. I strongly suggest to play it in window mode so you won't have to look at blurred 800x600 graphics in full screen. The game graphics itself are beautiful, but the scaling to higher resolutions could be better.  Last thing: ok, I pirated this. About 8 years ago, I think, cause I've never seen the official game as a physical copy and I didn't have a credit/debit card for a long time. And it was one of the few games I actually felt terrible about, because I wanted to do everything I can to raise the chance of JnG2 happening. So now I'm finally buying this, and buying some copies for my friends (many of which have already played and loved it back then), and writing this review, and will actually spam some people about buying it. Just make a sequel and you'll have my money.",
            "review_score": "1"
        },
        {
            "review_text": "got a transmission some eco-fascist had a job typical scary suit  criusing through the Bloodbath Nebula located the gang on my cellular got no bombs half a shield and a daisycutter have to destroy the Chemical Brothers (no relation to the musical group) they invaded a zector and be slanging that butter  that toxic waste we call it brittany spears without paying off dem bois so now they running in fear  space is full of trash and taking it out has never been funner  ",
            "review_score": "1"
        },
        {
            "review_text": "I am not too fond of 'old' games but this one truly struck the chord with me.   Jets'n'Guns Gold features a sidescrolling spaceadventure. Basicly what you need to do is to kill and destroy all enemies that fly at you. This is probably very usual in sidescrolling spaceadventure -games. Well what makes Jets'n'Guns stick out from the mass?  Well in my opinion it's many things. Wide weapon arsenal, you've got many kinds of bombs, missiles, guns (even those are divided into smaller 'groups', they aren't all just laser 1, laser 2...). You have different ships to choose from, you can collect new weapons and ships from the levels. You have 'secrets' and secret levels ready for 'picking up' scattered across the standard levels. You have several gadgets that you can use on your ship. Oh, and you can also upgrade almost everything you have purchased. I have probably missed some things here but that's my overall view on this, even though I haven't finished this game yet. One more thing I'd like to add - last but surely not least - when you buy something you can sell it back for FULL price. What this means is that you can test many sets of weapons and find the best for that particular level. ONE MORE! The music is just absolutely TERRIFIC! Same goes with the 'graphics' or textures or what is it called. And the ingame jokes that are fitted in the 'background' of the levels.  Well, for the negative sides there are almost none. When I really push myself and try to come up with cons I mainly think of the fact that you can't choose the level you want to play like 'I want to play level 24, it had cool graphics and a fun boss.'   That's about it folks. Hope you found this review helpful.",
            "review_score": "1"
        },
        {
            "review_text": "Guns and sexual puns.  Oh, and a bloody good sountrack might I add!  10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "One of the best shoot'em up (or right) game I ever played. Great visual details, never boring variety and maximum action. I don't remember how many hours I spent with this but I finished it at least three times over. Back in the day of course.   The soundtrack should have some words on it's own. It's a great mix of metal and 8-bit tunes made by the swedish band Machinae Supremacy. It's so good and uplifting that I'm still listening to it frequently even today.  Even though it's harder than I remember, it's definitely a must-have for the lovers of the genre. It can even compete with the legends of the Amiga era.",
            "review_score": "1"
        },
        {
            "review_text": "Still a classic, a decade later.  One of the best Shmups ever made, with a kickin' rad soundtrack. Has not been surpassed even after all this time.  Important to note though, play on the easy difficulty, normal is way too hard, and can be totally frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "It's been about a decade since this game was first released, and it's done a remarkable job standing the test of time. It does look somewhat out of date with a fixed resolution and no widescreen, but otherwise functions spiffingly, seems to map itself to Xinput controllers just fine, and most importantly, is still one of the most amazingly cathartic 'blow ♥♥♥♥ up' scrolling shooters with an incredible soundtrack by Machinae Supremacy.  The game's central mechanic is flying from left to right and shooting stuff. Make no mistake though, it is BALLS hard and even the first couple levels will seriously test your mettle. The upgrades system is very smartly designed, letting you sell off anything you don't need for full price, so you're always free to strip yourself down and try an entirely different loadout, which I strongly recommend if you don't feel like you're properly equipped for a level. If you're just dying repeatedly out of the gate, remember: enemy bullets are bad, colliding with stuff is EXTREMELY BAD.  I only have a few real complaints. It's sometimes hard to tell foreground from background, which is especially critical because COLLIDING WITH STUFF IS BAD. There isn't much meaningful feedback for what's causing you the most damage (hint: it's usually colliding with stuff, that you may or may not notice), and a few of the more gimmicky stages are pretty aggravating. That said, I still love it.",
            "review_score": "1"
        },
        {
            "review_text": "i do like playing these types of games....from time to time but useally they dont hold my attention for long....this one hasent let me go yet lol lottsa upgrades weapons &amp; all sorts of cool stuff i would most deffanatly scoop this one up &amp; reccament this if this type of game is your thign this one is AWESOME ^_^",
            "review_score": "1"
        },
        {
            "review_text": "I usually write detailed reviews for games but I have waited for enough votes for Jets'n'Guns to get the Greenlight for ages. I have beaten this game every which-way and many times over and can say that, in my opinion, this is the greatest shooter of all time. It was amazing for $20.00 originally and for under $6.99 this is an absolute must buy. Try out the demo on the Rake In Grass website if you want to see for yourself. You won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game before it came on steam long time ago, man, it is just one of the best of side shooting games I am telling you.   Everything in this game is wonderful let me give you some insights without spoilers  Game play:  the game is quite challenging specially if you started in hard, unlike old style of airplanes like tiger or raiden II where you have to shoot and survive ... Maneuver the fire and survive, this game is about style, you will get variety of options to select from, do you worry about health recovery and surviving or shooting with massive power weapons in short times because the heater won't take it, or do you prefer to keep shooting all the time and try your best to dodge. Do you want your airplane to shoot on one side or do you like to rotate your weapons. you will find in the game when you play it that there is more than one way to destroy the enemy, sometimes firepower is not everything ... it is about firing at the right time, but the choice is yours if you just wana focus blindly on fire power and keep ur focus on better things like Survive ... or just wana play it risky and try to do smart moves and than find out if was smart or not. Do you care about getting as much cash as possible in every level or you just want to do the objective and save your skin ? the game give you some options to increase your cash. Each choice has its own cons and pros.  Every mission you will get a chance to buy\\sell\\upgrade your weapons\\bombs\\tools and the best thing if you don't like them you don't have to worry, you can sell them any time or downgrade your items any time with the same price without troubling you about money, so you can change your style from now and then and try new things. And you could test your airplane before you start the mission just click on the red button with T below your airplane to see if the cooling system is satisfying and if your firepower is good enough for you.  The game play is balance and the control is more than fine. In the game dialog between the levels they will give you part of the story and some tips about control and the game, it will show you how the game works slowly without boring you to death by forcing you to play a tutorial map before you could try the game.  The game is quite hard specially in the advance levels, don't expect to kill all enemies or collect all bonuses from the first game run, actually in some levels you will be lucky if you could pass them from the first time, learn about the levels than abort the map and adjust your style to fit, experience with the game and it will amaze you with the plants of options that gives you to play this game. Latter on after you finish the game they will let you start it over with all our upgrades and money in that time you could do whatever you want ... Finish all the level with one weapon with 0 damage, or whatever but if you just start it just try to survive I guess.  Story:  yes story, actually most of these games don't have a story but this one is quite amazing, it start slow at first and it just introduce you to the theme of the story and how things works in the game universe but it become more interesting in the advance. I know a lot of players ignore the story completely in those games but I don't advise that in here.  Music:  ohh my god, the music, one of the things that make this game an epic is the music mixed with the actions, I just love it. It always fit the theme of the level.  Basically what I am saying this game really worth anyone time and it is fun, don't get scared when i said it is difficult you could put it easy if you are not a big fun of watching a screen with 100 bullets and play it on easy, the diffculty choice is yours but i advise you guys to try it on hard first, this game needs good eyes for watching not only the bullets, but what is going on as well, how enemys are dying and keep an eye for secreats and strange thigns too ... they are plenty of them in here.   I am surprised why did steam put this low price on it, I would buy it even for 20 dollars it just worth that price.",
            "review_score": "1"
        },
        {
            "review_text": "Great music, great graphical style, great design work, great customisation.  One of the best out there.",
            "review_score": "1"
        },
        {
            "review_text": "The best side-scrolling shooter I have every played (and I have played alot of them)! :-)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best sidescoller i´ve ever played. And this one is from 2006, but now with some nice feaures to fit new systems. ",
            "review_score": "1"
        },
        {
            "review_text": "Me gusta mucho. Hard and rage inducing, but I rage a lot.",
            "review_score": "1"
        },
        {
            "review_text": "I Don't Know If The Game Play Is Good But God Damn The Soundtrack Is Good I Recommend Buying It Just For The Soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "The best arcade ship shooting.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Tyrian throwback. Been waiting for a game like this since on-rail shooters started getting popular again.",
            "review_score": "1"
        },
        {
            "review_text": "Brutally awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Good game but quite hard sometime,If you like side-scrolling shoot em ups, or just crazy shooting mayhem in general, you should try this. Fair warning, it's damn hard!",
            "review_score": "1"
        },
        {
            "review_text": "don`t read comments play this game it`s one of the best of his kind ^^",
            "review_score": "1"
        },
        {
            "review_text": "I played this before it was on steam. Get rekt.",
            "review_score": "1"
        },
        {
            "review_text": "lots of guns, needs more jets. pretty fun game though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ALMOST really good as it has some really fun graphics and excellent music... but it's lacking in so many little points in terms of gameplay that it builds up into an experience that's not very fun to play unless you're REALLY hardcore into 2D shooters... I mean being the kind of person who never takes a hit and never misses a shot.  PROS: Good graphics, awesome music, interesting hacking minigame for some of the loot you find.  CONS: No real feedback when you're taking damage making it difficult to know when you are, UI is clunky, mouse control is terrible for a game that is often compared to Tyrian which has GREAT mouse controls, everything is really tiny, no actual widescreen support, instead just stretching the screen, gameplay is also fairly low resolution, being blurred to fill the screen with full screen enabled and being super-tiny otherwise, status indicators are not only analog but really small, making them hard to read in the heat of combat, each stage is REALLY huge, often having several checkpoints along the way, which doesn't serve well for a game that focusses on intense action, joystick support reads directional inputs as 'buttons' which is confusing to configure, can't configure guns and bombs/missiles to the same button and there's little reason not to fire both at once, so you often end up holding two fire buttons down at the same time... as said, it's all little stuff, but there's SO many little things wrong with this game...",
            "review_score": "-1"
        },
        {
            "review_text": "Pick between powerful forward facing only guns or guns that are weak as a kitten but will target enemies in any direction. Pick between affording powerful weapons that require a regular cooldown or weaker ones with the upgraded cooling system you need to run it  Then throw enemies spawning from all directions and trying to ram, and insta-kill, you with no let up in them spawning so that you can cooldown the weapons and you have some idea of the nature of the game. Then there's also plenty of obstacles where the only indication you're hitting them is watching your hp drop, while other similar on screen elements you safely pass through.  As others have mentioned the levels are also quite long, with no save points and rarely any armour to repair your ship.   Sadly not a patch on Tyrian.",
            "review_score": "-1"
        },
        {
            "review_text": "I love games like this. and it is exactly what i wanted except impossibly hard and Im not one of those guys that yell every time i die. rearrange the weapons and the plans and you still will need more upgrades for your vehichle to kill those things",
            "review_score": "-1"
        },
        {
            "review_text": "I honestly had high hopes for this game as well but after a half hour into it, I just found myself extremely bored. You esentually are a space figher that just shoots constantly and you hit mild targets while avoiding the 'one hit death' obsticals. With you respawning at the start and with the levels lasting sooooooo long to beat, I just don't see myself even able to beat the first level...much less the game.  But like I said though, this game was extremly boring after the first ten minutes but I stook with it for a while longer. I would just pass on this game and move on.",
            "review_score": "-1"
        },
        {
            "review_text": "At first, the graphics look funny, and upgrading weapons is also fun, right?  Then you notice that most enemies etc. seem be from different artists, and the overall look is more like 'hey let's stich this together somehow' by someone who doesn't really want this job.   And upgrading weapon is a rats race you cannot win - your firepower will always feel the same - you upgrade because you have to. It might as well be automatic.  And some of the weapons and ships are jokes, which are funny for a few moments, but again this feels like you just have the illusion of choice.  I really tried to like this game, but it gave me the feeling I was playing something someone was really forced to create and who got yelled at by his boss for not meeting deadlines. Can't enjoy that.",
            "review_score": "-1"
        },
        {
            "review_text": "To say this game is unpolished would be a bit of an understatement.  You have 3 choices for controls in this game: keyboard, mouse, and controller. In all 3 control methods (yes, even the mouse) you either don't move at all or you move at one unchangeable speed. Moving the mouse slowly simply results in you not moving at all, making it unresponsive and unintuitive. And no, you can't configure the deadzone. If using a controller, you also can't map the triggers to anything, so you'll need another program such as joy2key or qjoypad unless you want to be holding down a button for the whole game. Basically, the controls could not possibly be made any worse than they are right now.  In addition to the crappy controls, there's no visual indication whatsoever when you take damage. The bullets were also kind of hard to see when something exploding sends harmless particles and rubble flying around obscuring the things that actually do damage.  The interface is also pretty annoying. Instead of having a healthbar somewhere easy to see, it uses a circular guage for your health and stuffs it in the bottom left of the screen, which is particularly annoying if you're playing fullscreen. You can't change its position or size either.",
            "review_score": "-1"
        },
        {
            "review_text": "too hard, unfair, fukn ♥♥♥♥ game !  + good soundtrack",
            "review_score": "-1"
        },
        {
            "review_text": "Junk. Just a generic flash game that you can pay money for.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game, ton of fun :D",
            "review_score": "1"
        },
        {
            "review_text": "Was recently looking for something to kill some time and by sheer luck I came across this little diamond in the rough. The game boast a heap of content, enjoyable gameplay, great art work, a sense of humor, and is the kind of game that keeps you coming back. All in all this game is very well put together and something I'd definetly reccomend trying out. The bang you get for your buck is great.  As others have mentioned start the game on easy 'to fat to die', unless you want it to be really challenging, in which case start on normal.",
            "review_score": "1"
        },
        {
            "review_text": "I like shoot em up games. they are fun and simple and this one is one of the best Ive played. lots of levels (43 I think the description said). the weapons are staples of the genre there are lots of enemy types too. ive been playing it for 7 hours and havent yet finished it. plus I got it when it was on sale. very happy with my purchase.",
            "review_score": "1"
        },
        {
            "review_text": "If you like destroying stuff, you'll like this",
            "review_score": "1"
        },
        {
            "review_text": "Awesome soundtrack, good old memories, addiciting fast paced gameplay, cool visuals = simply awesome!",
            "review_score": "1"
        },
        {
            "review_text": "My 'damn the internet does not work again' game. Really cool game. Sure as hell I can recommend it. If its on sale -&gt; get it! :-)",
            "review_score": "1"
        },
        {
            "review_text": "Airplanes in space? Don't be silly. An helicopter too? Now that's just ridiculous. An hot dog van?! Good, I was getting hungry.",
            "review_score": "1"
        },
        {
            "review_text": "The best shootem up game availble on steam, and one of the best in games history! BUY IT! NOW!  I spend a loot of hours playing normal edition, and now, thx to steam i've got gold version, YEAH! Great music, great graphic, and awesome action, for that price you can't miss that game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the hardest games I have ever played. I thought this may be a casual game but i was wrong. It just seems really easy to take damage. Sometimes I dont even know what kills me. But I will not quit. I only recommend this game to sadists. Look forward to retrying every level over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "Jets'n'Guns is maybe one of two or three games where I'd seriously consider getting in a fistfight with someone who spoke ill of it. It has its flaws, as any game does, but what it also has is planet-loads of charm, an amazing soundtrack, a body count that would make war criminals jealous, and some of the craziest weapons this side of Raptor: Call of the Shadows. A great way to blow off some steam after slogging your way through crowds of people you CAN'T murder with a space plane all day.",
            "review_score": "1"
        },
        {
            "review_text": "What I hate about this game:  *Really unpredictable even with a high-tech spaceship. Most of the time, the screen fills up with epic particles, which can block anything including the bullets and rockets coming to you. And sometimes, I have to rely on luck or memorization, which I really hate, since you have to die dozens of times before you beat a mission in normal mode.  What I like about this game: *What I said above is the only thing I hate.",
            "review_score": "1"
        },
        {
            "review_text": "its a fun game actually, i first looked at it and thought it would be boring, same old same old, then i started playing it and it actually has story behind it abd you can upgrade your plane and stuff, its actually fun to play with my mate, its fingle player tho obviously",
            "review_score": "1"
        },
        {
            "review_text": "I stumbled upon this gem long time ago because of it's gread soundtrack by Machinae Supremacy. Even without the game itself, the OST would be an instant buy. But, boy, this game's great! It's somehow like a classic sidescroller on caffeine: Fancy retro graphics, good pace, cool sceneries, tons of ships, customization options, easter eggs, and just a spicy humour. It's not high-polished, it's not complex in gameplay, so people in search for that may feel repelled. If you're on hunt for easy fun, go for it!  I don't know how many playthroughs I gave it over time, but I'm more than glad it got rebooted on Steam. Just another reason to play it again.",
            "review_score": "1"
        },
        {
            "review_text": "great game!   -sugestions-  level editor weapon creator. online / offline multiplayer (2-4 ships one screen)  ",
            "review_score": "1"
        },
        {
            "review_text": "Technically infinite gameplay, and epic soundtrack. If you like old school stuff, then you must have this!",
            "review_score": "1"
        },
        {
            "review_text": "Good schmup. Pretty old. Some stages are really annoying (I'm looking at you, space race -.-#).  Long gameplay and highly replayable. If it's on sale, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "While a technically functional shooter, ther ewere a few issues that stoped me from really enjoying this game, as so many other people appear to be doing. First, it is not really compadbile with a controller, atleast at the menues. Your analog stick is used to controll a mouse cursor, which is rather werid. Second, in some movies, and such, there are smaller stars that go across the screen. Most space shooters do not, as it is harder to tell what is a bullet, and what is not. This game has that issue. If I could remove that, I bet it would be easier to see the bullets. It would also be nice to have some kind of audible feedback when you are getting hit. After a bit, your ♥♥♥♥ comlains of critical damage to the hull, and then you explode. Checkpoints would also be nice. Maybe I am not getting far enough ino the level to hit one, but that could be solved by having a life system, and letting me continue where I died. That would be super cool.   So, its not a bad game, but I don't seem to like shoot 'em ups as much I as a thought I did.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game so mach. :D  -The musice are 10/10  -Have a lot interesting and funy ship, map, weapons.  -The ship customization amazing, have a lot combination.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more players, much fun",
            "review_score": "1"
        },
        {
            "review_text": "For everyone loving Tyrian oder Raptor is Jets'n'Guns too. Weapons, Upgrades, different ships, challeging level. I love that despite the fact that the game is quite old and looking not so good on high res screens. But try it and the fun will repay you for that.",
            "review_score": "1"
        },
        {
            "review_text": "The best side scrolling shooter I've ever played with awesome soundtrack. With tons of guns and ships combinations to try, secrets to find and funny story and stuff around you never get bored. Addictive and entertaining 100% fun guaranteed. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good shoot em up game, but few ship. Need a DLC for this game with more ship and weapon.",
            "review_score": "1"
        }
    ]
}