{
    "app_id": 262210,
    "name": "Last Knight: Rogue Rider Edition",
    "release_date": "2014-10-03",
    "developer": [
        "Toco Games"
    ],
    "publisher": [
        "Toco Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 77,
    "positive_ratings": 164,
    "negative_ratings": 36,
    "price": 4.99,
    "description": "Last Knight is over-the-top jousting action in a beautiful brutal fantasy world! It comes with bucketloads of content and is inspired by outstanding third-person platformers like Crash Bandicoot.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262210/header_alt_assets_1.jpg?t=1555497127",
    "minimum_requirements": "最低: OS: Windows XP or higher プロセッサー: 2.4GHz Dual Core or 2.6GHz Quad Core メモリー: 2 GB RAM グラフィック: 512MB Shader Model 3.0 Nvidia GeForce 8800 GT or AMD Radeon HD 3870 or 1GB Nvidia GeForce DirectX: Version 9.0 ストレージ: 900 MB 利用可能 サウンドカード: Windows compatible sound card",
    "recommended_requirements": "推奨: OS: Windows XP or higher プロセッサー: 2.6GHz Dual Core or 2.8GHz Quad Core メモリー: 2 GB RAM グラフィック: 512MB Shader Model 3.0 Nvidia GeForce 8800 GT or AMD Radeon HD 3870 or 1GB Nvidia GeForce ストレージ: 900 MB 利用可能 サウンドカード: Windows compatible sound card",
    "reviews": [
        {
            "review_text": "Best runner currently on Steam, bar none, with a ridiculously active and enthusiastic dev team. There's no reason a casual runner should receive so much polish and so many meaningful updates, but it's clearly a labour of love for its creators.",
            "review_score": "1"
        },
        {
            "review_text": "The fun for this game never ends. Campaign is a little repetitive but it's a nice kickstarter to anyone new to the game. Customization and challenges keep you coming back for more. Fun and simple. Anyone can enjoy. Still recommend!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fantastic! This would be even better with multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "Nine minutes of pure fun",
            "review_score": "1"
        },
        {
            "review_text": "Crazy fun. Ragdoll physics do make everything better.",
            "review_score": "1"
        },
        {
            "review_text": "Fun runner, with lots of caveats.   I enjoyed this game, but have many issues with the way it plays out. The graphics are nice, but a bit laggy on my mid-level mac. I think this is due the 3D engine that is used, and the pre-rendering of the maps. I can play much more ambitiously designed games on my computer without such a drop in framerate.  Game play is very simple and repetitive, but challenging enough to be fun, if you enjoy runners. Some of the challenges are bit cheap, and it seems to be due to poor design, rather than intent. But, if you enjoy this kind of game, it really is quite amusing.  Now...  Things that annoy me:  Graveyards frequently have a big sign blocking the player from seeing an obstacle that one must dodge or jump over upon entering. I got used to this. This is the one I'd call 'cheap'.  When one jousts, the action slows down to show the hit but it really throws off of the rhythm of the game. The character runs at a consistent clip throught the game, and (at least, I) tend to look in front of the character to get the timing right. But, I frequently end up running into something right after hitting a spider or a horseman, because the game has slowed to show the action of the impact, like I'm in the matrix, or something. Wow, I really hate this. I wish they'd give an option to disable it.  I am STILL not used to the controls, as simple as they are, and must remap them each time I play, since they don't save keymaps, and the default keymap is counterintuitive. I invert it so that jump is the left mouse, and joust is right, as the knight has his jousting... uh, thingie(?) in his right hand. It seems weird to press the left button to get him to use the weapon in his right hand. Am I wrong to find that odd?   So, ALL of that nonsense aside, the game is pretty fun. I like seeing the horse and the knight tumble over themselves when they fall... That part is pretty funny. It's fun to get in the groove and play for 5 or 10 minutes at a time. I'd recommend buying it on sale.   ",
            "review_score": "1"
        },
        {
            "review_text": "MAC USERS BEWARE: READ FORUM FIRST BEFORE PURCHASE. - GAME PLAY IS A TON OF FUN THOUGH.  Bought the game, can't play it. So it doesn't matter to me how good it is. Dev acknowledges major mac compatability issues in the forum but there's no fix. Shouldn't be listed as a mac compatible game when it's known to have major issues and is listed as full release.  Update: Developer was quick to work with me and is trying to troubleshoot so I will vouch for their care about their customers.  Update 2: Developer found a way to get the game sort of running on my machine. The gameplay is fun but I still wouldn't recomend it to Mac user with the amount of issues and poor performance on Mac. Hopefully a unreal engine (the engine they use to run the game) update that is supposedly coming down the pipe will fix the issues with Mac. In the meantime i'd recommend that Mac users stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't use a game pad or have access to a tilt controler this game is sorely lacking. The controls just suck really bad for keyboard. It'd be boss with a 4 button tilt controler though.",
            "review_score": "-1"
        },
        {
            "review_text": "I was fooled by description and montage of trailer into thinking this is a crash bandicoot like game. While visually it may be it was hug dissapointment to find out that its just a port of typical mobile phone runner. Well i must admit its a nises runner i ever player but it is just like 90% of moder cell phone games are only playable in toiler ot on a way, to kill time, on PC i dont feel like enjoy playing such kind of game.  So on cell phone its nice when you sit in toilet, graphics nice even on PC, vert adorable, bug linear repetive gameplay, typical convoluted cell phone UI with ugly hacked int kyeboard and gameplay supportm and wrong expectations to see crash bandicoot kind of game are reasons why i would not recommend to buy it on pc, you can do that on your dumbphone,  Well, maybe if you have kid this game would be suitable on PC, but for more or less adult person there is absolutelty bo gameplay value. Also cutscenes fadin effefct after each line of character annoys me.  I wish dev of this game instead of porting game as is just would use its assets and make a true crash bandicoot like game with free 3d gameplay.",
            "review_score": "-1"
        }
    ]
}