{
    "app_id": 262390,
    "name": "Cloudbuilt",
    "release_date": "2014-03-20",
    "developer": [
        "Coilworks"
    ],
    "publisher": [
        "Rising Star Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Parkour",
        "Female Protagonist"
    ],
    "achievements": 37,
    "positive_ratings": 703,
    "negative_ratings": 122,
    "price": 14.99,
    "description": "The fastest platformer around just got even faster – avoid fatal hazards, dodge hostile robots and use the Level Editor tools to create your own amazing Cloudbuilt stages!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262390/header.jpg?t=1478085723",
    "minimum_requirements": "OS: Windows 7 Processor: 2GHz Intel Dual Core processor Memory: 2 GB RAM Graphics: 512 MB OpenGL 3.2 compatible card Storage: 3 GB available space Sound Card: Any compatible soundcard",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i5 (or better) Memory: 4 GB RAM Graphics: Nvidia Geforce 560 Ti (or ATI equivalent) Network: Broadband Internet connection Storage: 3 GB available space Sound Card: Any compatible soundcard",
    "reviews": [
        {
            "review_text": "This game is absolutely my jam. Most people will liken it to either Mirror's Edge or a Sonic game, which are both appropriate, but for some reason this game to me feels exactly like a 3D Megaman X game should. The atmosphere, soundtrack, and moveset all work well (for the most part) and make a very compelling product.  Ordinarily, I strongly prefer using a gamepad to play action games like this. However, at the time of this review, Cloudbuilt doesn't have full controller support. The team says they're working on it, but honestly I think it may be for the better that it doesn't support gamepads yet. The level design is heavily dependent on the user's ability to control the camera quickly and precisely while jumping, and I could see a bad gamepad interface design making the already brutal difficulty level of the game even worse. Better that they take their time to make the feature perfect.  Speaking of the level design, as I say above, the levels are extremely difficult. This is definitely a speedrunner's game, with the goal of each stage being to get from the start of the level to the end as fast as possible. However, the levels provide many ways around obstacles, and clever players should be able to find still more ways to get through. In the fairly rare instances where there is only one path forward, the game unfortunately makes that path unnecessarily punishing with enemy/obstacle placement that usually means instant death if you make any mistake.  The game also makes some weird design choices. You have a limited number of lives for doing stages (if you run out you have to restart the stage from the beginning instead of checkpoint), which is unusual in modern games of this ilk. But what's weirder to me is that you increase this limit by completing stages with good rankings. Basically, the way to get more lives is to not need them. Enemies take a lot of effort to kill in this game (some are indestructible, and others have shields), but can often be disabled fairly easily once you know the trick. The point here seems to encourage the user to find other ways past the enemies, but when the game throws several of them at you it can be very difficult to figure out how to proceed, especially after a checkpoint where losing a life may mean having to redo the first part of the stage.",
            "review_score": "1"
        },
        {
            "review_text": "Can best be described/reviewed as a bunch of exclamated statements.  Wall running! Jetpacks! Auto aim that you need half the time! Speed running! 3D platformer! Mines! Troll-y Turrets! Random tank things! Lasers! Purple Electricity! Falling off edges the other half of the time! Because You're twit! Jetpacks! Beautiful Cel Shaded graphics! Thing that shoots homing balls that should have less health! Super fast respawns! Checkpoints! Many different routes! Occasional terrain glitch like standing on a buzzsaw! Buzzsaws! Come to think of it, all the enemies are to some effect ♥♥♥♥♥, some greater than others! Great Soundtrack! Sensitive agility and mobility! Recommended speedy reactions on the part of the squishy thing behind the screen on the keyboard! Controller Support! Replayable modes! Jetpacks!   Now More Accessible to newer players of the precision platform genre!  I think that pretty much sums it up.",
            "review_score": "1"
        },
        {
            "review_text": "Best...game...ever!!! Super hard (especially at first) but super rewarding once you start getting the hang of it.   Pros: Lots of modes (once you unlock them). Cool community and community levels. Leaderboards to chase too! Story is interesting (not a big part of game). Rad design.  Cons: You have to sort of figure it out as you go (may be a plus in the end).  If you give it a chance, this game will be one you keep going back to for a long time.  This game rocks!",
            "review_score": "1"
        },
        {
            "review_text": "My my this game. I absolutely adore it! There are a lot of games where the gameplay is fast paced but severely lacks any control. Cloudbuilt however gives you the chance to control it... after you die a lot at first. A lot of reviews say this game is hard at first and, yes, it is but dont let that put you off! So many times Ive messed up on a little jump or a boost and thought: 'darn now im not gonna get an A!', but I keep trying and when you get a good score you feel so good about it! I swear this game is a counter to my depression! &gt;w&lt; But in all honesty I could probably play this just for the soundtrack because, oh god is it beautiful! Anyway, when alls said and done, you should probably give this game a try! Even if its not your forte.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is a really good 3D Platformer i recommend it to all speedrunners who likes to have a challenge :) the gameplay is pretty good and just need minor tweaks to would be perfect. (also im glad to see a good 3D platformer how long has it been a good 3D platformer was there i dont even know)",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a lot of the reason this game isn't doing incredible is because people arn't sure they'd like/enjoy it. The best and most fair platformer I have played. If you screw up it's your fault ok.",
            "review_score": "1"
        },
        {
            "review_text": "I've had such a love-hate relationship with this game.   I bought in when it was still very young. A lot of the features that are currently in the game were not there, way back when. At the time, the game infuriated me. I couldn't stand how twitchy and broken playing it felt. The controls weren't great and the levels just seemed damn near impossible to get the hang of.  Fast forward several months, and the devs have been amazing. Many consistent updates, free DLC, remixed levels. I must tip my fedora to the wonderful people at Coilworks. Of course, I still wouldn't be able to play if they didn't fix the controls. Luckily, as of v1.2, they have. I now feel more in control of the character and the levels don't seem as awful.   This isn't to say that the game is easy. It's still a damn hard game. But it's one of the most rewarding games out there.   Also, the music is simply ♥♥♥♥♥♥ic. The OST is enough to buy the game for $5. The hours of challenge and thrill are worth the rest.  Do I recommend this game? If you're patient enough to find your groove and playstyle, absolutely.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing amazing game! blends Mirror's edge, with Sonic and Megaman and has the difficulty of Dark Souls a must buy!  10/10 Would fail at CloudBuilt again!",
            "review_score": "1"
        },
        {
            "review_text": "So I've been playing this game for a while, and if I were to make a review as short as possible for this game, here it is.  It's very fun, but not what I expected. In a good way.  Now for the longer review because I always need to explain my points.   Pros:    Great control of movements   Beautiful graphics and amazing to look at   Gets addicting after a while   You only get better the more you play and get comfortable with it    Cons:    Difficulty difference between levels is too much   Story might be hard to follow for some   Nearly impossible to get new skins, unless accidentally   Price is pretty steep for anyone not knowing what it is, it may not attract people who may really like it   I've watched this game for a while now, saving money to get it. 'A speedrunner's dream'. I adored this quote, and I was drawn in. The developers saying that whatever path we can find, we can use, no matter intended into the game or not. This blew my mind and I fell in love. I still love this game! I will continue to play it!   The difficulty is what is a downer for me right now. 'Going from level 3 to level 4' for example would be like 'switching between normal difficulty to legendary between missions' in Halo, or 'turning up the difficulty from normal to expert' in Guitar Hero. It's insane, and there are new enemies that you have to learn how to fight and how to counter on the spot, and I believe I've run into some which cannot be killed and you just have to figure out how to run past it.   If there's any way to either nerf the difficulty progression, or maybe find some sort of guide to help me deal with the high difficulty progression, that would make this game much more addicting to play, and less frustrating.  Overall, 9.5/10! Would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "For a 3D platformer, the gameplay is very good. The levels are designed very well, giving multiple paths to take making each run feel as if you are in control and that your decisions are actually meaningful.   The story is a bit strange but well told. It's about a female who after fighting in a war, a mission went wrong, and she ended up being critically injured. The game is based within her subconcious (or mind) while she is recovering / being operated on which seems to be a number of 'combat trials'. This is all told through short pauses of dialogue between each stage with no cutscene or animation, so it's more like the character telling you their thoughts.  The voice actor, and the way the story is presented reminds me a lot of how many Animes give females a often male role (like being in the military), and mix their story with a lot of emotion to bring out their mental state of mind. It makes the player feel a bit more sympathy for her then if it had been a male, and allows the player to connect with what she is going through.   Negatives - -Many of the levels feel very similar to one another since the same basic assets are used for each stage. -'Combat' seems like a afterthought, and I feel like it's much more rewarding to just bypass the enemies then shoot them. -The graphic style is cel-shaded (like Borderlands), and although many people praise cel-shading as being 'artistically beautiful' I find that it makes the textures / colors very 'flat' or basic. Comic-Book / Cartoon look. -Difficulty curve - the game does get very difficult quickly which may pose as a threat to casual players.",
            "review_score": "1"
        },
        {
            "review_text": " Short Version  Fast, vertical and a lot of fun. Feels like a modern take on Sonic The Hedgehog. Highly recommended to anyone who enjoys platformers and good challenge   Long Version (My full video review)           YouTube™ Video:  Cloudbuilt | It Came From Steam&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It's like Mirror's Edge on crack 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This was an impulse buy that turned out to be amazing. It's got its own fresh narrative and ambiance while successfully mixing the better parts of games like Sonic, Megaman Legends, and Mirror's Edge.",
            "review_score": "1"
        },
        {
            "review_text": "try, die, learn, die, learn again, die again, learn a bit more and success!  this game is pretty much like the very fast brother of darksouls in terms of difficulty. if you lose it's your fault, and your mistakes won't be forgiven. if you win though, the feeling of overcoming the obstacle is way more awesome than any other.  beautiful graphics, nice sound, a heroine and many many challenges  give it a try, but prepare to fall down... a lot...",
            "review_score": "1"
        },
        {
            "review_text": "Incredible looking artstyle (reminds me of borderlands) scenery and gameflow is smooth as a babys butt.  10/10 would speedrun again.  WARNING not for the faint of hearts.",
            "review_score": "1"
        },
        {
            "review_text": "I've stuck with this games and played most of the levels several times through. This is one of the best games for me to come back to, repeating old levels and realising I'm able to easily beat old records without grinding gives a real sense of accomplishment.  The controls are the best thing about this game for me, the game will react consistently and repeatably, and failures don't set you back because you respawn instantly ready to go again.  The learning curve is steep, but sticking at it means you improve faster than if the game held your hand.  This game is brutal, but once you've gotten past each level... you can start again and blitz through everything you struggled with an hour ago.  One of the few games that are this challenging that stay enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone looking for a speedrunning game similar to Dustforce, look no further. It's got lasers, robots, jetpacks, and PARKOUR. You'll be sure to spend hours finding ways to shave off those extra couple seconds for A and S rank. Try not to break your keyboard in half as you thread yourself through tight openings as you boost the tears away.",
            "review_score": "1"
        },
        {
            "review_text": "Cloudbuilt is a rather unique little gem. It is a 3D 3rd-person platformer with an emphasis on creative speedrunning.  During first gameplay hours it might feel pretty rough because of how precise the controls are, having been designed for keyboard and mouse, but given enough time it will improve your 3D platforming skills in a way a lot of games don't.  You have different routes which to take to your goal, not many of them obvious, so exploration is rewarded. There are skill and techniques to learn and master beyond the basic controls. The first time you go through a level, you will do it slowly, methodically and will trip up here and there, perhaps just barely making it to the goal on your last life. Give a few hours of playing other levels, and when you come back, you will dash through the previously tough content like nobody's business. There is a nice high skill ceiling.  All the content takes around 10 hours perhaps to beat, but if you plan on only playing levels once, you will have a horrible time because many of the later levels are extremely nasty to players who haven't mastered basic skills and strategies to overcome obstacles. You will rip out your hair if you take on the last levels of a story branch too early.  These levels are meant to be played over and over again, and the things you learn during it will transfer to the rest of the game. You will say 'Damn, I'm getting good at this' at some point, dashing through the air like nobody's business.  The game is gorgeous, it has an amazing soundtrack, and well worth your money if you're willing to learn its systems. One of the highlights of 2014 for me",
            "review_score": "1"
        },
        {
            "review_text": "Have been looking forward to this game for quite a long time.  Still. Exceeded. Expectations.  The feeling while playing this game is quite awesome and worth grabing this gem (full price isn't that high, must go for it if on sale).  Welcome to parkour with a jetpack and a PEW PEW gun !  @Steam : please feature this gem",
            "review_score": "1"
        },
        {
            "review_text": "8/10 - Highly recommended if you like fast-paced 3D platformers.  This game is a solid mix of gameplay elements from classic series like Sonic The Hedghog and Mega Man X in a 3D Platformer.  It's a speedy platforming game with light shooter elements. Your character has rocket boosters that let you dash fast, jump far, wall run vertically and horizontally to reach the goal point. Occasionally, you'll have small enemies and obstacles that you can blast with your laser gun. For tougher foes and barriers, the gun has a charged shot to destroy them.  The game does employ the use of a lives system. Run out of lives and you have to start a stage over again. You'll earn extra lives when completing a stage, or find them in the stages. Also, you are given a custom checkpoint that can be placed anywhere in a stage (you can pick up extras while in a stage). When you place one, your lives are replenished up to 6. And the checkpoint will last until you clear the stage or lose are your lives.  Your character is a woman in the army of the world who was wounded in a failed mission. Inside her own head as her body recovers, she recalls the events that brought her to this point, and comptemplates the meanings of the dreams she has of running through the obstacle courses in the sky.  The music in the game is nice mix of atmospheric melodies and upbeat electronic tracks to get you into the rhythm of the stages.  I recommend a controller if you have one. Default control scheme isn't very inuitive, but you can customize the button layout in the options menu.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game. Think Megaman with Sonic's speed in a Bastion-style universe with a Mirror's Edge style movement system. Unique, super solid mechanics (though not very forgiving, which in this case I think is a good thing considering it encourages skill over assisting you), good level design with multiple routes to get to the same place with varying difficulty and speeds, and heaps of replay value in trying to improve your times on levels, I'd say it's one of the most fun games I've played all year.",
            "review_score": "1"
        },
        {
            "review_text": "I love 3D platforming. This is fast 3D platforming, very fast.",
            "review_score": "1"
        },
        {
            "review_text": "Sonic the Hedgehog 2 3D",
            "review_score": "1"
        },
        {
            "review_text": "Good game. People complaining about the game being too hard or unplayable without having to spend hours learning the controls are massive scrubs who need to get good.  The controls aren't awesome, but they're alright. Clipping onto ledges and ♥♥♥♥ mid wall-run or jump is a mother♥♥♥♥ing ♥♥♥♥♥.  The ♥♥♥♥ing gun turrets though, How the ♥♥♥♥ am I suppose to pass them without shooting them. God ♥♥♥♥ing damnit.  Death penalty is stupid &gt;:(.  Gotta go fast.",
            "review_score": "1"
        },
        {
            "review_text": "Loading times are a little long but contols are very responsive, defiitely worth the price",
            "review_score": "1"
        },
        {
            "review_text": "Feels like you're doing a speed run through Mirror's Edge as Megaman.   10/10 would run again.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best speed runner",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10 what are you waiting for?  [parkour] the main aspect of the game is the parkour, wallrunning,  wallclimbing and boosting allover the place. and Cloudbuilt does this really well. the game is rock hard so dont expect a sunny walk on the beach here.  [combat] the combat is ok, nothing too new or special here. however there are some enemies that are unkillable / will rebuild themselves after a set period of time, and personally i don’t like that. the game has a system of lives that goes down each time you reset on a level, you can increase the max cap of lives by completing levels on good times in both normal and other modes. i do not like this system, as it forces player to redo parts of the level that you already master just to practise on the harder parts. and if you go for a speedrun you would naturally reset the level if you die anyway.  [level design] the levels are very open and full of options to get to the finish line, but on the harder levels you will find some bits that are forced down only one, often very hard path.   [graphics] my PC rig is medium to high but i can’t really push this game beyond 70 FPS. the game has some interesting filter on all objects, which makes things melt together at times. if i have to compare the artstyle to something the closest would be sanctum 2.  [music] amazing, just amazing.  [notable things] sometimes the boost button is unresponsive and the chaining delay between some moves are to high. spend some time in the practise area, you will be surprised of what you find and learn.  if you begin to wallrun/wallclimb/or fall down a wall there is no easy way to switch, one failed jump and you are doomed.  the tutorial doesn’t cover everything, and it can take some time to notice if you can grab on a wall or if you will fall of for example.  [suggestions] more modes, no enemies maybe? steam achievements. make disc turrets not shoot trough walls... more wide open levels. make all enemies permanently killable in some way. ",
            "review_score": "1"
        },
        {
            "review_text": "+ Excellent visual style + Surprisingly dramatic narration and backstory + Very fun mechanics + Story campaign is short, but overall high replayability  - Fairly steep learning curve - Can be very, very frustrating",
            "review_score": "1"
        },
        {
            "review_text": "A neat platformer that isn't cheapo pixel garbage. In between levels it suddenly remembers it's an indie game and has pretentious monologues set to piano music.",
            "review_score": "1"
        },
        {
            "review_text": "A gorgeous freerunning game with precision controls and epic speed.  Rocket parkour? Hells yes. Couldn't recommend more for people that love speed runs.",
            "review_score": "1"
        },
        {
            "review_text": "pros: this game is a fun platformer that will give you your fix if you are an adrenalin junky. You are gonnna do every thing from jumping wall running flying and destroying bots to get to the end. There are a lot of levels but surprisingly very few of them felt the same. The core gameplay is just funn  cons: The graphics are pretty bad in this game, i get that they were going for a unique art style but it's not good. The story is almost non existant and very shallow, it's just there to be there. The game is kinda short, it only took me around 8 hours to complete with all the side missions Note: There are extra gamemodes for every level that i didn't complete, and there are extra skins that i didn't go for  Summary: This game is fun but not THAT fun and it's pretty short. I would recommend it but I don't think it's worth $20, maybe $15 or below. I got the game for $5 so im okay with that",
            "review_score": "1"
        },
        {
            "review_text": "I only playted a few minutes, but it is pretty cool. Reminds me of mirror's edge. controls take a bit to get used to",
            "review_score": "1"
        },
        {
            "review_text": "i suggest cloudbuilt if you remember the days of mirror's edge ",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap i was thinking it might have been less than the video portrayed but damn this was fun; fast paced, very pretty even with the high speed maneuvers, makes me want to play mega man though lol. Would definitely suggest if anyone likes puzzle esque games or race like time trial games that keep you feeling the need to beat the previous score! and its on sale for 5$ easily worth the price",
            "review_score": "1"
        },
        {
            "review_text": "This game would be god damn incredible if they got rid of the enemies, implemented a lock on system, or implemented a slowdown/pause time system.  Near the final levels of the game enemies are frustrating, annoying, invincible, placed in places SPECIFICALLY to annoy you, AND kill you constantly.  This game was just a few steps away from being a masterpiece and the funnest game I've played all year.  If you can look past frustrating levels and terrible enemies, I definitely recommend this game. If not then, I still recommend it. There's nothing else like it.",
            "review_score": "1"
        },
        {
            "review_text": "Holy..crap. This game dropped my jaw when i started playing it. The concept is easy to learn, and the first couple levels aren't that hard at all. But then it seriously ups the anti after that. This is a game that you will love to rage at and when you do well it totally makes you feel like a bad ♥♥♥ b!tch. The replay value is amazing, the visuals and gameplay are amazing, it even has a bit of a philosophical monolog now and again. I highly recommend this game, 10/10. I have NO complaints.",
            "review_score": "1"
        },
        {
            "review_text": "One of the hardest speedrun games I have seen so far, the most beautiful as well. If you like to speedrun, even a little bit - go and buy this one!",
            "review_score": "1"
        },
        {
            "review_text": "Cloudbuilt is a game of speed. Race through an elaborate kingdom of floating platforms high above the clouds. Or if you're me, take it nice and slow while still crashing into nearly every obstacle. I am really happy with this game.  The best aspect of the game is the design of the levels. Getting from A to B is not simple, and there is no right way to do it. You'll have to find your own path up into the skies. Will you choose the easier, longer path or the killer short cut? The additional game modes force you to discover many paths, adding tons of replay value.  The story line and music are also very well done.  Highly reccomended for anyone who likes:  - A challenge  - 3D Platforming / Speed running  - Replay value",
            "review_score": "1"
        },
        {
            "review_text": "Cloudbuilt is fantastic. After completing every level, I am still playing it to continue the experience. Each level has several paths to the next checkpoint, some have spots that can be exploited which can help the player if they keep getting stuck.   The story is beautifully made, and really does pull you in, however if you are only playing it for the parkour style gameplay, it is easily skipped.   This game is definitely worth getting, and I would recommend it to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "I really am liking this game so far the artwork is really nice and it has a great soundtrack, if you would like to see this game in action i have created a video of a quickplay for my gaming channel on YouTube, you can watch it below.          YouTube™ Video:  Quickplay - CloudBuilt.&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Amazing pakourish game where you have a jetpack/jumppack with a limited amount of energy and you are trying to complete amazingly designed levels. The graphics are pretty cool and sorta look like someone drew everything",
            "review_score": "1"
        },
        {
            "review_text": "this game is not for me, its hard... REAL HARD. Be warned, you will die a lot",
            "review_score": "1"
        },
        {
            "review_text": "Game is not for the impatient. Beautiful graphics are almost lost on you as you speed past everything, this game may need a 'twitchy' tag.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome game, seems to be one of the games that attemps a parkour-ish gameplay and does it well. Along with a good story of piecing back the memory of the protagonist.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. It is definitely not perfect, and definitely gets very hard to the point where i couldn't finish it, however for the 3 dollars i spent to get it when it was one sale, it is definitely an awesome game. i'm not saying pay 20 for it, but if you want to so be it. I am saying though it is a great game for anyone's collection, especially if it is on sale for a reasonable or extra reasonable price like when I bought it.   Great artistic value and music in my opinion as well as themes that I enjoy, such as sci fi technology and abilites in a futuristic world setting without the 'story' getting too convoluted. It may seem weird to some people, but for me, sometimes less is more in a story sense. What I mean by this is you are given information about various situations without all of the burdensom luggage or character development or even story development itself, so you are left to fill in the holes in your mind and really just make it be whatever you want it to be. I understand this probably doesn't work for some people, but to me it really gives room to let a game become your own rather you being force fed who a character is, how they think, what they are, what they do, etc. It's almost like when you're a kid and you have your G.I. Joe's or whatever. you decide if they are good or bad, how they think, their back story etc and it can be quite fun if you are in that mode where you still have some imagination left.   I realize this review may not make a lot of sense and really didn't break down the mechanics of the game, the pros and cons, and many other factors but in reality for me, a game can be more than those things and that's what cloud built is for me.   tl dr cloudbuilt really is a nice game about speeding through a science fiction world in the sky with a cyborg girl and her jetpack / jet boots while avoiding malicious drones, mines, and various other obstacles. it's like ninja warrior except you're in a coma and the course is in your mind... and im not sure if there is a prize because it gets hard and i got stuck but yeah...buy this game  when it's on sale",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game.  pro:  -story -fast paced -difficult to master, easy to clear -skillbased -awesome level design  con: -no level editor  This game is awesome, i hope there will be a level-editor and maybe a multiplayer ala Trackmania (where you see each other but can't interact) via DLC or addon or patch. This game, to me is worth the full price, now that it is -75% off you should definitly get it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome :) I've been looking for a game that has some soul and artistic character in it for a long time, combined with sweet gameplay, and this game has all this. If you want a manufacured, soulless piece of recycled crap, buy another game. But if you want something a bit more original and with all the soul of Joe Bonomassa's guitar playing, then pick this up. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. It is definitely not perfect, and definitely gets very hard to the point where i couldn't finish it, however for the 3 dollars i spent to get it when it was one sale, it is definitely an awesome game. i'm not saying pay 20 for it, but if you want to so be it. I am saying though it is a great game for anyone's collection, especially if it is on sale for a reasonable or extra reasonable price like when I bought it.   Great artistic value and music in my opinion as well as themes that I enjoy, such as sci fi technology and abilites in a futuristic world setting without the 'story' getting too convoluted. It may seem weird to some people, but for me, sometimes less is more in a story sense. What I mean by this is you are given information about various situations without all of the burdensom luggage or character development or even story development itself, so you are left to fill in the holes in your mind and really just make it be whatever you want it to be. I understand this probably doesn't work for some people, but to me it really gives room to let a game become your own rather you being force fed who a character is, how they think, what they are, what they do, etc. It's almost like when you're a kid and you have your G.I. Joe's or whatever. you decide if they are good or bad, how they think, their back story etc and it can be quite fun if you are in that mode where you still have some imagination left.   I realize this review may not make a lot of sense and really didn't break down the mechanics of the game, the pros and cons, and many other factors but in reality for me, a game can be more than those things and that's what cloud built is for me.   tl dr cloudbuilt really is a nice game about speeding through a science fiction world in the sky with a cyborg girl and her jetpack / jet boots while avoiding malicious drones, mines, and various other obstacles. it's like ninja warrior except you're in a coma and the course is in your mind... and im not sure if there is a prize because it gets hard and i got stuck but yeah...buy this game  when it's on sale",
            "review_score": "1"
        },
        {
            "review_text": "Cloudbuilt has done for me what only few other games have managed to do. The graphics are good, they paint that dream-like world quite well with an anime-esque spin. The story was surprisingly in-depth despite not really being the focus of the game, I still found myself becoming fond of the well-voiced Demi and her thoughts on her situation. The gameplay itself is tight and responsive, as you'd expect/require it to be considering how punishing this game is to tiny mistakes.   When I first started playing I didn't think I'd be able to achieve what I intended, as in games similar to this I always set my goal for the best ranks on each level. Everytime I failed it was frustrating, and I only had myself to blame as the game requires pin-point precision and the ability to think incredibly quickly while under pressure. I kept trying though, and I got better. Before I knew it I was performing manoeuvres I didn't think were possible at first - getting crazy air and speed with different techniques that I picked up along the way - as the game doesn't explain how everything works.   Cloudbuilt will beat you down repeatedly until you adapt to it's steep learning curve, but once you do the reward is great in satisfaction and all that self-loathing you had for yourself during your failures will be rectified :P. I recommend this game to anyone with a taste for speed, punishment and the patience to become better at something. 10/10, would hate self again.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, but I have to recommend it lightly. The parkour in this game is built beautifully, with mechanics that only add to the maneuverability. It also keeps in mind to have different paths so that you aren't forced to follow a linear track. The problem, I discovered, is later on in the game it relies too much on enemies and bullets standing in your way than that of difficult jumps and manuevers. I found myself stopping to deal with absurd amounts of bullets and mines than enjoying the fast pace movement I bought the game for. The addition of a health bar and gun was, in my opinion, a sad and disappointing choice for this game. I found myself feeling like I had less of a challenge I wanted to overcome and more of an annoyance I wish I could just bypass. If you want to buy this game, I just warn you the parkour aspect dies out eventually, and it almost become a first person shooter with a parkour aspect. However, this can easily be bypassed through the use of the steam workshop which allows people to craft their own levels. This means you can find an endless amount of good difficult challenges without the ♥♥♥♥♥♥♥t. So I do have to recommend this game for the amazing gameplay mechanics it has, despite the disappointing irritation.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, it has a great soundtrack, with lots of intruiging and unique levels. If you enjoy platformers and parkour, then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy many different kinds of games and play them to enjoy what makes them fun and different. Cloudbuilt is very unique and I enjoy all that makes it special. If you want a game that takes skill and practice to achieve the quickest time this could be your calling.  ",
            "review_score": "1"
        },
        {
            "review_text": "I really am liking this game so far the artwork is really nice and it has a great soundtrack, if you would like to see this game in action i have created a video of a quickplay for my gaming channel on YouTube, you can watch it below.          YouTube™ Video:  Quickplay - CloudBuilt.&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Let me preface this review by saying I don't think Cloudbuilt is a bad game. Unfortunately Valve only allows 'Recommended' or 'Not Recommended' on their review ratings. Admittedly it's better than when they only allowed thumbs up at least. But unfortunately on games I have mixed feelings on I cannot recommend them to my friends or otherwise.  Anyway, Cloudbuilt is an extremely niche game clearly built for an audience and one audience alone; speedrunners. While that focus helped make it carve out a unique character to its gameplay, its sole emphasis on that has harmed it overall for other players of the game. A lot of the levels feel like they absolutely require memorization in order to do fluidly. The controls are kind of poor as well; with more attention they would have been much, much better. Again, despite the paragraphs below complaining about flaws, I don't feel that this is a bad game. When you're not dealing with issues the game is fast-paced, challenging and extremely fun, playing much like you see in the trailer.  Since the controls are my main problem with the game I'll go over these first. The controls do work, but they FEEL clunky. At least part of this is the length of the game to learning curve ratio. The game is only about 2 hours long to the end, and you can beat most of the side missions in 3 hours. Much of that time the player will likely getting used to little nuances with the controls that are not immediately obvious from the tutorial though, like figuring out that you can air control like in a 2004 game where back instantly stops you. Mixed in is some legitimate clunk too. An example: One of the gifs on the community page right now is the triple slide section from one of the more difficult levels. There is a similar section on another level that ends with you hitting a vertical wall, boosting up the top, wallrunning along the side, then up and around again all the way to the exit. The player only gets a limited amount of boost to do maneuvers like that so losing as little momentum and using the minimal amount of energy is the key to success. Unfortunately the input from the jump off the last slide to the wall is extremely unforgiving. Why? There is no slack at all in the controls. If you hit the boost button even a split second before you've made firm contact with the wall, you will instead boost into it, which will result in you smacking into it, flipping around, then sliding off to your death. In the end what you have to do is rely on visual confirmation that you're in the correct pose before you can boost up which is inefficient and waste momentum/energy. This is really the number one issue with the controls. They already have a pretty decent learning curve in proportion to the length of the game, but this one mostly likely everyone will struggle with on and on because it feels very unnatural and unconventional compared to most games. It's funny because the game has 4 or 5 checkboxes under gameplay options for changing the behavior of how wallruns work, but none to deal with this issue. The fact that those options they put in are even needed should be a red flag right there that wallruns should either be fixed or redesigned.   The other big problem with this game is level design. Memorization is required in several places, period. You are not getting past certain parts on your first try. Stuff like running through a bunch of explosions only to find a force field you need to charge shot, going through a long wallrunning section only to find a force field in your face are quite common later on. The number of times I did a wallclimb only to be smacked by an obstacle was rather enormous. Reflexes can't deal with these things and a lot of the times you have to already know what you're going to do before you do it. There's also a particular chaser enemy that has a force field and will blow up in your face, usually knocking you to your death. Just to give you more time pressure when you already don't know where to go, of course. Things like this are okay on paper but when it comes to playing through a level the first time it is incredibly obnoxious and frustrating. Part of the issue is the pink forcefield things can at times be extremely difficult to see in the air.  On the subject of enemies, I'm not really sure they really add much value to the game at all. In my opinion a lot of the fun vanished as more and more enemies were added to the levels. Only the new/bad players will be affected by the homing missile guys, the regular turrets are worthless, the melee shocker guys on the paths and the wide shooting turrets are the only real threats. Those two have a point in being in the others notsomuch. Eventually the stages start to get chock full of them and they get a bit tedious to avoid. And you have to avoid them because you have a lifebar, which is another thing that puzzles me. You have a lifebar and limited lives. You'd think the main purpose of the enemies would be just to knock you off but apparently not. And lives... fail enough and restart the level... I'd generally only get stuck on one spot on most levels so this just makes it if you get stuck too long there you have to redo the whole thing. I don't see why there are lives other than the simply fact that video games have lives and thus this game needs them too. I mean, Super Meat Boy didn't have lives...  Even with these issues the game generally works and is overall quite a fun experience if you're good enough to play it. I'm not usually a terrible fan of celshading but the game does it well enough and the music fits. Again though, it's clearly targeted at speedrunning and speedrunning alone; it took about two hours for a pleb like me to beat the game and a bunch of the side stages if that's all you're interested in. But in the process of beating it I got maybe one B and the rest were Cs or Ds. If you're the kind of person that likes to get S ranks on everything, this game is probably for you. Of course it ain't easy; said Cs were also around rank 500 on the scoreboard for many of my runs. Game is interesting, but it just needed better execution. Looks like the developers aren't going to be making any sweeping changes at this point, so I'm hoping if they make a sequel it addresses the issues I had with the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I had seen a few reviews and watched some gameplays and the game seemed to be awesome. Fast paced action, yeah. It was on a sale, so I decided to give it a try. I've played the game for 5 minutes. From the very moment it started and I've realized how camera motion worked, I knew I had made a bad business buying this. It hurts my eyes so badly and makes me feel so nauseous... just like the old school FPS games (Wolfenstein, Quake, Doom) and sometimes a few newer ones like Badlands, especially the first installment. Horrendous camera, I couldn't wait to stop playing just to write this review to prevent people with very sensitive eyesight and those who suffer from motion sickness or labyrinthitis from buying it. I even wanted to know what happens next the tutorial level, but I can't handle it. Feels like torture.",
            "review_score": "-1"
        },
        {
            "review_text": "Seemed to have promise. Sloppy controls, oddly placed enemies(that stop progress/the speedrun), and an endless narrative that seems more content to repeat its mindless exposition than progress the story forward. I wish I listened to the other reviews, but I figured I knew better, being an experienced speed runner. This game is a chore to play, and I am very grateful that I paid three dollars for it, instead of the fullprice of $20.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was really fun! Until the levels got impossable. And it got too hard way too fast. About 15 levels into it, its way too hard for anyone to beat. It was extreamely disappointing because i was having so much fun with it before the developers implemented unreal expectations. You can spend hours on a single level and never pass it. This game sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "A nice idea, marred by badly tuned difficulty and finicky controls.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has alot of cool idea which are done with awful controls that make you want to smash your computer. The platforming is cool to look at since climbing it is impossible with the camera shots and the controls. Dont worry though you have a mega buster which is awful to aim and doesn't really hurt the enemies. All in all this game is not what it wants to be which is a platforming speed runner dream. Its a mixture of all of the platforming worse aspects like not being able to see where your supposed to go or jump on the wall correctly. This game is not worth my time to finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "this games crap and totally not worth the 20 dollars its offered for. so glad i ONLY wasted three bucks or id have felt robbed",
            "review_score": "-1"
        },
        {
            "review_text": "Game is fun but the controls are total ♥♥♥♥. Mouse sensitivity is completely ♥♥♥♥ed, playing with sensitivity higher than 10 makes you seizure from the slightest movement. Character controls are non-intuitive and badly designed.  Default control layouts are complete ♥♥♥♥ aswell, i strongly suggest rebinding shoot to space jump to left click and dash to right click. If you have a multiubutton mouse bind drop to a thumb button.   Level layout is non-intuitve and badly designed, gameplay does not flow smoothly from speedrunning to enemy fighting as you're forced to stop charge your weapon kill some ♥♥♥♥♥ and continue. It does not mix in seemlessly.  In summary there are a ♥♥♥♥tonne of minor issues that heavily impact the playability of this game, its still a WIP so there is room for improvement as usual. In its current state.  I do not recommend this game in its current state the terrible keyboard controls gave me cancer and my hands fell off.",
            "review_score": "-1"
        },
        {
            "review_text": "Im very sorry to say this game is actually very bad... It's a huge bummer considering the game looks very beautiful, has beautiful music, and beautiful models, but the gameplay is just horrendous...  I bought it with huge expectations, but this game has let me down, after just a few hours of playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Needs more gradual difficulty slope.",
            "review_score": "-1"
        }
    ]
}