{
    "app_id": 262470,
    "name": "Rollers of the Realm",
    "release_date": "2014-11-18",
    "developer": [
        "Phantom Compass"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Pinball",
        "RPG",
        "Puzzle"
    ],
    "achievements": 32,
    "positive_ratings": 442,
    "negative_ratings": 48,
    "price": 6.99,
    "description": "Imagined and brought to life by indie developer Phantom Compass, Rollers of the Realm is set in an era of medieval lands, corrupt kings, and castles of yore with a twist: bounce on and attack enemies as a pinball! Your characters are the balls—meeting new characters will unlock new sets of equipment and abilities.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262470/header.jpg?t=1554202870",
    "minimum_requirements": "OS: Windows Vista Processor: Intel Core 2 Duo @ 1.8GHz (or equivalent) Memory: 2 GB RAM Graphics: NVIDIA GeForce 7600 GT (or equivalent) DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core 2 Quad @ 2.3GHz (or equivalent) Memory: 3 GB RAM Graphics: NVIDIA GeForce GTX 260 (or equivalent) DirectX: Version 10 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "If you've ever wondered what a combination of pinball and an RPG would look like, the way I see it you have two options: play this game, or track down a copy of Pinball Quest for the NES. Now, that said, this game has an interesting combination of pinball gameplay (it IS a pinball game, after all), RPG elements (like experience points, special abilities, different characters, and new gear), and puzzles (like figuring out how to get to certain areas of a given pinball table/level. As far as I can tell (I'm just about an hour in right now), the storyline is pretty much stock fantasy, but I wouldn't come to a game like this looking for complex moral judgements and deep allegories for our time. The characters are all fully voiced, and the acting is pretty good. The character art is fantastic. The level designs are easy on the eyes as well. Considering the price vs. the amount of fun to be had in this game, Rollers of the Realm is a pretty good buy.  On another note, I'm finding the gameplay somewhat reminiscent of Wizorb - if you've played this game, RotR is probably right up your alley as well.",
            "review_score": "1"
        },
        {
            "review_text": "Short story, but otherwise a great game to get. Pinball and RPG together couldn't get any better than this.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, but wow is there a gigantic difficulty spike at the very end. They've added a checkpointing system to alleviate it, but the last boss is just  insane  compared to the rest of the game.  See, for most levels you're able to use any of your characters, because they all have different uses. In the last stage though, there's a series of three different levels, each with three boss enemies - and only  one  of your characters is capable of dealing significant damage to them.   For the first two bosses, that's fine; you just clear out the board a bit, then pull out the special character and poke them until they die. If your special character dies, it's no big deal; you can just gather mana with someone else and revive them. It's not fast, but you make consistent progress.   For the third boss, though, you just can't  do  that. This boss has two special attacks: he does something which causes a lot of damage, and he does something else that drains your mana.   This means that instead of the normal repertoire of six or seven characters, you've only got three that matter: the healer, who restores your health; the ranger, who is immune to mana drain; and the special character, who's the only one that can significantly hurt the boss.   If any one of those three dies, you're boned. Healer's gone? Well, you're going to take a lot of damage, which means you're more likely to lose another character. Special character dies? Now you're playing catchup, because the person who does the next-highest damage to the boss deals 1/5th the damage. Ranger dies? You might as well give up. You're going to have a really hard time building up enough mana to restore another character, because there's no mana charms on this stage and to reach the mana gathering spots you need to go around the boss.  And going anywhere  near  the boss is super dangerous - if you ever make the mistake of hitting him head on, he smacks your character with a friggin Chaos Dunk and they go flying straight into the middle gutter. It's really, really hard to recover from that.   Overall though, this is a great game - it's just a pity the difficulty went from Super Mario World to Dark Souls over the course of one boss.",
            "review_score": "1"
        },
        {
            "review_text": " Imagine pinball with an epic story line",
            "review_score": "1"
        },
        {
            "review_text": "If you like pinball you will probably enjoy this game as it puts an interesting twist on the classic experience.  Whereas a normal pinball machine gives you so many tries with one ball, this game gives you one try per ball. The kicker being each ball is a character complete with stats and abilities that really change the game up. Some new characters are recruited through story progression whilst others can be purchased with gold earned in the game's stages. Upgrades for each character can be purchased by earning gold in each stage or through the skill necessary to unlock the games many treasure chests.  Honestly I had given up on this game for a long time and I had seen many reviews talking about the difficulty. It used to be very brutal and I see how this can be a rage quit game. Yet with the release of the ability to change the difficulty between challenging and casual I'm giving it the thumbs up. Stuck on a level? Drop the difficulty down. Raise it up on the next level and you will probably be able to pass it.   Either way. Dogs/hawks and wolves, 7/10",
            "review_score": "1"
        },
        {
            "review_text": "It's not quite the best pinball simulation, but the mix of RPG elements and pinball mostly (but not entirely) works. It is an interesting attempt to push the quest, in all 1980s pinball games on, to build a narrative layer around one of the most quirky of ludic controls. However, the party size could have been smaller (just four balls to choose from would have made the most sense) and the level variety could have been better.",
            "review_score": "1"
        },
        {
            "review_text": "I hope you like pinball, because that's what this game is. But instead of the standard bouncing off bumpers and hitting targets, you will be bouncing off the scenery, hitting enemies and plundering loot.  What could be just a cute skin on a pinball game turns out to be rather more than that though. For one thing the levels are a lot less complex than what many newer pinball games are like, but what it lacks in complexity it makes up for in variety. Throughout the game you'll be traversing 'tables' on the theme of caves, castles, forests and cities. Sometimes even multiple things in the same table with some nifty transitions.  The different characters are different balls, instead of being just a reskin though, they differ in abilities. The knight is a larger than regular ball, but he does a good deal of damage to enemies and obstacles he hits. The rogue however does very little damage (unless you manage to hit from behind of course), but is very agile. Agility is handled in game by being able to veer the ball left or right. The agility score of a character determines how effective this is. You can actually roll the rogue up slopes after some upgrades if you really want to.  I've mentioned combat a few times now, and that's because most of the levels will focus on either hitting an objective or two, or killing all the enemies before proceeding. Apart from being able to knock your ball away, enemies can also damage your flippers, causing them to grow shorter and shorter if you let damage stack up. Some characters will be able to heal them however. This means you'll be trying to find the right character to attack with, and swapping to a healer once in a while when your flippers are getting dangerously short.  Swapping characters is as simple as holding a ball in one of your main flippers and pressing the swap key to cycle through your available characters. Should a character die (down the drain marked by a skull), you'll have to play with another one until you've gathered up enough mana to resurrect a characters. There's a good deal of them, and yet in the later levels I've found death coming so swift I've had to restart a map on more than one occasion.  The storyline of the game is nothing too impressive, but they've managed to at least give a sense of purpose to why you're in the map you are, and why you must achieve the goal of the map. Generally they're well voice acted, though one or two characters have had a few lines which felt not quite as well acted.  My biggest problem/gripe with the game going in was that it looked to be rather short, packing in 6 chapters (unless this 'final chapter' is a ruse and there's a bunch more). Regardless I've enjoyed the time I've played the game, and at €10 it's hard to expect more. This is a game I could see myself buying expansion DLC for if it became available.  Pros: * Rather unique, not many other games have mixed pinball with combat and quests in this way * Good looking colourful graphics. * Runs well, I've yet to encounter any actually problematic technical issues, even on my modest notebook. (edit: It seems some integrated graphics chips has some texture issues, my system running throttled at 1ghz dual core and intel HD 4000 worked smoothly) * Controls well, what with the agility and the amount of flippers on the tables and fairly good physics, you rarely feel you're losing because of sloppy controls or bad physics. * It's cheap, always a good thing  Cons: * Nearing the end combat might feel like it's getting a bit repetetive * Length, it doesn't seem like the longest of games, but for the price it doesn't feel too short either.",
            "review_score": "1"
        },
        {
            "review_text": "How did this game come to be?? A combination of old-school pinball mechanics and a classic adventure story, polished with modern RPG sensibilities? Such a quirky, fun, mutant of a game was never meant to exist!  And yet it does. I'm not sure if I should thank Phantom Compass for creating something this weirdly unique, or Atlus for picking yet another strange-but-awesome game to publish. Seriously, trying to develop/publish something this unique must've taken a lot of balls... so it's a good thing that Rollers of the Realm has a lot to spare.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely NOT what I expetcted. This RPG-Pinball game is the best possible combination of the genres. I personally don't like pinball games very much, but the abilities of the balls (characters) compensate for the 'luck' element in pinball. Instead of 'tilt' there is a no-penulty ability to influence your balls slightly left or right. How easy this is to do is based on the agility stat. Different balls are good for different jobs, and you can switch when the ball is resting on a flipper.  The maps are great, well designed screens that are pinball tables that look like - well not like a table but rather a scene suited to the story.  This really is an example of a well thought out game. I can see how this could have been horribly bad if it wasn't so well executed. Give this game a go, you wont be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "PRO TIP: RECRUIT THE FARM BOY BEFORE OTHER HIRED HANDS, YOU WILL NEED HIM.  This title is quite daring, and largely succeeds in what it sets out to do. Combining pinball and RPG has never worked this well before, and it delivers gameplay that feels engaging and just honestly fun. Physics are a bit skewed, but you quickly learn to work with them. Graphics are stylish and overall very good, while the music is fitting and the voice acting is passable. There is quite a little bit of story going on during the campaign, and while simple, the characters make it enjoyable.  As far as length goes, you can probably finish the main quest in circa 5 hours, but to really experience all that the game can offer, the time would be around 10-15 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute game, well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "I would not recommend this game to anyone that is used to playing pinball games such as Zen Pinball, or any 'classic' RPG style pinball tables such as Pokemon Pinball, Sonic Spinball, etc. .   While this game tries to capture the spirit of previous games in the genre it completely fails to do so. Let's begin with some of the positives. It has some good voice acting, and an interesting design overall. Who wouldn't be stoked for an RPG pinball game? The RPG elements are incorporated into the playfields (more on that in a moment), and the idea is interesting.  I don't believe the execution was very good however. To begin with the most glaring issue, the controller support is awful, and feels terrible. A patch was issued so that some players not using Xbox style controllers could even play, but even with my 360 and Xbox one controller it still plays poorly. The menus feel horrible with a controller, there is no 'dead' zone, so the selection is bouncing all over the screen. On top of this there is a mechanic where you can select party members once in the game. This mechanic again suffers from the lack of dead zone. So you're trying to swap characters with a quick flick on the stick, and you just keep bypassing them in the list, hoping that you'll make it there eventually. There are also unbound keys by default, so only the flippers and launcher/special ability button work on a controller. Consumables cannot be used straight out of the box.  Once you get past the less than stellar controls, there are the mechanics themselves. You have some control over the ball when it is moving in regards to shifting its motion left or right. This is not done via bumping the table, but direct control on the ball which was extremely odd to me. After getting to the third area I've realized why they did this, and it's the biggest failing of the game. Almost every single level turns into a shooting gallery where you are attacking characters that stand in the middle of the playfield. There are three main types I've encountered: Guys that throw things/shoot arrows at your flippers, guys with shields you can only hit from behind, and guys with swords (sometimes with large healthbars), that try to knock your ball out. I wouldn't mind this if it wasn't the main mechanic for all but a few scant bonus levels but it happens all the time, and sometimes there are multiple waves of these enemies. It turns into 'get up around the side, try to cheese it by bouncing around on top of a guy using ball control, hope you do enough damage to kill them'. It's a poor design decision that leads me to believe they were unable to come up with more unique mechanics and tables that would enable such mechanics.  This frustration and boredom of the tables continues due to the size of most tables, they're very small, sometimes there are a few screens worth of areas, but often times those sections repeat mechanics. Additionally there are issues where special character abilities don't work, for example the knight character can block the main area between the flippers so you don't drain the ball, but the ball can bounce AROUND this area, and still drain, totally defeating the purpose of his special ability.  When looking at this game in a vacuum it might seem okay, but when you compare the mechanics here against older games in this genre, or even Zen Pinball tables, you can get more bang for your buck with a single table than I've played so far here (almost completed 3/6 chapters).   The physics feel bad and floaty, the tables repeat WAY too many of the same objectives (hit this thing, kill those guys), and it just doesn't feel great, especially with the poor controller support, which to me would have been essential for this sort of game.  I can't recommend Rollers of the Realm even on a sale, if you enjoy pinball you're not going to enjoy this game, it's boring, repetitive, and not challenging in a way that feels rewarding.",
            "review_score": "-1"
        },
        {
            "review_text": "It’s fun for a while but the last stage takes like 1000 hits per bad guy and then you just move on to the next. For the cost I recommend it for a little fun but if you need to finish games you will be annoyed.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth a play through. Quick game to beat and enjoyable levels.",
            "review_score": "1"
        },
        {
            "review_text": "Really good. Nice, simple and fun. Out of the norms",
            "review_score": "1"
        },
        {
            "review_text": "Date: 2/7/16 Review Number: 11 Game: Rollers of the Realm From (Creator Publisher): Phantom Compass Played On: Laptop Steam Price as of Review: $1.99 till 2/12 Total Time played: 30 minutes Review:  Today’s randomized little misfit is the game Rollers of the Realm by Phantom Compass. Now, given the title, brief half glimpses of screenshots and the icon (which is usually all I get with these games, by the way) I had assumed I would play an hour in a typical indie RPG game of some sort. I was somewhat taken aback by the fact that this game is, indeed, and RPG, but instead of the typical RPG format, it is a digital pinball game.   Now let me give you a few facts first. One: I am actually rather fond of pinball. One of my side projects is a decent sized digital pinball machine, flipper buttons and plunger and all, which has gone through at least two full wood revisions. Two: I am actually rather fond of most RPGs. I am actually planning to buy a next gen console solely for being able to play Kingdom Hearts 3 (no shame) and if you look at my play history, the amount of time I have spent playing Tales of Maj’Eyal far outstrip most of the other games in my collection.  These things being said, I am rather disappointed to admit that I find this game to be, well just kind of blah. The pinball physics are interesting at times, but mostly are reminiscent of the tiny half size table top pinball machines you see in little kids rooms. The RPG elements add a bit of a twist, but really just serve to try and keep your attention by choosing a different ball at different times, whereas for the most part you can get away with completely avoiding using any of the rpg elements if you have a decent enough skill with the flippers. In the end, neither side of the game are attractive enough to me to be worth putting a lot of time into. I will admit that it at least kept my interest long enough that I didn’t feel I had to slog through the minimum 30 minutes, but beyond that, I just can’t recommend this.  Game’s Fate: I like pinball, but nope. gone. Its nice, but not worth the HD space right now Buy/No Buy: If you like pinball, especially digital pinball, maybe. especially while its on sale, but at the 10 bucks it usually goes for? nah.  Personal note: also, apologies for my shame. Not even two weeks in and I missed a review day. Though admittedly I missed it to go see Metallica in concert, so not too upset about it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a test review.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic pinball game that's not always 'pinball', but that's what sets it apart from other pinball games. From 'stealing' from townsfolk in a city, to 'escaping' through sewers, and even 'exploring' tombs, the game spans a large landscape. With this, you're not getting a 'few' pinball tables, but rather a grand collection of tables that span an entire adventure. Other pinball devs are asking the same amount for a handful of tables (which are also very good), but for the same amount, these devs are giving you a grand adventure. I miss you NES Pinball Quest.  If you love pinball games, just buy it!",
            "review_score": "1"
        },
        {
            "review_text": "a world fill with wizards, knight, and a guy with an indian accent.",
            "review_score": "1"
        },
        {
            "review_text": "The keyboard controls could take a bit of geting used to for anyone not used to using multiple keys like in many MMO's. I haven't tried the controller yet. I might be more fitting. The story seems interesting. All in all, I like what I'm seeing so far.",
            "review_score": "1"
        },
        {
            "review_text": "Say what? A pinball RPG? Yessir! And it's fun too. The heroes are represented by pinballs. Each has its own characteristics, some are big, slow but strong, and others small and quick. Same have ranged attacks (ever seen a pinball shoot arrows all around the place? now you can!). The enemies can damage the flippers, but there's a healer that can heal them - and raise the dead heroes. Heroes die when you sink their pinball. Of course, you should collect gold to spend in the shop and open treasure chests for even more gold or magic items.",
            "review_score": "1"
        },
        {
            "review_text": "Only played for a few minutes - but thumbs up - not bad for a kick around! Worth the money on the summer sale",
            "review_score": "1"
        },
        {
            "review_text": "After recovering from the first 'WTF? I don't even...' and buying this game just to see what it is like since the screenshots seemed nice, I was pleasantly greeted by some nice voice acting and presentation, and inmediately entertained when I started playing this well-crafted game.  I tip my hat to the devs who got the balls (pun intended) to mix two genres as disparate as pinball and RPGs with such taste.  It is however beyond me, how the game manages to remove most of the fun in the later stages, when the gameplay forces you into an either boringly defensive gameplay, punishing you with not being able to use the skills you spent the whole game building up if you ever miss a hit. This leads to some frustration as it artificially prevents using certain playstyles which also happen to be where the most fun is.",
            "review_score": "1"
        },
        {
            "review_text": "Great little pinball game with RPG elements and a story, what a unique combination! 8/10! The physics actually works really well, the different characters have a different ball weight, and play quite different... there are quite some mission with secret treasure... and the story is quite entertaining. There is also a challenge mode where you need to get as much points in either 5 lives or be as fast as possible to reach a goal, with 3 achievements each... quite challenging! Was well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A bizarre concept in theory that works spectacularly well in practice.  Without a doubt, I recommend this game, likely even at full price.  The pinball mechanics are quite responsive, probably about two notches better than the level of frustration you'd experience playing real (or a more realistic digital equivalent of) pinball.  The RPG mechanics reveal themselves in the balls. Every character is a ball, and they have stats such as size, agility, and damage, along with a mana-activated special ability. This gives you a nice variety of tools to work with on most levels and provides some varying avenues of victory, which is always nice.  The look of the game is enjoyable, and it has a decent story without taking itself too seriously.  Again, I highly recommend this game, especially if you have even a passing interest in pinball games.",
            "review_score": "1"
        },
        {
            "review_text": "'I May be DRUNK, but I'll take that bet! Wait whut? Pinball and RPG? FINE! Ain't NOBODY gonna tell me I can't make fusion stranger than Mexi-Asian!'  This is how I imagine this game was conceptualized. At a bar, at 3am, between two frat guys daring each other to dumber and dumber crap with each shot of whiskey they pour down their throats.   And its pure GOLD!!   This game is a labor of love from a group of dedicated designers. Everything from the mechanics to the voice acting is spot on. The story and RPG elements are a bit simplified from those of true RPGs like Skyrim, but thats to be expected... the more basic elements help keep the game flowing and not drawing everything to a halt between each round of Silver Ballin'.   The Devs on this obviously worked hard to polish something that quite frankly shouldn't exist- It would be hard for you to find two more disparate genres to force together, but they managed it well and made it succeed extremely well. This could be the benchmark for a whole new type of game.  My only Con is that it's far to short- really hoping for an announcement about DLC's or a RotR2!",
            "review_score": "1"
        },
        {
            "review_text": "If you like Pinball Quest for the NES, you'll certainly love this game. In short, you have to attack enemies with your pinball, and the enemies will attack your flipper making it shorter. There are multiple balls that can be swapped out, each has special abillities (healer heals your flippers restoring their length. knight deals the most damage but is hard to move about. Rogue steals money, etc.)  The game is fun. It has a good story. The only con is the infinitely-respawning vermin in the game can get really annoying, especially if your hunter is dead.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I nice change to the usual HnS (Hack and Slash).  Fun, funny and easy enough to play and like real pinball fustrating at times. The real challange comes with the obstacles and your character balls, you definately need to have some dexterity in your fingers for this game.  A great little twist in gaming, and a worthy recommendation for a collection.  -Universal Gamer",
            "review_score": "1"
        }
    ]
}