{
    "app_id": 262590,
    "name": "Chuck's Challenge 3D",
    "release_date": "2014-02-28",
    "developer": [
        "Niffler Ltd."
    ],
    "publisher": [
        "Nkidu Games Inc.",
        "Niffler Ltd."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Sokoban"
    ],
    "achievements": 28,
    "positive_ratings": 146,
    "negative_ratings": 23,
    "price": 2.89,
    "description": "From the design veteran behind the classic game Chip's Challenge, comes Chuck’s Challenge 3D, a fiendishly addictive game that’s packed with features that will tease the brain and challenge the fingers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262590/header.jpg?t=1462724140",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Intel Core 2 Duo 2.0Ghz or equivalent Memory: 2 GB RAM Graphics: Intel Core HD Graphics 4000, NVIDIA 8800 GT, ATI Radeon HD 4850 or better DirectX: Version 9.0 Storage: 400 MB available space Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 7, Windows 8, Windows 10 Processor: Intel Core i5 2.8Ghz or equivalent Memory: 4 GB RAM Graphics: NVIDIA GeForce 450, AMD Radeon HD 5670 or better DirectX: Version 9.0 Network: Broadband Internet connection Storage: 400 MB available space Sound Card: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "The follow-up to Chip's Challenge for the Atari Lynx and Windows 3.1. You can tell it was optimized for things like iOS and Android, but this is still a worthwhile follow-up to the original tile-based puzzler.  I must mention: The menus, the characters, and the levels elements are like an oversized dollop of cottage cheese: big and chunky. Plus the navigation of menus is just odd, where you use the mouse like you would a finger on a touchscreen. But PC optimization issues aside, it's your job to solve the puzzles as Woop. And yeah, he's no Chip, but the little bugger does have charm, I'll give him that.  As for the gameplay, well, it's Chip's Challenge 2.0, and that's precisely why I threw my money at the screen in the first place. If you're not familiar with that game, it's a tile-based Sokoban-like game where you have an area filled with locked doors and hazards, and it’s your goal to collect the required items before exiting the level. For the most part, it's the same game with new puzzles and a new look. Like, you're not collecting chips here, but little glowing blue things, and the enemies look totally different. But a lot of the puzzle elements are the same, like water, fire, ice, moving floors, etc. And you still have the same types of power-ups that let you circumvent these hazards where appropriate. There are five sets of levels to complete with 25 levels each, but the first selection more or less follows the rules of the original game. When you move beyond those, the game really starts to open up into its own thing, with a slew of new enemies, hazards, and puzzle components. It never has to give you a dumb tutorial either, since the rules of upcoming levels are clearly laid out for you with an easier level earlier on. But don't let the first set of levels fool you, this game can be just as brutal as its predecessor.  Well sort of. It's a bit easier as well, with the ability to take back any number of moves at any time. This means you don't necessarily have to restart the entire level if you screw up, so no bummers here. Time keeps ticking while you do this, but it's far less rage-inducing to make a stupid mistake now. It even asks you if you want to skip a level if you suck to the point of shaming your ancestors. The levels are also far smaller than many of those in Chip's Challenge, and I assume this is because of the time and screen size constraints of the mobile version. And when you finish off or rage quit the main game, there's a fully-featured, easy-to-use level editor. You can upload your own or download other people's creations right from within the game. Oh and you can apparently get hats, because freaking hats man, why developers haven't shoehorned them into every game already is beyond me.  Personally, I find Chuck's Challenge to be a perfectly adequate successor to Chip's Challenge. It's more of the same kind of logical puzzle-solving with only a few concessions made for mobile platforms and slightly more forgiving gameplay. But even with a few iffy changes, if you enjoyed the original game or just enjoy these types of logic games, I'd give this one a look.",
            "review_score": "1"
        },
        {
            "review_text": "A modern-day version of Chip's Challenge (or its spiritual relative for early 1990s Macintosh computers, Blobbo) has been something I've wanted for quite many years. It's not a Chip's Challenge redux, but it definitely has the same spirit - bringing in 50% entertainment and 50% frustration (after all, I never even played through Chip's Challenge since it got too... brainy ... for me &gt;_&gt;). A bit too cutesy at times and some of the sound effects can get quite bothersome after trying to beat a level after multiple attempts. Great music, though! Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great update to a classic game, Chip\\'s Challenge, that has been around a few decades and earned the praise of many. If you enjoy solving puzzles, then try this out. The levels included I would call \\'easy\\' to \\'moderate\\' in difficulty, whereas \\'hard\\' would be more like DROD or Snakebird.   CC really brings the joy. There\\'s a huge number of game elements here, and a fun thing is seeing how they interact together. For example, a level can be constructed to be like a factory with monsters pushing buttons in an automated way to open and close doors.  The game includes a nice level editor that is easy to use, and the player community has already contributed many good levels. It\\'s easy to imagine spending hundreds of hours on it, once you get into the habit of playing the new levels that get released on a regular basis.",
            "review_score": "1"
        },
        {
            "review_text": "I played Chuck's Challenge quite a lot when I was younger. This was a nice little blast from the past. I found myself in a situation where I was still amused by these kinds of puzzles. The developer sure succeeded in making the new set of mechanics work and making the whole thing look beautiful.  While the game does a poor job of explaining what it is you're picking up through the ( slightly redundant, yet quite funny ) story sequences, I don't think anyone will have a hard time figuring it out on the go.   I'd also like to mention that there's absolutely no lack of content here. There are numerous standard levels to play through and there's Steam Workshop levels if you want to keep going after that.  Overall, this is a fun little game that I can use to fill up my spare time and sniff up some nostalgia with.",
            "review_score": "1"
        },
        {
            "review_text": "Chip's Challenge with a worse UI and weird, ugly graphics is still Chip's Challenge.",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game but it is like no testing went into it at all. Very, very buggy. Good puzzles, though. ",
            "review_score": "-1"
        },
        {
            "review_text": "Hmm. This is not going to be an easy one to review. Let me start by saying that I loved Chip's Challenge, have finished it many times and have owned it on about half a dozen different plaforms, and I bought this game solely because of who was behind it.  On the upside, it's very colourful and friendly, the plot is non-existent (seriously, what kind of storyline would make sense with this one?) and the community maps integration means you'll never be short of new levels.  BUT I find the controls very lethargic (apparently that's been worked on), the difficulty curve absolutely insane (about on a par with 'Oh No More Lemmings'), where you have several incredibly easy levels followed by one that'll leave you stumped for days, and the control system was blatantly designed for a touchscreen and has been badly ported to the desktop systems. It's just my opinion but I think compared to Chip there are simply too many different types of keys, doors and monsters and it becomes quite messy and overcomplicated at times. I also dislike the forced integration with the online system which does things like tell you that 634 people completed that level quicker than you. Really? I don't care.  Gah. I normally enjoy writing negative reviews as it's quite cathartic to lay into something which has been annoying you for hours on end, but I don't feel any of that here. I really, really wanted to like Chuck's Challenge 3D.  I really wish I could recommend this game as a worthy successor to Chip's Challenge but unfortunately I can't, due to what I've written above. Hopefully at some point Chuck will get the licensing sorted out and we can have a proper Chip's Challenge 2. This isn't it, sadly. If you want more Chip, go and get a copy of the GPL game Tile World, and one of the community map packs like CCLP2 (if you see a copy of Windows Entertainment Pack 4 or Best of Windows Entertainment Pack, it'll work with the data files from the original game too, and Chuck will hopefully get some royalties). You'll have more fun.  Sorry, Chuck",
            "review_score": "-1"
        },
        {
            "review_text": "I loved the Chip's Challenge games when I was a kid. I was completely addicted to them. So it was with some excitement I found this follow up. However Chuck's Challenge feels overly pitched at young children (when it could be a puzzle game for all ages), and has a whole host of sometimes game-breaking bugs, including wiping my progress so far. Such a disappointment for what should have been an easy follow-up to make!",
            "review_score": "-1"
        },
        {
            "review_text": "Good Game, Horrible Controls...",
            "review_score": "-1"
        },
        {
            "review_text": "not as good as chip's challenge and much uglier but still a hoot",
            "review_score": "1"
        },
        {
            "review_text": "If you, like me, loved the Chip's Challenge games, then you will most likely enjoy this 'iteration' from the same guy. However, be aware of a few things: 1) You have to be online and connected to a server to track progress - this means waiting after every level for your score to be recorded, otherwise the game won't register that you've completed a level. 2) The level design is a lot easier and a lot less varied than it was in the Chip's Challenge games - however, this could be because there is a 'rewind' feature to take you back steps, at the cost of a time penalty, so if you don't mind being marked down the levels become a lot easier. 3) Some levels are lifted almost whole from Chip's Challenge games, others are just Sokoban (way too many Sokoban levels) and a couple seem to be from The Impossible Game? Only a few levels really strike a true 'Chip's Challenge' chord.  So all in all, this is a decent game if picked up cheaply, and the level creation/player levels adds a lot of lifespan. It has its fair share of faults, which is surprising for a game so simplistic.",
            "review_score": "1"
        },
        {
            "review_text": "For a spiritual successor of the classic Chips Challenge game, Chuck's Challenge 3D surpasses the original game by putting in new but familiar assets making the puzzle designs feel more fresh and new. The replay ability on this game is rediculous! with new weekly levels being made 4 or 5 times a mounth for players that have beaten the game. but thats not all! the game gives you a stage builder making you and other peoples levels playable on the Steam Workshop.  This game is a 'remastered' classic that wont be going away anytime soon. Buy this game!!",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game to play well worth the money in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone has that one, first game they played as a kid. Most pople have Mario or Sonic or Zelda, but my first game was Chip's Challenge. Unlike Mario and Sonic, though, there has never really been a followup. I've been craving more Chip's Challenge since the early 90's. I had completely given up hope until I saw this game. I can't tell you how joyful Chuck's Challenge makes me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty decent although it doesn't break any new ground. The gameplay becomes increasingly challenging and there is enough variety to keep me interested. There are plenty of levels which are rated with bronze, silver or gold medals based on the time taken to complete a level. The graphics are colourful and the animations are good enough. The music volume can be adjusted. The audio effects are mildly grating if played for longer periods. The cut-scenes can be quickly skipped and the first stage does have the option of guidance if needed. I can see how this title may appeal to youngsters however there may not be enough to keep everyone entertained. 6.0/10",
            "review_score": "1"
        }
    ]
}