{
    "app_id": 262510,
    "name": "CRIMSON ROOM® DECADE",
    "release_date": "2016-06-09",
    "developer": [
        "Dream Holdings",
        "TAKAGISM Inc."
    ],
    "publisher": [
        "Degica",
        "Dream Holdings"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 16,
    "positive_ratings": 33,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "”I've been here before...&quot; Jean-Jacques Gordot woke up to find himself trapped in a red room. A door that won't open, a hanging light bulb, scattered wine bottles. And for some reason, this room gives him a feeling of deja vu...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262510/header.jpg?t=1477046738",
    "minimum_requirements": "OS: Windows 8.1 32bit Processor: Intel Core i5 or better Memory: 4 GB RAM Graphics: NVIDIA Geforce GTX 570 or better Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is my first time playing a puzzle like mystery game. I must play 'crimson room decade' is something unique. The story is quite simple: You are stuck in a room and try to figure out the way to get out of the room by using stuff inside the room.  I/ Game play 8/10  Game play is simple enough for first time players and definitely better than flash version ( given that the flash version is like 10 years ago). Not much I can say about the game play .  II/ Music 7/10  Music is decent and sometime it just go to scary mode music and I feel kind of weird . It's definitely could use some more tweet here and there. However it's good enough for this kind of game. You will find music in this game kind of different as well.  III/ Graphic 9/10  Graphic is super nice even though it doesn't require much graphic. You can clearly see any shadow and stuff that you 'need' for your game. I could play it on my laptop ( Gtx 630m is my laptop graphic card) . Game is make with Unity if anyone wonder.  In conclusion game is quite simple and fun. It's a puzzle &amp; logical game; puzzle definitely take you a lots of time to figure out if you never play it before. For $8.49 , it definitely a good buy for puzzle fan or anyone want to try out.",
            "review_score": "1"
        },
        {
            "review_text": "I had to buy this game after playing the demo.  It was quite hard, but everyone can solve its mysteries.  Pros: -Nice feeling  -Great Story   Cons: -Too short  -10€ is way too much  I had a lot of fun playing it!",
            "review_score": "1"
        }
    ]
}