{
    "app_id": 262850,
    "name": "The Journey Down: Chapter Two",
    "release_date": "2014-08-25",
    "developer": [
        "SkyGoblin"
    ],
    "publisher": [
        "SkyGoblin"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 344,
    "negative_ratings": 14,
    "price": 14.99,
    "description": "Chapter Two of The Journey Down, a classic point-and-click saga with an Afro-Caribbean vibe. Get ready to embark on an epic journey of brain-teasing adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/262850/header.jpg?t=1490192447",
    "minimum_requirements": "OS: Windows XP SP 2+, Windows Vista, Windows 7 Processor: 1.8 GHz CPU Memory: 1 GB RAM Graphics: Direct X 9.0c compatible video card DirectX: Version 9.0c Storage: 1200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "As far as I'm concerned this is NO downside to this game. It's completely satisfying, as is.  * Still plays like an spiritual sequel to  Grim Fandango  but with Afro-Caribbean and Pan-African design sensibilites rather than indigenous Mexican aesthetics. Absolutely gorgeous level design and character modelling.   * The puzzles are slightly more challenging than in Chapter One, with a healthy mix of lateral thinking, minigames, and inventory management.   * Even better storytelling than Chapter One. If this started out with heavy Indiana Jones vibes, then Chapter Two brings it firmly into D!ck Tracy territory, with dirty cops, intimidating mobsters, corrupt powers-that-be, and a bleaker urban noir vibe.  * Builds on the setting established in Chapter One. Fascinating, in-depth world-building, from the mistfarer trade and piracy on the 'high soup' to the looming threat of the influential San Armando Power Company.  * Quality soundtrack -- a lively mix of laid-back Caribbean island grooves and freewheeling jazz.  Needless to say, I wholeheartedly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "The second chapter happened to be as awesome as the first one.  Not much to say about the gameplay. I guess, I'm just happy that the puzzles are pretty straightforward and there's no need to pull some unobvious shenanigans; just focus on the story and enjoy the game.   What I really love about TJD2 is the setting. The evening, the rain, the bright lights of the city, – the whole noir atmosphere in addition to the smooth jazz soundtracks; it's just brilliant. It's all worth just pausing the gameplay and leaning back for a while, staring at the art and listening to the music, so good it is.   Highly recommend for playing, but be careful, you may occasionally fing yourself willing to pour a glass of whiskey and smoke a cigar, even though you don't smoke or drink.",
            "review_score": "1"
        },
        {
            "review_text": "A really good point-and-click game. The story is interesting, the artwork is amazing, with a unique African ('Afro-noir,' according to the devs) vibe, and the music is absolutely beautiful. It's part two of three, with three upcoming probably next year. This one picks up right after the cliffhanger ending of the first part and ends with another one, but the story in between does a good job of filling in more backstory and plot without hitting you over the head with a ton of exposition and setting up a couple of twists that lead to the next part.   The only real con I noticed were consistently inaccurate or misspelled captions. I expect at least one typo for any text-heavy game, but there are more in this one than I've seen in a number of amateur games. Some of the voice recordings are of a noticeably lower quality than the rest, but I only noticed that a few times.   Overall, very much worth playing if you like this style of adventure game, even with the episodic nature of it.  In this particular case, I would be absolutely okay with paying full price for the soundtrack as a separate purchase, because it is that good. Also, their original composer passed away last year and apparently there's an album of his music up for purchase., from which all the proceeds go to charity. I think it was a nice touch that they featured that as a very muted 'hey, if you like his music, you can get this, too' ad at the end of the behind-the-scenes extra that's unlocked once you finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game, loved the devs, BUY IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly done Point-and-Click Sequel.  +Storyline  +Beautiful Atmosphere +Graphics +Soundtracks +Jokes",
            "review_score": "1"
        },
        {
            "review_text": "Awesome... looking forward to number 3 I spent about 4 hours in this world and will definitely replay the series before chapter three drops.  Amazing game i spent twice as much time in chapter two than chapter one, just some reference for how long it is compared to the first chapter.  The artwork and the characters are sill super funny. there is a lot of good dialog even more now.  No matter what you think of this review i would recommend you to buy this game. Even if you have only the smallest interest in point and click adventure, mystery, puzzle games. This game is way beyond the tags or whatever you read about it. Only the music it self is award winning, Just buy it all ready.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. If you've played Grim Fandango, you could say there's some similarity in gameplay and music. And best of all it's much longer than Chapter One. (too bad not all of the places in Chapter Two can be visited) Really enjoyed the music, it's rich and vibrant.  The puzzles are a bit hard because there's not much clues provided during in-game. But nonetheless, since i love this genre, i don't mind spending time even though sometimes the puzzle doesn't make sense. Hope that Chapter Three will be coming out soon.",
            "review_score": "1"
        },
        {
            "review_text": "Really good adventure. Nice sound, nice voices, original character design, excellent background art, feeling of USA's 1920's, fine story and world, good control, and most important - is all solvable by brains, not by point-n-click-em-all. One of the best in the genre.",
            "review_score": "1"
        },
        {
            "review_text": "This is great stuff! Great atmosphere, story, music, art/design, all the details... A genuine adventure to lift your spirits on a drab and dreary day.",
            "review_score": "1"
        },
        {
            "review_text": "Game starts with three quarters of it being black and a tiny menu on the lower left. Changing Fullscreen mode crashes the game (Mac). Until this is fixed it's definitely not a recommendation and I'll use steam to get my money back.  If this ever gets fixed I might give it another go.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the most enjoyable Pont and click adventrues I have play in a long while. It will take you less than 3 hours on your first playthough and yet it does not feels short or incomplete, even while being an episode of a larger adventure.  While the Chapter One is full of those irrational game-logic puzzleseverything in Chapter Two feel cohesive.  This is a Highy recommended title for anyone playing a PnC for the first time. Finally, th emusic nd afro-noir architecture this game presents is something you simply won't found ANYWHERE else. ♥♥♥♥♥/5",
            "review_score": "1"
        },
        {
            "review_text": "Such a brilliant adventure game, very awesome dialogue, music is incredible, and the characters are so believable, defaintly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "great music, good story, incredible characters 10/10 looking forward for the 3rd",
            "review_score": "1"
        },
        {
            "review_text": "Yess... This game is just plain beautiful. It's the tiki bar of adventure games.  It manages to be nostalgic without blatant references, to be zany without being stupid or infuriating, and generally manages to avoid most of the pitfalls of its genre. Most of the time the puzzles flow effortlessly, and you only rarely experience the sort of dissonance between story and puzzles that came to be the killing flaw of the adventure genre.  Overall, this is one of the big new titles, right up next to neo-classics like Wadjet Eye's Resonance, Primordia and Blackwell, or the Telltales Monkey Island revival series. I'm not mentioning Daedalic, because Daedalic should pay these guys to give them lessons in game design and story writing.  Big, big A+. I'm sure it's possible to do better than this, but these days nobody has actually done better. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended for any lover of jazz, or music geeks all around.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy point and click adventure type games. This one is really fun but fairly easy! The story is great and the characters are fun.",
            "review_score": "1"
        },
        {
            "review_text": "A short, but funny point-n-click adventure. Not too hard, except for the last puzzle - but I am very bad at connecting visual doodles... Otherwise, I enjoyed the entire journey down (pun intended), with its atmospheric jazz music and unique graphical style. Can't wait for chapter three...",
            "review_score": "1"
        },
        {
            "review_text": "The Journey Down: Chapter Two is a memorable point-and-click adventure worthy of being being compared with the Monkey Island series and Grim Fandango, which obviously served as its inspirations. Every fan of adventure games knows that their overall quality has gone down quite a bit in the recent years, and it is very hard for the modern iterations to live up to the standards set by the old guard. However, while I was playing this game, I felt as if I was transported back to the 1990s. The production quality is superb, the soundtrack kicks ♥♥♥ and the noir atmosphere is amazing and creates the atmosphere of a 1950s noir film.  Most of the puzzles are sensible and not that difficult, although some of them can be solved out of order (ahead of time), which makes you wonder 'What am I supposed to do with this item?', until you find a use for it later. Only the last one gave me a real headache and made me resort to a walkthrough, but given the overall quality of the game, all is forgiven.  TLDR: if you liked Monkey Island and Grim Fandango, do yourself a favor and get this game.",
            "review_score": "1"
        },
        {
            "review_text": "This was a very pleasant game to play with cool jazz music and a nice storyline. The game objectives always make sense. The characters were funny and the environment beautifull.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended for any lover of jazz, or music geeks all around.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very short and very easy... but at the same time, very well done.  I recommend this game. Looking forward to chapter 3.  PROS: - Good Art - Good Voice Acting - Good Story - Great Music  CONS: - Very Short  - Very Few Puzzles - Very Easy",
            "review_score": "1"
        }
    ]
}