{
    "app_id": 263080,
    "name": "Pixel Boy and the Ever Expanding Dungeon",
    "release_date": "2014-05-30",
    "developer": [
        "Giant Box Games"
    ],
    "publisher": [
        "Giant Box Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Indie"
    ],
    "achievements": 24,
    "positive_ratings": 150,
    "negative_ratings": 72,
    "price": 0.79,
    "description": "Pixel Boy and the ever expanding dungeon is an Action-RPG Shoot-em-up with dynamically generated stages across twenty levels and four acts each with an epic boss. Players can stack and combine power ups into over 6000 different powerful weapons as well as craft custom armours to overcome the dangers of the dungeon.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263080/header.jpg?t=1447359399",
    "minimum_requirements": "OS: Windows XP + Processor: Dual Core Memory: 1 GB RAM Graphics: 256mb at least and nothing over... let's say, five years old. Storage: 500 MB available space Additional Notes: It shouldn't be too much of a feat to run Pixel Boy, but if you are trying to play on a modded refrigerator, purchase at your own risk.",
    "recommended_requirements": "OS: Windows 7/8 Processor: Quad Core Memory: 4 GB RAM Graphics: The newest of the new is obviously recommended. How much of a difference it will make, well of that we're not sure. DirectX: Version 9.0 Storage: 500 MB available space Sound Card: Creative Labs Sound Blaster AWE32 or Tandy 1000 Additional Notes: If these specs don't play it, there is probably something wrong with your computer, or you. Also, the sound card was a joke, sorry, bad taste to all those that are still holding out for the Sound Cards triumphant mainstream return.",
    "reviews": [
        {
            "review_text": "I only expected to play Pixel Boy for a little while, but here I am three hours later hopelessly addicted and unable to contain my thoughts on it. The dungeon-crawling genre is one we've all come to know and love, but I can't even remember the last time one felt as fresh and unique as  Pixel Boy and the Ever Expanding Dungeon . There are plenty of reasons why this stands out among the rest of the bunch on Steam;  My first moment with Pixel Boy is a relaxing one, with a slightly blurred image of the quaint little pixel town, Resolutia rolling by the title screen as I'm treated to the relaxing melodies of french electro artist Pyramid. I already feel like I'm in a most blissful state. However, this feeling of relaxation quickly ends, as I start the game and am thrown into the confines of a dark, dusty old dungeon and a glowing trail of blue light as my only guide in this confusion. The game eases you into the mechanics using a humorous narrator that reminded me a lot of Professor Frink from The Simpsons. The lines are delivered infrequently enough to not be a hindrance and are actually pretty damn funny.  The almost Minecraft-like graphics are extremely familiar and nostalgic and work exceptionally beautiful in tandem with it's mellow, almost cosmic sounding soundtrack. You're introduced to the armor and pixel power crafting system which are incredibly dynamic and massive in scope when it comes to the number of possibilities and the diversity shown in their execution. Fiddling around with the vast amount of powerups you come across to see which new powerful attacks you can come up with quickly becomes an obsession.  After finding the RGB keys and making it out of the first dungeon alive, you're brought back to the pixel-y town from the title-screen which you learn is your base of operations. This base will supply you with a multitude of features including shops for pixel powerups, armor, crafting, a monster museum to keep track of the enemies you've encountered, and doors leading to each of the main campaign dungeons. There is also a mysterious and colorful fountain in the center of the town which seems to be the source of the bliss enducing melody you hear.  Once you're done with your introduction to the the town, you will quickly return back to the depths of new dungeons where the pace really begins to pick up, with the music being kicked up a notch going from mellow ambiance to heavy, pulsating rhythms that pump you up for the oncoming journey. The action itself is fantastically solid and fast paced, with an array of stylish monsters and crazy bullet patterns there is a lot going on on the screen at once and it can become a serious sensory-overload in the best way possible. The top-down action combat here is very reminiscent of classics such as  Smash T.V.  or  Pocky and Rocky  combined with a weapon combo system similar to  Gunstar Heroes  and that is a *very* good thing for old school gamers or fans of the golden age of gaming.  The roguelike elements become strongly apparent here and are just right, with heavy randomized factors to the dungeon even involving a slot machine minigame to help decide the mobs for your current run (A really cool touch to the randomized aspect of these games!) and persistant stats and gold that will carry over between your deaths, making each consecutive and seemingly impossible run that much easier. The dungeons become extremely challenging and you'll be forced to utilize every item you find and every shop you happen to come across, as well as chestrooms which contain useful powerups for you to use (sometimes negative effects for the unlucky) if you're able to find or buy keys throughout the floor.   Pixel Boy really hits that rogue-lite sweet spot and will feel right at home with fans of games like Full Mojo Rampage or Binding of Isaac who want extreme replayability and even deeper, faster paced gameplay. This is an absolute must-have for any dungeon-crawler or rogue-lite collection.",
            "review_score": "1"
        },
        {
            "review_text": "Do you love top down Rogue-like dungeon crawlers like The Binding of Isaac?  If yes: Then you NEED this game more than a Heroin addict needs a hot-shot.   If no: Then you should still check this out, it may just change your mind. Because this game is WAY better than that above mentioned flash game about a naked baby locked in a basement.   In all seriousness, I love this game. The controls are super responsive, which is important because ♥♥♥♥ get hectic when you start getting to some of the lower levels. As is the case with most good rouge-likes, the randomly generated nature of the levels means that no two runs are the same. The thing that really sets this game apart though, is the powerup and crafting system. The devs claim there are over 6000 different weapon combinations, and I can believe it. Once you start stacking split and spread shots the game starts looking like a bullet hell shmup that even puts Ikaruga to shame. Top it off with a great soundtrack, and you have a game that pumps blood to my nether regions faster than a topless Daenerys Targaryen.",
            "review_score": "1"
        },
        {
            "review_text": "first thing great game so far its really fun secondly i found a small glitch i leveled up at the same time as i died so i went to the black death screen but i had the tab to level up message at the bottom of the screen i pressed tab hoping to be revived but instead the game froze on the black screen and i had to close this really doesnt effect the game much but it forced me to close the game",
            "review_score": "1"
        },
        {
            "review_text": "Pixel Boy and the Ever Expanding Dungeon was well worth the wait. This game flows very well and the game play is so easy to learn yet so addictive. The first time I played I only expected to test the game out quickly and ended up being hooked for hours. The game continues to get better the further you get into it and I love how within day the developers had already put out a patch incorporating everybody's ideas. I can't wait to see what new ideas are in the pipeline and I definitely recommend this game for casual or experienced gamers alike",
            "review_score": "1"
        },
        {
            "review_text": "Neat little game thats got some cool retro vibes.  Basically you combine shot powerups into all sorts of crazy combinations and blast through hordes of baddies as you sniff around random dungeons for loot. You can craft armor too for added customization. Simple yet addictive.  The game needs a tad more polish but the price is right and the devs appear to be VERY active in listening to the players so I have no doubt the game will be polished nicely with time. If you enjoy roguelikes, aRPGS and even Bullet Hells this could be the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, maybe a bit easy (never died) and i think it has some interface problems, overall it is a good game and i recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Did I just create a 3x spread shot + heat seeking pixels? Yes, yes I did. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I normally don't write reviews, but this game definitely made me want to. The game is really fun to play and addicting.  Pros:  + Addicting gameplay  + Great soundtrack  + Semi-fast paced  Cons:  + A bit repetitive  Although I gave it a con of repetitiveness it is still really fun to play and addicting. Definitely worth the price point and jump on it if it is ever on sale/in a bundle.  ",
            "review_score": "1"
        },
        {
            "review_text": "A fun action RPG dungeon crawler with procedural generation, offering a great deal of replayability. Initially, I wasn't sure what to make of this one, but the more I play it, the more I enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, love the Art style and the Music is outstanding! + There is only 5 trading cards woot badge! (also love the trading card art)",
            "review_score": "1"
        },
        {
            "review_text": "Great Indy title, gets tough as you play and you have to watch the conservation of ammo as part of the strategy. Hope to see more from the Dev.",
            "review_score": "1"
        },
        {
            "review_text": "Its alright. Its worth 5 dollars put it that way. Looks great though.",
            "review_score": "1"
        },
        {
            "review_text": "I had a lot of fun with this game, though there isn't much replayability. It also stores save games in your window's registry (don't much care for that, but if you know where to look, you can make backups and reload your progress to make it a bit less rougue-like).  Anyway, worth a buy if you catch it on sale. Nice little diversion.",
            "review_score": "1"
        },
        {
            "review_text": "Pixel Boy and the Ever Expanding Dungeon Well the Ever Expanding part is not correct as there is only 5 dungeons sure they are randomly generated but thats as far as it goes. The amount of combinations of the skills though I will admit is the main thing that drew me into buying this game but it gets kinda boring (least to me).",
            "review_score": "-1"
        },
        {
            "review_text": "Not great, to slow!",
            "review_score": "-1"
        },
        {
            "review_text": "Stupid Game. Don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "It won't hold your attention for long. It plays like a game concept that never got fully thought out. It's half goofy, but not goofy enough. It's full of half done features e.g. the armour crafting. It all feels a bit half baked, and as such is only half fun. There's much better games out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Looking for a challenge? Want to play a supposedly hardcore?  Then this game is  not  for you. I've heard lots and lots of commentaries/reviews about how hard and unforgiving this game is, even to the point where they had to restart the whole game because they just couldn't grind their way back up, when in fact it is too easy. All you have to do is just spend every skillpoint into damage and get spread shot, split shot and life steal, the other last 2 don't matter too much, ammo drops far too often and mushrooms (yes, mushrooms) boost you too much. Over 6000 possible combinations of your attack? Around  50  useful ones, yeah. That's pretty much it. Only 1 save slot that gets   deleted   after you've beaten the game, that's just stupid. Having a pretty high firing rate with spread shot and split shot makes the game terribly lag, too.  It's probably just me, but this game is for people who want to stop-by casually, who want to have fun for a few hours. It's definately not a challenging game at all, so I can't really recommend it from what I heard.",
            "review_score": "-1"
        },
        {
            "review_text": "Pixel Boy is an incomplete game and poorly balanced.  Although pretty and unique in design the game fails at its two basic premises. Namely that if you are to believe that the Dungeon is 'ever expanding' you will be disapointed to find that the game featured only 4 acts each containing 4 maps. The maps are further padded out by empty rooms and a slow movement rate. If you are to believe that the core mechanic of the game is to combine power-ups to create powerful combinations you will be disappointed to find that although combining power-ups is kind of fun and does make for great visuals, the ammo management required and the pure unnecessary nature of the power-ups (the game is easily beatable without them) actually impedes your progress more than aiding it.  [Updated 11.07.2014]",
            "review_score": "-1"
        }
    ]
}