{
    "app_id": 263060,
    "name": "Blockstorm",
    "release_date": "2015-05-21",
    "developer": [
        "GhostShark"
    ],
    "publisher": [
        "IndieGala"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "FPS",
        "Multiplayer"
    ],
    "achievements": 131,
    "positive_ratings": 5363,
    "negative_ratings": 1298,
    "price": 3.99,
    "description": "Blockstorm is a FPS game set in a world made of destructible blocks. All maps and characters included in the game are made with the same tools that are available to the public. You can build everything in Blockstorm, and you can destroy it.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263060/header.jpg?t=1465373012",
    "minimum_requirements": "OS: Windows XP with SP2 or later Processor: Intel Core 2 Duo Memory: 2 GB RAM Graphics: Nvidia Geforce 8600M GT DirectX: Version 9.0 Network: Broadband Internet connection Storage: 200 MB available space Additional Notes: With the minimum configuration, disable dynamic shadows and effects",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i3 Memory: 4 GB RAM Graphics: Nvidia Geforce GTX 550 ti DirectX: Version 9.0 Network: Broadband Internet connection Storage: 512 MB available space",
    "reviews": [
        {
            "review_text": "It's a really good game. Here's a list of pros and cons: [EDIT: I decided to edit a few points in my review, based on the comments of it. I also decided to put a few additional points based in my experience so far. ]   Pros: - Smooth Gameplay - Easy Controls - It's a balanced game - Map Editor - Character Editor - Equipment Editor - Just enough gamemodes - Friendly Community ( Well, most of it ) - The Devs hear what the people has to say, and make updates based on it - Has cards - Up to this day that my review was made ( 05/22/15 ), i wasn't able to find any single cheater in the game  Neutral: - Features a destroyable environment  Cons: - As it features an destroyable environment, in most of the rooms you play, you'll certainly find 2 or more griefers, which will definitely screw up the whole match. - Your Equipment Editor is limited to only a few blocks more to add. (Example: you can't turn an AK-47 into a Bullpup weapon) - Short maps don't take long to turn into a No Man's Land. - As far as I played, I couldn't find a single game that my ping wasn't under 400. ( Not that my game turns into a complete laggy mess, but sometimes it troubles me )  Blockstorm has the features that I thought I would find in Ace of Spades ( The new one, not the classic ), and definitely something that Blockade 3D will NEVER have. Do not consider this game a Minecraft clone. Believe me, the only thing similar to Minecraft is just the digging and the placing blocks feature. As I saw on their website, it will have some really cool updates coming ( including drivable vehicles )  For giving me a really entertaining experience so far, 9/10. Really recommend buying it.",
            "review_score": "1"
        },
        {
            "review_text": "  100% NOT ACE OF SPADES :P  ",
            "review_score": "1"
        },
        {
            "review_text": "10/10. i bought this game a week ago i bought it in the 4 pack for my friends and i. it was the most fun i have had on a game in ages. downloading funny skins and creating cool maps to shoot in was awesome. making maps and characters is so easy and great i made my own version of five nights at freedys and a map of my mates house. very addicting great game.only problem is i cant play my own map online but they will probly fix that in update. check my map out. fnaf factory",
            "review_score": "1"
        },
        {
            "review_text": "no lie guys but i actully reccomend this game,i mean its really cool and awesome.plusskin customuzations?WICKED.and it also has workshop(one of my favorite comunity options)",
            "review_score": "1"
        },
        {
            "review_text": "When I played the demo version of this game, I wasn't really impressed. About four months later, I dared to buy this game and was totally surprised how much fun I had first time playing the full game. I became addicted to Blockstorm and got along quite well, although I have a lack of experience in pc-gaming. However, I've also learned to use the editor and created some nice maps, but I envy the people, who have the talent to create characters for the game because it's so hard... :P  Sincerely, TheLastOfTheSkyPirates / SkyPirate",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the only Minecraft like clone games I'll continue to play. You can customize the look of everything; even your guns. Get it with friends and it's sure to be a fun night.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a pixel based shooter, but is different in a ton of ways.  Pros: -Great Workshop Support -Great Optimization (Was able to run at 30+ fps with vanilla Intel HD Graphics) -Great Weapon Balancing -Easy Server Hosting (with hamachi) -Good amount of game modes.  Cons: -Snipers are very slow -Small amount of official servers and they can get really full fast.  Overall I give it an 8/10, it's a very good game but it has it's few bad points but overall it's very good, I would reccomend getting the 4 pack and playing it with some freinds because that's the best way to!",
            "review_score": "1"
        },
        {
            "review_text": "&lt;Bought the game &lt;Spent 1 hour in the character and gun customization &lt;charachter looked like ♥♥♥♥ (used defaul ones instead) &lt;gun I customized sucked &lt;first game &lt;map: one bridge &lt;sniper only &lt;second match &lt;Nade heaven &lt;died like the 15th time from nades &lt;ragequitted &lt;got an achievment for rage quitiing  10/10 would rage quit again",
            "review_score": "1"
        },
        {
            "review_text": "Game: Blockstorm Price: 7.99(I got it for 1.39) Genre: Building, FPS  Blockstorm is an fps and a building game. It has several game modes such as TDM, DM, CTF, and more! It has weapons that range from shotgun to smg. The game allows you to customize maps, your character, and weapon skins! You can also build in the middle of a match. Building can be the most helpful in CTF.   Gameplay: 8/10 Music/Sound: 7.5/10 Replayability: 9/10 Customization: 9.5/10 Building: 8/10 Worth it? Yes! The game is worth the money. I simply enjoy the game.  Overall rating: 8.4/10",
            "review_score": "1"
        },
        {
            "review_text": "  Very Nice Game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really Awesome and this is the first game that i played for 100+ hrs, But this game needs to be updated and i can give u a few ideas, Sometimes its very laggy but overall this is a must play, espically with friends.         HAVE A NICE DAY TO U ALL, AND HAPPY GAMING CYA SOON :-)",
            "review_score": "1"
        },
        {
            "review_text": "Neat Game, Cool consept but i HATE the mouse controls.",
            "review_score": "1"
        },
        {
            "review_text": " Average Voxel Shooter + Good Skin Creator",
            "review_score": "1"
        },
        {
            "review_text": "Only buy at sale 1€  good -many maps, oy vey -many skin custom stuff -framerate pretty high -costs only one shekel -good map&amp;skin editors  bad -0 balance, half the weapons are obviously inferior if not useless -teamkilling, many bad goys, in most modes team dmg is on by default -spawnkilling, no spawn protection or anything -needs more players -dead, no development, 'finished' product -stuttering, while fps is high, it sort of 'lags', I can't explain it, but it ♥♥♥♥s up the game -mouse acceleration or smoothing on by default, cant disable ,resulting in drunk aim -movement system is strange, you walk like a drunk,also when you stand still but turn, spread increases (!)  If the dev just adjusted the weapons balance, and implemented some form of spawn protection, and disabled teamkilling, the game would be perfect",
            "review_score": "1"
        },
        {
            "review_text": "i have for the first time in my life played with a Krambit Fade 1000000000000000000/10",
            "review_score": "1"
        }
    ]
}