{
    "app_id": 263020,
    "name": "STARWHAL",
    "release_date": "2014-09-29",
    "developer": [
        "Breakfall"
    ],
    "publisher": [
        "Breakfall"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Indie",
        "Local Multiplayer",
        "Funny"
    ],
    "achievements": 24,
    "positive_ratings": 565,
    "negative_ratings": 66,
    "price": 9.29,
    "description": "The local multi-player space narwhal fighting game that has rocked the internet is finally ready for its big debut in a fully loaded release! Flop it out with 1-4 players in a retro, epic narwhal battle in space! The heart-piercing action is furious and unrelenting. STARWHAL will change your life.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263020/header.jpg?t=1447359396",
    "minimum_requirements": "OS: Microsoft® Windows® Vista / 7 / 8 Processor: 2GHz processor Memory: 1 GB RAM Graphics: DirectX 9 compatible graphics card with at least 256MB of video memory DirectX: Version 9.0c Storage: 700 MB available space Additional Notes: Optional - Microsoft Xbox 360 Controller or Direct Input compatible controller",
    "recommended_requirements": "OS: Microsoft® Windows® Vista / 7 / 8 Processor: 2GHz processor Memory: 1 GB RAM Graphics: DirectX 9 compatible graphics card with at least 256MB of video memory DirectX: Version 9.0c Storage: 700 MB available space Additional Notes: Optional - Microsoft Xbox 360 Controller or Direct Input compatible controller",
    "reviews": [
        {
            "review_text": "So I got this along time ago hoping with full launch it would have non local mutiplayer. really bummed out and 15.00 starwhals is a bit much. I still love the game and it is a TON of fun just wish id had non local muti player",
            "review_score": "1"
        },
        {
            "review_text": "Is fun but needs online multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "As someone who has only played the single player challenge modes (I have no friends, so no local co-op), this game is amazing. The challenges are hard enough that they provide entertainment and a challenge, and trying to get whateverthemedalpastgoldis will provide many more hours, yet the game is easy enough that a n00b like me was able to complete all the challenges (medaled, mostly bronze) in just over an hour. Most people are here for the co-op, which I'm sure is spectacular, but the game is fun for just the single player challenges as well.  Plus I made a narwhal that looked like a cat stuck in sushi, what more could you want?!?!?    Video ",
            "review_score": "1"
        },
        {
            "review_text": " Overview  Slip and slide spin and flip across a neon landscape to pierce the heart of an endangered species without getting them laws all up in your kool aid.   Polyamorous  stabbing friends, random one night stands, home bums, and loved ones in  Starwhal",
            "review_score": "1"
        },
        {
            "review_text": "Very unique little party game. Makes for lots of laughs as well as lots of high blood pressure.",
            "review_score": "1"
        },
        {
            "review_text": "I got the game back at FanExpo 2014 for $10 I had very little knowlage of what I was buying. I saw some people playing so I took a risk and bought it. Best risk I've ever taken. I love it. Its fun, and you can use it with smaller children if you get some controllers. Good single player to, Im exited for it to have its full release. Good luck Breakfall mrmeow2000",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. And stupid. Play it with friends, some drinks, probably an audience, and give them all something to remember. But just the tip.",
            "review_score": "1"
        },
        {
            "review_text": "Starwhal is a fun and casual game that can be played in offline mode on steam with your friends ON THE SAME COMPUTER. Although some people do not like this game for its simplicity and limited gameplay, it is a very fun, light, portable, inexpensive, and an incredible game to experience. The skill range is very casual but some people can get VERY GOOD at the game. What I love most about this game is the ability to play multiplayer with just one computer. IT IS A GENIUS IDEA and you can play up to 4 players in the game! If you're on a road trip and you are bringing a laptop to play games with friends, I reccomend this game to you! :)",
            "review_score": "1"
        },
        {
            "review_text": "I brought Starwhal to a LAN party and it was easily the crowd favorite.   This game has simple controls, great music, beautiful levels, and fun gameplay that is perfect for a couch co-op party game. The single player challenge levels are also well designed and challenging.  People who are complaining about the controls simply don’t get it, that’s part of the game. Even after a lot of practice with the challenge levels, you will still flail about sometimes and that is part of the fun when you are playing with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "The latest in space-narwhal simulation, compiled by severl professors whom i by complete coincidence managed to forget the names of. This superb simulator allows you to study the metaphysical properties of space narwhals as you get to experience their existence and what it's like to b- actually, just buy the game.  I had a snail on my back. 10/10 would have snail on my back again",
            "review_score": "1"
        },
        {
            "review_text": "'Hey, what's STARWHAL?' 'Hm... How should I put this... Fencing narwhals in space.' *Insantly buys and downloads*",
            "review_score": "1"
        },
        {
            "review_text": "Not fun because there is no Online versus, which is really dumb. Would be a great game if i could play with other people.  1/10 would not play again",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "ABSOLUTE HORSE ♥♥♥♥, as if they wouldn't add online multiplayer, HOW CAN THE DEVELOPERS BE SUCH BRAIN DEAD GARBAGE MEN, KILL YOURSELF AND LEAVE THIS GAME IN THE CAPABLE HANDS OF SOME REAL DEVS.",
            "review_score": "-1"
        },
        {
            "review_text": "Humping your friends was never more exciting than this time! :D",
            "review_score": "1"
        },
        {
            "review_text": "The only fun time to have sex with something pointy",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would endlessly listen to dubstep while killing narwhals again",
            "review_score": "1"
        },
        {
            "review_text": "What an underrated, and understated game Starwhal is. Hilariously fun, and here to revitalize the lan fun of pc gamings past. Simply put, Starwhal is just fun, and is totally worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect controls and you can dress up as Solaire. As a narwhal.",
            "review_score": "1"
        },
        {
            "review_text": "there is no such thing as being too lifted or not lifted enough to play Starwhal.",
            "review_score": "1"
        },
        {
            "review_text": "You stab people and gain pleasure out of it.  Unless you got stabbed, in which you feel sad.  10/10 (A bit expensive though)",
            "review_score": "1"
        },
        {
            "review_text": "While you're listening to Weebl's Narwhals song this is a ridiculously awesome game. You can do multiplayer or single player, vs friends or AI. For single player if you're not into playing with other narhals there is the option to do hitting targets or do more obstacle stuff. Seriously just get this :'D",
            "review_score": "1"
        },
        {
            "review_text": "This game is just so simple and excellent. I NEVER write reviews but I just have to. We preordered this-they wrote us a funny note, and were very prompt with updates. I got REALLY excited-to the point where I was really worried it would be unable to live up to my expectations. All too often, when preordering an item, it completely disappoints by the time it is released-NOT the case here!  Fun, clever maps, features, and just awesome gameplay. I adore the way it looks and feels. This is a very fun, very casual game. I absolutely hope to see more from this team in the future!",
            "review_score": "1"
        },
        {
            "review_text": "This game along with TowerFall Ascension are one of many games on Steam that me and my friends play when we get together. The customization options include some references to classic games and they are hilarious in some cases. The gameplay is simple, it's goofy, it's competitive, and it's freaking great.",
            "review_score": "1"
        },
        {
            "review_text": "Made lyrics on one of this game's song about ♥♥♥♥♥lapping while playing this with friends 10/10 would slap again",
            "review_score": "1"
        },
        {
            "review_text": "Party game for many players with controllers on a single screen.  Control mechanism is deliberately super sloppy, makes it quite accessible for new comers, but you can still get 'good' at it (never great though)  Bit of fun, worth having, low price point",
            "review_score": "1"
        },
        {
            "review_text": "Narwhals are scary. Why did I buy this game. I am frightened",
            "review_score": "1"
        },
        {
            "review_text": "It's so OUTRUN!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good one for 4 players on the same big screen. ALL ages had fun with this one, even the young kids! Simple control scheme yet hilariously difficult to try to control. Absolutely recommended if you need something for 4-way couch play.",
            "review_score": "1"
        },
        {
            "review_text": "This game is weird.",
            "review_score": "1"
        },
        {
            "review_text": "I've played Starwhal Demo for a long time on their website, so it was an easy choice to buy the game. I did wait until it was on sale, but now that I've experienced the added content I can say that it's well worth the price.",
            "review_score": "1"
        }
    ]
}