{
    "app_id": 263140,
    "name": "Postmortem: One Must Die (Extended Cut)",
    "release_date": "2013-12-03",
    "developer": [
        "Unbound Creations"
    ],
    "publisher": [
        "Unbound Creations"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Captions available",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 71,
    "negative_ratings": 96,
    "price": 1.99,
    "description": "Narrative-adventure playing an Agent of Death who must take ONE life that could change the fate of a conflict-torn Nation!Think The Walking Dead meets Home and The Last Express, with a dash of To The Moon!Freeform exploration with Rich dialogueWhat might you learn searching the fundraising Gala and talking to patrons?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263140/header.jpg?t=1507678380",
    "minimum_requirements": "OS: Windows XP Processor: 1GHz CPU Memory: 512 MB RAM Graphics: 3D graphics card supporting OpenGL Storage: 40 MB available space Additional Notes: if you're having problems make sure you install the Visual Studio 2008 Redistributables",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Not worth the price IMO. There is only one 'act' (one level of the game to play through) which took me 30 minutes when I spoke to every person in the room and went into a couple of side rooms. Each conversation with each NPC can become a very long, very boring dialogue you cannot get out of until you go through the whole thing. Conversations would have been more interesting if they were much shorter and not so useless. I typically learned everything I wanted to know early on in each conversation.   There is nothing in the game to prevent you from choosing a random target to kill, so you can easily pay $7.00 for less than one minute of gameplay.   Overall, this game was an interesting concept which was stuffed with uninteresting monologues and only one act. Not worth the money paid at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Extended?  This game is one level that lasts 30 minutes at most *if* you poke at *everything*. I like the concept and quality of content, but most demo's and tutorials are longer than this. I picked this up in a bundle, but I would have been furious had a paid full retail for 30 minute game.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too little content.",
            "review_score": "-1"
        },
        {
            "review_text": "Liked the story, but not the unrewarding ending.",
            "review_score": "1"
        },
        {
            "review_text": "A game lacking in aestetic or gameplay values to a very large degree. You play the part of some being sent to a party to pick somone to die that day. There was very minor elements of adventure gameplay like being able to obtain a key for a door but it isn't actually necessary. I spent my time wandering around trying to read a books worth of content from random characters and eventually was so uninvested and bored that i picked some random guy just to end it. I can't recommend this to any but the most devote bibliophiles.",
            "review_score": "-1"
        },
        {
            "review_text": "Appraoched as a single scenario with some replayability, then this game is fun. Those expecting more than 30 minutes of play time per playthrough will be disappointed. It's very interesting, very unique and very well written. The dialogue trees are important, unlike most adventure games. Go into each conversation with a goal: find out who they are, what impact they are currently having on the crisis and what impact they may have in the future. Try and convince them to change their bigoted ways and if you fail: add them to your list!",
            "review_score": "1"
        },
        {
            "review_text": "This is the most pointless game I have purchased - very short, not much content, inane. Save your money!",
            "review_score": "-1"
        },
        {
            "review_text": "Such a disappointment! The clunky controls and sub-par graphics could have been ameliorated by a compelling narrative or engaging game-play, but 'Postmortem' lacked both. The characters were unlikable, the setting was incongruous and anachronistic, and the narrative (such as it was) felt like something a high-school student would have thrown together after half-ignoring a lecture on the prelude to the First World War. The creators clearly assumed that only the most superficial of details from the late 1800s/early 1900s would have differed from the present, and it makes the game feel...childish. But the game's greatest failing lies in the fact that, for a game that is 99% text and reading, there seems to have been NO editing or proofreading done! Sentences end mid-statement, words are missing from many sentences, misspellings abound, and the grammar and syntax are often TERRIBLE. The premise offered so much promise, but the execution was sorely lacking.",
            "review_score": "-1"
        },
        {
            "review_text": "how is this not a free flash game?",
            "review_score": "-1"
        },
        {
            "review_text": "It was fun but way to short for the full pirce it holds alot of potential but overall there just not that much to the game maybe someday someone will take the time to add on to the idea but untill then wait for a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "A short, simple game that should entertain you for a few hours. It doesn't claim to be more than that and it doesn't pretend to be more than that. It's all a game of it's type needs to be and it delivers. It doesn't have bugs, doesn't crash, doesn't try sell you other crap, and it's fun to play. Perhaps this would be unjustified if it was expensive but it's dirt cheap, so if you're looking to expand your indie collection and kill a few hours in the process, this ain't a bad choice.",
            "review_score": "1"
        },
        {
            "review_text": "Very well-written game. Immediate impression: Very short, technically one level, about 2 hours unless you rush in and do whatever with little regard for writing; no action, just choices; rather interesting characters and a cool concept.  Yes, I did not stutter-- this game is super short. You're in a mansion and you're talking to about 7 people about this and that, and you choose one person to die. That's really it. Except there's a good amount of reading involved. So if you hate reading and character development, then steer clear. Otherwise, welcome to literacy!  The developers did a great job of making the conversations... conversational. Like many RPGs of our time, the tendency is to give the player only a few options. In Postmortem's case, the only times I felt limited were when I needed to make a solid choice on a morality issue. Yes, you're death, but you yourself are playing. And what kind of topics are discussed in Postmortem? Politics and morality. Ah yes. They cleverly change the official titles of the left and right wing into something more general, but all the ideals are there. Between talking to the characters, we're given insight into several 'current issues', such as xenophobia, feminism, big corporate buyouts, and apparently a bit of gay rights (I somehow got that involved in the end game).  I liken the moral choices to that of the Walking Dead game by Telltale. A lot of times, you the player must draw from your own perspective and answer as you would, if you were in that same situation. Unless of course you're roleplaying as something specific. No matter how you play the game, you get to see how your choice affects that world, as well as what little actions you've done while playing (did you gossip about someone or snoop a little, for example).  These games are always refreshing to play occasionally. And should you feel like spending a bit of time with a choose-your-own adventure that makes you question your own political/moral standpoint, Postmortem will be a great game for you. Simple and easy to play, but sometimes tricky in the choices you make.  For the record, I played as close to middle-of-the-road as possible, and the ending actually kind of reflected that. Awesome~",
            "review_score": "1"
        },
        {
            "review_text": "If you like games that require seperate button presses for almost every step you take and graphics that could make your eyes bleed, Then this is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing much to this game, just when you think it starts, it ends which is highly disappointing. The game feels very unfinished and I wouldn't recommend it to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "Duration of this game is not worth the cash. If this game was less than $.79, I may advise getting it; however, at this current form, don't get it.",
            "review_score": "-1"
        }
    ]
}