{
    "app_id": 263460,
    "name": "Girls Like Robots",
    "release_date": "2014-02-14",
    "developer": [
        "Popcannibal"
    ],
    "publisher": [
        "Popcannibal"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Indie"
    ],
    "achievements": 9,
    "positive_ratings": 150,
    "negative_ratings": 58,
    "price": 4.99,
    "description": "Their faces are the playing pieces. The rules are their emotions!Ridiculously charming puzzles, wrapped around an epic tale of love and danger, topped off with an authentic old-time stringband soundtrack!The goal is to put every one next to their friends.But you can't please everybody all the time.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263460/header.jpg?t=1447359410",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows Vista®/XP, Windows 7, Windows 8 Processeur : 1.5 Ghz Mémoire vive : 1 GB de mémoire Graphiques : Graphics Card made within the last 4 years (Pixel Shader 3.0, Vertex Shader 3.0) Espace disque : 350 MB d'espace disque disponible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very fun, little, casual puzzle game. The art style is playful and vibrant with a wonderful attention to detail, especially in the backgrounds. The animations were smooth and fun to watch, as a feature the game also allows the player to skip the cutscenes or even watch the cutscenes again in the level viewer. The story was surprisingly well done as well. Normally, I would not expect a story in a puzzle game like this, however there was a story, and it was quite easy to follow. Though the adventures were wacky and didn't make any logical sense, it fit the overall tone of the game perfectly. I must also applaud the creators of the game for adding little references from other media and of course geek culture. The soundtrack of this game was great, however it got very repetitive as the game progressed, for my ears got tired of hearing the same banjo tune strummed over and over again. The best way to remedy this problems is to take a break once in a while to let your ears rest. However this little problem did not and will not dull the rest of the gaming experience in anyway.   The game was easy to pickup and play, however don't get me wrong, some of the puzzles will take a little bit of thinking to figure it out, especially if you are a completionist. Bonus content allows for some replayability which adds to the value of the game itself and in no ways detracts from the main game itself. The system of unlocking bonus content is well done, as even an intermediate skilled player will be able to 'buy' the content (The main game will provide more than enough 'happy' points to unlock them). The achievements brings nothing new to the table, but it fairly awards those who are willing to spend some time in the game.  Overall this is a solid game with little to no faults to describe. It is a must own for people who like puzzle games, and for people who don't, this is a good game to pick up, because of its ease of play. The game's content to value ratio is good, however don't expect to sink hundreds of hours into this game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": " First playthrough time: 8 hours    Major Pros:  Clean graphics Easy to use in game interface Diversity in mechanics, level goals, and styles Good bonus content (Nerd Drop is a great time waster) Game had a good sense of humor   Minor Pros:  Seals are adorable Customizable icons Keeps track of solution 'prefectness' for perfectionist players   Major Cons:  Relied too much on basic gameplay (aka what you learned in the intro) Didn't take enough advantage of most unique level designs (aka used about 3 times and then never again)   Minor Cons:  Story was silly and made no sense (but matched the theme of the game) Level select when you came back to the game was sometimes unclear where you left off I hate banjo music  All together not a hard puzzle game unless you want to go for perfect on all the levels, but cute graphics and some interesting level designs make the game fun. The whole thing is fairly long for a puzzle game, but can be picked up and put down easily. The biggest thing I'd say it suffered from was some overuse of the basic Girl / Nerd / Robot interaction and not enough exploration of some of the other concepts and level designs that the game put forth, like shooting giant insects.",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle game, where you have to put faces toghether in a grid, and try to make the the happier possible, Colorful and light, a great game to relax and have fun. Has a good in game storyline too.",
            "review_score": "1"
        },
        {
            "review_text": "100% Of Achievments. About 15 hours of gameplay.  Pros: - Cute Achivements - Cute Puzzle Game - Cute Folk Soundtrack (Actually Amazing) - Cute SFX - Cute Square Friends  Con: - For the achievment hunters, there's one called Nerd Dropped that SUCKS. It's like a screen saver with level up system. Go travel for the weekend and let the PC turned on with that s*** runnin'. On Xmas you will get this achiev. Really dumb stuff.  Worth for the whole atmosphere. Total Eye / Ear-Candy. Congrats for the developers. ^^.",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle game. Mechanics are not very deep, but every level introduces new ones so it never gets boring. Cute story but short and low replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, whimsical, simple, and hilarious. Girls Like Robots uses it's characters cleverly to take a thoughtful puzzler and make all it's interactions immediately satisfying. It's lighthearted and absurd story is a real joy, especially for people who love terrible puns and revel in playful absurdity. A game that's as fun to quote out of context as it is to share with others. Don't let the very simple premise fool you, Girls Like Robots has plenty of variety that will challenge you with new kinds of problems continually. I'm impressed with how carefully the stages flow with one another, not allowing any one challenge to become overbearing.",
            "review_score": "1"
        },
        {
            "review_text": "Super boring and repetitive puzzler with some incoherent plot. Girls like robots, but not this game.",
            "review_score": "-1"
        },
        {
            "review_text": ":(",
            "review_score": "-1"
        },
        {
            "review_text": "I dont think puzzle game can get anymore entertaining than this.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun puzzle game. It isn't too difficult, but some levels are a little tricky in getting proper placements. If you like puzzle strategy games, you'll probably like this.",
            "review_score": "1"
        }
    ]
}