{
    "app_id": 263500,
    "name": "Dragons and Titans",
    "release_date": "2014-03-12",
    "developer": [
        "Wyrmbyte"
    ],
    "publisher": [
        "Versus Evil\t"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Free to Play",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Dragons",
        "MOBA"
    ],
    "achievements": 52,
    "positive_ratings": 2428,
    "negative_ratings": 708,
    "price": 0.0,
    "description": "Dragons and Titans is a fast paced MOBA with classic RPG elements. Select from over 30 unique dragons and 30 legendary weapons. Upgrade dragons and forge weapons to unlock more power. Free your Titan in 5v5 PvP battles across 3 different map types or play in ‘Adventure Mode’, traveling across different regions and unlocking rewards.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263500/header.jpg?t=1478029453",
    "minimum_requirements": "OS: Windows® XP/Windows Vista®/Windows® 7/Windows® 8 (latest service pack) Processor: Intel® Pentium® D or AMD Athlon™ 64 X2 Memory: 1 GB RAM Graphics: NVIDIA® GeForce® 7600 GT or ATI™ Radeon™ X800 XT or better DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows® 7/Windows® 8 (latest service pack) Processor: Intel® Core™ 2 Duo E6600 or AMD Athlon™ 64 X2 5000+ or better Memory: 1 GB RAM Graphics: NVIDIA® GeForce® 8800 GT (512 MB) or ATI™ Radeon™ HD 4850 or better DirectX: Version 10 Network: Broadband Internet connection Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "This game was quite dissapointing, I did buy the titans pass because it is fun for awhile, but it lacks many things that are standard in moba's these days.   Advantages: - Dragons are awesome and well designed artistically  - It's fun - graphics are average - lots of gamemodes and updates  disavantages: - you can't pick your dragon with your team, which is just horrible for a MOBA, you can end up with 5 supports or none, you can also have the same dragon as somebody else, this is very bad designed and makes the game unbalanced.  - you can't pick your game mode, it is rotated by the server, and you find out what gamemode you are playing after you select your dragon, some are better then others in certain maps. This is again, very poor design for a MOBA and even a basic MOBA needs this.  - Developers reasoning for bad design choices is that there isn't enough players to allow for people selecting there maps, this is very counter inuitive, because I'm sure more people would play if you could select your dragon as a team and chose the map. Which brings me to my next point.  - Small player base that isn't growing.  - global chatroom has people of all languges speaking in it, it should be seperated by language as you cannot communicate properly - the community that there is have been quite immature at times and quite toxic, there is only a few exceptions.  - lack of depth in gameplay   I do not recomend this game, but since it's free, you should try to see if you have fun with it, It still can be very fun at times but I would suggest if you wanted to play a dragon in a MOBA, you should go and play Jakiro on dota 2. (EDIT: OR WINTER WYVERN)",
            "review_score": "-1"
        },
        {
            "review_text": "Dragons and Titans. Let's talk.   I saw this game, saw dragons, and thought 'Well, why not try it out. It's free so let's see what it's about.' And thus learned this is what a MOBA is called. For what it is, if you have no experience with any MOBAs it really is good. It's a great 'Get your feet wet' kinda game. Hell, I spent over 850 hours playing it so it must be good right? Right?! Well, frankly, if there was a 'neutral' button, I'd put it. If I had made my review a year ago, it'd be an absolute thumbs up reccomendation. As of now, I can't. It pains me to say it because this game is boat loads of fun. Was, I should say...  First, let's discuss how you begin: You start off with the tutorial, and afterwards get a dragon egg pack. There are like, 30 dragons and the egg packs are random. You could get x3 of the same dragon, x3 support, x3 damage, or just x3 crap dragons you suck at. It's 100% random. You can get more egg packs for 5,000 gems which are the currency in game, but it takes a while. The first egg pack you get is free. I've heard stories of people starting out with x3 support dragons which suck for a new player. But again. Random.  So, if you start out with dragons that are support or dragons that just arn't your playstyle, etc...you're going to have a tough time starting out. Did I mention 5,000 gems takes a while to get?   Sure you can buy individual dragons, with REAL money, but....do you if you JUST are trying out a game?  RNG aside, you start out now. There are 4 acts for the main storyline for single player, single player for the 4 MOBA maps, co-op vs ai, and pvp. You can only play the first act as the others are locked until you pay 20$ for the Titan Pass. I never got it. Payed for a few dragons though when they had a sale though.   Alright, now for game play. You can choose a dragon and weapon combo. Some are better than others and are overused in PvP but that's besides the point. Each dragon/weapon has two abilities, some passive, others active depending on the weapon/dragon. Traditional MOBA however.   You also have Runes which in truth are the main game changer. You have rune pages that you can customise for your game style. Each rune can be upgraded, but...RNG TIME! You need x3 t1 runes OF THE SAME to upgrade to t2, and x3 OF THE SAME t2 runes to upgrade to t3. How do you get t1 runes? A random t1 rune pack for 250 gems! And there's a super difference between a player with a rune page full of 15 t3 damage increase runes to a player with no runes, even if they have a same combo.   Oh, and each pvp match gives you about 30-100 gems on average, with 100 being the cap. Co-op gives 20-40 and single player about 10-25. So, those 5,000 needed gems start looking harder and harder to achive. Sure the Titan Pass increases your gem income per match but....20$.  Dragons are similar with you needing x3 t1 of the same dragons for t2, etc. But with random dragon egg packs....  Weapons can be fordged to be better using reagents you find in game so that's easy to do. You get more weapons for 2,500 gems...but it's a RANDOM weapon pack that you MAY easily get more of the same weapon if you're unlucky and more than one weapon is 100% useless.  But through all this it's a super fun game! It's engaging, you WANT to upgrade your dragons...you WANT to succeed for fun! So why not the reccomendation thumbs up?  Well, let's discuss why I stopped playing. Remember when I said that Runes can make or break a game? I would have a full rune page of damage runes mix with T2/T3 runes and deal so little damage it's pathetic. Then randomly, mid match (Sometimes never) I suddenly deal massive damage. With a page full of Cooldown runes, I notice my cooldown's aren't getting reduced. Then suddenly, mid match my cooldowns half they were.   My rune pages weren't always active. So, I send in a ticket like normal people and figure I'll stop playing for a while till it gets sorted out.   That was a year ago. No comments back.  Also, there were no updates to the game in over 6-7 months.   So, while it was (And is if the bugs don't kick in) a super fun game, until the bugs get worked out, I don't see much more redemption for the game.  Perhaps in due time I can update this and say it's back in business. But right now, it pains me to say... No.",
            "review_score": "-1"
        },
        {
            "review_text": "An enjoyable game.   Pros: -Epic Dragons -Epic Weapons -Daily Rewards  Cons: -New players get matched against ranks 30+ -War Titan/God (Cant join another game till old one is finished) -Most people who play dont speak English ( Plz dont be offended )   ",
            "review_score": "1"
        },
        {
            "review_text": "Not worth putting your time nor money into. Staff doesn't do anything for the gamers here. They used to. No upgrades for months. A few friendly players here. If I play it's because of them. :) But that's all. I'm hoping there will be something along the line...but I won't hold my breath.",
            "review_score": "-1"
        },
        {
            "review_text": "Not being a big fan of MOBAs myself, I found this game to be extremely entertaining. I love the take on the genre, and I know others complain about the controls, but frankly, I found them to be a welcome change rather than click click click! Why is this game called Dragons and Titans? You're a dragon lord, who rides dragons into battle. Now, why this is cool is you get a dragon with it's own unique abilities, and your rider can use a helpful weapon, so rather than filling inventory with objects and potions you're using abilities you specify as you progress. Once you reach enemy base, you find YOUR Titan is trapped there, and once you break the cage, you free them.  Now for the negatives I noticed. If you are just trying to practice to get a feel for the game, you will want to go and do the prologue and the acts. That's fine and dandy, but the learning curve is harsh even on Easy (because yeah, when I'm new, I'm going to hit Easy, k?) So you will find yourself frustrated time and time again with going through the entire thing after losing 4 lives (4 total, you get 3 hearts, and once you die after that, you have to start over).  The biggest, most horrendously awful thing about this game: Sometimes, those acts bug out. Mobs will not come on que as they should to progress, leaving you looking around frustrated until you decide to quit. The good news here is that if you quit 'the match' (again, this is an act, not playing with others) you will be able to try it again and then the enemes spawn accordingly.   I don't know about you, but that seems almost game breaking to have to QUIT just to play the damn thing. I'm genuinely hoping this is addressed and repaired.  Aside from that, I do recommend this game, it's fun, the music is fantastic, and you feel like you're getting somewhere (when things aren't wonky). ===Edit=== Also, some people are complaining that this is a pay to win game. As of 3/15/2014 this game actually gives you freebies for doing tutorials and stuff. Free crystals to buy a pack of dragons and weapons. No, you can't specify which ones you get, but I'm not complaining x3",
            "review_score": "1"
        },
        {
            "review_text": "If this would be the last video game on earth, you should try chess.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ever, glitchy bad controls has a lot of bugs when it comes to 'quests', and you can't even start pvp.",
            "review_score": "-1"
        },
        {
            "review_text": "It is fun dragons are awesome weapon are good art are impressive but i can't choose map and ♥♥♥♥ duplicate dragons in team my team got 3 of the same and instant lose",
            "review_score": "-1"
        },
        {
            "review_text": "It's a really good game!",
            "review_score": "1"
        },
        {
            "review_text": "Neat game, kind of enjoyable.   There are some gamebreaking exploits/bugs that seem unfixed though. Not so great for a competitive game.",
            "review_score": "-1"
        },
        {
            "review_text": "its a great game , each dragon with diferent abilities , same thing with the weapons , but if they ad more modes to it , it would be great , also i think the acts deserve to be free , finish act 1 , get noxwing , go act 2 , ect. but over all , its great ",
            "review_score": "1"
        },
        {
            "review_text": "The Game is Actually Good. Though there are Situations where you need to farm alot just to get a Dragon. And Weapons. There are Dragons of Different Tiers which you need the same number of dragons to upgrade. Lets just say you need a duplicate of that dragon to upgrade it. You can instantly get higher tiers but its only a slight chance of getting a high tier dragon. Played this game for quite sometime Its good Not that bad. But The controls will need some time to get used to.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super easy, but the graphics are so great and it's really fun, so if you're an inexperienced player or just feel like playing something easy on the mind I'd totally recommend this (:",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite the charmer, very well thought out.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't stand more than 2 matches because it has nothing of 'fast pacing', plus riding a dragon includes 'flying' but you don't actually fly, since there are high mountains that you can't cross. Playing this game as a 'dragon riding' game was a frustrating experience, and as a MOBA, it was a 'nothing new' like experience,",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Takes MOBA concepts and puts them on the backs of dragons, which is never a bad thing. Dragon, weapon and spell combinations offer plenty of play style options. Solo and co-op play as well as ranked battles.  Cons: Rune system leaves a little too much to chance. Forces some social game aspects into the mix with Battle Marks. Only one map.  I have mixed feelings about this game. However, I do recommend to try it out. It's free after all.",
            "review_score": "1"
        },
        {
            "review_text": "its very good awesome graphics, awesome game",
            "review_score": "1"
        },
        {
            "review_text": "Hello, do you like the dragons ? YES ? and do u like the challange ? YES ? Then u find a great game for you. Game is simple to understund and easy for controll. Negative is to You can play only ACT1 if u dont pay 19€ for Titan Pass. Then free is only demo of first chapter :( But still, i recomending to almost try this game. Have a nice day players.",
            "review_score": "1"
        },
        {
            "review_text": "Actoin pack and Hard to get away from.",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't say this is pay to win, but it's definitely pay to get what you actually want. You can purchase what you 'need' with in game money but what you get is random; so if you wanted that shiny gold dragon on the list you either buy it with irl money or keep buying random ones with in-game money, which you won't want to do. Each random 'pack' of dragons (which is only three may I add) costs 5000 in-game money and you need more than one to get the highest teir dragon... Storyline missions and battles only give you around 20-60 each. Don't think you can complete tutorial objectives to speed this up as you start out either, how about a 50 reward for a task that requires you spend 150.  So you either want to pay or you're in for the hard slog for that shiny gold dragon you set your eyes on.  This game also doesn't have much to do when it comes to the matches in multiplayer and from what I've seen there is only one map per game-mode, making it rather boring after a while. The tutorial is lacking... the options are even more lacking... i.e. prety much non-existent, and I can see why it makes some people think facebook game... I also came to the realization that this game isn't technically free to play at all and that's a misleading claim to draw you in. The DLC for this is literally the game and theres only two parts of DLC so far, which may I just say you will not want. Each DLC gives you 10 relatively short missions and you have to complete each mission 15 times over with different requirements to unlock the best prize. That isn't replayability, it's just a SLOG. No prize is worth the aggrevation of dragging yourself through the same 10 scenarios 15 times over! So this game is not only mingy, but misleading, very short on content and is money-intensive.  I'm still playing it, but it's not getting a thumbs up from me.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolutely amazing! Great strategies and a really great community make this game 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Its SO COOL",
            "review_score": "1"
        },
        {
            "review_text": "So exciting! TRY IT, FELLAS",
            "review_score": "1"
        },
        {
            "review_text": "People are giving this game too much of a hard time. I actually played it back when it was still just on Facebook and on the website and I have to say I like it a lot more now with all the new features and gameplay and gameplay modes. The campaign mode is okay but I would like to see it a little less cashshop based but hey, it's a free-to-play game so who am I to complain, right? Well I just feel as though if I am going to pay for something I want to choose to do it, not be forced to do it.  The graphics are great and compliment the tone and style of the game very well, although I do think some minor adjustments could be made to the camera angles. The game may need a good re-skinning. The overall basics and dynamics of the game as well as the controls are almost perfect with the exeption of a few dragons which I had difficult getting to work right (I.E the dragon that rushes forward but can't really attack) the music is good and the PVP game selection is great which is nice to say in a MOBA game because I like to get right into the action.  I have faith in Dragons and Titans and so should you because there's nothing more kick-♥♥♥ than flying on a dragon and pwning other people flying on other dragons in an arena. Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "Game Doesn't Work, and there has been 0 response from support after 3 months.  When i first tried playing i played through the first two prologue quests afterwhich it said to use my crystals that i earned to buy a dragon from the stables. Went to the dragon lair and bought them but got no dragons out of it after which after many reloads and redownloading still no dragons in my lair and its stuck on that quest of 'choosing a stead'.  Only option to break it is spend the money to buy 5000 crystals to get a 3 dragon pack which is kinda stupid if i havent even gotten to try the game past 2 prologue missions.  Sure it could have been worth a try but because of this bug i can not support this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a bit of lag for me, but overall it is a good game :3 If you like dragons and PvP this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I can't not play it. Except....I wish the next eps didn't need money to play them though. That and I wish that they can add more to the game....Its great it really is but...don't make the game free you have to BUY the eps",
            "review_score": "1"
        },
        {
            "review_text": "cute and nice game lol. relieves my stress",
            "review_score": "1"
        },
        {
            "review_text": "its a nice game...",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game because it has many fun elements. However it also has its cons.  Pros  - Tons of Dragons you can play as, with just as much weapons to use. - Single Player and Co-op mode for those who don't want to deal with PVP - Good storyline that is not long and obnoxious.  Cons  - Unable to select map and team - In Single player, the map is always MOBA - Crystal rewards are too little for players without the TITAN PASS  It is a very fun game, and as a big dragon fan, I adore all of the varying dragon styles. If you have the free time, I recommend playing this game.  However, make sure it doesn't crash or close before entering a multiplayer map. Mine closed as the timer was counting down and now I am unable to play it.   Other than that, no real problems with this game. ",
            "review_score": "1"
        },
        {
            "review_text": "This called a game awesome",
            "review_score": "1"
        },
        {
            "review_text": "IT IS A RELLY COOL GAME.IT WHERE YOU HAVE A DRAGON AND YOU FIGHT  STUFF.AND IT IS ENTIRELY FREE.AND  THERES MULTUIPLAYER.  THE MULTIPLAYER PART OF THE GAME IS THAN THERE IS TWO TEAMS AND THAY STOLE YOUR TITAN.YOU WILL HAVE TO SAVE  YOUR TITIN WITHOUT THE OTHER TEAM GETTING THERE TITAN.  THERE IS COOL QUESTS THAT ARE NOT  MULTIPLAYER.SUCH AS ,AN ARENA,EXPLORING  CAVES,AND FINDING TRURESHURE.  I RATE 6/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm not big into MOBA's but I do rather like this one, especially the way they designed the DLC so you aren't bogged down with microtransactions. It is a beautfiul game, free to play so you can decide if you want to commit to the DLC. If you like Dragons, it is worth looking at.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, little laggy on pvp &amp; co-op though.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome play style :)",
            "review_score": "1"
        },
        {
            "review_text": "i love these game",
            "review_score": "1"
        },
        {
            "review_text": "among many moba games i played, i can say i like this one more than most. the controls feel more 'action' based than the rapid clicking of the right mouse button ou're pprobably used to in a moba. a refreshing change.  the skills setup for each 'hero' is left up to the player: a dragon gets their own 2 skills(one your basic attack, triggered with the left mouse button, and the other a skill usually exclusive to that dragon). it also gets 2 additional skills from a weapon you have chosen(among the free rotation weapons and what you already own), allowing a healer to set mines or cannons and a close ranged nuker to assassinate from long range.  i cant cover everything but i will say this: rather than the pay to win people in the review section say this is, the experienced(or atleast the guy who played this game longer) will have an advantage, unless the person who pays really opens up their wallet to forge his weapon to the max right from the start and instantly jumps to a fully upgraded dragon(and even so the advantage is small enough to allow everyone a chance at winning)",
            "review_score": "1"
        },
        {
            "review_text": "It's a cool game where you ride a dragon and fight bots or other players. So awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! Awesome dragons, awesome weapons. My one and only complaint is that there is no way to buy the dragon or weapon or skin or avatar, etc you want. You either have to grind out 5000 gems and buy three random dragons, or do the daily reward. And even then, you're only getting dragons. There is no way to buy avatars or skins except by the Titan Pass. I don't like the Titan Pass because it takes the fun out of playing and grinding to get new stuff. I like having to earn gems to buy dragons, I just wish I could get more than just dragons and weapons and runes with the gems I earn. Even if the avatars and skins were like 10,000 gems or more then at least I could earn them myself.   A good idea for the people making money on this game:  Let people choose between grinding out a lot of gems to get the skins or avatars or buy them for real money.  OR  They can buy a specific skin or avatar with real money AND hold events every now and again to win a free or reduced price avatar or skin.   There just needs to be some way that players can get one specific thing in game they want. The Titan Pass takes the fun out of the game because it unlocks everything and leaves nothing but the gameplay, which is totally fun don't get me wrong, but part of the fun is grinding to unlock things bit by bit. It gives players a sense of accomplishment to unlock things themselves.   I have read through a good portion of the reviews and like 90 somthing % of them that like this game, complain about the Titan Pass so I am not alone in this and you might want to change it so that your number of players increases. People will pay $5 for an in game dragon. They are unlikely to pay $20 for every dragon. Yes, there are exceptions because it is a good deal if you look at what you're getting for $20, but for the rest of us, we're looking at the fact that you're taking away the fun of unlocking things.   Forgive the repetitiveness and lengthiness of this review and I really hope those in charge of how this game works will take my ideas into consideration.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome shooting game, with DRAGONS! Cool upgrade features!",
            "review_score": "1"
        },
        {
            "review_text": "A good concept ruined by poor execution.   All dragons, while unique in appearance are all very similiar. Each dragon only has two attacks, and almost all of them have a standard breath attack. So really dragons only have one attack that is different from another dragon. The way they tried to fix this, was with weapons. Equipping a weapon will give your dragon two more attacks depending on the weapon you equipped. The problem is, this doesn't make things more unique, it makes them more stale.   Say you and another dragon have the same weapon equipped. Well now you and that dragon only have one unique move between each other, and he's a completely different dragon. This is made even worse by the fact that there is no item shop in game. Dragons scale with levels, thats it. So while you might do good damage to an enemy DPS, theres nothing you can do to help you damage against a Tank, or if you need more HP to survive, theres no way to get it.  Speaking of 'no way to get it', thats what I have to tell you bout a dragon you might want to buy. You see, you don't just buy the one you want, oh no, you have to get lucky and play whats basically a slot machine and hope you get lucky. Oh you got the one you want you say? Well guess what, dragons actually have different levels outside of the game that make them stronger. So while you may have gotten that awesome Gemtalon I, he's nowhere near as strong or awesome as Gemtalon III.  Its a watered down moba, aiming to cash in on the popularity of dragons by locking them all behind a slot machine and hoping you spend a bunch of money to get one, before you realize the game isn't deep enough to warrant spending money.",
            "review_score": "-1"
        },
        {
            "review_text": "ah its ok but their should be first person, beable to dismount and fight and bows it would be better",
            "review_score": "1"
        },
        {
            "review_text": "This a great game and is worth checking it out since it is free to play. You fly around on a dragon kill other people who fly around on dragons and it is super fun.",
            "review_score": "1"
        },
        {
            "review_text": "I would rate this game -100/10 because I can't even play it on my computer cause it can't connect or crashes and when i went to my friends house to play it,it sucked you should just forget about it and get DOTA",
            "review_score": "-1"
        },
        {
            "review_text": "yea!when i downloaded this game i thought it was a POOR game.BOT oh its amazing stuFF.PLAY dis game .u will surely like iT#.",
            "review_score": "1"
        },
        {
            "review_text": "this game would be awesome IF it wasn't for it needing soo many tweaks and fixes.   First of all is the targeting. you virtually have no control over it. sure you can hit the space bar to select the closest one to you, but too many times a bird would fly by and the dragon would act like the dogs from teh movie 'Up' when they saw a squirle and immediately auto target the bird. This is the game breaker for me. Too many times have i had a definate kill then all of a sudden a bird would fly by and my targeting would jsut switch and let teh enemy dragon get away.  Second, there are alot of balacing/Tech issues with the game. The Server lags tremendously. too many times do you hit a skill button and it does nothing, in match making it puts you in with other players that are way higher developed than you. For Example, when the more you play a particular weapon or dragon, the higher rank you get with it. it goes through the typic progression of no rank -&gt; bronze -&gt; silver -&gt; gold -&gt; diamond. when you rank your dragon up it moves faster and gets more health and the weapons get shorter cool downs on the skills it gives you. this is a huge advantage in games as either they can jsut out run you and get away or chase you down with you having no hope of escaping.  Thrid, is how oyu upgrade your dragons. they go from I - IV and they get bonuses each time they upgrade. you upgrade by getting 3 of a particular rank. you get dragons either by random chance by using crystals or you can buy the rank 1 for 2.99. if you have a dragon you really like and want to get it to rank IV you either have to get really luckky with the random eggs OR you can by it for 81$ US. Also as you lvl up you can start using Runes and to get runes you have to buy them with either crystals or using real money and even if you use real money the runes you get are totally random. this is basically a pay to win game and if I am going to use real money i want a definate choice on what I spend my money on, not a random chance.  Lastly is the game type selection. Instead of letting you choose the game type you want to play, the map is voted on and then for the next 30 min you HAVE to play that map.   This game is a huge let down because it has to the potential to be a great game, not only on the PC but console platforms too. The game play is fun, but incredibly fustrating with all the issues it has that I mentioned above. If they made the tweaks/Fixes to the issues i stated above I would definately recommend this game, but as it stands now I can NOT in good conscience recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best free games I have ever played, it's even avalible on facebook. I dare say it, it is better than league of legends.",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun but very glichy on how you exit the game and when my comp over heated then i couldnt ever load back on it would always say a web browser issue but other than that the game is insanly fun ",
            "review_score": "1"
        },
        {
            "review_text": "Fast play, funny game.",
            "review_score": "1"
        },
        {
            "review_text": "guud game. Very much fun. Entertainment good. So not needed to pay for things that you actually need to play (at least not many).",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "I like it, easy to get into, easy to play, even your mum would be able to play it easily..if she loved you that is",
            "review_score": "1"
        },
        {
            "review_text": "Pvp your pitted VS pre made teams way higher level than you, They need a steam server for new players. Many others can't even finish the starter quests. Way to glitchy and unfair match making.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game very well done to me cause it has everything to be a game that will entertain you for hours!!!there are many dragons to collect and many quest to complete and also weapons and many other things!!there is a multiplayer mod to face the other player and see what dragon is the best!!",
            "review_score": "1"
        },
        {
            "review_text": "The game is great love it its completley if your reading this GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "a nice to kill time and have fun. I recomend this game :).",
            "review_score": "1"
        },
        {
            "review_text": "Hoard + Dota in a fun way :) No in-match items: Hoard all gold for a titan spawn and for a personal xp, and feel no pain as newcomer. You only have to pick a weapon for your dragon at picking phase, which is not very complicated. No counter-pick playing: You won't see enemy team until match start. Good for newcomers too. Not exactly pay2win: You can buy unlocks, but you also can earn them for playing in any game mode.  So it's an easy-to-start game, not like most MOBA games. But remember: stick to a team from a start!  Also, DRAGONS!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun but you need to be able to take it seriously. I like the quests and the fun in this game. Riding dragons is fun and then you get to battle. It gets pretty hard at times with enemy, you need good weapons.",
            "review_score": "1"
        },
        {
            "review_text": "Great concept but terrible execution. Game is unbalanced as hell, and bug ridden. Every update introduce new unbalanced items and new bugs. Old bugs drag on for years and the devs pay little attention to the quality. The game started on a good concept but was ruined by the developers due to ignorance and incompetence.  There were 3 maps in the game, 2 of which were rubbish and nobody used to play maps other than the chaos/moba map. Instead of improving the other maps, they would force players to play random maps so the un-performing maps would be played. In addition, the 3 maps play differently, and the dragon/weapon selection would perform very differently depending on the map. This means no matter how much effort you put into this game, the outcome of a match is randomized, depending on which map it puts you into. This gives you an idea of the kind of people they are.  The dragon and weapon selection is made before entering a game, and before you see any of your teammates or their selections. This means the player cannot choose combos that compliment the teammates. For a moba game this is horrible as players can never find a balanced team. Getting into a game with all support units against all attackers means a waste of 5-20 minutes of time.  The game had a skill shot pvp system where players had to aim their shots. To dumb it down in a failed attempt to attract players, it was chcanged to auto-aim. So instead of maneuvering and finding an opening to shoot the opponent, players now hold down the mouse button and sit idle until someone dies or escapes. The weapons/dragons that are harder to hit but hits harder, are now auto-aimed just like the easier to hit pee shooters. They were left un-balanced after auto aim was implemented 1-2 years ago. Very little attention was paid to balance the gameplay, as a matter of fact, that there are only about a quarter of the dragons/weapons that provide competitive performance. The rest create useless combos that cause teammates to hate you.  The game is plagued with hackers and lag bugs. Hackers would speed hack to win. They are reported by various over a year and no action would be taken. As a matter of fact, we would write support/report emails and would not hear answers for months, or ever in most cases. The lag bugs cause problem in gameplay where players take damage from the position they were in 1-2 seconds ago. Thus from your own computer, you'd think you are out of fire range but would still be taking damage. Furthermore, players are harmed by all kinds of invisble fireball, dragon breath that the server decided not to display.  It is not bad to try out the game to taste the concept of a lighter version of moba. But the game is far from good and the devs are less than competent to bring it up to standard.",
            "review_score": "-1"
        },
        {
            "review_text": "it's not my type of games ...you can guess how i find it",
            "review_score": "1"
        },
        {
            "review_text": "Good for beginners as its very easy to learn, just point and click mostly. Pros: Easy to learn Many different choices of players Matches arent more than 20 minutes(mostly)  Cons: Nobody is ever playing Takes 10 mins avg. to find a match Pretty bad graphics  Overall its decent i guess",
            "review_score": "1"
        },
        {
            "review_text": "really love the game",
            "review_score": "1"
        },
        {
            "review_text": "A nice F2P game, works like LoL, DOTA etc. With diffrent gamemodes.  You can earn ingame premium currency easy, this takes a while but that's to be expected. You level up your 'profile' and unlocks shops at the world map to upgrade yourself with weapons and runes etc.  After doing the tutorial its just to jump in and play, even though the tutorial could use a remake since it dont cover everything.  There are a lot of dragons to be gained and if you find one you like it rewards to play with it a lot since you gain mastery levels in both your dragon and your weapons that make them a little stronger.  Try it out and see for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Ok whre to start. This Game is quite different from the usual Dotalike games. Its faster and round are shorter with usally more kills.  The movement system is one of the biggest differences. There is no klick to move to location. Instead the dragon moves forward by either pressing shift or right mouse button. And it is always facing the mouse coursor. Space is used to move the dragon backwarts. There is no sideways movement.  Most skills are skillshot fiering in a specific pattern from your dragon. For example dragon btreah usally fires out of the fron (duh)   It less complex than other titles because it doesnt have items to buy in a match as you collect gold. Instead your skills will be determined by dragon and weapon choice for a total of 4 skills (two from each) and 2 additional spells like it it done in lol.   There is a huge selection of Dragons (about 30) and weapons (about the same amount) all of which play somewhat differently. You get 3 random dragons and weapons permanently as part of the tutorial. Other than that you have the usual rotation of free dragons and weapons.  The forced tutorial is one of the worst parts of the games. You have to go through serveral singleplayer mission + one match against the AI (a quite short one, just explaining the dota like mechanics) if you want to have full access to the multiplayer part. This should take about 45 minutes of gameplay and could be a letdown for some people.  The game is somewhat pay to win. You can pay for dragons and weapons(randoms or specific ones) and only radom weapons ad dragons can be bought in ingame currency. Dragons can be upgraded by using 3 Tier1 or tier 2 dragons of the same type. They get some slight bonuses for it. Like 8% less mana cost and 4% more speed. Something about that line. It is achiveable by just playing but it will take quite a long time and you have to be lucky to get the right random dragons. Buying a tier 3 dragon costs about. 45€  There is a forging system which make weapons a bit stronger (something like 5% more damage, less cooldown, less mana cost) which can be payed for to get it as lot quicker.  And there is a rune system. which you can buy runes for with real money. (only random) Of couse tier2 and tier3 runes are available for non paying players too but they take a long times to craft it seems. (about 3 days for one tier 3 rune and one day for a tier 2 rune). Sadly i cannot asses how strong tier 3 runes are in comparison to tier 2 and 1. Here could be the part where the real pay to win could lie.  In total i would reccoment the game though. Its free and has dragons and it seems quite balanced and knowing the game is more important than bought 20% performance. You have to endure the tutorial though. Which isnt actually that bad.",
            "review_score": "1"
        },
        {
            "review_text": "hey guys uhhh the game wont load it comes up with this unable to connect to server proxy error thing is the server on line or is the game busted please reply and thanks",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, Lots of fun. Like that you upgrade your dragons every battle, but ultimatly level up your skill. You should defenatly get it.",
            "review_score": "1"
        },
        {
            "review_text": "it's good",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome and gettibg better because is now in the steam^_^ I love This game so much ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Easy to play Easy to Master EZ win EZ Crystal Cute Dragoon &lt;3 recomend to all who love dragons :P",
            "review_score": "1"
        },
        {
            "review_text": "Nope",
            "review_score": "-1"
        },
        {
            "review_text": "its an amzing game where u can ride dragon y not play it",
            "review_score": "1"
        },
        {
            "review_text": "With all the design sense of a blind autist, this game is the greatest acheivement of alienating a player base, while simultaneously ♥♥♥♥ing up everything they set out to do.   Confusion simulator 2014",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks i cant even load it because it says it cant connect to the server",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game... until ERROR- PROXY CONNECT ABORTED came up every ♥♥♥♥ing time I wanted to play. I can't play it anymore. There's nothing wrong with my computer, I can assure you, and I'm ♥♥♥♥♥♥ I can't play this awesome game I had gotten so far in.",
            "review_score": "1"
        },
        {
            "review_text": "If u like dragons well WHO dosent loves dragons. dragon are vicious and FRIKIN AWESOME so ya i highly recomend thi game. unless u dont like dragons",
            "review_score": "1"
        },
        {
            "review_text": "good dragons, but have a 'nice' price to get them ",
            "review_score": "1"
        },
        {
            "review_text": "This game is very awesome. You can customize your dragons to your liking with skins and pair it with your favorite weapons. There is story mode, PVP, Co-op and multiplayer. Graphics are fabulous and the control is very easy. Definitely worth the game to try out.",
            "review_score": "1"
        },
        {
            "review_text": "not worth it... cant even find out how to access shards and no one in game is willing to help out",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "I like the game. But, I think that it makes no sense to not lable this game as a demo because you have to pay to be able to own the whole game. False advertising is what that is called. But, overall, it's a great game so, yes.",
            "review_score": "1"
        },
        {
            "review_text": "this is an amazing game filled with defence and offence, sort of a strategy but just more fast paced",
            "review_score": "1"
        },
        {
            "review_text": "Cool story but needs more Dragons.",
            "review_score": "-1"
        },
        {
            "review_text": "MOBA in air",
            "review_score": "1"
        },
        {
            "review_text": "Only got it becaus i got free downloadable content from buying my 290x I imagine some people might like it. Your typical MOBA",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy this moba compared to other mobas i've played.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game more than any other game i've ever played and thats a long list of titles ",
            "review_score": "1"
        },
        {
            "review_text": "I liked how the game has both a story and a multiplayer aspect to it.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of the worst moba games ive ever played. I recommend not even glancing at this hideous game.",
            "review_score": "-1"
        },
        {
            "review_text": "verry nice game,a little boring after a while but now i'm back to play again,after i played 30 h last 2 days in facebook :))",
            "review_score": "1"
        },
        {
            "review_text": "I usually play this game offline but it's still very fun, there's one thing thats an issue people will claim you're a hacker just because you're good at the game. .-.  pros  -Awesome mounts -dragon/weapon majostry  -upgradeble weapons/dragon armor -titans pass -offline gameplay -decent bots  -unique maps/game modes  -single dragon buying price is fair  cons  -kids  -ill mannered adults -spammers -actual hackers -sometimes can be hard  -bots/minions are too op",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly bad. Forces you through several matches to unlock basic systems (including the rune system which starts unlocking at level two but you cannot actually access until you go through enough of the mandatory quests to unlock the rune forge itself). Balance is terrible, it amounts to whichever team can focus fire down a dragon first will snowball and win. No keybinds for assigning skill points for leveling up, wouldn't be a problem if not for the fact that your dragon is mouse controlled. If you like holding down your left mouse button continously for 20-40 minutes then this game is for you!",
            "review_score": "-1"
        },
        {
            "review_text": "Brilliant time consumer, great gameplay, would love to see packs of different values with both weapon and dragon random packs.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game on facebook should I have to restart it if i played the game on steam ? but Dragons and titans page on facebook said 'In the coming day, the Wyrmbyte developers will be completing work to allow facebook players to migrate their accounts over to steam.All progres on your steam account will be combined with your facebook profres, so nothing will be lost at all. We'll have more information on this process later , but in the meantime just join us on steam now!'",
            "review_score": "1"
        },
        {
            "review_text": "So much bad reviews now only if they can get it to start. It is true that the game encourages you to buy or lose your life buy playing hours of this game. The repetitive style of the game is terrible. MOBA, ARAM and other maps are like rts in some ways which is fine. The only thing this game has you going are the dragons and the weapons. They need to lower price dragons and weapons and actually get the steam download to start on the pc. I will reccomend when they fix it. If they dont then i will not reccommend it at all",
            "review_score": "1"
        },
        {
            "review_text": "all in all i enjoy the game",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game",
            "review_score": "1"
        },
        {
            "review_text": "I recommend people play this, but there is ONE bad thing: If you leave a match before you win, you get temporarily suspended from multiplayer mode. What the heck, creators!",
            "review_score": "1"
        },
        {
            "review_text": "we went the seletion of map and doom att go down a little pls iand hack should stop play ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite mmo's from now on",
            "review_score": "1"
        },
        {
            "review_text": "To me the game is alot like league of legends but free, is it exactly the same no not at all. It is just a game where you fly on a dragon smashing enemies with your weapon and burning them with your dragons breath. And with all game controls take a while to get use to.",
            "review_score": "1"
        },
        {
            "review_text": "I only recommend this game for anyone who are willing to pay LOTS of money to win against every single player in this game. But I am not a P2W player, I still manage to enjoy this game enough. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome game! Super fun and addicting but i think the act 2 and so on shouldnt cost money and if u have to for marketing reasons just dont give them a dragon for completing an act! I really liked act 1 and i think for people will play this game for the storyline other than pvp.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun, easy to get into and great for those who like League of Legends style games. :3 :)",
            "review_score": "1"
        },
        {
            "review_text": "Going to be 100% honest,it's not going to replace any of your current 'main' games you play or anything. It's not going to be that one game you go all mlg mode in. But meh, it's really fun to just ♥♥♥♥ around in when you are taking a break from the regular games you play :)",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, loads of beautiful and awesome designed dragons all with fun abilitys this is so far the only MOBA I enjoy and like playing. I feel they give too much with the Titan Pass they've just added though. Making it give you all dragons and all wheapons takes away the POINT of playing, which is to EARN dragons and wheapons. Plus skins were a way to show 'Hey, I REALLY like this dragon guys' and to show that through getting a skin JUST for that dragon. Kinda sad they did that, but I do approve of taking away the cool down on forging and rune combining.",
            "review_score": "1"
        },
        {
            "review_text": "they muted me for saying can u help me like omg but ill think about giving this game a thumbs up ok its on the verge and i really like this game so dont give me second thoughts abut downloading it to my computer becuase i took the time to learn the game and then i get m muted that =gay ok im sry for my langue but that just =GAY NOT SAYING THIS TO U GUYS THE PEOPLE THAT MUTED U NO NOBODY LIKES GETTING MUTED OK OKKOKOKOKOKOKOKOKOKOKOKOKOKOKOKOKOOKJUST LET ME THINK ABOUT IT  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. You actually control the Dragons. I love it so much! All the dragons are interesting and have different abilities and attacks. Some more powerful then others. You can level up and battle online. I suggest this to everyone from 6+ years.",
            "review_score": "1"
        },
        {
            "review_text": "This game looks interesting, but for some reason in the main menu, it loads about 75% and then stops. I can be quite a pateint person, but when I can take a shower, cook myself dinner, and talk to a friend that happen to stop by, and the game a STILL doesn't load, I think their might be a problem. If anyone can offer some advice to my problem please message me back, either way this game looks quite good.",
            "review_score": "1"
        },
        {
            "review_text": "I've played, this game is fun to play. I think this is an easy game to be played.",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately I cannot recommend this game to new users. It is a fun game actually, however I am not sure what exactly the developers were thinking pitting low level players/dragons against high level. It completely ruins the fun of pvp, which is the only place this game is fun past 30 minutes.  Pre 1250 rating, it is fun for new players becauase you are paired up against like levels and experience, but once you reach 1250, your pathetic lvl 15 player does not stand a chance. I mean it is so unbalanced that it becomes moronic.  I only about lvl 22 now, but there is no sign of fun anymore, as I have passed 1250, and it is now utterly ridiculous. It goes something like this:  You are level 15, with a 1200 rating. You join pvp, and are paired up against other lvl 1-20s. Then you hit 1250 rating because you are doing well and having fun.  You are now paired up against all lvl 40+ with max runes and teir 3+ dragons, gold or higher.  Lvl 15, vs all lvl 50s...Who's bright idea was that? Ruined game. Only veterans will stay, which is why there is a low population.  Strong 'do not purchase' anything, until they resolve that moronic rating system.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is like lol",
            "review_score": "1"
        },
        {
            "review_text": "you love a dragon? play this game",
            "review_score": "1"
        },
        {
            "review_text": "So here's a game where someone said 'If you put dragons in it, idiots will buy it!' Well this idiot did and it's simply not a fun game.",
            "review_score": "-1"
        },
        {
            "review_text": "Dragons and Titans used to be an awesome game. After several buffs and nerfs, the game wasn't any longer fun to play.    Things that I used to like about D&amp;T that changed:   The possibilty to invite up to 5 friends to form a team.  Having to use all different dragons in a match.  The old controls system without auto-aim.  Anything before the Titan Pass.   D&amp;T couldn't afford itself after the yearly Titan Pass, for it didn't create any beneficial profit.   What D&amp;T should of change is:   Starting with the Titan Pass (Same price for a month is more than enough).  Remove all Runes (stones collected within the matches), since this allows players to easily use hacks and sometimes stay low profile, and as well helps to keep the abilities of the dragons balanced.  Remove the use of repeated dragons in a match.  Weekly updates, including at least 1 weapon or 1 dragon.  At least 3 Moderators per chat (since not all are always able to be online).  Weekly developer or admin visits so players notice the interest of the D&amp;T team towards them. And last but not least, team XP in matches, instead of individual (This will give players a more pleasent and friendly match, since it will encourage all to assist for a common cause).  Some new ideas:  Replacing the collection of stones for Gold pieces to buy some upgrade for their weapons/dragons with a prior limit set, within the match. The upgrades could either have just a few levels but several type that does not mess the balance in match, such as ''Returning to hoard ability cooldown'', ''Short protective shield for teammates'', ''Dashing a small distance'', and stuff like that.  Anyways, there are many things that can be changed to make the game not just as good as it used to be, but greater. Lets not forget the improvements keep players interested, but every change must to be properly debated between D&amp;T team, in order to avoid colliding every feature or element in the game.  At the end, there is far too much that can be improved in Dragons and Titans, but the income must to be well thought, that way the D&amp;T team will always feel excited to work with such awesome game. The concept that this game handled is very insteresting and satifying, specially to those who love dragons. But if anyone wants the players to return to this game, a lot has to be done and responsabilities to be assumed.   Thanks D&amp;T for so many fun moments and to allow me to meet some of the coolest and easy going people to play with.",
            "review_score": "1"
        }
    ]
}