{
    "app_id": 263540,
    "name": "Villagers and Heroes",
    "release_date": "2014-04-17",
    "developer": [
        "Mad Otter Games"
    ],
    "publisher": [
        "Mad Otter Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "MMO",
        "Steam Trading Cards"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 1651,
    "negative_ratings": 1272,
    "price": 0.0,
    "description": "Welcome to a land you'll never want to leave! Villagers and Heroes is a free-to-play MMO game in which players experience not just the thrill of battling unique monsters or the satisfaction of tailoring an exquisite robe, but the pleasure of building lasting friendships within a friendly community.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263540/header.jpg?t=1517425646",
    "minimum_requirements": "OS: Windows® 10, 8, 7, Vista, or XP Processor: Intel® Pentium® D or AMD Athlon™ 64 X2 Memory: 2 GB RAM Graphics: On board graphics DirectX: Version 9.0 Network: Broadband Internet connection Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows® 10, 8, or 7 Processor: Intel® Core 2 Duo 2.2GHz, AMD Athlon™ 64 X2 2.6GHz or better Memory: 4 GB RAM Graphics: Graphics card with 512 MB of memory or more DirectX: Version 9.0 Network: Broadband Internet connection Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "This game provides almost everything that I would want from an MMO. However, there are a few downsides. I'll start with the bad first.  First off is the Vim System. It is kind of a negative thing for the game, but I can understand why it was put in. Vim is sort of like your crafting stamina, and it unlocks when one of your skills reaches 16. After you hit that point, everything you do when it comes to that specific skill will take up Vim points. Now, they do regenerate over time, but it's like every other game that has energy regeneration: few minutes at a time, and you only get one point back at a time. That wouldn't be so bad if you didn't need mass amounts for quests. The more you craft at a time, the more you use (e.g. one at a time for one Vim, or 50 for 150 Vim.) Gathering only takes one for each click, and sometimes you get three items instead of one, so that's not too bad. The biggest issue with this is that it greatly limits what you can do in the game each day. Sure, there are refills that you can buy (with in game tokens that you can earn, no real money required) and perks that cut down on how much is cut out, but if you don't have enough tokens or those perks yet, things can slow down pretty quickly. There are small 'free' refills that you can get to drop, like 15 Vim cornucopians, but those aren't very common; there are also big refills, but that requires you to level the skill. If you're running low, and you're only around 10%, you're better off coming back later. The good side of the Vim system, though, is that it DOES slow you down. Without it, you would see level 1s taking up all of the high ranking gathering spots, and people who could actually craft with what's gathered there wouldn't be able to proceed because of the farmers.  Second off is the way your skills work. (I'm going to be giving you my point of view, since that's all I really have to work with here.) The good thing about the skill system here is that you have 6 set usable combat skills. The bad thing about the skill system is that you have 6 set usable combat skills. Now, on my priest, that's not too bad; I get a personal heal, a shield I can give to anyone, and the rest are damage spells. However, if I want to be able to heal SOMEONE ELSE, I need to find a piece of gear with that specific skill on it. If I want to keep that skill, I have to keep moving it from gear piece to gear piece, and believe me, that can get expensive pretty quickly, especially if you want to keep A LOT of skills that benefit you. If you have more skills that the free slots cover, you have to either abandon all hope for them, or use special stones to be able to tack as many on as that gear piece or weapon has space for. (You can also earn these in game, but if you're like me, and acquire a lot of pieces with great perks, youre going to run out of them VERY QUICKLY. They aren't exactly common for daily bonuses.) However, this does force you to think about which ones benefit you the most, so no one person can hoarde all of the skills and be insanely overpowered.  The third thing that I found to be a little irritating is crafting costs. Now, to craft things, you need to go to a station with all of the materials required (that you gather yourself) and craft whatever your skill allows. Now, a few friends of mine and I have sort of agreed that it's a 'station rent and craft time' cost, but the higher up you get, the more expensive things get. That's a little annoying counting that I have to gather up all of these insane things to craft it in the first place. The sellback value isn't too great for them, either. The most recent thing I crafted cost me around 15 and a half silver, and it sold for a measly 24 copper. Pretty crappy, right? It feels pretty imbalanced. However, with how much hunting and questing most people do to kill time getting back Vim, I suppose most don't notice.  The fourth thing is the party/friend system. This one isn't necessarily a bad thing; it's just more of an annoyance. When adding someone to your friend list, you have to be standing right there with them. There's no 'Add Buddy' button on the friend menu. You have to track them down and do it yourself. And, while we're talking about the friend list, let me tell you what you can do with your plethora of friends. You can see their name (good, that's needed), their level (also good, I suppose), and if they're online or not(very good; I mean, you can't whisper them if they're not online, right?). Aaaand..that's about it. You can't do anything with them. Can't unbuddy them, can't invite them to a party, nothing really helpful for people who are doing their own thing and then decide to be in a party. You have to do all of that stuff in person. (Well, in character, I guess. You don't have to walk all the way to your buddy's house to do things in game.) Oh, and the party invites work the same as a friend invite. Have to be able to click on them.  The last bad thing that I've noticed about this game is how you discover new areas. In most MMOs that provide a means of fast travel (which, by the way, isn't free in this game. It requires travel stones to go from one area to another.), you only have to enter the area to register that it's been discovered. The two exceptions that I've run into are WoW and this game. Like WoW, you have to activate a specific something to be able to travel there. In this case, there are travel pads that you have to run over. You get a free travel stone for discovering it for the first time, and bam. Area is now open for travel. However, that is also the drawback. If you're entering a new area that is just below, at, or just above your level, you had better be methodical about killing everything along the way. Most areas have the travel pad around the middle of the map if there isn't a town there. If you die before you run arcoss it? Better hope you have a resurrection stone. Don't have any left? You get to try again from the start. It's still labaled as 'undiscovered'. Better hope that things haven't started respawning yet.    Even through all of the bad, there are a lot of fantastic things that I love about this game.    First off, it's free. No pay-to-win here. The only thing that I might recommend paying for is extra storage if you like to hoarde everything. But, even that's not necessary. You get a total of three bags to start off with, a vault (with, I don't remember, 25 or 30 spaces?), and, if you decide to get the free house license, ANOTHER storage vault. So, unless you REALLY like to hoarde EVERYTHING you pick up, you don't need to buy anything with real money.  The second thing I love about this game is that there is no limit to what skills you can learn because everyone can learn everything. Want to focus soley on mining and smithing? That's cool. Want to max out just your plant lore? Go ahead. Want to be a master in all things ore, wood, clothing, food, and potions? No one's stopping you! The sky is the limit, as long as you have patience for all of the Vim you're going to be blowing through.  Other than that, it's really just your basic, run-of-the-mill MMORPG. There's things to fight, places to discover, quests to complete, and lots of fun to be had. If you're looking for a casual game to play alone or with your friends, this one is one that I recommend wholeheartedly. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Villagers and Heroes us a Hidden gem in a sea of Free to play games. Dont be put off by the tutorial this game try's to introduce to you slowly its features and soon you will be chasing bounties or delving into its massive crafting system (a full 70 levels for each profession and gather) The world is truly Huge, 500 hours in and I have not seen all of it yet.  One of the biggest things about this game thet makes it different from the sea of other Free to plays out there is that its crafting system is fully intergerated into the combat system, crafting isnt something just tacked on its a major part of the game system and this isnt truly noticable until much later into the game when you start to look at ability scores and stats and greater detail.  I have also been quite surprised by the sheer amount of Adult players in this game, most people I meet are 20+  One of the major letdowns has been the steam crashes, but the devlopers have been working very hard and getting as much informtaion from the community as they can while keeping us updated (which as you know is very rare in this day and age) I look foward to the very bright future of this game.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game, beacuase I like crafting and farming. If you don't like that, you'll probably not enjoy it as much as I do. My only complaint is the skills are a bit delayed, and the graphics a bit outdated. But other than that, the idea is pretty cool :) I Actually choose this over Archage. Call me weird, but I didn't like the 'pay to have fun farming' concept in that game :p",
            "review_score": "1"
        },
        {
            "review_text": "I've played Villagers and Heroes for just over an hour so far. Based on first impressions, I think I can safely affirm that this is a fine free to play game. While the aesthetics of the art style remind be of a classic Disney animated film (and, in my humble opinion, this is NOT a negative), I find it very pleasing to the eye. The game performs admirably on my gaming laptop, and I have had no major issues.  The gameplay, while mirrioring that of most MMORPGs, doesn't yet feel repetative (of course, my opinion on that may well change as I play more). I find it fun, engaging, and interesting. Talents are easy to use, but vary enough to keep me interested, in and out of combat.  I don't intend for this to be a long review, so, in conclusion, I will say that if you are looking for a fun, engaging, and pleasing free to play RPG, then I believe that Villagers and Heroes could be for you. I highly recommend it to anyone new to the genre, or even a seasoned veteran. ",
            "review_score": "1"
        },
        {
            "review_text": "I play this game because I like it, I have played this game for over 3 years and I still look forward to updates. The thing I loved right off is the simplicity, the easy going feeling you get while playing, the easy controls. I hate complicated controls, I detest the games that constantly tell you...'Go here now, do this now'. I never want to see the inside of another PVP game in my life! There is no pressure in this game to do anything, you can stand still and watch, chat, look at stuff or you can actively quest or bounty. You compete against yourself! You don't have to prove anything or fight anyone.   I am hoping that people reading the negative reviews (and even video's) posted by people who never even went past the introductory or the tutorial sections but still posted negative reviews will at least try the game and decide for yourself. Please do not be swayed by what other gamers feel and blindly follow someone elses lead. This game is most definetly not a hardcore game. It's not a kill each other and your friends, race to be the top dog, the first and the best. It's meant to enjoy by yourself or by you and your friends both old and new. The community is really great! The players are a wonderful group of people from all over the world, both young and old.   I also love that this game was built showing respect to all players and to women especially. It's not filled with bubble-headed bimbo's, scantily clad in what they called armor, but I call disappointing scraps. Some of the very reasons the 'hardcore gamers' post they do not like about this game are some of the very reasons I do like it!   So instead of letting someone else tell you how to feel about the game, how about trying it for yourself?",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing i love it and JUST GOT IT TODAY its amazing you can fight has hero but do normal villager things has a villager with you know a sword or something on your back but what ever the only thing thats bad about the game is it crashes after 15 minutes or so when your cooking, fishing, collecting, etc thats needs patching has soon possible and this game is amazing i love it just needs that issue to be patched and thats it, 100% enjoyment (by me) and its 5 STARS",
            "review_score": "1"
        },
        {
            "review_text": "Game was ok but if you reach level 16 in any crafting the game basically becomes 100% crap because of energy which limits everything you do.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay reminds me of oldschool Runescape. I love it!  Simple graphic, no necessary nudity, lots of things to do. Maybe a bit buggy but the staff response real quick.  Some subscription based game should learn from their support team!  Funny that it seems like a childish game but mostly I meet with people 20+  It's free so why not give it a go?",
            "review_score": "1"
        },
        {
            "review_text": "I think all pc gamers should play this",
            "review_score": "1"
        },
        {
            "review_text": "Game looks great!! Character selection is basic but good and the skill tree looks solid.  First impressions are good and first impressions last! Controls are like WoW nice and easy, cool graphics have not had any lag. Already lots of players so load times are abit slow but meh its launch day.  Looks like a keeper!  Enjoy.  **Update**  Much further in the game now and still enjoying it. I was lucky enough to be one of the first members in Runeknights which has become one of the top guilds. Basically a guild lets you make a village and in that village you can place your own house, garden and farm, simple. Your town also has group projects where you start to slowly build your town into a blazzing city, and everyone contributes!!  I have noticed that this game has not attracted unwanted A$$holes which is good, the community is friendly and someone will always help out if you need a hand.  Overall a good game. A few updates and im sure it will run like a well oiled machine!!  Happy Easter.  Happy 4/20. =)",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing Villagers and Heroes for over a year now, and I have really enjoyed it. The recent REBORN update has improved the graphics and added more content into the game. The aspect of being 'reborn' is also something that I have not experienced with other games that I have played. You also have the choice to quest and fight, or craft and gather, or both.  The big plus of V&amp;H is the community. The players are amazing helpful people, and then that compounds if you become a part of guild. People are willing to help you whether they know you or not. The developers also listen, take feedback, and make changes based on input from the community of players.  The best way to enjoy this game is to try it out for yourself. However, give it more than the 3 hours that some reviewers have played.  Just as an aside, I mainly play on the stand-alone client than through my steam account.",
            "review_score": "1"
        },
        {
            "review_text": "One of most crappy games that I've played this year. Let me tell you why. First of all, optimalization - I've Intel i7 4770k 4,5 GHz (water cooled), 32 GB RAM Patriot Red 2600 MHz, MSI GTX 770 4GB, Windows 8.1 64-bit and this game is running at 40 FPS at high (not ultra) settings. At ultra it's nearly unplayable in cities. Also I've lost 3 characters because they are 'lost in space' between loading screens. They are stuck since days. Second thing - I don't know what devs where doing, but new character is using 5-lvl gear at the start. If you will change something in your eq you can't use these items untill lvl 5. Logic? What the f...? Third thing - combat, it's nearly turn-based. Every mob or player is dealing max 1 attack per second, combat is bugged, very often the game isn't responding for actions or attacks. Loot drop is pathetic - who will first attack the boss gets 100% of loot, Forth thing - nearly everything you can buy using in-game Premium Shop. Everything. Simply everything. I can't find even ONE POSITIVE thing in this game...",
            "review_score": "-1"
        },
        {
            "review_text": "Villagers and Heroes is a diamond in the rough among free-to-play Massively Multiplayer Roleplaying Games. It offers a charming landscape and a world that promotes a healthy, friendly community. The barrier to entry to this game is next to none, if you've played an MMORPG in the past you kind of know what to expect, yet somehow Villagers and Heroes is different.   Maybe it's the town system that makes it different. You can join a town of 34 others and create your own house in its own, non-instanced plot (however the towns are instanced) relatively early on in the game (I've only played about 4 hours at the time of this review). You can garden and raise your own animals behind your house, which seems like a simple enough concept to implement into an MMO however systems like this in other games seem to be weighed down by unnecessary complexity. Not so in Villagers and Heroes.  Or maybe it's that it's so easy to get into. From the beginning you are guided to learn of all the various skills and crafts available in the game and that's pretty much all there is to learn. Improve upon the skills you'd like to, leave alone the ones you don't. It's your choice where you improve, with the exception of some quests that require you to level up various skills.  It's probably the unique combination of these features plus more that makes Villagers and Heroes seem like such a promising title. The game creates an experience that's a well-rounded mix of all the MMO-goodness that one comes to expect from an MMORPG and then adds some neat features on top of it.  The only things that I can find to complain about this game is how unoptimized it is and how parts of the game seem unfinished. You'll find yourself looking like you're drifting half of the time as there are no side-stepping animations in the game yet. Additionally the game does not run as well as it should, it feels. There doesn't seem to be a whole lot of graphical complexity going on sometimes and yet my framerate gets hit hard. (I am running on a GTX 660TI so it could be worse for cards less powerful than that) These are things I imagine will get corrected over time, as indepdent developers have the tendency to release meaningful patches for their games over time. It is impressive what Mad Otter Games has been able to achieve with Villagers and Heroes as it stands even, it takes a lot to independently release a video game, let alone an MMORPG.  Small flaws aside, Villagers and Heroes is a great MMORPG that benefits greatly from its simplicity. Join with a friend and build houses in the same village, it'll be fun. If not, well, then it didn't cost you anything.",
            "review_score": "1"
        },
        {
            "review_text": "really fun",
            "review_score": "1"
        },
        {
            "review_text": "I feel like the negative reviews are not accurate. I played this game the first day it came out, and I'm not going to lie, it was very glitchy.   The game is an MMORPG by an indie company, and it's only the first week, of course it's going to be glitchy. They are currently on top of everything, so hopefully the game is all fixed up and clean this up coming week.  On with the review... If you've played and liked Runescape, you'll love this game. It is a skill and stat based game. You do little things to level up every skill possible. Picking apples is a skill, cooking is a skill, fishing, crafting, smithing, all that stuff. You start off on a tutorial island just like Runescape where you can learn all the skills and start a main quest.   The controls feel a bit weird but they are very easy to get used to.   Don't fall for all the negative reviews. Play the game for yourself and see if you like it.",
            "review_score": "1"
        },
        {
            "review_text": "The best thing this game has going for it, besides amazingly pretty graphics, is the community. It's amazing how well people get to know each other while killing monsters or gathering mushrooms.   There is a lot to do and there is no rush to do any of it. People can play on their own or in groups, can play a little or spend days playing: there are many choices to fit all kinds of players. It's worth a try!   (I will mention that my personal experience is that STEAM and V&amp;H do not form a good team- so far- seeing as Steam is holding my password for the game hostage. So if you decide to get the game through STEAm- make sure to write everything down, otherwise, no one will help you. )   ",
            "review_score": "1"
        },
        {
            "review_text": "Very dated art style, pay-to-win mechanics, and generally mediocre. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "This is a standard MMO title. I recommend it for that very purpose. Thousands of gamers need a free quest/social like experience...... dont be a negative nancy this is a fun one!",
            "review_score": "1"
        },
        {
            "review_text": "This has the best gameplay experience lyk evar",
            "review_score": "1"
        },
        {
            "review_text": "cute game, but without mount or not enough bags no fun ;)  PRO: - crafting system is cool - village function is nice - graphic is cartoonish, but cute CON: - questlog sometimes confusing (use wiki for more help) - thousends of items have to be managed - seams EU/ENG server is nearly empty, not much ppl who play - not easy to find a active guild, and if you find one, all player are lvl 70+",
            "review_score": "1"
        },
        {
            "review_text": "Do yourself a favor and don't even think about trying. It crashes when you interact with NPCs and the combat is clunky, animations are not there, gameplay is clunky and i must stress out really hard that it DOESN'T feel like this game was ever meant to be played at this stage of development.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really fun game - if you like crafting!",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year every year",
            "review_score": "1"
        },
        {
            "review_text": "just like wow except the wsda to walk, really confusing.",
            "review_score": "1"
        },
        {
            "review_text": "When I played it the game seemed like a more cartoony version of WoW, except the cost model will kill your wallet.  It has so many crafting recipies, and like 20 levels of each ingredient type, and there's many types... This means if you enjoy crafting you'll have a ton of options... Right? The promise of that is what got me into the game. Here's where your wallet suffers.  You get 3 inventory bags, 1 vault slot, and 1 house slot for storage (once you rent the house). After that you have to pay hard $ to get crowns which let you buy extra storage space. You can barely fit all the levels of 2 ingredient types into 1 storage bag. So to be able to enjoy the tons of crafting, you have to spend money to unlock storage.  This isn't a 'Pay to accellerate your levelling up' model. It's a 'pay or suffer insane difficulty as you have to sell items to make room for what you need at the moment because we don't give you a way to get enough space' model.  Save yourself $ and hassle, try some other game. Plus there are still minor bugs in some quest lines and the big one where my key setting changes were never saved and required me to rebind after each exit/launch.",
            "review_score": "-1"
        },
        {
            "review_text": "having lots of fun with this game. cant wait to see what else it has in store!",
            "review_score": "1"
        },
        {
            "review_text": "First of all, don't look at the hours I put into this game. I played this for 45 minutes and already I know that it's the best game I have ever played. The graphics are spectacular and the combat is second to none. I don't know any other game where you can literally do drugs and murder a baby all while masturbating to a dying zebra. I seriously love this game and I won't buy any more games until everyone else stops playing this because it is THAT GOOD.",
            "review_score": "1"
        },
        {
            "review_text": "Fun RPG Game it calms me down if im stressed or something that makes me mad or sad i play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Its not a bad game to waste your time, but it really needs better optimization.Good pc/internet and sometimes you get 2-3fps",
            "review_score": "1"
        },
        {
            "review_text": "When you kill a monster, it dies.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutley love this game. My friends and I like to all go in and attack really high leveled monsters.",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun lots of crafts",
            "review_score": "1"
        },
        {
            "review_text": "Got me hooked very quickly... so many quests to do and never a dul moment...",
            "review_score": "1"
        },
        {
            "review_text": "Though I did not get far into the game, I quikly got anoyed by the charators and the very poor animation. (such as pick apples)  ",
            "review_score": "-1"
        },
        {
            "review_text": "this game might as well be a huge bucket of ♥♥♥♥♥ covered in hot sauce possessed by satan, long story short, this game IS NOT worth the space on your computer",
            "review_score": "1"
        },
        {
            "review_text": "Banter game So many bugs i murdered a family of 18 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Imagine if Wow and Runescape had a baby. You'll find everything of both games mixed into this one amazing game. Incredibly fun to play and definitely one you'll",
            "review_score": "1"
        },
        {
            "review_text": "Not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "While the game itself is good, playing at full comfort, progress and enjoyment costs a lot (!) of money, and all stuff you buy does only apply for a single character! And since i personally didnt enjoy the game without a lot of (purchaseable) extras, i do not recommend this game...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a great MMO to play with your friends, and is still fun when you are alone. It is harder when you play alone, but I would still recommend it. I don't like the way the automatic combat system works, but most of the time you are using abilities, so I hardly ever notice. The game also has much gameplay with great crafting, wich can be tedious at times, but still is helpful. There are many places to go, and many, many quests to do, which increase with difficulty the higher level you are. This game also has TONS of gameplay, as long as you work on the quests for xp, which is nice so you don't have to grind. I have at least 35 hours of gameplay or something and I am only level 12 and not even CLOSE to finishing the game or quests, let alone explore all of the areas. There are also many bosses to track down and defeat, which also adds some purpose to the game. Everything eventually leads up to fighting a stone atmy with one of Mallok's apprentices or something, but I am nowhere near the end. I highly recommend this game, especially to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "i have played a tiny bit of this game. and i love it. not sure about anyone else but its a good game.",
            "review_score": "1"
        },
        {
            "review_text": "it sucks cant even connect ",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game for more population so I can get more friends",
            "review_score": "1"
        },
        {
            "review_text": "If you want a game like this play something that is more fun like dota.",
            "review_score": "-1"
        },
        {
            "review_text": "Legit the best game I've ever played. Plus it doubled my bogey if ya know what I mean. ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "it is cool ",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. It's fun to play every now and then but not to be a hardcore player. Really love the crafting.",
            "review_score": "1"
        },
        {
            "review_text": "i like that type of games",
            "review_score": "1"
        },
        {
            "review_text": "there are never any servers up It's so slow at loading",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing, but the game gets kinda repetitive and the feats the equipment gives makes it hard to pick what equipment you are gonna use. . The graphics are really good, but i definetly recommend you trying it.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very good game but the npc dialog is abit short. Could you add more dialog for the npcs in the next update.",
            "review_score": "1"
        },
        {
            "review_text": "Is the game updated today? if so how can I update it?",
            "review_score": "1"
        },
        {
            "review_text": "What in thee hell.. i left in the middle of the match after 1 min of playing, i just couldn't take anymore. This game is just, wooow. It's more for an 8yr old based on its cartoon look and game play. You can buy items using real money to get items and clothing (tho im not sure why you would want to). Your char looks like a ken doll that keeps looking around paranoid to the sides as you are walking. Nothing feels fluid or natural about it. It's all stiff and...just no.",
            "review_score": "-1"
        },
        {
            "review_text": "Camera view, player, and cursor movement was too annoying to continue playing and the settings didn't really help to make it easier. I think what finally did it for me was checking my bags and seeing that I could enable extra bag space for a limited time of 1 month. Didn't bother to see how much it costed. It doesn't look like a terrible game honestly, but if they took a page from every other RPG on the ease of controlling the character and camera it would be more bareable.",
            "review_score": "-1"
        },
        {
            "review_text": "Very boring and repetetive, the quests feel more like tasks rather than fun gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is my jam.   If you're the kind of person that runs around in places you shouldn't be (combat-level-wise) just to raise your crafting/gathering skills, maybe this game is for you too.   So far, I've found where a few of the pay-only features would be nice, but they aren't necessary whatsoever. And it's not really in your face either, like some games are.",
            "review_score": "1"
        },
        {
            "review_text": "runs worse than WoW, completely empty of players. meh",
            "review_score": "-1"
        },
        {
            "review_text": "Just plain boring.",
            "review_score": "-1"
        },
        {
            "review_text": "really boring..",
            "review_score": "-1"
        },
        {
            "review_text": "Sorely lacking in the game of the Russian language. This is really a big problem.",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most grinding for least reward I have ever seen in an RPG/MMORPG. Crap animations, crap gameplay. Whole thing feels like a desperate attempt to cash in on the WoW setting without giving any incentive to play.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game. Reminds me of Obilivion and WOW. Can play solo or in a team; Many options. Enjoy ",
            "review_score": "1"
        },
        {
            "review_text": "Only played it for about an hour, and to be honest not the type of game I thought it was, first off the combat system seems glitched (either that or I wasn't being alerted of being apparently poisoned) as my health kept ticking down AFTER the death of a monster I had kill, continuously for about 30 seconds again may have just been poisoned but I hadn't seen any notifications about it.  Secondly they could have done a better job in some of the animations, IE when jumping looks like you have constipation xD  But that's my review, others I guess don't but that's my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "It is addictive.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS SO MUCH BETTER THAN THE OLD ONE! better graphics and also less lag its looks nicer and genrally is a better game to play ",
            "review_score": "1"
        },
        {
            "review_text": "This game is contracted style. The game is still good. That should be the free game] support for details of the game to do a little bit better.",
            "review_score": "1"
        },
        {
            "review_text": "i think this would be an amazing game if the controls where fixed up a little bit",
            "review_score": "-1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Too much like WoW, pretty much same thing except graphics.",
            "review_score": "-1"
        },
        {
            "review_text": "IT REALLY SUCKS. NOT THE WROST MMO BUT ONE OF THEM IT WANTS YOU TO PAY FOR EVERYTHING . ITS LAGGY AND HORIBBLE.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sorry but I just couldn't play this game for more than 10 minutes.  The interface looks atrocious and the graphics engine looks like something from 1995. Kind of 'how would World of Warcraft look like if it was made by 2 people'",
            "review_score": "-1"
        },
        {
            "review_text": "Typical MMo format. There are many other MMos who do it better.",
            "review_score": "-1"
        },
        {
            "review_text": "begginers cant play , there isnt any space for them",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Great game a bit of lag but very friendly people and great adventure. :)",
            "review_score": "1"
        },
        {
            "review_text": "for the little i played this game (in the main menu) it was all zoomed in to the top right hand corner, so i could not even finish creating my character, if you fix this issue i will play it again  11/10 Would main menu again.",
            "review_score": "-1"
        },
        {
            "review_text": "This is quite possible the glitchyest game i have ever played, from the camera bugging out and trying to act like theres a wall near you while your in the middle of a field , to teleporting enemys , your charector freezing up while walking and teleporting 10 feet to the left randomly , all char animations stopping though you continue to move around motionless , quests bugging out basiocally all the horrorible glitches that have ever plauged mmos in the past have all been neatly packed into this one little game. it was quite amusing at first and i contuned playing just to see what would break next. I only recomend this game for the nostalgia trip it will give gamers of the 90s, theres so many old type of bugs that use to plauge early mmos and havent been seen since.",
            "review_score": "-1"
        },
        {
            "review_text": "Babys first mmo ps. it's bad, avoid!",
            "review_score": "-1"
        },
        {
            "review_text": "If u can't pay the money for getting the elder scrolls: skyrim then you can get this. It's similar to skyrim, apart from the fact that every aspect about it is a complete downgrade from skyrim! I don't recommend this game, but if you do like this game, then I would definitely recommend that you upgrade to the better game in all aspects: skyrim!",
            "review_score": "-1"
        },
        {
            "review_text": "You might be wondering what sets this game apart from other mmo's like WoW...  I sure as hell do.",
            "review_score": "-1"
        },
        {
            "review_text": "Pay to win grime. I played this game back in June-July of last year and i actually played it for a while because i was stupid enough to think it was good.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls were unbareably bad and this game needs alot of work.",
            "review_score": "-1"
        },
        {
            "review_text": "Strictly for people who like vanilla milkshakes. Nothing really stands out--good or bad. Steam really needs a button for 'Meh.'",
            "review_score": "-1"
        },
        {
            "review_text": "it so lagging so i uninstall it and i tough it is survival game :( i wish someone can do open world survival game like a minecraft but not blocky",
            "review_score": "-1"
        },
        {
            "review_text": "It would be a great game if there was PVP. There are a lot of cool features that I would explore more if I had an end game goal. Without PVP, I decided to look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "It´s basically russian clone of WOW and Runescape. Like in most of mmo games there is grinding involved. Characters talk russian or german even when you choose english .The community is 95% russian so if you aren´t russian you won´t find someone to chat with in this game. But i guess if you don t have things to play this can be your choise so i give this game 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Not such a good game since it is really lag in my PC so I don't recommend this if you're specs are low",
            "review_score": "-1"
        },
        {
            "review_text": "The first time when i dowloaded villagers and heroes on my windows 8 cpu it ran realy good evr since the new update came out its run realy crappy my frame rate is around 14.5 what ever the game can do pls fix this and btw i think this game is better than WoW so yea but realy pls fix this problem",
            "review_score": "1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Not quality.",
            "review_score": "-1"
        },
        {
            "review_text": "Well I tried this game for no more than five minutes, and i was instantly turned off by the game, i don't recommend this game, if you would like a good MMORPG, look into DC Universe online, overall, this is just a cartoon version of Wizard101 and World of Warcraft put together...",
            "review_score": "-1"
        },
        {
            "review_text": "OK despite some very poor reviews I wanted to give this a try. Slogged my way through the creation process, short tutorial to the village and the game crashed out three times in les than 5 minutes. I am done, peace out. /uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "2/10   If you like the mindlessness of runescape-esk skilling, THIS is your game. If you like to pay for your inventory (you get 2 bags, the other 4 you have to either rent or you can buy perm, both which cost real money) this is also your game. If you like MMOs that have poor art, takes massive amounts of video card power to run graphics on medium+ and still looks like crap, pi$$ poor combat (anywhere from 2-4 seconds before you actually use a spell that are instant cast mind you), you get where I am going. As you can see I really have nothing good to say about this other than I've already uninstalled.  Tl;dr- Poorly optimized. Poor combat. Lack of base options for character design. Lack of character classes. Pay-2-expand inventory. (Real money only)",
            "review_score": "-1"
        },
        {
            "review_text": "SHAIT SHAIT SHAIT GAME RUINED MY CHIALDHOOD",
            "review_score": "-1"
        },
        {
            "review_text": "This game hurts to play",
            "review_score": "-1"
        },
        {
            "review_text": "Customization options are awful, extremely minimal choices and all of them are ugly and unsatisfying. Couldn't even will myself to play the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game could use much better graphics and controls but by my opinion i think this game is a great idea and just needs improved.",
            "review_score": "-1"
        },
        {
            "review_text": "'10/10' MY FOOT  I have a 1 year old gaming computer nothing. crash. barely finished the tutorial. that wasn't even good.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy, generic.",
            "review_score": "-1"
        },
        {
            "review_text": "Good crafting system... But horrible graphics... And there are too many clicking while crafting... Also I hate class separation... 2 few options that way... And interface could be less stubborn and more intuitive... But it is not... And after few drag and drops by mouse it's gettin' really annoying...",
            "review_score": "-1"
        },
        {
            "review_text": "If my opinion, if anyone has enough patience to deal with how much you are not going to be enjoying yourself while playing this game, you are a god. This game has good classes, but the combat and the character design could be madly improved. This is literally child's play.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is hard to follow and can cost a ♥♥♥♥ tone to play try everquest planitside or wow or ( boderlands any of them )",
            "review_score": "-1"
        },
        {
            "review_text": "it fucing sucks @$$ f you all you b.itchs",
            "review_score": "1"
        },
        {
            "review_text": "I have played a lot of games, and I mean a lot. Mostly MMO's in fact. I have never seen   one so undiverse, with no depth, and riddled with bugs as this one.    To start off, you are placed in some Hollow place, where you have to kill wolves   for a lady (which might I add may be difficult), this is the start of a almost 1 1/2 hour   tutorial where you do unuseful things, such as gather wood, just so you can walk over five   feet and make a bow that you proceed to take to some guy and he gives you a better one,   thus making the bow you spend ten minutes on useless. You can learn to cook, or brew   alcoholic beverages, by shaking a tree and a few button clicks. The tutorial is long,   basic, uninteresting a crueling and teaches you absolutely nothing useful about the actual   game.    Let's talk a little more about the crafting. While the crafting is much like Guild   Wars 2's 'Click, UI pops up, click on what you want, some time passes, item pops out' it   is actually very immersive in the fact that your crafting is nearly unlimited. It goes to   a very high point and you can basically craft any weapon, armor or anything else you want   if you have the materials     Characters. This just makes me angry beyond all recognition. It should make you   angry . A priest, hunter, warrior and mage. REALLY. You couldn't have at least tried to   come up with one ORIGINAL class. It's really not that hard. Just make a hunter with a   special twist, but NOOOOOOO, no originality in this game. There is nothing original about   any of the classes, they do the same thing that they do in every game. To add to the   unoriginal characters, they have their own 'Talents' where you put your points when you   level up. There is only around 12 places to actually put your talent points. Then you just   keep putting them into the same ones, 'upgrading' the talent.    While the talents are not abundent, the skills are. Woodcutting, Plant lore, and   fishing are just a couple. They all have unique perks and as you level up you get   'Achievements' which gies you some in game money to spend. This is useful not only from a   money standpoint, but also from a resource standpoint, you don't just grind mobs for   money. Sadly, the fish are just recolors of another fish for the most part.    Combat. Combat is a copy paste of WoW, just like the rest of this game. You click,   and your character auto-attacks, you can use your 1-0 keys to aid with your various skills   that unlock over time. Combat is nothing special, and pretty bland. Once you kill an   enemy, your loot flys fifty feet into the air and spews all over the place. Annoying. And   if you help someone kill another monster, and you aren't in the same party, then you might   not get the loot. To top it all off, all the quests are 'Go kill X amount of _____ animal.   Come back to me when you did it.' it's just a 'grind' to the death.    Let's talk about graphics &amp; UI. The graphics aren't that great, after all this is   2014. THis game honestly looks like the old Spyro games. I went to add my friend to the   friends list (if they had one, I didn't know if they did). I searched the menu until I   found the friends list, only to find that there is no search. You have to go and FIND your   friend in order to add them. When you find them they have to hold still so you can   'inspect' them and then move to the top of the screen to add them. It's a bother.    Quests. I have gone briefly over quests in the tutorial section of this segment,   BUT let me elaborate. The main questline is hardly thrown together. Side quests are   repetitive, and even some of them DON'T EVEN WORK. You can't comeplete some of the quests.   Not once have I ever seen an MMO where you can't complete a quest. Sometimes you can't   even talk to the person who gave you the quest in the first place.    Glitches. They are like your BFF in this game. There are too many. Everywhere you   look you may get stuck in a building or fall through the map or something else that should   not happen. As previously mentioned you might not be able to speak to the person you need   to either.    Map. The map is not open, it's just a bunch of miniscule, pre-defined maps, with   pre-defined spawns. In order to go to another part of the world you go to some teleporter   that isn't explained at all and is kind of just there. It's not open or free at all. You   feel confined to a small space in every map.    Cliche. There is a central city with all the merchants and teleporters to a whole   bunch of different parts of the map. That is so cliche of MMO's I can't describe how angry   that makes me. With the teleporters there is also lag as it genereates, so that is   useless.    Now let's take a nice little look at my personal ratings of this game.   Graphics- 2.5, welcome to the 1990's where there were no graphics but boxes. Oh, and fake   looking huts.   Story- 3, Thrown together by a three year old, I see no connections whatsoever to each   character you go to other than where they live   Gameplay- 1, This game is so broken it is no fun to play   Mechanics- 3, It is playable, but it looks as if it should not be released, almost like it   is early ALPHA. The controls are clunky and finicky.   Replay Value- 0, don't even bother to play it.  Soundtrack- 9, THE ONE THING THAT IS GOOD!! They have a nice soundtrack, suits the towns.  Overall: 3, This game isn't worth the time. It was so terrible I couldn't bear to play it   the full 5 hours I promise to do before a review. STAY AWAY FROM THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "The game is ok, but its kinda boring.",
            "review_score": "1"
        },
        {
            "review_text": "Probably a good game, but serious lag issues. could never start a game. I did make a good character, so there is that.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't recommend this game, but i don't really hate it. I hadnt played much and already got bored. I might be able to recommend this game in the future if it is improved or maybe the game gets better later on, I may just have to play a little more or the whole game may be boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game for 1 minute and it was terrible. It's like WoW for toddlers. The only cool thing was they let me name my character Poop Biscuit.",
            "review_score": "-1"
        },
        {
            "review_text": "download for patches wouldnt go past 7%.",
            "review_score": "-1"
        },
        {
            "review_text": "Villagers and Heroes used to be a land of make-believe!  ....But then it took an arrow to the knee     ",
            "review_score": "-1"
        },
        {
            "review_text": "I have the game and it loads only to 4%, then it goes back to 0% and loads to 4%. IT SUCKS.",
            "review_score": "-1"
        },
        {
            "review_text": "If you take WoW, divide the combat speed by two, and add in crappy character animations, youll get this game. Theres other free to play games that are better. While this game may have refreshing new game content, I cant get past the fact that it feels like a half-♥♥♥♥♥ WoW clone.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even play this game, the servers are not working!",
            "review_score": "-1"
        },
        {
            "review_text": "why ther is no pause for the download wen there come to 90% i just close it and play it agine 0%",
            "review_score": "-1"
        },
        {
            "review_text": "Life is a song - sing it.  Life is a game - play it.  Life is a challenge - meet it.  Life is a dream - realize it.  Life is a sacrifice - offer it.  Life is love - enjoy it. --  ipurwae.com ",
            "review_score": "1"
        },
        {
            "review_text": "I dont have a lot of hours in this game but those hours I do have, I got all of them in one week of play the first week it came out. I managed a trade guild back before even being in guilds was 'cool' I dont know if it is now. But it was a lot of fun I played a lot because I cared about the guildies under my reign. I made sure everyone was properly geared and was enjoying themselves. But this could happen in any mmo and honestly this is not a good mmo in my opinion. I would suggest others, but I also would suggest trying this one, It is free, its not terrible and if you are just looking for a few hours of fun why not?  I dont really know where this review is going, I guess the real message is that Black Company was a great guild back in the day. The most important part of that is 'back in the day' which is where the good parts of this game remain.  So I think this is really my final goodbye to this game. Goodbye  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I though about giving this game a try, and it's been painful. The first time I tried, it was yesterday. I connected to the only EU server that there was, and after making my character,I couldn't even connect, because it was full. I tried then the next day (today), and got the same luck. Then, a few hours later I tried once again, and finally I got into the game, to see how it was.  Dissapointment is pretty much the best word. The graphics look really outdated, like if I was playing a game from the 2000's. You can't also move the characters that well, the controls are kinda bad. Then, add the fact that the servers lag way too much, and that the game is generic, WAY TOO GENERIC. It's like any MMO out there! Or at least what I've saw on the time I've spend on the missions and quest that they give you: Hit trees to get apples, hit trees to get wood, hit rocks to get minerals, hit generic monsters because there are too many.  And that's another thing: The monster spawn-rate is horrible. It takes 2 minutes to 4 monsters to spawn, when over 10 people are waiting and trying to kill 4-8 for a quest. It took me 10 minutes to kill 5 skeletons that only took me 5 seconds to annihilate. The rest of the time was spend jumping arround, waiting until they're back, and trying to get the first hit ,so other players don't steal the monsters from me. And I ended up being the prick that steals the monsters because I had enough already.  This is even worse than a generic MMO. A game that's been for a while already, that they decide to put on Steam so more people play it, and in the end, ends up making the game even more unplayable. I hope I don't have to see it ever again.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of HDD space. Camera makes it unplayable as much as the clunky and very limited movement. ",
            "review_score": "-1"
        },
        {
            "review_text": "i thought this game was good. Then i played a real rpg.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor animations, poor models, poor combat, poor controls, poor performance. On a 980 Ti the framerate was around 50 with pretty heavy drops in the tutorial area.  The crafting looked like it might have been reasonable, but unfortunately I couldn't bring myself to play that long.",
            "review_score": "-1"
        },
        {
            "review_text": "one does not simply like this game...",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely not a good game... The controls are very bad. The enemy spawns are insufficient. Look elsewhere...",
            "review_score": "-1"
        },
        {
            "review_text": "Crappiest game ever.  Atmosphere: 3/10  Fun: 2/10  Story: 4/10  Player: 1/10  NO ONE PLAYS IT",
            "review_score": "-1"
        },
        {
            "review_text": "Did you ever wish WoW had IAP &amp; dollhouses? Your wish is granted!",
            "review_score": "-1"
        },
        {
            "review_text": "Game is pretty terrible with an awful framerate.  Not even going to get into any details, music is nice though, but everything else sigh",
            "review_score": "-1"
        },
        {
            "review_text": "  well this is one of the games like without the dlces which are 62,96 euros this game is like any other mmorpg out there what are waaaay better than this but u know if you like this cartoon style rpg and lots of dlces go on download it",
            "review_score": "-1"
        },
        {
            "review_text": "Ive played ROBLOX games that has more work put into it then this .-.",
            "review_score": "-1"
        },
        {
            "review_text": "bad game laggy slow no animation chap and not fun at all",
            "review_score": "-1"
        },
        {
            "review_text": "I played it about a year ago. It was fun at first, but got very grindy. The whole reason i got the game was to creater a village, but the amount of in game currency it required was almost in human. The game has changed much since then, and could have improved, but i see the reviews are still mixed.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible game never played it",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game. Do not download!!!!!  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game means the world to me I would die if it ever gets taken away from me/comes of steam and if it had a ♥♥♥♥♥♥ I would marry it &lt;3",
            "review_score": "-1"
        },
        {
            "review_text": "Simple yet effective. Reminds me of the old days when MMO's were about getting together with people online and having a big raid. Friendly community and interesting quests. Although some would call the graphics less than perfect, those people can go and play COD with their mothers.",
            "review_score": "1"
        },
        {
            "review_text": "great game controls are ♥♥♥♥ tho",
            "review_score": "1"
        },
        {
            "review_text": "pretty good mmorpg for low-end pc or laptop. enjoyable, easy to understand, pretty colorful graphics and blah. im not a good reviewer but maybe this could help you.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty good game, it is worth taking if you want to deal with what time you play or when you get bored. Funny, easy to play. Maybe at one time to be boring with small problems of craft based but even so worth trying.",
            "review_score": "1"
        },
        {
            "review_text": "Played for less than an hour, the camera was so horrible I was getting nausea. Uninstalled the game, one year later I still remember the nausea of the camera. Worst camera I've ever seen. Also, controls are meh.",
            "review_score": "-1"
        },
        {
            "review_text": "cool fun game that gets you stuck to many fun quests to do.also playing online with ur friends are awesome in this game",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game with friends",
            "review_score": "1"
        },
        {
            "review_text": "undescribable but awesome ",
            "review_score": "1"
        },
        {
            "review_text": "Don't judge this game on its graphics or its combat style. The crafting system is absolutely amazing and will allow you not only to pimp yourself out with gear and potions; but also improve your fellow allies. Also, the community in this game is extremely friendly and with the village and guild system allows you to group up and quest together with ease.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome and just like world of warcraft witch is also awsome. PLAY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "this is soo fun to craft and mine and kill monster easy money and friends you can build your villige coool  DON'T JUNGE A BOOK FROM IT'S COVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1",
            "review_score": "1"
        },
        {
            "review_text": "So fun and so easy to loose yourself in it.",
            "review_score": "1"
        },
        {
            "review_text": "free pack is not working just runing for free :D lol",
            "review_score": "1"
        },
        {
            "review_text": "Really an awesome game. Through it's simplicity and 'cartoon' style, it has almost everything I've tried to find earlier in MMORPG's.",
            "review_score": "1"
        },
        {
            "review_text": "I just started playing this game a few days ago and I have a very mixed review. While I really like some features of the game (The crafting, the gathering, and the houses) some features are just plain frustrating. I have never played a game with such horrible control of your player character (PC). WASD is really difficult to use, because even when you choose the easy cam mode, the camera often goes bonkers and ends up all over the place. The point to click is even worse, and is only useful when you've gotten yourself stuck on some corner or piece of graphics edge. Additionally, for a modern game, the graphics are just plain bad. The only way it is even playable is by turning on 16 bit graphics, unless you have a super video card. In some areas, you have to jack up the brightness to extreme levels just to see anything, in others, you have to turn it down really low.  All that said, I think that it's a fun game. It really needs some work, but if you want to give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Have only played this game a little bit and already there is so much love to about it. I'm about to devote much of life to this game now. Someone tell my mom I love her.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is just Amazing. one word to describe it......... lets see yeah Best",
            "review_score": "1"
        },
        {
            "review_text": "hmmm what can i say bout village and heros...well it free a free to play mmo thats grindy.yes it has some fun parts but it very grindy. not to metion there alot of play to win in this game . case in point your loot bags if you want to carry more supllies you need bigger bags so on the free to lay side the game constanlly pushes you to spend real world money. not saying it a bad game just saying know what your in for",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would jump in wallaby boots again",
            "review_score": "1"
        },
        {
            "review_text": "Great game honestly",
            "review_score": "1"
        },
        {
            "review_text": "I don't get why people say that this game is bad. Sure, it might not have dated graphics, the Cashshop is too expensive. The thing is, you don't need anything from the cashshop. (I bought a Mount for like 9€ to be honest, but i think it supports the developers). If you like grinding, this game might be for you. This game is atleast worth a try!",
            "review_score": "1"
        }
    ]
}