{
    "app_id": 263680,
    "name": "Unearthed: Trail of Ibn Battuta - Episode 1 - Gold Edition",
    "release_date": "2014-01-03",
    "developer": [
        "Semaphore"
    ],
    "publisher": [
        "Semaphore"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 7,
    "positive_ratings": 414,
    "negative_ratings": 366,
    "price": 3.99,
    "description": "Unearthed is an episodic third person Action Adventure game set in modern day Middle East. The game is available in full Arabic and English voice over and features 21 Languages for Menu and Subtitles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263680/header.jpg?t=1518248214",
    "minimum_requirements": "OS: Windows 7 or 8 Processor: 2.0 GHz Dual Core processor Memory: 2 GB RAM Graphics: Intel® HD Graphics 4000 DirectX: Version 9.0c Storage: 9 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: 2.6 GHz Quad Core processor Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 460 / ATI Radeon HD 5850, 1 GB VRAM, Shader Model 3 Support DirectX: Version 9.0c Storage: 12 GB available space Sound Card: DirectX Compatible",
    "reviews": [
        {
            "review_text": "While it's refreshing to see a game like this that doesn't feature a burly white American man as the main character, Unearthed: Trail of Ibn Battuta, is unfortunately a very buggy, poorly slapped together game with hilariously bad voice acting, animations and writing.   It's nothing more than a mockbuster created to capitalize on the success of the Uncharted series. Even in one of the early cutscenes it's mentioned that the protagonist 'always enjoyed raiding tombs and uncharting mysteries in videogames.' If the game wasn't so broken I may have enjoyed it, but it makes Deadfall Adventures look like 'the Citizen Kane of Video Games'. It's sad because the Unity engine is capable of much, much more.  Would only recommend it if you want something to laugh at.",
            "review_score": "-1"
        },
        {
            "review_text": "Man, PC got an awful port of Uncharted.",
            "review_score": "-1"
        },
        {
            "review_text": "'11/10, would explode again' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "The game is really really bad and should be avoided by everyone, doesn't matter if you like puzzles or shotting or whatever, this game is not worth your time.  So lets start witht he PROS:  - Nothing (Except that the game is so short that you wont have to suffer for that long)  Cons: - Mechanics are terrible and are so outdated that you can easily find better from games in the last century. - Shooting in game is god awefull, driving in the game i horrible. - The game tries to do melee fight which is dreadfull and some of the worst you will see. - Puzzles? what puzzles? - Voice Acting is bad. - Animations is terrible - The game is so slow  The last part of the game is so painfull to play since you basically just walk behind 2 people until the chapter is done. Oh and when i say walk then i dont mean the same speed you walk when you go slowly on the street, but more like a snail going through the city.  Even at the end they try to get you excited for Episode 2 (hopefully it never comes) with a trailer. The fun part is the trailer is not about the game itself but just some random pictures taken of places outside and the put together, and then some added voice acting about stuff that might happen in next episode. Which just makes the company look more ridiculous, because they most likely didn't even start on the second episode whent hey made the trailer.  Conclusion: Don't listen to people that tell you to support the devs buy buying the game, cheap or not, the game is not worth a cent in my opinion. Your money is better spent on something else or spent on supporting someone who actually deserves getting supported",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't like this game for a ton of reasons. It makes Adam's Venture look good.  con, con, con:  - puzzle element lasted for less than 10 minutes - the puzzles pretty much mock your intelligence - the game is 80% combat and it's basically the same thing for most of the game (you shoot people, you punch/kick people) - you are forced to endure a walking scenario where you all just blabber away (why couldn't this be a skippable cutscene like the rest?) - what in the actual fluff?",
            "review_score": "-1"
        },
        {
            "review_text": "A QUALITY cinematic experience like no other.  The future of video games starts now.  GOTYAY, 10/10, it's okay",
            "review_score": "-1"
        },
        {
            "review_text": "WHAT WERE THEY THINKING?!!?!?!??!?!??!?!?!?!!!!?!",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very bad game. I haven't played Uncharted, but everyone says this is a huge ripoff of it. The story was terrible and not engaging at all. The graphics were pretty bad. It felt like a bad PS2 game. The game is only about an hour long (I have more time because I went afk during it). And the combat... Its the worst hand to hand combat I've ever experienced in a game. The game ends with a police chase, and its funny because you don't seem to be going faster than 25mph.   On the plus side, if you like getting achievements, this is an easy game to get 100% in a very short amount of time.",
            "review_score": "-1"
        },
        {
            "review_text": "You literally solve a puzzle inside a thousand year old temple ruin by driving a RC car that your grown sister put into your backpack.",
            "review_score": "1"
        },
        {
            "review_text": "Of all the terrible games on steam Unearthed is perhaps one of the least bad ones. Nevertheless is not good.",
            "review_score": "-1"
        },
        {
            "review_text": "slag, which has not seen the light. Do not buy this garbage. In the throes knocked out all achivments",
            "review_score": "-1"
        },
        {
            "review_text": "This game looks terrible, hel all the reviews tell you that it is, so why did I get it you may be asking your self, well because I wanted to truly see the horrible experience. Let me just say that shooting my ♥♥♥♥♥ off would have been a nicer experience than playing this horrible piece of crap game, the story is 2 hours long, and that's with all the buggs going on. You can more than likely beat it in an hour. Oh don't believe me well head on over to my youtube channel Mr.MegasmashGaming, and see for yourself!  What really makes me angry is that they try to add to this game by giving you a survival mode, in which you go against waves of zombies... YES FREAKEN ZOMBIES! Where do zombies even fit into this game. ABOSULTELY NO-FREAKEN-WHERE! Please everyone do not purchase this terrible piece of donkey crap of a game!",
            "review_score": "-1"
        },
        {
            "review_text": "It desperately wants to be Uncharted, but it doesn't have the budget, the talent, or the imagination necessary.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a very good game, but of course, you probably already knew that. It's not as bad as the reviews make it out to be, but that's about it. Poor gameplay mechanics but at least it's got a good backstory with the history of Ibn Battuta.    I was playing in in Arabic, and that's what I would recommend to others because the American voices sound way out of place, but although I'm not fluent in Arabic I do know enough to know that the subtitles didn't match up to the speech sometimes.  Oh, and the main character is kind of annoying, he sounds a bit stupid and his sister the smart one. All the problems are pretty much because it was made by people with a very low budget and very little experience.  I'm only recommending it because it has something you can learn from, unlike a whole load of other games.",
            "review_score": "1"
        },
        {
            "review_text": "what?",
            "review_score": "-1"
        },
        {
            "review_text": "its ok",
            "review_score": "1"
        },
        {
            "review_text": "This is not a good game - in fact I had the most fun at the end when it was over. Will not play again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the best AP/Gritty game you will ever play in your entire life. The Devs clearly jam-packed every corner of this masterpeice with grit. This is unparralled work of AP is unrivaled in the world of video games. Everyone needs to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Contrary to most of the reviews that have been posted about this game, I would actually say that this is a near-masterpiece. There are certain elements in which the game falls down on, but most of its pros outweigh the cons.  Let's just take a glance at the OST of Unearthed - it is very fitting to the scenarios which this game depicts, and it provides some atmosphere to the incredibly well-designed levels. Whoever composed the soundtrack deserves an award, at the minimum.  The level design is something that should be appreciated as well; never before have I been lost and absolutely clueless with where to go, and that is just an indicator of well thought out level design, better than Elder Scrolls and Legend of Zelda dungeons. If an indie game can be compared to an AAA spectacle, then it definitely should deserve some praise.  In terms of the lore, this game excels in story telling. You thought that the Souls series has a convoluted, 'see it your way' experience? Well, think again! Unearthed: Trail of Ibn Battuta delves into some extremely deep, multi-layered lore, and every word that is stated definitely had some intentionality on the developer's part. It throws in some completely irrelevant historical figures as well, which adds into the cleverly designed lore.   And man, the voice acting. Mother of god, the voice acting is phenomenal. Coupled with the amazing character animations/models, this package delivers an insanely good dramatical experience. Every word is synched in with the lip movement, which adds into the immersion which this game has. You can actually opt between either the English or Arabic voice acting. Of course, since this game is to do with the Middle-Eastern/African culture, I would say that playing this game with the Arabic voice acting will provide the best results.  Most importantly, however, the gameplay itself is unique. It is nice to see the action-platformer genre mixed in with walking simulation and third person shooting. The CQC combat is incredibly fun and rewarding, requiring precise reactions and input. Most games these days manifests hand-to-hand combat in the form of a glorified quick-time event, but I can reassure you that this game doesn't fall down the same trap. Did I mention the gunplay, by the way? It's brilliant. The gun models look realistic and the firing animations + damage are commendable.  Seriously, this game gets my highest honour.   10/10    Oh yeah, Dania is my new waifu &lt;3  /s",
            "review_score": "1"
        },
        {
            "review_text": "World of Worldcraft",
            "review_score": "1"
        },
        {
            "review_text": "Combat is funny",
            "review_score": "1"
        },
        {
            "review_text": "Unearthed is trying to be the PC Uncharted but will it succeed ? Unearthed is probably one of the worst games on steam without a doubt. The game has you playing as Faris who is a treasure hunter. One day youre sister meets up with a Mysetrious man who has a diary that will to the Treasure of Ibn Battuta and then you set on an Adventure. So how is this game ? This game is just awfull. The game consist of a few chapters and in every one you do a diffrent thing. One chapter you drive a car and then in another you jump across roof tops. The game is broken beyond repair.The controls are awfull the graphics are amazingly bad and the story is just bad. The game can be finished in 50 minutes or even quicker so you can be done with it way too quick which in this case isnt a bad thing. Overall Unearthed is just a bad game in all means and should be left in ashes. I give Unearthed a 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Is horribul 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Forget Tomb Raider. If Lara Croft pulled out her soft round breasts and rubbed them against my cheeks while gently whispering in my ear that she wanted to go on an adventure, I'd promptly inform her of my newfound homosexuality and proceed to hop on Faris Jawad's ♥♥♥♥.  Glory to Allah.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics bugged out on the second level. It's like they didn't play test this game. It is pretty intensely bad with every animation and the textures are low quality as well. I thought it might have been a port over from Android or maybe Blackberry but the game is way too large for that.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome graphics in this game. The melee fighting needs more work for hit detection. It's a very short game but enjoying.",
            "review_score": "1"
        },
        {
            "review_text": "Horrible handling of the characters movements and interesting story. Would have made an awesome point and click adventure =3",
            "review_score": "1"
        },
        {
            "review_text": "- Added a Sprint functionality! You can now hold 'Shift' or 'LB' while running and Faris will sprint forward.",
            "review_score": "1"
        },
        {
            "review_text": "Despite all the bad reviews, I'd say it's pretty good for something made by a Middle Eastern Indie Company.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how this game came into my posession but I saw it had steam cards, so i wanted free money. It is so hilariously bad i can't stand it. I have screenshots for it, but it doesn't do it justice. The AI, the animations, they're all so so bad. There's car chase seens and the wheels don't move right and the sthju I can't explain it I'm sorry. You need to just experience this game yourself. I don't know how a game like this was released in 2014 on steam   if you really want to have fun, buy this game and stream it or play it with a group of friends and just enjoy it. I can't recommend this game enough 13/10 game of the century",
            "review_score": "1"
        },
        {
            "review_text": "If you can get over the 'Unity Jank™' it's not *too* bad to go through on Easy in an hour. The game could be something more if it had more dev time and polish. The opening tutorial/prologue level is decent for a 'not big in game development' area's studio's efforts, but then the actual rest of the game itself kinda falls apart and is janky. The melee system isn't needed and is only used for a few events. From the way they present it in the tutorial, you'd think you'd be able to use it like Uncharted (oops, shouldn't have used that title/game?)'s melee system. But it isn't.  The stealth system is only used for like one area if that and could be axed as well.  The cover system needs an overhaul as does the gunplay. Being able to fire behind you while your character is facing north on an ATV is... uh... kinda unrealistic and not really good animation-wise.  Still, I *kinda* had fun with it for the $1 I spent to get it. So I guess if you can get it for cheap go for it?",
            "review_score": "1"
        },
        {
            "review_text": "This is a very short game that shows quite some potential, making me curious what the developers might come up with for the next episode.  What I liked:  * the graphical style and detail * the atmosphere and setting * the music - although there's not a lot of it unfortunately * nice in-game tutorials and hints, never gets frustrating  What I didn't like: * unrefined gameplay mechanics, especially in fist fights and driving * story very short and cut off abruptly * extremely linear, no way to interact with the nice and detailled environments  The story has a nice premise, but doesn't quite succeed to pull me in yet. Again, there is potential...  Anyway, it was fun to play through and actually made me curious about the real history around Ibn Battuta. I recommend to support the developer so we may see what they've got up their sleeves for episode 2. There`s a nice post of the developer in the forums by the way that helps a lot to put their work into perspective.",
            "review_score": "1"
        },
        {
            "review_text": "This game seems like a comedic spin off of uncharted or tomb raider. It's a relatively short game that only took me 1.2 hours to complete with easy to obtain achievements. If you're looking for a 100% achievement game, this one only has 1 missable that is still easy if you follow a guide.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AMAZING!  Seriously, I haven't had this much fun out of a game since The Logical Adventure of the ZOOMBINIS.  The only real critique I can offer is that acquiring more ammo for a gun is a little finnicky since you gotta stand over a gun for a few seconds instead of it being instant, but once you know that then endless hours of fun and laughter and cheer and merriment can be had in the survival mode where you can play as such iconic characters as 'man wearing something' and 'not-lazarevich.'  Also, I like the G36C for no quantafiable reason and I wet myself during the parkour segment.  I give this game 15 Frodo Baggins out of 18 Sully Moustaches. (hire me plz IGN/escapistmagazine!)",
            "review_score": "1"
        },
        {
            "review_text": "I Can't Believe It's Not Charted Naughty Arabian Dog Nights Raiders of Drake's Lost Arc",
            "review_score": "1"
        },
        {
            "review_text": "considering it's price, i recommend the game. I like the theme, and story a lot.",
            "review_score": "1"
        },
        {
            "review_text": "SAVE THE SISTER, SAVE HER! CORPORATE BIG SUIT MAN KIDNAP SISTER!  SHOOT THE GUN BUT NOT REALLY GOOD. DRIVE BUT DONT DRIVE WELL. LOSE THE GAME.  LOSE THE GAME.  YOU'RE LOSING THE GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh man, all these Uncharted jokes. In all seriousness, this could have been an okay ripoff, if not for what were clearly lazy production values. Then the price was lowered to a buck, and suddenly it became worth it.  It took me longer to download this thing than it took to beat, but if you want replay value, this game actually has it. Beating the campaign (took me less than an hour) unlocks zombie survival mode.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game for 99 cents and as soon as I load in, I hear Middle-Eastern music and see a cutscene where a man in a turban shouts: 'GO TO MECCA!'",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would never ♥♥♥♥ing buy this game ever again  10/10 aimbot 1.0/10 driving 0/10 fighting",
            "review_score": "-1"
        },
        {
            "review_text": "cheap knockoff of Uncharted/Tomb Raider. Still, for a cheap knock off the story isn't half bad. It also has some decent texturing. True, the voice acting is horrible, and the animation somehow even worse...and the glitches! Don't get me started on ther glitches!  Let's be honest! The game is a steaming mess! Other than a decent storyline, the game virtually has no redeeming factors! The worst part though is that it's an abuse of the 'Episodic' game genre! It's why I hate episodic games! They can be abandoned and you never get to finish your game! This game? Prime example! It came out in 2014, and here it is 2016, and still no episode 2! The game has no ending, and likely never will!  The games also WAY too short for a 5 dollar game! I know it says I spent 5.3 hours playing it, but the game was completed in about an hour and a half...Not even enough time to start getting the games playing cards! So, I had to sit and let it run so I could get them.   If you absolutely MUST get it, get it on sale! It's been on sale for 99 cents...that seems like a fair price for the content in this game..any more than that is a ripoff.",
            "review_score": "-1"
        }
    ]
}