{
    "app_id": 263740,
    "name": "FootLOL: Epic Fail League",
    "release_date": "2014-04-16",
    "developer": [
        "Lion's Shade"
    ],
    "publisher": [
        "HeroCraft"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Indie",
        "Soccer"
    ],
    "achievements": 15,
    "positive_ratings": 837,
    "negative_ratings": 152,
    "price": 9.99,
    "description": "We all love soccer – but how badly do you want to win? FootLOL lets you use mines, cheats, aliens, cows, guns and many more cheats to decimate the opposing team and protect your players. Play against your friends or AI opponents!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263740/header.jpg?t=1520255674",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: 1.6 GHz Memory: 1024 MB RAM DirectX: Version 9.0 Storage: 107 MB available space",
    "recommended_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: 3 GHz Memory: 2048 MB RAM DirectX: Version 9.0 Storage: 107 MB available space",
    "reviews": [
        {
            "review_text": "  My friend and I attempted to play against each other online but were quickly bored. This was mainly due to the lack of ways to ♥♥♥♥ ♥♥♥♥ up. We soon learnt that in order to have fun in the game you have to unlock new things through the single player games.  So, It's actually pretty fun after awhile, but if your intent is to play with a friend online immediately, think again.",
            "review_score": "1"
        },
        {
            "review_text": "Better than FIFA.",
            "review_score": "1"
        },
        {
            "review_text": "this game actually isnt filled with the meme jokes if you really hate memes dont worry you can buy it will be fine",
            "review_score": "1"
        },
        {
            "review_text": "The game were a 93-13 result is something that gets cheered on, instead of investigated for matchfixing.",
            "review_score": "1"
        },
        {
            "review_text": "Gotta say, this is pretty fun. Picked it up in a bundle (IndieGala I think?) and well worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy this game to play with your friends online. you MUST complete the singleplayer campain to unlock multiplayer tools...",
            "review_score": "-1"
        },
        {
            "review_text": "Got it for sale for 1.50 $, it's well worth the price, not sure if 5 is a good deal.  The gameplay in itself is amusing, you have a football team of stick figures doing their own thing, and you can help them by cheating your way to victory: speed up that guy about to make a goal, maybe put flames on the ball itself so the goalie is scared of touching it? Skills range from simple things such as the infamous red card to strategic bombardment and UFO's. Obviously some combinations are more unbalanced than others, ban all enemies from the field, summon some fans and drop a few extra balls to get as many goals as you want.  ...which actually isn't helpful, since the game gives you a few objectives for extra in-game cash, and they're all 'reach a score of X:Y', and you have to wait for the enemy to score the points you need really slowly, kind of like watching a bull ♥♥♥♥ your wife for those in the know (I'm sure there are many in the gaming community).  The length is abysmal, after the tournament/campain mode, which lasts 4 hours (a bit more if you want to reach the random score every time), you don't have many choices.  You could try getting the few achievements that are left, and that will take 20 minutes at best, but then what? The multiplayer is deserted, custom mode offers no challenge, and you've gone through the campaign already.  A bit like fastfood, amusing for a while, but little value outside of that, FootLOL sets no miraculous goals in front of itself, but that kitsch nature unsettles more than attempts at grandeur.  Still a thumbs up because turning your players into spartans and summoning gatling cannons is something I always wanted to do in a football game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Great, funny game! We should all play soccer this way!(Well, not really) ",
            "review_score": "1"
        },
        {
            "review_text": "Fifa17 was an amazing experience",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious!! :-)",
            "review_score": "1"
        },
        {
            "review_text": "Overall, it's 7+ out of 10  The game play is repetitive, but fun Mines are most used skills imo  It's not a family game for your kids, but you will keep playing this game by your own. lol ",
            "review_score": "1"
        },
        {
            "review_text": "Hm...   kawaii :3  Cute and funny  This is illegal football game, u can use pretty much cheap dirty trick here xD  For fun ? d(^^)b yeah two thumbs up  Good Game",
            "review_score": "1"
        },
        {
            "review_text": "Great indie game! Original and innovative",
            "review_score": "1"
        },
        {
            "review_text": "amazing game and funny its like foot ball but it has different stuff in it. It's worth buying it for me",
            "review_score": "1"
        },
        {
            "review_text": "HOW TO DEFEND YOUR TEAM , 100/10 NICE SOCCER BETTER THAN FIFA",
            "review_score": "1"
        },
        {
            "review_text": "this game is so KUHRAYZEE and RANDUMB xDDDD  all of my friends on reddit love it! xDDDDDD EPIK FAEL!  GOTY xDDD  u even have cows and ufos in it xDDDD  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game but wen u played for a while you´ll get bored :(",
            "review_score": "1"
        },
        {
            "review_text": "Run the score up quickly and then just open the Steam overlay and let it play itself. Not worth the dollar.",
            "review_score": "-1"
        },
        {
            "review_text": "The sound of a bunch of screaming kids playing soccer at the main menu makes my stomach churn because I hate loud screaming kids but then again who doesn't. It can be a OK weird fun little distraction of a game when you get bored of other games but if you have literally hundreds of much better outstanding games like I do then you won't be playing this much. Still decent weird fun, 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun it is one of the best sports games out there",
            "review_score": "1"
        },
        {
            "review_text": "It looks and plays like a mobile game.  So ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "interesting",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun, but im a not gonna get less than three star and the game requires you to get certain points to get that next star. Now let me tell you, this game is not perfet belive it or not. And its really stupid when the score has to be 4:3 and you got it to 4:2 and the other team wont shoot but instead shoot at themselves",
            "review_score": "1"
        },
        {
            "review_text": "All you need is the bombs and nothing else. It all looks very cute but soon outlives the fun. Sounds fun but verry poor idea!",
            "review_score": "-1"
        },
        {
            "review_text": "Blowing up the enemy team with mines to win.. ez pz",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play mine simulator again",
            "review_score": "1"
        },
        {
            "review_text": "fun game i got it for my world cup party i hade. you have to buy the game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "this very extremly good game. for the genius people. hahahahahahahah",
            "review_score": "1"
        },
        {
            "review_text": "Less crooked than FIFA.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play in the free time. I love soccer and I tried the game just to see what was the idea behind the game. Got positively surprised.",
            "review_score": "1"
        }
    ]
}