{
    "app_id": 263820,
    "name": "EvilQuest",
    "release_date": "2014-02-20",
    "developer": [
        "Chaosoft Games"
    ],
    "publisher": [
        "Chaosoft Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 31,
    "positive_ratings": 530,
    "negative_ratings": 69,
    "price": 1.59,
    "description": "Why save the world when you can conquer it? In EvilQuest, take on the role of Galvis — a dark knight obsessed with ultimate power. Set out on a quest of revenge,destruction and conquest in this exciting retro Action RPG title.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263820/header.jpg?t=1447359421",
    "minimum_requirements": "OS: Windows XP, Vista, 7 Processor: 1.6 Ghz or higher Memory: 1 GB RAM Graphics: DirectX 9.0c compatible DirectX: Version 9.0c Storage: 200 MB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Awesome game!  Pros: 1. $2.00, this is a bargain for what you get. 2. If you like retro, you will like this, it stays true to the classics of old. 3. Interesting story: you play as a ruthless, evil ♥♥♥♥♥♥♥. It has some funny moments but also some engagingly bleak ones, do not expect to be a good guy for one second. 4. A final boss the way a final boss should be... beware.  Cons:  1. Combat can sometimes feel repetitive, you may also feel like the only real challenge comes from bosses unless you are reckless. 2. Game sometimes feels 'barebones' in respect to itemisation and some areas are repeated with different textures.  Tip:  I recommend playing on hard from the start, I never tried normal but hard seemed just right.  In summary: Buy this game. It was a blast, it gave me a solid 7 hours of entertainment, and will probably give you more if you want to collect all the achievements.   ",
            "review_score": "1"
        },
        {
            "review_text": "Good stuff, a lot like the old NES game Crystalis.",
            "review_score": "1"
        },
        {
            "review_text": "I want evil quest 2 ♥  This game is great, they shoud work more in this kind of game, the controls is a kind hard to understand arrows to move, enter to attack, alt to run, z for use magic, but the game is great here is my score for this game, let put in this way + good, -sad  +kind evil main caracter +charge attacks +good simple history +fast paced gameplay -little, about 7 hours but the price is good -recolored monsters  I give 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. It's an SNES-style action RPG, so if you've played Secret of Mana, the core gameplay is similar to that. It builds upon that formula with more options for customization, including equipment and spells. Well-executed concept.",
            "review_score": "1"
        },
        {
            "review_text": "EvilQuest is an ARPG that does what it tries to do very well within the confines of its limited toybox. The stand-out component is that your character is a one dimensional, fully remorseless asshat who wants to destroy the planet. So that's fun.  The story, programming, visuals and sound were created by two people, and the game costs $2. Adjust your expectations accordingly and you'll find value here. It takes 3-4 hours to complete. No regrets. Thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game. Only done the first dungeon so far but I love it! It's simple but still challenging.  I greatly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly a really fun quick game. You can get a good 10 or so hours of gameplay and get all the acheivments. Really fun, throwbacky feel. Also a lot of good one liners. There is something satisfying about playing a game where you're the bad guy and for no good or deep reason do you want to just destroy the world. Style is Secret of Mana like.  It's fun and funny, a good play.",
            "review_score": "1"
        },
        {
            "review_text": "It's worth it for the low price. I would love to see what this developer would do with a real team and budget, though.  Until then, this is a good, low-price game. It's pretty fun, the gameplay is decent ... it doesn't look very good, but what are you gonna do? Graphics aren't that important, after all. If you can play an RPG Maker game, you can play this.  Also, a word of warning so you don't end up a little annoyed like me: The achievements are to get your stats to 35, but it doesn't seem like you can do them all in one game. I didn't realize the level cap was 35, so I ended up at ~30 per stat at the end of the game with no way I could find to increase them.",
            "review_score": "1"
        },
        {
            "review_text": "I wish more games were like this now a days with the graphics we have. But rather then that it is a pretty neat little game for a really low price.",
            "review_score": "1"
        },
        {
            "review_text": "An exciting indie action were you play as the bad guy trying to take over the world.  For the price this game is a steal!",
            "review_score": "1"
        },
        {
            "review_text": "The Ability to start a conversation with an NPC, having the main character not like them and kill them is amazing. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game needs more blood and gore.",
            "review_score": "1"
        },
        {
            "review_text": "I really don't know what to say about this game. I mean, I like it, it's a great game. But not one of my top ten. Or top thirty for that matter.  This game has an interesting twist, which is that you play as the bad guy, trying to defeat the good guys.  This game has a very nice movement scheme which is awesome, but, the game. It feels REALLY grindey. I love grinding in games, it's one of my favorite things, it's relaxing to me. But this game doesn't have that feel. If you want to get a quaint little RPG, get this game. It's good enough to play there's no game breaking bugs in it, it's polished and if you die, it's your own fault.  I give this game a 7.8/10 No where near perfect, but a nice play.",
            "review_score": "1"
        },
        {
            "review_text": "I have really been enjoying this game. It's number 1 on my backlog (first game i'm going to complete as I work down the list)! Tons of fun. The art is kind of iffy and it's REEEEALLY ♥♥♥♥ing edgy but it's a nice story and I can see where it's going. It's almost heartwarming, in a way. Combat is your typical ARPG top-down combat. You're basically on a cross-axis where you can only move up, down, left and right. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "In the game, you're the evilest ♥♥♥♥♥♥♥ ever born!",
            "review_score": "1"
        },
        {
            "review_text": "Very satisfying game, with fun gameplay and awesome boss fights. For $2 you owe it to yourself to play this, even if you are only slightly interested. I definitely recommend playing this with an Xbox 360 controller if you are able, it is much more satisfying. I just can’t wait for EvilQuest 2!",
            "review_score": "1"
        },
        {
            "review_text": "The game plays a lot like Crystalis for the NES except not as polished. The artwork looks like it was done in MSPaint and the gameplay isn't very engaging. The game isn't very challenging as long as you keep your distance and learn to use the heal spell. Your magic constantly regenerates and is a bit overpowered. The game was done in XNA, but it looks like it could have been accomplished in RPG Maker. I would skip this unless you really are craving a NES styled Action RPG and you don't have anything else you could put $2 towards.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a little short, but for the price point it's not really a problem.  This game is a throw back to classics like Crystalis and Soul Blazer, just not quite as fleshed out.  The game itself isn't necessarily all that great, but it's not a waste of a purchase if you're looking for a little nostalgia or a Newgrounds game that's been given that little bit extra.",
            "review_score": "1"
        },
        {
            "review_text": "An old-school Action-RPG, top-down view, and you get to play the badguy.  Suggested for: -Those who live and breath nostalgia for the NES/SNES days. -Those who wants to be a villainous protagonist.  My Favorite Pros: -...  My Annoyed-At Cons: -Controls are not tight at all. -Dialogue is poorly written, with overuse of exclamation points! -Makes me miss actually good SNES games. -The best evil characters believe themselves to be the hero, like Magneto from X-Men or Light from Death Note. This game is not the case. It uses 'Evil for the sake of evil' logic that I find annoying to where... well, I could not play long enough through the game to find out if anything different would come out of it. -I doubt any good story would come out of this, considering the immature style of dialogue with too many exclamation points!",
            "review_score": "-1"
        },
        {
            "review_text": "If you like fanficy middle-school-level writing coupled with empty, empty levels, coins and other items stucking in walls and 1 dimensional сharacters, then EvilQuest is a god damn masterpiece. I look at it from every side and only thing i could see is a poor man's version of legend of mana.   If you really wanna find gripping indie adventure - go for la-mulana. This one earned it's skip.",
            "review_score": "-1"
        },
        {
            "review_text": "This is what I imagine the game would be if someone took one of Garland's dreams from FF and turned it into a 16bit game.  It is slightly refreshing to play for the bad guys however I wish the evil was slightly more prevalent in the game. For a lot of the game you could be easily playing any other pixel rpg.  The writing was rough, however cheesy-evil. I still enjoyed myself for the two playthroughs I did to max achievements.  Score: 5/7 Recommended price: Under $3.00",
            "review_score": "1"
        },
        {
            "review_text": "Hell yeah!",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I played a game that is so basic, but yet so much fun. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great! highly recommended to fans of old-school RPGS, Epic boss-battles, evil, chaos, Satan etc.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much!! It is JUST like Crystalis for the original Nintendo (NES). Only thing I like to change is the annoying cursor sound effect. ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Crystalis was one of my favorite games as a kid growing up.  This game is essentially a 'lite' version of Chrystalis in terms of mechanics, and with a dark comedy twist on the story. Your quest is to become the evil overlord and kill God himself, to gain the power to annihilate all human life. You will murder innocent civilians, insult everyone you meet and tip a succubus in the guise of a stripper.  If that sounds like fun, buy this game.  The ending is actually quite dark, although I believe it was an attempt to cap off the twisted humor throughout.   Chrystalis: 8.9/10 EvilQuest: 6.9/10  A decent clone of one of my favorite NES games!",
            "review_score": "1"
        },
        {
            "review_text": "This game is not offensively bad, but it is exceptionally boring. Everything about this game feels pretty uninspired. The art is very generic, and what isn't generic such as character portraits and cutscenes look like about MS-Paint quality. The music is painfully awful to listen to. The gameplay itself is in the Zelda/Crystalis vein and that too is exceptionally bland. The game controls reasonably well. The combat in this game is generic Zelda style. You have a special attack that you can use for your weapon that fires a projectile of varying strengths, however you can only charge it standing still, which is irritating. To be fair to this game, I did not get very far in this game before I gave up on it. However, there was just nothing there to keep my interest. If you are looking for a fun, cheap game in the Zelda-like mode, pick up Anodyne the next time it's on sale. This game is competent aside from the horrid music, and nothing more.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun little retro RPG. This time you play the villain and kill half the people you come across and talk to. Got taught a spell a few times by threatening, only to kill them after anyway (scripted). Also instead of battle scenes its more of an action RPG which speeds up the pace.   Worth $5 or less I'd say.",
            "review_score": "1"
        },
        {
            "review_text": "If it's on sale, you have no excuse not to buy it. It's great. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Evil quest was fun, you'll enjoy it if you enjoy retro games, but it was a bit short. I beat it in a few hours and I killed everything I came across and searched the entire map. I think this game should get a DLC or a sequel to conquer existence, but besides DLC it needs to be patched because I built such a tank that when I fought the final boss I just stood under it and took 0 damage a hit.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, definitely a game that gives a retro 90's vibe.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing!!!   I've enjoyed playing this game more than most of the games that I've payed 20+ dollars for.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! It heavily reminds me of Crystalis for the NES (really shows my age) and if you loved that, you'll definitely love this. The music is good, the story is funny, and combat is easy. A fantastic experience for a very low cost. Kudos to the gamemakers.",
            "review_score": "1"
        },
        {
            "review_text": "EvilQuest you are in fact evil. Had fun for a bit, but put it on the backburner for now. Will finish.",
            "review_score": "1"
        },
        {
            "review_text": "Cheapest, Best Retro game in Steam! 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved it",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING! I Just got myself 3620 Free Riot Points for League of Legends at  {LINK REMOVED}  www.riotgenerator.com  Check it out it really works!",
            "review_score": "1"
        },
        {
            "review_text": "I bought it for a buck and had a fun playtrough, it has many of the useal weaknesess that small indie games have but for what I paid it was awesome.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game. Playing as the bad guy is an amusing twist. Decent controls. Fairly simple leveling. Not a lot of choices for weapons and armor. A fun little time killer. You can save anywhee on the outdoor map, but only in specific save points in the dungeons.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥ IT THE FEET WHEN WALKING DOWN LOOKS SO TERRIBLE THAT IT'S LITERALLY THE ONLY BAD THING I CAN FIND ABOUT THIS GAME.",
            "review_score": "1"
        },
        {
            "review_text": "This game had me laughing and I love the concept! It's a great game, and you will keep yourself amused for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Evil Quest, a top down RPG that calls back to a simpler time. You are evil, and you want to overthrow God. That simple. You walk around a world in Legend of Zelda style, with level ups, weapons, armors, and spells. You fight a good number of enemies, but there are a few instances of Palatte Swap upgrades. I liked it, and hey, you might too.",
            "review_score": "1"
        },
        {
            "review_text": "This game had me laughing and I love the concept! It's a great game, and you will keep yourself amused for hours.",
            "review_score": "1"
        }
    ]
}