{
    "app_id": 263960,
    "name": "Wyv and Keep: The Temple of the Lost Idol",
    "release_date": "2014-08-08",
    "developer": [
        "A Jolly Corpse"
    ],
    "publisher": [
        "A Jolly Corpse"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 60,
    "negative_ratings": 14,
    "price": 10.99,
    "description": "Command treasure hunters Wyv and Keep through an ancient Amazonian temple in search of the Lost Idol! Use quick reflexes and teamwork to conquer a gauntlet of 60 fiendish puzzles and deadly traps. Unlock the secrets of the mystical Xu'hutl pygmies and their terrifying overlord, the great Quetzecola.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/263960/header.jpg?t=1447359425",
    "minimum_requirements": "OS: Windows 8/7/Vista/XP Processor: 1.66 GHz Dual Core Processor or equivalent Memory: 1 GB RAM Graphics: Intel HD Graphics or equivalent DirectX: Version 9.0c Storage: 512 MB available space Sound Card: Integrated Sound Additional Notes: Gamepad recommended for best experience",
    "recommended_requirements": "Network: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "There is a certain satisfaction in dropping a weighted crate into perfect position to solve a puzzle. It is a basic notion, pioneered long before Wyv and Keep's existence and an idea that will persist long after. It's only fitting that, in a puzzle game as efficiently simple as Wyv and Keep presents it's challenge often in obfuscation usually reserved for more complicated physics puzzles. In addition from the charm of its beautiful spritework, the witty back and forth of the game's playable duo and the awesome sound track, the game accomplishes great challenge that is easy to pick up and enjoy thanks to effective use of its puzzle design that -while a perfectly awesome single player experience- can be enjoyed by two players on the same computer as well as online. Definitely a game worth its salt.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little puzzle game, very well made.   I recommend it to all Puzzle-game fans. :)",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Cannot recommend this game, skip it.",
            "review_score": "-1"
        }
    ]
}