{
    "app_id": 264060,
    "name": "Full Bore",
    "release_date": "2014-05-06",
    "developer": [
        "Whole Hog Games"
    ],
    "publisher": [
        "Nkidu Games Inc."
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Puzzle"
    ],
    "achievements": 15,
    "positive_ratings": 154,
    "negative_ratings": 28,
    "price": 10.99,
    "description": "Deep underground lies a reminder of Boarkind’s darkest hours. All it takes is one little boar to dig it back up. A block puzzler with an exploratory twist, Full Bore throws the player into an open world of crumbling mines, arcane ruins, and technological wonders with only curiosity to lead the way.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/264060/header.jpg?t=1447359430",
    "minimum_requirements": "OS: Windows XP Processor: 1.8 GHz Memory: 500 MB RAM Graphics: GeForce 7600 or equivalent DirectX: Version 9.0c Storage: 300 MB available space",
    "recommended_requirements": "OS: Windows 7 or later Processor: 2.4 GHz Memory: 1 GB RAM Graphics: GeForce 240 or equivalent DirectX: Version 9.0c Storage: 300 MB available space",
    "reviews": [
        {
            "review_text": "This gaming is AMAZING. It's like the honor-roll love child of Cave Story, Castlevania SOTN, and Adventures of Lolo, with maybe a streak of Portal. Simply fantastic.   I don't have enough good things to say about this game. If you are on the fence, just buy it. Even if you don't like it, the devs deserve your money. I feel like I need to spread the word about this game, so more people will buy it. This is a sleeper for sure, and it's a real tragedy it didn't sell like hotcakes.   I guess I'll write a short summary about why I liked it so much. The game is an open world block puzzler. That may not sound like the greatest thing ever, but the world the devs have created oozes mystery and begs you to explore every nook and cranny to find both it's arcane secrets, and to find more puzzles to solve simply for the sake of solving more. The exploration has the same sense of wonder that SOTN or Dark Souls has, but without any real enemies to speak of. And without the stress of Dark Souls constant deaths. And when you finally do find all the pieces, the story is quite compelling, well thought out, and plotted at a masterful pace (despite the occasional typo or misspelling). The pixel art is sometimes amazing, and sometimes just ok, but they do some kind of 2D normal mapping or something to have this neat dynamic lighting. It looks great sometimes, but sometimes it looks like prerendered graphics from late 16bit early 32bit era stuff. The music is also amazing. Good tunes that are appropriate to the scene when they need to be, and entertaining when you are working out puzzles.  Things I didn't like...Not much. The occasional puzzle stumped me, but that's cause I'm too dumb. I ended up having to look up 2 of the puzzles on Youtube, which I'm fine with. Most of the time when I got stuck I would put the game down and come back later and something would pop out at me. The time rewind mechanic was helpful, but it often didn't go where you wnated it to go, and that was annoying. The race can suck it, the control just isn't built for it, and I frankly didn't find it fun. But those are totally forgiveable complaints in the grand scheme of how amazing this is.   Probably in my top 20 gmes of all-time.  BUY IT!  Devs: I liked Full Bore on FB, but you guys don't have a developer page. I'd love to be able to follow you so at least I can keep abreast of any new projects.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Spatial puzzles with a broad range of difficulty Rewind mechanic helps a lot with solving puzzles (although it can be a little awkward) I like the pixel art Big world Boarish puns  Cons: Control can feel a bit awkward sometimes Occasionally it's difficult to distinguish the foreground from the background",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty great. It's full of puzzles! Some of them are easy, some are very challenging. The control seemed weird to me but once I got used to it I couldn't stop playing. There's still a lot of the game left for me to complete but overall it's really good. I like the graphics, animation and MUSIC. It's very fitting! If you liked FEZ, you should like this game too.   The only thing I don't like are levels where you have to race someone or something - the character movement is tile based and it feels like the moving animation is slightly longer than the actual movement. I keep moving further than I want and it takes time to go back. I usually have to switch to keyboard for these parts for a more precise control.  However there is an amazing time warping system, very similar to the one in Braid. You can either stop time to think if you really need to save some of it, or reverse any action you've done back to the latest checkpoint or the beginning of current level.  8/10 so far, I can't think of anything that would not deserve such rating in this game. It's very well done!",
            "review_score": "1"
        },
        {
            "review_text": "A weird little platformer that reminds me of steamworld dig but with more puzzles... and with more boars.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: +Open-World Exploration with many secrets to find +Perfect Difficulty +Great Music +Detailed story with multiple endings +Perfect difficulty on virtually all the puzzles  Cons: - I encountered one bug that would have prevented me from getting two achievements, but it randomly awarded credit for solving the puzzle (QR Code) after I reentered the room after beating the game. - In the beginning there's a character who tells you to go somewhere, and doesn't give directions how to get there. I don't want a highlighted minimap or something, but it makes sense for him to say go through the top corner, etc. - There is one puzzle that involves a QR code. It's a reference to Fez.   I had a great time with Full Bore. I bought it expecting just another puzzle platformer, but it's much more than that. It's a free-roaming open world exploration game, like Metroid without the enemies. This means it's probably closer to Fez than any other game, but I enjoyed it more because it generally avoids esoteric puzzles that require out of game knowledge. The main mechanic of the game is digging in unstable soil, which will be familiar to anyone who played Steamworld Dig. It works just as well here, but unlike Steamworld Dig you're expected to backtrack if you want to explore and the whole map isn't digging.   The music is great, the story is surprisingly complex, it has multiple endings but you can play after the two to three of them, and NPCs acknowledge your success. All in all, I highly recommend for fans of 2D puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "'Full Bore, the newly released title from Whole Hog Games, pits players into an open-world puzzle of digging boars and mysterious shrines. Featuring tremendous sprite-work and some of the most catchy music in recent memory, Full Bore is a game that will instantly hit home with the Cave Story and Spelunky loving indie crowd. This, of course, is for good reason as Full Bore manages to keep the player engaged throughout the game thanks to its easy to master controls, interesting story and intelligence-challenging puzzles.'   Read the full review here  [www.entertainmentbuddha.com] ",
            "review_score": "1"
        },
        {
            "review_text": "An absolute treat to play! Cool sci-fi storyline, interesting gameplay mechanics, awesome 8-bit graphics (with modern lighting!), and excellent soundtrack.   Also, the difficulty is very-well balanced; while a handful of the puzzles are fiendishly difficult and a few (but only a few) will test your reflexes, most of them just require straightforward application of the gameplay rules you've learned up to that point. This is not to say they're easy... just that they're all solvable if you apply yourself.  Hard to recommend highly enough!",
            "review_score": "1"
        },
        {
            "review_text": "As others have pointed out, this game is similar to Toki Tori 2 and Escape Goat. I would also lump Fez in there. Full Bore is a puzzle adventure game in a world full of secrets, character, and a wonderful electric guitar driven soundtrack.  This game is worth it, and then some.",
            "review_score": "1"
        },
        {
            "review_text": "Nice indie, good soundtrack. You totally can play it. But why?",
            "review_score": "1"
        },
        {
            "review_text": "Much better than expected!  This game looks like a simple platformer, but the intelligent level design and satisfying puzzles keeps having me want to dig deeper and deeper into the world's finest boar mining simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Full Bore quickly became one of my favorite and most memorable games of all time. It's packed with charm, mystery, beauty, and of course many challenges. If you enjoy solving puzzles, exploring, and feeling a little nostalgic, it is a must-play. Many hours of gameplay, and time well-spent.",
            "review_score": "1"
        },
        {
            "review_text": "Whatever fun there is to be had is constantly undermined (pun not intended but appropriate) but the incredibly frustrating, finnicky controls. The 'rewind' function present in the game is probably intended to be used when you make mistakes while you're trying to correctly dig your way round, but you'll find yourself using it just as often to take back unintended actions caused by the disconnect between your button presses and what your avatar actually does. Perhaps a more patient player can stick with it but I'd prefer to spend my time mastering systems, not wrestling with input.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game as part of a Humble Bundle, I assume. It's broken - literally couldn't run it long enough to get the trading cards. Fun concept, but the code does not work.",
            "review_score": "-1"
        }
    ]
}