{
    "app_id": 264240,
    "name": "CONSORTIUM",
    "release_date": "2014-01-08",
    "developer": [
        "Interdimensional Games Inc"
    ],
    "publisher": [
        "Interdimensional Games Inc"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Sci-fi",
        "Adventure"
    ],
    "achievements": 39,
    "positive_ratings": 1026,
    "negative_ratings": 396,
    "price": 6.99,
    "description": "A murder mystery, on a plane, in the future. You are Consortium Bishop Six, a global peacekeeper in the year 2042. Play an active role in the ongoing narrative. Every choice counts.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/264240/header.jpg?t=1552613902",
    "minimum_requirements": "OS: Windows Vista/7/8 32bit  (NO XP SUPPORT) Processor: Intel Core 2 Duo 2.5GHz, AMD Athlon X2 64 2.7GHz Memory: 4 GB RAM Graphics: NVIDIA GTX 260 | AMD Radeon HD 4890 series DirectX: Version 9.0c Storage: 7 GB available space Additional Notes: Of the maximum 4GB of addressable memory space on a 32-bit system (2 ^ 32 = 4,294,967,296 bytes = 4GB), Windows reserves 2GB. This leaves any application (such as Consortium) with a maximum of 2GB to play with. During loading, Consortium can allocate up to 1.8GB worth of memory.  If you are running Consortium with a 32 bit machine, be sure to close as many other simultaneously running programs as you can, otherwise &quot;out of memory&quot; crashes may occur.",
    "recommended_requirements": "OS: Windows 7/8 x64 Processor: Intel i3 2100T | AMD Phenom II x4 or higher Memory: 4 GB RAM Graphics: NVIDIA GTX 460 | AMD Radeon HD 5830 series or higher DirectX: Version 9.0c Storage: 7 GB available space",
    "reviews": [
        {
            "review_text": "Seeker...  High quality job. The interaction between player and A.I. seems so natural and realistic, and the voice acting is seriously one of the best I've seen, better than most big budget games. There's a lot of variety in dialogue choices, which actually make a big difference in the outcome(s). I encourage all to play multiple times, you will discover a lot of different things. You will encounter events and situations if you're at the right spot at the right time (some quite humorous), making it seem like a real living world. The story is definitely its other strong point, with plenty of background lore to discover if that is your thing - or otherwise you can be just as engrossed without the deeper knowledge. Graphics are unique, good textures, nicely detailed areas, minor graphical glitches, nothing game breaking. I haven't done much combat, as I prefer the diplomatic options, but from what I have experienced there's nothing wrong with it.  All in all, it's fantastic on so many levels, and I wait in anticipation for the next installment.  IT'S A ROLEPLAYERS DREAM COME TRUE!",
            "review_score": "1"
        },
        {
            "review_text": "I originally had massive problems with running this game, and plenty of others did as well. In my frustration i wrote a negative review because of its near unplayable state.  Interdimensional Studios themselves admited ( and apologized ) that 'Consortium's' launch was horribly buggy and thankfully this is no longer the case. With all their hard work and dedication to the project all bugs (game-breaking or just weird) are now gone.   I intended on fully editing this review if the problems were solved and now they have.  I can best describe 'Consortium' as a mix of the original Star Trek and Mass Effect with the shooting mechanics and engine of Half Life 2 and if that mix doesn't sound good to you ( or you didn't like any of these examples ) then it's hard to recommend. However if you're looking for epic 1st person sci-fi romp with an emphasis on story, dialogue, player choice story and wrapped up with some decent shooting mechanics look no further.  'Consortium' is also the first in a trilogy and only lasts about 10 hours at the most, however it never feels 'too short' and i'm very excited for what's to come. The story is brilliantly written, the game has marvelous presentation and the characters throughout the adventure are interesting and their dialogue throughout it is well done. Combat is a bit like an old school shooter mixed with Half-Life 2 (which i find works well enough) but it's hardly the focus of the game.  No, the focus of 'Consortium' is the interactions between you and the other crew aboard the ship with multiple dialogue choices and the dire consequences for most of them, and Interdermentional studios have done it brilliantly. Even with my previous frustration at launch it's obvious how far 'Consortium' has come and the Master Edition truly is worth anyone's time especially for only $20.   This is the type of game i've been wanting ever since Mass Effect came out, and it certainly doesn't disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "Consortium is a very story and dialog driven game. To sum up briefly... Dialogs: lots and branching Duration: relatively short (a few hours depending on what you do) but replaying highly recommended Story: excellent Combat: completely avoidable but if you do it is passable (great if coupled with an AutoHotKey script to overcome some binding quirks) Characters: lots of variety and about 20 of them. They're memorable enough you'll remember most of their names. Environment: small (stuck on a large aircraft) but detailed. Graphics: the style is minimalist. Judge for yourself from the screenshots.  I love this game so much, I invested big bucks into the Fig campaign for the sequel. It's not for everyone but it is at least worth playing once to decide if it is for you.  Saves will carry over to The Tower!",
            "review_score": "1"
        },
        {
            "review_text": "What impressed me most about this game is that you are able to talk your way through almost every conflict. I have to admire the devs for letting you all but completely ignore the shooting element of their FPS in favor of being a silver tongued devil. You are perfectly capable of shooting your way through the game as well, and both are viable ways to solve problems.   To complement all of this is a large cast of complex characters. I found myself reloading saves just because I was interested in exploring more dialogue options. The world of Consortium feels very alive and complex, hell, there's an in-game database that has an absolutely vast amount of backstory and supplementary material that you could spend a day reading.  If you've played the Mass Effect games, there's a strong chance you'll enjoy this game. Buy Consortium not because you want another FPS, but because you want to explore a story and the whole universe it takes place in.",
            "review_score": "1"
        },
        {
            "review_text": "You will be thrown into this game head first. You will not know what you are doing. You will not know who you are. Your crew will not explain jack to you as you already 'know' what you need to. You will flouder and wander about. You will make seemingly pointless choices.  And you will find that all of that has lead to something you didn't expect.  You will tear you hair out and you will scratch your now-bald head in confusion and you will scream as you try to decipher the barrage of info thrown at you.  And you...  Will.  Love.  Every.  God.  Damn.  Second.  Of it.  10/A+ would get mind screwed again.  ~STL",
            "review_score": "1"
        },
        {
            "review_text": "The execution doesn't live up to the ambition.   It has some promising aspects - a distinct world and characters, extensive dialogue, impactful choices and varied gameplay. The writing is generally decent, and at least puts a bit of a twist on the tired old amnesiac protagonist device.   Unfortunately, these are let down by technical issues (painfully slow and frequent loading, excessive GPU use and various glitches), voice acting which ranges from passable to cringeworthy, poorly explained concepts and a baffling layout which is desperately crying out for a map and/or objective marker.   Hopefully the experience will see the devs come up with a less clunky game which properly showcases their talent.",
            "review_score": "-1"
        },
        {
            "review_text": "A mixture of Mass effect and The Stanley parable, a must play.",
            "review_score": "1"
        },
        {
            "review_text": "So did I pay $20 for a 3 hour game? I know that it says I have 10 hours on it but that is only because of the numerous glitches that accompanied the game at launch. Now It has excelent gameplay now that it works and it was a good bit of fun but seriously, 3 hours for $20? This game doesn't make me want to replay it over and over. I really hope that I won't have to buy the next 2 chapters seperatley. I will change this review from not reccomend to reccomend if the next 2 chapters are free. I don't feel that the content provided was worth $20. Now having said this I will replay the game as it is fun but not until I can complete it from start to finish. Also why is everyone always waving their hands around like they are using a console? Not a huge deal just a bit distracting.",
            "review_score": "-1"
        },
        {
            "review_text": "Immersive and intriguing story with some fps action thrown in too. I'm on my second play through and depending on what you do and say you will discover new information in the story. First play through is a little scary at times too which is good.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for something similar to System Shock... then don't look for it here ;). Which is not bad because this game is something new and something good.  It's not a shooter game, it is not RPG-by-stats game. But it is truly roleplaying adventure game where you talk to others, solve criminal case by looking for clues and asking questions. There are shooting sections, there is inventory management but te core of the game is playing your role and expressing it by actions, inactions, words spoken and unspoken. Great experience that changes rules how NPC interactions can be implemented in the game.  I played this game twice, and even though i tought i do everything the same i got different choices to pick just because i rushed some conversation straight to the point or didnt click one thing. You can play your style, you can break 4th wall, you can try playing role of character you play - short game with replay value and some achievements on the list makes me wonder 'how is that even possible? ive checked everything' :P.  Dont be fooled by, maybe bad, screenshots - game looks really good when you play it and simplistic graphics serves it's purpose - you can clearly distinguish one NPC from another by simple features of face and haircut so when you are given task or clue to talk to somebody you can recognize them from afar. And even though game offers really limited space for your actions this space is used to its full extend. Scenery will change, rules will change, game will ofer new things within the same corridors.  Story is solid and characters are well fleshed out. Some pieces of world lore or propaganda could be annoying as game obviously uses cliches, national stereotypes and puts real world politics or religious issues inside the game. Setting is parallel universes in future so why the game is full of nowadays topics? Feeling of being indoctrinated is so strong that everytime i see piece of this makes me roll my eyes and think 'omg, rly?'.  As i wrote earlier - it is not a shooter game so shooting is really basic and quite simple. Enemies are just dolls to be shoot at and only difficulty is their endurance. You can't use covers and all focuses on taking enemy down without much tactics on how to do it - just keep their silhouettes within your crosshair and keep button pressed down. You can collect new gear, manage ammo and use energy to heal during battle but these features are not much used within this game.  And why battle is in the game when there is not much action? Because it is just a first episode of upcoming action game where you enter the brawl in The Tower. It is like introductory sequence, shareware-alike kind of old games used to have where you had first episode to have fun and then you could buy full version. But for this one you have to pay full price in advance and episode will end up with a cliffhanger. Of course it is just information for the reader, not a flaw, i don't see a reason not to pay the devs for such a good piece of work. Game looks great, sounds great [full voiceover], is replayable and costs 10e. It is like going to the cinema but here you can change the outcome of the story if you like so :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a very strange game. Your first clue is that it claims to be real. The deal is, you used a system by iDGi to take control of Bishop-6, a general-operations crewmember aboard the Zenlilth in the year 2043. The Zenlilth is a highly advanced plane containing a chess-based heirarchy, all working for the leaders of Consortium, King and Queen. Your purpose is to do stuff, and try not to screw up the plane too badly through traitors, mercenary attacks, and intrigue. There's even a section where the high leader of Consortium calls you specifically to tell you not to kill the guy you're controlling. It is, in my opinion, well-written and creative, and if Bioware RPG's are too busy for you, this is much more story-focused and less shooting and picking flowers. The combat is unique, and takes backstage. As a 'Bishop', you are supposed to know how to fight, but in the only big combat scene of the game people get a bit annoyed if you kill too many people (especially the leader). Story is unique and immersive, the ending is incredibly strange and yet not out of place. So much detail is put into a facade of reality that the same section of a game might be experienced with bad space/time continuum connection the first time, and some static the next. There's a lot more to learn and I've played through the game twice. Is it worth 20$? Maybe. Is it worth the money you pay when on sale for 33% off or more? Definitely.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. Seriously, some of the best narrative work I have experienced in a really long time.  Each of the characters have their own definate personality, and thankfully don't follow the common cliches.  the soundwork is pretty great too - I was really suprised to see someone who worked on KOTOR accredited to the music.  I'm genuinely facinated by the world of consortium; I really want to experience it more! Unfortunately the 2nd game won't be along for a while, and the wait is gpoing to be painful - there is so much stuff that is referenced in passing, which I hope is expanded on in the planned next 2 games.   There are bugs, yes, but at time of writing, the game had only been out for less than a day for general release - I personally did not experience any crashes, but a word to the wise.  Enable dev console, and get used to load autosave01.   also manually save. a lot.   overall, CONSORTIUM is well worth your money and time.",
            "review_score": "1"
        },
        {
            "review_text": "Consortium starts slow but through good writing, expressions and voice acting makes Knights, Pawns, Kings and Bishops mean more to you than chess ever could. It is a short game that allows you to make and follow very different dialogue paths with different outcomes and really needs a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "CONSORTIUM is absolutely fantastic. It's very like one of those well loved but sort of clunky RPGs, like Deus Ex, Vampire: The Masquerade Bloodlines or EYE: Divine Cybermancy. If you can look beyond the flaws, which I personally haven't really suffered, it's a fantastic game. I've only played around 3 hours (so Steam tells me) but I could swear it's been more. It's absolutely astounding, the visuals are interesting, and the world is so rich! There's a computer bank with literally thousands of ebooks in detailing the world. There's so much there I really can't even begin to absorb it. It's got a real diversity in playstyle, too. For example, the big bad of the first act, I looked him up, worked out a bit about his personality, and when speaking to him, played his ego and curiosity. This meant I could defeat him and his army, then his fleet without firing a single bullet or hurting anyone. Alternatively, I attempted a more violent approach, but I personally never found that to be the best way. The richness with the way you interact and chat with the characters makes you genuinely develop emotion towards them, not forced emotion, such as in The Walking Dead. They each have their own metric ton of things to say, and your behaviour changes their thoughts towards you, and the same will go for you.  The setting is very rich, like a Gerry Anderson serial, or something. I was strongly reminded of Spectrum, with the whole codename system and flying base. The only sort of problem with this is that nearly every character is designated as Pawn and then a number. This means I got very confused when investigating an incident that comes out through the game. I actually ended up screwing my alignment utterly with two characters and failing to find the bad guy. This did sort of annoy me, but the game does tell you that regular saves are a good idea, and I decided to not do that to add a more permanent level to my choices. I can imagine that there's so many ways to approach this game, so I can't comment on the scope of it. It can also be very tense in some parts, like when you're being interrogated about your name and stuff. All in all, this is one of those games you will love if you can focus past things like attempting the usual tutorial and introduction dialouges with NPCs being met with 'Are you feeling okay? You've forgotten everything' and other things. The developers have also promised to fix the bugs that have damaged some people's experience, too.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very strange game. And I'm talking about the plot as much as the game itself. First off, it looks absolutely terrible, but if you can get over that it looks like it was made by a bunch of amateurs, it's actually kind of interesting.  It's more or less a walking and talking simulator on a space ship. You interact with the crew in first-person navigating through dialogue trees to solve various mysteries that your crew runs in to. Things happen in real-time as well, so you can actually miss some clues if you weren't at a certain place at a certain time. Voice acting isn't bad and the music was created by Jeremy Soule, so it's actually quite an enjoyable experience the first time around.  Ends in an awful cliffhanger, but you can at least solve the one big mystery.   I got it for free, but I don't know if it's something I'd pay $15 for.",
            "review_score": "1"
        },
        {
            "review_text": "It has a lot of voice acting. It's like ground hog day the video game.  And the characters all do their own thing in parrallel and one play through you might go one place and witness one thing, then when it resets you you might go another way and do something differently.  I actually got almost everything right on my first play though but that was just through sheer luck.",
            "review_score": "1"
        },
        {
            "review_text": "  ...uhhhhh, weird feelings. CONSORTIUM, the game where developers make you think that everything you do is REAL and has impact on everything in the future world. But speaking normally,   it is about a game where you enter the mind of some person through a satellite and do some stuff.   Boatloads of story awaits.  Pros - Boatload of story and lore - More boatloads of story and lore - One big mothership of story and lore - One BIG UNIVERSE of story and lore  Cons - Sometimes TOO MUCH story and lore - Almost no combat - You may feel guilt sa you make decisions, but it's just a feeling.  Conclusion is that there's STORY AND LORE OVERLOAD!!!!!!!111!11!1!one!!1!!!1oneone- *static*",
            "review_score": "1"
        },
        {
            "review_text": "I'll just bullet point summarize this one: - So-so story line. - Combat mechanics are bland and frustrating. The game would have been better without them at all. - Some random glitches with the AI where one or more characters will stand stuck in place and you can't interact with them. - The dialog choices feel like they won't really change anything by the end of the game (with one exception that lets you skip an incredibly annoying battle). - The game assumes you'll memorize the layout of the plane, so finding things can be frustrating at times. - The reveal of who the big evil bad guy is near the end of the game made me roll my eyes. Then when they showed a picture of him, I laughed because it looks like a guy in a purple bicycle helmet with yellow sunglasses and a pink ascot. Fabulous. - Even though there's only 3-4 hours of actual gameplay time in this, even counting reloading saves because of combat, I found myself wanting to skip through the dialog for the last 30 minutes of the game because I was ready for it to end.",
            "review_score": "-1"
        },
        {
            "review_text": "This kind of felt like a High Concept game. Other than a few bugs, I found my first playthrough to be very enjoyable. The story and choices were fun aspects. The universe and technology was really interesting. The theme, while initially was a little challenging to follow, turned out to be very facinating. By the time the game was done, I was begging for more. And that's actually where the problem comes in.  The game invites you to play it over-and-over, but I couldn't. But the game length wasn't long enough to justify it another play through. Even despite the different narrative choices and the mechancal aspects that intertwine the changing story and gameplay, the overarching story will be the same. And it just feels too samey with the other playthroughs.  When the game ended, I was disappointed. It felt like I just finished the very entertaining and scene setting prolog, and it was game over.  Other criticisms include the fourth wall being broken; that just never seems to quite work. I want to get immersed in an RPG-like game, I don't want it to point out 'Hey. You're playing a video game!' - Let me be a part of this beautiful world. I fullly grasp the attempt at the metaplot. But it just didn't work for me.  There's so much potential in this game.  Ultimately, Consortium creates a beautiful setting, with smart game mechinisms. I would absolutely recommend people play it. But due to short narrative, unsatisifying cliff-hanger, and a few other minor things, I would only suggest picking it up when it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that can easily be beaten in 5 hours or less. It would be more accurate to call this the first episode out of three than the first game out of three. The reason I say this is that there is one set of issues to be resolved in this first game in an overall arc.  While to me it is a design choice, I feel that where they cut off this game from the next is probably in the wrong spot. Its like TV series that put cliffhangers in seasons when you have no idea if they will get approved for a second season. Instead they should have had it concluded with this arc all wrapped up and mostly just hinting at what comes in the next games.  The graphics and voice acting for this game are very hit or miss. If you know the original Deus Ex, you have the idea.   Complaints aside, this was actually a pretty fun game. It allows for multiple resolutions to situations and creating circumstances that are affected by past choices. The dialogue is at times funny and the gameply entertaining.  Overall, I would say at $20 it may be a bit steep, but still worth the price. If it is on sale then it is a definite buy in my opinion if you like games with little combat and mostly npc interaction.",
            "review_score": "1"
        },
        {
            "review_text": "I just have to give a shout-out to this as a hidden gem. Picture a low-budget indie production of Star Trek, as a game where the whole thing plays out on the ship. It's short, it's buggy as HELL, it comes with a massive cliffhanger ending smack in the middle of the story, and at most it's worth getting for 50% off -- but it's a good ride while it lasts. Pretty unique. There's a surprising flexibility to what you can accomplish with what's given, and if Consortium 2 is ever made I would totally be on board with that.  All that said, play it on Easy. The combat, rare though it is, is BONKERS hard, at least if you're trying not to go full lethal.",
            "review_score": "1"
        },
        {
            "review_text": "Took me about 4 hours to beat my first run through. The graphics and all are nothing special, but the story is actually pretty fun and you can do a lot of different things through the choices you make. If you are interested in a short story heavy game where your decisions actually matter, then this is the game for you. Also it has a lot of replayablilty in it as well.",
            "review_score": "1"
        },
        {
            "review_text": "great atmosphere decent combat. a bit short gret on a sale but 14.99 seems steep for such a short game. very excited to see what game #2 is all about. buggy as donkey balls though needs some tuning",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game so far. Can't wait to play more!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game so far. Can't wait to play more!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most compelling RPGs I have ever played, I will gladly buy the next two in the series to see how far it goes!",
            "review_score": "1"
        },
        {
            "review_text": "2 Star Trek references, a character who obviously inspired Kylo Ren, and a conspiracy greater than the one found on X-Files makes this a damn good game.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it. its not perfect but its different and I hope to see more of this. think Deus Ex meets stanley parable",
            "review_score": "1"
        },
        {
            "review_text": "It's good for what it is, but it's a $10 tease. I don't mind episodic games when they're called what they are, it's a perfectly valid way of long forming a story. This wasn't even close. Poor form Interdimensional Games, this is the kind of thing that takes away from an otherwise interesting and enjoyable concept.",
            "review_score": "-1"
        },
        {
            "review_text": "Not what I have expected so far... I mean, I was expected a really cool Sci-Fi shooter. But it seems that I got somethhing else. Is more like a CYOC game rather than a shooter. You choose that 'lines' to tell to the NPCs you interact with. When you start the game you don`t start dirrectly into the tutorial area. The tutorial area can be acessed from a smallroom closet-like by acessing a terminal there. From there you will be teleported into a virtual area where a robotic voice tells you mainly how to shoot things. The shooting is atrocitous and you almost don`t need it. Basically this game is not about any sort of combat. Like I said is more like 'Choose your own story game'. Don`t be fooled. This is a narative game not an action game the only difference here is that you can move your character in different part of the ship. If you are looking for a Sci-Fi combat game this is not the game for you. But if you are looking for a story-driven experience where you don`t understand absolutely nothing from it then yes, I warmly, recommand it!",
            "review_score": "-1"
        },
        {
            "review_text": "A turely immersive wortld backed by a ARG for those who wish to delv deeper into the story (though it isn't required). While the game will will forever have issues due to running on the Source engine that dosen't take away from the amazing creative direction the game offers. The remaining two games in the series will be made with Unreal 4 which should help to aliveate a lot of the issues.  For a game that in my opinion should be more popular for what it is, if you love to immersve yourself in a world and play by killing, never firing a shot or never saying a single world this mixes it all. The sequals can only get better.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is fun, having a good FPS element and has a good sence of humer, but this all comes with a major unavoidable flaw. The game is extreamly short, has few things explained to you and feels like a demmo for a diffrent game. I would be nicer about this seeing how it was made by an inde group and this could be something much larger then it looks plus this is an ongoing development, but the game ultometly has choices that appear to mean nothing. I understand what they were attempting to do because it worked for games like Wolf Among us and Left for Dead the issue is that they want to charge people 15$ for an incompleat game. All the choices evenchualy lead up to the same conclusion that you need to go to 'the tower' and for the same reson. If the game didn't take me 3 hrs to beat the 1st time though or if the choices made me cair about the indivigual people in the story then maybe the game would have been worth 15$ but, you are paying for the first half (or maybe more) of a game that had a big selling point of 'your choices matter' but they dont feel like they do and I could cair less if villen nomber one lives or dies or if the piolet lives or dies because at no point did any of them show mutch of who they where. Maybe they will relece 'the Tower' (part 2) as a free addon to this game but until they show anything beside giving this part away for free for a day to get positive revews I must say don't spend money on this thing (not yet at least.)",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't the best game, but it is ♥♥♥♥♥♥♥ good if i've ever played one Source game- looks like a mod and kinda crappy, but it actually serves Consortium Core Gameplay- It is NOT a source mod, it is a full fledged game after you really dig into it Narrative experience- interesting and immersive, I felt fear for fellow crewmates when they were in near-death situations Choices-X or Y, but the occasional Z pops up Control of the character and their personality- straight up free, aside from the name and designation Overall, I enjoyed this game more than a candied bag of ♥♥♥♥♥ ever could, and the story itself and unique gameplay managed to keep me hooked. Cant wait for part 2!",
            "review_score": "1"
        },
        {
            "review_text": "This game randomly showed up in my library a while ago and I don't know why. I installed it so It wouldn't disapear, and it's just been sitting in my library ever since. I was bored and decided to play it today, and in my time playing I've found it to be a very in depth story driven game, and it seems like a lot of hard work and effort was put into it such that each and every action actually does have an effect of somesort. (except turning on every sink and blowdrier and then flushing the toilet as fast as it'll let you). Also, I accidently blew myself through a wall with a grenade, so don't shoot straight down or you may wind up outside the map. Lots of fun so far though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is two hours long. It's good for those two hours. It was so buggy you couldn't even complete it at release, though. Don't ♥♥♥♥ing buy it. I AM MAD. So much potential wasted by the non-length of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Seemed like a nice game, with leading a crew, fighting, and relationships between each other. but its more like an interactive movie. the fighting tutorial is longer than the actual fighting scenes later. There are a few weapons (enough) and you have shields and armor. but half of the game is talking and making some choices. i expected something with a sandbox touch, but it was actually just a story you played through, that even is pretty lame and lacked action. Absolutely underachieving. Not for that price.",
            "review_score": "-1"
        },
        {
            "review_text": "Although the game has a great concept, the interface is a bit odd (using the F1-F4 keys for conversation) and the game itself isn't nearly as stable as it should be. Until those issues are addressed I cannot reccomend this game. It appears to be in an Alpha stage of a game, but I would love to see it in a final, playable form.",
            "review_score": "-1"
        },
        {
            "review_text": "Heyyo, it's an interesting game with a neat take on how the iDGi system works... The gameplay is good as well for how you have lots of dialogue with others and deciding if you will reveal who you truly are or not and wether or not you shoot to kill, stun or not shoot at all. It's great! I hope you support this indie game as well, it's another Kickstarter sucess game and the dev team have done a great job of fixing up the game (especially performance) with the master edition. Now's a great time to give it a shot. :)",
            "review_score": "1"
        },
        {
            "review_text": "The character interactions were nice but the FPS element did not engage me. Story was fine, but too short to feel complete. A few bugs but still totally playable.  The game isn't difficult to finish, on the other hand, achieving the optimal outcomes for everything will require effort. It seems the game was designed with some replays in mind to find them, unfortunately just one play through was enough for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Heyyo, it's an interesting game with a neat take on how the iDGi system works... The gameplay is good as well for how you have lots of dialogue with others and deciding if you will reveal who you truly are or not and wether or not you shoot to kill, stun or not shoot at all. It's great! I hope you support this indie game as well, it's another Kickstarter sucess game and the dev team have done a great job of fixing up the game (especially performance) with the master edition. Now's a great time to give it a shot. :)",
            "review_score": "1"
        },
        {
            "review_text": "The first great game of 2014! This game has personality and it shows in every interaction. The scope of the game may be small but the details keep you wanting more and many of the actions you take really feel like they are impacting the rest of the game. Like the great RPGs of old you can complete the game without killing anyone and be a saint to your crew mates or a silent killing machine feared and respected by everyone you come across. The only downsides are that combat can get clunky at times and the color blue is a bit overused. Imaginitive and unique Consortium is a fantastic fist person experience that can be played over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "First things first, I absolutely freaking love this game. If it was longer I could totally support it costing quite a bit of money, the games graphics are pretty great, and the storyline is pretty well created. The only complaint i have is for one SIDE mission, where i had to google how to solve it but really if you do the right things and walk in the right place, you'll get it. So, an overview:   PROS:  *Decent Story *Decent Graphics *Great Handling *Your Choices Matter So it Actually Feels Like You're DOING Something *FREE so like, why not?  CONS: *Short game (but if you do everything and replay it like they want you too you can play for a long time, and besides its free i mean I've had games that have lasted for minutes and costed $$$ but this one lasted hours and was free) *One confusing part, but again, you can google it. *Hard to find some places at first, but after you have the layout down you're fine.   PLUS the devs are already making the sequel to carry on with the story! (And side note to the DEVS: you guys have serious potential and i would gladly buy a full game from you guys. Keep it up!!!)   EDIT: I NOW REALIZE IT IS ONLY FREE UNTIL MONDAY SO GET IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "I have only played through the game once all the way through, but I really enjoyed it. It was very personal and intimate, most of it focusing on dramatic moments between multiple people in the crew, and it also featured choices that were organic and natural, to the point were I made game-changing desicions a few times without ever realising I was making a choice. This game is thought provoking and interesting, and I would recomend it to anyone who wants to play a game where they feel like the things they do matter, or if you just like a game with a good story. 10/10 would time travel by satellite again.",
            "review_score": "1"
        },
        {
            "review_text": "I have suspected this for a while, but I can conclued that the best games do in fact come from Canada.  The ending hyped me for the possible sequel immediatly. I love this game's atmosphere. Its plot line can be compared to that of Telltale's The Walking Dead, it was ultimately linear, but your choices did matter. I would even go as far as to say the developers surpassed Telltale here. Screw Metascore this time. This game has the potential to be at least as great as Bioware's Mass Effect or Valve's own Half-Life.   I can only semi-complain about the cliff-hanger at the end, so I must beg the developers to please actually release a second part, (Half-Life 3 anytime soon, Valve?) I feel as if this concept can be greatly expanded upon.",
            "review_score": "1"
        },
        {
            "review_text": "  Extremely good Storrytelling, an excellent Atmosphere, and well written Characters are only a few things Consortium has to offer. Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Got that for free,developers are best guys that i ever seen.Maybe that was because im followed it,greatest indie adventure game.It worth of spended money :) and free soundtrack is worthy too.After little upgrade game can be best of indi type.",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet!",
            "review_score": "1"
        },
        {
            "review_text": "Consortium is a little bit of an odd duck - the best way I can decribe it is as a 'poor man's Mass Effect'. Both have similar main ships, both have similar multiple choice dialogue systems and both have the choices and consequences of words and actions.   Consortium's graphics are very different tho, they sit firmly on the blurred line between serious and cartooney, but I personally like that. I also liked the fact that it felt like you had complete run of the ship, it felt like interactions between yourself and other crew members was more natural and less forced/scripted. I also liked the fact that lots of things were there to discover or not, it didn't really matter.  On the downside, I didn't like the fact that once in a while I would feel a bit lost, not helped by the fact that some crew are 'unavailable' for interaction at certain times, without any sort of rhyme and reason. I didn't like the fact that accidently pressing the wrong key meant a conversation (and who knows how much else) was terminated and irretrievable. Even tho I liked that fact that it didn't matter to the game whether you found out stuff or not, I didn't like the fact that I finished my first runthrough with a measly 5 achievements!!  All in all, a fun little (short) game with decent graphics, a decent, well thought out story with replay value and a nice little cliffhanger at the end - after all, it IS part one of a planned trilogy!",
            "review_score": "1"
        },
        {
            "review_text": "A great start. Sad to find that it's episodic/serialized. Damn.",
            "review_score": "1"
        },
        {
            "review_text": "WOW. This is clearly a breakthrough in interactive storytelling. I've never seen a game so complex, dialogue-wise. Had loads of fun playing it and will play it again, because the possible threads seem countless. It was rather short and left me craving for the next part of the game - hopefully, we'll soon hear from the Developers about it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, played it through once, but already wanting to play it through again making different choices",
            "review_score": "1"
        },
        {
            "review_text": "This has the potential to be a great game series in the same vein as mass effect.  Unfortunately this first game is quite short and very rough around the edges. The game systems look like they have a lot of potential, but most of it is wasted given that you'll spend the vast majority of your time in this short game wandering around the plane talking to people. There is very little combat outside of the in-game simulator so you never really get to take advantage of the combat system at all. The story just kind of ends rather abruptly right when you think the game is about to really get going.  This game has options for using a gamepad on the main menu, but not all of the in-game menus support the controller (most notably the inventory), and some critical buttons aren't even mapped so you still need a keyboard to play the game.  The silver lining in all this is that they're already working on what is episode 2 to continue the story and hopefully start realizing the potential of what they have here.  Given the reasonable price and the potential of this series, I can tentatively recommend it, but be aware that this feels very much like an unfinished game.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. Its just brilliant. Reminds me of a few different games in many ways.. I love how your just on the space craft your on and its about that journey and the things that happen whilst on board..a murder , an attack.. etc you are part of the crew and your job is your job and no other characters.. It borrows from games like Mass Effect.. Solaris.. Chase the Express.. yeah well 2 of those games are PS 1 games but if you'v played them you get the idea.. I'm still playing the game but Its very different and i dig it.",
            "review_score": "1"
        },
        {
            "review_text": "I rarely ever review games but because this is a small indie game and has impressed me so much with its depth, I have decided to recommend it.  If I feel like it, maybe I'll get around to explaining why my decision is such.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of that game by Psygnosis called   Psygnosis Sentient   [en.wikipedia.org]   Not as heavy on the roleplaying as Sentient and has waaay more action.  Sadly not as detailed as sentient either.  That being said ifyou liked Zork or Sentient you will like this. Be warned though there is a significant action portion like missile command and a fps.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, a bit short Somehow got only 15 fps on an old i3 + gt 540m laptop",
            "review_score": "1"
        },
        {
            "review_text": "This game is awful. I have tried to play it several times but it just does not work. I spent $9.99 on this game and it can't even run right. Don't waste your time or money. 4/10 would not recomend",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't even played it, it just keeps crashing on me, even on the lowest quality, so annoying!!",
            "review_score": "-1"
        },
        {
            "review_text": "The whole thing feels like the shell of a FPS/RPG. It doesn't feel complete. Also, there are some parts of it thatt are just plain clunky. I think there should be a better tutorial (in game) about equipping items and attacking. I wish there was a better option below besides would I recommend or not. I am more in the middle than that. I just lean towards no.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game Overall!",
            "review_score": "1"
        },
        {
            "review_text": "glad i got it when it was 6 dollers:/ great potentel but to short just like space merchent :/",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game, but it is buggy to the exent of being unplayable. I have repeatedly gotten locked out of rooms by invisible walls, completely locked inside rooms, run into faulty game loads where triggerd events do not occur, and some side missions are imposible to complete due to bugs, etc. Clearly whatever system they were using to script events is broken and I have run out of patience.  This game and its characters are not nearly interesting enough to put up with these issues.",
            "review_score": "-1"
        },
        {
            "review_text": "Five minutes of a loading screen and then it crashes. Again. And again.  Thanks for making me a bit nostalgic. But I'm really glad I did not by this game for money. Seriously, it's not 1996 anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Play with keyboard and mouse but conversation buttons come up as unbound but some controller inputs work, turn on controller and neither keyboard or controller works. ♥♥♥♥♥♥♥♥ and unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "I would like this game a whole lot more if it wasn't for the 4th wall breaking rubbish, it goes to great lengths to remind you endlessly that the game is a game which kills any sense of emersion for me. I know it's part of the plot but I could do without.  The gameplay/combat isn't the greatest but it holds up, they've gone for a slightly dated aesthetic but it fits with the overall feel of the game. The voice acting and dialogue occasionally strays into the bizarre but for the most part it works.  A decent (if short) game. If only it took itself seriously.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting concept and an enjoyable experience, especially as it is possible to test out a universe in just a couple of hours. Likely will draw you back to complete multiple times, BECAUSE it is so quick to do so.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth 20$. No question in my mind.  It does need noting that this game aparently had a shaky release, but as of buying it I can say I have had no issues with it.  The story elements are fantastic, all VA's are well recorded and sound organic, not like durp npc durp. The flow of choices are smooth and don't feel like roadbumps or contrived.  Combat could be a litttle better but it works enough and isn't the main focus of the game so it doesn't detract from the gameplay.  All in all, if you're looking for something that feel like mass effect and star treck ♥♥♥♥ed and gave birth to an indie title so underpriced for it's quality it's a steal, then buy this.  Actually just buy this.",
            "review_score": "1"
        },
        {
            "review_text": "This thing is busted. On many levels.  It's very unique, and also very, very good. And totally busted. Know that by showing interest, you're asking for some frustration, but then play it anyway.  It is worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting concept",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot of potential, it somehow remembers me of stanley parable in the choice and consequence department and otherwordly mystery. It has good voice acting and you feel like you are in a star trek episode. I commend the devs for trying something so different. The game is not with its downsides though, it had a really bumpy start and it's not that well optimized. I hope they get better at this department on their next game, looking forward for it. ",
            "review_score": "1"
        },
        {
            "review_text": "In general, based on the quality of the game, how many different ways it can go, the depth of the characters and everything else. It's pretty dang awesome. I would like to say it's well worth its normal asking price based on this, but it's just too small a game for me. It feels like I bought the intro to a bigger game, like this was originally going to be part of a list of chapters like those recently popular tell tale games, but they split it apart so they could get away with more self funding.   (Which is fair, given they arn't a big studio so will need all the funding they can get.)  I suggest anyone buy it, as its a quality game, but if your like me, and don't have much spending money, wait for a discount (like I did).",
            "review_score": "1"
        },
        {
            "review_text": "I like the game but it does have its problems, for me i seem to have a white bar running across my screen that really doesn't obscure my vision but it is sort of annoying.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a solid, good storyline. I also recommend this game to TNG fans or fans of choice based games.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game!!",
            "review_score": "1"
        },
        {
            "review_text": "Consortium is one of those games that (a) defies a strict pigeon-hole; and (b) slips under the radar at release, but comes to be seen as a classic in time, like Hostile Waters or Sacrifice.  Set in the sealed environment of a futuristic plane in an alternative reality, your connection to the world is through the mind and body of Bishop Six, a sort of peacekeeping commando belonging to the Consortium, this world's UN/global goverment.  However, not all is as it seems. You are actually accessing this reality from our own via iDGi's proprietary technology- a satellite link across multiple realities. ( This is an excellent plot device for explaining the 'gaming-ness' of your visuals, they claim not to have perfected the technology yet). As a result, none of your colleagues know that you are controlling Six, and in order to not arouse suspicion you must play along, learning the story-and your past- as you go.  To further complicate matters, shortly after your arrival a murder is committed, and with the suspect sealed on board, time is running out for you to find them before things get worse. Much worse.  Where this game succeeds is in creating an incredible sense of place. The environment, the crew, the world building- all of it combines to make a believable future- if somewhat overwhelming. Keeping apace of all the new information can get a little much at times, although there are extra materials available outside of the game to give you a little more grounding.  Hands down the best thing about this game is the voice acting. One or two dodgy accents aside, the pace, delivery and impact of the cast is outstanding- you really do start to feel the personalites shine through. Add to that a conversation system that is timed, and you have to think carefully and quickly about what you say- making enemies on board probably isn't wise...  Combat- of which there is little- is not particularly satisfying, and mercifully avoidable. Despite being FPS, it just doesn't seem to have the kick you'd expect it to. However, this is a minor gripe, as the game really should be played more in the style of a police procedural, finding clues, teasing information from crewmates and suspects, and choosing whether you can trust someone enough to reveal your existence- without dropping Six in trouble.  The game does finish on a high note, albeit a cliffhanger- this is the first in a trilogy, with the second due to hit Kickstarter this year.  It's a bit of an oddity, Consortium, but when it gets it right it's worth the price. Most reviews were for a release that had quite a few bugs, but the support from the developers since has rendered the game stable and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "This game it's absolutely stunning in the way how to tell a story. For me it's have everything, good written characters and voices, great screenplay and very detailed lore.  The game mechanics are great, your choices make a difference, every game its different, i have never seen such a replayability.   And I like the graphics, it's suits the game.  About the bugs, I was waiting to patch 1.2 and they did good job, not a single crash or bug. I have played the game for 17 hours (finished it twice). Only some graphic glitches, nothing serious.",
            "review_score": "1"
        },
        {
            "review_text": "great story mechanics and different routes to completion, cain' wait to see how our choices affect the second game",
            "review_score": "1"
        },
        {
            "review_text": "A fun ♥♥♥♥ing game!  Really gets you into the game",
            "review_score": "1"
        },
        {
            "review_text": "Received a free copy on the weekend of Jan 17, 2016. It's actually a really neat first-person body snatcher simulator, and the legal agreement at the beginning and punching random people add to the immersion. I'd still rather play Skyrim, which became funny when I found out Jeremy Soule did the soundtrack for this.",
            "review_score": "1"
        },
        {
            "review_text": "Version 1.1 is still in a horribly unstable, pre-beta state. Cannot recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "OMFG! SO MANY BUGS! the game have been out for almost 2 months now... and i cant even play for an half hour without any bugs eccuring.! i pay ♥♥♥♥ign 20 euro for this crap! and the ♥♥♥♥ing programmers must be so damn incompentent.  DONT PAY FOR IT AND DONT PLAY IT!   those employers who made this game should be ashame of themself!   WHAT AN DISAPOINTMENT!",
            "review_score": "-1"
        },
        {
            "review_text": "Confusing as ♥♥♥♥ and generally unenjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Come for the Scilons, stay for the quantum limbo.",
            "review_score": "1"
        },
        {
            "review_text": "it is a really good game",
            "review_score": "1"
        },
        {
            "review_text": "Consortium doesn't reall know what it want to be. It's Deus Ex, but there are far too little action segments. It's a Telltale game, but there are far too many characters, and not any of them is actually memorable and relatable. It's also very short as it was meant to be played through several playthroughs.  Even though I got this game for free through a promotion, It doesn't give this game a free pass. I kept waiting for the actual game to start and all I got was a cliffhanger ending to promote the next game in the series.  This is not how gaming today should look.",
            "review_score": "-1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "Although rife with bugs, CONSORTIUM is a very cool RPG. I'm not going to go into detail about the various role-playing elements (duh, it's a modern western RPG) and how it plays on the idea of its self-awareness. However, it will say (and here comes the cliche!): 8.5/10 would restart from last save, hit the reset buttom, blow on cartridge, etc.!",
            "review_score": "1"
        },
        {
            "review_text": "It took long enough, but now I can finally remove my negative review and put in a positive one: at last the myriad of bugs that ruined my experience are, seemingly, fixed.  The story's great, the characters engaging, and the voice acting top notch. Thoroughly loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Consortium is a great game. There are just a few bugs that really bother me though, like not being able to move when coming out of the virtual training program. Otherwise I do recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a stable, not even a beta. Sorry!  It is a great game, it offers good interaction possibilities with the NPC, with a interesting story starting to unfold while playing. Consortium takes place in a small but open world interesting enough to explore and with some action if reading and listening gets to troublesome. But it is the buggiest game since STALKER. Qicksave every minute (at minimum) or you will lose a lot of time. The dialogues are great, but none is worth listening three times in a row because of the crashes. Last but not least: I have never, never, never reloaded any scene in any other game as often as this free fall here.  Sorry, this is not playing, this is gametesting and paying for it :(  Better Luck next time!",
            "review_score": "-1"
        },
        {
            "review_text": "..... what . . . . . wait . . . . wait. . . . . . WH. . . . whatttttttttttttttttttttttt? ...... no . . . . .no . . . . . . . . *sob* . . *sob* . . . . . . . . . . . . . . 10 out of 10, best game ever . . . kinda . . . . perfect 100 . . . maybe . . . . i dont know how i feel right now. . . AMAZING GAME, highly recommend/ish.. . . . . just play it yourself. And i swear to god, you developers better finish part two. dont change nuffing about the game, just...finish it, . . . please . . pretty please. . . . . . .     ",
            "review_score": "1"
        },
        {
            "review_text": "Not good. Bugged out during tutorial stages, U.I. so bad I just gave up.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game ever? yeah that works... oh the company gives a ♥♥♥♥... hmmm... that could be... well great!  Ever thought i wish i was in that great sci fi adventure movie...  'Would be kewl to be that character and actually give a ♥♥♥♥ about all this!' NOW YOU CAN! and you will care! buy it! DO IT!  no joke best thing since... sliced.... computer gam.... its the best idk.",
            "review_score": "1"
        },
        {
            "review_text": "I have a weird graphic issue in which there is a diagnal line running from the top left of the screen to the bottom right. Only about an hour of gameplay on record and I feel like this 'odd' line shouldn't be there. I'm running an nVidia 755 GTX with 2gb of dedicated memory and I have 8gb of RAM so I know it's not a hardware issue. Hell, I run ArmA II on high settings with no hiccups. Not sure what the problem is. So it's annoying and makes it hard for me to want to even play the game.  As far as gameplay goes...haven't made an opinion.",
            "review_score": "1"
        },
        {
            "review_text": "  Hey KORL, do you know why they don't play poker in Afrika?! - Cause they don't have cards? No caHRL, because they have too many Chetaahs there TOO MANY CHETAAHS CARL!!!",
            "review_score": "1"
        },
        {
            "review_text": "A lot of cheeper early access games are more stable, this might have a better story, but i dont know, because i keep crashing, and getting 3 fps at the tutorial sequence.  Wait and spend your money on something else.",
            "review_score": "-1"
        },
        {
            "review_text": "8/10 would bang all the chicks.",
            "review_score": "1"
        },
        {
            "review_text": "  I love this game. Thats it. You should play it.",
            "review_score": "1"
        },
        {
            "review_text": "  -",
            "review_score": "-1"
        },
        {
            "review_text": "You really should play this little Jewel :)  High replayability, good dialogues. A very good effort :)",
            "review_score": "1"
        },
        {
            "review_text": "Multiple ways to play, multiple story threads - the closest thing to the original Deus Ex!",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "  Really nice and refreshing mix of genres with an immersive storyline. Well done !  Only alt tab crash keeps me from playing more. :)",
            "review_score": "1"
        },
        {
            "review_text": "very interesting little game that unfortunately ends with a cliff hanger. More of a sit and watch/listen type of game with the occasional task to do. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A good game, but kind of short if you don't get it on sale.",
            "review_score": "1"
        }
    ]
}