{
    "app_id": 264480,
    "name": "BlackSoul: Extended Edition",
    "release_date": "2014-02-26",
    "developer": [
        "XeniosVision"
    ],
    "publisher": [
        "Droid Riot"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 77,
    "price": 3.99,
    "description": "Horror and death are waiting for you behind each corner and every door. What would you do when meeting them face to face? Would you silently wait for the end huddling up into a corner or would survive at all costs in order to find the sources of evil?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/264480/header.jpg?t=1555985733",
    "minimum_requirements": "OS: Xp SP3, 7 and Vista Processor: 2.8Ghz dual core Memory: 2 GB RAM Graphics: 512Mb with OpenGL 3.0 ( Intel chipset not supported ) Storage: 3200 MB available space Additional Notes: low budget graphics might not work - Windows 8 is not officially supported",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I really wanted to like BlackSoul: Extended Edition because it's an old-school survival horror that pays homage to the classics, such as Resident Evil, Silent Hill and Alone in the Dark, but I just can't due to the large amount of bugs, glitches, loading screens and camera issues.  The first problem I noticed with the game was the horrendous 'Cinematographic' camera which sometimes aims at the ground for some reason, but thankfully, you can choose the far better tracking camera which helps a lot when you're navigating through dark areas. Loading screens are a pain the backside too because they're everywhere, even you're about to enter a small room. However, the developers will be removing most of them in a future update (if that will ever happen).  One of the main problems that I had with BlackSoul: Extended Edition is that I was defenseless. The first weapon that I picked up instantly vanished from my inventory, so I had no choice but to run from one room to another while avoiding zombies who just so happen to be standing on paths that I need to take. As soon as I died, I quit the game and uninstalled it.  Right now, I can't recommend this game to anyone, not even those who enjoy the classic survivial horror games of the 90s. If the main issues that I mentioned in this review are solved in a future patch, then I will consider playing this game again and hopefully give it a positive review.",
            "review_score": "-1"
        },
        {
            "review_text": "very similar to old-skool resident evil.  my favorite thing is you can change the camera from old skool resident evil style like in code veronica where the camera follows you but switches at certain points, or you can make it just like resident evil 4, over the shoulder.  the atmosphere is even similar to older resident evil. it has the creepy eerie feeling to it that you got when playing resident evil 1-3.  the zombies look awesome and so far are traditional walkers.  the graphics are to my liking, not the best graphics in the world but they work beautifully for this game.  there are puzzles that are just like what you'd see in resident evil. find the knob to this door, find the key for that, what's missing here? etc.  finding ammo, weapons, keys, etc are just like resident evil.  if you liked the older resident evil games at all, then you will love this. or if you never played them but like survival horror games then get this.  -------------------------------------------- CONS: controls are easy to use, but it takes a minute to get used to. perhaps they need to add side stepping. you can turn with the mouse, and the keys WASD are to move around but A and D turn you, unlike most games, but i can already turn with the mouse, i keep using A and D to move around corners as i would in other games but keep forgetting it doesn't do what i want lol. not game breaking at all though. ---------------------------------------------  despite the few cons this game has it is still very fun and a great game.  don't listen to any other reviewers that give this game a bad rating, they don't know what they are talking about.  the game does not load in every room. the loading times are not very long. the camera isn't bad at all. etc. the game is fine as is. the game seems to run completely fine, i have not ran into any bugs or glitches yet, and the devs say they are still working on it. so buy this game and help them....and yourself.  never listen to a critic and find out for yourself!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you like classic Resident Evil games, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Its glitchy,buggy and the worst part is that stupid camera views that are just unplayable big no no no no no no no no NO.",
            "review_score": "-1"
        },
        {
            "review_text": "This is what happens when you let children make a Resident Evil game. I shot a zombie and the game crashed. Almost impressive amounts of ineptitude. 11/10",
            "review_score": "-1"
        },
        {
            "review_text": "I have yet to get this game to run. It's broken. Avoid at all costs. From what I hear, even if you can get it running it is pretty lame.",
            "review_score": "-1"
        }
    ]
}