{
    "app_id": 264560,
    "name": "Quest for Infamy",
    "release_date": "2014-07-10",
    "developer": [
        "Infamous Quests"
    ],
    "publisher": [
        "Phoenix Online Publishing"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "RPG"
    ],
    "achievements": 59,
    "positive_ratings": 113,
    "negative_ratings": 20,
    "price": 6.99,
    "description": "Wealth. Women. Wildly offbeat jokes. Lie, cheat, steal, and embrace your inner rogue. Being bad has never felt so good.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/264560/header.jpg?t=1529970588",
    "minimum_requirements": "最低: OS: Windows XP, Vista, 7 or 8 プロセッサー: 900 Mhz メモリー: 128 MB RAM グラフィック: Direct X Compatible Graphics Card DirectX: Version 5.2 ストレージ: 1800 MB 利用可能 サウンドカード: Direct X Compatible Sound Card",
    "recommended_requirements": "推奨: OS: Windows 7 or 8 プロセッサー: 1.2 Ghz メモリー: 256 MB RAM グラフィック: Direct X Compatible Graphics Card ストレージ: 2 GB 利用可能 サウンドカード: Direct X Compatible Sound Card",
    "reviews": [
        {
            "review_text": "Quest for Infamy has the forest setting of Quest for Glory I: So You Want To Be A Hero.  Its got the varied class-specific sidequests of Quest for Glory 2: Trial By Fire.   It has the vast scope (over 200 hand-drawn areas!) of Quest for Glory 3: Wages of War.  Part of the plot concerns the fate of the cursed Killington family, an eldritch tale right out of Quest for Glory 4: Shadows of Darkness.  And the massive port city of Tyr feels a lot like Silmaria from Quest for Glory 5: Dragon Fire.  In short, if you liked Quest for Glory, you will REALLY like this game. Play it for the nostalgia alone.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, it is an awesome nod to the classic point-and-click adventure games. For myself, the game deserves a 10/10. Love the Easter Eggs with reference to popular culture as well as to classic games: the Weeping Angel reference in the graveyard was just too funny, wonder if there is a way to make it a secret bad end if you keep looking at it?  It is kind of sad that you can't do mixed classes (since I used to love making a magic wielding thieft in Quest for Glory), but the game compensates for it by making class specific quests and story instead, which makes the gameplay interesting in its own way. Let's not forget to mention, the hint of a sequel, too! Now if only the achievements and minor bugs could be fixed when the patch is out.....",
            "review_score": "1"
        },
        {
            "review_text": "This is quite simply one of the finest Adventure games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "put simply, if you miss the good old Quest For Glory by Sierra, this will gloriously satisfy you. Great stuff!",
            "review_score": "1"
        },
        {
            "review_text": "This is a marvellous game. The story is really interesting and engaging. Unlike some other games, you feel you are part of the story in this one. The game is varied as well, with some fighting (which you can have as 'easy') but also puzzles to solve. Being able to play three different games (as three different characters) is also a plus as you certainly get value for money.  Absolutely recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I died because i broke a door. 10/10 would break some door again. P/s: Also i like that disembodied voice.",
            "review_score": "1"
        },
        {
            "review_text": "  if you like classic retro sierra games this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "The voice acting in this game is just brutal. It's not just that the actors are terrible, which they are, but the quality of the sound recordning is also bad, and the writing itself is just a complete failure at trying to be funny. For general gameplay otherwise, it's just tedious from what I played before giving up. Maybe it gets better later on, but all I did was wander around a confusingly laid out town and talk to people getting increasingly frustrated that a required plot point wouldn't get triggered involving a public execution. Once I finally triggered that by exhausting all dialog with every character in town, I wandered around some more trying to find someone who could trigger a class choosing quest. I finally get that, then I'm dumped outside town, and I'm wandering around trying to find some monster I'm supposed to kill and not finding it for 20 minutes. That was enough for me.",
            "review_score": "-1"
        }
    ]
}