{
    "app_id": 265170,
    "name": "Acceleration of SUGURI X-Edition HD",
    "release_date": "2014-07-01",
    "developer": [
        "Orange_Juice"
    ],
    "publisher": [
        "Rockin Android",
        "Rockin' Android"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Action",
        "Indie"
    ],
    "achievements": 18,
    "positive_ratings": 176,
    "negative_ratings": 37,
    "price": 4.79,
    "description": "In Acceleration of SUGURI X-Edition HD (aka AoSXE HD), the &quot;little war&quot; continues at a breakneck pace. AoSXE HD is an enhanced version of the eagerly awaited sequel to SUGURI.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/265170/header.jpg?t=1447359515",
    "minimum_requirements": "OS: Windows® XP, Vista, or Windows 7 Processor: Intel® 1 GHz Processor or comparable Memory: 256 MB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 500 MB available space Sound Card: DirectSound-compatible Sound Card",
    "recommended_requirements": "OS: Windows 7 Processor: Intel® 2 GHz Processor or comparable Memory: 512 MB RAM Graphics: DirectX® 9-level Graphics Card DirectX: Version 9.0c Network: Broadband Internet connection Storage: 500 MB available space Sound Card: DirectSound-compatible Sound Card",
    "reviews": [
        {
            "review_text": "Had to kill all my friends in order to protect my pudding. Also apprently beat up God in the name of pudding. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not a shooter game, contrary to what you might expect at a glance. Similar to the old Xbox 360 title Wartech: Senko no Ronde, it's a 1v1 fighting game with cute bullet-hell girls. There aren't that many characters and the gameplay is relatively simplistic, but even then, it's really fun, and the characters are pretty different. Super fun in multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of both shoot 'em ups and fighting games, this game gives an interesting mix of the two with a quirky feel that reminds me of Touhou. Also, the music is great.",
            "review_score": "1"
        },
        {
            "review_text": "Fast and Action packed!!! I HIGHLY recommend buying this game! Worth every penny, I hope to face one of you! lol",
            "review_score": "1"
        },
        {
            "review_text": "Game's online multiplayer is absolutely broken.   From what little gameplay I experienced, it was fun; but don't expect to be playing this game online with friends.",
            "review_score": "-1"
        },
        {
            "review_text": "It's... alright, I suppose. It's a versus shoot-em-up, which is nice, because we need more versus shoot-em-ups. It's a low-polish, barely-story, basic-art game... but it's still fun as a casual pick-up-and-play kind of game. So it narrowly gets a Recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Its like Zone Of Enders only in fash/anime/chibi format. A fast paced fighting game that is CUTE, FUNNY and FULL BLAST UP YOUR ♥♥♥ from start to finsh. If you havent bought it yet, you should. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Thank you, Otaku God, for blessing me with this hype-as-♥♥♥♥ game. Amen. (swag swag swag)",
            "review_score": "1"
        },
        {
            "review_text": "If you don't buy this game, you are personally insulting me.   Serious review:  I've been playing this game on both PC and Ps3 since 2011. Game is amazing. Fast, Frantic, Hectic. I describe it to friends as a 'High-Movement, Versus Shoot 'Em Up'. and it's pretty accurate. You control a character and fire weapons and laser swords and giant fists at your opponent to reduce their hp to zero at an alarming rate. The game is simple on the surface and allows very deep and quick-reaction strategy. When you become more skilled you both see and feel its rewards.  There are tiers of 'this character is definitely better than this character', but there are no flowcharts. It's a matchup-intensive game but it is driven by KNOWLEDGE, and by ADAPTATION. Any character can win. You have be very cognizant of situations and understand when to push, when to back off, when to set up. There's a lot that goes on constantly. You have to watch the camera, you have to watch what's /not/ on the camera, everything is nuts because it all happens so fast.  The first fifty or so rounds that you seriously play in this game will be a blur of 'I have no idea what's going on and I have no idea what i'm doing.' This is -normal- and you'll acclimate quickly from there. It's just like watching or playing anything for the first time.   There are cons, but to me they don't mean anything compared to the pros. - Some people don't like the camera functionality. (I think it adds a layer of strategy and meta - Despite what I said above, some characters really do struggle in every match. - Please never pick QP unless you're being a nutbar. She's too good and is banned in competitive circles.  I love Acceleration of Suguri X Edition. I want you to love it, too. Add me and let's play.",
            "review_score": "1"
        },
        {
            "review_text": "Hats off to the team that brought this to Steam. All of the problems I encountered at launch have since been fixed and this is a fantastic title I'm glad to have in my library. Fast paced 2D aerial combat at its finest. Pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "A port from the PS3 version but with awkward netplay. Doesn't distract from how the game is very fun, even by yourself. It'd just be more fun if I could play with some friends. Himeisbestgirl.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game to play if you're into doujin shooters and have spare cash to burn. Too bad about the bugs (examples include flickering at full screen, broken achievements and from what I've heard, multiplayer not being up to scratch).",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game. I wish I knew how to play it, though.",
            "review_score": "1"
        },
        {
            "review_text": "Faster than Sanic.",
            "review_score": "1"
        },
        {
            "review_text": "Too hard for me, can't defeat Robo, use cheat X_X I tought this a bullet hell game but more fighting game",
            "review_score": "1"
        }
    ]
}