{
    "app_id": 265210,
    "name": "Viscera Cleanup Detail: Santa's Rampage",
    "release_date": "2013-12-13",
    "developer": [
        "RuneStorm"
    ],
    "publisher": [
        "RuneStorm"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Gore",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Gore",
        "Indie"
    ],
    "achievements": 13,
    "positive_ratings": 3645,
    "negative_ratings": 395,
    "price": 1.79,
    "description": "Tragedy! Santa; the toy giving folk-hero, and purveyor of fine Christmas goods, has had enough. Endless requests from greedy children wanting more and more every year, tax increases, pressure from elf unions, bills, reindeer!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/265210/header.jpg?t=1478187383",
    "minimum_requirements": "Минимальные: ОС: Win XP SP3, Win 7 Процессор: 2.4GHz Dual core CPU Оперативная память: 2 GB ОЗУ Видеокарта: 512MB Shader Model 3.0 Nvidia GeForce 8800 GT or AMD Radeon HD 3870 DirectX: Версии 9.0c Место на диске: 800 MB",
    "recommended_requirements": "Рекомендованные: ОС: Win XP SP3, Win 7 Процессор: 2.6GHz Quad core CPU Оперативная память: 4 GB ОЗУ Видеокарта: GB Nvidia GeForce GTX 560 or AMD Radeon HD 5850 DirectX: Версии 9.0c Место на диске: 800 MB",
    "reviews": [
        {
            "review_text": "The halls are covered with elven entrails, Fa la la la la, la la la la.  Don't forget the shotgun shells, Fa la la la la, la la la la.  Massacre in the jolliest of jollies, Fa la la la la, la la la la. It's time to clean up all the bodies, Fa la la la la, la la la la.  See the blood dripping everywhere, Fa la la la la, la la la la. Santa's Rampage is fun alone or shared, Fa la la la la, la la la la.",
            "review_score": "1"
        },
        {
            "review_text": "disturbingly arousing",
            "review_score": "1"
        },
        {
            "review_text": "My Christmas tradition since 2013. Some people want to watch A Christmas Story. I want to clean up a workshop littered with what used to be elves.",
            "review_score": "1"
        },
        {
            "review_text": "i am the mop king",
            "review_score": "1"
        },
        {
            "review_text": "♫♫cleaning santa's workshop♫♫♫ ♫♫hhmmm its full of dead elfs and blood♫♫ ♫♫and instead of cleaning im making a god damn mess♫♫",
            "review_score": "1"
        },
        {
            "review_text": "  iam cleaning up santa's house while sitting in my messed up room 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this game for £1.43 you can't beat it, just spent 2 hour's cleaning and burning bodies, didn't complete the job though something's are so hidden and hard to find/clean, Will carry on playing this untill i beat it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so amazing that I couldn't think of what I would be doing around Christmas every year, it's been there for me when I have been extremely bored, and this game is not the usual type I'd play. It's a physics interactivity type game, you're cleaning up after Santa's rampage, where all of the elves are dead. It's a huge mess, so it's going to require a lot of time to clean. Not only that, but they still release really awesome updates, 3 years later after its release, and I'm loving all the new features they've been working on.  What makes this game all the more amazing, is that the creator(s) haven't left this game yet, they still put love and time into it, and that's pretty much why I enjoy playing it every year, like I don't remember how all the last times went.  If you like a game where your job is to clean an entire building, then this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Got this in a bundle and its a fun time waster for that price point. If you are unnerved by Christmas, then you may love this more or it will freak you out more.  7/10 in a bundle 5/10 at full price",
            "review_score": "1"
        },
        {
            "review_text": "Bloody hell...(no pun intended) This game is oddly satisfying... o.o",
            "review_score": "1"
        },
        {
            "review_text": "Cleaning is fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is an odd concept that is delivered remarkably well; sick and funny in equal parts, both disturbing and satisfying. I cannot deny that it is calming to clean up after Santa lost his rag, but I feel that this won’t apply to everyone. This makes it a hard game to grade, for those who enjoy salivating the cleaning urge it will like scratching an internal itch; if the concept doesn’t grab you, it will feel like a waste of time. As long as you know what you are going into, I think you can have a lot of fun with this game; it would be nice to have a progress bar though.",
            "review_score": "1"
        },
        {
            "review_text": "Clean up all them ♥♥♥♥ and viscera in the freakin name of Chirstmas and Jesus Chirst will guide you to success with hacks like ghost, cleanup hax and random keybinds.",
            "review_score": "1"
        },
        {
            "review_text": "OMG I DONT EVEN CARE IF THE IDEA IS STUPID I PLAYED IT AND I LOVED IT END OF STORY",
            "review_score": "1"
        },
        {
            "review_text": "I played this off the back of watching a film by the name of 'Sunshine Cleaning', it's a charming yarn about a pair of sisters played by Amy Adams and Emily Blunt. One sister (Adams) is a smart determined single mother gritting it out as a cleaner to support a slightly problematic child whilst at the same time fitting in an affair with a married man who has absolutely no respect for himself, Adams or his pregnant wife!!....the other (Blunt) is caught half way between being a dreamer and a screw up. To cut a long story short out of necessity they form a crime scene cleaning company by the name of Sunshine Cleaning, burn down a house and decimate family relationships only to build them back up again.  Viscera Cleanup Detail: Santa's Revenge doesn't feature Amy Adams or Emily Blunt, it doesn't even feature Alan Arkin as a slightly potty father selling popcorn out of the back of a sedan one week then struggling to shift seafood lovingly preserved in his bathtub the next....it did however teach me one thing, which is that this crime scene cleaning lark isn't for me.  Upon entering the grotto the game advise's me that Santa has had a break down and went ballistic with a shotgun. Elves are scattered everywhere, limbs are scattered everywhere, the walls and carpets are painted red. I spent 20 minutes walking around in circles following bloody footprints only to realise that they were my own as I'd stepped on an Elve's head when entering the grotto....this is a far cry from getting the hoover out on a Sunday afternoon and following it up with some light dusting and a few sprays of anti-bac surface cleaner. Every few mop strokes im having to ring it out in the water bucket, every few minutes im forced to freshen up the water in the bucket, it's feels like a job and for that the developers deserve massive praise.  'Sunshine Cleaning' 8/10 - Amy Adams shines in a touching drama about love, life &amp; family.",
            "review_score": "1"
        },
        {
            "review_text": "Blood got glitched in floorrboards, but had a great 5 hour bonding experience 10/10 would clean again.",
            "review_score": "1"
        },
        {
            "review_text": "It's so good I love omfg have a wank to it.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to relax and clean up after a spree killing santa claus? This game is so cathartic. There is nothing better than getting a room clean, just to watch a stick of dynamite explode elf bits violently across a room.",
            "review_score": "1"
        },
        {
            "review_text": "Holy moley, took me so much to clean everything!",
            "review_score": "1"
        },
        {
            "review_text": "I find this game super fun. Mildly disturbing, and mysterious. (That's because of the secret Rudolph nose.)",
            "review_score": "1"
        },
        {
            "review_text": "I love this dlc! It's a great game to play with friends, same as the main game (but you will need Hamachi for the multiplayer to work).",
            "review_score": "1"
        },
        {
            "review_text": "Stupid, kind of fun for a little bit, got boring, but still not terrible.",
            "review_score": "1"
        },
        {
            "review_text": "It is freaky but its fun! and you have the chrismass spirit with you so you wont feel sad about the elfs and the randiers :D",
            "review_score": "1"
        },
        {
            "review_text": "Do you want a game that you have to clean up elf heads and learn about santa's dark past or something well this is the game for you  7 1/2 dead elfs out of 10 dead elfs",
            "review_score": "1"
        },
        {
            "review_text": "OMG, this game is so good. I love the humor, gore and overall gamplay of theis great joke game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious. I think it's great.",
            "review_score": "1"
        },
        {
            "review_text": "Why is this fun for me",
            "review_score": "1"
        },
        {
            "review_text": "Nice, pretty funny and epic MON!!!",
            "review_score": "1"
        },
        {
            "review_text": "Prior to playing Viscera Cleanup Detail, I would fanaticized about being a janitor. Not necessarily for the job itself, but I feel the 1997 movie   Good Will Hunting   may have had an influence. Every time I would ponder on the movie, I finish the thought train with, “what would it be like to be a janitor?” Perhaps Damon makes the job seem somewhat interesting; that I may one day find an unsolvable problem on a white board and know exactly how to solve it—or dissolve it, with some cleaner.  To the point. This game fulfilled my desire and allowed me to experience just how ♥♥♥♥♥♥ of a job it would be to be a janitor—especially after the jolly fat man has a freak-out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really stupid.. But its addicting at the same time. Its not a lot, but hey, nothing wrong with a $2 game.    **Some items tend to bug though the floor; overall good game",
            "review_score": "1"
        },
        {
            "review_text": "It is pretty fun, pretty cheap, and very replayable. Maybe just a teensy bit disturbing at first.   The cons- It has some glitches that you can work around with commands. Also, it doesn't have a save feature as of yet so you need to have a block of time free to play or leave it running if you have interuptions. The inability to save would be my biggest complaint.  The pros- burning everything. Smashing ornaments. Blowing yourself up. Shaking dead elves after a rough day. Seeing how dirty you can make it or how clean.  While I haven't tried playing with others yet I think that it would be pretty fun. Playing by yourself takes a pretty long time for a complete clean up.",
            "review_score": "1"
        },
        {
            "review_text": "Play this once a year with my friend, I've thought about nothing but playing this game on Christmast this year",
            "review_score": "1"
        },
        {
            "review_text": "LOOKS LIKE SANTA CLAUS DRANK TOO MUCH NOG LAST NIGHT!  RATING: 10/10 - I ♥♥♥♥ING HATE MY JOB",
            "review_score": "1"
        },
        {
            "review_text": "This game, even though it might ruin your childhood memories of Santa, you will enjoy cleaning up his mess, after the 'incident.' I prefer anyone that has some cleaning skill to pick up this game and the other games with it. And this is just a bit like a BETA version. Wait till the real one comes out.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and recommend it just because its cheap and not long download.Plus the fact that its kinda realistic. BUy now",
            "review_score": "1"
        },
        {
            "review_text": "This is more fun than cleaning up bodies in real life!!!",
            "review_score": "1"
        },
        {
            "review_text": "Do you have OCD? This game will definitely test how true you have OCD. I promise you.",
            "review_score": "1"
        },
        {
            "review_text": "really fun game cleaning up dead elves and mutilated reindeers and you get to walk around santas house who doesn't want to do that. A must buy from me.",
            "review_score": "1"
        },
        {
            "review_text": "Bucket throwing simulator, would rate 10/10 again..",
            "review_score": "1"
        },
        {
            "review_text": "OMG, this game is so good. I love the humor, gore and overall gamplay of theis great joke game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hilar add on for VCD, I am not far in it yet but enough to laugh a bit and see its a neat new setting just in time for the holidays..",
            "review_score": "1"
        },
        {
            "review_text": "If you like tedious chores and cleaning up blood and frustration as items glitch through the floor and you curse the Gods for their crimes because now you will never be able to clean up everything because a bullet shell glitched through the ground then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "You know how cleaning sucks in real life? Well, this game is just the opposite!!! The cleaning in this game is really fun and really funny, but can also make you mad. The cool thing is, is the multiplayer feature, so you can clean with your friends!!! Great game, never stops being fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, interesting and great multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "best game 2014 better than cod ghosts 11/10 would join friend and spill blood everywhere again 30/10 would try to make water buckets and kill friend with TNT again",
            "review_score": "1"
        },
        {
            "review_text": "I would actually recommend this at full price... it's so bliss to listen to a podcast and pick up dead elves, maybe stuff a few in your box, as a keepsake. You know. Burn gifts, ruin Christmas. So relaxing...",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best - I've played more of the Christmas Edition than the normal edition - but seriously, the best if you're looking for non-intensive immersion gameplay.  It does get frustrating after a while when you keep having to redo parts, but that's also part of the fun so suck it up princess.  The best part is the gore - seriously, the cartoony gore. This game knows it's meant for fun and just runs with it.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever played Kingdom Hearts? Specifically, the 2nd one? Then you will love thus game. Combat flows nice and smooth in battles, and the aray of moves you can perform makes you feel like a total badass! It has an easy to follow map and quite a few secrets and collectables! All-in-all, this is a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "645 mins in and guess what? No sanitzed earth achievement, and I cleaned everything spent hours getting bottles from behind bookshelves and building walkways to clean the ceiling, walked out of santas office and random body parts fell from the sky starting another long hour of recleaning. Has offically ruined christmas for me. Best 2 dollars I ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "Clean blood footprints.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Buy this, buy this now.",
            "review_score": "1"
        },
        {
            "review_text": "I hate doing chores as much as the next guy, but give me a mop and tell me to clean bloody murder in Santa's workshop and i'm your man.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun, not much content but worth the price highly recommend this. also anybody know how to set up mutliplayer.",
            "review_score": "1"
        },
        {
            "review_text": "santa ♥♥♥♥ed up  and you will clean up  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Geat game if you wanna laugh at x-mas or just loose ur mind trying to clean those fkin dwarfs",
            "review_score": "1"
        },
        {
            "review_text": "This game was made from a good idea.. However cleaning a room is fun for one hour. After that, it is more boring than funny and the only reason that I have finish this game is Achievements. So I don't recommand this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I am so glad that Santa isn't real.",
            "review_score": "1"
        },
        {
            "review_text": "good game apart from it being extremely glitchy",
            "review_score": "1"
        },
        {
            "review_text": "thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "its a good game but the box you get at the start i picked it up and i gliched to the other side of the room ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. Fun for lets plays.",
            "review_score": "1"
        },
        {
            "review_text": "A very funny fun game, would recommend it. :)",
            "review_score": "1"
        },
        {
            "review_text": "*walks into reindeer pen area* 'Oh my' *walks further into reindeer pen area* 'Wait, what is this red apple doing he- ohhhhhhhhhhhhhhhhhhhhhhhhhhhh'  10/10 would mistake the nose of a certain reindeer for a red apple again.",
            "review_score": "1"
        },
        {
            "review_text": "Dispite giving me nightmares through the Christmas Holidays it really captures the Christmas Spirit and gives you the opportunity to help those in need. In this case, a fat psychopath in a red suit who just murdered his minions.  Its a great buy for only a few dollars and is especially fun to play with your friends.  I would only recommend this to those who have a good enough processor exceeding 2.4 Ghz and those who have a sh*t load of patience.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "funny game. Looks really good and is fun.",
            "review_score": "1"
        },
        {
            "review_text": "excellent way on celebrating the holidays!",
            "review_score": "1"
        },
        {
            "review_text": "Why this game hasn't won numerous awards in realistic janitorial simulation is a question I ask myself every day.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "blood, clean yes is good",
            "review_score": "1"
        },
        {
            "review_text": "many fun so game such graphics wow",
            "review_score": "1"
        },
        {
            "review_text": "Why this game hasn't won numerous awards in realistic janitorial simulation is a question I ask myself every day.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Oyus. Very damage. So blood. Much fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to see what santa does to his elves when they slack off or donesn't do what he wants you can find out about this game GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "Christmas Game of the Year 2013....  Makes you the next 'santa' after some gameplay",
            "review_score": "1"
        },
        {
            "review_text": "I think I just got fired but I can't read the reason because of all the blood...",
            "review_score": "1"
        },
        {
            "review_text": "This is really fun for some reason, I like cleaning I guess. This game will provide enjoyment for some reason or another. It is not so much the cleaning up dead bodies; more the physics, the graphics, and the easter eggs, I find addicting. Plus, you get your own office with even more easter eggs, some unlockable.",
            "review_score": "1"
        },
        {
            "review_text": "kinda repetitve and there isn't really anything else to do after you clean the entire room but there's chopped off elf heads so i guess it's okay",
            "review_score": "1"
        },
        {
            "review_text": "Would every day clean for santa",
            "review_score": "1"
        },
        {
            "review_text": "8/10 You get to clean ♥♥♥♥ up during Xmas-time, would recommend to friends.",
            "review_score": "1"
        },
        {
            "review_text": "The map is too small and it get boring if you play too long.",
            "review_score": "-1"
        },
        {
            "review_text": "Gore! Cleanup with ur awesome mop! so many blood!!!",
            "review_score": "1"
        },
        {
            "review_text": "I'm only about 20 minutes in, and my god, the carnage! You can't help but smile and play with elf-parts.",
            "review_score": "1"
        },
        {
            "review_text": "Burn Elves and clean up Blood and Guts with Friends , What more could u want?",
            "review_score": "1"
        },
        {
            "review_text": "Very strange, well made, tedious, but overall pretty cool",
            "review_score": "1"
        },
        {
            "review_text": "Every flipping time I get on, my keyboard freaking shuts off, causing me to be unable to play the game. I have to reset my computer after it crashes, which takes forever. I usually have 3 seconds until the board shuts itself down, which makes me stay still... I dislike this game with a burning passion. So long to my money. I will miss it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game ♥♥♥♥ing sucks, don't waste your money. Lost $3",
            "review_score": "-1"
        },
        {
            "review_text": "As the title suggests, play the role of a janitor sent to clean up the aftermath of Santa's rampage through his workshop. When you first enter you'll be surprised to find just how bad the rampage was. Gameplay is pretty basic, clean up the workshop and dispose of Santa's victims to clear the game. The mop cleans up blood and soot, the tracker locates messes or objects, and your hands grab/throw things. The mop has two uses first is to clean and the other kind of acts as a mean to strike/hit objects. The tracker's blue scanner tracks nearby messes while the green tracks potential objects you need to dispose of to clear the stage in a 'hot-and-cold' style. Low slow beeps when nothing is near to high rapid ones the closer you get. With your hands you can pick up just about any object or activate machines to dispense tools to help you clean.  One machine will dispense water buckets used to clean your mop when it's absorbed too much filth. Another machine will produce special bins you can carry trash, items, and objects in to dispose of. Oddly enough the only way to dispose of dirty water, objects, and bins themselves is to drop it into the fireplace. Sometimes however the bucket dispenser will drop out TNT bundles or body parts which can make your task even more frustrating. It's recommended you keep a water bucket at hand to drop the TNT into as quickly as it appears to prevent it from exploding. Unfortunately this isn't information they tell you and I lost count how many times I had to flee from the room to prevent getting blown up. Adding insult to injury you then have to clean up the mess left behind.  The bins can be equally frustrating. Meant to make your task easier they can also make it tedious. Objects are easily knocked around and if you bump into the bin from the wrong angle expect it to tip over. They do give you the ability to rotate things back to a standing position via grabbing and using the activation button. However if you have anything in that bin expect it to go flying all over the room. I must have knocked over the same bin at least a dozen times or had to clean it up again because the objects went flying. For the most part if you fill it right and properly grab the bin it remains fairly sturdy when moving it around. So they do have some use.  Now the biggest annoyance has to be the messes themselves. Even after playing for a few hours, scouring every spot I could find there were still hidden spots I couldn't and choosing to 'Clock-Out' would deem an automatic failure. A tiny invisible splotch of blood you can't see, a smudge from an explosion. The tiny bulbs that hang on the tree and garland count as messes too if they leave a colored paint splatter upon breaking. Sometimes this can be on the ceiling out of reach because a stick of TNT went off. Only way to reach them requires cheating. Due to bugs the mess you need to mop up might be hidden under the floor preventing you from finding it too. The tracker is little help since it doesn't specifically show what you missed. So again in this case you may need to resort to using the 'KillNearbyMess' command to clear it. Currently the game is still in a beta-like stage so hopefully this will be fixed in later patches.  Overall the game is a novelty and can be fun if you only want to cause mayhem, especially for the price. But after you've beaten it (There's only the workshop.) then that's it, after all that you won't likely play it again. Tossing dead elves around or blowing things up with the TNT can only entertain for so long. If you have a friend who's already bought the game, try it out for yourself before you buy. In the long run there's other games that can offer more replayability than this. Viscera Cleanup Detail: Santa's Rampage for the price is pretty good, but frustrations and having to resort to cheating just to clear it prevents me from giving a recommendation for now.",
            "review_score": "-1"
        },
        {
            "review_text": "As a  standalone  I would not recommend this game. The map is really small and I highly doubt there will be many more fixes or add-ons to this game. If you buy this along with the original Viscera Cleanup Detail then I think it is a welcome addition.",
            "review_score": "-1"
        },
        {
            "review_text": "In all, this is a good game.   Let me start at the beginning. Viscera Cleanup Detail started as a standalone mini-game for Shadow Warrior. While it was boring cleaning up dead guys, the gore shocked most. Now in this edition, apparantly Santa got pressured by elves, dumb wish lists, and reindeer crap. He took a shotgun, a knife, and rage, and killed everyone. While this is disturbing for those young Steamers out there, once again, the gore shocked most into playing it repeatedly. The game features those surgeon simulator graphics, so it wasn't realistic. However, the graphics mean nothing. The only thing that caught players' attentions, was the shocking aftermath and story.   So in conclusion, the cleaning is boring for most, but the fact that Santa melted under pressure shocked players into enduring @#$! to clean it all up!",
            "review_score": "1"
        },
        {
            "review_text": "i think its hard to clean the room 100% but i think theres only one map so a bit boring",
            "review_score": "-1"
        },
        {
            "review_text": "it will not let me play!",
            "review_score": "-1"
        },
        {
            "review_text": "it dosent work 4 me, it says something stopped working, my friend thinks its my pc space, is this right? please help me, i really wanna play this game!",
            "review_score": "-1"
        },
        {
            "review_text": "Low quality all round",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for an hour or two but if you leave the game it won't save... I tried getting everything done when I blew up from TNT and my body part flew under a table and couldn't get it. It was good for $1.99 but for anything above $2 I suggest not getting it.",
            "review_score": "-1"
        },
        {
            "review_text": "  wont load the game",
            "review_score": "-1"
        },
        {
            "review_text": "This game is horrifyingly funny and yet disturbing. You make your way through Santa's workshop finding elf bodies, reindeer bits, booze, and explosives! This game is enjoyable for those who are OCD and is fun to clean up completely maybe twice at most. Good buy for $2 and I would recommend this game if you are bored out of your mind.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont reccemend this game because its only good at winter and i need people to play it with me to enjoy it and its only 1 levle",
            "review_score": "-1"
        },
        {
            "review_text": "Why did I do it, why did I clean the whole place? Why did I repeatedly clean the same ♥♥♥♥ as it got bloody and sooty again? Why did the game tell me it wasn't actually clean when I tried to quit? Why? Whyyyy? Why did I play this at all?",
            "review_score": "-1"
        },
        {
            "review_text": "0:04 - mokrun: fps drops 0:04 - mokrun: it's ♥♥♥♥ing 2013 0:05 - mokrun: why no one optimizes their ♥♥♥♥ to use 8 cores 0:05 - mokrun: #firstworldproblems 0:06 - Рэйнбоу Даш: lock to 30 0:06 - mokrun: heavy drops when turning arounds 0:06 - mokrun: around* 0:06 - Рэйнбоу Даш: below 30? 0:08 - mokrun: how do i measure framerate with bandicam? 0:08 - mokrun: oh 0:08 - mokrun: found it 0:09 - mokrun: mostly 60 0:09 - mokrun: drops to 24 at random times 0:10 - Рэйнбоу Даш: does for me too 0:10 - Рэйнбоу Даш: when too much blood 0:10 - mokrun: hmm 0:10 - mokrun: i suposed to clean the blood to get higher fps? 0:10 - mokrun: quite logiq 0:10 - mokrun: logic* 0:11 - Рэйнбоу Даш: that's how life works 0:11 - Рэйнбоу Даш: you getting hooked up as you work more 0:11 - Рэйнбоу Даш: at first you al llike 'meh, kill me im bored' 0:11 - Рэйнбоу Даш: = low fps 0:11 - Рэйнбоу Даш: they it gets better 0:11 - mokrun: i guess you're right 0:11 - mokrun: but it hardly was planned, don't you think?",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty enjoyable game with very good graphics and big variety of actions, great to be played with a friend online.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is super cool    8/10",
            "review_score": "1"
        },
        {
            "review_text": "Santa's been naughty and late for this christmas. Now you can clean up his messes with a friend or solo.",
            "review_score": "1"
        },
        {
            "review_text": "so simple and time consuming, but very satisfying when you're done cleaning.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to mess around with but the clean up games get old fast. All my friends and I do is blow each other up.",
            "review_score": "1"
        },
        {
            "review_text": "Ok just, jesus this is a bloody gud time with some friends, but i don't..... have... any (REVIEW DONE)",
            "review_score": "1"
        },
        {
            "review_text": "This is simply hilarious, and a steal at its current price, I reccomend for all, especially people with OCD",
            "review_score": "1"
        },
        {
            "review_text": "cleaning up dead bodies for two bucks, why not ! this game is a great time waister, and with added multiplayer you can get togther with some friends and set some elves in fire. Really there not much else to say.   Merry Christmas and you missed a spot XD",
            "review_score": "1"
        },
        {
            "review_text": "For a (not so) quick and (not so) easy game that will kill time, THIS is the game for you.   Santa, you are a ****.",
            "review_score": "1"
        },
        {
            "review_text": "This game is strangely addicting - I logged about 4 hours on my first playthrough, yet all you really do is clean. Still, it's fun and pretty entertaining to play as you figure out what exactly happened there. Definitely addicting for anyone who's mildly OCD, and I'd highly recommend for just a couple dollars!",
            "review_score": "1"
        },
        {
            "review_text": "I dont know about you but this is one of the creepiest experiences I've had on a sandbox game. Basically your a Janitor and your job is to clean up Santa's resent rage. Well what you find i sthe beauty of bloody elves in a more dark setting. Mostly recommended for people who like dead things and messing around. (You can play with friends TOO!)",
            "review_score": "1"
        },
        {
            "review_text": "I have been looking for a morbid Christmas game since the Santa Slayer demo, about 10 or more years ago, and this was pretty much what I'm looking for. Almost like a sequal to it honestly, since Santa goes on a rampage. The only difference is, you're the one cleaning up, instead of killing...or you can make a mess.  It's a pretty straight forward game, and not too fancy. You can make the mess way worse, sometimes without trying if you're not careful. Getting rid of the elf bodies takes some time, due to having to maneuver them to the bucket, without getting blood everywhere. I just got to the point where I burned them in the fireplace which excited me a bit too much.   All in all, for the price, I think it's pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "hands down one of best underplayed and unknown games 7.8/10",
            "review_score": "1"
        },
        {
            "review_text": "This was good game but i can't belevie what santa done .I saw some vodka i thing he was drunk lol",
            "review_score": "1"
        },
        {
            "review_text": "I can not even run this GG :steamsalty:",
            "review_score": "1"
        },
        {
            "review_text": "i highly reccomend this game to those who enjoy goofing around with a freind or just a more slower game with a few rushes here and there, though it IS in early alpha and has a crap ton of glitches, its still an enjoyable time!",
            "review_score": "1"
        },
        {
            "review_text": "Only one word. Fun. Ok make that a lot more words. This game is amazing and epic. So much physics and I love physics.",
            "review_score": "1"
        },
        {
            "review_text": "this game is freekie but cool ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever play the only thing I hate is that the body parts leave so much blood ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! single player isnt so funny as multiplayer,but its ♥♥♥♥♥♥ hilarious!Best played in multiplayer (you need hamachi to play multiplayer)",
            "review_score": "1"
        },
        {
            "review_text": "Moral of this story, don't be on Santa's naughty list!   10/10 Dead Elves",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to shout at your friends for setting fire to your carefully constructed meat effigys made of a delcate mix of assorted elven meats, raindeer meats, and broken bottles? Well, if you said yes: 1. I recommend a mental hospital 2. I recommend this game 3. I recommend you add me on steam. (Anarchy in numbers!)  9/10 Egg Nogs",
            "review_score": "1"
        },
        {
            "review_text": "Great game,who knew cleaning up the remains of elves and an outburst on one of the jolliest people could be so fun?  10/10 would make another murderous rampage happen to play again.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS AWSOME",
            "review_score": "1"
        },
        {
            "review_text": "I was once asked: 'What is the definition of insanity?' I replied with: 'viscera cleanup detail",
            "review_score": "1"
        },
        {
            "review_text": "Usually, I write huge reviews, but here, there is not much to say but HOW AWESOME AND FUN this game actually is. Please buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "you clean santa's rampage up, thats cool",
            "review_score": "1"
        },
        {
            "review_text": "Mostly what you are doing is cleaning up after what you can see is Santa's Rampage, it is more entertaining to play with friends, but if you are by yourself then it is more for when you are bored and need something to keep your mind at ease and entertained mildly. If you want a series of games that lets you clean bloody messes and piles of mutilated bodies, then this is your game. Only recommended for the ones that like to get rageful when a dirty pail of blood splatters on the floor a bunch lol.",
            "review_score": "1"
        },
        {
            "review_text": "Bought and played this around Christmas time with my son and son-in-law and we were laughing our butts off. Such a fun and twisted game that made for a ton of laughs and some seriously messed up screen shots. Replay value is high just to see how bad you can jack the place up next time or how clean you can actually make the pad. A little glitchy at times when too much is happening on screen at same time but still enjoyable when quickly asdressed. Ridiculous amout of fun this title is. Cannot recommend enough if you want a fun and twisted hidden gem to play.",
            "review_score": "1"
        },
        {
            "review_text": "This game is oddly satisfying. This is for me, the best Viscera Cleanup Detail version there is. It's so fun to just hop in a server with your friend, clean up stuff and mess around.",
            "review_score": "1"
        },
        {
            "review_text": "DJ KEEMSTAR says he's going to sue this game because they didn't have the DramaAlert music in it.",
            "review_score": "1"
        },
        {
            "review_text": "It's good game.",
            "review_score": "1"
        },
        {
            "review_text": "a really fun little game! i would defiantly buy this game if i was you because for £1.79 you really cant go wrong! ",
            "review_score": "1"
        },
        {
            "review_text": "good game  voted 4 it for good game  edit: i edited this review because i want a badge to be completed",
            "review_score": "1"
        },
        {
            "review_text": "'Dead' Fun game, definitely worth the £1.79 to play.",
            "review_score": "1"
        },
        {
            "review_text": "If you add a save then it's 9/10 but otherwise it's 6/10. I HATE STARTING ALL OVER!!!!",
            "review_score": "1"
        },
        {
            "review_text": "hands down, its over 9000!! and it just awesome although i would like to see the game with a save option so it would make me feel like i did some progress without doing it for 5 hours straight",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, and cute. Cleaning out santas office, I see a couple bundles of TNT. Oh, ill dispose of it. The little sticks of TNT didnt do much, but it made a little mess... ill get rid of the rest all together! So after ive gathered the rest of the TNT I can find on the map, I throw it in a hazmat bin into the fire and back up. and it explodes.... much bigger than I thought. I died. I didnt even think you could die. Huh.  So in comes my replacement, and I go to the water bucket machine. Better clean up myself, I suppose. I hear the machine grind, and expect a hand or chunk of meat to come out instead of water. Well, not exactly. Its another bundle of TNT. Lit. I die. Again. 10/10 fun game",
            "review_score": "1"
        },
        {
            "review_text": "Play this with a friend who's easily angered, and you're all set.",
            "review_score": "1"
        },
        {
            "review_text": "If I spent as much time cleaning IRL as I did on here, I might have a girlfriend... JK, I've got a girlfriend... She does all the cleaning though...",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why but when you add dead elves and blood evry wear a cleaning game somehow becomes fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is AMAZING! I like all the blood and stuff. Only recomendation is to be able to save your progress. Other wise Amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Played this for a little while, it was a little laggy to begin with but after playing around with the options it was fine.",
            "review_score": "1"
        },
        {
            "review_text": "I Love this game its just the fire place makes it really laggy for me i have a really good lap top but with the fire going everywhere it really dosent help but it is a really really fun game lol",
            "review_score": "1"
        },
        {
            "review_text": "Hours and hours of endless things to do! So fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great use of 2 dollars and 50 cents, got a lot of fun out of this game despite how small it is.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game but it says theres an error and every time i try to play the game it wont let me and it cant find the problem plz help me! D:",
            "review_score": "1"
        },
        {
            "review_text": "Good game But not working for me it says MSVCR100_CLR0400.dll missing",
            "review_score": "1"
        },
        {
            "review_text": "Love it !",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games, really. Humorous, entertaining, great timekiller. Pick it up with some friends and enjoy a night of laughs.  Also one of few games in which you can be a true scrublord.",
            "review_score": "1"
        },
        {
            "review_text": "Oh God. This game........this game was something. It was nice for the price, but it was very difficult. I had to cheat to get to the ending. The ending (if you want me to spoil it)    was actually very dissapointing. You basically clock out and the game ends.   Overall, if you want to torture yourself like I did, get the game. Buy it for someone else if you want them to suffer as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for OCD people like myself... haha just kidding, i love to blow up the dynamite and make a bigger mess &gt;:D mwahahahahahahaha!! ;D",
            "review_score": "1"
        },
        {
            "review_text": "I never knew that cleaning would be so fun and addicting! This game is just amazing, yet so simple. Just a price for a couble of bucks isn't that bad! The game is very creative, especially when you can put some dead elf carcuses in the 'Janitor's Trunk'. I'd give this game at least a 9.8/10. If you haven't yet, deffinatly purchase this, it'll be one of the best few bucks you'll ever spend!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ the cleaning",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for my friend and I, it was 2.49$ when I got it. We played for a little while, this game is fun. I don't know why cleaning up blood and burning body parts is so fun but it is.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with friends, but we can never seem to get the place looken very good, to be honest it usually looks worst by the time we leave. But anyways this is a great game i'd suggest buying.",
            "review_score": "1"
        },
        {
            "review_text": "mess cleanup simulator 2013 X-mas edition",
            "review_score": "1"
        },
        {
            "review_text": "Never had so much fun cleaning up blood and dismembered bodies! I don't even have to get up!  10/10 will mop again.",
            "review_score": "1"
        },
        {
            "review_text": "I've justed finished wasting 5+ hours of my precious life.  Good if you are under something, donno. Would never play it again. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun you can have in a janitorial sim, and I mean that as a good thing. Super hilarious when you get over how it looks like five episodes of Dexter happened at the exact same time in a very small space. Watch out for your footprints!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game. Kinda gruesome with all the blood and body parts, but a lot of fun. It is open so you can do the clean up or make a bigger mess your choice. (Bigger mess is fun :) ) All in all I think it is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Hours and hours of endless things to do! So fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you have OCD then this is the perfect game for you! (Good) Beautiful graphics  (VERY) Long playtime Nice phisics engine Uses the UNREAL engine Good comedy (Bad) Machines can be (very) evil TNT can be Over Powered NO SAVE POINTS Has to be completly clean before victory   ",
            "review_score": "1"
        },
        {
            "review_text": "Fun, bloody, and interesting!",
            "review_score": "1"
        },
        {
            "review_text": "A game that makes you want to do something you dread IRL - clean. Hilariously fun, especially playing with a friend. So many WTF moments when all of a sudden something explodes and kills you, when the bucket of bloody water gets knocked over, and the damn bloody footprints that appear out of nowhere when you've already clean the area around you! Somewhat unpolished, buggy, glitchy. If that's something that really bothers you, steer clear for now. But for $2? How can you lose! Only complaint I have is connecting to a multiplayer game requires opening ports and inputting your hosts' Global IP manually. Other than that, it's unsettlingly fun. Still don't know what the sniffer tool does though. If somebody can enlighten me on this I would greatly appreciate it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the kids.",
            "review_score": "1"
        },
        {
            "review_text": "This game is - how shall I put it? - 'unique'. Simply put, although it will never win any Game of the Year awards, it's a cheap, stupidly fun game that seems to have brought to life Weird Al's 'The Night Santa Went Crazy'. If all that appeals to you, then go get this game. What are you waiting for?",
            "review_score": "1"
        },
        {
            "review_text": "For a (not so) quick and (not so) easy game that will kill time, THIS is the game for you.   Santa, you are a ****.",
            "review_score": "1"
        },
        {
            "review_text": "Throwing elf bodies into a fire has never been more entertaining!",
            "review_score": "1"
        },
        {
            "review_text": "Fun time-waster. Worth the $2 in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why this is a thing but I'm oddly glad that it is.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is totally fun!!! and I can play with friend",
            "review_score": "1"
        },
        {
            "review_text": "The only reason Santa gave me coal for Christmas is because he hates winners.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game, and i love all of its easter eggs.   This game is AWESOME! Every Steam's user should have this.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game makes my hands shake and my forhead wet...",
            "review_score": "1"
        },
        {
            "review_text": "For those who haven't had a chance to play any variation of this glorious game, now is a better time than any. Besides the original alpha (which is still up for download on the dev's website) this is the only official independent release of the game. There was one that came with Shadow Warrior as well, and I can imagine that one is just as fun.  First of all, yes, this game is a joke. That's the point. It's witty, it's sarcastic, the concept is amazingly silly, but it's an extraordinary amount of fun. For a game that may as well have been titled 'Janitor Simulator 2013', I think this game has given me more pleasure for $2.49 than at least half the big brand games out there have on sale.  Don't get me wrong. This is a fairly one and one kind of game. I'm not saying the appeal will last forever. But with it's 13 achievements and cheap sale price, you can get at least 3 or 4 hours of fun out of this game. Not only that, but supporting it means you're providing the funds for the developers to keep making more. As we've already seen with Shadow Warrior, this medium provides the potential for dozens of parodies.  Viscera Cleanup Detail runs on the Unreal Engine 3, which means that any of game running on the Unreal Engine 3 has the potential of being ported easily for this game. This list includes, but is not limited to: Bioshock Infinite, Alice: Madness Returns, Borderlands 1 &amp; 2, Deadpool, Dishonored, Devil May Cry, Mass Effect, Sanctum, Section 8, THIEF, Tribes: Ascend, XCOM, Outlast, Xeno Clash II, and on and on and on the list goes!  And for each game you could have different interactions and achievements, possibly even hard mode scenarios where you have to work around the NPCs that are there, such as cleaning up around workers in the slums of Finkton, or having to clean up around the club goers on Omega while being able to interact with the local barman. The potential for this game is all but endless.  My point is if you haven't had a chance to play this hilarious game, do so. Go and download the Alpha off their website (Google it ya bums!) and if you like it, spend the $2.49 and support the creators. I would very much like to see more of this game in the future.",
            "review_score": "1"
        },
        {
            "review_text": "i &lt;3 this game  ",
            "review_score": "1"
        },
        {
            "review_text": "amazing so funny and creative",
            "review_score": "1"
        },
        {
            "review_text": "This game... You can have to much fun with it. I played with Mrblue588. We nearly died of laughter. I mean it. You should really buy this and play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game! 2 dollars worth.  a little bit glitchy but thats oke, it's still a beta version D: can't wait until the full version!  I am watching out to play multiplayer with some friends :D",
            "review_score": "1"
        },
        {
            "review_text": "Welp... If Santa need a Cleaner... and i get payed  IM IN!  Best Game",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game,but it gets boring after a while playing it. I like the story theme and all the little details that they put into this game. i just wish that they would add more rooms or something else to make it more interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Only Played for few minutes because lack of sleep &amp; the Workshop was very bright, THE BLOOD IS SO THICK, why OH why SANTA &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; love games like these, something different, cant wait for the zombie DLC or the sequel, move over COD &amp; BF, SANTA IS COMING TO TOWN!",
            "review_score": "1"
        },
        {
            "review_text": "very fun game :P!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game to play for a couple of hours. Ive put countless hours in this game and have never fully beaten it yet. You literally play as the clean up crew after santa went AWOL and blasted everything in his workshop. The co-op online was a bit tricky, had to make my own server for any of my friends to be able to join (which took forever). Dont buy this for over 5 bucks",
            "review_score": "1"
        },
        {
            "review_text": "If you love the cheery christmas spirit hanging in the air while you pick up elf gibs-then this game is for you. The game itself is based around cleaning...dead body parts and blood, with the occasional self lighting dynamite thrown in to make you appreciate these simpler aspects. The physics are good, but when picking up a disposable box full of giblets and bullets, the objects inside will rattle about excessively-making for an annoying trip to the incinerator (in this case the fireplace) When you have picked up the bits, there is still the matter of mopping the floors and walls to deal with. Fairly simple: switch to the mop, dab the mess-when the mop turns excessively red and starts painting blood, give it thrust into a bucket of water from the nearest Splosh-o-matic (Don't spill it...) Rinse and repeat. Fun to play if your a neat freak, or find the stress of christmas is soothed by some not so jolly activities. ",
            "review_score": "1"
        },
        {
            "review_text": "nothing suits christmas better than a bloody mess to leave you scarred for the rest of your life. I always wanted to be a janitor. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is just the normal Viscera but santa theme, Worth a buy for th price I admit",
            "review_score": "1"
        },
        {
            "review_text": "This is just the normal Viscera but santa theme, Worth a buy for th price I admit",
            "review_score": "1"
        },
        {
            "review_text": "viscera is a game about claening up some elses mess but the problem is that the game doesn't run and the level is quite small to run around in.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm currently on Santa's naughty list, I didn't think of it as a big deal before, but after experiencing through the eyes of this lone janitor what Santa could do, I fear for my life. If you have a 1-horse open sleigh and willing to give me presents send them to  HOHOHOMERRY♥♥♥♥YOU@Claus.net . Thank you brave elves.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game in many different ways!!! You can mess with TNT and blow up bottles and papers ETC. You get to clean up blood and dead body parts and as groose and boring as that may sound it can give you hours of fun especially if your OCD and want to lean every square inch of Santas house. There are also two other games that go with the original and shadow warriors which just have new maps that you can clean and find new things in. The whole game series is amazing with a pretty nice look to it and it runs very smoothly even when recording. So if your a huge fan of good looking games, simulators ETC then buy this game plus when there are $2.49 deals for this game its a no brainer buy for this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Really amusing, despite lacking a large amount of gameplay, it makes up for it with odd physics and little secrets thrown about. If you run out of gameplay call in a friend for even more sandbox like gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Totally Love this game, Shows great detail in limbs and the blood is realistic... Over all this game deserves another feature and it is VERY under priced for how awesome the game truly is, if you want a nice and bloody game, Here it is :P I rate 11/10 You guys really over did it! (In an obviously good way of course)",
            "review_score": "1"
        },
        {
            "review_text": "This game is as hilarious and addictive as a burning clown made from crystal meth! Definitely worth a play even if it's just for a chance to get an idea of what vicera cleanup detail is like to play.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I just wish that it didn't lag so much.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever! Best deal ever made!  You will die of...ness  -Luissnygg2014  BUY THIS GAME        if you dare",
            "review_score": "1"
        },
        {
            "review_text": "e   PacificRimKaiju 18 Sep @ 11:39pm  @tinix even though this is a old pill pack can you add the chestburster and alien queen please   Illuminati Cat Food™ 12 Sep @ 8:08am  Look For the Lower Case 'L' And You Will Be Kissed Tomorrow: LLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLlLLLLLLLLLLLLLLLLLLLLL LLLLL *Now Look For The Q And Your Wish Will Come True: ... ... ... ... ... OOOOOOOOOOOOOOOOOOOQOOOOOOOOOOOOOOOOOOOOOOOOO O.. .OOOOOOOO *This Is Really Hard, Now Find The 'N': MMMMMMMMMMMMMMMMMMMMMMMMMNMM *Now Find The Mistake: ABCDEFGHIJKLNMOPQRSTUVWQYZ *Something You Really Want, After the countdown!!!!! 10 9 8 7 6 5 4 3 2 1 Now Close Your Eyes And Make A Wish! ;*;*;*;*;*;* Now Paste This On 9 pages And Your Wish Will Come True! Hurry, You Have 20 minutes! Or What You Wished For Will Be The Opposite   NeptunianGamer 3 Sep @ 7:09am  ook For the Lower Case 'L' And You Will Be Kissed Tomorrow: LLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLlLLLLLLLLLLLLLLLLLLLLL LLLLL *Now Look For The Q And Your Wish Will Come True: ... ... ... ... ... OOOOOOOOOOOOOOOOOOOQOOOOOOOOOOOOOOOOOOOOOOOOO O.. .OOOOOOOO *This Is Really Hard, Now Find The 'N': MMMMMMMMMMMMMMMMMMMMMMMMMNMM *Now Find The Mistake: ABCDEFGHIJKLNMOPQRSTUVWQYZ *Something You Really Want, After the countdown!!!!! 10 9 8 7 6 5 4 3 2 1 Now Close Your Eyes And Make A Wish! ;*;*;*;*;*;* Now Paste This On 9 pages And Your Wish Will Come True! Hurry, You Have 20 minutes! Or What You Wished For Will Be The Opposite",
            "review_score": "1"
        },
        {
            "review_text": "Awesome,fun cleanup game if u like bloody splat,  dead body horror parts flying in the air  than this game is totally for you =P :)",
            "review_score": "1"
        },
        {
            "review_text": "you cant blow up door so dont try ♥♥♥♥ me running",
            "review_score": "1"
        },
        {
            "review_text": "It's good game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 has the option 'i am a cleaning god'",
            "review_score": "1"
        },
        {
            "review_text": "I most certainly recommend this game. I have played for hours and I've been having the time of my life. It's so great. Definitely a game I would recommend as family friendly. It has really good replayability. 10/10 would play a million times.",
            "review_score": "1"
        },
        {
            "review_text": "my brother bought this game       i want a refund     its kinda fun    but so stupid",
            "review_score": "-1"
        },
        {
            "review_text": "I get into gory things so I decided to give it a try. I had it for I think 3 Christmas's now and I still have fun playing it. I only play it around Christmas and it's like a new game each time. There are challenges you get to do. I hope they add more challenges. They have co-op as well, I watched youtube video's on it and it cracks me up more than just playing alone.",
            "review_score": "1"
        },
        {
            "review_text": "Atleast this game is better than counter-strike:go.",
            "review_score": "1"
        },
        {
            "review_text": "really great game but a bit repetitive ",
            "review_score": "1"
        },
        {
            "review_text": "in the jolly old town of GET THE GAME",
            "review_score": "1"
        },
        {
            "review_text": "-Walks in -Treds in blood -Walks on the rug  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cleaning made fun",
            "review_score": "1"
        },
        {
            "review_text": "Very fun I think, definitely worth trying I say. There's even a bit of darkness and humour hurried here somewhere. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "I Do Wish they have this for mac cause I Change my computer",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game if you want to spend your time on one thing. I spent 8 hours of this game cleaning the whole house, so it was 100% clean. Then watched a video of it being High Quality unlike mine and turns out I only had to clean the bodies, knives and bombs.",
            "review_score": "1"
        },
        {
            "review_text": "It's so funny to mess around wth. I don't usually clean anything, I just mess around with my friends, and explode things. It was so fun!   10/10",
            "review_score": "1"
        },
        {
            "review_text": "I think santa's mom would be like: 'Clean your room for Christ sake.'  and then this game was born because santa was too fat to clean it and hired some professionals.",
            "review_score": "1"
        },
        {
            "review_text": "wouldnt recommend picking up an elf head and clicking your mouse just dont do it",
            "review_score": "1"
        },
        {
            "review_text": "Had fun making a mess and cleaning alright maybe not the cleaning. :)",
            "review_score": "1"
        },
        {
            "review_text": "relaxing",
            "review_score": "1"
        },
        {
            "review_text": "clean up blood all day",
            "review_score": "1"
        },
        {
            "review_text": "  Oogah boogah there are no ♥♥♥♥♥♥ in this game why did i pay 2.50 for it",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ed up.",
            "review_score": "1"
        }
    ]
}