{
    "app_id": 265330,
    "name": "Gomo",
    "release_date": "2013-12-06",
    "developer": [
        "Fishcow Studio"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 921,
    "negative_ratings": 306,
    "price": 3.99,
    "description": "How far would you go to save your best friend?For Gomo, the answer to this question is clear: To the end of the world and further, if necessary.Join him on his journey through the bizarre 2D landscapes of this dreamlike Point &amp; Click Adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/265330/header.jpg?t=1478167937",
    "minimum_requirements": "Mínimo: SO: Windows Vista or later Procesador: 1.6 GHZ Processor Memoria: 1 GB de RAM Almacenamiento: 300 MB de espacio disponible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "6.2/10 - How far would you travel to find your best friend?  Another solid Daedalic offering; if not shorter than most! Completing the campaign took my only about an hour, so I personally wouldn't fork out the entire price tag.  You are Gomo, a burlap sack of sorts who must travel the world in search of his best friend. You literally will go to the moon and back in your search of this majestic, dreamlike world. The character does move quite slowly, but since the world is so well crafted I didn't mind.   The puzzles are quite easy and require some simple solutions, but they will not indicate if you are successful or not which can cause you to waste a little time before moving on. I found that the simple overlooked solution is generally the right one.   Worth $2.99; it’s good but only 1 hour in length.     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Decent wordless sci-fi puzzle adventure.  Gomo's cute. It's a little over an hour long, and you guide Gomo through various casual puzzle levels, mostly operating some machinery, as he (she? it?) sets out to get the stolen pet back. There's not really any dialogue, and your inventory only has 3 slots (which go unused most of the time), so you can see it's not much of a point&amp;click adventure in the traditional sense, but it operates as if it was one, and the art certainly conveys the feeling that we're moving in a weird and alien world. Windowed, it is 800x600; fullscreen, slightly larger (1030x800 ?) with black borders added.  For its length, the regular price seems a bit steep, but the game has been bundled a few times and goes on deep sales regularly, so it is quite possible to buy this game for a price that is more reasonable. If you manage that, it's certainly a pleasant way to while away an hour.  Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  GOMO Preview (Steam/PC)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "That game reminds me of machinarium,so if you liked one of these games,its highly possible that you will like the other one as well. Puzzles were pretty easy,they did not linger much,I passed them without tips and I'm sure a lof of people can. +Cute style of graphics which I really loved, +Nice musics, +Cute story. Yeah buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Daedalic has a very high standard for point-and-click adventure games but Gomo is very rare exception to this rule as it doesn't really live up to the Daedalic name. The puzzles are easy and all of your solutions are usually found within one frame from which it is also impossible to backtrack. The story doesn't exactly wow you either and the game is overall very short (I completed it in 81 minutes). All of these factors could only lead to a failing grade otherwise, but it is obvious that Gomo is marketed at young children aged 10 or under. It's a wonderful beginner game and if you can get Gomo bundled along with other games or at a very low price (under €5), then it's definitely worth a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly charming and creative point-and-click adventure. I loved the touches of humour and animations in the background, there was something to enjoy in every scene. The puzzles are mostly straightforward and the narrative is very linear both of which may not please some gamers. Simply a little game of joy.",
            "review_score": "1"
        },
        {
            "review_text": "Gomo is an adorable little point-and-click adventure that is perfect when you don't want to tax your brain or reflexes, but still want to poke around a bit at pretty art and really moronic jokes.",
            "review_score": "1"
        },
        {
            "review_text": "Totally loved this game , short but good , funny , cute , love the mood . Need more stuff like this ♥",
            "review_score": "1"
        },
        {
            "review_text": "Extremeley short (one hour and a half!) and very easy. However it's very fun and creative! People compare it to Machinarium but IMO it's way better because it got what Machinarium lacks: common sense, logic, fun and a big cuteness factor. Every tiny detail is well done and even the backgrounds are fun to watch with all the silly sketches going on. I didn't like Machinarium because of its emptiness design - which however perfectly suited the robots world - but Gomo managed to make me come back to logic puzzles games. I love the graphics, very Game &amp; Watch style: pure and sleek, the lightning is very good, music is a bit obnoxious but it goes well with the game's humor. I'm fine with the game length since I grabbed it on sale for 0.70€ :)  TLDR: cute, fun and refreshing! Go for it when it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "sweet, funny, too short",
            "review_score": "1"
        },
        {
            "review_text": "I'd totally kiss you. No Gomo tho",
            "review_score": "1"
        },
        {
            "review_text": "I'm at a loss for what to say about this game. Weird Germans.",
            "review_score": "1"
        },
        {
            "review_text": " First playthrough time: 1 hour    Major Pros:  Adorable art style with unique animations for the character while moving through every scene and around every obstacle Effective wordless storytelling   Minor Pros:  Hidden unlockable mini games are pretty fun Game has a good sense of humor   Major Cons:  Only an hour long Puzzles were occasionally too abstract and it wasn't clear what the goal was   Minor Cons:  Story was at times overly ridiculous  I found the game very cute, but not very challenging. Most puzzles spanned only a screen or two and didn’t require very many interactions to solve once you knew what the goal was. The story was also pretty ridiculous, but at points ridiculously adorable and the game had a good sense of humor (at one point little red riding hood is fighting the wolf with a light saber in the background). My main complaint was that the game was so short. It took me an hour to complete the story and although there are hidden mini-games to find and unlock that are accessible from the main menu, they didn’t increase the time I got out of the game all that much. Overall I thought the game was very cute and fun but was too short to make an impact.",
            "review_score": "1"
        },
        {
            "review_text": "A cute and short click based puzzle game that has the most amusing and adorable side animations. It's a game that's beatable in a half hour to an hour depending on how stuck you get at certain points. Loved the character and animation. The only complaint I have is that I don't think that the game registers that I've completed or finished the game because it always reloads just before I finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "Gomo is...different than any puzzle game that I have played and some of them, I didn't even like. When I played Gomo, it was a unique experience from beginning to end. It may not seem like much, but when you play it, it feels like playing a simple puzzle game that doesn't put emphasis on the puzzles, but on more of the *ahem* story. It was hard for me to find something I didn't like about the game, but the one complaint I had was it was short, but not short as a waste of time. Overall, the game is enjoyable if you want a simple puzzle game that has some bizzare creatures, strange coincedences, and a good experience of a simple game.",
            "review_score": "1"
        },
        {
            "review_text": "if you like a quick puzzle game that you can do in a hour or so Gomo is fun to waste so time",
            "review_score": "1"
        },
        {
            "review_text": "Funny game but definitely too short - you'll finish it in about 1 hour. Keep that in mind if you're going to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "THIS MAY CONTAIN SOME SPOILERS! I was very excited to purchase and play this game, but was incredibly disappointed by the end. It only has about six easy puzzles to figure out and a boring storyline. You learn nothing about Gomo except for the fact that he lost his dog. You don't know what he is exactly, why everything is underground, why these aliens took his dog in the first place, why you randomly travel back into time to nuke a town (the only humurous and non-irritating part of the game to me), why above ground is like a farm type of area...the unanswered questions really are endless. He moves very slowly with every movement which is irritating and the sound effects are absolutely horrible. All of the sound effects literally sounded like the creators made them with their mouths. For example, when Gomo falls, it sounds like a literal whistle noise someone is making. I would suggest not this gameto anyone. It was a complete waste of time and money. Oh and one more thing, the ending credits are very strange. And it's not even a funny strange really; just a super weird 'this game just made me mad and now I have to deal with what the creators think is humorous' strange.",
            "review_score": "-1"
        },
        {
            "review_text": "Gomo is a point-and-click adventure game. The main character gomo is a cork. He lives in a house with a dog. His dog kidnapped by alien. Gomo must save him.   Positiv     Creative drawings    Funny game    Puzzles    Negativ      Resolution max. 800x600  (black border fullscreen)    Minigames    Short playing time  ",
            "review_score": "-1"
        },
        {
            "review_text": "Why has this game an easy option? It's unnesecary, the game is already to easy. You don't really have to think, the solution is always in the same screen, with to or tree exceptions. But then the solution is in the next screen. You can't compare this game to other dedalc adventures, there you actually have to think or search for items. You can finish this game in around 80 minutes. If you could skip cutscenes or the animations when you pick something up or do something, then it would last 5 to 10 minutes. Because it's so short i played it again for the bonus games and that was just a waiste of time. The bonus games are just tree different of whak a mole type games. Im shure you will never play them.  It's kinda sad, this game could be great game, but it's to easy and the sory is just meh.... If you really whant to try it, wait for a good sale deal, at least 75 -80% off.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought it was going to be like Machinarium, but this one its very slow (the story and the actions), and sometimes get you boring because of that. Also its pretty stright foward, no hard puzzles, you don't have to think too much in this game just go ahead and click.",
            "review_score": "-1"
        },
        {
            "review_text": "boring and annoying at the same time...",
            "review_score": "-1"
        },
        {
            "review_text": "        YouTube™ Video:  Steam Cleaning - Gomo&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "A short, but amusing interactive story with point-and-click play. Cute and sometimes funny, but I wouldn't recommend buying unless its on sale and you need to entertain some kids.",
            "review_score": "-1"
        },
        {
            "review_text": "Taking a look at the credits and all the people it took to make this, makes me sad. I have made better games before putting my clothes on in the morning.",
            "review_score": "-1"
        },
        {
            "review_text": "Slow animation.... reallly slow for no reason.... make you quit the game",
            "review_score": "-1"
        },
        {
            "review_text": "Gomo is a cute and at times funny game, but it's too short to justify its price. 112 minutes for €8 means I (would've) spent more than a euro per 15 minutes of playing. That's just ridiculously expensive. Luckily I got the game in a pack with two other Daedalic titles (and the pack was 75% off at the time as well) so I didn't nearly pay €8 for it, but still. It's worth €2,50 at the very most.",
            "review_score": "-1"
        },
        {
            "review_text": "Uh-oh. Honestly, I feel VERY cheated for this. I only spent 0.79€ on game, but I feel really cheated. Why not try? The game is .... Fun... Kind of... Well, cute graphics and character, but this is just another point&amp;click game you can find ALL over the internet for FREE. I wouldn't mind if this was a F2P game. Also, I was SHOCKED when I saw the original price. 8€ for a regular point&amp;click game found ALL over the web, for FREE? I'm not saying it isn't ... Fun ... But honestly, it's such a rip off. These games can be found ALL over the web, and again, for FREE. What I really don't mind, is that there's also bonus content. I can't get pass the code door with WC, cause some alien voice keeps telling me (I think that's what he says): Insert coin. All the good in game is, nice sketchy graphics, cute and 'fun' game, and 3 trading card drops. Accoring to ALL the bad things, this game is rated by me:  3/10. No, I don't reccomend it, sadly. I would if it was free.",
            "review_score": "-1"
        }
    ]
}