{
    "app_id": 265550,
    "name": "Dead Rising 3 Apocalypse Edition",
    "release_date": "2014-09-05",
    "developer": [
        "Capcom Game Studio Vancouver"
    ],
    "publisher": [
        "Capcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Zombies",
        "Action",
        "Open World"
    ],
    "achievements": 88,
    "positive_ratings": 7251,
    "negative_ratings": 3060,
    "price": 24.99,
    "description": "Explore the zombie-infested city of Los Perdidos, and find a way to escape before a military strike wipes the entire city, and everyone in it, off the map.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/265550/header.jpg?t=1554415284",
    "minimum_requirements": "OS: Windows 7 64-bit edition, Windows 8 64-bit edition Processor: Intel Core i3-3220 @ 3.30GHz (or Intel Core 2 Quad Q9550 @ 2.83GHz) / AMD Phenom II X4 945 @ 3.00 GHz or higher Memory: 6 GB RAM Graphics: NVIDIA® GeForce® GTX 570 / AMD Radeon 7870 or higher DirectX: Version 11 Network: Broadband Internet connection Storage: 30 GB available space Sound Card: DirectX 11 Compatible sound card Additional Notes: Broadband internet connection is required for Co-op play.",
    "recommended_requirements": "OS: Windows 7 64-bit edition, Windows 8 64-bit edition Processor: Intel Core i5-4570 CPU @ 3.20GHz or AMD equivalent Memory: 8 GB RAM Graphics: NVIDIA® GeForce GTX 670 2GB / AMD Radeon 7970 2GB DirectX: Version 11 Network: Broadband Internet connection Storage: 30 GB available space Sound Card: DirectX 11 Compatible sound card Additional Notes: Broadband internet connection is required for Co-op play.  An Xbox 360 Controller for Windows or other Xinput-compatible controller is recommended for this game.",
    "reviews": [
        {
            "review_text": "Well, this game has received a lot of hate for a lot of different things, which isn't a surprise. There has been a lot of bugs and problems with this game so far, I also have had a few problems with it but I have luckily avoided the game crashes and so on that some players are reporting. I've only came across some bugs in the gameplay and the bug where you can't answer your phone anymore which then means that you can't talk to any people in the game, and that of course means that you're no longer able to continue with the story so you have to start a new story. However, the good side about that was that the game didn't reset my weapons, clothes, zombie kill count, blueprints, level or anything like that so I basically started the whole story again but with all of the things that I had collected in the previous story.  The game itself is really fun especially if you're able to play the co-op story with a friend of yours, well you don't even need a friend for the game to be fun and entertaining but of course having a great person playing with you always helps!  Even with all of these problems, I still think that the game is worth the buy, I mean, it's not worth 49,99€ (I paid about 19€ for my copy) at the moment because of all the problems it's having but hopefully Capcom will release some patches that fix the game later on.  I'm probably gonna get a lot of hate because I said that I recommend this game, atleast looking at the other reviews of the game as most of them are 'not recommended' but oh well, this is my opinion about the game :)",
            "review_score": "1"
        },
        {
            "review_text": "The very first Dead Rising still remains one of my favorite games of all time. My review might be slightly biased.  I bought this on sale; a massive mixture of concern whether or not it would run on my system, alongside the built up anticipation I have had since the game's release on Xbox One. I don't own, or intend to own, that console anytime soon, so when Dead Rising 3 was ported to PC I was very excited---until I read all of the horrible experiences people with much better systems than my own were having running the game. The Capcom publisher sale finally convinced me to take the risk, and the results have far surpassed my expectations.  With the settings on low, I get excellent FPS, and it is more than playable on medium. I am shocked at how well it is running on my laptop!  As far as the game itself goes, it is interesting having such an open environment to explore this time around. Random survivors will appear that you can save for extra experience, much like the random crime events in a superhero game like the Amazing Spider-man or something, and the stress on time management seems to have been removed for the most part. This can be viewed as a good or bad thing, I suppose: worrying about appropriately scheduling your tasks was a big part of the immersion factor for me. On the other hand, the GTA-ish formula isn't gamebreaking--it is nice to be able to have such control over when events are triggered. At the time of writing this, I am only a couple chapters in, so I guess all that I just said could still be countered; I'm far enough to know that I am really, really enjoying this game, in many of the same ways that I enjoyed the previous entries in the series. The only thing that keeps throwing me off is HAVING to have a blueprint for something, even if I know how to make it myself. I wish they had left that aspect the same as it was in Dead Rising 2. It really becomes a small complaint though, as searching for these blueprints can be entertaining and addictive.  So proceed with caution if you are considering buying this. The game itself is fantastic.. however, a rather alarming number of users encountered issues. I'll post my specs at the bottom, but I am considering myself fortunate that I am able to run this, and run it as well as it is running. If you are willing to take a gamble then you might come away with a winner.  Win 8.1 64-bit AMD A-10 4600M 2.3 Ghz 8GB RAM Radeon HD 7660G + HD 7700M",
            "review_score": "1"
        },
        {
            "review_text": "+ Hundreds of zombies on screen all at the same time + Fun collectibles + Save anywhere you want + Combo vehicles + Good combination of useless (but fun) and useful weapons + Character upgrades + Silly, addicting gameplay  +/- Story isn't bad, but isn't great either +/- Graphically not the best looking game, but the technology behind it makes up for it +/- Still not a big fan of all the timers but I guess it keeps the game going  - No fast travel - Roads are annoyingly confusing - Friendly AI characters sometimes worthless  [Rating: 84/100]",
            "review_score": "1"
        },
        {
            "review_text": "A review of the blood &amp; gore effects in Dead Rising 3         YouTube™ Video:  Gore reviews - Dead Rising 3&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Dead Rising 3 is a blast! As other reviewers have said, there are indeed truckloads of zombies, and there are some pretty exotic ways to mow them like grass. Because I didn't play the earlier games carefully, I faced a bit of a learning curve here, most especially with things like the map and getting a feel for the distinct flow of this game, which rewards you for running all over town. As I have finished chapter 3, I'm already feeling like I want to go back to the beginning and play it better.   There are other elements that are just crazy fun. DR3 has the paper doll thing going maybe wilder even than Saints 3 and 4. And because items don't show up in your warddrobe till you've selected them when you find them -- which then puts them on -- the game rewards you for willy-nilly putting on goofball ensembles. Check my screenshots: welding mask plus sci-fi princess exotic outfit turn you on? White fedora on your swat uniform, and wrong color boots that are too short? How about a sombrero to go with that kung-fu gi and skater jeans? It is a riot.  One meaningful critique is that the control model of this series has always been weird for me. Your hero will swing religiously in the wrong direction till you turn him around, and the controls are different for that -- and feel loosey -- compared to some other FPS's (e.g., Dishornored and DE:HR). Another feel/ambiance critique is that your character, Nick, on the streets is an absolute bada**!!! He is slaughtering like a demi-god -- by end of Day 4 I was at 10,000 zombies killed (!!!), but when you get to the cut scenes, he is so mousy!!!! The scenes would fit better with Mad Max or The Man Without A Name, or someone who could do what this guy does with SUCH power!  This game is an instant favorite. Even though it's got a linear story line, I will play this one more than once. And for all you completionists, getting all the recipes, etc., will keep you exploring! Excellent!",
            "review_score": "1"
        },
        {
            "review_text": "DR3 is the generic Zombie story that you would expect it to be. The infection spread, you are a survivor and of course, immune to this plague. You play Nick, a mechanic genius that can combine pretty much anything together to create the ultimate weapon. The story is nothing new and the quests are repetitive. Most of the time, you will need to go fetch something for someone and that thing is always at the other side of the map. However, getting to the objective is the fun part of the game. This is where you will eradicate thousands of zombies in your way. There is a timer in the game to escape the city in like 6 days, but it's long enough to enjoy the story line, the side quests and maximum carnage. Completing chapters of the story will sometime fast forward the clock to fit with the plot but you will never feel in a rush to move forward until the last chapters. While you play the story, you will receive optional side quests to help survivors and you will be rewarded with experience, companions and/or weapons. With certain skills you will be able to have more than one companion at a time, and you can also equip them with basic weapons. Multiple collectables are scattered across the map that will give you exp and other perks. Also, when Nick levels up, he gains points to distribute in a good range of skills to adapt your playstyle. There is also multiplayer where you can play co-op and some other modes (I personally did not try multiplayer yet)   Now let's talk about zombies. There's a ton of zombies everywhere, and the fact that you can have a thousand zombies on screen is epic. Hacking and slashing through a sea of zombies is the most satisfying feeling you will ever have in a zombie game. The world is open, with almost no loading involved (except for the initial loading, the loading if you die and some story moments (btw, loadings are kinda long)). As you progress in the story, more zombie types emerge that increase the challenge. Of course, Nick knows how to build, and he builds good stuff. THe variety of weapons that can be found is great and the different blueprints available for combos and super-combos weapon is awesome. If you want to destroy a zombie with a flower pot, you can do it, but you can also do it with a motorcycle mixed with a Steamroller. There are a lot of choices at your disposition. No matter what you choose you will feel overpower and you will love it.   I recommend this game to any Deadrising Fans and zombie fans in general. I also recommend to have a very good PC to run it so you get the best experience. There's some fix that can be used to unlock the 30fps cap if you think your computer can handle it. Be aware that some people experience crashes and other problems with the game, so look at the game community for fixes or see if someone with a equivalent rig as yours have any issue.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best zombie open world games you can buy in steam, it have a realy good story,tons of weapons and, clothes to wear,you can drive cars and it takes about 9 hours to complete this good game, better than the other dead rising stories and also the DLC are nice and give you some extra hours to enjoy this beautiful game. it have a realy good graphics and some humor on this game. The co-op is realy fun if you have a friend to play with 88/100, go and buy it",
            "review_score": "1"
        },
        {
            "review_text": "WOO, i'm glad they finally brought this to PC because god damn I'm sick of waiting and there's no bloody way in hell i'm gonna waste 400 dollars on a piece of s*%t Xbone I'll touch one or two times and then probably sell it later on in life anyway. Ok enough whining lets get on with it shall we?  PROS:  A much larger world: This city is pretty damn huge I must say, I still spend constant hours wondering around and looking at all of the shops that they have and even though I've gone through the whole city there are still areas that I haven't even noticed or seen and I was wondering what's in there.  More combo weapons: There's a crapton of combo weapons now, around 100 or so if I remember correctly, that's a lot of combo weapons to make and blueprints to try and find, considering they are scattered throughout the entire god damn map.  More interesting Characters: This kind of goes to most of the group, to be honest I felt a lot more connected to every character that was with Nick or had relations to Nick, cause when I played Dead Rising 2 I honestly didn't give a single almighty f%$k about any of the characters around Chuck or any relations he had with them, to me they were just another character.  Dlck, you're partner(Considering D.I.C.K. is banned on reviews, every 'i' is replaced with a lowercase L): Yup, if you play Co-op you get a partner named Dlck, and he's pretty freaking hilarious, they are both in cutscenes most of the time, except for like Pyschos and stuff, Dlck is mainly there in the main story cutscenes though, so at least he's actually got a part in the story now.  A better story (I suppose, SPOILER WARNING!): This is capcom we are talking about so them making a good story is about as likely as a snowball lasting more than 10 seconds in HeII. OK SPOILER TIME, you know the drill, scroll down or tear out your eyes for a little bit. Apparently Isabela Keyes (That woman from the first Dead Rising game) caused a outbreak in Los Perdidos because she wanted to find Nick to make a cure for the disease altogether, considering Nick is immune to the virus fully, she wanted to find him so she could help cure everyone else who was sick, much better than the rest which is when they do it for money or some BS like that.  The Seven Sin Psychopaths: Apparently, and I didn't realize this till today (the day this was made) each Psychopath is actually a Sin from the Seven Deadly Sins. Even though I f%$king despise Catholics, christians and the like, I have to admit that's pretty damn neat they would include something like that, each Psycho is based off a sin apparently, and after I read up on them I puzzled them together and it made sense, that's a damn good job on that Capcom.  Combo Vehicles: This was interesting, apparently there are vehicles you can combine together to mow down zombies, and it was pretty damn fun to run them all over in a motorcycle with a steamroller wheel attached to the front of it with flames you can shoot out. Although some don't make sense, like the first one you make is a steamroller with a tiny car and you somehow get a armored Van with a gun on the roof with blades on the sides but whatever I suppose.  Still crazy clothing options: Yup, more ridiculous clothing options, some actually look quite nice on Nick or Dlck, but of course there's always those few that look just outright stupid on them, or really femmy clothing, gotta give Capcom credit on their crazy minds I suppose.  No crashes for me: I don't know why everyone is whining about it crashing for gods sake, I haven't had a single problem except for Optimization issues and that's called TURNING DOWN THE GRAPHICS, seriously, I've turned down the shadows and other stuff and it runs fine. As for crashing, I don't have any, because i've played dead rising 2 and OTR and they both crashed a good bit, I haven't had one problem with this. PLUS, they even admitted it was their fault for others crashing, that takes a lot of balls to do something like that, give em a f^%kin break.  CONS:  Optimization issues: Before anyone whines, I don't think graphics are better than story and such, but i'd also like a game to look decent at least, but, I have no clue if this is just me or whatever, but for some reason I can't run this game on high, well I can but most settings I have to turn down, it still looks really nice, just doesn't make sense why I turn down the sky and mirror effects with some shadows I somehow get no lag but the minute I turn on mirror or Sky effects it gets laggy as f%^k, yet I can run Serious Sam 3 on max with no problem, HOW DOES THIS WORK?!  No Free Roam Mode?!: This is a nitpick I suppose but...There isn't a free roam mode without a time limit, NOW BEFORE ANYONE WHINES, I think there is enough time to do a lot of crap in the game, I get that. But I don't like being on a time limit, why couldn't they just put in another mode where you have infinite time AFTER you beat the game's story? Like you beat the storymode with a S rank and you get a free roam mode so you don't have a damn time limit.  Some really stupid Combo Weapons: Some of the combo weapons are just totally useless, like the Pukes o Hazard, or the Pummel Blast, it's kind of like why even bother putting these in here if there is another 50 weapons that can be 3x better than those?  Bosses can be really easy: Apparently Bosses can be the easiest thing to beat in the world if you get a Combo Assault rifle and just shoot him, I mean COME ON, that's no fun, the fun in the other games was trying to figure out the Pyscho's pattern and hit him when you could, now it's just stand back, shoot him a lot, dead, where's the fun? It just seems way too easy now, even bosses that have a crapton of health are easy to take down with it. There is one fight where you get all you're weapons swiped and you have to fend for yourself which was pretty neat, but it was only one time.  Have to do story to unlock side activities: This was stupid, at least to me, you have to do the story to unlock the side missions and Pyscho's instead of, you know, waiting for the timer and then it popping up and then you go do it, most of the time when I beat the game I felt like I was just rushing through the story so I would be able to do the side activities, and in the other games you just had to wait till it hit a certain time and then it would pop up for you to do.  Need blueprints to create Combo's: Well this is ridiculous, you can't just combine things together anymore, now you need the Blueprint to actually make it, no blueprint, means it's not even makeable, so now you can't just mash s%^t together and expect to get something out of it, which kind of sucks considering that's what I used to do in Dead Rising 2 a lot, just seems pointless to me.  WHAT I THINK:  I am glad this came out for PC cause there is no way in heII i'd get it for a piece of junk Xbone, and since I can play it with my friends and have a damn good time just screwing around and killing everyone then it's a great time waster, much better than Dead Rising 2 OTR which would f^&amp;king crash at Uranus zone half the DAMN TIME. Overall, I give it a 7/10, it's really fun don't get me wrong but all the problems and things my friends and myself hate kind of interfere with the game a little, get it when it's a little bit cheaper, maybe about 40 bucks or so.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I'm having a lot of fun with this game, If you have good Computer I will recommend you this game ===== No issues yet, just FPS problems ===== I will give it 8/10  Gameplay 9/10 - It's fun to smash zombies with tons of weapons, but smash them with style? cmon 9/10 It's awesome! Graphic 7/10 - Some places are pretty good looking, but it does not have the best graphics so far Sounds 7/10 - Those sound effects are good, like them Story 8/10 - Even the Lust is was good boss  And here comes the ♥♥♥♥♥♥ part Optimalization 3/10 - This game is not doing so well with fps  Let me explain  AMD FX-8320 Eight-Core = Processor (3.50-4.10GHz) 8GB = RAM AMD Radeon R9 200 Sr. = Graphic C. ==Maxed the game== In fight I had 20 fps - Looking on a lot of zombies had 30 In room had 40 - Looking to the ground had 60  The FPS's are the only thing that I don't like at the Game  So go, buy it!",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is very well made with a good variety of combo weapons and vehicles that you can use to kill zombies.  People who have low-end laptops or PCs (including me) may find that the game will lag a bit (or alot). Your probably going to have to get a decent gaming laptop in order to run this game smoothly without lag.  Generally don't buy it at full price, wait for it to be on sale if your considering trying this game out.",
            "review_score": "1"
        },
        {
            "review_text": "After blitzing through the game in only 19 hours i can say that this is a good evolution of the dead rising series.  -if you wanted more dead rising 1 then you may be a tiny bit turned away since it evolves alot of the mechanics of dead rising 2 however does give several nods i feel towards the original especially if you know all the bosses.  -vehichle combos are sorta meh considering i only was able to seriously get into them near the end, however weapon combos are pretty fun even sorta minmaxing as i was, while still leaving uses for individual non-combo weapons (fire extinguishers are cruical to horde fights alone i feel) blueprints are found everywhere and by the end of the game i nearly had them all first run  -story was the usual dead rising, with a reason to shoot that ♥♥♥♥ing scientist at the very end, so dont expect something that takes itself incredible seriously but it was overall seamless with the previous stories and let the story sorta end-ish(?)  -while the standard mode isnt balls-to-the-wall challanging that most people may be looking for i'd recommend going nightmare, fixes every complaint with it being too casual and truthfully my playthrough on casual was quite useful to find/figure out most of the game so i could go back and play and nightmare.  -zhi did nothing wrong.  - maybe i was lucky or something but i managed an S rank ending on my first ~19 hour run saving almost every survivor, ♥♥♥♥ that racing guy i think his name was gary or something...  = OVER ALL would recommend w/ bundle perhaps when the price drops a bit as it is something like 80? but considering the DLC, DR2 w/DLC and DR1 i would totally recommend both this game and this bundle to ♥♥♥♥ around with, freinds only make the adventure twice as good considering two medival burger knights with laser swords just make everything...awesome...  ",
            "review_score": "1"
        },
        {
            "review_text": "best game ever. 8/8 would r8 again m8. P.S. Eric 2014-2014, you will stay in our heart",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why people are complaining about crashes, my game doesn't crash at all.....otherwise, it is an enjoyable game to play, especially the co-op.",
            "review_score": "1"
        },
        {
            "review_text": "When this game was released it had a really rough times with multiple issues. These issues have been resolved and is a great game to play even though its not as challenging as the older titles.",
            "review_score": "1"
        },
        {
            "review_text": "Bad release , someone even cant start the game , someone cant set the proper resolution , someone have fps drops . But this is still a good game with good graphics , awesome customization , tons of zombies , funny characters , hillarious moments , many weapons , simple crafting system , vehicles , blood and dismemberment , freeplay and again ZOMBIES  my rating to this game 8 | 10  my rating to realease 4 | 10",
            "review_score": "1"
        },
        {
            "review_text": "This game is so under-rated, it works perfectly fine by me. Plus, this is a AAA game, larger thant Dead Rising 1 and 2 Fisrt I was upset about the players review, but now I wonder if they reviewed the right game...  Your PC need to meet the min requirement, but after that, it's only pleasure !",
            "review_score": "1"
        },
        {
            "review_text": "First of all I should address the performance problems, the game is not optimized very well, and is unplayable for many people right now.  I was able to play it (and enjoy it) with an acceptable frame rate (for me at least), uncapped from 30 and with texture resolution set to 720p (which doesn't look as bad as you might think).  I was averaging ~40fps in most parts of the map, up to 60 in others with dips down to ~20 in cutscenes and 1 particular part of the map (it's actually the geometry in that part of the map that is causing problems, not the amount of zombies on it, the xbox version had frame drops in that part of the city as well, again bad programing at it's finest).  I should add that none of the graphical settings, except the texture resolution (the offered resolutions are 720p/900p/1080p/full), made any difference, which cries bad PC port.  For reference, here are my PC specs:  i7 920 @3Ghz nvidia gtx660ti 8gb ram win7 64bit  (the game was using all 8 cores of my i7, and often @100%, so if you have a higher clocked i5, doesn't necessarily mean you'll get better performance).  Finally after that brief warning, the game review!  The game itself is just pure, unadulterated zombie obliterating fun fest, it is one of the best games I have played this year, and I'm not talking games that came out in 2014, but period.  This game is far apart from any other zombie game out there, including the previous Dead Rising games, which always had you worried about a bunch of timers and zombrex you needed every now and then to prevent a game over screen. Instead, in DR3 you have a long 7 day timer that never makes you feel pressured (I'm pretty sure 1 in-game day is at least 4 hours long), and you can finish up every side quest and still have enough time to get a bunch of collectables and kill tens of thousands of zombies in each chapter.  The main story is pretty much what you'd think... get your friends, escape the city, profit. But even though the story is nothing to talk about, the voice acting is top-notch, the cutscenes are solid (except the constant dips in frame rate) and all the characters are really likeable, especially the main character, Nick.  What really separates this game from the saturated zombie genre is the gameplay. The game has hundreds, if not thousands of zombies on the screen at once, and you get to kill them all with a huge variety of weapons and vehicles you create by finding blueprints scattered around the city. My personal favorites are the electroice staff, which can electrocute or freeze a ton of zombies in a single shot, and the rollerhawg vehicle, which is a fire spitting mix of a steam roller and a Harley, driving that thing through hordes of zombies feels like walking through freshly fallen snow or popping bubble wrap.  I should mention the co-op mode, where the other player assumes the role of Nick's friend ♥♥♥♥ (since steam censored his name in my review, let's just call him Richard). I didn't bother trying out the co-op, though (with the exception of doing it for that hilariously named achievement for the Playfire reward :P), but I would imagine it's crazy fun if you have a good friend to play it with.  Finally, it's worth noting that the game is incredibly easy, and you can finish it without dying even once on the default difficulty, so maybe go the nightmare mode way if you want a challenge.  My final score for the game itself, disregarding the optimization issues - 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a diffucult game to reconmend at the moment  I started of with the random crashes every 5-15 mins rolling back to a earlier driver did sort this issue out for me but i took a hit on performance  im running   i5 4670k 16gb ram gtx 770 msi z87g45 gamin mobo  with latest nvidia drivers i get a aavarge of 55fps with random crashes every 5-15 mins but with a earlier version i get 34-40fps but the game doesnt crash  i really dor ecomend this game the game is sssssoooooooooo much fun comi wepons and cars and the shear amount of zombies around you, the story is pritty standard but the chartors make u care about them and the phyco;s bosses in the game are crazy, weird and sooo over the top like a really fat woman in a motor scooter, i was laughing and discusted at the same time!  the visuals do look alot better over xbox one on my samsung 55 inch full hd tv and ive enjoyed the game on xbox and pc and the pc version is defently better,  if you aproach this game as a xbox port of a really good game i dont think u will be disapointed",
            "review_score": "1"
        },
        {
            "review_text": "Got to ride a half steam roller half harley, WITH FLAMETHOWERS. 11/10 WOULD deff flambe on the move again.",
            "review_score": "1"
        },
        {
            "review_text": "it is rly fun even do i have bad lag",
            "review_score": "1"
        },
        {
            "review_text": "Got to ride a half steam roller half harley, WITH FLAMETHOWERS. 11/10 WOULD deff flambe on the move again.",
            "review_score": "1"
        },
        {
            "review_text": "Well i guess im one of the luckier people who got to enjoy this great game right out of the starting gate,given that im using a geoforce gtx560 i wasnt sure how it was gonna run as its apparently below the minimum specs but to my suprise it runs really well actually with the view distance shoved quite far up and alot of the settings on high (Except things like mirrors and shadows which usually cripple games without supercomputers running them). So yea im loving it especially the sheer amount of zombies on screen as it really gives it that APPOCALYPSE feel to it and its what i hoped state of decay was gonna be like when i bought that. So dont listen to the nay sayers because if you can run it then you are in for one hell of a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game was great when I first got in on Xbox one, it seems even better now with uncapped fps and with a friend this game is extremely fun.",
            "review_score": "1"
        },
        {
            "review_text": "Steam deleted&nbsp; this game From My Library !! And I liked it a lot and it does not fer I paid for this game !!",
            "review_score": "1"
        },
        {
            "review_text": "great with co-op game! Endless ways to kill zombies! ",
            "review_score": "1"
        },
        {
            "review_text": "good game if you have a strong enough PC xD",
            "review_score": "1"
        },
        {
            "review_text": "So this is a great dead rising sequal lots of people say its really bad and crashes alot on the pc but it runs fine for me the only thing that is stupid is theres a 30 fps cap that you have to turn off",
            "review_score": "1"
        },
        {
            "review_text": "An underrated open-world zombie murder-fest hindered by a shoddy PC port.  This is basically Dead Rising 2, most if not all of the weapons are available and some costumes make a return. Overall if you like Dead Rising then this is worth looking in to. A few things have changed, but some have stayed the same. Pretty much a 'If it isn't broken don't fix it' kinda thing.  The biggest difference is the crafting, you can craft anywhere instead of running to a maintenance area. This I prefer over Dead Rising 2, it keeps everything moving forward instead of carrying 2/3 items you want to craft together. You can also save wherever too.  Another difference is when you get grabbed by a zombie, you only need to press 1 button instead of borderline breaking your analog stick by shaking it. (This is still present in boss fights.)  They also added vehicles, they're not that great. You might as well run through zombies, cars and trucks just grind to a halt if you drive through a group, and there are way more zombies than Dead Rising 2. I killed around 19,000 in 1 playthrough.  The companions are meatshields, they don't really attack when given a weapon, they take forever to get in the car, the pathfinding is average and the only way to dismiss them is to get in a car and drive away from them. They're totally pointless and become a huge burden/borderline escort mission towards the end.  The biggest negative are the psychopath boss fights. Basically every fight is in a pseudo-arena. You're pretty much caged into every fight, doors are locked, gates are shut etc. You're stuck in that fight until you win. All of these bosses are not fun to fight, they're annoying and tedious, they feel completely out of place from the rest of the game. The bosses seem to serve no purpose at all other than being the 7 deadly sins.  The PC quality is pretty average, there are a lot of options but the game chugs in places, the LOD is ridiculously low and there are tonnes of texture AND model pop-ins. Tho Dead Rising 2 wasn't too great of a port either.  Overall the majority of the game is great, I went into this thinking it was going to be a complete mess and that I could poke fun at it. It's a shame that the bosses are super mundane and that the port quality is pretty bad, but there's a lot of fun to be had if you can look past the flaws.",
            "review_score": "1"
        },
        {
            "review_text": "First of all sub to my channel Xain35 for my full review.This is just a quicky,so...yeah...that typed out wrong.  Anywho,lets go over cons first,  Poor optimizition  Mazelike city  now the pros,  Pretty much everything.   vistit and sub my channel for a more in depth and detailed review.",
            "review_score": "1"
        },
        {
            "review_text": "I have had not one crash in 7 hours and have the game settings set to max, also had no issues with FPS, the min settings for this game are quite high, that coupled with the need for directX 11, I,m guessing problems are with peoples drivers and hardware.  Saying this as experiences cant be that polar as some are stating, its either working like a dream or its not working at all.  I have spent 5 hours in single player, and thus far having a blast, even enjoyed the cut scences which I normaly find tedious.  COOP I will add to the review after finishing single player mode.",
            "review_score": "1"
        },
        {
            "review_text": "Like the game but with the crashing it can ♥♥♥♥ you off.And they release the port to PC on a Friday so we can do all there testing over the weekend for them.",
            "review_score": "1"
        },
        {
            "review_text": "although its fps is all over the place it never dips below 40 in my 660 ti, and i have not crashed once, i am enjoying this game to the fullest and if you played the other dead rising games then i do recommend this, but dont expect to break 60 fps unless you have a STUPIDLY OVERCLOCKED,SLI'D rig",
            "review_score": "1"
        },
        {
            "review_text": "Best PC port there is. Read PC requirements before buying. Don't recommend with Windows 8.",
            "review_score": "1"
        },
        {
            "review_text": "Great game so far! had to change up the visuals, running 1280x720 with 1080p Game Quality and everything else maxed out but the Shadows set to Medium. Seems to run smooth and looks great. Using a GTX 760 4gb, 16gb of RAM, and a AMD 8350.",
            "review_score": "1"
        },
        {
            "review_text": "i already beat the game on xbox one loved it, but i wanted it for pc too ive only crashed once so i dont know why every one is crying",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, i was waiting so long for this sequel. First start of the game was little bit messy but after 30 mins i solved the problem, if its crashhing in launching progres you need to downgrade GeForce driver. I had smooth experience like 60-70 fps on GTX 660, Intel Core i5 3.3 ghz and 8gb ram.  The graphics are nice made, story line is nicely done, and coop its amazing its strong part of the game, you will have really big fun when you are playing with friends :).  I would recomend you this game :) im Giving it 8/10. :)",
            "review_score": "1"
        },
        {
            "review_text": "Runs fine on my rig. As an avid Dead Rising fan I love this game even with it's streamlined approach to the Dead Rising formula. I probably poured about 200 hours into Dead Rising 1 on the 360 and many more on Dead Rising 2 on the console as well. I wasn't about to get an Xbone to play Dead Rising 3 (even though I almost broke down and got one) so i was estactic to find out that Dead Rising 3 was coming out on PC. I really don't like that the game is capped at 30fps but at least it is a smooth 30 fps (no drops on my rig) unlike the Xbone. I take what I can get and I am glad I can play the game. I plan on doing a run through without any combo weapons on Nightmare mode after I beat the game on Normal difficulty to bring back the Dead Rising 1 experience as much as I can. The fun part about these kind of games is that you have a wide range of gameplay styles. All firearms? Survivors that can follow you arround? Only melee? no combo weapons? It's reallly up to you how you want to play. The combo weapons turn you into a zombie killing god and makes the game somewhat easy at times. I've been really enjoying the game and I plan on putting a lot more time into it. Hopefully one day they can patch it to the point where we can play it at 60 fps without a ridiculous setup. I wouldn't hold my breath, but like I said before. I am an avid fan and I am taking whatever I can get for a PC port so my opinion maybe bias. Not the worst PC port. But surely not the best.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Great Game its Gory, Beautiful, Stunning, Stupid, Funny and just simply AWSOME !!!!!!! ITS WORTH THE MONEY",
            "review_score": "1"
        },
        {
            "review_text": "fix to problem with nvidea optimus please dont wanna connect my laptop all the time on my tv just for playing dr3 thx :)",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever made,Enjoying it so much there's just too much things to do and can't wait for the mods and dlcs thatwill come really worth every $ buy it guys you'll never reget =)",
            "review_score": "1"
        },
        {
            "review_text": "Wait for the updates to buy. Game is great but crashing every 5 seconds isn't fun. Fix for nVidia is DOWNGRADING your drivers, so just wait for them to update....Otherwise awesome zombie slasher",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, the first look was... 'omg, looks like a movie, with scare situations and a well made history'. This third game of the saga is pretty different to its parents, its another game, with no more light and easy situations, this is the first time i see a Dead Rising with lots of realistic details, with tension in every corner, with a detailed world to discover and physics like a charm.  Simply i loved this game, is the best survival horror game in the scene, congratulations to CAPCOM for this title.",
            "review_score": "1"
        },
        {
            "review_text": "It has a lot more to offer than the previous games. Like something that feels MORE like SANDBOX. There is some problems with the PC port - one of the major ones being the framerate limit set at 30. I would expect more from a game considering THIS IS 2014. So if you are okay with fun that has some bugs being major and minor; i would recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Most of the reviews are thumbs down because of unplayablity, which is a giant problem right now. I'm one of the few people that can run this game without a problem. That said, I've already beat the game with the perfect ending on my first try and I didn't struggle at all with the time or any of the bosses, which was very off-putting. I didn't like Nick's story or Los Perdidos, for that matter. Some bosses have multiple HP bars, but even at the lowest lvl they can just be dodge rolled and shot up with ease. Guns are in giant abundance and they are very powerful, so the game is less focused on melee.   The city is a clunky, barricaded mess and there's really not much exploring to do given how big the map is. All in all, less really is more and the further I went through the game the more I found myself wishing that it was more like DR1 and DR2. The game has now evolved to the point where it's never going to return to what it was that made it so good. If you're a fan of the series, I recommend giving it a shot whenever it's patched and easier to play without all the problems.",
            "review_score": "1"
        },
        {
            "review_text": "Dead Rising is back and this instalment will not disapoint fans of the series all the crazy weapons and even more Z's the the first two games. I have not experienced any of the reported bugs appart from crashing when quiting the game. If your a fan grab the game and play with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "Went to the strip club picked up a ♥♥♥♥♥ and a leaf blower put it togther with duct tape and waaahlaa a gun that shoots ♥♥♥♥♥♥ at high speed........ hours of fun :)",
            "review_score": "1"
        },
        {
            "review_text": "the game runs great on my ati 290, never crashed, and didnt noticed any bugs yet, so im pretty happy with it!. awesome game lot of stuff to do and zombies everywhere",
            "review_score": "1"
        },
        {
            "review_text": "i can't play it always stopped working",
            "review_score": "1"
        },
        {
            "review_text": "As confused as I am how many bugs get through on ports, heres the pros and cons of ~hour of play.   Pros: -It's fun as heck -Great zombie game feel -TON of quality of life improvements from the first one, faster weapon pick up, no maitenance closets, you can eat food while moving and more -will play more after a patch -controls are pretty similar  Cons: -its a console port -fps in cutscenes -fps in game is weird, times I'll run fine, other times it's awful, most the time when i do a 180 turn it tanks pretty hard -quiting to windows requires to ctrl alt delete to close it completely  Additonal notes, I haven't found any bugs yet, but like I said, 1 hour of gameplay because of FPS issues.   In it's current state I wouldn't recommend it, but after a QoL patch I think the game will be excellent, everyone should let Capcom/DeadRising know of the existing fps problems and hopefully we'll see a new patch in a day or two.",
            "review_score": "1"
        },
        {
            "review_text": "well to be honest graphically is nice, it is a bit jerky in parts as I only have a gtx560 card, but on the whole it is worth while purchase if you are into zombie games...(who needs an xbox one)...though you will need a quad core chip to...only played for about 20mins but it is a good laugh in a sic sense, plenty of blood...",
            "review_score": "1"
        },
        {
            "review_text": "so far the game is great, I mean; like everyone else I also only got about 30 minutes into the game before it randomly crashed, but besides that the game ran good, haven't ran into any other issues besides the 30fps cutscenes; however the game itself ran at around 60fps on max visuals for me which was pretty smooth in my opinion, controls are just like the other deadrising games; if using an xbox 360 wired controller.  I do recommend it because I'm sure a fix will come for the random crashing but it's up to you if you want to purchase this game, honestly; I don't know what the other problems are such as getting stuck at the title screen, this hasn't happened to me but all I can say about that is to try redownloading the game   My Specs: GPU: GeForce GTX 770 CPU: intel core i7-3770k 3.50GHz RAM: 16GB OS: Windows 8.1",
            "review_score": "1"
        },
        {
            "review_text": "crashes on loading screen. Task manager says DR3 not responding.  windows 8.1 64-bit (6.3, build 9600)  ASUSek COMPUTER INC.  system model: Q550LF  bios: Q550LF.212  Processor: Intel(R) CORE(TM) i7-4500U CPU @ 1.80GHz (4 CPUs), ~2.4GHz  memory: 8192MB RAM  DirectX Version: DirectX 11",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game for the PC: My specs. Asus Maximus V Gaming board. Core i7 GTX 780ti. THE GAME KEEPS CRASHING!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Shame about the terrible state of the game at launch, but I just shoryukened a kung fu lunatic in the face with my rocket gloves so...fair is fair i guess?  ",
            "review_score": "1"
        },
        {
            "review_text": "Only played a few hours but so far it's so amusing I actually don't want to play the story but just slaughter zombies, create funny weapons, vehicles and just generally see what mischief I can get up to!  Provided you're not a media controlled zombie yourself, I.e you don't fall for their 'You must like this style, graphics, and nothing else matters' then you'll have a blast.   One of the few games I'm actually not bothered that I paid full price for it, worth it you hobos!",
            "review_score": "1"
        },
        {
            "review_text": "The game is beautiful! The controls are pretty good except some of the RC combo weapons are wonky or more of a lakc of instruction how to drive them. As for all these people complaining about performance... I have to disagree ive got 16 gigs ram and a 780 GTX nvidia card with physx running on a 660GTX wich i believe this game is not even utilizing. No crashes yet.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure what everyone is talking about. No lag on my end nor any crashes. The load time is a bit longer than other games, but its roughly 15 seconds or so. My comp is roughly 2 years old or so and it runs perfectly fine.  Things to note however: -Gtx680 sc signature",
            "review_score": "1"
        },
        {
            "review_text": "As it stands right now... I have not been able to play this game for one minute. It keeps crashing. I'm sure the actual game itself is fun, but as long as I am not getting my money's worth out of this, I am really ♥♥♥♥♥♥... Please fix the crashes and optimization issues! I loved the other Dead Rising games and I am sure I will like this one too!  [UPDATE] Nvidia released a new driver for laptops, enabling me to play the game without hardly any problem! The game is a lot of fun, although the story/gameplay can get a little repetitive. Overall, when the game can actually run well, it is fun and totally worth the money. Inform yourself to see whether or not the game may run on your computer/laptop, if it does and you are a fan of just senseless hacking and slashing through hordes of zombies, whilst trying to fulfil your objective and trying to find all of the different weapon combinations, then this could be the game for you! After almost a month of not being able to play the game correctly, I am finally a (mostly) satisfied customer.",
            "review_score": "1"
        },
        {
            "review_text": "First off lt me say that it is a fantastic game despite the issues that other people may have had. It's exactly what you would expect from a dead rising game, killing zombies, creating weapons, good (funny) story, and the like. I have spent quite a lot of time on it already and have enjoyed it a ton. The only problems that I had with the game were framerates (easily fixed by doing a file edit), and SOME crashing, I have played it over 20 hours now and have experinced at least 3 or 4 crashes, and it defintly needs to be optimized more for the pc, but other than making sure that I saved often there was little in the way of me killing as many zombies that I possibly can. If your system can run it, I would recommend this game! (My pc is i5 processer 8GB ram x2 660 SLI anything equal or greater than should run this game fine in high framerates (excluding when TONS of zombies are on display)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mixed bag really, there's bits that work, bits that dont work so much. if you are a fan of the earlier games, this is prestty much the same deal gameplay wise, with the addition of vehicles that you can drive around and combine to make mad-max stle death machines. DR games have always been about zombie slaughter on a big scale and this one is no different in that respect, Kill zombies, get points, rank up to get get better ways to kill more zombies. there is a skill tree of sorts now, where you can spend point to customise your skills, though i am undecided if this improves the game or simply just isnt necesary. What the series is good at this game is also good at. In the normal mode, the story missions don't have the timer they had in previous games, and the survivors that you come across dont need to be escorted back to a safe house as before, so the tension that these two game devices brought to the earlier titles is missing, although i havent tried the nightmare mode yet.  In terms of performance, a lot of people have complained. But i think it depends on your standards. If you are expecting 60 fps minimum at max settings, you are not going to get that on anything. But i have a 5 year old pc and have tweaked the settings so the game is perfecly playable with hardly any dropped frames and at a higher detail level than the xbone. If thats not good enough for you, you might be disapointed.   I would recommend this game for fans of the earlier games, probably not to anyone else.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, now that this game is working and not randomly crashing,(tyvm Nvidia et al Steam team), it is so awesome.   The graphics are beautiful, plenty of humor in the sick &amp; twisted dark sense, and of course there is the ever present threat of impending death at the hands of the ravenous undead.   Which by the way respawn behind you or anywhere you aren't looking for any particular varying length of time, yes you just killed that zombie btw.   But seriously, did you really think it was safe to turn and look at that random thing on the ground without your back to a wall?   What isn't to love?   Oh and by the way, use the expansion characters to level grind, restart their stories, make those uber weapons and increase your inventory slots to the max because you will surely need every last one of them, and don't do speed runs for the sake of being a youtube prima-donna, because no one cares.   Explore every last place to explore, find every item that is findable and climb, jump and skip your merry heart out while raining down corporeal justice on the undead mofo's who dare come for your succulent juicey brains!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game amazing graphics and anyone whos played dead rising 2 will remember the wacky and fun weapons you can make. wold reccamend you get this you will love it",
            "review_score": "1"
        },
        {
            "review_text": "Flippin' hilarious game with friends",
            "review_score": "1"
        },
        {
            "review_text": "its quite fun, gore tones of gore..... lots of it haha",
            "review_score": "1"
        },
        {
            "review_text": "After a couple of patches, I feel it's pretty playable now. Granted, It's still poorly optimized, but they seem to frequently improve it. Compared to Watch_Dogs, this is a lot better. That game won't even run on my PC.  Anyway! This game is a ♥♥♥♥ ton of fun.  Fun characters, much better bossfights than previous games, better crafting system with even more possibilities. To summarize, this is what you call a sequel.  I love how Nick constantly talks to himself. It's pretty similar to Nathan Drake, except it's more dynamic and frequent. He's nervous doofus who acts completely complaisant to anyone he comes across, and I love it. Nick's pretty likable, honestly. So are some of the characters you meet (except for the ♥♥♥♥, named ♥♥♥♥). The cutscenes are really weirdly directed, but they're entertaining and sometimes hilarious.  Remember how quick you had to be in DR2? Well that's pretty much gone in this. Sure, there are still timelimits and you have to complete the game in about 6 days (which is actually a lot of time). But I feel like I've been able to run around looking for stupid stuff to do and mess around much more than in DR2. You don't need any Zombrex, you don't need to bring back idiotic survivors to a safe house or anything that probably ♥♥♥♥♥♥ you off before.  The game feels much more current gen than the last games, which felt like they belonged on the PS2 or something like that. Better animations and voice acting. More zombies and no more loading between sections. Awesome gore effects that don't look glitched. The list goes on.  The only complaints I have are that there's no Sandbox Mode. Some things that used to be in Sandbox Mode are pretty much built into the Story Mode. I wish they'd split it up like in Off the Record, but hey, it's not impossible to fool around while ignoring the objectives. Also, navigating through the city can be a ♥♥♥♥♥ when playing a fetch quest. You can't see the names of stores on the map like in DR2, which is really annoying when you're looking for something specific.  So, yeah, awesome game. Probably the best in the series. While it was terrible at launch, I feel like it's improved quite a bit since, and I'm certain they won't stop for a while (hopefully). So lesson learned for the millionth time: Don't pre-purchase games or buy them at launch. It's never a good idea.",
            "review_score": "1"
        },
        {
            "review_text": "dead rising stopped working should be the title as peolpe will read its not just me. wish i had waited i usaully do now capcom needs to stand to be counted right this wrong...last few days all is well no problems at all yeah ive left 30fps on and its still a fun game for me. i would now rate it 7/10 it would be more for the cap and the early probs i just dont think it deserves it.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game but the only thing is like alot of other people it keeps kicking me out of the game i would love this game even more if they fxed it. I know they are working on it but they better hurry up beacuse this game is amazing and i dont want to wait for it hopful the next update will fix it. If not then the next one will fix it for sure.",
            "review_score": "1"
        },
        {
            "review_text": "needs to be updated it does not start it just shows dr3 title screen needs to be fixed asap",
            "review_score": "1"
        },
        {
            "review_text": "needs to be updated it does not start it just shows dr3 title screen needs to be fixed asap",
            "review_score": "1"
        },
        {
            "review_text": "Great fun when it stops crashing. Nor Nvidia users I'd recommend rolling back to 335.23 drivers as that fixed my constant crashing. Performance leaves a bit to be desired but if you have the rig to run it this game is insanely addicting and great fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun",
            "review_score": "1"
        },
        {
            "review_text": "dissapointed yesterday because it didn't work, but earlier today they released a patch to make the game run, been playing it for a while, and it is actually pretty great after you mess around with the settings, the untold stories are a plus also, i would recommend unlocking the fps though, and running in 1080p",
            "review_score": "1"
        },
        {
            "review_text": "Had no problems on my computer runs great love it good game buy it if you can",
            "review_score": "1"
        },
        {
            "review_text": "Would i recommend this game? Yes.  Due to the lack of positive reviews this game has received, i've decided to throw my opinion out into the mix.  This game is great, while it may not be optimized for most systems, it works flawlessly on mine with only one complaint, the mouse acceleration, even with my mouse sensitivity set as low as possible, it's still faster than i'm used too, but it's manageable. I've had no crashes that seem to flood the forum, so i can only assume I'm either lucky, or the people complaining are running it on a dated system.  I don't see the reasoning for complaints regarding the 30 fps cap, the game is playable, it doesn't affect the gameplay in the slightest (for me), thus it's not a problem, It would be nice if the game could run uncapped, but again, it's not a problem, gameplay over graphics, right? So yes, if you know your system can run this game without a hitch, i would say buy it, otherwise, wait for the sale.    My computer specs are as follows to give a bit of a 'benchmark' to base your opinion off.  Processor: Intel(R) Core(TM) i5-4670K CPU @ 3.40GHz Video Card: NVIDIA GeForce GTX 760 Memory: 8.1 GB Operating System: Microsoft Windows 7 Professional Edition Service Pack 1 (build 7601), 64-bit ",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutley great. I've been a Dead Rising fan since the first game and it has come a long way. The only shame is that it is poorly optimized. If you want to get stable 60fps I recommend playing on 720p (I have a GTX 670) The kills in this game are very rewarding, physcopaths are well...physco. The story is great and I can't wait to play the DLC (i'm about to beat the main story) I hope they can optimize the game better and help other people that are crashing. Downgrading to the 335.23 driver stopped all crashing for me. 10/10 should buy it, but maybe in a week or so (patches may fix crashing).",
            "review_score": "1"
        },
        {
            "review_text": "Dead Rising 3 features plenty of action, and it allows for a great deal of customization. You'll find a ton of items simply laying around, and you can pick up all of them. As you level up your character by chaining zombie kills, you'll gain new crafting abilities and perks. Building weapons in segments as you collect more pieces makes Dead Rising feel almost like an action-oriented role-playing game .  and DR3 also features a remarkable number of vehicles as well as different ways to customize them to make them your own, giving you that extra touch of pride as you run down every zombie that crosses your path. This is hardly just mindless fun; zombies come in many classes, some more powerful than others. If your custom vehicle isn't strong enough to deal with the types you're up again, you won't be able to simply plow through an area.  As you level up, it becomes easier to deal with but for those that prefer a meatier challenge, DR3 offers Nightmare Mode, which brings the experience more in line with Dead Rising 2. You can't save at any point you like in Nightmare Mode, and the zombies become much harder to deal with.    Negative Ratings  The graphics don't provide as much of a next-generation Youd hoped for, but the atmosphere and huge number of zombies more than make up for it + The Nightmare Mode,,  And Thx to the Missing files For some ppl the game Crash Regularly if they dont Downlod them or Try to Re Download the game and see if they get them Next atempt,,",
            "review_score": "1"
        },
        {
            "review_text": "loads of people having problems with this game but it is really good! found some good advice on forums and had to use old nvida drivers (was using 340.52, now using 335.23) and it has not crashed once! much better than dead rising 1 and 2 so far! I have played DR3 on xbox 1 and it looks and feels much better on pc! good luck!!",
            "review_score": "1"
        },
        {
            "review_text": "For the people that complain that they cant run it, i have a bad computer and i can run it, so maybe they patched it go ahead and try it. Very fun game",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, great graphics, alot of fun and short loading times!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun as long as you have a controller and you change the pov, i had crashes, but that was because i didnt have a strong gpu, once i upgraded the game ran just fine i have no complaints",
            "review_score": "1"
        },
        {
            "review_text": "After playing DR3 on release on console I decided to take advantage of the Steam Summer Sale pricing and try it out on PC. I understand that many have had problems with the porting and the frame rate of this particular game, but I for one am not completely sure why I have not run into any of these problems. I have never run into any issues with this game let alone minor problems.  That being said I would reccomend this game as I believe its a fun-arcade open world game that invites the player to explore aswell as decimate zombies in huge numbers. In comparison to DR1 and DR2 the psycho fights are easier, the weapons are more vast. A lot of people including me have an issue with the bomb timer within the Dead Rising series, however in DR3 its not really an issue as you can select a play style before starting a new game, declaring if you wanna speed through or explore every bit of detail the game has to offer. Its a real shame that so many have had trouble with the porting and fram rate as it really is an enjoyable title in my opinion.  Looking forward to Dead Rising 4!",
            "review_score": "1"
        },
        {
            "review_text": "Works for me. heh",
            "review_score": "1"
        },
        {
            "review_text": "I come from strong Dead Island background with over 1000 hours combined across console and pc versions. But I must say I was dubious about buying this game for one reason, I personally don’t like games that have a time limit for completion. I like to roam around at leisure picking up all collectibles and finishing all side missions. But I really love zombie games so I thought I’d give it a try. Imagine how pleased I was to discover that after completing the game I could start again from the beginning with my level, costumes, blueprints and collectibles intact. Meaning I can replay the game picking up all the things I’d missed the first time round without having to grind back up to level 50. So with 70+ hours under my belt and not a single crash I am very happy and would recommend this game anyone who likes kicking zombie ♥♥♥♥.  ",
            "review_score": "1"
        },
        {
            "review_text": "I come from strong Dead Island background with over 1000 hours combined across console and pc versions. But I must say I was dubious about buying this game for one reason, I personally don’t like games that have a time limit for completion. I like to roam around at leisure picking up all collectibles and finishing all side missions. But I really love zombie games so I thought I’d give it a try. Imagine how pleased I was to discover that after completing the game I could start again from the beginning with my level, costumes, blueprints and collectibles intact. Meaning I can replay the game picking up all the things I’d missed the first time round without having to grind back up to level 50. So with 70+ hours under my belt and not a single crash I am very happy and would recommend this game anyone who likes kicking zombie ♥♥♥♥.  ",
            "review_score": "1"
        },
        {
            "review_text": "Finally they fixed this.",
            "review_score": "1"
        },
        {
            "review_text": "All issues seem to be resolved with the new Nvidia 344.11 drivers. This game is loads of fun, go get it.",
            "review_score": "1"
        },
        {
            "review_text": "Funnest game ive played this year.",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth the full price. A must have for any fan or zombies and/or fun sandboxes like Saints Row. You''ll ahve to unlock 60fps through a quick change on the game files (check online tutrial for that, its super easy) 9/10- One of the sequences of the last mission was kinda lame.",
            "review_score": "1"
        },
        {
            "review_text": "This is the co-op title Ive been waiting for!  I dont think Ive played any of this series before, or if I had it was console and more than 5 years ago. In other words, Im fresh meat here.  The game is basically the happy middle ground of the zany 'Saints Row' meets the serious 'Dying Light'.  Im only a bit into the game as of writing this, the story has been done to death, but it just doesnt matter! The game is simply fun to play. It is a console port, and I would recommend having a controller.   Just 2 things so far on the negative side. 1) The game is capped at 30FPS!! You can easily unlock this tho, by creating an ini file with the following line 'gmpcr_unlock_frame_rate=True' (not including the quotes) saved to the games base directory. Its believed this may cause crashing, but a few hours of play and nothing bad for me so far. And 2) No friends-only setting. In order to play with a friend, you start your game which is open and then invite a friend via Steam.  On a related positive note, if you are solo and want to play with randoms, the game does offer different play style options, so you hopefully get paired up with others wanting the same out of the game. So casual, hardcore, achievement hunting, etc. Which is nice.",
            "review_score": "1"
        },
        {
            "review_text": "FUN sanboxish zombie slaying game. Laughed so many times must buy :&gt;",
            "review_score": "1"
        },
        {
            "review_text": "I think this is best game ever. Thank you CAPCOM. This game is realy awesome. Have good story, great co-op + 4 DLC missions. I think this game is best port, what I see. No freeze, no lags, no glitchhes. I recomend this game all people who love zombies and blood, becouse BLOOD and ZOMBIES in this game is realy MANY. 10\\10 CAPCOM, you best",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, Actually i love all the Dead Rising Series especially the Original Dead Rising and Dead Rising 2 which are in Malls but Dead Rising 3 is in the city Good Game I recommend it :)",
            "review_score": "1"
        },
        {
            "review_text": "Not sure why everyone else is having issues with this game, it works fine for me. I have yet to experience any issues at all with this game, not even minor frame rate issues or anything of that nature. I was worried from the reviews that I would have a terrible time so I held off buying it, but I am so happy with my purchase.  I have an AMD FX 8350 4.00 GHz CPU,  16.0 GB of RAM,  an Nvidia GTX 770,  and I am running 64 bit windows.   Hopefully everyone is able to enjoy the game, but one important thing to understand as I see a lot of negative reviews with system specs below the recommended and barely at the minimum requirements, you do need a good PC to run this.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!  The graphics are nice and crisp with alot going on screen at once(smooth 60fps with cap removal).  Story is over the top and absurd(the way I like it). Gameplay is great! Nowhere else can you get the completly insane of the wall comedy riddled gameplay that the Dead Rising series Provides.  This game gets a lot of hate for being a 'Bad Port'. Its imortant to note that this wont be the case for everyone. If you are sporting a powerful gaming rig you should have a great experiance with this title. Removing the fps cap is easy as downloading(or creating your own) and droping a file in the games folder. I am able to maintain a solid 60fps running at 4k and have not run into any bugs that others have stated they have.  Best in series 9.5/10 (personal opinion)",
            "review_score": "1"
        },
        {
            "review_text": "Good Very Good game and with update will become even more Good   انصح الجميع بأقتنائها لعبة ممتعه ومضحكة مع انها زومبي البطل وكلامه ان خاف شيء رائع هههههههههه",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome , had it 2 days and have become totaly addicted to it , i read alot of bad comments about it freezeing ect. but not for me works really well and the graphics are amazeing,i am running it one a i7 Acer Predator with a navidia 770 graphics card .",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Loved the earlier games on Xbox 360, just didn't want to bother getting an Xbox One.  I almost held off buying this because of the other negative reviews about the PC conversion. But I'm glad I ignored them. I have played through the entire single-player game, and all the DLC missions too, and haven't had a single crash at all. Not one. I also got all the collectibles and side-missions too (I failed a couple of the collectible DLC ones that don't allow you to restart, I suck). So I definitely got to see every nook and cranny of the game.  Note that 'single-player' may be key here. I don't like co-op mode for Dead Rising, I enjoy it solo. So possibly multiplayer has stability issues - but I wouldn't know. If you just want to play single-player, it's perfectly fine.  Performance: It's a game targetted at a console, running at 30fps. Given it's a launch XBone title, it's probably 720p on that platform too. I have an i7-4790 (3.6ghz) and a GTX 750 Ti and it ran fine at 1900x1200. I didn't notice it dropping below 30fps even when there's hundreds of zombies on screen. It's not getting first-person shooter framerates, but it's solid enough for a console conversion in my opinion.  Don't listen to the naysayers - go buy it! :)",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what can I say!  Firstly what the hell! I put off buying this game because all I read was 'it was a bad port' 'runs terribly' well I've just played this from 11 at night till 5 in the morning and I truly haven't got a bad thing to say about it.  In the 6 hours I have played straight, it has not once, crashed, glitched or dropped frame rate. I'm by no means a game geek so I can't tell the 30 FPS lock, doesn't mean much to me. Sure there is some very minor visual tearing but I mean this game is doing a lot!   Someone was complaing about loading screens??? Sorry I didn't see a single loading the screen once the game started.  So what I will say is WOW WHAT A GREAT GAME! I'm a massive fan of the original, and spent lots of hours on the second. I can see myself playing this for hours too! It's really good. The story seems plausible. Some people complain the guys a little wossey, but given his situation you would be too!   The only other concern is that it seems a little too easy. But then I've racked up many hours on the previous games so that might be why.  It's the same game with lots of improvements. I'm really loving the massive map and no loading. That used to really annoy me on 2. Moving across the map loading all the time!  So yeah this game is fantastic. I wish I bought it earlier!  My specs are: i7 4770k GTX770 16Gb Ram  So that may be why I haven't had issues, I don't know.  If you've got a similar setup then buy with confidence as this game is a hoot!",
            "review_score": "1"
        },
        {
            "review_text": "***UPDATED***(1.10.2016) After four LOOOONG years of waiting this game is finally out for PC.As big fan of DR series im really happy to see it. I have really much too say,but one of the most important things is the game is advanced in almost everything from previous games,but sadly ALMOST.I'm gonna say some pros and cons,also there will be neutral features (for some one its con,for someone its pros). Let's start  PROS: +Absolutely new setting in the city (yeah i know DR2 was in the city too,but it was casino-like city and honestly it was kinda like mall from DR1) +Super combos (they first was introduced in DR2,but there was a few (Blietzkrieg,Laser gun and etc).Third part provides many super combos with ability to upgrade them (for example Mecha Dragon,which will become Ultimate mecha dragon,after adding 2-3 new items,in DR2 there was only 3 weapons combo)) +Different heroes in COOP (i know in the DR2:CW was also different heroes,but it was addon for the main game,they are also was in DR2:OTR,but Chuck wasn't story related) +More complex customisation (finally in the third game you can wear different pants and etc) +Open World +Challenges (they've returned from OTR,it's really epic) +Vehicle combos (there was some basic in DR2 like a Bunny Bike,Chainsaw bike,Machine gun bike,but in third game there is a really big amount of combos) +ALL clothes now stored in locker (not dlc and achievement only) +Combo gauge +Survivors board (now you can recruit them after rescuing) +Nice rewards after game completion +Great Overtime Sequence +Great Bosses  CONS: -No camera -Bad optimization -Second hero (♥♥♥♥) customisation is not showing in cutscenes (thats a huge let down,because in DR2:CW they did it just fine,i hope mods will change that) -You can't craft weapons without blueprints -New side quests and random survivors only appear when you progressing story (i saw this in 6 days mode (Story mode) maybe in nightmare mode there is no such thing.In previous games new survivors and quests appears when the time progresses (even if you failed main quest (story))) -Less skill moves -Challenges not so various (almost all of them about killing things,maybe after you progress story there will be more) -Challenges VERY easy (really,capcom?In OTR they at least had some difficulty) -Nightmare Mode is not challenging at all -It's really easy to level up -Amount of Bosses decreased comparing to other DR games  NEUTRAL: +-Weapon locker +-There is no need to escort survivors to safehouse anymore +-Two game modes (6 days and 3 days) +-Some DLC costumes isn't in PC version (like a Chuck,Frank etc) +-NO COOP in Untold Stories (for me it's really bad) +-Your character can't call his parther when he dies (that was epic and funny in DR2),also he can't call for survivors,but he can give them commands at least. +-Money system was completely removed (this system was only in DR2 and DR2:OTR) +-Stat books no longer appear as a physical thing after you picked them up  It's all major pros and cons,i did complete a main story and it was good. I won't give it a score i just say....FANTASTIC! Also sorry for my ENGLISH and i hope you like that review and it will help you decide to buy this game. I recomend this for both fans and newcomers. SEE YA,GUYS!!!",
            "review_score": "1"
        },
        {
            "review_text": "I am really enjoying this game so far. I almost gave this game a pass, but I am glad I did not. There has not been a shortage of zombie games, but there has been a shortage of fun ones. I like combining weapons, cars, food etc to make better items and the durabilty hit everything takes coupled with limited inventory; really makes it so you have to hunt or at least remember where you last seen something good.  This game runs ok on my system, it is playable on low @ 1920x1080 with very little to no stuttering. I have a amd phenom II x4 940 BE, 8 gigs of ram and a 460 gtx 1gb video card.   I can run it on high, but the occasional stuttering and pauses kills the game for me.",
            "review_score": "1"
        },
        {
            "review_text": "I played through the game with a friend, it was a very fun zombie slaughtering experience, with kinda dissapointing bosses and story. Weapons and cars were the best part of the game. I recommend to play it!",
            "review_score": "1"
        },
        {
            "review_text": "30 fps, some tearing, improved but still 'flat' textures. Dead Rising 3 PC conversion is not as solid as we hoped. The game is still fun to play, but we were expecting more on the technical side.",
            "review_score": "1"
        },
        {
            "review_text": "I really am enjoying this game, at the moment.   -The game kinda develope awkwardly when turning -1080p- on.  ^- Non-the-less, turning it on 720p might help reducing it.  -The game itself is really enjoyable and the storyline is incredibly funny too. 9/10 (At the moment)",
            "review_score": "1"
        },
        {
            "review_text": "Dead Rising.. oh man, I love this game series. This one is really fun to play, single or coop. It shares some of the same stuff of the first 2 games as well which makes it even better. Co-op, super fun unless you get the one guy that doesnt shut up and you end up muting the ♥♥♥♥♥♥♥ xD. snag it up, its worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game.   Gameplay: 8/10  Story 7/10  Fun 11/10  Action 100/10",
            "review_score": "1"
        },
        {
            "review_text": "california with zombies is slightly redundant",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR A Serviceable DR game with none of the charm or colour of its predecessors, only for someone fanatically inclined to the DR series or if you have a desperate need to downsize your amounts of fun that DR2 cursed you with  The first thing I noticed about this game is how brown it is (No racial undertones meant) Every sodding part of the city is drenched in either Brown or dark grey, I don't know what Triple A's Fetish is with Brown, Maybe it was his Highschool Girlfriend or something. The Next Gen Transition seemed to have cost DR alot of its vibrancy, very few of the Bosses are 'wacky' as opposed to just being disgusting and much too easy, the combo weapons have increased in number but are much more poorly implemented (I'll get to that)  Tangent aside, The visuals have that classic 'LOOK HOW NEXT GEN WE ARE, DO YOU LOVE US NOW?!' Feeling of trying to show of the visuals as opposed to letting the visuals show off the game, When I am mowing through a horde of Zombies With a cone on my head, I am nto stopping to look at the visuals, Maybe I would have in DR2 where the casino's had life and vibrancy, as opposed to this rehashed Liberty City ♥♥♥♥♥♥♥♥ we have here. The story is also a nice juicy target, in the second Game it had a feeling of retro camp with a grizzled one liner touting Chuck Greene, Who was not only adept at killing Zombies but also enjoyed it.  Nick Ramos on the other hand is a cookie cutter pretty boy who 'jus wants ta help' (which is very inconsistent at the least) When I killed my first psychopath, Nick Ramos freaks out like he was caught in the girls locker room, in DR2 Chuck Green made a sassy and slightly Dark joke about my enemies Untimely Love Making with a chainsaw, The tone of DR3 is much too inconsistent as well, Capcom Writes Story the way a Child writes awkward fanfiction. That is to say very badly, If you have ever played a DR game before you will not be shocked to find out the zombie virus was started by some very short sighted villain (which I spoil with no remorse, as only a lobtomized chimpanzee couldn't see that coming if you have played a DR or any capcom game before) So the story is very flat, theres a big thing about people getting chipped or outlawed if they are bitten, but the characters are so stereotyped and over reliant on you for help, that any and all interest fades fast.  But no one comes to DR for a story in the same way no one solicits a ♥♥♥♥♥♥♥♥♥♥ for an ethical debate. The gameplay of DR3 can be summed up as: It is DR2, but watered down and made insultingly easy. The combo weapons of DR2 were a brilliant method of providing countless experimentation attempts to combine weapons organically to create new and easy ways to break up the monoty of killing zombies, which worked very well. But in DR3 you cannot make any Weapon without blueprints as Nick is unsure of how taping knives to a pair of boxing gloves is in anyway an effective zombie killing tool. This terrible mistake means I have to scavenge out for blueprints scattered around the city as opposed to the fun of testing out which combinations work to create new weapons and a sense of satisfaction as you see what the game lets you get away with, makes me feel like I'm stealing someone elses creative dieas, not making them myself. In addition you can get a skill very early on to allow any weapon of any one category to subsitute as a replacement in a combo weapon, so two pistols can give you a combat shotgun/rifle Weapon which is already massively overpowered, and is now handed to you like candy.  Even worse is that now guns can be found in lockers, so you aren't enjoying a scavenger hunt to find the correct components to make your guilty pleasure Auto Turret Teddy bear or Twin MG Mounted Arm Chair, Nope instead you go to the Locker in a safehouse and it will just plop the bloody things out like a disinterested clerk at lost and found. Speaking of safehouses, the AI for humans is hilariously bad, Fighting AI soldiers makes me feel bad because I am worried I shot someones travelling Monkey Circus, The AI that 'helps' is awful, inaccurately firing shotguns whenever the planets align or flailing a melee weapon like a weedy anime child, which is made worse by the fact that you now have to escort them over a much larger city to safehouses so they stop following you, because Boss battles and Story missions are blocked when you have companions, so they are only useful in Free Roam, and in Free Roam they are a pain and pointless if you have a friend or Dog that can pull Co-op duty for you, so the irritating escort mission that were survivors has made no improvements (Don't even get me started on trying to get them into cars).  There is one big improvement however: That is the ♥♥♥♥ing awesome Combo Vehicles, Having a steam roller taped to the edge of a Harley while my co-op partner throws molotovs off the back is defintely one way to make it enjoyable trekking round the city. BUT NO they ♥♥♥♥ that up too! everywhere you go, there are blockades, Rubble and barriers blocking your way down roads, so you end up building a vehicle in one area, and only being able to use it in that area, theres no way to get a good pace going in a vehicle so they only serve to make us feel nothing but contempt for this City and praise the Zombies for livening up the place.  The game is also buggier than a Mating Session between Watchdogs and Unity (Ok maybe not THAT bad) The Pc version was awkwardly capped at 30fps at release even on PC, and anything too long the game gets frightened and pisses itself, that is to say it crashes, Alot, I'm sure these things can and will be patched at sometime but when DR3 charges a full £40 then to have such glaring problems does show, especially now that there is no colour and vibrancy to allay the annoying niggles that plague DR games, like having to pick up an item under pressure or the irritating fetch quests.  So does DR3 do a few things better? Yes, the vehicles are tons of fun, I don't have to worry about running all the way back to Katie every time she needs her vitamins, and the customization is more varied (despite the fact dressing up Nick like a schoolgirl is no where near the levels of hilarity it was to put someone who was actually cool, like chuck greene into the costume.) It doesn't do anything to dynamically change the DR formula and as a DR experience, you can get DR2 for cheaper and have more fun with it.  DR3 gets a 7.6 out of 10  I do not reccomend it as a DR game, but as a game on its own, it still manages to be a small cut above the rest (If only barely)",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand why everyone is hating on Capcom, Everything works well for me, Never had any crashing happen to me the only issue that still happens is fps lag. You don't need to have the best FPS for it to work, besides they are  coming out with patches that have been fixing the fps lag, and shadow bugs.  I really enjoy this game and if you are the kind of person who just wants to free roam and kill some zombies and not care about every single detail, or complain about everything thats wrong with the game, you will have fun. Story 8/10 (not mentioning the extra 5 episodes with different characters) Gameplay 8/10 Weapon combinations 10/10 (I built a d!ld0 launcher out of 1 d!ld0 and a leaf blower, seems legit) More time that first 2 games 11/10 (Finished the main story line with 5 and a quarter days left, with some side missions done.)  Overall very fun game, gonna go kill me some zeds.  Specs: i5/ 3.30GHz/GTX 760/ 8GB",
            "review_score": "1"
        },
        {
            "review_text": "My god I have mixed feelings about this. On the first hand, the port was terrible on release with people with GTX 780's getting horrible framerate. It was really frustrating. I couldn't touch it for the first 2 weeks or so because of how bad the port was. Then a driver update from Nvidia came and I was able to get a pretty good framerate. So I have no idea how to feel about the port. It's stable enough that I was able to beat the game and all 4 untold stories however and I believe I only crashed twice.  The main game is awesome, story's a bit short though. People recommended that If I've played every Dead rising game, that I should play nightmare mode because it's the closest you get to the DR experience. I'm not so sure, as the other games, while strict time limits, they still allowed you to be able to do side missions and explore. In this mode, the time limit is 4 times faster then the normal game, so you might have some time to do some side missions at first, but later on, you'll have to ignore them in order to finish the game on time. I cut it real close, I had 0 hours left when I reached the end (Not counting overtime mode) so yeah, If you're a completionist, don't do nightmare mode unless you have a friend with you at ALL times.   Anyway, do your research. The port is nowhere near perfect and was bringing Titans and 780's to their knees on release day. But if you're a Deadrising fan, I'd suggest giving it a go, and bringing a friend with you.",
            "review_score": "1"
        },
        {
            "review_text": "As an AMD user I haven't seen any of the crashing or other complications this game has brought, so for me it's been excellent.  I have really been enjoying my time playing this game and I have no intention of stopping.  The weapons are really creative, the challenges are good fun and the mood is a strange blend of serious and funny. It's odd but it works.  I realize a lot of people are downvoting this because of the crashes. But keep in mind the game has only just come out and this happens a lot to new games. (it shouldn't, but it does) My machine is happy to run this at a pretty constant 60 FPS, I had to VSync it due to so much screen tearing. Maybe I'm a lucky one?  The game itself is great fun, and that's what really counts.",
            "review_score": "1"
        },
        {
            "review_text": "I must be in the minority coz Im able to run this game perfectly with no errors nor crashes ... and what I played was awesome, ignore the whiney *****s and pick this up if you loved 1 &amp; 2.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good Dead Rising game. Fans of the series will enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Its a pain in the ♥♥♥ that it crashes...",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game because well its just so much fun, it may not have a great story but who gives a damn when you've got fun gameplay such as creating combo weapons and combo vehicles to kill zombies in different kinds of ways in the big open world, although the map can get annoying because of vehicles being in the way which makes it feel like a maze, but as long as you get used to the map you will have a whale of a time!!! Altogether this is a great game and good if you want to let of a bit of steam so this brings me to what i would rate this game and so i would give this game and 8 out of 10 the 2 points it didnt get were because of the map and the story. I love this game!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Where to begin?  When this game was first was realeased, I was ♥♥♥♥♥♥. It didn't work on my laptop that can handle crysis on ultra specs. Now that it's fixed...I feel complacent. Yeah this is a good game. But the hype is gone. The whole Capcom ordeal killed all hope I had for this game, and even though now I can play it, I don't think I'll spend as much time with it as I would if it had realesed fully functional.  If this whole thing taught me anything, it's that developers might not care, or take into consideration the wide variety of rigs out there.   I don't think I'll ever preorder a Capcom game on PC ever again. I don't think I'll even buy one if it goes on sale, if this is what I can expect from customer service.   It works..Barely, the cutscenes run worse than if you encountered a horde. And it is fun. But the service, the lack of care, really didn't help. I think I'll start looking into the Legend of Korra game. At least I know what to expect from Platinum, because they actually make decent ports.",
            "review_score": "1"
        },
        {
            "review_text": "Game is pretty epic, and the latest Nvidia driver fixed most of or all of the crashing issues!",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit, when I bought this game I was expecting to be annoyed by some glaring issue that would have made it almost unplayable. Thankfully I was wrong and was treated to another solid entry in the Dead Rising franchise. If you're a fan the series or just want to blow off some steam killing thousands upon thousands of zombies then I can't recommend it enough. Just make sure your potato can run it mind you!  Dead Rising 3 is set in the post zombie outbreak city of Los Perdidos (Which I am convinced is just Los Angeles.) where we assume the control of one Nick Ramos. Nick is then presented with a tutorial and a couple of token introductory tasks that do a good job of teaching the player how to play in a relatively short time. After the tutorial you are given access to the city in all its destroyed, flaming, ruined, zombie-filled glory to explore as you see fit.  Some neckbeard guy gives our Nick little tips and leads on side missions over the radio, but really it's up to you as the player to decide how to use the six days you have before the city is nuked to oblivion. This is where you get to the meat and potatoes of the game, the environment and the range of tools at your disposal. Want to grab a gun and use it to kill some zombies? Sure, why not. How about a Katana or Machete? Great. How about duct taping those two blades together to make a twinblade style weapon with an awesome moveset, more damage and more durability? Oh yeah, combo weapons are back and better than ever. I could write a freaking bible on just how awesome most of them are, but you should really discover the joys of crafting these implements of death for yourself.  Unlike Chuck/Frank from DR2/OTR our boy Nick can craft combo weapons on the fly, no workbenches here! Another neat little addition to the crafting system is the combo vehicles. Combo. Vehicles. The first one is a motorcycle... WITH A STEAMROLLER AS ITS FRONT WHEEL! Not only that but it has a couple flamethrowers tacked onto the sides because why not? The combo vehicles are a great addition and really add another layer of depth to the game, especially in co-op mode.  Grab a buddy and you can double the fun. You can share your gear, mount vehicle turrets while your buddy drives, hit them in the face with what can only me described as Mjollnir... The possibilities are (almost) ENDLESS! Whats more is that any collectables found by one player will also unlock for the other no matter how far apart you are.   As a whole the game has plenty to offer and has enough replayability to have you come back from time to time. Be it leveling up, gathering collectables or just stress relief there's something for everyone... Who has some psychopathic tendancies.  Come for the zombies, stay for the... Well, zombies. I know I did!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good Dead Rising game. Fans of the series will enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "There are some annoying issues.  After i fixed them ALL, its the greatest zombie game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "Bit of a rough launch but the game itself once working was amazing, love every minute of it. cant wait for the next installment. Some things i miss though are the zombie walk, unlimited mode, zombie crawl",
            "review_score": "1"
        },
        {
            "review_text": "want 2k zombies on your screen? this game is for you. want to drive crazy cars and bikes in zombie outbreak? this game is for you. want to dress male character with female clothes? this game is for you. want to troll zombies? this game is for you. want to co-op in zombie outbreak? this game is for you. want to see crazy fat ♥♥♥ women? this game is for you. want to craft crazy weapons? this game is for you. want nice zombie game with good graphics? this game is for you  well if you want all of them things. then stop thinking and go for it!  10/10. would see fat women in zombie outbreak again!",
            "review_score": "1"
        },
        {
            "review_text": "People blabbering about crashes should check their rig, cause it never crashed for me.  PROS: - This game really surprised me a lot, especially considering that it's made by Capcom.  - Even turned out to be one of the best zombie games out there, same style as State of Decay, but better.  - Much more survival than in Dead Rising 2  - Chuck Greene  CONS: - Weird Bugs  - Story and dialog is explained like it's for dummies  - Stereotypes (except for the main character that suddenly has feelings instead of being bad to the bone)",
            "review_score": "1"
        },
        {
            "review_text": "this games is great for those who love to kill lots of zombies &amp; the fans of other dead rising games",
            "review_score": "1"
        },
        {
            "review_text": "It had some crashes at release but a new nvidia driver fixed all problems for me. Game is fun and full of crazy situations. I could argue the points they could have worked on to make it better, but then I wouldn't be rating the product it is, but the one I wanted it to be.  If you have a decent pc, you will enjoy nice graphics and have fun with it. If you like sandbox games and hilarious zombie killings, you should buy this.",
            "review_score": "1"
        },
        {
            "review_text": "I was very much enjoying playing this game with my friend. We had completed both the normal story and nightmare mode and had started an achievement run. Today I went to start the 4th Untold Story and suddenly realised that my character level was at 1 and I only had 4 inventory slots. I tried chapter select and all of the chapters were locked. So now I have to do all the PP trials again to get the achievement, max out my character again and get 100,004 kills starting from zero.  I'm not trying to ♥♥♥♥ on the game. I really did enjoy it. I'm just ever so slightly completely ♥♥♥♥♥♥ off that I wasted 51 hours of my life just to lose all my progress.",
            "review_score": "1"
        },
        {
            "review_text": "The game is so far good.",
            "review_score": "1"
        },
        {
            "review_text": "Insanely fun game. Crazy outfits, incredibly crazy fun weapons, crazy vehicles and a super cheesy story. Exactly what there is to expect from dead rising. The world is big and the zombies to slaughter are more then plentiful what's not to love right. The only thing that really disappoints though are the psycho's. Dead rising 2 had some really memorable psycho's which were a pain in the butt to kill. This instalment however, not very memorable at all and nothing close to hard. But that doesn't keep me from enjoying this game a lot!  The graphics look nice, the content is cool en plentiful.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I crafted a ♥♥♥♥♥ launcher, and proceeded to lodge ♥♥♥♥♥♥ into a crowd of zombies skulls.",
            "review_score": "1"
        },
        {
            "review_text": "On sale it is a great game. Otherwise it's not as bad as people say it is. Just try it out for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Great storyline, plenty of action, and a lot of blood. Zombies are even more agressive than ever before. The psychopaths are awesome and they represent the seven sins. The game is really good and it's worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop playing Dead Rising 3! Despite very bad PC port and all the rage about bugs. Game is ♥♥♥♥ing FUN! There is something about slaying 10s of thousands zombies with sword or shampoo bottle :)",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and a most welcome instalment to the series.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly enjoyed this game, but it was really bad looking for PC....... The reason is - another bad optimization.... I recommend you to buy this game for your Xbox One if you have one.",
            "review_score": "1"
        },
        {
            "review_text": "Once you fix the fps issue the game is fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "After 15 hours (and over 10000 killed zombies) I completed the story and I enjoyed every second of it.   The game itself didn´t change compared to the first two Dead Rising and if you like them, you can buy DR3.  They removed some of the annoying stuff from the first two games, like the overpowered psychos you run in on the way to an objective. You still meet them in DR3, but they are not that strong anymore and you have more time before you have to get out of the city.  So I played with the timelimit, but I had enough time to do some sidemissions and explore the city.   Found not all of the plans (most of them) and the new weaponcrafting is way more comfortable now. I never had to level up the craftingspeed though, because Nick is very fast from the beginning.   Controls are very good with the Xbox 360 Controller, but I don´t like the Mouse/Keyboard Combo. It feels strange and I just didn´t get used to it.   Technically the game is beautiful and runs on max settings on my two year old PC perfect. I had some flickering shadows sometimes and that´s it with bugs. No crashes or any other problems like broken savegames.   The only thing I didn´t like was the sound of the tires when you´re driving. They sound like a dog barking in the distance. :D   Overall I enjoyed the game very much and I think it is the best game from the series.   Now I´m playing the sidemissions and begin a new game in Nightmaremode and then I´ll update this review.",
            "review_score": "1"
        },
        {
            "review_text": "Is gud, Is fun, Evryone is mad cause they had bad port I had good port So ♥♥♥♥ them 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The hate review was originally from HIGH LEVEL hardware user that cannot maintain maximal satisfaction.  For me?  One lenghty word : AAAAAAAAAAAMMAAAAAAAAAAAAAZZZIIIIIIIIIIIIIIIIINGGGGGGGGGGGG!!!  30 FPS LOCK was no big deal for me :) The graphic options was really generous The game was spot on Gameplay was fun  Seriously, BUY THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "The real Dark Souls starts here.   Game is so hard I cant even get past the loading screen.",
            "review_score": "1"
        },
        {
            "review_text": "BEST IDEAL WEAPON AWARDS 2016",
            "review_score": "1"
        },
        {
            "review_text": "The game crashes a lot!!",
            "review_score": "1"
        },
        {
            "review_text": "THIS AMAZING FUN! 9/10  Why People give 'NEGATIVE?' You Dumb!",
            "review_score": "1"
        },
        {
            "review_text": "Capcom is widely known for making poor pc ports so I tried this before I bought it and it ran fine so I bought it. It has crashed only maybe twice no more than three times in the single player on two playthroughs. For Capcom, that is really good. The main problem with the game though is in co op. My friends have constant disconnects or crashes, putting a serious damper on co op fun. The same happened to me when I joined their games. The crashes are not frequent, and I was able to play for long periods comfortably with one friend, but the point is that there should be zero crashes. That is a pipe dream when you are talking about Capcom games though.  Even though I hate DR2, this is one of the most fun games I have played in a long time. I hated DR2 because you are on a constant timer to bring zombrex to your mentally challenged daughter. This game has a countdown too but it isn't a huge bother like in 2: you have 7 days of game time to finish the game before the city gets nuked which equals around 25-30 hours of gameplay as opposed to only around 7 in DR1 and defintely not 25 hours in DR2. I also hated 2 because it felt like a cheesy 'Sega Arcade' game like Crazy Taxi. This one is just as wild as that game but has a actual AAA feel to it and the graphics are outstanding. It is a darker more serious game, although obviously not that serious when you can build a d-ldo firing gun, among many other crazy items. The seriousness comes from the story and cut scenes, then it turns you loose to your own devices to be as creative as you want. The graphics and effects are some of the best I've seen in a long time and the music and sound are also very good. The story is great and the gameplay is smooth. The game is not very challenging though because it gives you such powerful weapons. On the second playthrough on nightmare mode it was still not a challenge because it let me keep my level, stats, and weapon blueprints. Not one single boss battle in the game is a challenge at all. I never died on any boss and never came close to dying, other than when I first started the game and the monk in the gardens killed me once because the battle comes so quickly and I was still getting used to the game. But compared to the other DR games which have imo some of the worst, most awkward and clunky boss battles I've ever seen, this game's boss battles are a godsend.  Being a Capcom port of a open-world console game, there are of course going to be performance issues. In the hands of a more capable company, probably not. There are certain areas of the game that give huge graphical lag spikes for no reason whatsoever because they are no different than other areas of the game. Besides that, the game runs pretty smoothly on max settings for me so considering that this is a huge achievement for Capcom I am pretty damn happy.  I completely understand why this game got mixed reviews because of all the people crashing and having performance issues. Capcom is among several other companies when it comes to not being able to port games very well, including Ubisoft and the kings of bad ports, Square. I am fortunate enough to enjoy the game relatively unhindered at a smooth 60 fps.  8/10 The game is well worth the $30 I paid for it for the 40 hours I got from it. There are also four untold stories that you can play from the main menu.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! is just like the first two! but alot easier to make items! and now m ake super cars! and bikes! This game made me smile, anyone who says its 'not working' there is an easy fix to the issue, people ♥♥♥♥♥ before trying everything, Just alt enter the game to make it fullscreen! so if you have any issues simply ask before you ♥♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "DR1 is still the best in the series but still a very good game. The game doesn't last very long, I lost interest after 2 playthroughs, but I could play through DR1 like 5 times before getting bored :/",
            "review_score": "1"
        },
        {
            "review_text": "If the game's locked framerate and console-like visuals won't bother you, then you should have a great experience with this game. It's Dead Rising, what else can I say?",
            "review_score": "1"
        },
        {
            "review_text": "mine works fine..",
            "review_score": "1"
        },
        {
            "review_text": "Buy This Game when the price drop or discount  Gameplay :8/10 Multiplayer: 8/10 Soundtrack:4/10  Must Buy Game!!!! if you're a fan of Dead Rising Series you must buy this game but this game runs perfectly in my medium-end laptop 30fps lock ,hey this game also suck a little bit cause of the annoying bugs ,just BUY THIS GAME when it get a discount or a Price Drop!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's a dead rising game that doesn't betray any of its ancestor. Which all the bads and the goods are still there. That explains why the review is mixed, I guess..   The game is fairly big and it is absolutely not toaster friendly.",
            "review_score": "1"
        },
        {
            "review_text": "While this game isn't as good as DR1, DR2 or DR2:OTR, it's quite enjoyable. Looks like a Robert Rodriguez's film mixed with Dead Rising, pretty recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, looks great on decent PC I get full 30Fps on i7 4770k 16GB DDR3 ram and GTX 780 on 1200p screen.  lots of zombies, reminds me of the walking dead.",
            "review_score": "1"
        },
        {
            "review_text": "So far so good, Lots of zombies...maybe to many",
            "review_score": "1"
        },
        {
            "review_text": "Cleanly made. Nightmare mode is a must, makes the game much better.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent! Great fun and running with no problems at all.",
            "review_score": "1"
        },
        {
            "review_text": "Survival may not be always be pretty in Dead Rising 3, but it's fun to roam around in this LA-inspired setting for Capcom's latest take on a zombie apocalypse. You'll be able to hop in a car and traverse from one end of this city to the other in about five minutes, but the thrill is in the journey rather than the destination. And if you happen to be making the trek on a RollerHawg, a combination of a steamroller and motorcycle, that journey will cheerily mulch a couple of hundred zombies into paste.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game but after a while it gets boring , the map is big but not big enough. I finished the game and had around 20/30 hours of fun with it but thats pretty much it. I would recommend it if you could get it at a low price and just want some fun killing zombies.  6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun Coop I liked DeadR2 off the record and will be playing it again in the future but for now I will be playing this one. I didnt want to buy A xbox one just to play this one im glad they have it for pc worth the wait for the final game with all dlc  8/10 would banana hamock again",
            "review_score": "1"
        },
        {
            "review_text": "So Cool!!! If u likr zombies and u like killing and survival this is u game and if u wana have fun with u friend u can play it coop :DD",
            "review_score": "1"
        },
        {
            "review_text": "Definitely download this game that is all ",
            "review_score": "1"
        },
        {
            "review_text": "Survival may not be always be pretty in Dead Rising 3, but it's fun to roam around in this LA-inspired setting for Capcom's latest take on a zombie apocalypse. You'll be able to hop in a car and traverse from one end of this city to the other in about five minutes, but the thrill is in the journey rather than the destination. And if you happen to be making the trek on a RollerHawg, a combination of a steamroller and motorcycle, that journey will cheerily mulch a couple of hundred zombies into paste.",
            "review_score": "1"
        },
        {
            "review_text": "fun game, great weapons, but bad frame rate.",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good game! :)",
            "review_score": "1"
        },
        {
            "review_text": "Definitely download this game that is all ",
            "review_score": "1"
        },
        {
            "review_text": "Every time i get on this game it crashes. What a waste of $30. DON'T GET UNLESS YOU YOU HAVE A GOOD COMPUTER!",
            "review_score": "1"
        },
        {
            "review_text": "Funny, cooperative game, but ♥♥♥♥♥♥ console port.",
            "review_score": "1"
        },
        {
            "review_text": "Had no crashes or any other technical problems. Game took ~20 hours to finish (I've skipped few last side missions).  I wish it wasn't locked at 30 fps, but I don't feel it should influence the overall score of this game. I enjoyed it and I recommend it to all who liked Dead Rising 1 &amp; 2.",
            "review_score": "1"
        },
        {
            "review_text": "Better than complete ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "The game has really great story and a lot of custom weapons to kill zombies with. Sadly it is really poorly optimized. And it´s locked at 30 FPS, though you can unlock the FPS from config files. I suggest playing with controller and keeping the 30 FPS lock so you wont get huge dips in FPS.",
            "review_score": "1"
        },
        {
            "review_text": "The game has really great story and a lot of custom weapons to kill zombies with. Sadly it is really poorly optimized. And it´s locked at 30 FPS, though you can unlock the FPS from config files. I suggest playing with controller and keeping the 30 FPS lock so you wont get huge dips in FPS.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Played 10 hours and the game never crashed once. -Turned off FPS lock and it made it feel great to play -Story keeps me going -Zombies are harder to avoid (can't just jump around like the last 2 game) -Not constrained all the time to wait for the next set of story events to take place -6 or 3 days to complete the story (depends on what mode you play on) -Bosses are more fun to fight than ever -Good humor comparable to the last 2 games -Satisfying to kill zombies -Weapons are not too OP -Can choose whenever I want to go do side missions  Cons: -20-30 fps in cut scenes (I got over it quick) -Hard to drive around half the time, abandoning vehicles can become common if you are not paying attention -Crowds of zombies will stop your vehicles velocity or bring it to a complete stop  Overall 8/10  EDIT: after going through the complete story, I can safely say this game is worth playing through to see the true ending. After seeing it, this may be the last game in the series. The voice acting is magnificent. I love every character I've run into.  EDIT 2: Found someone wanting to make a porno with zombies. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "To the people who complaining about this game ,the number of coding and effort in this game is more than the number of your sperm . So stfu and upgrade your pc to enjoy the game.",
            "review_score": "1"
        },
        {
            "review_text": "Gonna write a honest review here, this game is very fun, well made, and can take hours of your day.It's getting bad reviews because most people unlike myself can't run it. the people that can't started bashing and attacking this game and capcom almost instantly, capcom already stated it's not optimized for laptops or optimus cards.Well guess where all the negative reviews are coming from....people with laptops and optimus cards.I have a GTX 670 and had no issue ever since release...i have it beaten on all modes with most stuff unlocked. I have played with a ton of people in multiplayer so i am clearly not the only one,most of them have been fellow desktop owners with working cards for the game.I highly reccomend the game only if you have the system it was made for otherwise there could be issues.",
            "review_score": "1"
        },
        {
            "review_text": "Well I don't have any low fps and crashes while playing this game so it must be 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "unoptomized but really fun  no new game+ like you'd expect",
            "review_score": "1"
        },
        {
            "review_text": "25 hours and only 1 crash pretty good... had no lag or fps loss story just ♥♥♥♥ zombies, loads of weapons, hack and slash fun  7/10",
            "review_score": "1"
        },
        {
            "review_text": "god DAMN this game is CPU demanding.... can't bare it. Seems like an awesome game if U have the hardware for it ",
            "review_score": "1"
        },
        {
            "review_text": "Here's a game where you can TRY to 360 quickscope some cheeky zombie scrubs. If you fail with that, you can awalys go shove some dank kush up your ♥♥♥ m8. That's right, send Nick on an 420 Mlg Blazin quest for The Ultimate WEED, he will noscope alot of zombies, then take your 16 inch wanger and slap some ho in the face, because you're high af so who needs logic. there you go m7. I'd reccomend this game to any scrub who want's to jack off to dewrito zombie kush pornos and kick Optics virgin ♥♥♥ as the ultimate 720 quickscopin Faze clan member that your 12 year old wishes he was. So prepare to get rekt, because this game is about to blow you away harder than your mum blew me last night. Get it and get some swag in your life. 10/9 IGN",
            "review_score": "1"
        },
        {
            "review_text": "It lets me wear frilly dresses with afros: 11/10",
            "review_score": "1"
        },
        {
            "review_text": "really enjoyable game i recommend getting this one funny on co op",
            "review_score": "1"
        },
        {
            "review_text": "Buy for the killing ignore the story",
            "review_score": "1"
        },
        {
            "review_text": "Resume: I pre-ordered this game and i was forced to delay playing it due to crashes/bugs. Now and after some patches, i was able to make my first hour of gameplay and it's safe to say it's a miserable port.  Huge frame drop, i bet even with the best riggs out there, the cutscenes are painfully slow even with medium settings. Apart from that, gameplay is very satisfying:  PRO's (so far)  decent RPG system, great visuals, neat voice-acting, good melee combos, plenty of weapons at you're disposal nice and easy weps crafting system, vehicles, character customization (many and varied outfits), gigantic open world, lots of zombies to hack n' slash.  Con's (so far)  already mentioned the bad port and the consequence of that: enormous framedrop, desync in most of npc's conversations, some little freezes here and there, story could an should have been more solid...  I still recommend ( not full price tho) this game for it's atmosphere, the crafting system, it's combo and special moves. Regardless all troubles , you can still have fun hackin n' slashing the most gigantic concentration of zombies i've seen so far in a screen .  p.s- haven't test the co-op mode yet but, it just has to be fun",
            "review_score": "1"
        },
        {
            "review_text": "I go to the school, I get the ♥♥♥♥ beat out of me by the football team. I go downtown, I get shot by police. I go to the highway, I get the ♥♥♥♥ beat out of me by bikers. 10/10 real life simulator.  Serious review: Really good game, especially if you liked the previous installments, and the port is surprisingly good. I'd recommend it whenever it's on sale if you're considering buying it. (Most of my hours are offline, just a heads up.)",
            "review_score": "1"
        },
        {
            "review_text": "Does not have graple hooks i give it a 0/10",
            "review_score": "1"
        },
        {
            "review_text": "The most epic game i played so far !! Well done.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE this game. been playing it non stop for the past 2 days now. the very first Dead Rising is a Classic and will always be one of my favorites. but i can also easily say that Dead Rising 3 is my favorite of them all! they really perfected the game with this installment in the series! i HIGHLY advise this game for anyone whos curious about it. But note, i have an Alienware 14 and this game still lags a little at times with me. And i have a HIGH END PC. So just be warned. If you don't have a good high end computer with pretty high end specs, Then this PC installment of Dead Rising 3 might not work to beautifully for you. But all in all if you got the equipment to run it, Then happy zombie hunting my fellow friends! this game will keep you most def coming back for more! ^^ easily at 10/10 in my book!!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game to mindlessly kill tons of zombies in original ways.",
            "review_score": "1"
        },
        {
            "review_text": "Best zombie game on steam ATM ! , 9/10 Must Own !",
            "review_score": "1"
        },
        {
            "review_text": "Best zombie game on steam ATM ! , 9/10 Must Own !",
            "review_score": "1"
        },
        {
            "review_text": "Why buy a $500 XBONE when you can play it's only decent game on PC?",
            "review_score": "1"
        },
        {
            "review_text": "Totally filled the need I had for some B movie zombie horror!   Runs really nicely on my r9 290x, hasnt crashed or really dropped a frame.  If you love some zombie smashing fun with a decent story too! 100% recommend this!",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░█▀▀░░█░░░░░░ plz fix  ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░  ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░  ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░  ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░  ░░█░░░▐░░░░░░░░▄░█░░░░░  ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░  ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░  ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░░  ░░░▀▀Optimization░▐▄▄▄▀░░░ ░░░░░░░░░░░░░░░░░░░░░░░  its a good game tho",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I played in this series. I loved it, cutting and smashing zombies , help or leave the survivors . Create awesome weapons and vehicles. Everything depends on you in a world full of zombies. When you have finished reading this comment,What are you waiting for ? . Play this game, become zombie killer and see everything look like what i say.(If you have any question about i can play this game early like japan,let me answer because everybody in VietNam can play this game early not only me :) ).",
            "review_score": "1"
        },
        {
            "review_text": "Dead Rising 3 was an Xbone exclusive that found its way to pc but will you want to play this or just skip it. In Dead Rising 3 you play as Nick Ramos. Hes a mechanic in Los Perdidos and one day an outbreak happens and you find out that the goverment is gonna drop a fire bomb on Los Perdidos so its up to you to get out of the city. So how is Dead Rising 3 ? I found it quite good actually. The game is alot more faced paced than the previous installments of the dead rising franchise. The game has many improved features like better combat and alot better controls on pc than previous games and of course lets not forget that the game lets you craft items on the fly instead of you needing to be near a work bench. The game also looks great and the soundtrack is awesome. But not only that but you also get all the dlc that came out on the xbox one edition (excluding the hyper edition dlc). So overall lets go through the pros and cons. Pros: The game is a blast to play and its a great and includes alot of stuff to see and do. The game has a ton of missions and side quest for you to do. Fun combo weapons and a great story. The Cons: the game has some performence issues on the pc which do downgrade the expierence. Confusing map, Bugs and some awfull side quests. Overall i suggest you get Dead Rising 3 in a sale and not full price because its definently not worth the full price. And its nice to have all of the dlc. I give Dead Rising 3 a 7/10",
            "review_score": "1"
        },
        {
            "review_text": "hey i need help can some one join me/add me so we can play?",
            "review_score": "1"
        },
        {
            "review_text": "Love the game but Jake won't play it with me. ",
            "review_score": "1"
        },
        {
            "review_text": "Wait for it...... Its coming.... 9/10!!!",
            "review_score": "1"
        },
        {
            "review_text": "What Dying Light Should Have Been",
            "review_score": "1"
        },
        {
            "review_text": "If you have a pc worth a damn then you will love this game we are in an age of 4k gaming which make xbox one and ps4 look like a SNES i play in full 4k at 4096x2160 res at 2160p on ultra settings and this game looks amazing it is one of the true next gen titles that we are gonna see more and more of so it is time to upgrade your system if you want to play titles like this. It has always been this way with pc gaming it's just that we are at the best times for uber hardware which is obviously gonna reflect in the titles we are seeing now ,if you dont want to or cannot upgrade your rig for titles like this then there is no point trying to play them you are better off getting (the incredibly lame) 'next gen' (lol!) consoles .And as for those complaining about the '30 fps' cap you cannot blame poor outdated pc's and fps on a 30 fps cap which is totaly not a problem as the game is optimized at 30 fps and does not need any more and plays perfectly fine at that fps.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun to play. Co-op is amazing. Spent most of my time killing zombies and hunting combo weapons than doing the main story quest lol Some weapons are funny as hell.   Theres this combo glove that makes you shout Shoryuken!! as you uppercut. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Like it a lot! Too many zombies, too many things to do!!",
            "review_score": "1"
        },
        {
            "review_text": "Trash and fun, this game will entertain you without a doubt, zombie lovers or action lovers, don't hesitate. I would adivce to play it with a gamepad though.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game so far. I like the different setting that your in from the previous Dead Rising's setting. New weapon combo's for more zombie killing action which is really nice.",
            "review_score": "1"
        },
        {
            "review_text": "Co-op is essentially just a single player campaign -- your partner doesn't even show up in cut scenes most of the time -- and there's not much to actually do together. You don't hurt each other, but you constantly knock the other player over while fighting hordes of zombies while near one another, so you're almost encouraged to fight in different locations.  Aside from a handful of specific vehicles, there's not much to do if you're a passenger. You can't hang out the window and shoot your gun, ala Saint's Row, and it gets a little boring on the fetch missions while you're zipping from corner to corner on the map.  The story is absolutely ridiculous, and the serious tone it tries to take is just absurd. You're doing all this over the top action with bizarre contraptions and utter disregard to life, then you're feigning sorrow and massive sympathy in the cutscenes (all while wearing silly outfits like halter tops, panties, fishnets, and garters).  TL;DR: The gameplay is incredibly enjoyable, and there were times were my friend and I would cackle like maniacs. If you enjoy exploration and just silly fighting, I can't recommend this game enough. Don't look for a deep story or a highly refined co-op experience, though.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what all the issues people are having wit this game. I loaded it up the first time and it was little rough with some screen tearing however after I activated the vsync it works perfect. I'm guessing most of these people tried to unlock the fps which the game doesn't really need. It would be nice to have a few more options to enhance the graphics but overall I like the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best loading screen simulator(LSS) that has ever graced the PC market. Crips loading graphics accent a beautiful rendition of the words 'DEADRISING 3'. I am still trying to figure out what series of commands or devilish strategy will get me past the first level of THE LOADING SCREEN. It's a seriously difficult boss because every time you THINK you are going to get past the loading screen the game crashes.  Again, and Again and Again.  I have been playing the (LSS) for about a week now - Would recommend! Buy 3 copies!",
            "review_score": "1"
        },
        {
            "review_text": "this game is so laggy to me guys i say but then fix it",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Runs like a charm on my system (i7 2600, amd r9 280 2gb, 24 gb ram). Highly recommended for Dead Rising fans.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. The game is set in a fictional city, I like play the mode of cooperation, thanks to Capcom, Capcom,can you put the optimization do better？",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, I love the game when I played it on the Xbox 1, and was really looking forward to it on my PC. I even pre bought it, which I'd never done before. To put it bluntly, it doesn't work. I crash every time on the loading screen. Having been looking forward to playing the game and having paid $50 for it, I was very disappointed. But I thought to myself, 'Hey, they'll probably patch it soon and make it playable.' It's been about a week since I first tried to launch it, and it hasn't gotten any better. I rolled back my graphics card to no avail, and I desperately searched for another way, trying everything I could. Perhaps it's my fault for trying to play it on a laptop, but this laptop is a fantastic machine that can run anything I've tried playing on it. I read somewhere that the game was not made to work on a laptop, but that was not made apparent to me before I shelled out the money for it. I still cling to the hope that the game will be fixed, but if it doesn't happen soon, I would love an oppertunity to get my money back.  Thanks for trying, Capcom, I really would love to play this game. Please make that possible.  EDIT:  Thank you, Capcom!!! I can finally play this game thanks to the Nvidia patch! I can now safely say this game works, and I do fully recommend and endorse it.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, funny game. The combo weapons AND vehicles are absolutely hilarious and fun as hell to use. The missions are pretty funny aswell. You can build a ♥♥♥♥♥ rifle that shoots ♥♥♥♥♥'s at the zombies. Unfortunately, the game released with horrible fps and crashing issues left right and centre. And only a couple of days ago did the drivers get fixed. I played through the issues, but without them i've found it much more fun. I've played halfway through the game and already at 14 hours game time, so many blueprints and collectibles to find you'll definitely have fun playing if you like zombie games.",
            "review_score": "1"
        },
        {
            "review_text": "Im not one to play many zombie games, i think they are all the same. shoot the zombies upgrade the weapons. Bud this game has actually kept me playing. if my prosessor didnt suck i would play it more.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, once you get use to the akward camera and poor console port controls.   Better with a friend but it is dumb how anyone can just join your game.   Steam overlay did not work for me, good thing it did for my friend or we would never be able to play.",
            "review_score": "1"
        },
        {
            "review_text": "Boring to play alone, fun to play with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "With Solid Gameplay you can exuse some of the game breaking bugs that you with encounter with this game",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is fun. I hope you have a good PC or you will be running this badly ported game on some pretty low settings.  Buy it on a Console instead.",
            "review_score": "1"
        },
        {
            "review_text": "I've sunk 5 hours into the game just today.  For me I enjoy it, mindless Zombie killing fun with the spirit of the DR series.  Yes it has issues, and should run a lot better on SLi GTX780Ti (Sli doesn't work anyway). I've had 1 crash in the whole time (Had 4 in Risen 3), but it doesn't spoil the fun of the game.  Would I recommend it, yes but not in its current state. I'd suggest waiting until they patch the game like Watch_Dogs.  It's early days of Xbox One to PC porting, so there will be some teething issues, but hopfully dev's figure it out in the end.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the previous Dead Rising games, you'll probably like this one. It's more of the same. Vehicles play a bigger part than before and you will need them to get around the map. The normal difficulty story felt a bit too easy, so if you want a challenge you may want to try the hardened mode which makes the enemies tougher, shortens the timeline and adds some restrictions to saving the game progress.  + Fun + Chaotic  - Forgettable story and characters - Not really a challenge",
            "review_score": "1"
        },
        {
            "review_text": "it was fun for a few hours but it got old fairly fast i play every once in a while just to kill hoards of zombies",
            "review_score": "1"
        },
        {
            "review_text": "I have to wait for the patch verson of the game come out in order to play it. The game is much smoother now. Its a fun game to play when you play with friend, variety of weapons and character customizable.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "r.i.p. my FPS  this will be really fun to play eventually.  ***(EDIT)***  If you use a gefoce card roll back to the 335.23 driver and it fixes the crashing!!!",
            "review_score": "1"
        },
        {
            "review_text": "I found this Game enjoyable it might be a port to PC but it's still a good game.",
            "review_score": "1"
        },
        {
            "review_text": "omg Please fix the crashing please!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Spent way too long on this. Excellent game, even better once you unlock the framerate using Flawlesswidescreen.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the previous Dead Rising games, you'll probably like this one. It's more of the same. Vehicles play a bigger part than before and you will need them to get around the map. The normal difficulty story felt a bit too easy, so if you want a challenge you may want to try the hardened mode which makes the enemies tougher, shortens the timeline and adds some restrictions to saving the game progress.  + Fun + Chaotic  - Forgettable story and characters - Not really a challenge",
            "review_score": "1"
        },
        {
            "review_text": "The sound of zombies getting chopped to pieces blocks out the noise of people complaining about owning horrible rigs... Plan on putting on spandex and running around with a giant crotch-thrower 10/10 would pelvic thrust again.",
            "review_score": "1"
        },
        {
            "review_text": "i have been dieing to play this game. and it wont even start for me. everytime i try to start it it just shows up as a black screen. i have redownloaded it 3 times allready. i just wanna play my damn game.",
            "review_score": "1"
        },
        {
            "review_text": "Have had no issues really except for the occasional crash. I save every 5 min or so to make sure i won't lose much progress. I must say this game is amazing. Just brutalizing zombies for hours is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Im not one to play many zombie games, i think they are all the same. shoot the zombies upgrade the weapons. Bud this game has actually kept me playing. if my prosessor didnt suck i would play it more.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great visually and gameplaywise.It is also very funny and has very unique boss battles. The only problem with this is the framerate. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much just beware this is a demanding game.",
            "review_score": "1"
        },
        {
            "review_text": "Game is real good, story line awesome. I don't normally give good reviews but as far as a zombie game this game is awesome. I give 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Endless Fun! way Better than DR2",
            "review_score": "1"
        },
        {
            "review_text": "Great update to the dead rising series and really enjoy the open world missions and less time limit on the overall game felt like I could really have fun with the various costumes and side missions and especially leveling up and crafting.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for co-op play. I bought this for myself and my wife to play together. We are both Zombie fans and truly enjoyed all the gore. The story isnt the greatest, but if your looking to let loose a little stress by destroying hordes of undead you've come to the right place. I had a ton of fun with the vehicles though i wish there was more for passengers to do. Some vehicles allow the passenger to control the turret, some dont, and some are just bugged. Still overall if you are looking for pure gory hack and slash then this is the place to be.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game!! so much fun!! a little buggy at times and and some lag at times. But it's good fun!! Have'nt had time to test out the co-op yet but I'm looking forward to it!! It looks great!!! :)  Edit: after the latest patch and latest driver update from nvidia the game runs super smooth on my gtx 780. This makes the game so much more enjoyable!!! :)",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game a year and half ago and I remember having a good time playing through it and coming back play online with a buddy the experience was way better Would definitly recomend if you can get past trhe 30 fps lock even unlocked it runs about45 fps but its definitly playable  overall decent game",
            "review_score": "1"
        },
        {
            "review_text": "Average story. The best part is the end cause it'll connect to dead rising 2 which is the only reason I would recommend this game.  Biggest problem with the game is too many zombies. I killed about 20,000 playing through. 10,000 Just driving place to place and running them over just to travel, and 10,000 by weapons while on foot. weapons usually break at about 30-100 zombies a piece so that tells you how many weapons you go through. There's a perk that let's you swim through zombies. Yes...so many zombies to walk through you need to swim to get through them.   Ps Every quest, except special ones that are 'go kill that person', are fetch quests. Hey go grab that, hey go grab that, hey go grab that, over and over and over. while of course you are driving through zombies or running through zombies.",
            "review_score": "1"
        },
        {
            "review_text": "The only game where you can combine a chair and carboard box to a baseball bat with nails in it.  15/10 would say WTF again.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, awesome graphics, everything about this game is the dead rising franchise. You don't have to have a fancy computer to run it either, I got a i3 Alienware alpha with an upgrade on the ram and it runs smooth as a baby's bottom.",
            "review_score": "1"
        },
        {
            "review_text": "This game will keep you entertained for hours. there is plenty of quest todo items to collect and zombies and insane people to kill. the game is fun to solo but if played online with the right people the game is even better. the maing thing about this game is to remember is to find all the weapons mods that you can as that is the key serving the hordes of zombies",
            "review_score": "1"
        },
        {
            "review_text": "The game has its issues, but it is totally hillarious. The story is simple but good, i really liked the characters and there are multiple endings. Graphics is really good, however don't forget to unlock the framerate. However I have been struggling with fps drops sometimes - maybe because of my G3258 dual core pentium. Graphics settings didn't help much. Overall - the game should be optimalized more. What I really love about this game is the soundtrack! Especially Celldweller's Gluttony Battle theme. This music from dead rising 3 is really powerful and atmospheric. And the best one for the ending - crafting system. You can make the freakin' dild0 gun! Do I have to say anything else?  9/10",
            "review_score": "1"
        },
        {
            "review_text": "People don't recommend this game because of the port and it's issues. I honestly pretty much had no problems with the game and it ran fine and I enjoy the hell out of this game. If you get this game and it ends up not working, im only going to say either fix the issues and don't waste money or just ignore the game since you're lazy.  Now for my review about the game itself: This is my all time favorite game franchise gameplay wise and lore wise. When I first heard about this game I got excited as hell, only to realise that it's an actual city and not a traditional mall. but when you think about it, it's amazing! You have more fun with traveling in cars and there is a hella load to explore. I personally didn't mind the map when I started playing. There are many new blueprints added to the game along with the previous blue prints from Dead Rising 2. The system to making them is in my opinion great. It doesn't take time out of what you are trying to do and you can make the weapon on the spot. Making blueprint vehicles just for fun is a great time killer too! Clothing customization is off the hook and I enjoy keeping the game fresh by changing outfits every now and then. Psychopaths are back and weirder than ever too!  Time for my story review: Holy crap I enjoyed it so much. If you want to experience the story mode to the fullest you must check out the first dead rising along with the original dead rising 2 with it's dlc. The lore is so amazing and I just had to keep playing because I loved every bit of flashback.  Buy this game if you are a fan of the Dead Rising series or hell even a zombie fan in general! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well if you love zombies you have to play this game The amount of combined weapons ideas is just unbelievable Plus you will have an amazing time playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "I heard this game is only good on high end computers. I have a high end computer, so it runs great. This game is funny and fun.",
            "review_score": "1"
        },
        {
            "review_text": "its all ok now.",
            "review_score": "1"
        },
        {
            "review_text": "great game i hate the love interest",
            "review_score": "1"
        },
        {
            "review_text": "Coming from someone who loved dead rising 2 and OTR, this game is no exception to the franchise. The wacky weapon crafting is back and over the top gore and zombie count, but this game suffers from a weak protagonist and extremely poor performance on PC. On a GTX 770 and i7 4770 i couldn't get a constant 60fps unless i really cranked down the graphic settings. Otherwise it is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game filled with lots of fun .. could look and run better though.. thanks alot xbox    17/9 IGN ",
            "review_score": "1"
        },
        {
            "review_text": "Think of this game as Dynasty Warriors crossed with Grand Theft Auto, with zombies. There's carnage to be found everywhere, and it's an absolute blast to play. Plus, as a Dead Rising title, this game improves on Dead Rising 2 in many ways, with a much bigger city to explore, a more lenient time constraint which allows much more time for exploration and side-missions, even more zombies to kill and tons more super-fun combo weapons and vehicles with which to do so, whilst also doing away with DR2's annoying carry missions and Zombrex requirement, as well as improving the combat exponentially. It is locked at 30FPS, but this can be removed with a simple .INI edit, which improves the experience greatly.",
            "review_score": "1"
        },
        {
            "review_text": "DR3 is a pretty fun game and well worth playing. Nice graphics, reasonable controls, low fps but you get used to it, and I haven't seen any stuttering or slowdown. It feels like a B horror movie from the 2000's, it's cheesy and gratuitous and doesn't take itself seriously. The main character is well written and relatable. People complain a lot about the framerate and optimization but if we're being honest, it's really not that bad and you get used to it quickly.  The Apocalypse Edition comes with some DLC that extends the campaign with a few extra playable characters.  I enjoyed DR3 and I feel like my money was well spent. If you like zombies and open world games with a lot of diversions, you'll probably like it too.",
            "review_score": "1"
        },
        {
            "review_text": "Insanely fun and an overall great game. I have played for four hours and have yet to encounter any bugs like people complain about. Game runs smooth with no stuttering. Gameplay has been improved and the crafting is more insane than ever! This game is fun and I recommend it. Don't listen to the bad reviews!!!",
            "review_score": "1"
        },
        {
            "review_text": "just awsome    thats all :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Never had any probloms with it. The game play is great lots to do. Tons of weapons and zombies.",
            "review_score": "1"
        },
        {
            "review_text": "run smooth on very high setting. co op is fun. don't see any major bug. crafting is hilarious. game is short and map is too small tough.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "gave a black guy watermelon.  11/10 would feel racist again",
            "review_score": "1"
        },
        {
            "review_text": "I personally enjoy this game. In my opinion, there isn't much more fun than running around killing zombies with pratically anything at your disposal while dressed in a variety of clothing included in the game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "14$ for this amazing game PC masterrace its a fact not a joke to ♥♥♥♥ of those filthy console peasants from 49$ to 14$ mindblowing",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun like heck.",
            "review_score": "1"
        },
        {
            "review_text": " Don't let the Steam user reviews fool you!",
            "review_score": "1"
        },
        {
            "review_text": "Fun zombie sandbox. I liked most of the missions and characters, I had a lot of fun tinkering with all the weird weapons, and I enjoyed the unique vehicles.  What I didn't like was how long the campaign dragged on. Especially the finale, that mission REALLY overstays it's welcome. There were some minor technical issues, but it's still a solid port.  Dead Rising 3 is stupid popcorn fun. If you're into that, go for it. Maybe play with a friend. If you're looking for a deep combat system or well-written story run far, far away from this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game with a vast open world to explore, with the bonus of getting to slaughter thousands of zombies with fun and creative weapons. The one bad thing about it is the price, but I would just wait for a sale if I were you.",
            "review_score": "1"
        },
        {
            "review_text": "I've started playing Dead Rising 3 with bated breath because bad reviews. BUT IT'S GOOD SCREW YOU ALL. SO WHAT IT RUNS KINDA BAD... SO WHAT",
            "review_score": "1"
        },
        {
            "review_text": " Don't let the Steam user reviews fool you!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Feels like a true sequel to the fantastic Dead Rising on the 360 controls great, though it has sub par graphics, so basically Dead Rising only improved, f I saw this back then my mind would be blown",
            "review_score": "1"
        },
        {
            "review_text": "Low settings, high settings... doesn't matter, it's still just a potato.  Fun though.  ",
            "review_score": "1"
        },
        {
            "review_text": "Assuming you have played another Dead Rising game, you know what you're in for.  Asssuming you have not, this may or may not be for you. If you're looking for a heart wrenching story driven game with epic twists and gnarly boss battles... unfortunately, Dead Rising as a franchise isn't for that. It's geared towards... killing zombies. Lots of them. As many of them as you can, actually, in ridiculous and over the top ways. That's the whole game, and the 'story' or 'side missions' run second to you smashing, slashing, stabbing, slicing, and sometimes, slutting (with a really... really big ding dong launcher) zombies to pieces. If you want ANYTHING but that, then don't get this game. Personally, I love doing all of those things to zombies, especially the slutting part, so I loved every minute of it.   The story isn't super long, so again, unless you're into small bouts of generally... killing lots of easy to kill monsters in humerous and over the top ways, maybe this isn't for you.",
            "review_score": "1"
        },
        {
            "review_text": "It's locked a 30fps, but you can add a note and unlock it. It's gets pretty buggy still but very playable, just random drops from 60fps. It's a fun game and if you can get it for cheap why not.",
            "review_score": "1"
        },
        {
            "review_text": "Dunno why this gets so much flak, it's amazing. First got DR3 on launch for the Xbone, loved it. Saw it was released on PC but held off getting it due to the 'issues' I'm not sure if Capcom fixed them or the reviwers were wingeing about nothing because this runs smooth as a black guy with sunglasses. Aside from how it runs, the game itself is ♥♥♥♥ing awesome. Loved Dead Rising since the first one on 360 and DR3 does not dissapoint, easily in the top 3 best zombie games out right now... don't think about it, buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Been having a blast with this, super fun, looks great (on i7 w. nvidia 980m). Have not seen any problems of crashes (17 hours so far). The plot is probably the worst part, the main character is kinda wimpy, but the goofy fun is there from previous versions and upgraded.",
            "review_score": "1"
        },
        {
            "review_text": "Great addition to the Dead Rising series! The game mechanics and play style is an extension of DR2 with more of everything (zombies, weapons and missions). Its what I have come to expect and love of about the DR games but this game does seem to be lacking the charm from DR1/DR2. Something about trashing a mall brings a bit more joy into my life. I wish there was a zombie hipster DLC so I could throw PBR cans and watch them chase after them. 7.999/10",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. Spending a lot of time on it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Just not satisfy with the 30 fps lock.",
            "review_score": "1"
        },
        {
            "review_text": "bought it on sales, ok, it played well at least as a XB exclusiove game after all.",
            "review_score": "1"
        },
        {
            "review_text": "Great addition to the Dead Rising series! The game mechanics and play style is an extension of DR2 with more of everything (zombies, weapons and missions). Its what I have come to expect and love of about the DR games but this game does seem to be lacking the charm from DR1/DR2. Something about trashing a mall brings a bit more joy into my life. I wish there was a zombie hipster DLC so I could throw PBR cans and watch them chase after them. 7.999/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, personally I haven't experienced any major issues besides the odd small bug here and there.  10/10 - Fun 5/10 - Story 11/10 - Combo Weapons/Vehicles 8.5/10 - Gameplay  All in all a solid game in the Dead Rising franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fantastic all around. Killing zombies with the variety of weapons and vehicles feels so good. Choppy cutscenes and maybe a glitchie boss or 2. Other than that no complaints.",
            "review_score": "1"
        },
        {
            "review_text": "While I can't speak much for the single player portion, I played through this with a friend and it's one of the best multiplayer experiences I've had (once it worked) in a long time - just non-stop laughs and fun. It only took us about five to seven hours to beat it as a team, but for what we bought it for during the Thanksgiving sale, absolutely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyable and the new game mechanics are easy to use on the go",
            "review_score": "1"
        },
        {
            "review_text": "Capcom only tested this on a few graphics cards. The drm for the game is not unwrapping itself properly into memory correctly on many graphics cards. Really poor effort from Capcom. I hope we can sue them to get our money back.",
            "review_score": "-1"
        },
        {
            "review_text": "BUGS, BUGS EVERYWHERE  Waiting for a patch that make performance better and take the bugs off  Esperando um patch que melhore performance e retire os bugs",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesnt work, stuck on loading screen and some missing files, dont even bother to buy it until they fix the game",
            "review_score": "-1"
        },
        {
            "review_text": "tl;dr: A massive insult to Dead Rising 2  A friend of mine and I bought this game, because we really enjoyed Dead Rising 2 and hoped to continue all the fun we had in the third installment of the Dead Rising series. -&gt; Hell, were we wrong. -.-  Pros: -&gt; The combo wepons are fun -&gt; The glitches in the physics engine are really funny sometimes  Cons: -&gt; Bad console port. The optimization that has been done for PC can only be a joke. It worked for me, but the friend I played together with, constantly had crashes, lags and screen freezes. -&gt; Bad controls in the whole game, no matter if you are on foot or in a car -&gt; The variety of combo weapons compared to Dead Rising 2 is a joke at best -&gt; The combo vehicles are totally useless. I mean some of them are fun to use, but they just break too fast. You drive for 2 minutes and your vehicle goes booom. -&gt; The protagonist is a little crybaby. Omg I hated this guy the whole time I played this game and actually didn't want to save him or his friends. xD -&gt; The story is too short. I played through this game in 17 hrs and did every mission that was there to do in the game. (Collectibles and stuff excluded. I don't like to do that.)  Conclusion: Sorry Capcom I cannot accept this as a worthy successor of Dead Rising 2 and it is totally not worth it's price.",
            "review_score": "-1"
        },
        {
            "review_text": "Be aware, this game has extremely high system requirements. I certainly understand why given the amount of zombies on the screen at any given time, but I can't help but feel there is some room for optimization there. At the very least if they are pushing for a Crysis style 'unattainable to most' they should do a better job of informing consumers. As I said, not a problem for me but something to be aware of.  The real issue is stability. I crash 10 min into every coop session I join. Every time. The latest patch #5 has not solved the issue. If you read the discussions on the forums you will see this has been an ongoing issue, among many others, since launch.   I am a reliability engineer with a healthy dose of OCD and I am militant about keeping a clean system. Everything is current gen and top of the line. I should be the picture of compatibility so I can say with absolute confedence that this is an issue with the game itself.  I purchased the game for coop, so this is almost a complete inoperable situation for me but for the fact that I can play as long as I host the game. Fortunately my coop partner doesnt seem to have the same issue so we have made it work.  Another issue is that the game refuses to detect the proper refresh rate on my monitor. Again, legitimate bug. Seems to be somewhat rare though, so we can call this one an edge case (unlikely you would encounter it). My only solution was to load the game on another monitor and find a lower resolution that detected properly so I play the game in 1366x768 rather than the 1080p my system is capable of. Annoying, but again not a complete loss.  Thus far the game itself has been enjoyable. I like the character progression element, weapon variety, and crafting systems. By far the best Dead Rising yet on content alone. Unfortunately I can't recommend this game due to the unresolved stability issues. My suggestion is to wait until it drops below $10, maybe then they will have sorted out the issues and if not you won't have lost much.",
            "review_score": "-1"
        },
        {
            "review_text": "I am having loads of fun with Dead rising 3, especially the co-op! To bad the game suffers from its bad pc porting. If you start up Dead rising 3 from scratch you will notice a cap to 30 frames, to change this you will have to add a user.ini file found when searched for in the webb. This file will uncap the framerate and allow you to reach 60FPS or higher. Although there is a way to uncap the frame rate, I have heard from friend/webb that the game still runs like ♥♥♥ on the majority of systems, surley I doged a bullet as I am not experiancing this horribleness on my config but it should be noted that the game needs optimization and that it should not require this kind of hardware to run 60 frames at max settings, but I digress, non the less the game still looks reasonably good and has some good textures on people and larger objects. It can be a huge blast at times and even greater when co-op and fooling around but until the glearing pc issues are atended to I would say stand back for a while unless you are really interessted or you have the horse power to obtain a constant 60FPS.",
            "review_score": "-1"
        },
        {
            "review_text": "The best thing about Dead Rising 3 is the zombies. Not so much the monsters themselves, but the vast hordes of them that populate the devastated city of San Perdidos. A single block might easily hold 500 of the monsters, and blasting (or, more likely, running) through the crowds is not only a lot of fun, but impressive on a technical level. And to think that just ten years ago computers were struggling to have ten monsters on screen at once.  Beyond that though, Dead Rising 3 rarely rises beyond mediocrity. The tone of the game is so off - a weird amalgam of the serious and zany - that it is difficult to stomach. The developers would have been better off picking one mood than trying to - unsuccessfully - balance the horror of a serious outbreak and mass death with weird psychopaths. And speaking of those psychopaths (who take the role of various boss monsters in the game), they're of the sort that make me embarrassed to be a gamer. They are so sophomoric that I feel like closing the door so nobody can see play this game when they are onscreen. I can't say I actually enjoy fighting them much either; too often they are 'gimmick bosses' where you have to constantly dodge attacks while aiming at their hard-to-hit vulnerable points to do them any damage. It's an old-school mechanic that I never liked and I wish it would finally die already.  The rest of the game is average. The variety of weapons and vehicles is impressive, although the vast majority aren't particularly useful. I could have done without the degrading weaponry too; constantly scrounging for new parts was an unpleasant grind and usually means I'm stuck with a gun or sword I don't like using for most of the game. I rarely found myself using a vehicle either; between the crowds of zombies and the obstacle-strewn roads, it was usually faster just to get out and run. And I'll never understand why Capcom gives players such a huge sandbox to play in and then limits them to only seven days to enjoy it (and they don't even let you keep playing after you finish the main campaign).  Dead Rising 3 is one of those games that on first impressions looks awesome to play, but having struggled through to the end, its an unfortunate mishmash of poorly realized premises coupled to an well-designed game engine. It was predictable to a fault and after the initial thrill became repetitive tedium. ",
            "review_score": "-1"
        },
        {
            "review_text": "Dead Rising 3 has stopped working",
            "review_score": "-1"
        },
        {
            "review_text": " Short Version  Put your seatbelt on and brace yourself for all the crashing because that's all this game does. ♥♥♥♥ Capcom!  My video evidence         YouTube™ Video:  Why You Shouldn't Buy @DeadRising 3 For PC!&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes every 10 minutes unplayable due to not constantly being saved and I'm unable to get anywhere without losing progress and having to completely restart the story. 0/10 until it is fixed",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game in Russian price(About 19€) Take a look what we got from XBOX ONE  30 FPS (Should fix) HOLY SH*T XBOX ONE, I LOVE YOU(not really)  Camera make me SICK! just like when you're drunk in a party (Should fix) -5/10 Should destroy it!   Thanks Microsoft",
            "review_score": "-1"
        },
        {
            "review_text": "I am a fan of the Dead Rising series, mostly for the personallity and heart this series has shown. Unfortunately, that heart is now gone. In the previous games you could interact with the people you saved and they would sometimes have missions for you, making it worthwhile to save them. Not so anymore, any followers you find will disappear once you get them to a safe house only to return when summoned. They have no personality, and any whepons you have given them are dropped when you switch companions, meaning you will have to arm them again when you call them back from the eather. Further, The map is no help at all, I went around a building three times trying to get to a safe zone that was clearly inside and could not for the life of me (or more acurately, the life of the survivor following me) find the entrance. This game has lost all the heart of the prevous games, and it is lesser for it.",
            "review_score": "-1"
        },
        {
            "review_text": "PLEASE READ!!! This based off price.  Okay what can I say about dead rising 3. First off EVERYONE loves killing zombies. That being said, for 49.99, it simple does not deliver a fifty dollar experience. Remember this review is based off MY own opinions. The game starts with you trying to find a way out of the city. Then zombies scare the living day lights out of you. At first I was pleased with the amount of zombies before me, then it got better. After a while I just laughed at the sheer amount of zombies around you. FUN RIGHT! It does get a bit boring after a while. You get to combine objects all over the city to make a wide range of weapons. This is the cool thing. I had alot of fun trying out each weapon I created and there was plenty to make. Costumes as well. Yet I found the story just so, dare I say...lame. For example some missions had a Saints Row mentality or a GTA that just wasnt placed well or made sense for what was going on. Simply, it becomes a grind. The player will do the same things over and over and over. The music is not anything great either. Basiclly it comes down to this. IF you like killing zombies...(100) and killing more zombies.....(1000) and more zombies....(10,000).......and even MORE zombies, then this game is worth your time and money. Like I always say, if its on sale EVEN BETTER! but you might have to wait a while. As always stay meaty",
            "review_score": "-1"
        },
        {
            "review_text": "Is this still in Beta?? seriously buggy game it crashes all the time!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game on pc is laggy as ♥♥♥♥ and can barely be played i would not reccoment buying this unless your computer is one of the worlds best, thats $50 im not getting back",
            "review_score": "-1"
        },
        {
            "review_text": "Please don't buy this game.  Does not work.  So many crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "Does not work at all on high end hardware and requires way to much horsepower to run at even 30FPS. This is a beta product by all accounts. Please read the forums and wait until the all clear is sounded (if ever) before spending your money on this product.",
            "review_score": "-1"
        },
        {
            "review_text": "It's games like this that make me wish Steam had a Okay button. The actual game? A really fun ridiculous edgy but not exactly serious time and dare I say best Dead Rising game in the entire series. Nick is probably the most likable Dead Rising Protagonist and I think the only other Dead Rising besides 1 where you can wear a Servbot head. The port? Just as awful if not more than that. Marking this Not Recommended as a warning to those with PCs that might not be able to handle it despite exceeding requirements. If you're up to the task and don't mind bad PC ports you should definitely go for it. It is a enjoyable game.",
            "review_score": "-1"
        },
        {
            "review_text": "LONG AND SHORT: NVIDIA System? Buy. AMD System? DO NOT BUY.  I purchased two copies of this game on release day, September 4, 2014, for myself and a friend. We stumbled through a collective 5 hours of trying to get it to run, over the course of a year since then, on and off. Our system specs are not at fault; twin HD6950 2gb's overclocked should be able to run this game at the bare minimum graphical settings at 800x600 resolution. An i5-2500k overclocked to 4.3ghz is not bottlenecking performance. My 250gb 840 EVO SSD isn't causing load issues.   The game was never optimized for PC, especially AMD. It wasn't at release, and not a single performance patch has been released since for AMD users.  The recent reviews page for this game is littered with similar complaints of poor PC optimization. The fact that almost a year has gone by and this game is still unplayable just isn't acceptable. I'm actually surprised Steam even offers it for sale any more.  All I want is my money back, in my Steam Wallet, so I can spend it on something else in the Steam Store for my best friend and I to enjoy, together.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy until it is fixed random game crashes gtx 780 classified sli",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable due to constant crashes. What I have seen is good, but wait for it to be fixed, Not recommended at this time. Sort it out and it gets the thumbs up.",
            "review_score": "-1"
        },
        {
            "review_text": "Finally got past the loadscreen by rolling my video drivers back, but dear gaben the games performance is atrocious. Completely unplayable, cutscenes are worse then a slideshow and the gameplay is slightly better.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not what i thoght it would be by a mile, The cpu usage is over the top and the graphics terable i think capcom got very lazy and just put some things together and put it out there but to be honest i was really thriled for this game but it failed to delever and i wish i could get my money back, so i recomend that you don't waste your money like i did.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't wait for the the next patch, hopping that I may actually play the game.  Stuck on the loading screen, and the I have to force quit it with task manager, but not only that.  After opening the game, my Laptop pretty much needs a restart, not sure why, but everytime I open the game, it just destroyrs my laptop.   If someone has any suggestion please leave me one, cause I did not spend money on this game for nothing.  P.S I know I need a new Laptop or PC so leave your ♥♥♥♥♥♥ suggestion about that.",
            "review_score": "-1"
        },
        {
            "review_text": "18 hours into the game, crashes, cant load my savefile. Thx CAPCOM 11/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Even though this review is 'negative' I still would recommend picking this game up when it's on massive sale.  The review is negative because :   - It's 16/032015 and FPS issues hasn't been fixed ( I haven't had any crashes during gameplay, so at least they have fixed that ) but FPS can go from 'slide show' to 50+... ( i have unlocked the framerate but even without unlocking it I had those problems ). - as far as the port goes optimisation is not the best ( albeit there is fair amount of options to choose from and keyboard prompts ( controls ) are properly displayed ) So that's a good thing :P  - game has darker more survival aspect which is fine with me BUT it seems that outfits are less creative and there aren't many of them, GUNPLAY SUCKS! You would think they would improve it but it's still 'arcadey'... run n gun. Who needs aiming right? Also not moded guns are seriously underpowered so some enemies feel like bullet sponges.  I wish they could implement RE Revelations 2 gun mechanics ( shoot a knee monsters fall down then melee finish him ) Head shots stuns them and causes massive dmg.   - I like the size of the map and no loading screens also, you can enter most of the buildings and explore ( I only had that kind of survival/exploration feeling with State of Decay but it feels WAY better in Dead Rising 3 ). Having said that Zombies feel uneavenly distributed some areas are very hard to push through while others will have you walking like its a Sunday stroll.   - Didn't like the bosses in this game at all :/ They feel sick and have some cheap moves. - Leveling up system is utterly crap. MOST of the things are PASSIVE abilities ;/ hate it. WHERE ARE MY MELEE MOVES? From Dead Rising Off the Record? They took a LOT of good stuff out T.T They should have made 3 skill trees so you can specify whether you want to be melee, ranged or combo/defense character. ( hey this is at least my opinion ).  So we have a game that tries to be serious and yet arcade gameplay / humour drags it down. I don't mind the silly stuff in the game but leave it up to the PLAYERS whether they want to fool around or not....   I would give this game 6/10 ( it deserves more BUT FPS issues are major annoyance ( i guess not everyone is experiencing it ?) Also XBOX ONE had a new DLC ( Super Ultra Dead Rising 3 Arcade Remix ) I kid you not. Apparently it's the best DLC from all of them... cos it's the one where you have most fun? Then again what do I know? I never played the 'NEW' dlc... just heard stuff....so Capcom bring it to PC.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage cant even see the game screen buyer beware on this ♥♥♥♥ PC Specs  Intel Core i5 4690 @ 3.50G RAM  8.00GB  Motherboard  MSI Z97 GAMING 7    4095MB NVIDIA GeForce GTX 770 (MSI)",
            "review_score": "-1"
        },
        {
            "review_text": "Game won't even start! My rig is above the OPTIMUM requirements but all I get is a black screen and forced to restart PC. What a waste of 50 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Welcome to Lag Rising 3 the game that has you lagging,crashing and any other problem that valve or gaben himself is taking too long to fix. until that time arrives please enjoy the fact you've wasted money buying the Lag simulator that was supposed to be Dead Rising 3.",
            "review_score": "-1"
        },
        {
            "review_text": "It started out fine and it does have a fun combat system. The voice acting and graphics are also great. Although near halfway through, the story just plummeted. I couldn't care about the characters in the story. They just seemed hollow and incoherent. At this point I started seeing a lot the game 'progression' turning into filler and busy work. All the back and forth over the bridge becomes old fast. Even under the influence of alcohol the last half still bored the hell out of me. That's pretty hard to do... If it were free I'd recommend it. Too much money for what it has to offer.",
            "review_score": "-1"
        },
        {
            "review_text": "People are saying it is not optmised for high frame rates, but I wouldn't know because my game was locked at 30fps. The best part is that ini frame rate unlock wouldn't work. At least the uninstall button worked just fine.  Here's some helpful advice to game devs. Stop putting frame rate caps on games!",
            "review_score": "-1"
        },
        {
            "review_text": "Best £40 I ever spent. The gameplay is a little too simplistic, so lost a point for that; however I'm currently super stuck on the the first boss {spoilers} 'dead rising 3 has stopped working'.  9/10 - Top banana.  /sarcasm",
            "review_score": "-1"
        },
        {
            "review_text": "This game is complete garbage!",
            "review_score": "-1"
        },
        {
            "review_text": "Awful port. Technical problems everywhere and terribly optimized.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is not worth buying until they fix the resolution issues. plays poorly. im trying to get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved the series up until this game. It's just... not good. Uninspiring. Unoptimized. Wait for a Steam sale and get it at 80 percent off of more, if you want to experience it. Otherwise, just move on and put a nail in Capcom's PC division.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game after looking at the requirements and didn't bother to read the reviews.  This game worked fine from the start. Played a few missions then went to bed.  Next day, start playing it, crash.  Start up pc, game works, play a little, crash.  Start up pc, start game, get pass the start screen, crash.  start up pc, start game, continue, loading screen, crash.  ^^^^^ Repeat last action = story of my life when it comes to this game.  My reccomendation, don't buy until you read the patch notes and they say they've worked on optimization. I can run DayZ, Arma 3, Battlefield 4 fine so this game shouldn't be a problem. But it is. And the devs don't seem to give a ♥♥♥♥ either.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes within an hour, no auto saving means you must replay the last hour, especially in nightmare mod. Runs fairly smooth until it crashes, all troubleshooting steps are complete nonsense. I've only heard it working using Intel HD graphics. Downgrading to the older Nvidia driver made it last longer before crash, but still eventually crashes. A bunch of quests are also broken, like a boss not existing where he should be. By default the game is locked to 30FPS, you have to turn off vsync, or make your own ini file. Graphics are good, but the story is generally the exact same as the last 3 game, [besides not including any underage characters]. I had reviewed the product before, but I accidently deleted it. If you really want the game, it's $22 from Steam [cc=] Ru. other wise wait until it's fixed and in a humble bundle. I'm also disappointed there was no pre-order/early bird reward for pre-purchasing. Spoilers: The game was great, but to get into more detail, the most enjoyable parts were refrences and cameos from the other games. Isabella Keyes from Dead Rising 1 returns, with ending S you will see she started the outbreak within Los Perdidos, in order to find Nick[Player]. As he's the cure. You also learn Nick's emo crush [Katey] is Chuck Greene[Dead Rising 2's player]. There's also the museum showing all previous protagonists... My least favorite things in the game are:It was too easy, I was never able to complete Dead Rising 1, this one I completed With half a week left. lso the comedicscene is getting a little washed up. This also lacked drama and there was no purity in the plot. It was a lot of collectibles, kill zombies, and stare at cameos.",
            "review_score": "-1"
        },
        {
            "review_text": "i can't believe i actually thought i could play this the day it comes out, little alone, the first week its out. way to #$@% the bed and roll around in it lol. seriously, why ever release the game?!",
            "review_score": "-1"
        },
        {
            "review_text": "fun until you want to play co op, and spend hours ripping your hair out on bugs that lead to even more freezes and black screens than in singleplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "I like how it doesn't work, me and my friend played about 20 minutes and the rest was us trying to fix the game. Good Port/2",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, the game is locked at 30 FPS, which is unacceptable for a PC game as far as I'm concerned and although there's a way to remove the cap, it destabilized the game for me and caused it to crash on multiple occasions. Plus, I was still seeing constant frame drops and hitches even when I was running the game at 480p rendering resolution, which is disturbing to say the least.  Performance problems aside, the actual game is pretty difficult to recommend as well, unless you're very specific about what you like about video games. If you think you're going to like killing the same type of zombies over and over again with very similar types of weaponry (except for a few combo weapons that don't feel much different but at least look somewhat unique) in a very drab and in my opinion boring setting, you might like this game.  My experience with the series have been a complicated one. I had played the first game when it first came out and loved it at the time. Looking back at it, I now see that it wasn't a very good game, but it felt very different at the time and to be honest there wasn't much else to play. I was very excited to play the second game, but the sequel had failed to impress me and so did the standalone side stories that were released after Dead Rising 2, so I decided to wait for a discounted price when Dead Rising 3 was released. I bought the game at a %50 discount, and I'm still disappointed.   Unfortunately, this is not a very good game so far. I might keep playing, but I doubt my opinion of it will change.",
            "review_score": "-1"
        },
        {
            "review_text": "Just lost my entire game progress, so play at your own peril. 30 hours of gameplay gone, with all the weapons, blueprints etc. Otherwise I had fun playing it but can't really give this a thumbs up, this is inexcusable. I'm not alone on this, so disable steam cloud and keep a backup of your save game, at least that seems to be the general info out there.",
            "review_score": "-1"
        },
        {
            "review_text": "do not get this game till they patch it fully i bought the game and a when i played it the start up said capcop then to dr3 and stayed that way with out loading under it someone pls help",
            "review_score": "-1"
        },
        {
            "review_text": "This is probably the best Dead Rising game in the series but it's held back by a terrible port. Technically the game is a total mess. I haven't had it crash on me yet but the frame rate has dropped as low as 1fps (on minimum possible settings) on many occasions (especially during cut scenes), objects pop-in even with LOD maxed, shadows glitch, random low-res textures are everywhere and the physics glitch alot too. Playing this you really get the feel that they were trying to make the best zombie smashing game ever but didn't give two ♥♥♥♥♥ about how well it would perform. And, from what I've read, this isn't a pc only problem either. The shaved-down monkeys in Capcom's quality control must have been drunk on fermented bananas when they approved this.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope, Spent 30 dollars on a useless game. Crashes every 3 minutes. Waste of money... Well done CapCon.....Well done",
            "review_score": "-1"
        },
        {
            "review_text": "I have a starter's gaming PC and it still stutters and the frame rate may drop to 6 on zombie infested areas.  Long loading screens, way too long. I was running on minimum settings. Good thing we have the refund option these days.",
            "review_score": "-1"
        },
        {
            "review_text": "Game always crash . cant progress , id ask for a refund but the world isnt a place where u can get money back when some thief scammed you  gameplay 10/10 but always crash and unable to play for more than 5 mins  so a big 0/10 , waste of money , when they will fix it , it will be 20$ so just wait",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game, it is unplayble , I can't have a stable 60 fps with my 2x r9 290 ,one of the worst console ports on PC.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is problably good. And I would be saying yes it is good if the port didn't have the performance of what seems like an artheretic hamster in a wheel. Using this port has a similar experiance as deep throating a cactus.   I'll discribe my experiance with this game like the begining of the game itself.  Yesterday 19:00 Saw gameplay of Dead Rising 3. Looked amazing. Desided to purchase with steam wallet  Yesterday 21:00  Purchaced game  Yesterday 24:00  Download wasn't even half way compleat. Went to bed  Today 7:00 Download complete  Today 4:30 Started game. Noticed it wasn't a perticuarly good port, but I could look over it.  Today 5:00 First crash, Parshal way through the second mission  Today 5:05 Force restart of computer  Today 5:10 Changed settings a bit. Graphics still look spiffy  Today 5:12 Second crash and force restart  Today 5:17  Changed settings again. Game now looks like it runs on a pineapple  Today 5:19 Third crash and force restart.  Today 6:00 Applied for refund    Conclusion: Glad I spent 50 ♥♥♥♥ing dollars on this. Get dying light instead. Isn't as good, but the port isn't ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is unplayable due to the low fps rate have a i5 4690k r9 390 8G 8G of gddr 5 ram  and with everything on low specs the fps tanks below 25fps such a bad port",
            "review_score": "-1"
        },
        {
            "review_text": "Welcome to the Crash-ithon!!! In this weeks Crash-ithon we will be featuring Dead Rising 3! This game includes crashing at the loading screen! But wait there's more! Restarting your computer because you can't close the game is one of thos exclucive features you won't want to miss, with this special package!!!! So don't forget to not get this game until a patch!!! Thank you all for tuning in to this weeks Crash-ithon!!",
            "review_score": "-1"
        },
        {
            "review_text": "I would recommend this game only for high end machines as the pc Im currently operating is high end and the game still has many many problems. Its a port and its a bad port... I found certain bugs such as you cannot load another game before loading this game, this sounds insane running on an i76700 16g ram and a Radeon r9 390x. I don't even know the reasons why some of the bugs happen or why you can't load a game before loading this.. simply put bad port.  But other than a bad port the humor of this game is top notch and playing with a friend adds many hours of fun. If you enjoy insane weapons and silly outfits, might I suggest the Bananna hamock for pure aesthetics (humorous for the ingame cutscenes).   Pros - humor - hours of zombie smashing - actually a great game  CONS - bad port - cannot load a game before loading this game (have no idea why as this machine plays everything in ultra high and never skips a beat) - although there are resolution options for 2560*1080p they actually dont work (needs a fix, although flawless widescreen does work)  I would recommend this game for zombie smashing fans if you have a high end machine as this game runs good for most of the time. It does seem however this is a money grab and no thought has really been given to help it run on a pc, even on high end machines.   ",
            "review_score": "-1"
        },
        {
            "review_text": "PLEASE DON'T BUY THIS GAME!  I got this game for £12 in a sale and expected it would be a laugh to play with friends. Framerate is very very bad for a game with incredibly average graphics. I get 20fps more than once in a minute, on my i7, gtx770 and 16gb of RAM. Game is also locked to 30fps, the resolution is basically upscaled 720p and the graphics settings are almost non-existent. The game is terribly optimised and simply the worst PC port i have ever played.  It's embarrassing that i actually bought this horrible excuse for a game. I might've given it a try, but the horrible optimisation, long load times, buginess and awful controls let it down. I submitted a refund request after playing for an hour.",
            "review_score": "-1"
        },
        {
            "review_text": "game would be better if it were made in the 90s",
            "review_score": "-1"
        },
        {
            "review_text": "I would reccomend this. but it has way to many bugs. It's not fully finished and there are so many problems like crashing,framerate loss etc.",
            "review_score": "-1"
        },
        {
            "review_text": "I meet the recommended requirements and I can't play this game because of the lag and stuttering, hickups and can't manage to get past a mission without my game freezing and crashing after few minutes of gaming.  Once I managed to play for few minutes without my game freezing and crashing and guess what happened? Map and textures didn't load and I fell through the map... 11/10 best 50 Euros spent  ",
            "review_score": "-1"
        },
        {
            "review_text": "It's definitely a solid game, but virtually unplayable at the time of writing this. I know they are 'working' on a fix, but honestly who knows when that will be. 3/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Frequent crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "The epitome of casual zombie shooter... Pick things up, mash attack button, success. The plot is chaotic and makes little sense. The plot points are conveniently placed to keep the story rolling down the hill. Very little character development. I would return this game if I could. Could have spent that 44 bucks on beer or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible Laggy Game Recommend Not To Buy Until is completely fixed",
            "review_score": "-1"
        },
        {
            "review_text": "i love it had no problems then i got to the battel in the gym i beat the level and saved and exited and now the game won't open",
            "review_score": "-1"
        },
        {
            "review_text": "Unlike other reviews here, I haven't had a single crash in the 10+ hours I've been playing DR3. But I still wouldn’t recommend the game. It’s certainly the prettiest of the series, but now that i'm into the fifth chapter I have become disinterested in going on. I don't even know how I lasted this long. As a fan of the first two instalments, I found DR3 to lack that sense of urgency that made the other games so compelling. The main protagonist and the supporting cohort of NPCs are banal as are missions which are basically a collection of unimaginative go to and fetch quests. Psycopath and boss fights are also uninspired. Give it a miss.",
            "review_score": "-1"
        },
        {
            "review_text": "As much as I want to say I love this game, it's poorly optimized for PC, the controlls are decent, but even with the reccommended hardware it's still prone to running slow, not evee reaching the capped rate of 30FPS, and not at the listed settings. Unless the devs fix the performance, and crash issues, don't bother spending the cash.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get this game till they sort out the problem with Nvidia cards. To play you have to downgrade your graphics drivers, the version I can't remember.  If you don't use these cards, then by all means, purchase, it's an awesome game.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the game but is almost unplayable due to constant crashes every few minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "DOES THIS SEEM AT ALL LIKE WATCH DOGS?! SRSLY I ANT MOVE WITHOUT MASSIVE LAG! make the game run more smoothly  and make it compatible with 32 bit systems and i will change this -0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "There was this unbeatable boss called LOADING SREEN. To get to the boss I would always launch the game but could never beat it and get past it IGN: 'Its okay' 11/10 'Like Skyrim With Loading Screens'",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is fantastic on Xbox One and as such, I expected no less for the computer port, HOWEVER, we're presented with an unprepared port once again that presents itself at low intervals of optimisation to the point where even LOW QUALITY settings have a rather difficult time keeping pace with the game itself at framerates that drop to around 15-20 FPS. Nonetheless, we hopefully expect this game to be fully patched and have the capabilities of being optimized to the point where it is playable on any sort of based scaling of quality and operating systematics.  それがあっても低品質の設定は持っている点への最適化の低い間隔で自分自身を提示したが、私たちは再び準備されていないポートを提示されている、ゲーム自体は、Xbox One上で素晴らしいです、そのようなものとして、私は、コンピュータポートにはあまり期待できない周り15-20にFPSをドロップフレームレートでゲーム自体のペースを保つことなく、困難な時期。それにもかかわらず、私たちはうまくいけば、このゲームは完全にパッチ、それは品質と操作系統性のベーススケーリングの任意の並べ替えで再生可能な場所のポイントに最適化されているの能力を持っていることを期待しています。",
            "review_score": "-1"
        },
        {
            "review_text": "The game is unplayable even on high end systems. I have a $4000.00 Alienware, who should run this like nothing. I've never had an issue with any games on steam before, but the frame rate on this game is just broken. Random crashes happen every 5 minutes and cutscenes will not play.  Buy at your own risk,",
            "review_score": "-1"
        },
        {
            "review_text": "Dead Rising 3 is AWESOME, but don't buy it yet..  The game needs some major crash fixes! I can't play it for more than 10mins at a time without crashing.  Anyways, i won't recommend this game untill the crashes have been fixed!",
            "review_score": "-1"
        },
        {
            "review_text": "great game, but has bad graphic glitches and horrid online connecting problems.",
            "review_score": "-1"
        },
        {
            "review_text": "gameplay is good but the optimization is TERRIBLE",
            "review_score": "-1"
        },
        {
            "review_text": "Worst waste of money I spent on a game    Of the 5 hours I spent in the game at least half was spent on loading screens and slow as molasses cutscenes. At the highest graphics or lowest graphics it is the same framerate and the game stalls and stutters. The worst conversion I had since Resident Evil: Code Veronica on the PS2 still kept the control scheme in the tutorial from the dreamcast (are we surprised, it's another Capcom game). It also screws up my computer while I play it since it seems to suck up all of the attention of my computer. Will not buy another Capcom game off of steam again. 2/10 just for the potential it could have had from the XBONE. What a Joke.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't believe you haven't fixed this yet. People paid quite alot for a game that doesn't work at all!",
            "review_score": "-1"
        },
        {
            "review_text": "I want to refund this ♥♥♥♥ game. This is Dead Crashing 3, All you can feel is crash after crash. F.u.PCOM!",
            "review_score": "-1"
        },
        {
            "review_text": "When I heard about Dead Rising 3 was going to an X1 only I was like 'really' but when I heard it was coming to the PC I was happy about it and pre-order the game and them I realize it was a poor port to the pc frame-rate drops bland graphic and really bad performance for a port other games like Devil May Cry 4, Metal Gear Rising and Castlevania Lords of Shadow were great ports to the pc but Dead Rising 3 was not, plus the gameplay gets dull sure killing zombies is fun for 30 mins then it gets old fast. Get Dead Rising 2 off the records instaid you may have more fun in that game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game stuck on loading screen if I use my NVidia graphics. If I use my horrific integrated graphics, it works but is so laggy it is unplayable. Really bummed out as I was very much looking forward to this game on PC. Hopefully a patch to fix it comes out soon, or I will be asking for my money back. I find it ironic that this weekend they are having a huge Capcom sale. There are lots of games in the sale that I would love to buy (but only at the sale prices) but I am really not thinking that is a great idea since capcom obviously doesn't care to make sure that porting a game to PC works. I guess i'll go spend some of the money I would have spent on the Capcom sale, on fable Anniversary. Wait it's not capcom is it?!",
            "review_score": "-1"
        },
        {
            "review_text": "I could not be more disapointed in this game. What a shame. Console-Style Tutorials every 3 seconds and linear levels. Oh, and the weapons STILL break...a crowbar can break from flesh? Really? No thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "As of release game doesn't run. Attempting to start the game brings it to a black screen which does nothing until a CTRL + ALT + DEL gets out.  And then it crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "ME AND MY FRIEND CAN'T JOIN EACHOTHER, DONT BUY!",
            "review_score": "-1"
        },
        {
            "review_text": "Too much of a hype, game was not that fun.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun game. The whole creating weapons and killing tons of zombies is great. The graphics are good, gameplay is fun, ya know, the whole shabang. It also has so many problems though. Like when I waited for 20 minutes trying to get into a coop game and had the game crash on me during the loading screen four or five times. After finally getting into a game, I play with the guy for a little bit, and then the game crashes. Great. Woo. Rinse and Repeat until you give up. Also, in my experience, when it crashes, it saves your plot but not your inventory. I lost quite a few boss weapons from this. Quitting the game just leaves a frozen screen up until I crtl + alt + delete out. The game also performs rather badly, going anywhere in between 20-60fps at any given moment. I am not going to recommend this until it gets some sort of performance patch.",
            "review_score": "-1"
        },
        {
            "review_text": "10-20 frames per second with frequent fps drops that chop up my gameplay up to 5 seconds at a time. ♥♥♥♥♥♥ optimization. Or is there even any to begin with?  Frequent crashes to desktop.  Game takes 30 seconds to load up the start menu.  Graphics are ♥♥♥♥ for something released near the end of 2014.  FPS drops DURING CUTSCENES.  POS GAME DO NOT BUY YOU DESERVE BETTER",
            "review_score": "-1"
        },
        {
            "review_text": "You want glitches? We got 'em! You like massive slowdown when the screen gets busy? You got that, too! You like entertaining, original and funny gameplay? Yeah, not so much.  Take the first 2 DR's, merge them on a map that's both much larger and yet oddly more restrictive, water down any of the fun parts of them and then polish those crappy bits to a high shine and here's Dead Rising 3. And don't forget to really do a woefully bad job of the port, and don't optimise a single thing in case you make some small aspect of the game pleasant to play.  Truly Capcom, you've excelled yourself. For Dead Rising 4, may I suggest you skip the whole 'program a game' nonsense and just put a turd in a video game box and sell that instead.   Oh, and for the record, it hasn't crashed once. More's the pity.  Games like this are why Steam badly needs a refund policy. It is woefully, inexcusably bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is unplayable on my high end system, did unlock the frame rate already and it still skips",
            "review_score": "-1"
        },
        {
            "review_text": "Currently this game is extremely laggy and it seems that the devs has just abandoned it, maybe if it has another update to fix these problems I would recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Dead Rising 3 is a hilarious ballet of game-breaking technical failures composed on the back of a napkin. Four months after its release on the PC the game still rewards anyone with the audacity to have the latest nVidia drivers by crashing to the desktop every 5-10 minutes of gameplay, and features netcode that somehow manages to be completely flabbergasted by both insignificant differences in graphics settings between users and Steam player names which do not conform to the Xbox Live Gamertag format, resulting in inexplicable glitches or outright crashes. Review any Dead Rising 3 forum and read the same.  If this were an independent developer's first foray into multiplayer gaming it would be unfit for release; that a multi-million-dollar game development juggernaut allowed this to escape the development floor is a 10-story monument to their laziness and greed, and a testament to their complete disregard for their customers and the final quality of their products.  This is an Xbox game hastily shuffled onto the PC that then relies on its source material's code to run and its reputation to turn a profit before PC customers realize the error they have made. This game would be a rip-off in the &lt;$10 bracket, it is a joke at its current price point.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty sure I paid half the steam retail price for this game and I still regret it. The game itself is pretty good fun, especially with a friend. However it was far too short and was way too easy to play through. In my opinion I still prefer the original Deadrising game to any of the later games",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay is nice, I gotta say I am a little bit dissapointed, the game on PC, is not well optimized and this is very unfortunate, Let me just say that this game was built for console, only. if you have a console, than buy it for your consle. :9",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't wanna believe the negative reviews about the poor optimization but unfortunately they're true. I can run most games on the highest settings just fine with no lag but this requires me to use the lowest settings and still lags like hell. It's a shame because gameplay-wise it's actually a really fun game, better than DR2 although DR1 will still always be my favorite.  Pros:  +Open World instead of just one mall +More combo weapons +Combo vehicles +Unique and sometimes funny bosses +Survivors are a little more usefull. Kinda. +Relatable main character +Overall fun gameplay (If you have the capacity run it) +Co-op makes player 2 a bit more useful and relevant than in previous games  Cons:   -Good luck running this even at lowest settings -Lag Rising 3 -Despite being more usefull, survivors are still annoying and get in the way -Some survivors will make you run errands all over the map, only to tell you 'Thanks, but I'll take my chances on my own!' and run off after you've spent 30 minutes helping them and expecting to gain a survivor -There's a command menu to command survivors to attack, follow, and scavange, but no option to tell them to wait somewhere in the corner (despite it being an option in the other DR games) while you handle a surprise boss, forcing you to babysit them the entire boss fight -You do not have the ability to close doors after opening them (again another simple feature taken out despite being in the original DR games which is really odd and confusing)  -Already mentioned several times but the lag is just so god awful in this game that it sometimes makes combat impossible, resulting in your character swinging and shooting in random directions while a zombie eats you -LAG LAG LAG FREEZE. Did I mention this lags?",
            "review_score": "-1"
        },
        {
            "review_text": "love zombie games, however got a little linear and silly. Try state of decay instead.",
            "review_score": "-1"
        },
        {
            "review_text": "it doesent really work, It just opens as a black screen and crashes",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Well, as a fan of the dead rising series i think the gameplay is great as always. Its really fun to slaughter the zombies with all those new combo weapons. Also i like their is less time pressure compared to the old games.  Cons: But the performance of this game is just horrible. I didn`t found a way to fix this. After some time of gameplay it always starts to lag as hell. It`s not my computer, i have a really powerfull machine and can run all other games i own at highest setting with a nice framerate. Dead Rising 3 is just really poorly optimized - a very bad console port.  Summary: So the game itself is really fun to play, but it`s unplayable at this state.  I can not recommend anyone to buy this. Even when it`s on sale (got it for 15$) it`s not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "when i spend money on a game i appreciate that said game actually works. game is just stuck on the loading screen. If this review shows a playtime take note that al of that time was just sitting here waiting.  DONT WASTE YOUR MONEY. thank you.  -park",
            "review_score": "-1"
        },
        {
            "review_text": "Great game , But i had trouble on killing zombie and finish the side quest !!! it was so lag in this game and it was all because of the POV and FPS is causing a lot of us to play the game . I Do Hope they fix all of the problem in the next patch!!! ONE MORE THING IS THE MOST ANNOYING THING IS THAT PEOPLE PM YOU AND YOU CAN'T EVEN PRESS SHIFT TAB TO SEND TO THAT PERSON !!! PLEASE FIX IT FOR THE LOVE OF GOD!!",
            "review_score": "-1"
        },
        {
            "review_text": "Great game , But i had trouble on killing zombie and finish the side quest !!! it was so lag in this game and it was all because of the POV and FPS is causing a lot of us to play the game . I Do Hope they fix all of the problem in the next patch!!! ONE MORE THING IS THE MOST ANNOYING THING IS THAT PEOPLE PM YOU AND YOU CAN'T EVEN PRESS SHIFT TAB TO SEND TO THAT PERSON !!! PLEASE FIX IT FOR THE LOVE OF GOD!!",
            "review_score": "-1"
        },
        {
            "review_text": "no the game crashes all the time so dont buy it if you have a old thing",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, now if only it ran for longer than 30 mins at a time...",
            "review_score": "-1"
        },
        {
            "review_text": "Initially, the game is fun as your run around and hack away at zombies. But as soon as that novelty wears off, you are left with a very shallow game with a mediocre stories and repetitive quests. All the side quests seem to be either 1)fetching items for people or 2)killing a psycho. Even the main story is essentially traversing from cutscene to cutscene. I got bored very quickly with the game and just hurried my way through the unfulfilling main story so that I could check this game off my list.",
            "review_score": "-1"
        },
        {
            "review_text": "cant play it on my computers -_-",
            "review_score": "-1"
        },
        {
            "review_text": "Bad PC Port. Stay away still not fixed and crashes non stop.",
            "review_score": "-1"
        },
        {
            "review_text": "Game itself is great with alot more territory to cover but does not support SLI and even with the arkahm origins SLI compatibility bits the game still runs slow on my alienware 18 with dual GTX 770m's. Until this game is patched/properly optimized don't buy this game. When and if it changes i will edit this review.",
            "review_score": "-1"
        },
        {
            "review_text": "First half; Super awesome second half; OMFG ZOMBEES GET AWAY",
            "review_score": "-1"
        },
        {
            "review_text": "worst peice of sheit. direct port from the xbox one. PLEASE DONT BUY IT!! PLEASE PLEASE PLEASE, ITS A WASTE OF MONEY, THE DOWNLOAD TAKES LONG AS BALLS. PLEASE JUST DONT DO IT!",
            "review_score": "-1"
        },
        {
            "review_text": "Beat an old man to death with a chainsaw, where he then proceeded to kill himself.    And then the game crashed..  7.8/10 too much crashing.",
            "review_score": "-1"
        },
        {
            "review_text": "the amount of zombies on screen makes fps very low",
            "review_score": "-1"
        },
        {
            "review_text": "They ♥♥♥♥ed it up. I cant get past the first level its so laggy i have the x-51 alienware and I cant even comprend how much of a ♥♥♥♥ up this is.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent game, abysmal port. This doesn't even look like an eighth gen title yet it runs worse than some of the most stunning games on the market and cutscene framerate gets extremely choppy for no real reason even when the game runs fine. It also just feels a bit unresponsive and, while I know the Xbox version of this came out first, after Dying Light this just isn't a good enough zombie game. Why play a game with unresponsive controls and passable mechanics when you can have something sublime? The port is the biggest issue, though.",
            "review_score": "-1"
        },
        {
            "review_text": "Would be a half alright game if it wasn't a terrible port  Absoluteley disgusting",
            "review_score": "-1"
        },
        {
            "review_text": "if i have intel 4600 hd i couldnt even run the game on low grahpics you should conseder it serusly! i can run watch dogs and battle field but this game i cant",
            "review_score": "-1"
        },
        {
            "review_text": "Help everytime i open it it comes up with a black screen and when i open task manager it says its not responding please help?",
            "review_score": "-1"
        },
        {
            "review_text": "had to issue a refund after 45 minutes because of the unfixable -30 FPS.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels like a port. Controls+camera and menus are awful.",
            "review_score": "-1"
        },
        {
            "review_text": "good for a few hours but pretty boring and really easy to become o.p havent tried it on its hardest difficulty but in normal its so easy to become unstopable its not even funny.",
            "review_score": "-1"
        },
        {
            "review_text": "Weak story. Really boring and repetitive, forgettable characters. Just get DR1 remastered and DR2 OTR , much cheaper and better",
            "review_score": "-1"
        },
        {
            "review_text": "worst port ever disgusting should not be allowed to be sold. waste of money. DO NOT BUY!!",
            "review_score": "-1"
        },
        {
            "review_text": "Literally unplayable with an unlocked framerate. The game breaks whenever you zoom in with a weapon or try to use the weapon wheel. The performance is terrible, it looks awful, the fov gives me a chronic migrane. This is a horrible nightmare mess of a PC port.",
            "review_score": "-1"
        },
        {
            "review_text": "-Got the game . -Played it and really loved it. -\\'Let\\'s unlock all achievements, shall we ?\\'. -Started to beat many challenges including the awful PP trails. -One day I started the game I found : \\'compilation progress = 0%\\'. -Everything went to zero for no reason!!! -Got raged. -Uninstalled the game. -Not recommending it .  It\\'s really shame to see a great game like this got these types of BS in 2015 , and apparently Microsoft not welling to fix it.  If DR4 became a thing i will never buy it unless if there was no technical glitches like we have it here.",
            "review_score": "-1"
        },
        {
            "review_text": "Save your money if you don't tolerate or support bad PC ports. Not only does this software demand and tax more than is necessary, it also lacks fundamental necessities of a half decent port. FOV is locked at a sickening 47 degrees, controls are very clunky and the game doesn't even fully support widescreen. It reeks of a botched port.",
            "review_score": "-1"
        },
        {
            "review_text": "I love every open world game where you can do whatever you want and just ♥♥♥♥ around. This game is almost one of those games, but you always have time on your hand and if you dont do all the missions in like 2 hours the world will be destroyed with a gigant nuke...",
            "review_score": "-1"
        },
        {
            "review_text": "crashes, slow.",
            "review_score": "-1"
        },
        {
            "review_text": "just get it on xbox because the 30fps lock on pc is a ♥♥♥♥♥♥♥ i n g joke [i know there are fixes but i am in the small persent of people that cannot fix it] gmpcr_unlock_frame_rate=True didnt fix it at all",
            "review_score": "-1"
        },
        {
            "review_text": "bad pc port         YouTube™ Video:  Dead Rising 3 PC Unlocked Frame-Rate Tests (Core i5 3570K at 4.5GHz/GTX 780)&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "dont work on windows 10 trash",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game For the first 2 hours but it crashed while i was in game then tried to continue my save game now it wont even load i had to ctrl alt del to close it tried 10x+ to continue my save now i cant even play it even coop also crashes",
            "review_score": "-1"
        },
        {
            "review_text": "The game play itself seems super fun. No question. If it runs well for you and you like this type of game, you'll enjoy it.  That said, I have a mid-range computer (I certainly play other FPS without any trouble!) and even on a significantly reduced resolution with graphic options turned way down ... this game just turns into a slide show at times. Absolutely unplayable.  It's games like this that make me wish Steam offered refunds.  Recommendation: Try the demo first (if they have one - I should have checked and didn't); if it runs nice and fast you're probably good to go. If not - stay far, far away.  ",
            "review_score": "-1"
        },
        {
            "review_text": "While I did enjoy this game quite a bit, it was pretty poorly optimized for a PC port. GTA 5 runs better at higher framerates w/ max settings than this game does at 30fps on fairly good hardware (GTX 970, FX 8350, 16gb RAM). It's a shame Capcom stopped supporting this game last October. With a few more patches, I believe this game could have been much better, but it seems they just gave up on it. I'd only recommend getting this game if you're a die hard Dead Rising / zombie fan like myself. Otherwise don't bother. I attempted to re-install this game to see if it'd be fun to play again but I immediately uninstalled it again.  6/10, would uninstall again.",
            "review_score": "-1"
        },
        {
            "review_text": "ok, its fun. quite fun. except, 50 DOLLARS FOR THIS!!!!!!!! what i mean is,i like it, yet i dont like it. if you do stuff, you end up getting clothing. in the end, that completely messes it up! here are the problems: 1: glitched clothing. 2: i got on one day, and everything dissapears! 3: you WILL get your saves out of hand, that means you have to save!  4: ALMOST NO AUTOSAVE! now here is the good: 1: good dialogue. 2: full controller support! 3:xone port! {go buy that port... just kidding} 4:multiplayer [bugs] all im going to say is.. dont buy the pc port. buy the xbox one port. (just kidding again) and all of this for 50? not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is fun but the support is horrible. Ever since launch I was not able to play this game unless I made a fake image of my F drive to C drive. I thought, ok well it's release so I'll give it some time. I leave to go play another game for a month and come back to it still be broken. If a month goes by and they still don't fix important factors such as this, I don't support this game or company at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm barely even able to play this game due to all the crashes. Up to patch three so far and still not stable enough to even deserve a public release. I wish I could review the game-play, because it looks fun, but I've spent more time trying to get it to work correctly than playing and it just isn't worth it anymore. Very poor show from Capcom.",
            "review_score": "-1"
        },
        {
            "review_text": "If I ever buy a game from Capcom in the future, I will eat my mouse and keyboard. People talking about how EA or Activision is bad, but frankly I find Capcom is the perfect example of how crappy and irresponsible a company can be.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to know how do I get my money refunded into the steam account for the game Dead Rising 3 it does not even work.",
            "review_score": "-1"
        },
        {
            "review_text": "bad game here in pc",
            "review_score": "-1"
        },
        {
            "review_text": "this game gust pops up then crashes for me",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesnt run passed the opening and just crashes over an over agian. Luckly i got it 80% off so i dont feel so bad since it really is a horrible PC port.",
            "review_score": "-1"
        },
        {
            "review_text": "You know, this is kinda BS, I bought this game when it was first available for 60 bucks and after so many updates they have done it is still unplayable for me, I have all the graphics and settings set to low, no downloads or anything going on in my computer while playing it and it still runs so crappy. Therefor I have hardly any hours logged into this game. Im kinda ♥♥♥♥♥♥ that it still hasnt been optimized and it been a while. Not recommending this game to anyone until this broken game is fixed (oh and btw apparently it works for only a certain few coputers which is asinine, or so I heard, so dont think my review is stupid because you dont suffer the same issue, just you were one of the lucky ones and I wasnt.) PLEASE FIX THIS GUYS!  -All in all from what I gathered from the gameplays I have watched though this is a good game with things such as: Customizable character costumes (say that five times fast, I dare you XD) -A fun variety of weapons from your basic wrench to a fire-breathing dragon head with rocket boosters or a teddy bear you push around on a wheelchair wielding two machine guns (which seems pretty kickass to me!) -Vehicles!!!! You can run them over in a steamroller, or just bash into them on a little scooter! XD  thats about all I have noticed (sorry not mut 'research' was put into this review as I have not been able to really play it thus far as can be seen above as my hours logged into this was 2 in total, 1 1/2 was waiting for the intro to finish and other 1/2 hour was trying to play the game unseccesfully (but I tried, and what I was able to do was fun, though extremely laggy and slightly irritating.)",
            "review_score": "-1"
        },
        {
            "review_text": "crash for radeon R9380 please patch in coop and only in co-op!",
            "review_score": "-1"
        },
        {
            "review_text": "Never worked well. Checked many times the requirements and I have them all. Asked for help and received it but still never made the game work well. It didn't crush, but it just works very poorly, the character reacts really slowly to the buttons.",
            "review_score": "-1"
        },
        {
            "review_text": "I have no trouble at all with game except performance dips mid gameplay without any reason. That being said all of my friend playing on gaming PCs can't even start the game because the game simply does not support Nvidia Optimus technology. I still see no fix and I don't know if there will even be one.  Until it is patched I cannot recommend that you buy the game.  To the gameplay itself now : it is fun, I've never played any Dead Rising game before and find it refreshing. I like the progression system even if the time limit can sometimes sap the fun, it's not game-blocking.",
            "review_score": "-1"
        },
        {
            "review_text": "crashing on boot. no fix?",
            "review_score": "-1"
        },
        {
            "review_text": "Glitchy, laggy, random screen tears and fps drop, before you think oh he running on a low budget card i am running on Asus Strix 6gb 780's in 2 way sli, both cards have been set up so they are both running. Do Not buy the product until all the issues have been solved. 3 Mid Game CRASHES only been playing the game couple of hours. in dire need of a patch or full refunds to anyone who has been unfortunate to buy this",
            "review_score": "-1"
        },
        {
            "review_text": "My playtime is low and will likely never increase due to the game being as broken as it is. Don't make the same mistake as I did and think that just because your comp meets or exceeds the requirements; you'll be able to play it. It is a port, and one of the worst I've seen considering the time they spent making it.  And Capcom is really slow with the patches, so if you're going to buy it I suggest you wait over a year and untill the price is knocked down a bit, since there's a good chance even a supercomputer won't be able to handle this messy mess that is so messy.  My comp handles any other new game without any problems, so I was surprised when DR3 started lagging and had frequent FPS-drops, especially since there was nothing at that particular time that would logically make that happen, the game is just f'd up.  I'd hella recommend that you purchase it for Xbox though, as it was intended.",
            "review_score": "-1"
        },
        {
            "review_text": "The game takes place in a city called 'Los Perdidos” which in Spanish translates to 'The lost'. Which makes sense considering the game is a lost ♥♥♥♥ing cause. No updates were ever released to improve gameplay just patches that didn't do jack ♥♥♥♥. Even if they did don’t bother the game is more of the same and mediocre at best.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good. But is is the worst ♥♥♥♥ing port ive ever seen in my entire life. CAPCOM literally ported it directly to PC. THey didnt even touch it.   IT is SUPER buggy, locked at 30 fps, and constantly crashes.  Dont waste your time with this one.  Horrible -3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Fix the damn games. I csn't even get past the loading screen and I have twenty other games that are bigger than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Too horrible, only my friends invited me to pay for it , not suggested play in loud bass speaker in dark room 😈",
            "review_score": "-1"
        },
        {
            "review_text": "Intel i7 3930K Sapphire R9 390 with slight overclock 16GB RAM Installed on Samsung 850 EVO SSD Acer XG270HU with Freesync  With this hardware I experienced unbearable frame drops even with settings lowered to the point where everything looked disgustingly fuzzy. Initially, applying the frame rate unlock fix helped a little, but not nearly enough. Not even Freesync seemed to help. I had heard reports that the game has been fixed over time with patches and this is simply not true, or if it is I can't imagine what terrible state it was in before. I am requesting a refund.. Please don't waste your time.  I absolutely loved Dead Rising 2, even though it had slight performance issues. This is something else though. Hopefully Capcom learns their lesson from everyone that refunds this and gives Dead Rising 4 the proper port it deserves.",
            "review_score": "-1"
        }
    ]
}