{
    "app_id": 265770,
    "name": "Cannons Lasers Rockets",
    "release_date": "2014-08-25",
    "developer": [
        "Net Games Laboratory"
    ],
    "publisher": [
        "Net Games Distribution LTD"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Space",
        "Action"
    ],
    "achievements": 6,
    "positive_ratings": 133,
    "negative_ratings": 401,
    "price": 0.0,
    "description": "For victory you need only three tools - Cannons, Lasers and Rockets! Discover a spaceship MOBA game with 2D combat in 3D environment, wide variety of play styles and fun gameplay for casual and pro gamers alike.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/265770/header.jpg?t=1456906280",
    "minimum_requirements": "OS: Windows 7/8/XP/Vista (32 or 64 bit) Processor: Athlon II X2 220 (2.8GHz) or equivalent processor Memory: 4 GB RAM Graphics: 1 GB of VRAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1500 MB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": "OS: Windows 7/8/XP/Vista (32 or 64 bit) Processor: i5 or equivalent Memory: 4 GB RAM Graphics: 1 GB of VRAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1500 MB available space Sound Card: DirectX compatible sound card",
    "reviews": [
        {
            "review_text": "I would like to put more in the review, but at three different times of the day i tried to play this game, and in all three literaly no one besides me seemed to be online.  (The counters in the game when trying to join told me 1 in my tier and 0 in all other tiers).  After about 20 minutes in queue I stopped my last try.  the videos looked fun though.",
            "review_score": "-1"
        },
        {
            "review_text": "Windowed game, Slow and tedious gameplay (which is the opposite of what the trailer's impression of the game was), Microtransactions, Tutorial is slow and badly explained, Clunky controls. Need I say more?  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a posterboy for 'badly made unity game' that is just in it for the quick money.  Do not give this game any money if you play it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's been 10 minutes and I can only tune my ships. It won't let me go in battle, it won't let me go on tutorial and that's just the begining. This game is just full of bugs so maybe come back here when they acctualy sort the game out and it acctualy works.  Pros  - The uninstall button works  Negatives  - It's pretty much the only thing that works - youy have to pay for nearly everything",
            "review_score": "-1"
        },
        {
            "review_text": "well its just bad i mean really bad",
            "review_score": "-1"
        },
        {
            "review_text": "not worth it even though its free",
            "review_score": "-1"
        },
        {
            "review_text": "this is ♥♥♥♥...I try to do toutorial but nothing happens no ship no controls work it a pile of crap i would of liked it if it would let me play please fix ",
            "review_score": "1"
        },
        {
            "review_text": "Never actually played the game, because always waiting for the queue to be filled. Wasting my HDD space.",
            "review_score": "-1"
        },
        {
            "review_text": "So you think this new update made the game better? I don't know how bad it was before, but this is far from anything I would call fun. Deleted...",
            "review_score": "-1"
        },
        {
            "review_text": "Despite the fact that i cant play the game past the Hangar... I would like to reccommend this game. It has great potential. The last/most recent review i read was negative. The player said that he/she was unable to exit the game without exiting. I think maybe that person wasnt paying attention...or maybe he got bugged. This game is very appealing from the videos; very easy on the eyes. There is just nobody online.   As was also said in a recent review the game can be played with a minimum of two people. I would love to try this game out. If there is anyone that reads this and would like to give it a go....Message me and we can play a match.   Note to the DEVS:  If you made it possible to play with nothing more than bots the game would likely game a crowd (again?). I know i'll be here. Once there is a crowd, the reviews can actually start to help you guys.   Thank you for your hard work....hopefully the Long Holiday, lol, will have helped you guys to get back to work.    ______________________________________________________________  On a second note: I had to use the game five minutes to post this....i had three when i wrote above, but it was worth it to me to have a couple extra minutes to get my opinion out there",
            "review_score": "1"
        },
        {
            "review_text": "Great game but little hard ",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutley amazing! It has simple, easy to learn gamplay and stunning graphics! 20/10! This game deserves more recognition.",
            "review_score": "1"
        },
        {
            "review_text": "Its bad",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really shity game",
            "review_score": "1"
        },
        {
            "review_text": "Most glitchy, nonsensical game I have played in a long time. Winning, Losing and Drawing seems completely random. Matches end randomly as there is no timer and sometimes end without either base being destroyed. Little is explained in the tutorial and the whole game is a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "No. Do not play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are on any Linux distribution do avoid this game, as it is, their asset paths are broken, they use Unity 3-D 5, however, the game was designed specifically with Microsoft Windows in mind and have laid XML files out for further expansion into the Linux realm but in and of itself doesn't work.  They're using the default export settings for a Unity 3-D game under Linux and to the point where they haven't even changed this stuff.  When you execute CLR directly in console you get this:  ./clr: 3: exec: ./REPLACEWITHYOURGAMENAME.x86: not found  First off, it wasn't defined in the C# project that the name should be './clr.x86' despite that file actually already exists but it then only sets the current game paths and then quits. Pretty stupid!  They need to learn Unity 5, first, do a couple of export to Linux and other platforms before they come back to this game to start from scratch, they need a full reboot because from what I've seen on Microsoft Windows, it's a complete and total disaster. Well, at least it works on that platform, even though it hobbles.   I sent in an error report about this many months ago to have this fixed, they said they would hand it off to their 'Unity programmer', I can see he/she didn't do a think for Linux nor even fix the project.   Sad, very sad!",
            "review_score": "-1"
        },
        {
            "review_text": "Personally, I find the controls a bit touchy and off, with buggy and confusing graphics. .5 out of 5 stars.",
            "review_score": "-1"
        },
        {
            "review_text": "the game doesnt work for me like it logs in then all i get is hanger connected and it just stays there with that wormhole thing spinning around i dont know what i did wrong but i hope it could get fixed sooner or later",
            "review_score": "-1"
        },
        {
            "review_text": "Here are the pros and cons of this game.    Pros:      Cons:The controls are crap in fact i can't do anything about moving around expect going forward and just like almost all the other reviews will say this game has a MUCH better verison called fractered space but even then it isn't really that good but it's about 100 times better then this game.  Also if you want do save time i say don't even download the game and just pass it by every time you see it becuse no matter what there is no way it's getting out of the hole it fell into.",
            "review_score": "-1"
        }
    ]
}