{
    "app_id": 265970,
    "name": "Worlds of Magic",
    "release_date": "2015-03-19",
    "developer": [
        "Wastelands Interactive"
    ],
    "publisher": [
        "Wastelands Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Turn-Based"
    ],
    "achievements": 86,
    "positive_ratings": 221,
    "negative_ratings": 243,
    "price": 18.99,
    "description": "Worlds of Magic is a 4X turn-based strategy game. Players can explore and conquer an almost limitless number of procedurally generated universes, using military and magical power to overcome their foes. Found cities, raise armies, research and cast spells, hire powerful heroes, and create powerful magical artifacts.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/265970/header.jpg?t=1540988768",
    "minimum_requirements": "Minimale : Système d'exploitation : Vista 64bit Processeur : Core2Duo 2GHz Mémoire vive : 4 GB de mémoire Graphiques : HD Graphics 4000 DirectX : Version 9.0c Espace disque : 3 GB d'espace disque disponible",
    "recommended_requirements": "Recommandée : Système d'exploitation : W8 64bit Processeur : i7 Mémoire vive : 8 GB de mémoire Graphiques : Nvidia Geforce GTX 460 or AMD equivalent DirectX : Version 9.0c Espace disque : 4 GB d'espace disque disponible",
    "reviews": [
        {
            "review_text": "I kept thinking this game would eventually work out the bugs, because I desperately wanted to enjoy it. I played MoM more than just about any other game back in the day, and the thought of a real successor was a huge draw. Unfortunately the game has never lived up to MoM, or multiple other current games in the genre for that matter. Every build tends to introduce a new bug requiring a restart, or a new CtD. The devs rarely respond to feedback unless it's completely positive, even going so far as calling owners stupid on the forums. My biggest regret was that I picked it up in EA as soon as it was available and played each update to provide feedback, so I had too many hours played to get a refund when it was 'released.' Save your money and your time, avoid this title.",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: 1.1.5 - 2015/07/07 Update  After sinking quite a few number of hours the game does contain all the similarities of MOM and shows still great promise in terms of gameplay style and tactics. I easily managed to reproduce my favorite strategy from MOM using the mechanics that they laid out.  That being said at this point the AI is extremely lackluster though. So I can advise to wait for a few more AI updates so that the game doesn't only reflect the MOM spirit but also offer a decent challenge. Right now the AI is basically waiting to get massacred sadly enough.  In any case, I'm more postive about a game that has great mechanics but the AI needs work, then a game with lackluster mechanics and 'great AI'. Looking forward to the challenge!  *******************************************  ** Do you have any specific questions? Please feel free to ask in the comments and i'll be happy to answer! **  Finally, after several failed attempts a studio steps up and makes what many MOM fans have been waiting for. A true spiritual successor to the critically acclaimed Master of Magic.  Take it from a hardcore MOM fan, they are sticking to the formula and are truly using many aspects that made the game what it was. Unique and filled with a myriad of combinations of sorcerors to create to fit your own playstyle. Still missing some races and planes, but they are working on them and I'm sure they will be awesome.  The Undead is the first race to have a very noticeable different economy, and I'm looking forward to other races with unique takes on how they thrive.  If you want to partake in the true remake of a classic, this is your chance! The devs are friendly and are active with the community, true champions!  Safe to say this will be a must for anybody who even remotely enjoyed MOM.",
            "review_score": "1"
        },
        {
            "review_text": "I can live with poor graphics but crappy interface wrecks this game. In many ways, the original is better. At least you don't find yourself constantly moving the wrong stack. Also, real basic things didn't work for me. For example, the hint box close bottom was off the right of the screen for me so I couldn't close the hints.   Game also seriously needs tooltips.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't Buy This Game!  Worlds of Magic is a game which claims to be a spiritual successor to Master of Magic. But the Truth is: It is just a money grab. Wasteland Interactive made this game but the trademark of it is owned by Wasteland Interactive and Lucid Dreamers Development.  Lucid Dreamers Development made a game called 'Empires of Sorcery' in 2012 which also claimed to be a spiritual successor to Master of Magic but never got finished.   Worlds of Magic never got finished too. The game is just a buggy mess and you cannot finish the game because of a mix of crashes, bugs and terrible AI. Things they have promised countless times. But they never did.  Instead they are making now the third iteration of the same game. The new name is Planar Conquest. And it is released for android.   So don't hope they fix this game. Instead just save your money and buy something else. The game is not even worth only 10 % of the price.   ",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to like this game, but alas I cannot reccomend it. The release proved to be rocky and uninspired; there was very little new content and the game crashed on combat. When you have to hot patch your game on release day just so its playable you have problems. This game has good ideas but the execution is horrible. As it stands now the game crashes every 20 turns or so, CTD and in game freezes. I would stay away from this game for another few months until they can iron out some of the problems. They were warned by the EA players that March 19th was to early to release the game, but alas they did not listen, yet another game dev releasing an unfinished game and asking full price.",
            "review_score": "-1"
        },
        {
            "review_text": "I really, really want to like this game.  That being said, it's just not good. UI is bad, AI is bad. Someday, given a lot more work, this may be a good game, right now, it's not worth $5, let alone $40.",
            "review_score": "-1"
        },
        {
            "review_text": "Another unfinished title. I played Masters of Magic lots of years ago, and I thought it would be great playing a remastered version of this title. Having played hundreds of hours to the old MoM I think that this new version lacks of interest due to it's current state. Yes, good ideas but poorly implemented. Bad UI, bad controls, and several small bad details that killed the initial illusion making the gameplay bad. Something as simple like the minimap it's absolutely terrible, looking like abstract art and severely pixelated. AI it's highly questionable: Playing as highmen in medium map with only two cities against one enemy with lots of cities... I won!! The enemy could kill me very easily but he kept his troops in the vicinity of my two only cities, so I managed to cast 'Spell of Mastery'. There are also several bugs, like equiping the heroes with items... it's nearly impossible to do it properly because valid items for a heroe can't be equiped sometimes but If you continue trying the items finally snaps in the slots. Also in Forge&gt;Equipment&gt;Heroes&gt; you can equip your heroes, but in Units Roster&gt;Heroes&gt; you can't do it properly. Another example... Depending on the screen the game shows contradictory information, i.e. heroes showing that they are full equiped in Forge&gt;Equipment&gt;Heroes&gt; but in Units Roster&gt;Heroes&gt; the heroes appear to have zero equipment. Yes, the game have resemblances to the old MoM but with lower quality in gameplay. To any veteran player of MoM this new WoM will be a total disillusion.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been waiting decades for a Masters of Magic Sequel. I've bought countless programs, some of them bad - Elemental: War of Magic, some of the solid entries into the turn based strategy genre: - Endless Legends. But never a faithful sequal. World of Magic is that faithful sequel and I'm enjoying it immensely. It's almost a modern recreation more than a sequuel, so there is a more leisurely pacing and certain old school mechanics that some might thing could be updated. There are plenty of games that made those attempts, but they lost the magic that made MoM work so well.",
            "review_score": "1"
        },
        {
            "review_text": "I loved Master of Magic, and this is no Master of Magic. It's ugly, runs like crap, and is unintuitive. The interface is massive and the text is so small it's nearly impossible to read. It's like someone with a major learning disability designed te interface.   The original has a much better aesthetic (not hard to do--you won't go blind looking at it), plus you can get it for free. Oh, and it features more factions and more magic. Half the circles in this game are just mixups of the others, and what happened to the Bedouin people?  This game is special since it's the first I've tried to return. Hooray for ruining classics.",
            "review_score": "-1"
        },
        {
            "review_text": "5/10 this is just a meh. Played a bit more at my friends house than is listed here. Has pontentional, BUT I would wait on buying this till One major issue is fixed.  Major Issue 1: Every resource is guarded by forces way to strong for your early game units.  Minor issue 1: The graphics need a bit of fine tuning. Minor issue 2: Ai has reallly only 1 plan atm 'Zerg' fight rush at you with all it has got and hope.'Was mostly fixed this last patch but still there from time to time.)",
            "review_score": "-1"
        },
        {
            "review_text": "WoM is the new MoM. It captures the spirit of MoM and adds many game play elements I've always wanted in a MoM remake: multiple planes to explore, D20 mechanics, satisfactory and sometimes good looking 3D graphics and character models, and a playable undead race!  WoM has a few rough edges yet but it is fun to play and provides good immersion. Hopefully the devs will smooth out those rough edges and make this game a fantasy strategy classic.  ",
            "review_score": "1"
        },
        {
            "review_text": "Nowhere near the level of Elemental/Fallen Enchantress series",
            "review_score": "-1"
        },
        {
            "review_text": "This game is rough around the edges but as someone who never got to play masters of magic in its prime. this game stands on its own. The game is beautiful on maximum settings the races are different to play and the amount of spells is simply staggaring. So much fun to explore.  Combat simply put I love it compared to age of wonders system. In this game the 'figures' in a unit arn't purely cosmetic. If there are 4 archers in a unit and I kill 3 it does 1/3 of the damage and each of those archers if alive has a chance to miss.  The UI and sound effects need a bit of work. I'm a 4x vet and it took me a while to figure out where everything was located. I've been crash free but I know some others havn't.  TLDR A great game marred by how financial markets and stocks work. ((end of march is the end of quarter one meaning many things to the company)) but thats the best thing about pc games the problems that exist can be fixed and I trust they will. I will be cleaning this review up later with pros and cons. I got tired of reading ragereviews because of a crash or two. ",
            "review_score": "1"
        },
        {
            "review_text": "Though I recommend this game, I do so with the understanding there are missing features and quite a few bugs that are still being ironed out. As the developers are aggressively releasing patches, it does give one a feeling of confidence that any issues will be addressed.  Having stated that, I recommend either picking this game up for at least 50% off when it goes on sale, or wait a few months until the game is truly 'complete'. The full retail price is too high for the game's current state.  Nevertheless, fans of fantasy-based 4X strategy should keep an eye on this one, as it is enjoyable in the current state.",
            "review_score": "1"
        },
        {
            "review_text": "A decent effort to recreate Master of Magic experience, and in general, got it right.  Master of magic was always about endless choice and the excitement in discovering new ways to spoil yourself. In this regard, Worlds of Magic is quite successful.   There are still plenty of bugs left, however, developer is very engaged and pumps out patches constantly. These patches also add a lot of new contents, for free.  So while it is not perfect, yet, I still highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This frame is incredibly nostalgic for anyone who enjoyed MOM this is a great sequel. As they iron out the bugs the gameplay has improved. Incredibly addictive.",
            "review_score": "1"
        },
        {
            "review_text": "A disappointment. It wants to be a successor to Master of Magic. I want a successor to Master of Magic. This isn't it. The interface is awkward as all hell and the gameplay is uninspired (especially with the fact that the mechanics are straight-up 3rd edition D20).",
            "review_score": "-1"
        },
        {
            "review_text": "Actual recommendation is somewhere between yes and no. It's an ok game but it's kind of scrappy and unfinished feeling.  - Sound effects for end of turn are way too loud and dramatic. I found the same problem with the sound effect when moving my insect dude around the map too. Some sounds in combat don't have anything like the same punch. In general I would say the sound effects feel like isolated samples being triggered and don't blend into a seemless audio picture like ni most games.  -Some scrappy text boxes with incomplete words in  -I haven't played long but it seems like you get this 'city needs your attention' thing and it won't let you end the turn until I make the city build something. What if I don't want to build something?  -Units sliding in combat screen when you move them (no animation after the first few squares)  -you can bump the edge of the screen with the mouse to scroll in the overworld but on the combat screen you can't and have to left click and drag on the screen  -tooltips for buildings in your city seem to trigger when mouse is over the middle of the building model rather than on the base of the square the building is in which is counter-intuitive  ",
            "review_score": "1"
        },
        {
            "review_text": "Good game, full of surprises (good ones). latest update (5th from release and thats like a week or less) and all is stable. Havebnt had a bug in 30 turns. Anyway, devs are really responsive and we are getting new content daily.  As a friend wrote recently: 'This game is a diamond in the rough that is being rapidly polished, and I for one am delighted to have it available to me.'  Couldn+t agree more.",
            "review_score": "1"
        },
        {
            "review_text": "Worst game ever. It will not load. Total waste of your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "I definitely recommend this game, as it is very much an update on the old classic Master of Magic. I have many fond memories playing that awesome game for hours on end. Worlds of Magic is very much an update, and a little sadly, it is still a work in progress. However, given that the dev team are very involved with and continuing this development, I have no reservations recommending this game to hardcore fans of Fantasy TBS games. I am already greatly enjoying the variety and depth Worlds of Magic has to offer, and I know it will only get better. *Disclaimer* I am a Kickstarter backer, so I may be a bit biased. Take that into consideration when determining if this game is for you. I would rate it 6.5/10 at present. I suspect it will be 7.5/10 before summer, perhaps higher. As always, use your own judgement in these matters.",
            "review_score": "1"
        },
        {
            "review_text": "every one gets suckered into buying a bad mutiplayer game at some point.",
            "review_score": "-1"
        },
        {
            "review_text": "meh. 6/10 and I'm being generous, because if you like 4x, you may get your money's worth.....maybe. The UI is serviceable , if a bit wonky and counterintuitive. The artwork is nice, but not mindblowing. There are lots of bugs. It seems strange to encounter fiery demon horses and majestic unicorns guarding the same feature, or to have some undead sorcerer lord readily accept an offer of peace and cooperation from my high elves; but hey, moral ambiguity is hip these days, so maybe it's your thing too. There are just too many 4x titles out there that are way better, and some of them are way cheaper.",
            "review_score": "-1"
        }
    ]
}