{
    "app_id": 266030,
    "name": "DRAKERZ-Confrontation",
    "release_date": "2014-05-19",
    "developer": [
        "Peoleo Entertainment"
    ],
    "publisher": [
        "Peoleo Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "Card Game"
    ],
    "achievements": 0,
    "positive_ratings": 130,
    "negative_ratings": 125,
    "price": 0.0,
    "description": "The Trading Card Game in Augmented Reality.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/266030/header.jpg?t=1447359575",
    "minimum_requirements": "OS: Windows XP SP3 Processor: PC Core 2 duo Memory: 2 GB RAM Graphics: 3D Graphic card 512 Mo DirectX: Version 9.0 Network: Broadband Internet connection Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: PC Core i5 Memory: 4 GB RAM Graphics: 3D Graphic card 1Go DirectX: Version 9.0 Network: Broadband Internet connection Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "This is NOT a free-2-play game.  It's a DEMO of a game. You find the exact same limitations in demos as the 'free version' of this game places on you.  To put it bluntly, you are not going to get more time out of this product than you are from a demo of any other game UNLESS you start buying boosters.  The question then comes, of course, is it worth it to buy boosters? For me, looking at prices and taking my experiences while trying out the mislabeled DEMO, the answer became a resounding NO.  Doing the story missions (which I did to get every unlock possible in the demo) was somewhat ok. A bit repetitve at times, due to the limitations of the game, but at least the battles were somewhat balanced.  Ability to get cards for free seemed limited to the few you got in the limited amount of solo-play missions available. The only currency in the game is hard cash, and it's not something you can 'earn' by playing (not in any games I tried at least), but purely something you pay to get boosters.  Most of the time when I queued up for online battles against other players, it told me that nobody was available to play against. So I had to alt-tab and do random stuff in a web-browser while trying to even GET games going online against other players.  Any of the battles I tried against other players were horribly horribly mismatched. There was no way the deck I was supplied with as a 'freebie'(or demo player) would compete with the decks of people I met (every one of the ones I met seemed to have paid and played for a while, given their levels and cards).   Randomization also have a huge effect on battles, meaning what initially looked like a balanced battle (as the ones I encountered in the solo missions) can turn onesided very quickly by a combination of cards gotten and mana orb placement. Battles that are already onesided can become extremely pointless beyond hope because of this too (like where my level 3 drake was put up against a level 30 drake by the matchmaking).  Unless you are planning to spend ALOT of money over a period of time to buy boosters as time goes by, steer clear of this one. The variety also seemed close to non-existent in the games I played, despite meeting levels and drakes of different types.   The poor balance, non-varietyof battles, lack of ability to progress without paying for it (coupled with the prices per time you actually consider if you should purchase something) ultimately turned me off from the game once I found out that I had exhausted the demo of its potential in a matter of 4 hours...  Some cute ideas, but ultimately flawed in execution on how they go about trying to handle the 'distribution model'.",
            "review_score": "-1"
        },
        {
            "review_text": "pay to win game. definitely not free to play.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing, except no one plays it. From my experience, it's one of the best games (trading card based) that I've encountered!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME WORKS PERFECT ON WINDOWS 8.1 LAUNCHER IS NOT SLOW AS THE OTHERS SAY AND THE GAME LANGUAGE CAN BE CHANGED FROM THE LAUNCHER IN THE TOP LEFT SIDE BY CLICKING THE LITTLE HEXAGON WITH THE ENGLISH FLAG.  i give it 8/10 because you can't pick out of all the Drakers.      ",
            "review_score": "1"
        },
        {
            "review_text": "Overall I would say this is a good game. There are a few bugs that prevented me from trying out the daily tournaments. The game is pay to win, this is a fact. You get to pick a creature that you want to play with and they give you another 2 free to play creatures to play around with. You get the free to play card pack and it works pretty well if you can wisely use your mana and get good card draws. In order to get other creatures and other cards you have to buy the packs though, otherwise you won't get very far in the story mode or when versing other people online.There is no other way to get new cards, so the 'free to play' aspect only goes so far. If they gave players a way to actually earn cards it might be a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Pay for Win, that's all.",
            "review_score": "-1"
        },
        {
            "review_text": "The visuals are top notch, but I just couldn't get into it. Two monsters fighting each other seems like a lot less variety than other card games have. 'Claw'... 'Power Strike'... Zzzz. The mechanics just seem too simple and seem to be entirely without variety.",
            "review_score": "-1"
        },
        {
            "review_text": "My cards arrived yesterday, this is one of the coolest games I've played in a long time. My launcher/game started in English and I haven't had ANY problems starting the game. I'm extremely impressed by the artwork, gameplay mechanics and the augumentation.  The only problem I've had is the sound effects are glitchy so I've had to turn them off!",
            "review_score": "1"
        },
        {
            "review_text": "It's crashed twice in a row, at the same place, during the tutorial.  EDIT: I don't know what's wrong but the game crashes doing the tutorial and because the tutorial is compulsary to play, I haven't been able to see anything else.  ... anything else except the constant adds bashing me in the face since the first time I signed in with over priced pay-to-win cards and monsters. The translation... was not seamless. The 'Engrish' makes reading abilities and stuff sometimes impossible and understanding how the game works difficult.  Obviously, this game is great. Even just the fraction of the tutorials I got through were fun. This experience is UTTERLY RUINED by the pay-to-win system that funds their game, the Engrish that makes comprehension impossible and to make it worse there are constant adds being blasted in your face. Save your time and if you're silly enough ... the money. Do not download this game.",
            "review_score": "-1"
        },
        {
            "review_text": "No Just no!!! Say no to french games!!",
            "review_score": "-1"
        },
        {
            "review_text": "No mine monitor resolution, no steam login, error on exit",
            "review_score": "-1"
        },
        {
            "review_text": "my launcher is fine, i cant log in.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok. Let me put it this way.   This game is cool. We've needed an AR type game like this for pc for a long time.  My issues is that  First of all, the game will sometimes jsut not open when you hit paly and tell you it stopped responding.  Secondly, When you try to do the forums for answers and help. There will be no response.   I don't know why this is but i feel like the game is dead.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome!!! Everything on it is awesome! I can't understand why so few people play it. Actualy I can't find anyone playing it right now. Maybe I'm in a different server. idk!",
            "review_score": "1"
        },
        {
            "review_text": "*Sigh*   I had high hopes for this game, but it just doesn't add up well. Here is why i did not enjoy DRAKERZ- Confrontation.  PROS: Great concept Classic card game feel Pretty nice graphics  Cons: Formentioned great concept is executed poorly Pay to win scam Horrible english translations. Bad tutorial Bad controls A.I. is not that good No customization ",
            "review_score": "-1"
        },
        {
            "review_text": "Cant even get the game to work. Says my system does have the requirments. When my system is over the requirements.",
            "review_score": "-1"
        }
    ]
}