{
    "app_id": 266050,
    "name": "Into the Dark: Ultimate Trash Edition",
    "release_date": "2014-05-01",
    "developer": [
        "Homegrown Games"
    ],
    "publisher": [
        "Homegrown Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 30,
    "positive_ratings": 89,
    "negative_ratings": 113,
    "price": 3.99,
    "description": "Expect the ultimate B-Movie Trash experience! Don´t even dare to hope for state-of the art graphics, a proper balancing, professional voice acting or breathtaking script-writing. This here is 100% pure trash, an adventure / shooter hybrid with gazillions of bad jokes, dozens of pop culture references and a hidden, dense net of...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/266050/header.jpg?t=1541757511",
    "minimum_requirements": "OS: Windows XP / Vista / 7 - Attention: Windows 8 MAY cause problems Processor: AMD Phenom 9550 Memory: 2048 MB RAM Graphics: Radeon 4800 or better (of course also NIVIDA) DirectX: Version 9.0c Storage: 7 GB available space Sound Card: DirectX 9 compatible Additional Notes: At least 120 IQ points, full DirectX 9, .NET and ogg / wmv codecs",
    "recommended_requirements": "OS: Windows XP / Vista / 7 - Attention: Windows 8 may cause problems Processor: intel core i5 or better @3GHZ Memory: 4096 MB RAM Graphics: Radeon 6800 or better (of course also NIVIDA) DirectX: Version 9.0c Storage: 9 GB available space Sound Card: DX9 compatible Additional Notes: At least 120 IQ points, full DirectX 9, .NET and ogg / wmv codecs",
    "reviews": [
        {
            "review_text": "The developers didn't try making a game, so I'm not going to try making a review.  Utter ♥♥♥♥, and not in a funny way. Developers rate down unpositive reviews by the by.",
            "review_score": "-1"
        },
        {
            "review_text": "Aside from the fact that the humor isn't my style, what gets this a thumbs down is that it's uncomfortable to play. The screen flickers a lot, like A LOT. Enough that it should probably come with a seizure warning. And even taking a small amount of damage puts enough blood on the screen that navigation becomes very difficult. For people who are into the writing and comedy, it may be worth putting up with those frustrations, but I am very much not one of those people.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried to open an 'automatic grate' and got wrecked by a glitching mutant. 0/10 Wouldn't play again.  Absolutely horrible game. Funny and bad enough to sit through the horrendous intro sequence (bad artwork, amateur voice acting with static in the audio,) and try out the gameplay. Firstoff, you get stuck when certain sequences happen, like when you talk to your omnipotent partner, your feet become frozen to the ground. Then there's a sequence that is scripted so poorly you are ready to uninstall the game (which I did.) You have to get through an automatic grate (what the heck is that?) and find a switch to open it. But when you get close enough to the grate to find this out, if you didn't happen to trigger the text that told you to open this grate beforehand, you trigger an enemy to appear, who quickly shreds you to pieces.  Bad artwork, sub-par graphics, terribly scripted events. Save your money and your time and play a title that the developers bothered to finish.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool, creepy and funny, worth a shot",
            "review_score": "1"
        },
        {
            "review_text": "I know they were trying to make one of those 'so bad it's fun' games, but...  Well, let's just say they forgot about the 'it's fun' bit.",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth $10.",
            "review_score": "-1"
        },
        {
            "review_text": "Perhaps, if I weren´t the developer, I would write some catchy line like  'Next time I will rather have a mutated radioactive killertuna from Fukushima eating my balls while still attached to my body instead of playing this game!'  But, as Lead Designer of this abomination, I have to recommend it. Of course. Best game ever. Totally worth its money. And so on... While asking myself WTF is wrong with a system that let´s me review my own game? What is the meaning of that? What is the meaning of life? Can Nazi-Zombies be re-integrated into society by luring them into bed with Zombiehookers? How does tentacle sex feel? What has McCarthy to do with Edward Snowden? Can diving in radioactive water really lead to ♥♥♥♥♥ growth? If you have to choose a lesser evil, is it Cthulhu, Nyarlothep or Obama?  Well, at least 5 of these questions will be answered when you finish Into the Dark...",
            "review_score": "1"
        },
        {
            "review_text": "Any game where the developer encourages people to cheat to have fun with the game? A+ in my book.  The game is horrible, no doubt, and I only own it because of getting it with a Bundle...but it's worth it. If you enjoy bad jokes and even worse voice acting, then this is the B-movie game for you.  Maximum Boobage.",
            "review_score": "1"
        },
        {
            "review_text": "War? I saw 'Nam. Man, was I raw.... These are the games that matter; good stuff, folkses. Keep up the good work. If you're looking for any ideas, I am adept at writing heavy metal lyrics and wine reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Very poorly made game, cringeworthy voice acting, do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Eerie, spooky, inconvenient, strange – all that applies to this game. You can hate its guts, and there might be plenty of reasons for that, but in the end it has great merits: - Visuals are better than most Indie games, nice film grain shader - Dark places, lit spots + spooky music = great atmosphere - Humor and fun elements work well together with the rest - Some nice puzzles, tough enemies - Totally insane and entertaining storyline - Voice overs so bad you dare singing in the streets afterwards",
            "review_score": "1"
        },
        {
            "review_text": "Yup its trash, no doubt about that.",
            "review_score": "1"
        },
        {
            "review_text": "TERRIBLE GAME!!! 3/10  THIS GAME WAS SO POORLY MADE! THE GRAPHICS ARE BAD! AND YOU CANT EVEN RUN! ITS LIKE GRANDMA CROSSING THE STREET THE WHOLE GAME! I HATE IT! DONT BUY THIS! YOU'LL REGRET IT! BUY OUTLAST BETTER ! NO WONDER ITS CALLED THE ULTIMATE TRASH EDITION",
            "review_score": "-1"
        },
        {
            "review_text": "enjoyed a full movie ingame took a healthy radioactive bath blew up  ears got ♥♥♥♥♥ eyes started bleeding 9/11 the twin towers would recommend this game",
            "review_score": "1"
        }
    ]
}