{
    "app_id": 266170,
    "name": "Windforge",
    "release_date": "2014-03-11",
    "developer": [
        "Snowed In Studios"
    ],
    "publisher": [
        "Snowed In Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Sandbox"
    ],
    "achievements": 25,
    "positive_ratings": 357,
    "negative_ratings": 172,
    "price": 6.99,
    "description": "WindForge is a side-scrolling block-building game where you explore hostile skies in an ever-changing Steampunk world. Everything you see can be created or destroyed, creating an RPG without barriers that rewards creative problem solving and improvisation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/266170/header.jpg?t=1447359580",
    "minimum_requirements": "OS: Windows 7 or later Processor: Core 2 Duo Memory: 2 GB RAM Graphics: 512 MB graphics memory and Open GL 3 compatible GPU Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great game, if only it didn't crash after a white screen with no errors. Not to mention that the developers completely abandoned it a year ago. I really liked this game... while it was playable for me.  Edit: I'm going to review the actual gameplay, Props to Mr. Cheese for pointing my flaws out.   The setting and the atmosphere are what make this game. Being able to build a sky fortress out of Balloons and Propellers make you feel awesome, not to mention the different layers of the world that make the game exciting.   What made the game not reccomended by me: Me and others have had the white screen crash, that appears when you start the game every time, making it unplayable.   If you think it's worth the risk, pick up the game. If it works, you will not be disapointed.  EDIT # 2: Okay, so I got the game to work, it must have been an update that windows ran, the only time I'm genuinely happy that windows auto updated, really. I'm keeping the not reccomended because of that: it is NOT optimized well, the frame rate drops regularly, but the game is still good.",
            "review_score": "-1"
        },
        {
            "review_text": "I think there's lots of potential here, but the fundamentals are not in place. Too much of the basic mechanics is awkward. For example, the player moves quite fast, but this makes precise positioning difficult. But to move downward through a hatch you must be EXACTLY in the right spot. If you don't stop precisely in the center, you just run right over it. There are too many hatches in this game to sit there fighting the controls trying to get through each one.  Another very fundamental mechanic with problems is block placement and destruction. They've opted for a 2.5D isometric presentation here, which looks good in screenshots, but causes difficulty during play. Every block is something like 1x1x4, which means they overlap one another and it's hard to pick out exactly the one you want to break, or to place one in exactly the right spot. It's just very confusing compared to the true 2D of Terraria.  At this point I have to recommend NOT to buy this game. Once these fundamentals are addressed, that will hopefully change. There's a lot of potential here.",
            "review_score": "-1"
        },
        {
            "review_text": "I had a lot of fun with this game, but I feel like at this point reccomending it comes with a few warnings: The developers have stopped updating the game, so none of the issues with it are going to get fixed. There are a bunch of physics bugs still in the game, and a lot of other issues that make the game feel extremely unfair at times. The ship building system in this game is unfortunately very flawed. Building a huge expensive ship with workshops and so on may be cool, but it serves no useful function in the game. Almost everything in the game is easier with a fast, small ship than with a big one, and most of the essential story points happen on foot. There are also at this point other games that simply provide a better outlet for engineering minded players.  That said, the game does have a very cool world with an interesting story, which is kind of a saving grace. The fact that the game has a story you can play through and actually beat the game means that this isn't just another creative game you'll never play because there is simply no reason to get into it over the dozens of other games that have no clear goal. You can play through it in a few hours and have fun with it and then come to a satisfying conclusion.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing about this game that I do not like. I can't say that about many games, but, this is one of them. I hope the game keeps going with more content.   The game is Contra meets Terraria and adds dynamic game play with sandbox elements of open world building. It's great and delivers very well on all levels of stability and entertanment value. Besides, what is there not to love about giant flying whales?",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! Having such a great time playing it. I am not sure why some people are having crashing problems.. I've only had one crash in my 10hrs+ of play time, and none of my save files were compromised. I am currently running this game on an Alienware x51.  I love the artwork, gameplay, story, and freedom to explore a huge world. It's challenging and addicting. Hanging off a whale with a grapple hook, killing enemies with a sausage, and completely messing up the other airships in this game are a few of the hilarious things you can do.   Please give this game a try, and don't let the negative reviews influence your opinion of this game! It really is great, and you need to give it a try for yourself! :) Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game if you enjoy customising your own airships, bases, etc. Kinda like sky starbound. The fact the blocks are so small (you're eight blocks tall) makes building slightly annoying, but the fact the blocks are so small lets you edit pretty small details which is great fun. At the moment i'm getting really annoying crashes but i'm sure this is not an over-arching pattern. In short go for it, as it's already a solid little game.",
            "review_score": "1"
        },
        {
            "review_text": "I'll recommend Windforge but it's a small recommendation.  The game does a few things right, but many others wrong. In the end, the ability to fly with your home everywhere you want, and fight other such vehicles and giant flying whales and krakens makes it up for it, for me, but I think not for everyone.  The really bad things: - Framerate issues on large maps with a lot of entities - The fake isometric view that can make jumping through holes and hatches infuriating - The generally 'floaty' controls  The bad or tedious things: - Building and mining: mostly due to the strange camera view - Going into town for quests. Seriously, why so wide? - Mining. Mining is OK, but even in late game there is no way to pinpoint ore pockets of interest - Crafting. I love that there is such a big variety of items to craft, and especially that starting materials stay relevant in the end game. However, the interface for it has not been well thought. No search option. - Travelling. Travelling is usually fun, but when you need to go from one point in the map to the other, well, you'll need to hang on. A fast travel option would have been welcomed, at least between towns, and even for a cost. - Killing whales/krakens/ships: if you kill them in one map cell and they fall in another map cell, that's it, you've wasted your ammo for nothing, because their remnants will disappear.  The good things: - Super varied crafting - All armors have different looks in-game - The world and the lore, despite lacking a bit of life, is quite cool - The graphical atmosphere is pretty nice, even though the toxic smokes can clutter the screen a bit - Player progression is smooth  The very nice things: - Flying your own ship (even though building it might be a chore) - Exploring temples, when the framerate is OK, its really pretty nice - The fights against whales and krakens are really cool, and the reward of 'mining' their body never gets old (seriously, try the cluster bomb, super satisfying to use)  In the end, it feels like the game might have been too ambitious for the means at its disposal, but for me it was a nice experience, at least it felt fresh. If there is a huge sale, then definitely get it to try it and make your own opinion.",
            "review_score": "1"
        },
        {
            "review_text": "This game just completely lacks any sense of direction. I start off and boom temple + miniboss, okay, why am I here? Where do I go? What do I do? How do I craft? I eventually found my way to another temple and suddenly actual boss fight but I had no gear because I had no clue how to make it or where to find it. I mean yeah I also found a town earlier, but.  There's no thrill of exploring here because everything's floating islands and thus there's not a whole lot to find. Didn't get to any ship combat at all either. This game was just really hard for me to even play, did not hold my interest in the slightest. I feel reviewing it like this is kind of unfair, but I doubt I'll ever play it again, so...",
            "review_score": "-1"
        },
        {
            "review_text": "kk so reason i liked the game was -  - the ship building - the gear crafting  - and the skills - basicly all the progression systems - i also like the ship combat -the player movment becomes insane once agility is leveled the 'meh stuff - - the mano en mano combat -expected more from taming and the bad stuff -it ♥♥♥♥s up the late game progression system -mid game ore grinding is boooring -the knife is better at digging and finding ores than the drill -and killing whales/ other big beasties doesnt give much profit :(  - the big beasties are super strong vs ships but not so much vs poison knife buttrape  all in all i liked it and my review sucked so gg me  10/10 would buttrape a whale using another whale again ",
            "review_score": "1"
        },
        {
            "review_text": "This game has the potential for a great game. Its pretty, and diverse. Unfortunatly, that is all lost due to game breaking crashes.  I found the game can crash at any time, and when you go back to load a previous saved game, it wont load and crashes the game.  I found that the game obviously gets to a certain state and eventually becomes so unstable that you simply cannot play any further.  A real real shame.  EDIT:  So a patch has come out that has GREATLY improved the stability of the game, which has a huge issue for me. Ive not seen it crash once now, and my save games seem to be ok too, so thats really good news. Well done SnowedIn!  The game still needs some refining (sometimes you are constantly attacked, which gets a bit silly) and has some bugs (like enemies walking through floors and walls), but i think with a bit more work, the game will be really great.   Ive changed my recommendation from a No to a Yes, but with the caviet that the game still feels like a Beta, and needs a couple more updates to really get it up to scatch. But its definatly looking like it will be awesome!.",
            "review_score": "1"
        },
        {
            "review_text": "The game was fun. Nothing special but fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game has captured my attention and just won't let go. The typical game keeps my interested for about 30 minutes, maybe an hour. (Most of the 'Played' games on my profile have been just getting cards overnight.) I've sunk over 20 hours into this game already, and most of that has just been exploring and trying different things out and not even focusing on the questline.  I really enjoy the ship-to-ship combat, and the grappling hook play is really fun. I'd never really gotten the hang of the grappling hooks in other games because they just felt weird. This game's grappling hook works intuitively and I have a lot of fun flying around and doing things with my grappling hook. The only downside to the grappling hook is that you can't use a gun while swinging around.  Another big plus for me is the destructible world and environment. You see it, you can probably destroy it. I like using brute force with part of my ship to smash other ships into stuff, then while they're held pinned, gun down their people and steal their ship. As their ship starts to fall apart, I'll usually rush in and repair it if things get too bad while I'm gunning down the crew. Then I'll steal all the good stuff from their ship and let the rest fall into oblivion. Another plus of the destructible terrain is that you can plan entry into hard to get to places and make a back-door. (A quest that sends you into your first major boss fight had me accidentally take a back entrance that was one room away from the boss fight. I opened the door and was like 'What? Already?' Then I spent the next 3 hours exploring that area completely because there are chests and such in hidden spots. But the back door made the boss fight really easy to do.)  At the time of this review, there are a couple of crippling bugs that make it so that you'll want to use the quicksave frequently. First, there's one that if you move stuff from your inventory to your stash or to a vendor really quickly it will cause the game to crash. If you go slower, it prevents that crash. Another is that there is something that overloads the physics that can cause the game to freeze. When there's a lot of stuff going on, my game becomes a lag-fest. For instance, there's a Temple you have to break into and retrieve something. There is so much going on in there that the whole game starts chugging. I have a pretty beefy rig, and even have a dedicated Phys-X card (which I'm pretty sure this game doesn't support, but I only mention it to emphasize how much I've invested into my rig). Terraria used to have the same problems and they were able to resolve them, so I hope this game follows the same trend (maybe adopts the same solution?)  Minor concerns are: * I wish that breaking stuff open in the temples would give better loot than healing potions and money. I went through the first major temple and didn't really find anything interesting. My armor is still pretty weaksauce, although I found a dual shotgun early on that was a major game changer. One-shot kill most stuff. (That gun is way OP for the stage of the game I'm in.) * The AI is pretty weak when it comes to ship-to-ship combat. Most guys on the ship just stand around. On the ground, the AI just follows a 'run directly at you' mode, and doesn't seem to have good pathfinding.  The good of this game vastly outweighs the bad, and so far the developer has been very active in the forums. I've only had the game a few days, so I don't know how often the game is updated, but rumor is that it's pretty frequent.",
            "review_score": "1"
        },
        {
            "review_text": "Don't ever try it. Just don't.  There are sky in it, there are flying ships in it, there are real huge awesome skywhales in it, there are steam/dieselpunk in it, there are skypirates, merchants and sailors in it, there a liquid magma core and floating islands, there are wild layer with gliding wolfes, poisoned deadly layer with gigant krakens, civilized places with town and government, and there are ancient temples. Fully destructible world. Over 200 crafting recipes. Flying Ships. Whales. Temples. Secrets.   Just no!  If you ever want be a pirate don't even look at it. Cause probably you will fall in love. And only after that you will find that there are no AI, just pair of bad scripts; no plotline, just holes; awful animations for everything besides sky, propellers and animals.  Characters are not characters, but poorly made mannequins. Real lack of graphic everywhere (like dozen types of armor, eh? they use one sprite, no difference, leather jacket and machinized diesel armor; two faces for 95% of population), okay, probably I'm too casual player for it. But no, even if graphics is nothing for you, it's really disappointing to see how bad some good ideas could be implemented. It will break your heart and you will be crying in corner of your bed.  Again: no AI, no good story, no 'live' characters. Everything is bad. (Beside sky, whales and packed resources from 'big.file'. But last one doesn't implemented good)  Or try, because it still damn beautiful, just don't fall in love too much, I have hard feelings about this game, that's tragedy that it stays so unfinished =(",
            "review_score": "-1"
        },
        {
            "review_text": "Notice: This is an interim review based on early impressions. I can't say I've logged enough hours yet to really get into it.  1) My sound doesn't work. This could be a hardware issue admittedly (unlikely, everything else works fine) but it doesn't. However, I emailed the devs and recieved and helpful response very quickly so thumbs up! I think I've found my own bug! I hope they name it after me :)  2) The crafting system is strong and the game is helpful enough to tell you what you need (both a strength and a weakness, depends on what you like. Hunting recipes isn't fun for everyone, but then using my psychic abilities to work out craft recipes ala minecraft isn't always the best either)   3) The flying is fun and being rammed by a flying whale is tremendous.  4) I would like more customisation for the character. Changing his name is really about all you're allowed to do.   That's it so far. Hope it helps.  ",
            "review_score": "1"
        },
        {
            "review_text": "I want to like Windforge and it has so many of the pieces in place but sadly something just does not click into place. The idea of the game is amazing and the exercution is for most part, perfect however its the little things which spoil the experience.  -Shooting a target feels off somehow.  -The graphics although good looking seem like they are not refreshing quick enough.  -inventory is rubbish and pulls you out the game every time you want to select something.  I could go on but all it is, is picking holes in what should be the best game on steam. I get the impression, one day the people behind it will start anew, get it right and be hailed as the new minecraft of the next decade.  In short, wonderful ideas which are let down by the lack of a little polish. I would buy the game as you may get more out of it but only if you are hardcore into these sort of things.",
            "review_score": "-1"
        },
        {
            "review_text": "Who doesn't want to be a ninja rope weilding sky pirate?! If this doesn't interest you, turn off your computer now. Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "This game seemed like a lower quality game when I first played. I gave it a chance, and played it for several hours to find out if the mechanics and gameplay made up for the graphics. At first I enjoyed it. I liked the platforming, and the grappling hook made for some enjoyable mechanics. But when I got into the exploration of the temples in the game, I came to realise its major downfall. The temples are massive, repetitive, full of beginners' traps. They're made difficult not by clever level development or intelligent enemy AI, but instead are just full of areas where you can't avoid taking damage. The whole game boils down to a test of how much frustration you can endure before rage quitting. I should have known better when I read the description on the store page and it said this game is similar to contra and terraria. Trying to simply emulate other games without putting enough effort into flushing out your own designs is doomed from the beginning. Overall, I don't think it's a particularly terrible game, I just feel disappointed to see such a missed opprotunity.",
            "review_score": "-1"
        },
        {
            "review_text": "Jarringly unpolished and aggressively tedious. Not worth the asking price.",
            "review_score": "-1"
        },
        {
            "review_text": "Flying Whale Hunting Simulator is the only game where ive been killed by air pirates shooting me while a flying whale and two winged lions were ramming my air balloon.  Sadly, the game is trash. Horrile controls, worse hit detection than Dark Souls 2 PvP and my FPS sometimes drops for no effin reason. I mean ♥♥♥♥, ive played browser games with better graphics, why the ♥♥♥♥ is my FPS dropping?",
            "review_score": "-1"
        },
        {
            "review_text": "On boss is a giant nautilus thing. It shoots lightning. After I bombarded it with some artillery shells, it rammed my ship into a cliff, throwing me out the side. I then grabbed it with my grappling hook, and proceeded to unload a handheld minigun into its face while desperately trying not to fall to my death or get electrocuted. How many games have boss fights like that, let alone ones you can get creative with? Seriously, go punch a whale and have a blast.",
            "review_score": "1"
        },
        {
            "review_text": "This kept me going for hours :) awesome sandbox with alot of building and crafting and exploring :) just my cup of tea",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game even though it was never finished, sadly. Yes it can be buggy and there are things missing, however it is still very pleasurable to play. It has elements of Terraria with Airships. I still hold out hope someone decides to pick up the reins and either finishes this game or starts over and recreate a game with similar aspects plus more. This game to me is worth the cost and I have almost 200 hours into it. If you are a person who only will play perfect polished games don't buy. If you give this game an honest go, you will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "There is a chance that when you purchase this game, it will only run for a few minutes before you receive an error relating to your graphics card. First the devs said they were prioritising fixing this error and have since said they are working on other errors leaving the game completely unplayable to many of its buyers. I recommend downloading a cracked version to test the game first.",
            "review_score": "-1"
        },
        {
            "review_text": "Unbelievable ... they release it and it still crashes with no reason after 20-30 mins... Come on?! I want refund... :| Or fix damn crashes ...",
            "review_score": "-1"
        },
        {
            "review_text": "Ok; so this is a *part-review* meaning i havew only got to the first town so will not be a *full-review* and will try to keep updated as i experience more of this AMAZING game:  First, a little note to ammount of *how many games in-one* this game actually is - Terraria? CHECK! Contra? CHECK! Gods? CHECK! (that old platformer from the 80s/90s?) no idea why i think its like gods though lol.  Ok, so this game takes place in a Steampunk world/universe, where everyone HAS to use air-ships (due to the fact you have FLOATING ISLANDS!!! and no... *terra-firma* as such. You also have... SKY-WHALES ! which i think the story centers around (the Sky-Whale population is dwindling, due to the fact that this world lives off sky-whale by-products (meat to eat and oil for their industry) so it is your job to find a new (or OLD) peice of tech, so the world can survive.  Now the review.  Pros:  + All-of-the-above-games-listed-in-one-game!!!!!!!!! + Creative/survival/platformer heaven!!! + 100% destructable (and creatable) evironment!!! + Old-school graphics (LOVE IT!!!!) + Rpg (leveling - kind of) and quests + Main story (you actually have a POINT) + Proceedurally generated (kind of)... the islands are the same, but their locations in the world + that of their loot/minerals will change on every playthrough + The price for what you actually get!!!  Cons (ARE there any???)  Ok, the only cons i think there are is that this game does NOT hold your hand (appart from the *lip-service* tutorial)  Other people might think all of my above *pros* would be *cons* if they don't like that kind of thing; if this is the case? Don't even bother with this game!!!  10/10 would destroy the temple again! ;)",
            "review_score": "1"
        },
        {
            "review_text": "I was avoiding this game in my library because of all the bugs I heard of. After a long day, I decided to try it. Get my own opinion. 5 minutes in, game crashes because I opened a door.   Also, the dogs have the worst hit boxes in all of gaming.",
            "review_score": "-1"
        },
        {
            "review_text": "dislike, two dimensions is challanging, building can be fun but challanging, too challanging... game can crash alot either by system or other problems... saves dont always work... got so frustrated i gave up and wish i had picked something else",
            "review_score": "-1"
        },
        {
            "review_text": "whale came down and picked up my house game of all years",
            "review_score": "1"
        },
        {
            "review_text": "I got this game a few years ago and thought it would be fun. and it was... for a few hours. then it just became tedious and the only reason I kept playing was to finish the game. AND I DIDNT EVEN DO THAT! I had to look at wikis and guides for almost everystep and I eventualy gave up and deleted it. this game has so much potental! It really does. But it need work. The story and skills to name two. I could go on and on about things I would like and things that need to be fixed. I have a list (Really).   Dont get me wrong! I love the concept and idea, its a fresh take from 'Just survive'. if this game was 'improved'with the Devs taking advice from the playes then I will 10000% give this game a 10/10, but for now, sadly its getting a 4/10 for now.",
            "review_score": "-1"
        },
        {
            "review_text": "Since Terraria is a clone of Minecraft (although it actually has merits) and this is a clone of Terraria, I get to bust out the sadly-overused:  OH, LOOK. ANOTHER ♥♥♥♥♥♥♥ MINECRAFT CLONE. STOP. MAKING. THESE.  Seriously, I could rant for hours on how many boring games are ♥♥♥♥ out to try to cash in on Minecraft's success, but I'll leave that for another time (i.e. never since I'm too lazy). Windforge is probably floating around near the bottom of that group of garbage, since it's more or less actually painful to play.  It's glitchy, broken, boring, abandoned by its devs, and crashes more often than a plane with one wing. The airship is kind of neat as a basis for crafting, but it's unwieldy and annoying to build/fix, the map is unnecessarily broken up into segments (I think they were going for some kind of 'map sector' feel which is effectively just 'unnecessary transitions'), crafting is kind of irksome, combat is inconsistent, and finding materials is a chore. Items glitch through the ground all the time, blocks are unnecessarily small compared to your character so trying to do any kind of 'mining' takes forever, cities and maps are messy and annoying to traverse. Instead of making me mad at how terrible it is, however, it just makes me sad, since this is obviously just the developers going 'Hey, Minecraft is good, let's make Minecraft except 2D and steampunk!' rather than having some kind of originality.  It's not rage-inducingly bad, but I think Windforge is a good example of how the gaming industry is getting overfilled with crap pushed out by people who don't care and paid for in advance by idiots with no sense of financial responsibility. I got this from some Humble Bundle or other, and I wish I could return it, my library is already filled with 'It's Minecraft except _______' games that piggyback onto Humble Bundles and other deals to try to spark some life back into them. Just let them die, please. Stop rewarding people who don't deserve it.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. Steampunk flying-island Terraria with airship combat. Too bad it has no multi-player co-op, it'd be so perfect. If you liked Terraria (personally, I loved it slavishly), then I  STRONGLY RECOMMEND  Windforge.  As with other games in the Terraria-clone genre, it has crafting and fighting and harvesting and so on, and all of that works well, although not necessarily better than any other game. Crafting requires you to collect recipes in the world, which you could view as good or bad.  The questline/plot is entirely adequate, and the pacing of the plot is very good. In particular, I always knew what to do next if I was bored with crafting/mining/whatever, but I was always free to go at my own pace. But also, I was also never forced to stop following the plot to harvest resources. This was really well-done game design (and rare!). On the other hand, the plot itself, while above-average for the genre, wasn't amazing. Really, it acted as an adequate skeleton to hang awesome gameplay on.  Airship combat was really satisfying. I admit, I descended into outright piracy for a while, as I gave in to the thrill of chasing, damaging, boarding, looting, and scuttling. I'm not proud of what I became. Well, except for rich. I'm proud of the 'rich' part of what I became.  Actually, speaking of becoming rich by doing things I'm not proud of, I'm also not entirely proud of the map segments where I strip-mined entire islands. Like, removing entire islands, reducing them to their consituent parts, and selling them. Lucrative as hell, though.  I love games with grappling hooks, and this was a particularly good grappling hook. Fond memories of the Worms ninja-rope were evoked, and amazing ninja-moves were executed (mostly by accident, but I'll still remember myself as a badass).  I found the boss-fights pretty easy. Although I did tend to over-prepare, which is what a game like this lets you do if you want to. They were also not very different; the same strategy or two seemed to dominate every major fight. It didn't feel bad, but boss fights were not as thrilling as ship-to-ship piracy.  I sure wish it had multi-player co-op. Ideally with harder challenges to match, especially harder enemy ships. That'd be so freakin' awesome, holy hell.",
            "review_score": "1"
        },
        {
            "review_text": "Dove out of an exploding airship, landed on a skywhale. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game is an amazing experience. I don't see the reason why people see this as a ripoff of terraria",
            "review_score": "1"
        },
        {
            "review_text": "Out of all the games of this sidescrolling genre started popping up everywhere. From Starbound, signs of life, to Craft the World, and Terraria. This is the most unique and under estimated. This game when actually given a chance, really is fun. Being able to build a giant flying fortress is fun. Like Starbound this game follows a story and has missions. Tho it's not as apparent in Starbound, this one is. Honestly I love having the direction. The content and mechanics of this game make it a lot of fun. Having a grappling hook adds to the game in a very good way. There isn't really a solid ground persay, everything is floating islands with vicious pirates and creatures. I love it and I wouldn't want them to change the main mechanics of the game at all. It's inexpensive with a lot of longevity and creativity. Worthy of anyone's time who enjoys the genre.. I'm a very picky gamer, but this one is possibly the best of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Its actually a pretty good game! Yeah sure it needs some polishing, etc but aside from that its quite enjoyable. I dont regret getting it.",
            "review_score": "1"
        },
        {
            "review_text": "its a mix between terraria and Indiana Jones good game,good graphics,nice physics what else could u ask? GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Conceptually a great game, with two major flaws that became apparant in the beginning:  Lag. Oh god the lag. And absolutely no graphics settings beyond resolution and zoom level (you're stuck with your massive texture quality, shadows and all other graphics settings!). This gets worse the more effects are in the game (oh god the particle effects).  Randomly generated maps. So, random maps are cool. However... temples can be enormous. Enormous and identical. Whoever built these temples wanted people to get lost and you might spend hours going through boring rooms trying to find the *one* room that contains the tablet you actually want. Because that's why you're in temples - to get tablets. And there's one. Out of about 200+ random rooms. That all look the same. And aren't necessarily connected. I like random, but this might have been a bit overdone.  Oh yeah, and as you explore more and uncover more of the map, the game lags more. Because it now has more stuff to handle in the background.  On a neutral note, a prototype screen where you could design airships and then build them in one go if you have the necessary materials would be kinda cool. No need to try to build a hangar for it and then piece by piece build it in a (lagging) city or island.",
            "review_score": "1"
        },
        {
            "review_text": "At first i was like 'Hmmm, this game sucks' (mainly because of the mining), but i kept playing a bit longer, and i quickly realised that i was wrong! The mining is a bit crappy, i admit that, and the bosses destroy their own temples, killing you with falling dmg. But BOY OH BOY what a nice game it is! first of all, you can craft your own airships! that's already a good reason to play this game! Also, you can hunt whales, mine in them and even make them into your own personal airship! And for those who prefer to fly around without the use of an airship, you can craft cloudstone armor, which makes you fly bigtime, combine that with a gatling gun or a shotgun and you have your own personal, ammo consuming, jetpack! I think this is a great game and i recommend everyone, that doesn't play games for their graphics atleast, to try this game out, especially if you love games like Terraria, Minecraft, Starforge, etc. etc. etc.",
            "review_score": "1"
        },
        {
            "review_text": "wanted to play, got stuck on loading screen after the temple...  will fix when i can play",
            "review_score": "-1"
        },
        {
            "review_text": "granted, i couldn't stomach it after 40 minutes so take this for what it is, 40 minutes  * quirky physics combined with too much jumpy jumpy * strange hit testing and animations for bullets (hits that pass through, hard to tell if you hit,...) * odd attempt at blocks which are 2D isometric visually * poor timings on autosave, what?  some may like but for me i couldn't take the physics of jumpy jumpy... seems like the speed and distance characteristics are off (feel like you are moving too fast, jump distance based on speed doesn't make sense, ...)  ",
            "review_score": "-1"
        },
        {
            "review_text": "Game could have been good, but unfortunately it suffers from a lack of any real development. Not sure if devs died or something; but this game has been unfinished for a long time now and nothing is being fixed.  Edit:   Looking back over my review of this game, I think I really shouldn't un-recommend this game just due to that. Infact I do recommend this game, it's got some rediculously fun shinanigans that can happen in it. The only major downsides are that the physics are a bit wonky, the bosses suffer from horrible AI at times and are all pretty much the same, and the majority of the universe feels- boring. If you want to simply pull off silly stunts all the time or make a rediculous atrocity of physics, then go ahead and play the game, if you expect an entertaining story-line and polished gameplay, I suggest trying it, seeing how it makes you feel, and then probably playing something else.",
            "review_score": "1"
        }
    ]
}