{
    "app_id": 266210,
    "name": "One Way Heroics",
    "release_date": "2014-02-28",
    "developer": [
        "Smoking WOLF"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Rogue-like",
        "Indie"
    ],
    "achievements": 59,
    "positive_ratings": 3349,
    "negative_ratings": 199,
    "price": 2.29,
    "description": "Across all dimensions, the only constant is Darkness! A procedurally generated RPG-roguelike journey across the multiverse! In One Way Heroics, you take on the role of an intrepid adventurer who must travel across the land and face the Demon Lord before a mysterious darkness engulfs everything.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/266210/header.jpg?t=1555560937",
    "minimum_requirements": "OS: 2000, XP, Vista, 7, 8, 8.1, 10 Processor: Pentium III 1.0 GHz or better Memory: 256 MB RAM Graphics: 800x600 resolution or higher DirectX: Version 9.0 Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Being a big fan of Anime, turn based RPG's and rogue-like games, I was very curious with One Way Heroics, having an accessible price, I decided to risk buying it and check it out, truth be told I would never thought I'd love this game so much as I do, it completely caught me by surprise.  The mechanics are quite simple, you're forced to go eastwards in an 8 character string world (that is randomly generated each play-through) in order to avoid a mysterious mist that is covering the planet.   Each decision you take being a dialogue option, attacking, defending, healing, equipping and so on, will be counted as a turn, each turn you do the mist will also do his in parallel so you'll have to make sure to not fall behind or your play-through will be over, so you'll have to have special attention to which decisions or paths you should take, sometimes you'll feel compelled to explore a dungeon and find new items but the mist can prove to be too risky since you'll always have that constant threat looming next to you.   You have different ways of ending one play-through depending of the difficulty and the game mode you're playing, you can achieve victory by killing the demon king, by reaching the end of the world, by killing a secret boss and so on, in order to spice it up the developers decided to make some random events, cities and quests to make the game more interesting and more unique in each play-through.  The game UI is quite simple and it does well its job, the game soundtracks are fun and memorable but they can get a bit repetitive after a while, the art style ain't phenomenal by any means but overall it has an interesting and unique presentation to it.  The game is very affordable and full of content, it has great replay value, so I'd like to recommend to all of you who is thinking about getting this underrated gem, you'll love it!",
            "review_score": "1"
        },
        {
            "review_text": "Sold everything I had to a poor merchant for silvers, made him get mauled by a bear, took the stuff he dropped, walked away with 50,000 silvers and all my stuff and extra, rinsed and repeated with every town I come upon. Got 999.999 silvers and became the richest man in the world where money doesn't matter anymore because everyone is dying. put on a bracelet that bloody merchant lying on the ground had, sacrificing half my stats but getting 3x experience, after 10 days I rose to level 649 and became an all powerful God. One-hit killed everyone I came across by punching it in the face. True story.  Actual Review of the Game: Totally worth the price when it goes on sale like the Steam Summer Sale and the Winter Exploration Sale where it gets to less than a buck. There's 8 classes (only a couple in the beginning), but 24 sprites to choose fun. The worlds are randomly generated and filled with a lot of content that take a long time to go through, finding almost a new thing everytime. After a long time, my brother and I went through every NPC, companion, items, and weapons you could go through, but it never got boring because it's so different (yet the same) every time! I just recently got the DLC One Way Heroics Plus and it has about 3x the content now comparing it to the original, much more aesthetics and features that got me into it again. The music that is seen throughout the different biomes, towns, and bosses is also really good enough that I put them on my phone because you can find them online for free. Its just awesome overall.  I r8 8/8 m8 no h8, it gr8",
            "review_score": "1"
        },
        {
            "review_text": "I use Zenura Weave, sacrificing my clothing for power. I go into a town and people judged me, the one that's saving them all, for not wearing anything. I run into the Demon Lord, who is a lonely reject hellbent on killing everyone in the world. Since we both weren't accepted, we ultimately joined forces and ran across the entire world together, allowing everyone of those townsfolk to suffer from the darkness.  All in all, this game is a beautiful story about discrimination, friendship, streaking, punching cute animals, and acceptance.",
            "review_score": "1"
        },
        {
            "review_text": "I'm no expert on roguelikes. But this game at base price costs about as much as a cup of coffee from a mid-market coffee chain. I've played it for twenty hours, and it still feels like I'm scratching the surface; after each run, I feel like I learned something about how the game works, about what it wants from me and how to succeed. It's a good feeling. The game is fair but challenging, and for those of us for whom that isn't enough, offers a highly modular difficulty system (base difficulty plus class plus perks, all of different usefulness) to challenge yourself with. There's incremental progress and upgrades to unlock if you'd rather have a barometer of progress other than your own growing skill at the game, which is difficult to quantify, but grinding for these things isn't really an issue -- classes and perks are pretty cheap, at least for the useful ones, and everything else is bonus stuff.  If you buy the expansion, you're basically getting a game that has double or triple the content of the base game, and also includes a whole bunch of quality of life UI upgrades and balance changes. A lot of the things added are very simple and unobtrusive but satisfying -- things like turning to face the enemies automatically, a little screen to track all of the things you've achieved as each class, more dimensions to facilitate the psuedo-multiplayer. Other additions are bigger -- new classes, new allies, new npcs, new bosses and objectives and missions. While the price of the dlc is triple that of the base game, it's absolutely worth it -- even more so if you can get it on sale. The hours of gameplay/$ ratio is excellent.  It's also in the class of games that are easy to play while doing something else, like holding a skype conversation or queuing for a match in some other game. It takes very little processor power, deals with tab switching quite agreeably, and time stops while you aren't moving.  All in all, I think it's a great way to spend an hour or two between doing other things, and ends up being quite moreish once you've wrapped your head around the basic steps to survival. Then, it's all about the rng and your own wits. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game on a whim when it costed less than a euro during a steam sale. Had I known it was this good, I'd have bought the game at full price on release. One Way Heroics is a roguelike in a more traditional sense of the phrase, while taking massive hints from FTL's style of one-way travel and resource managment.  What's especially surprising is how addictive and fun the online elements of this game are, as there is an option to join a world with multiple people already in it. The special seeded levels that rotate on a daily basis add some serious life to the game as well.",
            "review_score": "1"
        },
        {
            "review_text": "Oh dude, this is just so damn cool!   Great for quick sessions, surprising depth of play, multiple classes, a cool unlock system based on Hero Points for each run, rogue-like (perma-death), a vault for item transfer between plays, cool boss battle, and not too hard for newies to the type to get into. Seriously, A+ and an absolute STEAL at the price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing.  You start by choosing a class and up to 5 perks, but you will have to unlock most of these first. It's fun trying different combinations and seeing how they play out.  The map is determined by the seed you choose, you can pick a random one, enter one yourself or choose one of a few daily dimensions that are altered in a special way. The game is rogue-like and turn-based, dying means perma-death. During your run you will explore the map, find loot, kill monsters and other enemies, level up, talk to several NPCs who offer various services, recruit NPCs to help you fight and finish your main quest (which is usually killing a boss).  Every turn the darkness behind you consumes a little bit more of the map, so you have to keep progressing forward and think carefully about if you'll have enough time to explore a dungeon or visit a town. Normally this isn't really a problem, you can easily outrun the slowly-progressing darkness. In case of emergency you can use your Awakening ability up to 5 times, which stops the time for 3 turns so you can get yourself out of trouble.  Usually whenever you die, it is because you weren't careful, you will learn from most deaths. Most of the time there are ways to save yourself, but you just didn't try or think of everything or were too cocky, though of course there are also times when the game really seems to hate you.  There are multiple endings depending on how you beat the game and which NPC you have with you. Moreover when you beat the game you can store some items in your vault, which you can choose to use at the beginning of each run.  Lastly, it's a single-player game, but while playing the game online it will show you details about other players who are in the same dimension and occasionally you will meet ghosts of other fallen players who will drop one of their items and give you experience. Furthermore after clearing a dimension it will show you the characters of everyone who completed it as well.  For the price, especially when it's on sale, it's a steal. I definitely also recommend buying  OWH+  if you already enjoyed the base game, it adds a lot of new content.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah it's pretty good, but if you take out all the good stuff, it's pretty bad.  ",
            "review_score": "1"
        },
        {
            "review_text": "I paid 86 cents for this on sale, and it's one of the best damn games I've played all year. The concept is clever, and the execution is basically flawless. OWH has more polish and apparent effort put in than a lot of games from big studios. You can pick it up and play without too much investment, but there's more depth than is initially obvious. Repeat plays are encouraged with daily worlds, higher unlockable difficulties, new classes/perks, and lots of secrets and extra endgame content. The graphics, music and translation/humor are also spot on. UUUUUUGH JUST BUY IT",
            "review_score": "1"
        },
        {
            "review_text": "It's a roguelike with pressure ever looming to the left side of the screen, in the form of a shadow engulfing the world. You must travel to the east, hopefully getting stronger along the way, because to the far east, the Demon Lord, who summoned the darkness, awaits.  Key features: - JRPG look and feel - No location transition; everything happens on the overworld map - Shadow pressing you to move on vs stick around longer to explore more of this town/dungeon - Turn-based - JRPG style menu system - Running non-stop, your hero still require sustenance - Items have limited durability - With each death (or victory) you gain hero points, which can be used to purchase more options (and thus more freedom) in future games - Item vault to transfer items to your next characters. Item vault size is expanded by using hero points - Unlockable classes - Unlockable perks - Randomly generated world with a short text-based random seed - Many features in the world which you can explore. (I found some high-end merchants hidden inside a mountain once. Was too slow to get back out). - You can replay a world by entering the seed - Fast paced. You can easily win a game in one sitting - Online events everyday. There are worlds with special rules which you can play in - Multiple difficulty levels can be unlocked - Great attention to details that will make you smile - Steam cards and achievements  This $2.69 will be the best $2.69 you've ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME!!!!!!   Imagine Final Fantasy (art style), Binding of Isaac (replay value), and Spelunky (random generated world) all mix in one game!  Extremely addictive and tons of replay value.  It's totally worth the price and I totally recommend it to any old school gamer.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best 3.00 investment I've made in a long time. A fourth the price of other games, and already more hours logged.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game , worth up your time to play it . Might be hard for the beginner , but then it went more easier later in time . It also has many character to play with .",
            "review_score": "1"
        },
        {
            "review_text": "Darkness is always in the persuit! good fast paced game for people who like to die alot",
            "review_score": "1"
        },
        {
            "review_text": "This game is very deep and gets more complicated the longer you play.",
            "review_score": "1"
        },
        {
            "review_text": "Very charming roguelike, it is very relaxing, challenging and got personality. Great music, simple but good graphics.  About the gameplay, its very straightforward, you customize your character that should keep moving ahead otherwise the darkness will eventually catch. Many artifacts, many recruitables, many configurations, online mode... Its hard to explain, lets just say that its really fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really nice, even if you have to do the same thing over and over the fact that you can generate random maps and that you have to flee the dark wall it make it nice each time, I had a great time trying to unlock everything, and trying to get the best weapon i could save in chest.    I Would defenetly would reccomend this game to all those you doesn't care about graphic and care about the fun time you can have playing a game. This is one of those time i can say i got my money well-spent.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot more addictive than I first gave it credit for. The randomly generated worlds are done well for the most part and you gain access to multiple classes that change up your strategy. One Way Heroics looks simplistic and barebones from the outside but I've had a lot of fun gradually unlocking more options to play around with. I'd say there's plenty of content for the money.",
            "review_score": "1"
        },
        {
            "review_text": "Why not?",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! You won't get a game this good for just 3 dollars. There's vast amount of contents in the game, and the replayability is very high. Lots of classes, lots of items, new maps with new stuff etc.",
            "review_score": "1"
        },
        {
            "review_text": "Game was awsome, i love this one :D.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated and unique turn-based roguelikes on Steam. There are many elements that are similar to that of more traditional roguelikes, such as slaying monsters, leveling up, and collecting loot. However, unlike any other game in the genre, there's a looming wall of death that draws closer to you ever turn, forcing you to flee to the right. There's little time to stop for breath and allow yourself to heal; if you don't keep moving, the wall will devour you and end your game. You'll stumble across towns and dungeons where you can buy or obtain items, or slay enemies for experience, but even those will soon be engulfed in darkness. As if things couldn't get any worse, every so often the very powerful Demon Lord will spawn and try to end your quest before you become strong enough to kill him. Early on in the game, you'll have no choice but to run away from him, because luckily he'll be forced to retreat after a pre-determined amount of turns. Either way, it's another unique element of the game that you'll be forced to plan around.   Oh, and there's plenty of other rather spiffy features you might not expect in a game this cheap. There's a decent number of rather diverse classes to play, unlockable perks to customize your character, multiple difficulty settings, daily challenges with unique gameplay twist, limited interaction with other players online, selectable world seeds... oh, and you can post the results of your run to Twitter. There's that. But seriously, there's no reason not to try this game. It has plenty of depth and replayability, and it's only a few dollars. If there was anything bad I could say about it, I suppose the graphics could be better? Who cares, it's a roguelike. Half of those are in ASCII anyway. Get on it, yo!",
            "review_score": "1"
        },
        {
            "review_text": "super great oldschool style japanese style roguelike game. unique mechanics, cool online features, great replayability  best value for the few bucks it costs. this is a REAL roguelike-like unlike the other babified dumb games w/ lite elements that come out these days",
            "review_score": "1"
        },
        {
            "review_text": "super great oldschool style japanese style roguelike game. unique mechanics, cool online features, great replayability  best value for the few bucks it costs. this is a REAL roguelike-like unlike the other babified dumb games w/ lite elements that come out these days",
            "review_score": "1"
        },
        {
            "review_text": "Magnificent, amazing, it triggers you to go ..again..and again..and again.. and you hate when you break that ultimate tweaked item. You hate when the darkness did catch you or when you hit into a monster that was wayyy too strong for you..but ..you have to play again.... you cannot stop.. .. Awesome! ",
            "review_score": "1"
        },
        {
            "review_text": "I have had so much fun just choosing classes going into randomized generated worlds and seeing how far my perks and class can take me. I sometimes wish there was a survival mode just keep going to see how far you can get.  I love the simplistic feel and nostalgic feel of the gameplay and graphics. There are unlockable classes. Its got great replay value. Exploring class and perks with each adventure gives you the power to challenge your self.  ",
            "review_score": "1"
        },
        {
            "review_text": "A greata value for the cost, I am getting plenty of enjoyment from this game. Its a highly replayable game which requires learning and strategy to get to the later and more difficult areas. It rolls over loot and allows you to unlock abilities for new starting characters. I say, worth the price. Kudos",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the world of One Way Heroics. You can play as multiple characters while you travel to the right side of the map at all times for a great darkness follows and swallows the world behind you. Do you have what it takes to manage the up coming challenges and escape the creeping death while facing the dangers ahead?  Starting off the king sends you upon a journey to escape the darkness and find the truth of what is happening to the world, you take the challenge before you and must move and leave behind the castle. Once on the move you must use cunning and skill in a semi turned based, rogue-like, RPG full of challenges. Bosses await your arrival at certain intervals, the randomly generated map will keep you on your toes. Decisions will have you staring at your screen for minutes at a time. Should you use that ability to save your life or keep pushing yourself to the limit for the slim chance of victory.  I expect to be placing alot more time into this gem. It has an excellent amount of difficulty and a very unique type of gameplay with the grid system, in-depth attributes, weapon enchanting, and item management.   I highly recommend this game, thanks for reading.",
            "review_score": "1"
        },
        {
            "review_text": "Iris is qt3.14  Seriously though, this is a cute little time-killer sidescrolling roguelite with a mechanic that forces you to move forward or be swallowed by the encroaching darkness coming from the left side of the screen. Simple mechanic, but effective (should I risk racing for that chest I just spotted near the left or move on?) Very lighthearded, doesn't take itself seriously at all. Pretty satisfying, with solid turn-based grid gameplay and plenty of fun classes and skills to unlock.",
            "review_score": "1"
        },
        {
            "review_text": "Walk in a straight line, attack what-ever you want, die. Wash, rinse repeat. That is how the general gist of this game progresses. There isn't a whole lot of depth to the game, there aren't many weapons, aren't many variations of enemies, no characters you really connect with, the map areas are general generic type fanatasy locales, and no real story line (other than to stop The Darkness) which is stated in the opening 3 seconds of the game. However this game has something going for it... charm.  If that sounds silly just run with it for a moment. There is very little to do, or really unlock that can't be done easily. Unlike the game that drew me to this (Faster Than Light) you can unlock everything in nearly 5 hours, the remainder of the time will be playing with these unlocks. However the goofy commentary from the few NPC's you do find are enough to distract momentarily from the humdrum of walking to your right. That is where this game gets its charm from. The constant breaks in the basic mechanics of the game for a fun, light hearted gab between pixelated characters.  Finding all the secret endings and characters endings will be what make you come back to this. The small morsels of charm that you get are what will make you enjoy coming back to it. However, don't expect to be able to play this for long periods of time. I found that the game is best when played a few run throughs at a time. Any longer than that and the charm kinda wears off and the simplistic nature of the game robs from its potential.  Additional peripheries were pretty decent as well. The music is fun to listen to but after prolonged time periods begins to grate at your ears. The graphics are simple enough and give it a classic RPG feel that allows me to relive the days of early Final Fantasy's. Mechanics are simple and will be picked up with one minute of playing.  Feeling in a good mood today so let's give this game an eeked out 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good that I really want to make 100% achivement, very challenging ^ ^ *Totally worth it's money. *Awesome music, can listen for hours 'infected village' track!  *Cute art. *I love DL :3  Great game 10/10.   In our life there can be only One Way Heroics..",
            "review_score": "1"
        },
        {
            "review_text": "It's basically a JRPG combined with a roguelike. There's a big amount of content for the price (which is even cheaper if you buy it off of Playism), including varied classes, daily challenges/runs, hidden endings, and more. It's not too difficult for beginners to get into, but hardcore roguelike fans will still find challenge in the harder difficulty modes. It's really addicting to see how far you can get in a few hours, and you can compare how well you're doing against other players on the same seed in real-time (you can even post your wins/losses on Twitter #OneWayHeroics).   Some people might complain about its lack of depth; don't expect a complex turn-based combat system like in  Final Fantasy  or a deeply complicated and engaging story. The real fun in this game is in how easy it is to pick up and play. It's definitely worth the price, and it has way more replay value than most of the games priced at $5 - $10 here.   TL;DR - Probably the most fun, easily accessible Roguelike you'll find on Steam that's under $5.  :)",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics is a unique game. While at first it seems a little grindy and nearly as death embracing as Dark Souls underneath this veneer the game sparkles. It has some great classic (cliche if you will) story segments that are randomly generated each time you restart and also it has a slight dry humor to some dialogue whichis quite refreshing. The music is beautiful and suits the game and does not become annoying. Perhaps the most astounding thing is that the creator found that other game creators couldn't meet his system needs so he built his own! (WolfRPG) which is quite a feat. Though it would be hard to integrate some multiplayer DLC or sequel would be a great addition to this title. I highly recommend this since it comes at such a low price!",
            "review_score": "1"
        },
        {
            "review_text": "In addition to the Steam version, I've also logged another 50 hours on One Way Heroics Plus. Even at full price, it's totally worth it, if you're even tangentially into procedurally generated roguelikes.  PROS: Three dollars at full price, and constantly going on sale. Several ways to beat the game. Nearly infinite replay value. OWH+ has already been released on playism, and adds even more depth to the game. Nobody is immune to anything. If it says it works, it will work. No more pesky 'Poison only works on player, but not bosses' nonsense.  CONS: dated graphics Weapons are hard to keep forever (Not that you need them, but you grow attached). Poor scaling for super long runs. There's no setting between 'You slaughter this guy' and 'You die in one hit'",
            "review_score": "1"
        },
        {
            "review_text": "Forced-Sidescroller meets RPG in a game where the world can be generated a hundred different ways.  Good notes: High customization options, good feedback system to help you out, unlockable content makes each run feel like a step forward, replay data is semi-entertaing to watch, and a system with depth to items/combat.  Neutral notes: Well executed 8 bit stlying, faux-multiplayer in which you interact with the dead and recieve semi-selective notes from other players (only available in that day's multiverse world).  Bad notes: Even on full screen the text may still seem a bit small and some world combinations (I've only found 2 and have entered no less than 25 worlds) are less than enjoyable due to constant mountains or being nearly devoid of interactable content(villages/dungeons/chests)  With all of that said, I give this a full recomendation if you enjoy a rogue-like.",
            "review_score": "1"
        },
        {
            "review_text": "Great little Rogue RPG game. I enjoy the one way, pushing you forward and making it more difficult at times than many RPG's where you can easily rank against low level enemies etc. Reasonable range of weapons and enemies, nice music, and the world generation makes the gameplay much less tedious than it would be without. Alot of great features. Sometimes you can come across a Golem or ambush at a low level and get wrecked by it, and a little more customisation wouldn't go amiss, but for £2.29 who can complain! Well worth the money and well worth a try! 8/10 for a low price Rogue style game.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an enjoyable Japanese roguelike that forces you to move forward and die the first few attempts. If you can get over the graphics and you enjoy roguelikes then you should have no problem at all getting your money's worth out of this title.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely great game with great replayability a) do quick runs when you don't have enought time b) use your 'dimensional vault' to carry over your favorite items c) gain points to get new perks and classes which you can use in future runs  I have so far passed the 400km runs with Swordsman, Knight, Hunter and Adventurer. I have started to search for some info on the net and it looks like you can go up to 2000km with some skill and good gear. I need to test that.  Also competing on the same maps against other players to see who can get the most out of it and regular 'quest' runs make this game even more awesome. I still have a lot to learn about this game, but I already like it a lot.  The only thing I don't like so far is the fact your gear depreciates and breaks and it is not so easy to repair it. I bond with my gear emotionally :-) and it hurts when I loose it :-)",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely great game with great replayability a) do quick runs when you don't have enought time b) use your 'dimensional vault' to carry over your favorite items c) gain points to get new perks and classes which you can use in future runs  I have so far passed the 400km runs with Swordsman, Knight, Hunter and Adventurer. I have started to search for some info on the net and it looks like you can go up to 2000km with some skill and good gear. I need to test that.  Also competing on the same maps against other players to see who can get the most out of it and regular 'quest' runs make this game even more awesome. I still have a lot to learn about this game, but I already like it a lot.  The only thing I don't like so far is the fact your gear depreciates and breaks and it is not so easy to repair it. I bond with my gear emotionally :-) and it hurts when I loose it :-)",
            "review_score": "1"
        },
        {
            "review_text": "A good game for it's shockingly low price.  A low price and can be played again and again.",
            "review_score": "1"
        },
        {
            "review_text": "An oddly satisfying game... You initially feel like it won't be much, but you get the feeling that 'you can go just a little further next time'.",
            "review_score": "1"
        },
        {
            "review_text": "Really caught me off guard how addicting this game became. I played it for around 2 hours before I realized I was focusing so hard that I was leaning forward into my chair. It offers an almost endless challenge. Would certainly recommend to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, well polished, and surprisingly deep lightweight roguelike experience. Easy to play in short bursts or longer sprints and quite enjoyable to a variety of skill levels. If the game looks at all interesting to you, drop the ~$3 and give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "This game, despite being a little difficult to get the hang of, is good fun. I is a combination between Rouge Legacy, Finaly Fantasy, and Mario (the fact being you can only go forward, never back). The procedurally generated worlds adds to the complexity of the game. If found myself making character sheets of past characters so should i find a weapon that suits them in a run through in which the weapon is useless, i can stick it in the storage and make them the header for the next run. I've also found myself becoming addicted to the worlds i create, wanting to defeat them before I create a new one. To paraphrase, this game is a refreshing bundle of originality, ingenuity, whilst also winking at the games from the Ninetys. In a way, this is a less masochistic 16-bit version of Dark Souls.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game and for only a few cents definately worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, Frantic and pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very innovative, and whilst playing I can't help but bring to mind Half Minute Hero as well. If you've played that and enjoyed it, you'll love this. This game is very fast paced, and if somehow you manage to plow your way through it immediately (good luck) you will have only spent 30 minutes on it. However, the game's replay-ability is it's biggest feature. Each victory ends with more loot, more rewards, more knowledge, and more challenging modes to continue playing with. The game is endless hours of fun, and I must say it is well worth the small amount of money it costs. ($3.00 For anything that lasts for hours and hours is a good deal, regardless of what your interests are.)",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant and unexpected mixed-itteration of roguelike/rpg. Go in blind. The game throws a lot of subtle class and humor, along with solid game play, try everything, don't be too afraid, you can't really mess this one up, because the game didn't.  Does almost everything right except maybe the resolution, which can be a problem for steam announcements, as they get in the way of play.   For the price, maybe one of the best cost/playtime ratios of any game out there. Highly recomend to anyone who is a fan of either roguelike or RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Simple, addicting, and well worth the purchase! And with it being on sale right now it's a steal at the price. Has progress methods like rogue legacy, and that simple snes feel to it. Great way to kill some time :)",
            "review_score": "1"
        },
        {
            "review_text": "I had about a dollar and fifteen cents on my steam wallet and thought that I was only going to be able to get a garbage game when the steam sale came. I was so wrong this game is rather confusing at first, but once you get the hang of it, it's rather interesting. I have almost unlocked all the classes except for the hero class and have barely touched the perks. I know there are people you can get to follow you which I haven't encountered yet not for lack of looking that is. It is a great game and I would say it's worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the perfect example of a hidden gem. It's not well-known and very cheap, but god damn is it entertaining! So, want a challenging game with a lot of charm and lots of variety? - Play this!",
            "review_score": "1"
        },
        {
            "review_text": "Don't play if you like to backtrack",
            "review_score": "1"
        },
        {
            "review_text": "A really good mini game. Didnt expected that.  Pros:  Cute and somewhat sad story when you die (didnt reach the end yet) Fun gameplay for once in a while when you have nothing to do :D  Cons Its says multiplayer game but even though i can see the players name on the screen, i cant see them on my way !  Fast deaths Frustrating if you are a noob like me x,d",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure brilliance is a small and simple package.",
            "review_score": "1"
        },
        {
            "review_text": "a damn good game definetly worth picking up though it would be insanely hard but its actually not bad if ur good at turn based games :P",
            "review_score": "1"
        },
        {
            "review_text": "The game is amazing. I'll elabore below.  I'll start with the bad things i saw on my first minutes.    Negative",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing, it's something that you can totally use to burn time, explore a vast randomized world where every encounter is different. If you like old school rpg's then this will definitely satisfy you.",
            "review_score": "1"
        },
        {
            "review_text": "This is seriously one of the best fast paced and turn based game i have ever played. You'll discover something new everytime as long as you get far enough. Many classes to fit you. Different difficulties, party members. This game has it all. I would highly recommend it to all those who likes these kind of games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is well work the money. you will get a large amount of game play out of it and even when you get tired of it, it will only be for a few days. the only bad thing i have to say is that it does not explain things as well as it should it kind of just points you in a direction (the direction being left) and says kill the demon king. Even with the game doing this once you get used to it, it will be well worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "For those who like 8-bit era this game can be an option.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously I can play this whole day long. Pretty impressive for a WOLF rpg maker game.",
            "review_score": "1"
        },
        {
            "review_text": "A really simple yet deep gameplay, even comes with surprises and secrets worth playing and recommended for its low cost gives a lot of fun time",
            "review_score": "1"
        },
        {
            "review_text": "AWESOOOOOOOOOOOOME! Get it fot less than a dollar, one of my best rogue-rpg games.  Incredible! Long time ago I want some developers create a old school rpg rogue game! Cool story, easy gaming, random worlds and random items! I like that! If you like kind of RPG games, Old School and adictive games! I reccomend you OWH! Love the gameplay, one of my favorites!",
            "review_score": "1"
        },
        {
            "review_text": "Very hard to get used to the controls for some reason, but once you do the game is amazing, i suggest playing it while watching a walk-through for it so that you can better understand the world you've entered. The game itself isn't inherently hard, but you have so little to work with that it takes getting used to. Warning to new players to stay away from Golems, they have set spawn locations per world and they are nasty with or without an axe (which does more damage to them).  Characters can be unlocked with points rewarded for your progress after each death or by completeing a certain feat. You can use these points to get a vault and add space to said vault. The Vault NPC is in the set spawn for each character. I recommend always keeping a Key of Seals in the Vault if you manage to come across one. Keys of Seals are used on Temples and can give you Holy Artifacts. My first holy artifact was an Axe that crushed everything before me. By the time it had worn down i found another temple and another key of seals, and got a Holy Spear and Holy Chest Armor. Made it the last 80 km to the Demon Loard and killed him with no struggle.   I've only gotten 2.8 hrs of playtime in the time of this review, but i could easily put 200 hours into it. It's cheap for it's value of entertainment, and if you end up in a poor spawn you can always just continue again.   More tips -Always buy from a Chef When/If you reach a town. They seem pricey but in actuality they are cheap and extremely valuable. -This game is about Trade-offs, you may end up choosing things that are detrimental to the world you spawn on. -More expensive is not always better, especially when you do not have a high enough Item-Appraisal to know what you are buying. -Randomly Generated worlds always have their problems, the largest map wrecker in this game is large mountain walls that you have to climb. They take a great deal of turns to climb and eat your stamina, if you find yourself having to climb mountains frequently you will die, and you may want to explore a different route or a new world entirely. -Chests in the water are also death-traps but if you can manage it, they may offer useful loot. -Teleportation Pills will save you from Bandits, Bears, or Golems. -Axes will destroy walls and chests with ease for better dungeon navigation. -Bows and Lances will help you kill your enemies from a distance, very beginner friendly weapons, unless you have no arrows.   Negatives about this game -   The loss of your character after completeing the game is without a doubt a loss, but the ability to save his gear makes up for it, despite the fact it is battered and will probably have to be repaired despite my deep loathing of the brittle debuff.",
            "review_score": "1"
        },
        {
            "review_text": "I can't say I've played many games where I can run around naked punching everything to death.",
            "review_score": "1"
        },
        {
            "review_text": "This is such a fun game! It has progression, it is rogue-like and the gameplay is really cool! You really feel like you're progressing whenever you finish a session, and how can you go wrong for such a great price!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable gameplay and nice storytelling  Also Zenura",
            "review_score": "1"
        },
        {
            "review_text": "I have only played for an hour and can tell you that this game is absolutely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I have not in a long time played such a roguelike that captures all the difficulty and strategy of Shiren the Wanderer style games, and successfully marries it with unique quirks of its own. This title is one that I can say really brings a completely new feel to the roguelike genre.  More in line with newer roguelikes, it is an easy to pick up, hard to master game with the freedom to tackle it how you please. The side-scrolling aspect of it keeps you on your toes and constantly vigilant. You're forced to move a quick pace to outrun the darkness, but are still given the ability to search for loot at as much leisure that can be allowed. In a way, this really brings the right level of tension and speed to the game. Not to mention the music. It really caught me off guard and I found myself humming many of the songs.   In summation, if you're looking for a new game to add to your collection this should be a prime candidate. The playthroughs are quick, but extremely fun. At three dollars, saying this is a steal is an understatement.  ",
            "review_score": "1"
        },
        {
            "review_text": "Let's keep this straightforward.  Put simply, this game is a roguelike mixed with JRPG elements. It is a charming little game with unlockables, challenges, &amp; leaderboards to keep the gameplay fresh. There are several difficulties, a handful of classes, and countless worlds to choose from, each with their own challenges, features, and obstacles to overcome. This adds up to a lot of content to play through, should you feel so inclined.  With the price it's at, there's really no reason not to buy it.  There's only one way this can go - will you do the right thing?",
            "review_score": "1"
        },
        {
            "review_text": "Seriously I can play this whole day long. Pretty impressive for a WOLF rpg maker game.",
            "review_score": "1"
        },
        {
            "review_text": "This game surprisingly fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "Very amazing sound track this is a turb based rpg with very awesome visuals i reccomed it highly for its price tag and if its on sale why not pick up a few for your friends?",
            "review_score": "1"
        },
        {
            "review_text": "Hello, my name is Alistair Baxter, and this game is like a Black One-eyed Scout.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a sidescroller that doesn't wait for you. Stuck in a mountain range? This game doesn't care. The darkness that is the edge of the screen will consume you. The enemies will all stab you for fun and if you attack animals, hippies will chase you to the ends of the Earth. If you decide to fight back against said hippies, you now have a bounty and can no longer visit towns unless you want to get shanked. This game is quite difficult and very fun. I'll also mention that it is currently about $.80. I would have happily paid at least ten times that price.",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics is a fun and easy to understand approach to RPG rogue-likes with features to help the player extend his own gameplay from a single playthrough.  We choose from a variety of classes with pickable perks and go on a random adventure. Encountered by enemies and time itself, we wander across endless open plains and underneath mountain ranges, find dungeons with lots of danger and treasure, find cities to sell our useless stuff to NPCs and head further east. This gameplay routine might sound boring and stale but is actuallly a really fun activity the more you play.  The charm lies in the different classes and the different approach of each class. You can 'level up' your class globally in a way and earn Hero points at the end of each game (regardless of victory or death) and put these points to good use by buying additional perks or classes and more slots of a globally shared item storage that all your future characters have access to. Give yourself a headstart if you start to struggle.  My current playtime/bought-price ratio: 4hours &gt; 0.75$ Rogue-like Quarter-diminisher: 4hours*0.25 End-result: 1 &gt; 0.75$  tl;tr  This game is worth its sale price so do buy it if you find it for under a dollar. For this game will redeem itself by the playtime it offers.  Tiny tips:  &gt;press the 'c' button to focus your attack panel because you can actually hit all of your eight adjacent panels &gt;use it for a planned sideway walk because pressing two arrow buttons simultaneous sounds pretty rough if one wrong move can end your game if you accidentally find yourself in a predicament. &gt;Infact, you can play this game entirely with just your arrow buttons and the 'Y','X' and 'C' button. Maximum Comfy.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun and well made rogue-like. I highly recommend trying it, especially if you're into rogue-likes.",
            "review_score": "1"
        },
        {
            "review_text": "This game was great fun! The time/movement system is great. Not sure how long the game will keep me entertained, but for the low price it's definitely worth it if you think you would like it.",
            "review_score": "1"
        },
        {
            "review_text": "It has some bugs, and it may be a little hard to get into at first, but once you understand the concept, it is really fun!  The price is unbelievable, especially on sale. I'm not usually the kind of person who looks in their recommendations and randomly buys a game, but this is my genre, and less than one euro? Bought.  The gameplay itself kinda reminds me of Pokemon Mystery Dungeon, but with a lot more RPG elements and... well... Darkness. Apart from that, it also has other unique elements like the dimensional vault or some of the abilities.  I'm pretty sure I have never seen an ability before which makes my stats OP in exchange for my clothing. Artstyle is awesome too.  And if you complain about missing content: Look at the price again. Or buy the DLC, like I did, which also makes the game easier too play with improved controls.  I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended for you roguelike fans out there. Especially for a price tag THIS low.  (Seriously, $1 for a roguelike RPG? I'll take one, please.)  The game itself is actually pretty complex. Even though it feels empty sometimes. For the features, I think that the world generator is quite nice, since you can get back to the world that you liked. You can also bring back the items that you found to the next playthrough via a 'Dimensional Vault'.  So far, I have no complaint for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best 0.69 cents I have ever spent (☉‿☉✿)",
            "review_score": "1"
        },
        {
            "review_text": "This is truly wonderful game, easily better than some Triple A titles(in my opinion), and it is filled with many feels. It is generally simple, and at times it can be tense. The story itself is simple, as well with its gameplay and mechanics, but it is incredibly well done and thought out. At times it can be pretty easy, but can be extremely difficult. A great game for both; ones who want something simple and ones who look for a challenge. The generated worlds and rogue-like elements really add to it. Worth far more than it's standard price, and I bought it on the summer sale deal for $0.87.",
            "review_score": "1"
        },
        {
            "review_text": "Short answer: Reccomended for completionists, peopel who love NG+, and achievement hunters. If you like to complete a game and put it away, your experience may be lacking.    This review is somewhat late, as I beat it several months ago. It only took me about 4-6 playthroughs if I remember right. I think I only unlocked 2 additional classes and barely any of the other content, as I was able to 'win' through the luck of the RNG. I am someone who does not mind restarting games over and over due to dying and learning, but I can't say I like replaying a game once I've beat it.  One Way Heroics has fairly standard roguelike combat which I got the hang of fairly easily having played other games. The darkness adds an additional layer to this, almost making it like chess - you have to be able to plan your moves several steps ahead, taking into account each enemy's movement speed, movement patterns, item locations, and whether you might get trapped by the terrain. This can all be done fairly rapidly in most areas outside towns and dungeons. The game, being a rogelike, has a decent amount of teaching through experience and playthroughs.  The big big big gripe I have with the game, and is the primary reason I wish I could give a 'mixed' rating? I managed to kill the dark lord before I think I should have been able to. I discovered one of the special artifact items and managed to fight him inside a town. Just a single artifact, my level wasn't that high. I truly expected him to be harder. Then I expected that to not be all and for the devs to pull a 'Disc 1 final boss' on me. But no, the Big Bad of the game can be defeated by simply holeing up in an inn with a single artifact weapon and blowing all your items and special abilities. I had no longer felt a real desire to play it afterwards.  However, this is my personal taste. While I find the idea of NG+ and completing a game many many times fairly dull (in most cases) for those people who DO like that sort of gameplay, this is a decent offering. I didn't encounter many, if any bugs in my playing, and the visuals are uniformly presented with nothing that seemed out of place. Worth the money for that kind of player, and having gotten it on sale and with the addition of trading cards I can't say it wasn't worth the 69 cents I paid for it, if not more.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting game this one is. To the right moves darkness and player. Avoid darkness player must do. Demon lord you shall defeat. Game you must buy. Fun you will have.",
            "review_score": "1"
        },
        {
            "review_text": "A suprising game. Really good fun and the random world generator makes every playthrough different and unique in it's own way. Great Game worth it's money!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best 4 bucks I ever spent, that's all you need to know",
            "review_score": "1"
        },
        {
            "review_text": "This game is like FTL rogue-like elements, perma death system.The gameplay in this game is so bloody fast u wont know wth is going on when its ur first time playing it.Basically this game throws u into the role of a *hero* and ♥♥♥♥ing just makes u play it, i will describe it as someone who is tied to a chair and forced to listen to nyan cat 100 hours long but the good kind of nyan cat :D . This game is weird so prepare to be mind♥♥♥♥ed how fast u can die in this game 1st playthrough killed in 1 minute by an ultimate feral dog 10/10 would die again",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Might be the best 'dungeon crawler' of 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good for the very low price. This procedural rougelike has a substantial amount to discover and explore as well as a range of classes, skills and perks.",
            "review_score": "1"
        },
        {
            "review_text": "very fun rougelike love the concept of the approaching darkness id say about 10 hours of playtime worth of a game its cheap too",
            "review_score": "1"
        },
        {
            "review_text": "A cheap and awesome game. Definitely recommend",
            "review_score": "1"
        },
        {
            "review_text": "I had this reccommended to me by a friend (after I got it.) Originally I didn't like it as much as the other games I got. But spurred on by their reccommendation I kept trying. I began to appreciate the fact that I could play this game for 10 minutes, put it down, and feel good about it afterwards. And then I started really learn how to play it. Now it's the only game of the batch I play regularly and I have a new appreciation for games I can play for 10 minutes and put down.",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn based RPGs, buy this game. It is excellent, and plays 'far' better than the screenshots let on.  Absolute must-buy.",
            "review_score": "1"
        },
        {
            "review_text": "So great game!  Nice music, so much fun and replayability, random encounters and items.  And for a low price.  It's a must to own if you like roguelike games with a classic Japanese style.",
            "review_score": "1"
        },
        {
            "review_text": " One of the best and most addictive indie rogue-like RPGs I ever played. Personally this is my favorite!   Unique idea of going 'One Way' to the right of the screen, without turning back or you will be consumed by the 'Darkness' and die. The goal is to defeat the 'Demon Lord', defeat the 'Darkness Dragon' or reach the 'End of the World' at 2000 kilometers.    Many different and exciting quests/endings along with strong storytelling   Various difficulty settings and random map generation, which increases the replay value   It has perma-death, but you can still save your game   Pick up and deposit items from other playthroughs (dimensional vault)   Lots of items, classes, perks and NPCs to unlock   Leveling up system including different affected stats   simple fast paced/turn-based combat and class specific skills   Lots of depth, still simple and quick learning curve   J-RPG menus &amp; comedy   towns with merchants and other NPCs   dungeons with monsters and loot   online feature which shows other players current progression in their world (live)   online events/quests with specific rules, which change every day   manually input seed to replay a world   Nice Anime 'RPG-Maker'-like graphics. If it´s made by RPG-Maker, I would say it´s the most possible content you can get out of that engine, so far.  Great fitting soundtrack :)    Highly recommended and totally worth the money =P   ",
            "review_score": "1"
        },
        {
            "review_text": "A really nice game. I really liked the concept of the game. In my opinion it was worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I love everything that it's hidden behind the simple mechanics of this game, specially because the best part of the game is discovering all those things by yourself.   You should try it without a single doubt. It isn't expensive, so if you don't like it you won't lose much money.",
            "review_score": "1"
        },
        {
            "review_text": "I love everything that it's hidden behind the simple mechanics of this game, specially because the best part of the game is discovering all those things by yourself.   You should try it without a single doubt. It isn't expensive, so if you don't like it you won't lose much money.",
            "review_score": "1"
        },
        {
            "review_text": "The best 50 cents I ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "Went to the left and died  11/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game. But you have to becarful about hitting the buttons twice or not. I made a few mistakes. The price should be a bit higher but it's ok. The game is really great. I wish I could play with my friends on here but I'm ok with it. I recommend this game if you like rpg and scrolling games. With it's many classes try to find one that suits you. For me I like the Knight and Hero class. Also the perks are great as well. You can pick from different perks to enchance your hero. This is a well made game. I put in quite a few hours into it. With it's different dimension It's a new adventure everytime. If you wish to replay it type it's name.This is an amazing game. And you should give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "There is simply no better use of your money, if you are willing to play a videogame. 10 dollar/hours per day of enjoyment is a simply unbeatable and incomprehensible exchange rate.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best 16 bit games I have ever played. Hands down.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brutal no matter what difficulty you pick, in best possible way as a rogue-like. It has a VERY surprising amount of depth for a game that is by default played on a resolution of about a smart phone (what you see in the screenshots is what you get, and full-screening it does not help its prettiness!). Graphics-wise, it's incredibly indie -- see the character 'portraits' in the bottom left corner that seem to be sketches made a bored developer, especially Swordmaster Class C for a laugh.  If you get this game, it's for its gameplay, which does one thing, but does it really, really well. The turn-based gameplay with a constant timer and emphasis on movement will make it incredibly addicting for old-time Rogue-like players, as experience points (read: monsters to farm) and treasure may be within arm's reach but inaccessible due to the choices you have to make. The item appraisal system makes every item a mystery and makes even a new starting sword drop a desired reward, as durability constantly counts down with few ways to repair items and replenish supplies. Even when you're on top of the world, you'll feel pressured and challenged by item weights and inventory limits, decreasing energy and stamina, and other factors to encourage you to weigh risk and reward ('how long should I wear this Training Bracelet, which cripples my stats for more experience?') to get ready for the next area.  The 'hidden' parts of the game are by far the most enticing. You simply have to go out and find out for yourself how to get access to things like Party Members, Force powers (spells), the Dark Brotherhood, Hidden Elf Villages, Goddess Statues, and Key of Seals and their associated doors. After each death or victory, the progression system encourages trial and error, mixing and matching unlockable classes and perks with rotating featured Dimensions and allowing players to access the Dimensional Vault to carry over a limited number of items. The game is well-supported outside of a playthrough with a replay system, a hall of fame for each dimension and for your overall profile, and, of course, the different daily Dimensions featured. It does not hold your hand after kicking you out of the castle with a fairy of questionable use, explaining only the most basic and necessary mechanics until you recruit party members: you have to go out and discover it for yourself, since at a base level the game is so simple! Even the limited story and simple humor is fun to discover, especially as more party-member-specific endings are unlocked.  One of the best games on Steam under $5, and amongst my favorite Rogue-likes; highly, highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. I may try and cover it more thoroughly in the future, but there are so many systems working in harmony to cover It's daunting to consider reviewing the game. The playtime I will recieve from this game for the price I paid is ludicrous.  Thanks makers!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great cheap little game. Now if only it would stop randomly crashing. :/",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good Roguelike with an original design. Not another generic indie ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent roguelike-like. Not much to look at, but that's not really what the genre is about.",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics. I found a ghost that gave me cool items, killed many dogs that were in a box, found lots of treasure, and I am sure I left the fourth wall in pieces. I would say that makes for a Good Game.",
            "review_score": "1"
        },
        {
            "review_text": "gud game 11/10 would die at the start again",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mix between a Mystery Dungeon game and those auto levels on Mario. The HUD and menus don't look very good but it is a fun game. Deffenitly worth its price very low price.",
            "review_score": "1"
        },
        {
            "review_text": "There's only one way to go.. Which is the right way, if you go the opposite way, you'll be consume by darkness and will never be seen ever again..",
            "review_score": "1"
        },
        {
            "review_text": "OMG,I can't stop playing this game when i bought it. This game will make you crazy when you play it! Trust me must try! Then you will never stop it. i rate it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "At some point during this game, you would want to spoil yourself with the dialouge because you died to something. It has wonderful story.  Gamplay wise, it really fun walking in one direction, fighting mobs, running away from the boss and hope that you find something good.",
            "review_score": "1"
        },
        {
            "review_text": "Actually really fun for the little money I spent on it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful, you get used to this unique gameplay really quick, the default playthrough is quite short, but the concept behind this game is to play it through 100+ times, to enjoy it over and over, and every round you find out something new about the world, why it collapses and so on.   I personally think that the developers should have made this game a little more expensive, with cuter/better tilesets and char sprites, but it's ok.  It's worth it even if you get it at full price, no need to wait for a sale for this one.",
            "review_score": "1"
        },
        {
            "review_text": "not a bad game if u like jrpg this is one for u",
            "review_score": "1"
        },
        {
            "review_text": "At some point during this game, you would want to spoil yourself with the dialouge because you died to something. It has wonderful story.  Gamplay wise, it really fun walking in one direction, fighting mobs, running away from the boss and hope that you find something good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is nothing short of amazing. The plus DLC is a must, I recommend starting on that to get the full experience, balance and story. It's a fairly typical rouge step up sans amulet but the mechanics are highly refined and the visuals minimal but quite adorable nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "At some point during this game, you would want to spoil yourself with the dialouge because you died to something. It has wonderful story.  Gamplay wise, it really fun walking in one direction, fighting mobs, running away from the boss and hope that you find something good.",
            "review_score": "1"
        },
        {
            "review_text": "BEST! Endless adventure and so many unique ways!",
            "review_score": "1"
        },
        {
            "review_text": "very indie  much fun play it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Real heroes get it done in half a minute. Masochists walk 2000 km.",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics is by far one of the greatest games Ive played it has tons of stuff to do its hard and you can replay it many many times.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game that you can spend thirty minutes on or a few hours. Definitely good fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is suprisingly fun. Great if you want something quick and fast.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game so the thump can only go 'one way' and thats up",
            "review_score": "1"
        },
        {
            "review_text": "this game is great and addicting!",
            "review_score": "1"
        },
        {
            "review_text": "It's an alright indie rogue-like game but there isn't much to it. Pretty much just try to see how far you can get in a certain amount of steps or something... Idk the game is kind of vague on how it works. It took me 4 hours to beat the Demon Lord the first time and I didn't have the motivation to try to get any further. Doing well rewards you with more usable characters and you can use chests to store items you might want on your next character walk. SO basically with storing your items you're saying screw it to this play-thru and the next one will be better or something.  The game seemed kind of counter-productive as you have to make very fine decisions on whether or not to even fight monsters as they slow you down or deal alot of damage. You pretty much have to get lucky enough to get some good items and also fight enough enemies, but not too much, to be able to fight the Demon Lord at the end with high enough stats to survive. If I were to give this game a rating I would have to say something around 6/10. It's an alright adventure game but just seems like I'm making no progress while I play. Also there is not a whole lot of content but it's only like $3.50 so it's forgivable.",
            "review_score": "1"
        },
        {
            "review_text": "On those days you feel the insatiable need to die, often, OWH fills that void in your black soul with a delicious ruthfulness.",
            "review_score": "1"
        },
        {
            "review_text": "Across all dimensions, the only constant is Darkness! A procedurally generated RPG-roguelike journey across the multiverse!  In One Way Heroics, you take on the role of an intrepid adventurer who must travel across the land and face the Demon Lord before a mysterious darkness engulfs everything.  Darkness always approaches from the left, and with each movement, attack and action you take, the darkness creeps ever closer. Forced to run right, you'll encounter any number of monsters, allies, thieves and shops on your desperate journey to stop the end of everything.  The good news is that you don't just have access to one world. You have access to all of them. Born with the mysterious power to travel to other dimensions, you can choose which dimension you wish to travel to in order to get to the Demon Lord.  Dimensions vary based on their name. One might be full of lush forest landscapes full of adorable animals and cunning thieves, while another might be full of corrupted hellscapes infested with demons. You might find likeminded heroes willing to journey with you, or you might meet no one and be forced to venture into the unknown alone.  Like a dimension you previously visited? Simply input the name at the Dimensional selection screen before you begin your journey. Want to try your luck with a random dimension? Type any word that pops into your head, and watch as One Way Heroics builds you a world based on the name you chose.  Infinite permutations. Infinite worlds. Infinite adventure.",
            "review_score": "1"
        },
        {
            "review_text": "this game has an interesting gimmick and it's kind of fun?? not something i'd play for weeks. i think it's still getting updated though. this game has alot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "a classic in the dead space franchise, dont believe it myself but the voice acting on the 4th realm was great, and its hard to tell but they only used one drum!",
            "review_score": "1"
        },
        {
            "review_text": "This game lacks polish, and it can be a bit confusing to start, but once I died a few times and started getting a feel for how to play, I found a unique charm to the game, a bit reminiscent of Half Minute Hero.  The game has all the typical elements of a coffeebreak roguelike, but the game's unique time mechanic limits time spent searching every nook and cranny of the map, and forcing you to make use of every resource you come across. Unlocking new content as you play isn't tedious, especially since none of it is required to win a playthrough.  I recommend this for any fan of simple, short roguelikes.",
            "review_score": "1"
        },
        {
            "review_text": "A very addictive turnbased side scrolling rpg game with a lot more depth then you would expect from this game. If you like games like (the turnbased) final fantasy or dragon warriors then this game is definitely something for you!",
            "review_score": "1"
        },
        {
            "review_text": "A great game for a really cheap price, worth it if you have some change just lying around. A roguelike adventure where you move to the right trying to outrun the darkness and defeat the demon lord. There are multiple different classes to choose from and you can unlock perks to give your characters at the beginning of a run, ranging from more hp to a pet that will help you battle. There is also a dimensional vault, which you can upgrade to hold more items, that will let you transfer items from one run to another.",
            "review_score": "1"
        },
        {
            "review_text": "While seeming to have simple mechanics, they are rewarding and distinctive in their combination into a comprehensive gameplay I would expect more out of a mid-90's game than anything in the modern era of gaming. Has considerable replay value when coupled with its randomized maps and feature special maps that change fairly regularly. I regret putting off buying this, and it's well worth the humble price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun pixel rogue-like game. With losts of unlocks, and different classes",
            "review_score": "1"
        },
        {
            "review_text": "it simple yet quite fun game.. recommended I get it from humble bundle weekly offer and put some time to play it  I like the part where you can get 4-5 levels from goat or any other animals but you are being hunted by pet lover guy.. and killing that guy will add your bounty level..  this game is actually more complicated than my first impression, you could play as lone wolf (pirate prolly the best) or in a group(bart) and there are many possibilities of gameplay. I like the campaign where you are travelling with the king. I hope there are more bosses and we could reach more than 400 m (it would be great if it's longer or make an endless mode game for longer journey)",
            "review_score": "1"
        },
        {
            "review_text": "A good Japanese Rogue-like with lots of replay value. Great music is a plus too.",
            "review_score": "1"
        },
        {
            "review_text": "It's a Rogue-Like JRPG with a Retro art style. You unlock new classes by either acomplishing certain goals, or by spending points you earn by playing. You can also use these points to unlock new perks for your character, or to upgrade your storage. This storage can be used to save items from previous adventures, and use them in new adventures.  It's a great game which I hapily recommend to others who like any of these genres :D",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best value that I have gotten out of a game. Hours of really fun gameplay with engaging combat and a good story, along with inventive multiplayer and thousands of different maps available, all for less than a dollar when on sale. There is no doubt that this is one of the best deals I have ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "It's rediculously addictive for such a low price, there is no reason not to get it",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly one of my favorite Roguelikes to date. Multiple classes, perks, partners, unlockables, difficulties and randomly generated worlds makes each runthrough an experience full of experimentation and discovery. The simplistic yet charming artstyle works well with the turn-based style gameplay as well and with the shadows constantly chasing your character down, you have to carefully strategize and choose your moves wisely in order to survive while preparing for the troubles ahead.  The only disappointing part is the limited amount of unlockables (easily obtainable by about 3 hours of play), but One Way Heroics makes up for this with the large amount of replayability.   Overall, with the massive amount of replayability, class/perk combinations, cheesy humor, and daily seeds, I can easily see myself coming back to this game even years after its release.",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty fun once you get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "When starting this game out I was kind of iffy with it, but just playing if for an hour was great. Its like a normal rogue-like with only a certain amount of time, it will get harder and harder just to get good stuff without dying.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I have more playtime offline. Simple, fun, and nostalgic, that is on the surface. That one change makes this game tactical and different, you only have so many moves and there is always a threat of taking one risk to many. I recommend this game especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics... What can I say? I mean it is a great game. It is a roguelike that fills a rpg niche that you dont get elsewhere. You can carry over some items and gear which can be very helpful. You ear classes and perks so you can change your style. The multiple ways to finish the game and to play makes it fun through many play throughs. I wouls say anyone who looks and thinks they may enjoy it should igve it a try. I was hesitant at first and am glad I made the plunge!",
            "review_score": "1"
        },
        {
            "review_text": "Darkness falls across the land The demon's hour is close at hand Creatures crawl in search of blood To terrorize your helpless knight  death/10, would die again",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics has a certain whimsical charm to it, and not just with its 8-bit graphics. The soundtrack is absolutely   amazing . Every time I open this game, I stop for about 10 minutes just to listen to the title screen's music. The mechanics of the game are fantastic, despite the somewhat steep learning curve, and is simplistic enough for a casual session but is also surprisingly deep enough for a major time investment.   The story isn't exactly an enchanting epic, but you can do with it as you like. Either fill in for them or just ignore it. Some great darkness is consuming the world, which is the left most part of the screen, and you have to escape that darkness by going to the right, hence the title of the game. Along the way, you'll encounter beasts, animals, dungeons, and dodgy terrain; all of which you must face in order to prepare for the advent of the Demon Lord.  Your journey is defined by you. It can turn from a simple stroll across the meadow to a desperate struggle to survive. It can be simple, it can be deep. Overall, One Way Heroics is a great adventure RPG that can't hurt your wallet.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty great for the price. If you enjoy FTL you will enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely reccomend this game. I have put in several hours into this game already, and I still haven't come close to getting bored with it",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for an arcade-depth roguelike, you've found it! While it lacks the depth and intricacies of the pure breeds of the genre, such as the classic ADOM or more recent Dungeons of Dredmor, this game delivers familiar mechanics in a session you can begin AND win within an hour. The gimmick is simple, darkness is literally spreading across the land from the left side of the screen to the right, forcing you to run from it at all times. Every encounter or location you try to explore is an opportunity cost, and time is precious. However, failure to probe enough of the world will result in insufficient necessary medical supplies or a total lack of gear in time for the boss fight, should you survive long enough to hike to it. It follows a lot of the genre's standards, such as the world not moving until you take your actions, but since it is more simplistic, it adds something most roguelikes cannot do comfortably: 360 Controller support. Another fun feature is the world is generated by a key phrase, so you can replay a particular map, or seed a new one by letting your cat walk across your keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "Part roguelike, part JRPG, One Way Heroics is an hybrid game that should please many people.  The game tasks you to keep moving forward (from left to right) in a world that is randomly generated, to become stronger and stronger, until you're finally able to save the world by defeating the Evil Lord responsible for the Darkness invading from the left.  But contrary to pure roguelikes, a failure doesn't mean you lose everything : when you finish a game (regardless of whether it was a success or not), you can save some items from your inventory into a 'Dimensional Vault'. The vault allow your next heroes to grab the items from them, and thus start a new game with powerful equipments right from the start. With this system, you can soon have starting heroes that are extremely powerful.  Moreover, since this is an hybrid JRPG, there is a lot more story in this game than there is in a typical roguelike. During each of your travels, you may find some new locations or characters, and this will help you better understand what is exactly happening to the world, as well as unlocking new places, storylines and endings. This helps alleviates one of the problems of roguelikes which is that they sometimes feel like you're doing the same thing over and over again.  The gameplay itself is nice, with many items, skills, and classes that allow for different approaches to combat. It's turn-based, with positioning being an important part of the combat system. If you're lucky, you might later be able to expand your party, and have companions help you on your quests, which add more tactical options. Once again, this is a nice difference to classic roguelikes where you're usually all alone all the time.  Another good point for the game is that it should please a large number of RPG or roguelike fans. It has 4 different difficulty levels and you also have the option to turn off the Dimensional Vault as you wish. This mean that casual players will enjoy being able to finish the game on Easy and Normal, while Roguelike veterans will get the challenge they are looking for by playing harder difficulties, without the help of the vault.  On the whole, I really enjoy One Way Heroics. It offers me some interesting challenges, but somehow, it also feel like a relaxing game, because you're all alone in the vast open country (contrary to many roguelikes who prefer claustrophobic dungeons). It's a very nice game to both unwind, and also get my brain working hard, depending on which difficulty i play on. And i keep coming back to it, because there is a lot of secrets that i have yet to find and classes i have yet to finish the game with.",
            "review_score": "1"
        },
        {
            "review_text": "McAfee thought this was a virus so i deleted McAfee and found that this game is infact amazing, the world is constantly moving to the right and if you dont move with it you are dead, this is a turnbased randomly genrerated rogue-like with a huge twist that sets it apart from all the others and is definetly worth the low price it has GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. I got this on sale for about $1.25 and I would have gladly paid at least $10. It's a pretty simple Rouge-like that is the sort that makes you repeat the same prossess over and over, (Takes about 30-45 minutes to do a run through) but theres a lot of random possibilites that happen all the time making each run through very different from the last. Plus each class has it's own way of getting through, as in, you can't do the same thing for every class and win. Plus there are other modes and maps which also add even more to discover and play around with.  I'm positive I will end up playing this game for at least 50 hours and for $1.25 I think that is well worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! it is very difficult to start out but keep playing and it gets better and better!",
            "review_score": "1"
        },
        {
            "review_text": "An interesting take on the Roguelike experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great way to kill some time you could be using to do other productive things!",
            "review_score": "1"
        },
        {
            "review_text": "You walk to the right to avoid an ever encroaching and all-consuming darkness and collect loot and fight stuff.  The game has a very unique feel and the mood it sets makes replaying it a joy. Which is fortunate because the random worlds (from its seed based generation) can make even your very first run hard as nails.  At the very least, this is my favourite roguelike and likely will be for some time.  The game is already cheap but during sales, expect it to be as low as fifty pence.  Well worth the investment in both time and fifty pennies.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, fairly unique take on the rogue-like genre. I like the idea that the NPCs you encounter inevitably die seconds after you interact with them. It's so damn cheap, you'll definitely get you're money's worth. No complaints from me.",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Love every part of it - the style is great, the concept is great. It is challenging and fun with a variety of options. I never thought I'd die within a moments notice by what seemed to be nothing and still be in love. Reccomended at sale and full price!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing combination real-time/turn-based RPG rogue like. Not much to say other than 10/10 and get it if you're a fan of that genre.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, deep, great mechanics but unfortunately a horrible system for explaining mechanics to new players... devote at least 1 hour to just learning mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "sort of like a horizontal roguelike, it's really fun. the darkness mechanic basically imposes a permanent time limit to your actions, though it's not that hard to just continue moving forward. the real fun begins once you start maximizing how much you can do in one area before the darkness catches up, then ♥♥♥♥ gets real.",
            "review_score": "1"
        },
        {
            "review_text": "Even though the original Japanese version is a free game, make no mistake, this game is worth more than its Steam price.  Huge replay value and one of the most fun Rogue-like RPG I've ever played, this is easily a great recommendation.  The maker also made Wolf RPG Editor AKA freeware RPG Maker and is currently working on One Way Heroics Plus.",
            "review_score": "1"
        },
        {
            "review_text": "The game is straight up fun, you just keep moving right... some times you may move down or up, but the map just keeps moving right, and if you don't move right you die. The game has its flaws, but they really don't stand out that much.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, worth every cent!",
            "review_score": "1"
        },
        {
            "review_text": "First roguelike game I've ever played and really got me into the genre. I can't recommend enough.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing combination real-time/turn-based RPG rogue like. Not much to say other than 10/10 and get it if you're a fan of that genre.",
            "review_score": "1"
        },
        {
            "review_text": "Super addicting rogue-lite, definitely worth it",
            "review_score": "1"
        },
        {
            "review_text": "Sort of like Passage, but fun and a JRPG. Takes all the best parts of random item drops, grinding, and stat boosts and cuts off all the excess, leaving you with a fast-paced, enjoyable gem of a game. It's probably the lightest rogue-lite I've ever played, complete with - fairly plentiful - opportunities to save at no penalty (if there's an unlockable difficulty with no saves, play that, though it really  should  have been unlocked from the start if it does exist, and included if it doesn't) - but it's still challenging enough, and the procedurally generated worlds are surprisingly satisfying to carve your way through. Definitely worth getting, even at twice the asking price.",
            "review_score": "1"
        },
        {
            "review_text": "A very addictive turnbased side scrolling rpg game with a lot more depth then you would expect from this game. If you like games like (the turnbased) final fantasy or dragon warriors then this game is definitely something for you!",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics is a turn-based roguelike game. After the character creation and a bit of customisation you are dropped into a randomly generated world with death coming for you from the left side of the screen and adventure, loot and almost certain death waiting for you on the right. Every time you move, fight, use an object or talk, the world moves on: enemies act and the darkness comes a little bit closer, forcing you to plan your next moves well. Do you want to try going for that treasure chest? Kill that enemy? Explore that building? Maybe talk to a merchant somewhere else on the screen? You are very unlikely to be able to do everything. Luckily, you can generally move a bit faster than the darkness, so even if you let it come close, you will be able to outrun it for a bit again, provided you don't waste too much time for a bit. If you make it far enough, a boss will show up and you can win the game... or die trying.   Due to the random map generation, the difficulty of the game will vary greatly from cakewalk to trying to break a wall with your head. However, after each round you are allowed to buy new perks, unlock other classes or upgrade your dimensional vault, a storage that allows you to transfer things into your next round - great for storing that overpowered weapon you found right before darkness caught up to you.   Not a game you will end up sacrificing your social life to, but a great deal of fun to have in little bursts. It's quick to pick up, the rounds are short and refreshing, and afterwards you will still have a fair amount of the day left to spend on studying, working or even socialising if that's what floats your boat.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty awesome game. Highly reccommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little roguelike rpg. Highly enjoyable for a quick game fix.",
            "review_score": "1"
        },
        {
            "review_text": "At first i was not determined to buy this game and thought about it really long time. finally got it and dont regret a dime of it.Its good to kill 5-7 hours(one sit)",
            "review_score": "1"
        },
        {
            "review_text": "Great roguelike in every aspect, don't let the graphics and menus put you off! It's definitely worth your time.  Although it's a bit awkward how they integrated their + Edition, as DLC for the base game, I recommend getting that as well, but by all means check the base game out first, it's not hugely different.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic and unique title, with lovely characters, great gameplay, and a nice soundtrack. It also has a good sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "There a little bit of a learning curve, but when you do there are hours of addicting fun. Great game to play after a long day.",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics has a certain whimsical charm to it, and not just with its 8-bit graphics. The soundtrack is absolutely   amazing . Every time I open this game, I stop for about 10 minutes just to listen to the title screen's music. The mechanics of the game are fantastic, despite the somewhat steep learning curve, and is simplistic enough for a casual session but is also surprisingly deep enough for a major time investment.   The story isn't exactly an enchanting epic, but you can do with it as you like. Either fill in for them or just ignore it. Some great darkness is consuming the world, which is the left most part of the screen, and you have to escape that darkness by going to the right, hence the title of the game. Along the way, you'll encounter beasts, animals, dungeons, and dodgy terrain; all of which you must face in order to prepare for the advent of the Demon Lord.  Your journey is defined by you. It can turn from a simple stroll across the meadow to a desperate struggle to survive. It can be simple, it can be deep. Overall, One Way Heroics is a great adventure RPG that can't hurt your wallet.",
            "review_score": "1"
        },
        {
            "review_text": "Takes a minute to get used to, but fun and challenging once you spend some time farming. Not a particularly deep gaming expierence, but I'd say you get some really good value based on the price of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great spin on the mystery dungeon genre! This is something anyone could spend dozens of hours into.",
            "review_score": "1"
        },
        {
            "review_text": "Decent replay value, unlock new classes or add a plot to you quest by coming across a wanderer. Shape your adventure, but quickly, for the darkness is approaching quickly.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into roguelike games you will be more than satisfied with One Way Heroics. When you first start playing, you will die a trillion times, but the depth of progression and fun of exploring the randomized dimensions is well worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Nice old style rpg that keeps you on your toes. You never know when you're going to run into strong enemies or what random events will keep you running for your life. It's taken me a few hours to try and figure out what items can help in what situations or what class uses what skills but this gam is always fun.",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics uses the standard roguelike success formula: Basic roguelike elements + Death can help future playthroughs + Something new = Win.",
            "review_score": "1"
        },
        {
            "review_text": "'One Way Heroics' is a great game! The only problem is it doesn't have a tutorial so it can be a little frustrating at first, but the controls are simple enought to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like FTL for RPGs. If you liked FTL and games like it, you'll like One Way Heroics. Plus, you can't beat the price. Personally, I've spent more on candy.",
            "review_score": "1"
        },
        {
            "review_text": "A very neat roguelike styled after oldschool JRPGs. Has tons of replay value and some how avoids feeling too tedious like some JRPGs can after a while. The amazing music was also a pleasant surprise.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and challenging game. Takes a lot of skill and luck to save abilities and items for when you need them most and to find better items. The game mechanic of the darkness makes the game challenging as you can't linger in an area searching for goods forever which forces you to press on. One way heroics is a great cheap and quick game to play that provides a challenge to the player.",
            "review_score": "1"
        },
        {
            "review_text": "This was way more fun than I had anticpated. Compelling 'one more turn' gameplay, exploration gets rewarded, movement should be carefully considered for both exploration and combat. Worth far, far more than the 57p I paid for it in the sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic experience. It's a rogue-like with a lot of content and replay value.",
            "review_score": "1"
        },
        {
            "review_text": "This game is my favorite little rpg in my library, it's a easy to understand and has good music. 10/10 Would die again.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun if you have nothing else to do, and even if for a short break it is really good.",
            "review_score": "1"
        },
        {
            "review_text": "i wish there were more games like this",
            "review_score": "1"
        },
        {
            "review_text": "its a great addicting game, that doesnt costs very much. nuff said",
            "review_score": "1"
        },
        {
            "review_text": "There's a reason the reviews are Overwhelmingly Positive.   This game is great. Battle across a doomed world to gain the attention of the Demon Lord. Unlock classes and perk by playing more and surviving longer. It's such a simple looking game that actually has a ton of depth and replayability. Buy it if you like JRPGs and/or Roguelikes.",
            "review_score": "1"
        },
        {
            "review_text": "A rogue-like with mystery dungeon-style battle system. It's super fun, and a little easier than a lot of rogue-likes, but that's far from saying it's easy. There are multiple ways to beat the game along with multiple modes. The game also has a decent sense of humor. It's definitely worth it even at full price so getting it on sale is a steal.",
            "review_score": "1"
        },
        {
            "review_text": "Really good concept and very well executed!  The game is easy to understand, but rapidly ramps up in difficulty if you want to tackle more challenges.  Well worth the ridiculously small price!",
            "review_score": "1"
        },
        {
            "review_text": "You have no reason not to play this one. It is cheap, well made and unique. It is really a diamond in the rough. I would suggest this fantastic game to no end.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly gripping and addictive.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game to play, and well worth the almost 4 dollars I payed for. ",
            "review_score": "1"
        },
        {
            "review_text": "Very Addictive ... and annoying as well when you suddenly died from I don't know what happened lol",
            "review_score": "1"
        },
        {
            "review_text": "Could not find the 'any' key 10/10  in all seriousness, great game, play for 15 minutes and rage quit when you die, or go on an epic quest and kill the boss, or reach the end of the world, and then do it again.  bottom line easy to pick up hard to put down, unless you die, then you might rage quit",
            "review_score": "1"
        },
        {
            "review_text": "So I bought it on sale for some very modest amount. Wasn’t really expecting much, thought I would probably never play it more than 10 minutes but I was wrong. The game is surprisingly good and refreshing. I like that you can play an entire game from start to finish in like 30 minutes, way better than grinding some old school jRPG for 100 hours and each new playthrough feels different enough to continiue playing.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun and challenging. Wish there were more ways to repair equipment however. I also would really like if they added some adjustments to screeb resolution as I cant seem to fullscreen it without it cutting off the edges. Other than those two things, this game is fantastic and a nice little distraction from heavy investment games.",
            "review_score": "1"
        },
        {
            "review_text": "Darkness falls across the land The demon's hour is close at hand Creatures crawl in search of blood To terrorize your helpless knight  death/10, would die again",
            "review_score": "1"
        },
        {
            "review_text": "Just played it. This gets addictive quickly!!",
            "review_score": "1"
        },
        {
            "review_text": "Each session was Fast, entertaining and overall, makes each run feel not a waste, Simple enough as well, no complex mechanics, perfect to just pick up and play for 10 minutes .",
            "review_score": "1"
        },
        {
            "review_text": "A clever twist on your typical RPG that adds new layers of gameplay to the rogue-like genre while also providing great music and an interesting story!  It’s not too expensive, totally give it a look! ",
            "review_score": "1"
        },
        {
            "review_text": "One way heroics is a very fun game that provides hours of fun for a very cheap price. The BGM is very nice and sets a wonderfull tone for the game. There are many ways to play the game giveing it a lot of replay vaule after you beat it once, and there a DLC comeing out for it soon that is going to bring even more content to the game.",
            "review_score": "1"
        },
        {
            "review_text": "Not your typical roguelike. Its fast pace and very punishing nature make it one of the most original games I've come to check out. And it's pretty cheap.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little roguelike most similar to the mystery dungeon series. It has meta-progression, with perks, classes, and a castle to build between runs. Each run (so far) takes about one hour. Classes play very differently. Replay value is very high.",
            "review_score": "1"
        },
        {
            "review_text": "This. When i wrote this actually its not 0.1 hrs of game time, i played it offline xD  I spent my whole day playing this, its was awesome, a simple RPG time-based, lots of hero choices, also fantastic to enjoy xD, i really like this game a lot, if you cant run final fantasy on pc or so, play this, buy it, you wont regret (y)  10/10, An Indie masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly fun RPG/Roguelike on the cheap, this game came well recommended by others and it's been one of my favorite pickups during the summer sale. 8 hours in and I'm still discovering new things. Definitely worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "hands down one of the best games ive spent my 0.87 cents on",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up on a whim during a sale and was surprised with it. Honestly love it, and can't really think of any cons. Gameplay is simple yet entertaining, feels like an old school RPG. The game is as long as you want to make it, which is an interesting concept, and well done in my opinion. The story and characters are pretty basic, but I see that as a plus, as they end up being pretty charming and likable, compared to other games that have a million and two lines of backstory, but say a grand total of nothing.  It's overall a pretty refreshing and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "This. When i wrote this actually its not 0.1 hrs of game time, i played it offline xD  I spent my whole day playing this, its was awesome, a simple RPG time-based, lots of hero choices, also fantastic to enjoy xD, i really like this game a lot, if you cant run final fantasy on pc or so, play this, buy it, you wont regret (y)  10/10, An Indie masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "fun little game for only 87 cents worth 10/10 would bang again",
            "review_score": "1"
        },
        {
            "review_text": "For anyone who's a fan of roguelikes, this game is right up your alley. It's actually got a bit of personality above and beyond many roguelikes that are out there, and the pixel graphics really add charm, if they're your style.  Progression is quick, and every death seems to lead to either a new bit of knowledge, or extra strength for the next run. It also provides a fine amount of replay, incorporating daily realms and other online elements, so if you're looking for another run on a new class, or a new level of challenge, the game is constantly giving you new stuff to contend with.  For whatever reason, the game won't let me play in fullscreen, despite my best efforts to do so, but that's really just a tiny complaint. Same thing for the keyboard-only controls, which thankfully are very simple and intuitive. All in all, this game provides a remarkable amount of content for under five bucks, and even if it was ten, I'd heartily recommend it to roguelike fans.  Final rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A very fast paced roguelike styled like a JRPG with a flavor of endless running. Definitely worth the price as I can see myself getting nothing but hours out of it.",
            "review_score": "1"
        },
        {
            "review_text": "A great, simple and entertaing Rogue-like rpg with a twist. This games offers engaging sessions of rogue-like adventuring , while being able to persistently unlock new features such as classes, perks and more. While its gameplay mechanics are pretty simple, there are many combinations of randomly-generated equipment, skills and events for you character. Each class is a bit different in terms of gameplay so you'll probably be wanting to try out every available combination of class+perks more than once. The gameplay gets repetitive after a while so I doubt anyone would be playing it 24/7 nonstop, but nevertheless it's a good experience for its price.   One of the few features that caught my eye was a 'Daily Online Challenge' or 'Campaign Dimensions'. Each day the seed is generated for a world where everyone who plays a game can join. While it's impossible to interact directly with other players you can encounter the ghosts of defeated players and read the recent chat logs of other adventurers, how much time they have spent, who killed them and what items they have obtained in this world.  Same with the 'online' adventures, new adventures with different conditions are also generated daily. E.g. The ones where you can recruit a powerful ally, or a world covered in constant darkness, limiting your vision.  9/10 will play again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good. Nice JRPG rouge-style game and need keep going right.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful and quite addicting rouge-like. I recommend it to anyone who enjoys the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of replay value 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap. This is one of the best Rouge-Likes I've ever played.   Think Final Fantasy, Mixed with Half Minute Hero and add an endless runner to the mix.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is, im my humble opinion, the epitome of the coffee break Roguelike. With numerous classes and countless Perk combanations to keep your playstyle fresh Diverse daily game modes, And a Game length of less than an hour, it will keep you coming back for more bite sized adventures! the difficulty, while not as brutal as some roguelikes are known for is nothing to scoff at either and depending on your class you can find a good deal of stratagy in the apparently simple system. Is it an amazingly deep game? no. Nor is it grapicly impressive, But what it is is fun and compelling, and in my opinion thats really all it needs to be.",
            "review_score": "1"
        },
        {
            "review_text": "One Way Heroics is a turn-based roguelike game. After the character creation and a bit of customisation you are dropped into a randomly generated world with death coming for you from the left side of the screen and adventure, loot and almost certain death waiting for you on the right. Every time you move, fight, use an object or talk, the world moves on: enemies act and the darkness comes a little bit closer, forcing you to plan your next moves well. Do you want to try going for that treasure chest? Kill that enemy? Explore that building? Maybe talk to a merchant somewhere else on the screen? You are very unlikely to be able to do everything. Luckily, you can generally move a bit faster than the darkness, so even if you let it come close, you will be able to outrun it for a bit again, provided you don't waste too much time for a bit. If you make it far enough, a boss will show up and you can win the game... or die trying.   Due to the random map generation, the difficulty of the game will vary greatly from cakewalk to trying to break a wall with your head. However, after each round you are allowed to buy new perks, unlock other classes or upgrade your dimensional vault, a storage that allows you to transfer things into your next round - great for storing that overpowered weapon you found right before darkness caught up to you.   Not a game you will end up sacrificing your social life to, but a great deal of fun to have in little bursts. It's quick to pick up, the rounds are short and refreshing, and afterwards you will still have a fair amount of the day left to spend on studying, working or even socialising if that's what floats your boat.",
            "review_score": "1"
        },
        {
            "review_text": "Most addicting game I ever touched.",
            "review_score": "1"
        },
        {
            "review_text": "Accidentally obliterated an entire town while fighting two wolves. Decided to just kill everything with lightning since it all hated me now. My only regret is not being able to carry all the items.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Well worth the money with or without sale.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little game, and well worth the money. Not a deep gaming experience by any means, but engaging and entertaining while still having enough of an RPG flavor to keep players like me invested in the outcome.",
            "review_score": "1"
        },
        {
            "review_text": "Its the right combination of RPG elements and Rogue-like gameplay to makes it an awesome game, and the enemies slowing you down and the giant dark wall thats chasing you is an extra challenge that makes the game more fun to complete. Definetly one of my top favorite RPG games.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game !",
            "review_score": "1"
        },
        {
            "review_text": "The controls are hard to get use to at first, but the game becomes fun fast. It requires you to stratagize and think ahead.",
            "review_score": "1"
        },
        {
            "review_text": "this game is stupid fun just play it nough said!",
            "review_score": "1"
        },
        {
            "review_text": "Just started playing, and I am already hooked; I haven't come across such an addicting game since The Binding Of Isaac. Very nice!",
            "review_score": "1"
        },
        {
            "review_text": "10 out of 10 fancy graphics totally not there Its place is a turn based rpg that plays functionally like a real time rpg if your looking for something deep story well this isnt it. anyways my lack of eloquence is killing me so im just going to go kill the demon lord. not sure why i like to kill that dude so much but i just have to hope im not consumed by the darkness.",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly deep considering you can only go forward. Of course, lots or replayability as worlds are randomly generated, and you can unlock differnt characters. I like that you can stack scrolls on weapons and armor, and make them more effective as you buff them. I got the game on sale for less than a dollar, but I would have paid full price.",
            "review_score": "1"
        },
        {
            "review_text": "this game is extremly fun",
            "review_score": "1"
        },
        {
            "review_text": "It is a randomly generated rpg adventure game that has lovely music and at the end of each run you get points based on your performance which can be used to get greater starts one after another.  -Im the mexican cowboy and i approve of this message- P.S. energy is a b**** get all the food you can",
            "review_score": "1"
        },
        {
            "review_text": "Underrated. Pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "Worth more than its price. Great gameplay. Oldschool music. Hard game. Not a waste of time as you have much joy playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't sure what to think of this game at first, but I bought it because it was on sale.   And let me tell you, it's a neat little game.  I like the concept, and even though each round I have played thus far has been rather short, I'm gathering up Hero Points to apply to further tries. Opening up a little storage vault to put what I find inside, new classes, new abilities... I love how much potential is in this. I haven't played very far yet, but I love what I have seen of it in the time I have played with it.   I get the feeling there's no story aside from the shadows on the left are gonna consume everything, and for a little game like this, that is all it needs. The music, though? The music is really good! Reccommended!",
            "review_score": "1"
        },
        {
            "review_text": "One of the few anime games in steam that doesn't have boobs as the main selling value.  It is a really entertaining game which will manage to frustrate you quite a lot, but that makes the end goal that much sweeter to accomplish.",
            "review_score": "1"
        },
        {
            "review_text": "A quaint, fast paced rogue like game with heavy RPG elements. The graphics are appealing and the difficulty is fair. Plus its only $3.49, so this game gets a pass in my book.",
            "review_score": "1"
        },
        {
            "review_text": "After 6 hours playing the game I could defeat the Demon Lord with 3 diferent classes without using the Vault, just luring him to the guards of the city to TANK him for me and hitting him with my bare fists... Hhahahah so funny.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE this game. Its a lot of fun for such a small price. I did buy the plus and was also pleased with it. Everyday there are new dimensions to enjoy and I have written a few of my favorites down. I was uncertain at first when I read the synopsis on the game. Outrunning darkness? But it adds to the overall experience. All in all if you enjoy side scrollers and RPG's its a great little game.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad time passing game. But I would not recommend it if you don't enjoy rouge-likes a lot. It is quite different than most rouge-likes but I enjoyed the breath of fresh air.",
            "review_score": "1"
        },
        {
            "review_text": "This...  this  is what i wanted Desktop Dungeons to be.  Expected  it to be. Not that hack of a randomized chess puzzle in a goofy 16bit dungeon crawling coat. 'Kill things in precisely this order using precisely these skills in this manner so you can...' UGHHH. 'Designed for a quick 10 minute dungeon-crawling experience' the reviews said. Pffft. I'd rather grind Adamantoise on Gran Pulse for 3 striaight days again. At least i felt like i accomplished something afterwards.  ANYWAY... I've only played 2 hours of this game so far and i can already tell this will be the game i sink weeks into, 30 minutes at a time. Fun, cute, slightly dark, action-packed, randomized, tons of unlocks, mysterious anime characters asking when it's their turn to talk (and the requisite sexy fairy with a sass-mouth telling them to shush),  quality  music, easy mechanics... i don't know, it's just engaging, right from the start. I'm sure there will be drawbacks in there somewhere, and i usually wait to review a game until i've given it a more thorough playthrough, but it's so solid already, and reminded me so much of what i  thought  i was going to get from Desktop Disappointments that i had to say something. And for only $10 with DLC.  It's like... when you see this girl, and she looks really good on paper, and everyone (including her) is telling you how great she is. And then you start dating her, and you find out, like, yeah, it wasn't  all  lies, but the truth was definitely put together wrong. So you respectfully part ways, thinking 'well maybe she just wasn't meant for  me ...' And then this other girl pops up out of nowhere, and you realise that she is everything the other girl said she was supposed to be, but doesn't really talk about it. And then when you ask her if she'd like to go to dinner, she says 'let's stay in and cook, it's less expensive and more fun.'  10/10 suck it Jerktop Dungpies",
            "review_score": "1"
        },
        {
            "review_text": "i thought i was doing well until a bat slapped me in the nuts and i died",
            "review_score": "1"
        },
        {
            "review_text": "-Start -Go left -Die -Repeat process -10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best $0.87 I've ever spent! I enjoyed the work of every detail in this game! There's so much more than meets the eye with One Way Heroics and ,on a side note, being a programmer myself a big THUMBS UP to the guys behind the screen grinding for that (probably around) 400 pages of code! haha rough estimate but its a must play for all y'all final fantasy lovers and mystery dungon fans, it's a georgious mix! FYI I beat the game on my 4th try after about half an hour of playing and I still love playing this ever so creative masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "The learning curve is a bit steep, but once you get the basic concept of how the abilities and classes are played, it is a fun way to spend relaxing. The price is great, but if you really are short on cash, get it when it goes on sale. -TKP",
            "review_score": "1"
        },
        {
            "review_text": "An amazing roguelite that's cute, simple, addictive, and surprisingly filled with interesting characters with good personal storylines and multiple endings.  It might be a bit on the easy side for its genre, but you are encouraged to ramp up the difficulty because higher difficulty means higher score, which unlocks new features for additional playthroughs faster.  It's really cheap too. GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay but had a very slow start, hard to get the grasp of the game (plan go slow and insane RNG)  However from a F2P perspective it is a good download, I managed to unlock another class in the first hour and had fun as a Ranger before the time ran out.  So all in all it is a good download but can be quite frustrating games at time, you make a super run and then a wall blocks you and the demon 'left side' eats you :(",
            "review_score": "1"
        },
        {
            "review_text": "The learning curve is a bit steep, but once you get the basic concept of how the abilities and classes are played, it is a fun way to spend relaxing. The price is great, but if you really are short on cash, get it when it goes on sale. -TKP",
            "review_score": "1"
        },
        {
            "review_text": "The best roguelike I ever played. Story, style, and mecanics are beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique and addicting RPG style games I have ever played.   - Different Characters - Random gameplay each time - Level of difficulty makes you engaged - Original and Unique game mechanic",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Enhance your power by getting naked. Talk to Frieda, the true waifu. Look at her cute face as she gets embarressed. Be a pervert. Become a naked hero. Defeat the darkness. Level up. Kill NPCs. Be attacked by PETA. Destroy Peta. Destroy the thieves guild. Worship Frieda. Save Frieda. Love Frieda. Why is there no bodypillow of Frieda?",
            "review_score": "1"
        },
        {
            "review_text": "It's a traditional roguelike but the push to move right is a uniquely fun twist. Whenever you enter a dungeon or building, it often feels tense to grab as much loot as you can and run from enemies if you have to. This game is charming and I would recommend it for anyone who likes to play roguelikes that are turn-based and want a bit of a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "With the Mystery Chronicle version of OWH adding some divisive choices into the game, it made me appreciate the relative simplicity of OWH a lot. It's just you, the monsters, your companions, a Demon Lord, 1000km+ of neverending, randomly generated road ahead of you, and a wall of black death behind you.   There's nothing really like it (other than itself) and it's pretty much one of, if not, THE best 'coffeebreak roguelikes' out there that's actually an honest-to-God ROGUELIKE. There are guns, but no twinstick shooting. Skills, but no cooldowns. Time, but not real-time. It feels good to see something actually carry the spirit of Rogue while doing its own thing without taking it into an entirely different genre.  So get it. This and it's expansion pack OWH+ goes on sale for about $2 dollars every sale. I don't know why you are still reading this and not going out to slay an evil lord, stop a death wall, and (maybe) save a cleric with dog-ears life?",
            "review_score": "1"
        },
        {
            "review_text": "It's Jordin Sparks- One Step At A Time, made into a video game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and difficult game. You really have to plan ahead and think what you're doing with your character. Worth a playthrough at it's price. Class system is fun too",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on sale for under a dollar, best money spent",
            "review_score": "1"
        },
        {
            "review_text": "Started game. Tried controls, like normally would. Got consumed by darkness and killed, within first 15 seconds of the game. Then got encouraged by cute fairy and told it was 'part of the experience.'  10/10 would get consumed by darkness again",
            "review_score": "1"
        },
        {
            "review_text": "This game is easy to get into and has a great despondency. One Way Heroics has some great side characters, which to me were memorable. There are many characters for multiple playthoughs and has an interesting story. It's also really cheap and often goes on sale, so it's not too hard to get it for less than $2, and in my opinion, totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "If you want an awesome RPG and have broken your ability to go left... the is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game has some interesting concepts but it is quite tedious and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "There is a TL:DR  If you grab this game for less than $1 then it is very much worth it. I actually REALLY like the game and the simplicity of combat but boy oh howdy is it a very shallow experience. Aside from tiny modifiers and higher difficulties this is a very easy game to beat once you figure out how not to die to the moving wall of darkness.  There are 2 types of rogue like games. The first type you actually progress your character accross playthroughs (Dead Rising, Rogue Legacy) where you get your sense of accomplishment despite not beating the game.  The other type consists of losing literally everything stat and possession and see if you roll the dice better this time around. Thats much harder to remain satisfying since from a stat angle you can't tell who has 80 hours of play time and who has 5 hours. So why invest the additional 75 hours?  This game is the latter, sure certain games can pull it off like Faster then Light because you unlock ways that alter the game in a dramatic way that getting those unlocks feels worth it even if you lose. This game has a few different classes but they control and play almost identically and their bonuses would only be noticed if this game was in the former catagory. It wouldn't be hard either, you remove weapon degredation (since you can save items between playthroughs) and allow perminent base stat increases using the levels you gain in playthrough as currency. Make this playthrough harder so that future ones will be easier sort of deal, they already have something like that but it only applies to the current playthrough  TL:DR this game is very much worth if you're buying it for literal cents on the dollar. It goes on sale frequently",
            "review_score": "-1"
        },
        {
            "review_text": "Generally too tedious, complex, and inflexible to be fun. A tutorial would probably help a little, but navigating the outdated interfaces and mechanics feels like trying to run through quicksand. A disappointment for what appeared to be innovative.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't understand the reviews for this game. I hated it. I got no story at all. I basically ran for all of two minutes (tops) to the right. I would pick up a bag or slash at a bat or two before darkness was upon me and I lost. I dont know if you just have to constantly reload and level up your character that way, but no one really talked about that in the reviews. I hate timed games in general and this might actually be the worst about it. Also I have no clue what those screen shots are but they tricked me into believing their was going to be character interaction and plot building, which I did not recieve.  So honestly, if I'm playing it wrong please correct me and my review because I really wanted to like this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Watafak-Water Park-What The Fish",
            "review_score": "-1"
        },
        {
            "review_text": "game makes me SICK!!! WORST GAME EVER dont play!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Crap on a stick",
            "review_score": "-1"
        },
        {
            "review_text": "30/100",
            "review_score": "-1"
        },
        {
            "review_text": "The music is ear-bleedingly bad and manages to sound repetitive without actually being repetitive. Why would the 'artist' put their name on this?   The sounds in general are terribad. It is trying to pay homage to the 8 bit games of NES and the like, but it manages to actually be the same quality, only more shrill. Paying homage does not mean trying to literally copy the original, and then amp up the worst aspects.  There are 3 available resolutions. None are wide screen. One is so small that my phone actually has a larger screen. Terrible.  The resolution in general is very poor. Again, paying homage does not mean turning the negative aspects of something up to 11.   There are numerous interface issues. EG, why doesn't moving into an enemy attack them?   Overall, I cannot recommend this. It's an interesting idea done poorly.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know why the rating on this game is so high. Must be rigged.   This darkness mechanic is stupid. Combat sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "This game. This game is what wastes your money and time. The time I have 'played' according to Steam, is wrong. I've played about 4 hours and hated it all. I don't even understand why people find this game fun? What am I missing? You're forced to walk to the right and if you go off screen, guess what? You're dead. Time to start over.",
            "review_score": "-1"
        },
        {
            "review_text": "This game blows ♥♥♥ cheeks.I know it was a dollar and what would i expect, but come on. It really sucks. The sounds are annoying, the game is lacking any graphics. Don't waste your time. 1/10 (just because it's a functioning game)",
            "review_score": "-1"
        },
        {
            "review_text": "So i get a Blue Screen everytime I play it longer than one minute. But what i could play was good ;D.",
            "review_score": "-1"
        },
        {
            "review_text": "This buggy mess has not been able to run for more then two minutes without crashing, DO NOT BUY.",
            "review_score": "-1"
        }
    ]
}