{
    "app_id": 266270,
    "name": "Gridiron Solitaire",
    "release_date": "2014-01-21",
    "developer": [
        "Bill and Eli Productions"
    ],
    "publisher": [
        "Bill and Eli Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Casual",
        "Card Game"
    ],
    "achievements": 0,
    "positive_ratings": 55,
    "negative_ratings": 14,
    "price": 5.59,
    "description": "Inspired by classic games like TV Sports Football, Front Page Sports Football, and Fairway Solitaire, Gridiron Solitaire combines football strategy with a solitaire-style card game for a new sports game experience. Lead your team to the Gridiron Bowl Championship!Featuresa game world with almost unlimited depth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/266270/header.jpg?t=1447359583",
    "minimum_requirements": "OS: Microsoft速 Windows速 XP or later Processor: Single-core processor 2.5 GHz+ OR Dual-core processor 1.5 GHz+ Memory: 1 GB RAM Graphics: DirectX 9 Compatible Graphics Card DirectX: Version 9.0 Storage: 165 MB available space Sound Card: DirectX 9.0 compatible sound card Additional Notes: ***This game requires Windows Media Player to play video and audio files!****",
    "recommended_requirements": "OS: Microsoft速 Windows速 7 or later",
    "reviews": [
        {
            "review_text": "I was very conflicted buying this game since I love American football but hate solitaire. Luckily, this game actually manages to capture the feel of football in a way I honestly didn't expect. This game is definitely well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I've been waiting to play this game for a LONG time and have followed the development since it was announced. The lead designer turned me onto Fairway Solitaire long ago, and that became a favorite of mine. I'm about three hours into Gridiron Solitaire now and I'm not disappointed. I think the most interesting thing to me is the uncanny way that this card game feels like football. Something about the rhythm of it feels right. I would not have believed that I could feel a sense of tension while playing solitaire, but when I used my last defensive Big Play of the game and saw the computer drive to the end zone in disturbingly short order, I started to panic that my 14 point lead might not be enough. It was a squeaker, for sure!  I recommend this game - a great little indie title that knows exactly what it wants to be.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay of Gridiron Solitaire consists of linking cards that are opposite color and one number apart. At its core, it's a basic solitaire game. However, the strategy elements and the uniqueness of each game/puzzle brings a surprising level of depth. The Big Play feature adds a surprising level of excitement and strategy.  I was disappointed with the off-season portion of the game. The game punishes you for doing well the previous season. That part of the game just misses the mark for me.  I'd been looking for a game I could mindlessly veg out on to appease my need for stimulant while I'm doing tedious tasks such as taxes, paperwork, or when I want to play a game that I don't have to get invested in to enjoy. This one really delivers.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS GOLD. It's such an amazing concept that does so well in it's execution. It's amazingly fun and highly recommended for casual or hardcore fans of Gridiron football. As well as fans of the game Solitaire itself. It's so ridiculously clever that you can't help but realize that you've already played it for hours. Easy to learn , and genuinely ENJOYABLE! If you can play windows solitaire then you can play this! +5 STARS!",
            "review_score": "1"
        },
        {
            "review_text": "Great Combo Football &amp; Solitaire! Who Knew!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game that does a surprisingly good job of scratching the 'want to play a football game but I hate the Madden series' itch.",
            "review_score": "1"
        },
        {
            "review_text": "Comparing Gridiron Solitare to Front Page Sports Football is akin to comparing Cruis'n USA to Gran Tourismo. Shame on you Bill and Eli Productions.",
            "review_score": "-1"
        },
        {
            "review_text": "Really wanted to like this one. It's boring. Plain sucks.",
            "review_score": "-1"
        }
    ]
}