{
    "app_id": 266490,
    "name": "Lili: Child of Geos - Complete Edition",
    "release_date": "2014-05-09",
    "developer": [
        "BitMonster, Inc."
    ],
    "publisher": [
        "BitMonster, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Female Protagonist",
        "Indie"
    ],
    "achievements": 46,
    "positive_ratings": 795,
    "negative_ratings": 116,
    "price": 10.99,
    "description": "Lili is a quirky adventure RPG hybrid with stunning visuals, silky-smooth graphics, a cinematic story-line, and a fresh new way to deal with enemies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/266490/header.jpg?t=1447359591",
    "minimum_requirements": "OS: XP Processor: Intel Core 2 Duo 2 GHz Memory: 2 GB RAM Graphics: Intel HD 4000 DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: 7 Processor: Intel i5 2.5 GHz Memory: 4 GB RAM Graphics: GeForce GTX 560 DirectX: Version 9.0c Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Adorable and with a beautiful art style, Lili: Child of Geos is a refreshing and imaginative game packed with fun humor, quirky characters and wonderfully crafted areas to explore.  Gameplay is simple: you're Lili, a young student visiting the island picking flowers for a school project. As you stroll around collecting, you'll bump into lots of interesting folks with fun things to say, little quests for you to do and treasure to find.         Aww, what the hell!?&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "1. great background graphic 2. slow, relax 3. costumes  when u r tired about life, it's a good game to you",
            "review_score": "1"
        },
        {
            "review_text": "I love this game SO MUCH!   The visuals are stunning to say the least, the battle system is very unusual, creative, and turned out to be quite a lot of fun (you literally 'deflower' more-or-less-evil spirits, without actually killing them). Some dialogues and information sheets about the spirits are totally hilarious!  And some constructs look sooooo adorable! I can definitely recommend this game for children! And adults, of course. ;)  The overall game seems really sweet and wonderful so far. The story is not that special so far, but it is fitting and I am looking forward to seeing how this turns out.",
            "review_score": "1"
        },
        {
            "review_text": "Lili: Child of Geos is a third-person adventure game that screams: 'Potential.'  It's Zelda-esq on the surface, but offers a far more peaceful experience. Not having to slash a sword or kill everything in sight is a welcome addition to video games. The game world is richly animated, making it feel alive. My only real gripe is that there are no puzzles to solve.  Pro's  + A strong and cheerful protagonist. + Vibrant colorful aesthetics. + Energetic music. + Interesting cast of characters. + Item shop. + No combat. + Surprising story. + Optimized. Never ran below 60 FPS.  Con's  - No puzzles. - Clunky Controls. - It's a phone game.  It is well worth the 10 bucks they are asking for it. I hope the developers can make a sequel into a full fledged game.  The sequel would offer: * A larger world to explore. * Mind boggling puzzles. * Continue the 'no combat' progression. * Fully voice acted.",
            "review_score": "1"
        },
        {
            "review_text": "Pick flowers from their heads to beat enemies. Ha, nice idea.  Short and simple, but sweet and family friendly (but not childish) action-adventure with colorful, lovingly art design and nice The Legend of Zelda references - I mean, just look at the game profile pic on the shop page. The zeldalike music in the first of the 4 short areas made me smile all the time. Still enough own ideas, e.g. you don't have weapons in this game, see first line.  Visually improved port of a good looking mobile game (Unreal Engine 3) - see Community Hub for pretty impressive comparison shots.  First playthrough will take you about 5 hours, but I stayed longer on the island as I use to take my time if I like a game.  44 of 46 achievements can be unlocked during the first playthrough (and only 2 of them are collectibles achievements and need some extra time), the last 2 achievements need a 2nd and 3rd start - not playthrough - of the game and can be unlocked within ~25 min each.",
            "review_score": "1"
        },
        {
            "review_text": "Adorable and relatively short adventure game with easy gameplay. You play as the girl Lili who visits the island of Geos to find flowers she needs for a school report. The world is not very big and it's divided into four areas that unlock as you complete quests. Most of the game is collecting flowers, breaking vases to pick up coins and entering people's houses to find lore items. There is no combat, instead you engage in mini games in which you defeat enemies by plucking flowers off of their backs. (In other words, there's no violence, but there's some vandalism and tresspassing. :D) There are a bunch of NPCs you can talk to, but the game doesn't have voice acting so expect to do some reading. It's worth it, though; although it can easily be categorized as a casual game, it is surprisingly well written and quite funny. Pick this up if you want something relaxing to play or if you need something non-violent and fun for your kids to play.",
            "review_score": "1"
        },
        {
            "review_text": "Lili: Child of Geos is a gorgeous game with a great sense of humor. It's a game that's actually relaxing to play, and is worth checking out just to experience the detailed, colorful world that the developers have created here.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game for its simplicty and just having very casual gameplay. Very nicely crafted and polished. Also if you have ever enjoyed ANY The Legand of Zelda games you will love this game too!",
            "review_score": "1"
        },
        {
            "review_text": "Got thru the game with most of the achievements in under 5 hours. Although for some reason I didn't get credit for some of the achievements :( Anywho, Lili: Child of Geos is a good casual game. The only three negatives things I have to say about it are: 1. No back story/intro. They just plop you onto an island with no information and you piece most of the story together throughout the game. 2. No voice acting. Great, story telling games do not need voice acting, however this is not one of those games and even though the story was pretty good, it would of really elevated it if the characters had voices. 3. No replay value. You are basically playing the same minigame over and over again. Sure you can get a better score, but that gets tedious. You do have a choice near the end of the game that I suppose can give you two different endings, but since the beginning to that point would be the same, I do not think it is worth it.  I do recommend this game as it is interesting and different, just not at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Even though this game was very short (Finished in 4 hour) i loved every minute of it. It's awesome looking, Fun achievements, Funny dialogs, And super good looking. Loading times are super fast too, I give it 4/5 stars because it's a little bit to easy and short.  Do i recommend it for the current full price of 19,99? No, To short for that. However, I do recommend it around 14,00$",
            "review_score": "1"
        },
        {
            "review_text": "had it siting in my Library for almost a year until I decided to play it. Finished it in one sitting. It was actually quite fun and I recomend it. Probably perfect for older kids around the age of 12 but also very fun if you like some relaxing game to enjoy. Would i play it again? Propably not. But i had fun playing it, and there is a lot of games out there that take the fun out of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game yesterday and so far I have been enjoying it. Not only is the game enjoyable, it looks amazing too!",
            "review_score": "1"
        },
        {
            "review_text": "Quite an odd and relaxing game, just halfway through and the gameplay is quite casual. Filled with random quirkiness and references to other games. A good game for casual players. :)",
            "review_score": "1"
        },
        {
            "review_text": "A friend bought me this game during the sale, but its charm alone is worth the MSRP of $20. I thought I would play for like 10 minutes just to try the game out but a little more then an hour had past before I finally shut it off. It is a fun explorative game, down the lines of similar platformers like Zelda or Dark Cloud.   Except this game has a child like charm attached to it, so you won't find any swords or any weapons for that matter. Even bombs are fairly harmless and the worst you'll be doing in the game is picking flowers off of evil spirits. Its a very zen like experience to gameplay.  There are tons of characters with their own charms, and the graphics play their role dutifully. If you're looking for a deep story look elsewhere but if not and can open your heart to a game that has a story closer to a childrens movie you will find alot of enjoyment. Talking to NPC's and admiring the little details in every scene.",
            "review_score": "1"
        },
        {
            "review_text": "Although it might not be worth 19.99 it is a fantastic game. I never thought I would enjoy a game that consisted of collecting flowers. The graphics were stunning and the sense of humor in the notes and items make me laugh quietly to myself. I might continue to play in free roam mode just to take in all the graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Wow this game make me fantastic. Feel like into the fantasy world. Great!",
            "review_score": "1"
        },
        {
            "review_text": "Relax ,Fun exploration, and Fantastic atmosphere.  You play as young botanist named Lili who is sent to discover Geos island as a part of her student project. The game is about exploration and meeting. As you progress the storyline, you will discover more friendly woodman, Spirit as enemy. and collectables in different and charming area. I've to say I really love level designs and characters. Sure, it's mobile port which I expect simple mechanism. Chasing and play minigame as main combat. picking flowers, explore and complete side quests. character customization, soft RPG elements, and fun dialogue (A lot of references from other games).  However, the control feels quite delay and a bit clunky. And combat parts work like repetitive minigame. But I've to say it's really relaxing and very enjoy experience for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Shut up and LOVE THIS GAME!!",
            "review_score": "1"
        },
        {
            "review_text": "Was gifted to me and I loved every moment of it. The game is cheeky, adorable, and absolutely beautiful. Not too much replay value, but definitely worth every moment I spent playing and finishing. I spent maybe 5 hours completing the game, and another 2 or 3 getting every achieve. Highly recommend this cute jewel! c:",
            "review_score": "1"
        },
        {
            "review_text": "Was gifted to me and I loved every moment of it. The game is cheeky, adorable, and absolutely beautiful. Not too much replay value, but definitely worth every moment I spent playing and finishing. I spent maybe 5 hours completing the game, and another 2 or 3 getting every achieve. Highly recommend this cute jewel! c:",
            "review_score": "1"
        },
        {
            "review_text": "Super chill and beautiful game. This game is just about the need to explore beautiful locales and finding various items.   Very easy, but the whole point of it is to just relax and enjoy the world it puts you, which is easy to do.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, I expected a lot less from a casual game like this, but I was surprised. It's really fun, follows an interesting story-line and I don't even have to tell you, the artwork on this is beautiful. Not to mention, the witty, cute references, dialogue between characters makes this game hilarious. If this game is on sale, I'd recommend picking it up.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! I love the outstanding visuals and fluid gameplay! Would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "If you had told me 24 hours ago that a game about deflowering people against their will would be my favorite game of the year, I would slap you upside the head and tell you to go back to your dammned Sword Art Online. Even though the premise is silly, and it tries a little too hard to be a Nintendo game, it's an amazing game. Honestly, I wouldn't expect a game this beautiful with such a unique premise to be a Steam game! It's a bit small, I beat it 100% in a little over 3 hours, and it doesn't start out on a very strong point at all. It would've done better with some sort of intro sequence, instead of throwing you directly into gameplay. I also wish it would've had some platformer elements, or, you know, a jump button. With all of the crates lying around in Split Wood, the kid in me was just dying to hop up on them and see where they lead! I could easily compare this game to a watered down Zelda meets Shadow of Collossus, with some LittleBigPlanet-esque characters and graphics.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun and beautiful little game,the world colour is amazing and the main character Lili is so funny and friendly, I recommend this game for female gamers and hope that all who get it will like it, RandomUnicornGirl out.",
            "review_score": "1"
        },
        {
            "review_text": "My boyfriend and I played this game together and greatly enjoyed it (overall).  Overall rating: 8/10 Objectionable Content: Mild? (bordering on 'some'?). There is some 'humor' that is questionable both in taste and apropriateness for younger audiences. *See end of review for details, including trigger warnings and warnings for parents.  As far as the rest of the game goes, the atmosphere and evironments are absolutely stunning and worthy of screenshots. and the music is varied and well-suited. There is a bit of a Zelda-esque atmosphere which comes as no surprising seeing all the little Zelda references sprinkled throughout the game. It was refreshing to play a game that was not violent, yet still involved 'beating the bad guys.' So many of the characters you meet are adorable and hilarious, and have succeeded in getting laughs out of both of us. It is worth talking to all of them; they say some of the most ridiculous things. The gameplay centered around a very simple concept: pick flowers, though it was a pleasant surprise to find that it could be still be challenging sometimes. I would easily recommend this game to most of my friends.  Pros: + Fun, non-violent gameplay + Gorgeous visuals + World worth exploring (not overwhelming like big sandbox games) + NPCs worth interacting with + Nice soundtrack  Cons: - The aforementioned tasteless jokes (why it is 8/10 and not 10/10. they were pretty gross.) - Unexpected spike in difficulty between areas/levels. - Does not clearly state its save mechanism (it's autosave, btw) and does not indicate what triggers a save - Bit pricey for the length. I wouldn't pay more than ~$12. - No replay value (one achievement needs ~half a 2nd playthrough but that's it.)  *There are a small handful of instances in which sexual harassment is normalized or made into a joke. Fortunately, they are few and far between, and most are easy enough to ignore and move past, but I can see a couple of the jokes being potentially triggering - especially since you would not see it coming from a game like this (we were very surprised ourselves). None of these jokes are a big piece of the game, but it's enough to make it not an 100% all-ages friendly game. To be more specific, TRIGGER &amp; PARENT WARNING: Stalking (creepy photos of Lili and her butt in one NPC's place), Sexual harassment (abuse of power/authority), Sexual abuse (1 joke).",
            "review_score": "1"
        },
        {
            "review_text": "This game is a super casual game, and yes, you pretty much pick flowers and smash pots. It's not difficult at all but it an odd way, it was really fun. Definitely something you can just relax and play. It reminds me of a game that would be on Wii-U due to its cute charm. I got it on sale for under $3 and I suggest everyone do the same.  Pros:  + GFX are nice + The characters are really odd and interesting + Has a great charm and there are some cool game references like Zelda and Mega Man + Honestly, fun to play + The surroundings are really fun to look at + I could argue that it is the best casual game I have ever played  Cons:  - Too easy, not challenging at all, you can get a key to open all locked doors at the beginning of the game, the items are useless, I didn't even need to use them - Moving between areas, the game kind of freezes for two seconds when opening red doors, annoying - When using a controller, some times the right stick will drift to the left, it can be fixed just by moving the right stick, but I don't think this game was designed to support controllers at first - Full price for this game is too much, I beat it in 6 hours and got 42/46 achievements, $20 is too much  Overall, I'll give it a thumbs up. Just get it when it is on sale and don't expect it to be something super epic. It's just to have fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game looks really great and is a really original and fun. I haven't finished it yet, but I probably will finish it today or tomorrow. I do reccomend this game for it's original and entertaining experiences.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "I thought Grass Simulator was the pinnacle of gaming.... until I played this gem.   Do yourself a favor, and grab a handful of Lili today.     9/10 -No t i t t i e s-",
            "review_score": "1"
        },
        {
            "review_text": "Game was so good and refreshing I forgot all about my problems. Art is superb. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true surprise and lots of fun. Beautiful graphics and a magical tasks picking flowers.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Good easy going game with low intensity   Great nonviolent combat system  Smart, funny, relatable female protagonist  Fun, heart warming, and enjoyable story  Beautiful visuals and music  Priced just right  Cons:   Game play time might be too short for some people  May not be enjoyed by people wanting violent combat  If you enjoy video game trivia you’ll enjoy this game. If you enjoy dressing up like link, breaking pots, and having a fairy follow you you’ll enjoy this game. If you enjoy picking flowers, wearing the mask of spirits, and exploring a world where birds poop rainbow paint you’ll enjoy this game",
            "review_score": "1"
        },
        {
            "review_text": "Just a nice quick review here.  I bought this game because I'm a huge sucker for beautiful looking things. I don't really like casual game- something that isn't stimulating really puts me off. But I can't believe how drawn I am to Lili.  The gameplay is very simple- you are on an island collecting flowers for your (school?) project. You have to collect red soul flowers from the islands evil spirits. I admit it does get a bit repetitive after a while. But thats where the beauty of the game comes in. The environments feel so greatly detailed. You can go into some of the houses of the towns folk and you get a pretty detailed look at how they run their lives, pictures on the walls, toilet paper on a tree-stick holder! With every new area I seek out- the more amazed I am of the beauty.  This is a short happy game- be prepared to do things over and over with a little bit of rotation. But take your time, explore. Experience the beauty.  If I'm ever to get the Occulus- I really want this game to be playable with it. I want to be in this dream world!  Pros: ABSOLUTELY BEAUTIFUL GAME Nice soundtrack interesting 'people' Sneaky game refrences  Cons: Not a really deep story Enemies are repetative Very little voice acting makes it feel like a wall of text sometimes  I decided to pick up this gem when it was on sale ",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing funny fun game, make an expansion or something!",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, the atmosphere is amazing. I loved everything about this game although the controls seemed a little off at some points. Awesome game, I beat it in one sitting and i will definently play it again!",
            "review_score": "1"
        },
        {
            "review_text": "Lili: Child of Geos is a great little adventure and when on sale is definitely worth a pick up. The locals are interesting and quirky and the game puts you in a fun little zen like state trying to find secret items and chests to unlock. The only thing I have a problem with is it's a short game. Three hours long if you take your time and the game can get repititive quickly. But, it's the atmosphere and fun situations that make the game really worth it. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a fun little pick-up-and-play game. I rather enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good game, good graphics(UE4), good story, good humour, enjoyable even for adults and completionists. Well worth 4-5 hours of your time.",
            "review_score": "1"
        },
        {
            "review_text": "What a beautiful game! And with fun, quitky gameplay that focuses on alternatives to traditional combat mechanics. I had a lot of fun with this one and would recommend it for it's visuals and engaging gameplay ... in addition to the endless stream of semi-suggestive phrases ... either that or I've got a really dirty mind         YouTube™ Video:  Deflowered! - Lili Child of Geos - Forteetu Games&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Cute, colorful, fun collectathon. Simple but very engaging and addicting 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Superbly executed, especially considred it started life as an iOS game. Laid back, vibrant, and extremely well written, if you want a game that you can pick up and drop off without consequence, this may be the right game for you; although I couldn't personally bring myself to stop playing it until I completed it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is chill af and most definitely worth the 3.59 I paid during the steam sale.   Pros: It has a lovely artsyle and a simple combat system that made me feel very relaxed as I made way through the world. Highly recommended if you have any younger gamers in your household as this is a very simple and straightforward game.   Cons: I wish you could customize the protagonist a little bit more. Aside from that the only thing I wish is that there was more of it! Beat the game in 5 hours with the exception of a few side quests.",
            "review_score": "1"
        },
        {
            "review_text": "loved it simple sweet and just over all fun",
            "review_score": "1"
        },
        {
            "review_text": "I had iOS version already and was expecting PC version to be same to be honest, I just bought it for improved graphics, but I was wrong there's way way more content on PC version and it's really a fun game! There are lots of new quests, you can now change your outfit/hat/pet which is really cool. Protagonist sounds like a ♥♥♥♥♥ sometimes but she's cool mostly. If you are looking for an adventure game to pass some time you should get this.",
            "review_score": "1"
        },
        {
            "review_text": "By the trailer, I decided I wanted the game; but I wasn't willing to spend $20 on it. So as do all (*cough* most) of my games, I bought it on sale.  I have 4 younger siblings, and this game provides a safe, clean, game environment for them. As with most games, there was some humor pertaining to current society, but nothing that a younger child would understand. The graphics are spectacular one of a kind.  If you are looking to spend your money on longlasting game, this game isn't for you. If what you want is a clean and beautiful gameplay, I would definitely partake in the playing of this game. Though personally, I believe the game should be in the $5-$8 price range, the game is definitely worth it if you have young children (around 8 years of age) whom you want to play clean games.  To the developers: You created something new here. Work on that. Create a franchise. Ease of the throttle of side quests and add more to the storyline next time. This game is peaceful, but it could still have such a sense even if you added more strategy without exactly adding more challenge. Add more customization to the strategy. More than just outfits, but outfit pieces that contribute to a better stat system. Invest in voice actors, it makes a huge difference. Look into adding a better ambient/light-trance music to the game to compliment the awesome scenery you achieved. Lastly be optimistic! You did awesome!",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty relaxing game, fun to play",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! I was glued on it and beat the stroyline within 5 hours! Im going to finish up the quests and everything, but I really want DLC's with more adventures of Lili going other places, you guys left wide open on purpose i;m sure, I just want to see more! =D",
            "review_score": "1"
        },
        {
            "review_text": "Lili Child of Geos is the most hipster game I’ve ever played due its 'Trolling' costumes, treasures, and jokes. It’s a fairly simple game: run around the island as Lili until you encounter a Spirit and deflower them. I recommend playing with a controller for easier flower picking. It bothers me how you can't fully complete Lili's skill tree but it isn't necessary for finishing the game. Overall I would give this game a 7/10 based on the world, story, and game play. Though this game is entertaining for a few hours with its repetitive game style; it is Not Mind-blowing. I would suggest waiting for this game to go on sale for some cheap entertainment (Don't pay more than $10 unless you really want it). If you like playing games where you go around collecting to clear objectives then this could be the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Very creative and nice looking little game. Great for kids. For everybody else too dull and boring.",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing resource-gathering walking simulator with a short plot. Roughly 3-4 hours of gameplay, know what you're getting into before you buy   PROS  - Beautiful graphics - Decent camera work - Relaxing and fun to play and explore - Dialogue  - Easy, even on Hard difficulty - Relatively simple to 100% (if you're into that like me)   CONS  - Repetitive and grindy - Very short - Easy, even on Hard difficulty   7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Lili: Child of Geos is a short, but fun RPG with a nice story. It takes place on a island called Geos. On this island you have to collect flowers to complete your studies. This game has content for 3 to 4 hours. However, if you want to get all the achievements you will be busy for a little bit longer. I don't think the achievements are worth the time, but if you have some time over why not try it.   There were some problems that I encountered. Sometimes the controls with the mouse were not as optimal as I hoped they would have been. I saw that this used to be a mobile game, so perhaps it might have something to do with that. There was also some lag between the different doors, but that did not hinder the gameplay. I did however wondered what the function of the outfits were?  Overall, a very nice short game. I would not buy it at full price, but when it is at sale it is definitely something to look at. ",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed playing this game. It is quite casual, easy and short, the achievements are easy to get too. The game has some good sense of humor and I ended up falling in love with the type of personalities in the game, almost too cute, Basically you run around, jump on enemies and pick out their flowers using different buttons quickly.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe how much fun this is! References, colourful and alive world, fun gameplay, upgrading. When I bought it for 99 cents my expectations weren't too high, but iz tots funsels.  *edit* After having finished Spec ops: the line and almost dying of dem feels, this game soothed them, as far as that's possible ;|",
            "review_score": "1"
        },
        {
            "review_text": "LiL presented wonderful imagery and a vibrant living world, graphics looked great, smooth game play, and characters felt like they belonged in the world where they lived. Although the game was a bit on the easy side, I enjoyed the ride. Game could be considered kid friendly but adults should find some of the dialog amusing as well.  Two minor complaints that should not prevent a buy:  1) The inability to remap controls the 2 default options should handle most players.  2) Some achievements are grinds extended far beyond what would be a full play through.  Over all a beautiful game worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! I was glued on it and beat the stroyline within 5 hours! Im going to finish up the quests and everything, but I really want DLC's with more adventures of Lili going other places, you guys left wide open on purpose i;m sure, I just want to see more! =D",
            "review_score": "1"
        },
        {
            "review_text": "Such beautifull and pure game,i bought it and i just love it! the gameplay is very nice,the overall quality (visual) is awessome,very detailed,and colourfull,i love to walk around, the high defenition is awessome,i hope to see more games with the same visuals and gameplay in the future!",
            "review_score": "1"
        },
        {
            "review_text": "Great Graphics and relaxing contents! I am nearly addicted in it in first 30mins.  9/10 for this game, the reduced 1 point is for my dislike of glasses.",
            "review_score": "1"
        },
        {
            "review_text": "Lili: Child of Geos is a beautiful and relaxing action adventure. When I saw screens of it I first thought this is probably some kind of highly polished hidden object game. What “sold” me was when I discovered you can actually walk this marvellous world.  Item hint:   Get the Skeleton Key early on as well as the Treasure Map (helps you keep track of chest and find flowers). Boots, bracelets and necklaces seem to have negligible effects when hunting Spirits.    + Beautiful somehow cuddly graphics + Mostly relaxing atmosphere + Okay story, hints to a possible prequel + References + Moderate length + Game advises to visit the options menu and asks to automatically determine graphics settings + Basically no grinding + Good controls 0 Unfortunately no voice acting 0 Different camera modes - Some advertising for another BitMonster game - Level cap, making it impossible to max out all skills with the same avatar - Flowers sometimes in places that are simply unreachable  I started playing this game in the hope it would provide a counterpoint to Dead Island which had become exhausting and bullseye. After playing like 15 minutes I felt pretty relaxed. The game still has tense moments but all in all it's a pretty tranquil experience. Although the game's world is not too big it has an expansive feel to it, maybe because it looks lived-in or alive. The back story is rather light, maybe owed to the mobile origins of the game. You control Lili who has come to Geos as a Vegi-Magical student from the Gildern Magis College (with a deadline) but is quickly entangled in in the conflicts of a two-class society. Most NPCs have some depth to them which you learn by interacting with them, i.e. fighting the bad ones (Spirits) and talking to the good ones (Constructs). There is usually a reward for exhausting interaction. There are some indicators to a story that happened before so there may be a prequel.      A Construct mentions a geophantasmogramist visiting the island before Lili   There is a pair of glasses in the lighthouse that look like Lili's   A letter from Lili's father mentions Lili's lost sister   Lili finds a tombstone for a girl named Orchid, who may have been, fitting in with flower-named girls, Lili's sister   The game's title is “Child of Geos” so Lili is supposedly linked to the island   The fishes find Lili's eyes (without glasses; the player never sees them) very interesting, alternating between wanting others to see them or Lili to hide them   Left over comb     The Constructs are wood-based being making a disturbingly wood-based living in wooden houses with wooden furniture and wooden toilets, even toilet paper   and even bringing it to a Soylent Green conclusion  . There are a number of pop-references in the game and there is a mock pop-quiz where Lili can show off here extensive knowledge of games. There is also occasional, not too much, advertisement for another game by BitMonster.  The game is of moderate length and may take you two evenings to complete. You can explore the world some more after you beat it. There are a number of achievements that may make you play some more and the “max out skill” achievements actually require you to stature at least one additional game – it took me not quite an hour to max out a single stat. Besides that there is almost no grinding.  Unfortunately, there is no voice-acting. Instead there are a few generic sounds or words, e.g. “Hello”, and Lili's feelings are well-done by stances and facial expressions.  With so many games not actually having any actual options, I found it interesting that the game starts out with advising you to go to the options menu and offers to automatically determine your machine's graphic settings.  The controls work fine with the world's topology and are pretty tight with few exceptions. When chasing a Spirit it happened at times that instead of jumping onto them I suddenly found myself in conversation with a Construct or picking a flower because the game decided that was more likely what I wanted. Then you're supposed to collect flowers set around the world but a few of them are simply set in places Lili can never reach, e.g under bridges. There is a number of different camera modes that aren't listed in the games help - I didn't find any use for them. Activated them with keys Insert, Delete, Home, End, PageUp, PageDown, then move around a bit to see their effect.  Lili: Child of Geos was a lot of fun and I recommend it. I bought the game as part of a bundle and probably wouldn't buy it for the full price (currently 10 Euros) but wait for 50% off. I'd be delighted to see another game of this kidney, maybe a sequel or Orchid prequel.",
            "review_score": "1"
        },
        {
            "review_text": "A cute and fun adventure game for someone looking for something a little different.  Graphics: 10/10. Everything looks absolutely gorgeous.  Sounds: 8/10. Solid sound effects, pleasant to listen to and add to the ambience.  Music: 10/10. Calm, relaxing, and fits the carefree adventerous spirit of the game.  Story: 9/10. A pretty good story overall; I don't want to spoil anything though. The characters have a good bit of personality, and you can find items with random bits of lore attached to them all over.  Gameplay: 8/10. A solid core of exploration, and the spirit wrangling minigame is pretty fun. Somewhat gameplay-light, but it fits the game well. My only real complaint is that the white flowers you collect don't really do all that much... you can turn them into keys (rendered obsolete as soon as you get the Skeleton Key, which you can do pretty early), sell them for money, or gamble them for a potentially larger amount of money. I was kind of hoping that they'd do more than that.  Overall: 10/10. A short game, but a really fun one.  A quick note: While the game is mostly kid-friendly, there are a few moments of subtly racy humor here and there. It's nothing a kid would really get though, so it's probably not a major worry.",
            "review_score": "1"
        },
        {
            "review_text": "Lili is simple, fun, and I think it has a lot of replay value. The plot is staightforward and perhaps overly cutesy in places, but the gameplay is enjoyable and it's a good game to play when you don't want anything complicated or especially impactful.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very reminiscent of Zelda, but unlike Oceanhorn which made me feel like it was a pale comparison of a better game, Lili and Geos felt like they had a life of their own. The game is charming and while there was one crash and a couple glitches, it's definitely worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Lili: Child of Geos is a very short but amazingly fun game. The characters are pretty original, and the gameplay style is something on it's own. The actual story should only take about 2-3 hours, but it's amazingly fun plus there are achievements to hunt for.  The story is basically you're a botanist girl going to a strange island to learn about the flowers. While there, you meet these wooden NPCs called Constructs that you befriend. You find out they're enslaved by the spirits, and so you go on a quest to defeat the spirits and free the constructs.  The gameplay is mostly simple. It's just find the items or jump on a spirit's back and take their flowers to win. The key element that makes the game enjoyable is how beautiful and crisp all the design is. Everything is in an almost super-HD style and it is really pretty.  I don't know if I'd play it for the full 10 dollars, but on sale I got it for 3 and it was worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "A cute and fun adventure game for someone looking for something a little different.  Graphics: 10/10. Everything looks absolutely gorgeous.  Sounds: 8/10. Solid sound effects, pleasant to listen to and add to the ambience.  Music: 10/10. Calm, relaxing, and fits the carefree adventerous spirit of the game.  Story: 9/10. A pretty good story overall; I don't want to spoil anything though. The characters have a good bit of personality, and you can find items with random bits of lore attached to them all over.  Gameplay: 8/10. A solid core of exploration, and the spirit wrangling minigame is pretty fun. Somewhat gameplay-light, but it fits the game well. My only real complaint is that the white flowers you collect don't really do all that much... you can turn them into keys (rendered obsolete as soon as you get the Skeleton Key, which you can do pretty early), sell them for money, or gamble them for a potentially larger amount of money. I was kind of hoping that they'd do more than that.  Overall: 10/10. A short game, but a really fun one.  A quick note: While the game is mostly kid-friendly, there are a few moments of subtly racy humor here and there. It's nothing a kid would really get though, so it's probably not a major worry.",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, fresh character designs, not exactly worth full price.",
            "review_score": "1"
        },
        {
            "review_text": "Lili: Child of Geos 4/10  First of all i have to say: If you buy the game, you probably won't get what you've expected. The game itself is a charming little piece of entertainement, but after reading the steam-description i just expected something completly different. I would not say that it's an RPG ( but some might call it one); To me, it just doesnt look like an RPG, more like a game that's made to have some points an RPG needs while beeing a mix of puzzle, minigames and collecting stuff. For example: You get something like a 'Skilltree' but it doesn't really matter where you put your points, since you won't get any new abilities. As I said, the game is okay, its colorful, it cheers you up when playing it, but it is not what steam promises you.  The game itself is, as i said, a mix between puzzling, running around, minigames and collecting stuff (a lot of stuff). If you're into that, you'll be just fine, but if you hate spending too much time running back and forth while collecting items that add absolutely nothing to the game, then you'd might regret buying this.   The Graphics are pretty good, but I was told to have low standarts. The Characters are lovely designed and you can feel that the developers really cared about every single friend or foe you face throughout the game. However, the story is rather basic. I don't want to spoil anything, so just let me say this: The story feels like a weak version of another game (if you know what i mean.. you probably don't.) There's just not much depth in the story, you spend way too less time with the characters to really get into it. When I first saw the game i kind of expected a heavy story, so i was a little disappointed. But again, not every story has to be deep.  The gameplay is very repetitive, but this does not matter that much because the game is rather short. Just let me tell you, the 'quests' you get sound all the same, you have 3 items you can use and every 'battle' is exactly like the one you fought before.   Overall Lili; Child of Geos is a game to play when you don't want to start a biiiig, looong game with a deep story. Its a game you choose to play when you have little time but still want to enjoy a good game. I personally give it a thumbs down because it is a fine little game, but nothing like you'd expect after reading the description.",
            "review_score": "-1"
        },
        {
            "review_text": "Five Word Review: Cute but it's lacking substance. Favorite Thing: Walking into the creepy camera guy's hut and seeing all those pictures.  + Cutsie graphics and main character.  - Had potential but in need of some serious filling out. - Lots of repetitive tasks. - Lots of broken achievements.  Playtime: ~ 3h Enjoyment: 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Loved this on iPad when it was new and thought id get it for my pc since it talked about expanded content. well it runs like terribly. not my PC's fault either, this runs Witcher 3 in 2k on ultra with mods to enhance the graphics a bit more and yet it cant run Lili at more than like 15 fps. if not for that id probably still love this game but it just does not run well",
            "review_score": "-1"
        },
        {
            "review_text": "Anyone who recommends this game to Zelda fans should be told to shut up and play a Zelda game. Pretty graphics and interesting NPCs with witty dialog does not a Zelda make.  It's not even a matter of lack of combat. Anyone praising or bashing this game for that are off the mark. The nature of this game is aimed towards the casual player. Recommend it to someone who doesn't typically play games. They'll appreciate the overall experience despite the shallow gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "It is hard not to like this game simply due to its strong sense of personality, sadly while it has style in abundance the variety of content is simply not there. There is a bit of a plot here but ultimately the desire to return to the game isn't strong enough and the reply value is almost zero.  This brings me to the issue of, 'Should I recommend this game to others?'  That is really a very conditional thing because there is money involved.   Had this been a F2P game then I would wholeheartedly recommend it due to the fact that, in short sessions, the game is really very enjoyable and is a pleasure to look at. The visuals and style of the game just scream quality from the rooftops and there is enough tongue-in-cheek humour here to put a smile on even the most cynical of faces. If you enjoy games you will come across such a large number of references to other titles it is almost wrong to call them Easter Eggs since the game is saturated with them rather than having them hidden away. The developers clearly love Legend of Zelda and other Nintendo games because they not only attempted to create an Nintendo-esque art style but they also added music to the game which is clearly inspired by games such as Wind Waker. They achieved that goal with such success that you could drop Mario or Link into the game world and they'd look perfectly at home.  Unfortunately when it comes to paying money for this and wanting value for money from your purchase, Child of Geos has very little to offer. It reminds me of something that would work well as a casual game for a rainy afternoon but nothing more, as such I wouldn't recommend this game unless it was on sale for maybe £2-3 at most.  What the developers have created here is really something which deserves a sequel though, while they missed the mark on gameplay they have set a new benchmark for style and quality for the visuals, music and presentation for an indie game. I sincerely hope that this isn't the last we'll see of Lili.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even start playing!!! I WANT MY MONEY BACK",
            "review_score": "-1"
        },
        {
            "review_text": "This game just wasn't to my likeing. Sorrey",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay (I'd say kids between 6 and 12 are the target audience) is not on par with the gorgeous visuals. Make something more mature (or even a real Zelda clone), and I'm in.",
            "review_score": "-1"
        }
    ]
}