{
    "app_id": 266840,
    "name": "Age of Mythology: Extended Edition",
    "release_date": "2014-05-08",
    "developer": [
        "SkyBox Labs",
        "Ensemble Studios"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Mythology"
    ],
    "achievements": 70,
    "positive_ratings": 9336,
    "negative_ratings": 1577,
    "price": 22.99,
    "description": "Age of Mythology is back! Choose your god and take to the battlefield in this classic, upgraded with full Steamworks integration and enhanced features.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/266840/header.jpg?t=1447359611",
    "minimum_requirements": "OS: Windows Vista, 7, 8.1+ Processor: 1.6 Ghz Memory: 1 GB RAM Graphics: Direct X 10+ Capable GPU DirectX: Version 10 Storage: 3 GB available space Sound Card: Direct X Compatible Sound Card Additional Notes: GPU at least (Integrated HD 3000, 8600GT, etc)",
    "recommended_requirements": "OS: Windows 7, 8.1+ Processor: 2.6 Ghz Memory: 4 GB RAM Graphics: Direct X 11+ DirectX: Version 11 Storage: 5 GB available space Additional Notes: GeForce 9800GTX, Radeon 4850+",
    "reviews": [
        {
            "review_text": "Age of Mythology is the classic, mythology based spinoff of Age of Empires, and boy was it fun. But does Age of Mythology Extended Edition live up to the original? In many ways, very much so, though the price tag might dissaude you unless you're a huge fan, (like I am).   If you've played Age of Mythology before, you know exactly how this game works. If not, here a basic gist of it. It plays much like Age of Empires 2; you have to collect resources, specifically food, wood and gold, in order to fund your armies, economies, technologies and advancement. sounds basic enough, and all the races work similarly in regards to these resources. The difference comes in the fourth resource: Favour. Favour is generated differently depending on which race you are playing. For instance, the greeks generate favour through worship, the egyptians through building monuments, the norse through heroes and fighting, and the atlanteans through having more settlements.   Favour is the special resource, which ties into the major mechanic of Age of Mythology: Gods and God Powers. There are 12 major gods, 3 for each of the races, and these determine starting bonuses for you when you start the game. the gods also have minor gods to choose each time you advance an age, with a total of 36 minor gods, each offering different bonuses and god powers. For instance Hades gives you the Sentinel God Power, that creates stone sentinels to watch over your town centre, but in the second age, you can choose Athena, who allows you to train minotaurs and the Restoration God power which can heal your units.  Aside from the new favour mechanic, for the major part it plays like the age of empires games. Build Army, upgrade, and take care of your population cap and economy. Rock paper scissors, for basic units, (cavalry beats archers who beat infantry), but add heroes and myth units which can turn the tide of battle. Both the singleplayer and multiplayer are fun, and with the new release, there is a rebirth in the multiplayer, though not as big as the heyday of AoM.   As being essentially a remake (a la Age of Empires 2 HD Edition), AoM:EE is actually fairly bug free, and while it definitely shows its age, the added subtle lighting effects, water and shadows do help to make look better. It is definitely very playable, and for fans of the original, it shouldn't even be a bother.  The campaign is just as memeroable as always, a hunt through Greece, Egypt, Scandinavia and finally Atlantis in order to stop a power hungry cyclops from releasing Kronos, King of the Titans; followed by A New Atlantis, set a number of years later,    where you are tricked into releasing the Titans, and must stop them at all costs   .   Overall, Age of Mythology: Extended Editon is fun, unique and offers up plenty of value, with 50 singleplayer missions, skrimishes, and now revived multiplayer, though for those who still have a copy of Age of Mythology and The Titans expansion, it might not add a great deal. Definitely recommend everyone else (who's a fan of older RTSes).  ",
            "review_score": "1"
        },
        {
            "review_text": "My childhood has finally arrived on Steam. 10/10 Pegasus carries my dreams tonight for only 50 food and 2 favor.",
            "review_score": "1"
        },
        {
            "review_text": "At launch, the game was completely unplayable - huge frame lag and crashes on my i5 2500k and 6950. After the hotfix, it continues to get horrible frame lag and crashes after a few minutes.   The price tag is very steep on an old game (no matter how good that was in the first place), the updates are extremely minor and the game has been extremely poorly optimised.",
            "review_score": "-1"
        },
        {
            "review_text": "To like or to Dislike that is the question. For as much as I love the actual game, I have reservations about the fact that it was 'remastered'. If you are going to redo a game do it properly and completely overhaul the graphics from the ground up. atm it's worst then the original. I did notice a few bugs in cut scenes where the would repeat words(might just be the voices in my head). I would rant on more but I'm lazy and Belive others will have better things to say. I'm going to give this a thumbs down because I don't feel it was worth $25 i spent on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Age of Mythology: Extended Edition as a real-time strategy game published by Microsoft. It is a perfected version of the old game Age of Mythology and Age of Mythology: The Titans.  Age of Mythology: Extended Edition gameplay are pretty much the same as the old Age of Mythology and Age of Mythology: The Titans made into one game. In addition, the Golden Gift add on are also included in this remake. Unlike Age of Empires II: HD Edition, Age of Mythology: Extended Edition doesn't have population cap increase, everything in the gameplay stays the same. It's quite nostalgic to replay this old game with improved graphics, I remember almost all the god powers I used, the meteor rain, tornado, earthquake and more. Age of Mythology: Extended Edition also comes with Steam Cloud support and Steam Workshop support, which is a great addition into the game.  Age of Mythology: Extended Edition however, have improved graphics than the old game. New improved global lightning, widescreen support, new water shaders and the new day and night cycle in skirmish play. It looks prettier now and more epic to play. With all these improved visuals, Age of Mythology: Extended Edition still retain its great performances and runs very great and smooth.  Age of Mythology: Extended Edition exact same gameplay can be its good side or bad side for some people. But for me, it's very nostalgic and fun. I prefer this kind exact same gameplay rather than some of those next generation game with many promises which turn out to be a disappointment. Age of Mythology: Extended Edition is indeed a great remake. I recommend this.  Rating 9/10",
            "review_score": "1"
        },
        {
            "review_text": "First i'd like to say that i really enjoy the game.   But there are way too much bugs introduced (and kept) by the extended edition so the main part of my review while be about them.  BUGS: There may be less serious ones like a magical box appearing with the letters  'Message Text goes here' .   And there are more annoying ones like reset of settings on start (i posted a fix in the support forum - the thread was only over a year old).   And there are real ♥♥♥♥♥ ♥♥♥♥♥♥♥ bugs like the memory bug (full crash of game) which appears to exist since years. (extended edition didnt fix it ofc).   Another Bug in the Tutorial - meaning i had to restart the mission.  And right into the next one one while playing one of the first 3 Missions - having to restart the mission again too.   Lets not forget the horrendus performance - even with all graphic features disabled the game needs way too much power for being this old.   On the pro-side we got a twitch integration now. *insert sarcastic YAY here*   Also while all the bugs are still there since years a new expansion pack is announced....   So while i leave a negative review here - i can really recommend this game for old times sake if it is going cheap in the sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Age of Mythology: Extended Edition is a good example of a poorly made cash grab. The Extended tag probably means the new bugs Skybox Labs managed to produce, that didn't exist in the original.  The AI pathfinding is messed up. Units often phase/clip through the walls and villagers often get stuck in larger buildings (Temple, Wonder, Titan Gate) they have finished building.  The changes to the graphics are highly questionable. The new textures are washed out and blurry, so it's highly recommended to revert them to something that looks closer to the original (EG: Epic textures mod). Otherwise you will have a hard time finding your units, as they blend into the environment too well.   Last but not least the netcode. Oh, boy! If you thought Age of Empires 2 HD's netcode was bad, then you have no idea what this game has in store for you. The online matches are insane lagfests, often freezing up for seconds, rendering the game unplayable.  Bottom line is that this version of the game is a mess. Skip it, you're not missing out much!",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game on 12/22/2016. After reading the numerous reviews about how I should not buy this game and play aom on voobly instead, I decided to go ahead and buy it anyway since I love aom (1800 rr back in 07' ;) ). I suppose I just was not satisfied because the reviews did not actually go into detail about anything that I thought was important. I am going to do my best, though, to give you the details of how terribly disappointing this game has been for me for the past couple days, even though I don't tend to give bad reviews because I don't like hurting other people's businesses, However, I consider this game a scam.I'm going to start with the China campaign, since that's where I started. The first issue arose when I restarted the first scenario, since I was kinda screwing around with looking at the new units and the AI got ahead of me. When I restarted, I was astonished to find that I was in the Archaic Age, rather than the Classical Age, like I had been in the game before. In addition, once I collected 400 food and built my first temple, I could not even advance to the Classical Age. Therefore, I was stuck trying to fight the AI with immortals from my town center, which was basically impossible once they started sending in human units. I restarted again and again, but could not resolve the issue. I decided to finally restart the whole game and wait out the cinematic all the way through again, and I finally got the game to start in the Classical Age. I can't say for sure that this bug exists within the game or if there is an issue with my computer. However, I reinstalled a fresh version of windows 8.1 about a week ago and there's basically nothing on my computer, so if it's a problem with my computer, then that's really a problem with poor compatability caused by the developers. The other possibility is it could be an issue caused by the Ekanta user interface mod that I dowloaded for, and I actually haven't tested that yet. However, Ekanta is a popular UI and I would be surprised if no one figured that out yet. After beating the first and the second scenarios, I got to the third, when I discovered that I once again could not advance to the classical age, despite having a temple and 400 food. I thought that this possibly could be like the original AOM campaign, which don't let you advance (although the option doesn't even show up for those), but was once again flooded by human units and forced to fight with the only unit I could make, which were immortals from my town center. This time I restarted and restarted and no matter what could not begin in whatever age i was supposed to, or resolve whatever the issue was this time. However, i couldn't advance, and did the only thing I could which was build my TC and either THRILL OF VICTORY, or spam O CANADA bears (recommend the O CANADA's if you run into this issue). I can't remember the order of the campaign past this because I just wanted to get it over with. Another one of the scenarios (there are only like 9 of these but they are almost all terrible) has you fight off an army. This time, when I restarted I discovered that my troops went from having heavy upgrades to having no upgrades. This bug has an easy fix, though, If you just restart and wait for part of the cinematic to finish before skipping; then your troops will once again be heavily armored. The final bug with the campaign that I ran into so far was once again that I could not age on another scenario, this time after building an armory since I actually started in the Classical Age. I was eventually able to beat the AI's champion, fully upgraded units with my clasical units after mixing in some monkey king myth units. So that ends most of what I want to say about the campaign. The final issue I want to bring up comes from watching a streamer play as thor against a chinese player in a 1v1. Once he got to the mythic age, he discovered that he mentioned that he had no units that could counter cataphract, which are Chinese counter-infantry cavalry, without also being countered by the cataphract themselves. Norse does not have an archer or a cavalry unit which counters cavalry, which would be the only two options, unless using myth units. Thanks for reading and please don't buy this game!",
            "review_score": "-1"
        },
        {
            "review_text": "Really liked this game till the DLC came out and broke the game. If you don't buy the DLC you can't play random maps. I have been putting off this review for many months now, hoping the company would right it's wrong but it seems they just dont give a ♥♥♥♥. I buy DLC for games that I enjoy and want to experience more from, not companies that give you no ♥♥♥♥ing choice. We had something good going and you just ruined our relationship you greedy ♥♥♥♥♥♥♥s! Moving on to companies that don't suck.",
            "review_score": "-1"
        },
        {
            "review_text": "AoM is very similar in the way that it plays compared to Age of Empire, and that's not a bad thing either since it plays very very well.  There is a huge amount of content available which will keep anyone entertained for probably ~100 hours, if not more. I have managed to power through the campaign in about seven hours, partly because I played this game to death when I was younger.  I haven't tried the multi-player out, and I suspect it will now be even more polished than before. This is a really strategy gamer's dream. Go out and buy Age of Mythology, you will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "This is the Extended Edition. By extended, They mean, take a 15 year old game that worked perfectly before, somehow make it looks worse, and make it completely unplayable on anything but a supercomputer.  Kudos devs.",
            "review_score": "-1"
        },
        {
            "review_text": "Flushing $30 would be more productive then spending money on this terrible remake of a great game. Super laggy and absolutely no support for bug fixes. Examples of horrendous code: One game started with a teammate that had a pond in place of where his town center should have been and therefore he started the game defeated! Another time I was playing 1 vs 1 against the AI and after the game I saw that my opponent was only given 1 town center compared to my 3! Several other times the AI has been known to do nothing after 2-3 minutes into the game as if they forget how to gain resources and advance ages. I also have a problem where my mouse cursor thinks it is on my desktop when hovering over portions of a map which makes the game unplayable. I can fix that error by using Alt-Enter twice to go to window-mode and back again. However, if I repeat this process again (due to the error recurring), the entire game crashes... The sad part is many people would play this game if any effort was made to correct these errors.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a new update, 'The Age Of Desynching - Crashing Edition'!!!!!   You've managed to ruin a great game with this DLC junk! If filling this game with bugs and crashes was your goal then you've had a great success! (Pat yourself on the back) Played this game for hours on end (223.9hrs) without problems, since the DLC junk arrived I can't manage to finish one game without a crash! Congrats! Would you please refund my money since you've ruined the game?",
            "review_score": "-1"
        },
        {
            "review_text": "Age of Empires with monsters; what more can you want?",
            "review_score": "1"
        },
        {
            "review_text": "This game still got it!   But the priceing is terrible , it's not worth 28€. I bought it during the summer sale when it was roughly 17€ and I still think it's quite overpriced. It's not a timeless classic like AOE and the upgrades done to it does not justify such a high price. The only thing that really adds to the gameplay is the possibillity to unlock the camera and zoom further out that you could before.",
            "review_score": "1"
        },
        {
            "review_text": "Summon a titan and win the game simulator 2015.  Liked the original? Get this one. It has workshop integration for mods, textures and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "*edit as of 9/25/2016 nothing has changed other than the addition of a dlc. I would recommend this game, if it would work at all!!! I had it on for over 6 months then the update happened and then poof no more worky. Fix this and ill adjust my ratingfor this game... Discard my demands and youll forever be banished to the land of no trees, no fishing, no bushes, no gold mines and constant attacks from a massive amount of myth creatures. In other words Greenland.",
            "review_score": "-1"
        },
        {
            "review_text": "I've always loved this game. When I found out it was on steam I knew that I was going to to get it immediatly. I heavily recommend for anyone who enjoys RTS game or the AOE franchise to play this game.  However be wary that this game has many faults, the multiplayer is regarded by many to be the worst that steam has to offer, and has many, many bugs and glitches.  If you already own a physical copy that still works or use Windows 10 it's not worth the large cost to upgrade.  The graphical enhacement and 'Extended features' are not anything to write home about, the graphics are formidable but are still lacking in comparrison to other games out on the steam store, the workshop intergration is a nice addition for those (Including me) who could not download mods off of the internet.  This game is still amazing, and the story is amazing, the linking of all of these mythological characters was executed very well. Story: 8/10, I love it's creativity but it does rely heavily on clichés and plot holes. Gameplay: 7/10, Plays like all RTS with little veriation other than myth units and heroes. Online: 4/10, Terrible multiplayer, with the little veriety AOM had to begin with, mixed with the laggy and sometimes unplayable multiplayer it gets worse. Graphics: 6/10, Amazing compared to the original version however as I said before, they are not the best.  Overall score: 7/10, Great game but bad multiplayer that damages the steam intergration. If you enjoy RTS. this game is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "I spent thirty dollars on this when I knew it would be on sale at some recent point in time. That is how good this game is.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when it first came out years ago. The campaign is great and if you are a fan you will love it. My main calling to buying this game was the supporting of online play. I am so very disapointed that steam and skybox have not fixed the online environment. It is sad that a game was more reliable a decade ago online that it is today with all the advancements. Until the online gameplay is smoothed and polished I cannot recommend this game to anyone. Please for the love of Gaia do this beautiful game justice and smooth out the online kinks.",
            "review_score": "-1"
        },
        {
            "review_text": "This game just went downhill after the release of the dlc as it constantly lagged. Those who didn't have it couldn't play as it was an automatic win for those with it once a certain troop comes into play after which i requested a refund for the dlc. You're unable to fully enjoy the game as they force you to have that dlc and even then it's been horrible. Hardly any players on anymore! I wouldn't recommend it to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "The DLC ruined the entire game it cant even operate anymore",
            "review_score": "-1"
        },
        {
            "review_text": "If you're wanting to play LAN games, don't buy this version, get the original from somewhere else. This version is very buggy for LAN games, and has terrible, terrible lag, random desyncs (player drops), and is very buggy when trying to save the game and resume at a later time. You'll not get to finish 1/3 of the games you start due to these bugs. We also encountered game corruption, where multiple players will experience severe graphics glitches making the game unplayable. Saving &amp; resuming did not resolve this, it kept spreading &amp; getting worse. The original game (and titans expansion) was rock solid, so if you can get your hands on that instead of this game, you will avoid much disappointment and headaches. I got it during the summer sale so it's worth the money I paid, and still a good game, but that is in spite of the horrible problems they've added to it with this 'Extended' edition. Oh, and they've paywalled the 'giant' sized maps, so you'll have to get the dragon DLC to play that map size.",
            "review_score": "-1"
        },
        {
            "review_text": "I think the devs made a mistake in emphasizing the shiny new graphics and features, because yes, they look stunning compared to the older version, but unfortunately I believe many people have gotten the impression that that's the only thing they're getting for their thirty bucks.  I would honestly buy this game on steam without any additions for the same price. The better graphics can disappear for all I care, because what this re-release truly means is the return of multiplayer, a bigger, more active community, and devs that actually listen and actively improve the game. In my opinion,  that  is what I am buying, and I am not disappointed with the results.   I would definitely recommend this to anyone whether old or new, to relive the experience or see it for the first time. :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much what everyone else said. It is sad that steam does nothing about this. The fact that there is a game for sale that does not work and is basically stealing peoples money is beyond wrong and we should all get our money back. Do not buy. Also I will alwasy read reviews now before I buy. Steam is not as honest an orginization as I once thought. Sdaly they are still my prefered way to game above Microsoft and Sony.",
            "review_score": "-1"
        },
        {
            "review_text": "I rarely ever write a review but this just made me write one :/ First of all I seem to be one of those who don't experience any issues be it framedrop, crashing or other stuff. BUT what I read in the reviews and the forum, before it was deleted by the devs.... yes you heard right, is just awful! It seems like those 'developers' just made a lazy half ♥♥♥♥♥ product with little to no optimization. I read of crashes when launching the game since the DLC is out, Multiplayer is laggy since teh release of the base game, random desyncs in MP and the list goes on to save files beeing corrupted and crashes when starting a SP game. Also the AI seems to be even worse from what I've heard. If I haven't already played 5 hours I would get a refund just so the devs didn't get my money (even though the game is working fine for me) Now to the fun thing. They recently deleted the Steam Forum. But after the ♥♥♥♥♥torm they got and about 90% of the threads are about crashing we have to assume that those amateurs can't even take responsibility for their product they just threw out despite it beeing very buggy. The Dev's are the worst. I like the idea of remaking an RTS classic in an age where this genre seems to die out or at least lose a lot of popularity, but if they can't even make it work and even make it worse with the new DLC they shouldn't have done it from the beginning.  That beeing said. Don't buy it. You have no reason to do so. If you actually like the devs screw you, they are just as lazy as early acess devs which just quit their game.  If you actually read all this, I hope I could help you. Just buy the original game and not the Extended edition, it runs better has no bugs.  EDIT: The Forum wasn't deleted sorry for writing that it was only out of business for some time EDIT EDIT: The game stopped working for me. Can't start it. I tried every 'solution' and nothing works. I don't know what changed but I would suggest to not turn off your computer or update any program if you get this game to work. Turning off my PC broke it for me. ♥♥♥ these devs. I am out.",
            "review_score": "-1"
        },
        {
            "review_text": "Summary - The Chinese expansion is rushed, copy-pasted from existing things, and glitchy. The people who profit from this are not the ones who made the original Age of Mythology.  Icons for Chinese buildings are re-used existing ones.  Chinese god powers and soldiers are like copies of existing ones, just changed a little bit. For example, the chinese monk is the egyptian priest with a different model, texture, icon and description, and instead of converting animals he converts enemies. He waves his arms and makes the exact same chant, and the cursor turns into an Egyprian Ankh when you mouse-over enemies.  Incorrect descriptions - The two Chinese heroes we start with are given Arkantos's description of special powers.  Poor story-telling - Unlike the original campaign, the beginning of the Chinese campaign has very little story-telling. You are not introduced to the gods, and you just start already in the second age. We only have a brief introduction to the heroes. At the beginning of the campaign... /(SPOILER)\\ The heroes have to travel across China because when they realise there's evil afoot, a random peasant tells them to cross china, and so they do with no questions asked. \\(SPOILER)/  Graphic glitches on my new-ish computer - You can see flames if the ground is behind them, but not if the sky if behind them. When placing walls. the wall segment that is behind another is drawn in front of what is actually in front of it.  Glitched first scenario in the Chinese campaign - You start in the Second age, but if you restart you are in the first age.  It runs slowly.  You can drag a box to select four soldiers and it will tell you you've selected only two, or the 'bamboo tree' nearby.  My fortified wall upgraded to an earthen wall.  I got a steam card of Thor with a really bad picture on it, with the description 'The Norse god of lightning'. Thor is the god of thunder, not lightning. Loki is the god of lightning.  This is my review after only getting to the second scenario in the Chinese campaign, because waiting to finish it to write the review would make it too late for the review to be helpful, because it's only just been released. Perhaps it's not their fault that the Chinese are so similar to the other ones, because there are only so many possibilities, and the three original races have already taken a share of the possibilities, but the lacking story-telling and the obviously reused artwork and code make it seem like the people who made it rushed it, or did not enjoy maknig it, or something like that. If it was released as a free mod then it would probably be well recieved, but it's been named an official expansion.",
            "review_score": "-1"
        },
        {
            "review_text": "The original, being a game i've played since I was only 4, has been, and always will be, my favorite game. That being said, this version (Age of Mythology: Extended Edition) has become a close second. The flow of the game feels the same as it did over a decade ago with a few minor touch-ups and improvements. I'll admit it, the graphical overhaul wasn't as 'stunning' as i'd hoped it would have been, but, it leaves you with the nostalgic feeling of playing a childhood game once again. I've put thousands of hours into the original version, hundreds into the titans expansion, now, it's time to do the same on the extended! If you're new to Age of Mythology, or god-type games in general, but you really like strategy games, dive into this RTS and sink your teeth in. I guarentee you'll get a mouthfull!",
            "review_score": "1"
        },
        {
            "review_text": "A huge fan over here . DO NOT BUY IT . A waste of time and money . They made an awful remake(lag,crashes) . The best part on this, is that you can play the mutliplayer gamemode . WRONG YOU CANT . Have a nice day.",
            "review_score": "-1"
        },
        {
            "review_text": "Age of Mythology: Extended Edition is a fun RTS game that allows you to play as different ancient gods and use their different abilities to wipe out your enemies. If you're a super competitive gamer and love trying a bunch of various strategies I would totally recommend this game, this is for you. I haven't played the other Age of Mythology games, so I can't say how accurate this one is, however this was recommended to me by a friend who says it's very accurate. Take that as a third party source, though. This is by no means a bad game, and it excels in what it does. It provides a challenging RTS experience that you can enjoy with friends or on your own. The problem for me comes from the game being a tad too competitive. This might not be a problem for you, and it might actually be a good thing. If that's the case you should get this game, probably when it's on sale. If you share the same opinion as me in this area in that you would rather spend your time goofing off than strategising and micromanaging resources, I would say no, you'd be better off spending your money on something else. That's just me, and I understand a lot of people feel otherwise, but for people like me I have to say no, I don't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, but there are still improvements to be made. Not really worth a $30 price, but it is a classic. Also, the developers still haven't fixed the desyncing errors which crash the majority of my multiplayer games. Its freaking annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "While for most re-releases, the publishers at least went through the trouble of giving the games a marginal graphical update, this is not the case for AoM. The Extended Edition looks 1-to-1 exactly the same as the original. Everything uses textures that look like we are still playing on 640x480 screens instead of 3840x2160. In fact, despite the 3D graphics of this game, the HD version of Age of Empires II looks vastly superior. This is shameless money grab with no work done whatsoever.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game ever, defined my childhood.",
            "review_score": "1"
        },
        {
            "review_text": "nostalgy. colorful and exciting. for old school players :)",
            "review_score": "1"
        },
        {
            "review_text": "Broken with last update. Dont buy.",
            "review_score": "-1"
        },
        {
            "review_text": "online is empty as f... not worth the money for campaign ",
            "review_score": "-1"
        },
        {
            "review_text": "So after a year or so of waiting for this game to be fixed of all the bugs. I still run into the same issue which makes this game literally unplayable for me. I cannot move my units once they engage in attacking. Everyone knows when you play an rts, retreating from a minor skirmish or harrassing civs is important and you will need to retreat and fight again another day.  I can't believe I bought this broken garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "If you try to play random map you will recive erorr measage:  'These units are inaccessible unless you have the DLC enabled:'",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Matchmaking system ever.  it takes forever to setup a 'quick' match as they call it. and if you want a 2v2 that forever is prolonged with another eternity! when there is more than 150 people doing online on a server, the delay is massive. and by that i mean, the loading of the hosted games, it takes a few minutes to see the gamelist.  3 out of 5 games crash with 'sync error'   Me and a couple of other friends bought this game because we wanted a better alternative than gameranger. sadly we were mislead.  if you enjoy killing the stupid CPU over and over,. buy it, great game, if you want to buy for the online experience. then stay away, trust me, you wont enjoy one bit.",
            "review_score": "-1"
        },
        {
            "review_text": "Looking for a jump to the past? Here is that jump, glad I bought it on sale also.",
            "review_score": "1"
        },
        {
            "review_text": "  Masterpiece.   Age of Mythology was the first game I ever played seriously. The interesting and diverse gameplay, the deceptively complex game mechanics, and the lovely graphics for the era all make for a game that is thrilling and incredibly fun to play.  This game has a certain charm about it; perhaps because of my experiences playing this game. The graphics may not be those of  Fallout 4 ,  The Witcher , or other such Triple-A Titles, but the gamemplay more than makes up for this.  A lot of  Age of Mythology's  fun and diverse gameplay comes from its roster of incredibly diverse pantheons, and within those different gods that have different specialties. No two matches are the same, and playing with friends is incredibly fun.  Overall,  Age of Mythology  was a major part of my childhood and I enjoy it to death. I could not recommend this game more, and it holds a special place in my heart.",
            "review_score": "1"
        },
        {
            "review_text": "Do not purchase this 'Extended Edition' if you love AoM and you want to play it again.",
            "review_score": "-1"
        },
        {
            "review_text": "its a great game but it has a game breaking glitch that makes your screen flash between the game and desktop every 5 seconds and its unplayable",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game when it was first released and loved it. I think this was the game that got me into playing RTS's. Played lots of different ones over the years but this one has always remained a favourite. I often hoped (and still do) that AOM 2 might be in the making. So i was over the moon when i saw this was going to be re-released.....a chance for the Phoenix to rise from the ashes once again and burn my enemies to the ground.  If you haven't played this before don't expect an amazing graphical experience. The graphics have been improved, the sound aswell.....but the reason to play this is for the enjoyment. Its simple to pick up and play. However, experienced RTS gamers who haven't yet tried it, might find it too basic.  Still, it's a classic and deserves a place in the RTS hall of fame.  LAZER CROCS FTW",
            "review_score": "1"
        },
        {
            "review_text": "Got kicked from a singleplayer game cause the ai was a assigned a dlc race, top kek",
            "review_score": "-1"
        },
        {
            "review_text": "Buy the old game off amazon or ebay or something, don't buy this version. It's got all kinds of new and exciting bugs if you like that though.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is my childhood... Best Game Ever.",
            "review_score": "1"
        },
        {
            "review_text": "Love strategy games. Love that this one added mythology.",
            "review_score": "1"
        },
        {
            "review_text": "This game is my childhood. It has aged so well, and is a marvelous RTS that stands tall among many other dumbed down RTS games of this century.  It stood the test of time, and remains just as beautiful and intricate in meta as it was in the past.  This is truly a remastered title.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game,just that :P",
            "review_score": "1"
        },
        {
            "review_text": "This game is a gem, and I'm glad they dusted it off and polished it for the modern era! Despite a couple of teething troubles (such as the in-game encyclopedia vanishing,) this is still a very solid, very enjoyable experience. BAWK BAWK BOOM!",
            "review_score": "1"
        },
        {
            "review_text": "Ive been playing AOM since it was released for the first time. I love this game, and I played this all the time. If you are a fan of AOM, I dont see why you dont get it. Price is alil high but I would have paid any price really for it because i couldnt play my disc anymore and the amount of hours i played I got my moneys worth. If you arent a fan but are interested. I would say wait the the price drop, or watch some videos on the gameplay. If you like them, then get it. Enjoy",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when I was younger, it was always one of my favorite RTSs. So many fond memories, haha. I'm thrilled that theres an HD remake now! When the age of empires HD version came out, I had my fingers crossed that AoM would soon follow.... :D",
            "review_score": "1"
        },
        {
            "review_text": "Game looks better and any glitches I've known in the old game are fixed. Bought the 4 pack with my friends when it was on sale and we only spent $13.50 each. Totally worth it! Great classic game",
            "review_score": "1"
        },
        {
            "review_text": "One of the very first games I ever played on PC back in the day. I am so thrilled they revamped it a bit. You will be amazed! It is a blast from the past and I couldn't be happier!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Maybe once upon a time this game would have been fun, but now not so much. I played some of the campaign and a lot of the sandbox/custom game setup. If you are playing 'conquest' mode, then it devolves to a zergfest to see who can crank out the most units and overwhelm the other. If you are playing in other modes, the IA isn't much of a challeng until you have it on the 3rd or 4th setting and then it become overwhelming.  Ultimately the biggest drawback is that there is no autosave. The game crashes (I'm running Win10), often only an hour or so after you've been playing and it is too easy to slip out of the habit of manually saving your game every so often. You lose a lot of progress and getting back to where you were is disheartening.",
            "review_score": "-1"
        },
        {
            "review_text": "Ive been playing AOM since it was released for the first time. I love this game, and I played this all the time. If you are a fan of AOM, I dont see why you dont get it. Price is alil high but I would have paid any price really for it because i couldnt play my disc anymore and the amount of hours i played I got my moneys worth. If you arent a fan but are interested. I would say wait the the price drop, or watch some videos on the gameplay. If you like them, then get it. Enjoy",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer desyncs all the time, only get it if you feel like playing the campaign.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably my favorite game in the last 10 years. I played it when I was younger and even though I suck it's still so much fun. Gorgeous scenery, awesome comabt, feel like a god. Not to mention the fun maps that people make for this game which are like different game modes.  IT'S AN AWESOME GAME AND IT NEEDS MORE PEOPLE PLAYING IT. Buy today plz",
            "review_score": "1"
        },
        {
            "review_text": "Played AOM alot when it first came out. This version doesnt differ much from that game, but its still nice to be able to play it again through steam. It does look at bit better now. Playing online however sucks. When you are not playing LAN, the game lags immensly. Hope they will patch it soon. Dont recommend it when you are planning to play it with friends. The game works fine single player though ",
            "review_score": "1"
        },
        {
            "review_text": "NEW GRAPHICS SUCK A LOT OF D! K. PLEASE MAKE IT RIGHT.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a amzing game and it works perfectly besides the mods not working correctly and no haddicap it works butiffuly",
            "review_score": "1"
        },
        {
            "review_text": "Well it's all about reliving the nostalgia  Not many changes but addition of Chinese mythology and a few units to old ones Addition of amphibious myth units is what I found to be most exciting  While AI is still lack buster  Online play is average with a few bugs here and there But overall it's a great experience  Recommend it all who love RTS games ",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game since 2005 and it was nice to finally play this game again with new textures. Of course there are also a few things that were added. Steam Workshop is one of them and it makes downloading mods much easier. Twitch was also built into the game to make live streaming the game easier. Day and night was also added to give a realistic feel to the game when playing on a map for a long time.   The graphics on the game are good along with a few other things but I found a few things to be a bit too polished. Overall I found Age of Mythology EX to be a great game if you are into RTS games and enjoy a good story line.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, though I don't think has been revised enough to deserve the 'Extended' name. At least give us some new units or race please.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a piece of ♥♥♥♥. I thought that it would be an amazing way to get people to play the amazing game that the original AOM was. This is terrible, the game looks worse than the original did, the online is a fps dropfest and it's laggy as hell. Do not waste your money on this garbage!",
            "review_score": "-1"
        },
        {
            "review_text": "This game was incredible when it first came out. The remake has done a great job in updating the game and bringing it back for old fans and new comers alike. If you were a fan of any of the 'age of' games, or like RTS, or just looking for something to try, pick this game up.  The different sides all play differently, god powers add a new layer of strategy and the mythical setting is different to what you normally see and interesting.  The campaign has a great story, the skirmish and multiplayer are a lot of fun and this is a game that will keep you busy for a long time to come. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it was great but when the DLC got released it created a bug which made the game unplayable. only a yes because it was great game till the update.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game, very nostalgic to play.  The graphics have been entirely revamped, and it looks fresh and new. However, even at max settings, some of the textures are extremely dodgy. The game also seems to take up quite a lot of processing power compared to other games. However, this is only a minor detail, and I feel that the gameplay (especially with friends) more than makes up for this.  Overall, extremely solid game, with a few minor bugs 9/10  P.S: Windows XP IS NOT SUPPORTED.",
            "review_score": "1"
        },
        {
            "review_text": "I decided to get this awesome RTS for 75% off. I had the original disc but lost it, this game is by far one of the good RTS out there, and I'm not talking out of nostalgia.  Many Windows 10 players said the game doesn't work for them so when I downloaded it I was excpecting black screen and crashes and all the horror but to my surprise the game worked prefectly! Just had a game and boy this game still rocks after 13 years!",
            "review_score": "1"
        },
        {
            "review_text": "sweet game. god powers. so much custom maps,multiplayer and offline you can do. wasted a lot of time on this game. 10 out of ♥♥♥♥ing 10",
            "review_score": "1"
        },
        {
            "review_text": "sweet game. god powers. so much custom maps,multiplayer and offline you can do. wasted a lot of time on this game. 10 out of ♥♥♥♥ing 10",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia so good, the servers are bad, but for local or solo play its fun",
            "review_score": "1"
        },
        {
            "review_text": "A simplified AOE with supprisingly addictive dynamics.",
            "review_score": "1"
        },
        {
            "review_text": "the game still dosnt launch don't buy this one. 2 and three work thou",
            "review_score": "-1"
        },
        {
            "review_text": "A great game that is back....unfortunately, playing multiplayer can be laggy...wish the developers could do something about it =/",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my all time favorite RTS games, it's up there with other timeless classics like C&amp;C Red Alert 2 and StarCraft. It's basically Age of Empires in 3D and with monsters and god powers.  When it comes to the Extended Edition, I like how they updated the visuals without changing too much, because of this, most mods for the original game work with this version. (Mods which replace rextures are not compatible and need to be converted, which is a pain.)  One thing I don't like about the new effects and graphics is that you can't turn them off, which will make some older, less powerful systems that could run the original (like my laptop) struggle to run this version.  Obviously this version comes with The Titans expansion and The Golden Gift mini campaign, which is great.  Final note: As great as this game is, it's a little dated and is a little expensive for an old game. If it goes on sale for under 20$, that would a good time to buy it. That said, there aren't that many RTS games coming out these days and it might be worth paying a little more for such a great RTS.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but the extended edition is broken.  Stop playing this game a long time because the game was unplayable with LAN (very low frame-rate on computers that exceed system requirements).  Recently decided to give it another go... maybe they patched it up...  first launch game took about 5 minutes to load the main menu and another minute just to change the games resolution. After the resolution had successfully changed, the textures didn't display properly. Exited the game and gave it a restart. Locked up my computer... Not even CTRL-ALT-DELETE or alt-tab would work. Judging by my trouble with the main menu, the game is still broken.   Good thing someone gifted this to me.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes on start up, tried all the fixes on the steam forum and none worked.",
            "review_score": "-1"
        },
        {
            "review_text": "The great classic that it always was. Unfortunately It often lags, crashes and generally takes a while to load. However I am confident these issues will be patched in future updates. Apart from that it is the amazing game that It always has been, now with steam workshop and fancier graphics, and it is well worth buying. This game is one of my all time favourites and is definately worth the price, at least for me. Update: Many of the stated problems have been fixed through patches",
            "review_score": "1"
        },
        {
            "review_text": "Great nostalgia value. Didn't notice a lot of improvements from the original game, but the game mechanics are mostly still fun. It has way more bugs than I remember.  The new campaign is forgettable, even when there are enjoyable aspects of playing with or against the new civilization.",
            "review_score": "1"
        },
        {
            "review_text": "I really really want to love this game (again), but i just regret the 12€ i spent for it.  there are 2 things that make this game not rly enjoyable for me  - The game is slow as ♥♥♥♥.... and you cant adjust it. of course there are cheats but it can only be adjusted in two steps - slow as ♥♥♥♥ or fast as ♥♥♥♥. None of these two 'options' are kind of enjoyable  - The multiplayer in generel... gosh, i played the original game on a lan party last year, it was fun, but we were also annoyed by the unit cap 200 unit supply and your whole army is made of 10 footsoldiers and 10 mythical units. Sorry but we found this just boring. Now we bought it on steam with the expectation that this game got the same awesome modder that AOE2 HD got, buuuuuuuut nope.  - especially the online Multiplayer: I dunno if only we have this problem, but the game laggs and got like 1-2 seconds delay if you are not the host. Its not that bad because the game is slow anyway, but i dont know, a laggy multiplayer is not worth 12 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Brings back lots of good old memories from my childhood",
            "review_score": "1"
        },
        {
            "review_text": "A cuple of years after release and the mutliplayer stills runs terribly and just massively stutters. Just buy the original game as the online experience is very much dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Can we get this on the Mac please?",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would buy hd remaster in 10 years",
            "review_score": "1"
        },
        {
            "review_text": "The graphics have a good looking for the actual patherns, I mean, now it's playable, don't buy it expecting recent graphics, it's just a remake of the old one for widescreen monitors with some adjustments in lightning and shadows. I recommend this game if you played it some years ago, when it was fresh and new, this will bring you nostalgia. Im loving it.",
            "review_score": "1"
        },
        {
            "review_text": "Played this in classic CD version back in old days, enjoyable.   Bought this Extended Edition, received game-breaking bug when advancing ages, not enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a fan of this game that's why i suddenly got excited to download and play this. But it is such a disappointment that it doesn't start or inaccessible considering it is not a free game/app.   I strongly suggest players/ users of steam to not download this because simply it is just a waste of money. There are many others who have the same issue as mine. Please steam fix this for the improvement of the steam community. Thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "It's the game I grew up with that's for sure... however I do have mixed feelings Pros: 1. The nostalgia effect and gameplay is very satisfying 2. Single player play is top notch 3. Level editor is advanced and amazing if you learn it  Cons: 1. Multiplayer has problems... lots of lag and not that many people play it 2. The cost... should be pretty cheap like age of empires havnt played the dlc as i dont think it would be worth it  Overall, I would recommend it considering you have extra money to spare",
            "review_score": "1"
        },
        {
            "review_text": "Love this old skool RTS.  10/10 worth the buy during summer sale",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best game ever created. I have been playing it since it was first released in 2002. When Microsoft decided to 'remaster' the game I knew I needed to have it.   Do not pay full price! A game that is almost 14 years old is not worth $30. I can't tell the difference between the old visuals and the new visuals they are promising. However it doesn't matter the game is absolutely amazing and is highly recommended for ANY RTS lover. There is a lot of replay value and the story is well written with its own special moments.   If your a fan of Mythology, this game really is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Great remake of an amazing game!!!",
            "review_score": "1"
        },
        {
            "review_text": "I was a HUGE fan of this game/series when I was a kid, so I got this game the other day, and booted it up for the first time. When starting the campaigns, I noticed that it only listed the expansion campaigns. Does this ExE have the original campaigns included as well? Please advise.",
            "review_score": "1"
        },
        {
            "review_text": "the game just stopped working so i dunno what happened to it...sucks cuz i liked playing that game im kinda ticked off it doesn't work",
            "review_score": "-1"
        },
        {
            "review_text": "This was the first game I bought myself on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so much. I remeber playing it years ago for hours and hours. Just a fun game to relax and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Very nostalgic love this game",
            "review_score": "1"
        },
        {
            "review_text": "i'm really just waiting for like six million percy jackson mods and maps, since that series hadnt even started when i was first playing this and now that we have a series for all three civs i have a mighty need. cuz its aom. which is the best.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, I found it more similar to AOE 2 than 3, but I liked that gameplay. It fun playing the campaigns (even though it sometimes felt it was going on forever) and the achievements just take time more than effort. LOVE unleashing a titan that destroys everything in its path! Or creating a monument to the gods! RULE all!!!!  I like that you can leave it and comback to a bunch of resources. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game was my favourite game in my childhood, this inspired me to be the gamer I am, I started this at the age of 3 but I had to get rid of it when my laptop stopped working, now with my new PC and valve putting it on a -75% sale a few days ago It made me buy it again. 2 words.... NOT DISSAPOINTED (and another 2 words) AT ALL! Get this, you will not be dissapointed even if you are bad at RTS. Also, a side note: This helped me alot in my Mythology class (I'm greek)",
            "review_score": "1"
        },
        {
            "review_text": "Another one of the better RTS games you will find on steam, one i would add to the collection of RTS games to play with friends! price is a little higher compared to some of the others RTS games that i would say are equally as good if not better than this one, but still if your looking to add variety to your library of RTS games this is one i would pick up",
            "review_score": "1"
        },
        {
            "review_text": "Childhood favourite and this remake refurbishes it well",
            "review_score": "1"
        },
        {
            "review_text": "I have been in love with this game since childhood. RTS strategy with quite strong narrative set in Greek mythology? No way it's going to change.  + quite decent story with respect to the genre + unique setting + ages really well and graphics is still not that bad",
            "review_score": "1"
        },
        {
            "review_text": "i'm really just waiting for like six million percy jackson mods and maps, since that series hadnt even started when i was first playing this and now that we have a series for all three civs i have a mighty need. cuz its aom. which is the best.",
            "review_score": "1"
        },
        {
            "review_text": "I am loving this game. I actually bought it for my son who is well into mythological monsters at the moment but I am enjoying playing this myself. I played the original Age of Empires years ago and was not overly impressed after a while by the repetitive units they drip feed against you. But this game has loads of great elements in it and played on easy with one enemy I am finding it suits my liking for slower gameplay rather than hectic battles. The graphics look a little blurred and it doesnt support my 2080x1024 res properly so I suspect the screen is a little stretched to fit my monitor but I will mess around with my Nvidea AA settings in the control panel to try to get it a bit sharper. I havent played the campaign yet but that was never the strong point of these games, but perhaps for this game is would be worth a go. Either way certainly recommend you buy this (at a sale price - I got it for £5) as its a great little game and still doesnt look bad with its slightly modernised graphics.",
            "review_score": "1"
        },
        {
            "review_text": "A classic awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "while i do love this game and ive played it since i was a kid, its overpriced af and the DLC is very overpriced, still fun though",
            "review_score": "1"
        },
        {
            "review_text": "Love this game and it brings back many memories. Yeah not worth $30, maybe $15 or $12. the only thing bothering me how small the dlc or extension of the game is and this weird Alpaca bug. For set gameplay everytime you summon animals, they are all alpaca! What's the deal, but thats about it",
            "review_score": "1"
        },
        {
            "review_text": "YOU CAN KILL A GOAT 10/10 i hate goats",
            "review_score": "1"
        },
        {
            "review_text": "It's realy good",
            "review_score": "1"
        },
        {
            "review_text": "The best thing in this style of game is the multiplayer. But this Age of Mythology: Extended Edition don't have any server to host multplayers game. Using a P2P, what explain why is impossible play because of the lag.  Don't buy this except for play with bots or LAN. Or you will regret like me.",
            "review_score": "-1"
        },
        {
            "review_text": "Although this title is not without numerous flaws, including those which were not present in the original CD release, it still stands as one of the greatest RTS titles of all time. Buy it when it goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The best Age of Anything",
            "review_score": "1"
        },
        {
            "review_text": "Age of Myth is one of my favourite RTS's of all time. There's no doubt that this game is pure addictive fun.  ",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this game years ago when it first came out and really enjoyed it. I decided to buy it and relive the experience and was genuinely happy with the game, but after I beat it I had zero passion to play it much more. I know RTS games have high replay value, but I would rather play something else then keep playing. I enjoyed it for what it was, but I doubt I'll be playing this again anytime soon. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game. Age of Mythology EE is great. Have enjoyed many hours with it so far. The additional replay value from the Steam workshop mods is also cool. I bought the new DLC Tales of the Dragon and am enjoying that too.",
            "review_score": "1"
        },
        {
            "review_text": "Bugs is not something this game lacks. It has got them, a lot of them. Not to mention they seem to have got the online experience much worse than the original..",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 This game is bawss.",
            "review_score": "1"
        },
        {
            "review_text": "FIX CRASHES AND THEN 10/10 K?",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of people have said that the multiplayer is useless and unplayable due to bugs. I admit the desync error makes most multiplayer games unplayable but private games with friends can be easily reloaded, the modding options are great, it has nearly no differences to the original game, the chinese gods (which seems to have been a let down) is only an optional payment and the single player is practically unchanged. I would suggest playing with friends who you can privately invite and host games with to stop desync from ruining all multiplayer games but exculding that I think most of the negative reveiws are a bit too harsh. Fix desync error and it will be a great game, it's not like multiplaer worked well on the old disc versions anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Lost my friends due to this game, Lol jk i don't have any",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, really good campaing mode, ond fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "Currently unplayable cuz it makes my PC overheat.  Edit: still makes my CPU fan scream but it's ok now that I got a better cooling system",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the trouble. The new DLC crashes the game even for those who dont have the dlc.. Keep getting Error 0172: 'cUnitTypeVillagerChinese' is not a valid operator. As a result the players citizens get killed and player is defeated. Purchasing the dlc didnt help. Till they fix this i wouldnt recommend this game.    *update* Renaming the mod folder gets rid of the 'cUnitTypeVillagerChinese' is not a valid operator' error.",
            "review_score": "1"
        },
        {
            "review_text": "i have been a fan of this game for a while, old school yes.Still playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "This game is an RTS, similar to Age of Empires and games like that. I used to paly this back in the day when it was new.  There are 4 cultures to pick from: Greek, Norse, Egyptian, and Atlantis.  I like it because it uses real-world mythological creatures (although Atlantis is just a whole bunch of Pagan stuff mashed together) in the ways that warrior cultures would realistically use them: For instance, Hydra are used in a simliar fashion that Hannibal (NO, NOT THE DUDE FROM THE A-TEAM) used elephants, but they grow heads sometimes when they kill a unit, and each new head give them a more powerful attack.  Pros:  - Fairly simple to understand and start playing - The campaigns are fun, and also teach you a little about mythological history (e.g. you have to collect a piece of Osiris in one of them) - The Single/Random maps can be a great way to kill a few minutes, or an hour - This version includes all the expansions/DLC - Voice acting is pretty good, even if the script's a little cheesy - The Devs are pretty active compared to a lot of other game communities  Cons:  - Last time I played this over LAN (and I mean THIS edition of the game), it was incredibly jerky. It didn't lag, but it did stutter. Totally playable, but not entirely fun. The latest patch apparently deals with this, but I haven't had time to test it and don't know when I will be able to again. - The extra lighting effects, while excellent, MAY mean that the game has a much higher 'minimum spec'. Having said that, most modern computers should be okay.",
            "review_score": "1"
        },
        {
            "review_text": "LAN works well, and that alone makes it worth the purchase if you have a friend with a ♥♥♥♥♥♥ laptop who wants to play an RTS with you. That said, this is very much an uglier and less polished experience than Age Of Empires 3. On that note, it offers a lot of unique features that AOE3 does not.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, decent story and campaign to play through. When this first came out when i was a kid i spent hours playing custom matches against friends. If its on sale and you like these kind of games give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Dude wow, they actually fixed the game. It doesn't run like a$$ now and the multiplayer is stable too. The expansion is actually really nice, the chinese are fun to play and offer new ways to play the game.",
            "review_score": "1"
        },
        {
            "review_text": "A game that has kept me entertained for 13 years now. The extended edition brings little new to the game, but being able to play it on steam is convenient.   The game has arguably the best campaign in the AoE series, and unleashing myth units on your enemies always feels good.",
            "review_score": "1"
        },
        {
            "review_text": "Nearly unplayable on multiplayer. Don't waste your money, the memory leak in this game gonna make it hazardous to your health in every aspect. You can expect to play an hour game and get desynced without finishing it. Half of the players have this issue and not a single god damn ♥♥♥♥ing answer was given to that day. I can say that the online experience on this one its far worst then the original AOM.",
            "review_score": "-1"
        },
        {
            "review_text": "My problem with the game is that it refers to certain Nordic people as 'dwarfs' while the politically correct term would be 'little people' or 'Swedish mining enthusiasist midgets' Please join the cause and send emails to microsoft to fight the so called 'vertically superior' and end their evil reign of tyranny. Great online play though.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I HATE THIS GAME!!!  I've been trying to open the game since he came out but it didn't open even once! You can trust my comment because look at the amount of hours i got into it  2/10 for at least showing in my libary",
            "review_score": "-1"
        },
        {
            "review_text": "I HAS GAME. I PLAYED GAEM I LIKE GAME ALL IN ALL I LIKE GAME ",
            "review_score": "1"
        },
        {
            "review_text": "Just like real life the goal of this game is to kill those who worship a different god than you.",
            "review_score": "1"
        },
        {
            "review_text": "game is not starting!!! deleted and installed nothing happens!!",
            "review_score": "-1"
        },
        {
            "review_text": "If you never played this game you never had a childhood.",
            "review_score": "1"
        },
        {
            "review_text": "Skybox Labs, the ♥♥♥♥♥♥♥s who ruined AoM, may the Gods of every pantheon curse thee  Should you buy this game?  In a word  No  From gamebreaking bugs, to ruined multiplayer, to...most importantly, the HORRIBLE ♥♥♥♥♥♥ horrible ♥♥♥♥♥♥ horrible and horribly ♥♥♥♥♥♥ Chinese DLC, that is foisted on you whether you want it or not, in the form of ending up in your game whether you own it or not, and then if you DON'T own it, demanding you either buy it now or quit the game, in other words a highly obnoxious way for the developer to pester you to give them money that they don't deserve.  The effect this has had on multiplayer is disastrous, to say the least  It's been years, and many of the bugs that others can describe to you in greater detail, such as memory glitches, have not been fixed and indeed show no sign of being fixed thanks to the neglectful, abusive Skybox.  You're better off just buying a disc of this",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent. As someone who only had a limited experience with the original AOM, and a lot of experience with AOE 1 and 2, this is a real treat and feels very well polished. Thanks so much to the devs for brining it to Steam and updating it. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a review on this game you've come to the wrong place, but if you're looking for an outstanding pie recipe you've come to the right place.  Ingredients: 1. 6 tablespoons unsalted butter 2. 1/2 cup white sugar 3. 1/2 cup brown sugar 4. 1/4 cup water 5. 1/4 teaspoon cinnamon 6. 1 pinch salt 7. 5 apples - peeled, cored and sliced 8. 1 pastry for double-crust pie   Directions: 1. Preheat oven to 425 degrees F (220 degrees C). 2. Combine butter, white sugar, brown sugar, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat and set aside. 3. Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices. 4. Roll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal. 5. Pour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust. 6. Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.",
            "review_score": "1"
        },
        {
            "review_text": "Just like the old one, but with steam supported servers?",
            "review_score": "1"
        },
        {
            "review_text": "My only problem is that this is not the gold edition. So you don't have the expansion for it.",
            "review_score": "1"
        },
        {
            "review_text": "8/8 m8 while i think this game is gr8",
            "review_score": "1"
        },
        {
            "review_text": "If it was HD, Id reccommend. Its still awesome, dont get me wrong but youre probably not gonna play it that much.",
            "review_score": "-1"
        },
        {
            "review_text": "it's age of mythology. 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Age of Mythology II PLEASE !",
            "review_score": "1"
        },
        {
            "review_text": "Although not much different from the original, still a great game. I have always loved the age of empires series, this is my favorite. The game is well made, although some of the graphics and textures are out of date, the story is good, there is re-playibility, great music, and plenty of possibilitys and startageys. The newly added workshop support and steam multiplayer are worth the extra money difference from the original, although if you already have the original I wouldn't buy unless it goes on sale. Overall, a great game well worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game,played it since it's release",
            "review_score": "1"
        },
        {
            "review_text": "I'm probably biased because this was my first RTS ever, but this is probably the best of the genre. All the goodness of Age of Empires combined with the depth of mythological units and god powers. Don't pay attention to my hours, I had a physical copy since I was in 4th grade.  Pros: +Fun challenges, it allows you to tackle the enemy at your own pace so long as you play smart and hold off against their attacks. +The Vanilla campaign + Expansion campaign can clock in about 30 hours +4 'cultures', basically 4 civilizations, each with 3 different major gods. Major can impact everything from your units, your god powers and your economy. For example, the Norse have 3 major gods: Loki, Thor and Odin. Loki focuses more on military, Thor focuses more on economy and technology, and Odin is a balance of both. All three of these civilizations have access to most of the same units and buildings though. +Multi-player +Titans are the tightest ♥♥♥♥ ever  Cons -$30 for a 2002 game. -Has workshop support but the modding community is long gone. -Atlantis civs are OP. Not a huge gripe because there's no competitive scene but it's important to know.  If you like RTS, buy it, you'll get your moneys worth no problem.",
            "review_score": "1"
        },
        {
            "review_text": "It is really nice, especially if u played the original",
            "review_score": "1"
        },
        {
            "review_text": "Probably has to be one of my all time favourite games. Really fun to play with others.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this games 10/10",
            "review_score": "1"
        },
        {
            "review_text": "it plays kinda like age of empires 2  my favorite god was RAmen, the god of building farms and rushing titans  there were no romans so  IX / X",
            "review_score": "1"
        },
        {
            "review_text": "A fast pace RTS with cool mythological units and diverse ways of playing. Only criticism I could give is that there could be more diverse strategies instead of unit spam. The god powers are a step in the right direction for this point.",
            "review_score": "1"
        },
        {
            "review_text": "okey lets start story   story: good don't have a problem  Units: very ballenceed  Buildings: good looking  gameplay: 10/10   dlc: have not tried (YET)  online play: not that many people playing like max 10 rooms ive seen  overall; get it if u love rts  p.s: get when on sale this christmas",
            "review_score": "1"
        },
        {
            "review_text": "A fast pace RTS with cool mythological units and diverse ways of playing. Only criticism I could give is that there could be more diverse strategies instead of unit spam. The god powers are a step in the right direction for this point.",
            "review_score": "1"
        },
        {
            "review_text": "A great game just like the original. No amazing graphic updates here but it runs excellent on modern systems. I have just as much fun playing it now as I did when it first came out.",
            "review_score": "1"
        },
        {
            "review_text": "back 10 years ago *_*",
            "review_score": "1"
        },
        {
            "review_text": "Very laggy multiplayer, avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Very laggy multiplayer, avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "I do really like this game. It has served me well since childhood and continues to bring back good times! Though multiplayer is bugged, it can still be worked out by remembering to save games and load them again once a crash occours.  One last comment: Who the hell picked the names for the soundtrack files?! Hot damn that is funny.   Steam\\Steamapps\\Common\\Age of Mythology\\Sound\\xpack\\xtaunts\\en\\999 theme.mp3 Fantastic! or Steam\\SteamApps\\common\\Age of Mythology\\sound\\music\\fight\\oi, that pops!!!.mp3 Another famous track  Steam\\SteamApps\\common\\Age of Mythology\\sound\\a matt named kittens.mp3 If one just had a matt named kittens..",
            "review_score": "1"
        },
        {
            "review_text": "I can recommend this game if your after a good RTS from the old days. Everything else that the original game had is indeed here, with a few audio issues. And honestly the visuals haven't seen that much improvement beyond better water, terrain and resolution.  If you really liked AoM from the old days then this game would be perfect for you.   Gameplay wise it plays out as any other Age of Empires game, albiet with mythological units as opposed to realisitc ones. So expect monsters to play a big part in this game.  The one real problem with this game is the really bad Twitch integration. It doesn't tell you when your streaming, the stream chat doesn't show up anywhere in game and the quality is the worst I have ever seen. A lazy half ♥♥♥♥♥ effort on the developers part, and there doesn't seem to be any signs of it improving.  Now should you buy this version over the original? Yes, the fact of the matter is that the original version of this game has a hell of a hard time working on modern day systems. However I wouldn't pay the full asking price for this updated version.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the atmosphere of this game. The different mythologies are very well mixed, without getting ridiculous. Besides the single and multiplayer options, the map editor offers plenty of abilities (especially with the triggers functions). I could for example create scenario's in which you would change players every few minutes, allowing for completely different strategic choices.  I didn't encounter the bugs that others speak about, but then I didn't play in the past few months. However, I never really liked the multiplayer in Age of Mythology, because it feels to hasty for me: you need a precise timing and lots of hotkey bashing in order to win. This takes away the relaxed feel that the game has for me in single player.  Don't buy it full price, it's way too old for that. Below 10 euro's it can be fun :).",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. If it works on your computer great, if not it will be a drag to get it working....",
            "review_score": "1"
        },
        {
            "review_text": "I played this game alot when i was a kid and i really like this game.  Gameplay: 9/10 Graphics: 6/10 Bugs(higher=lower bugs): 9/10 Singleplayer: 10/10 Multiplayer: 8/10 Music: 9/10 Sounds: 9/10 Controls: 9/10 Content: 10/10   Total: 8.77/10",
            "review_score": "1"
        },
        {
            "review_text": "AOM:Ex provides the same great gameplay as the original with more great features like multiplayer, better lighting, better water and more!",
            "review_score": "1"
        },
        {
            "review_text": "how can i download this on my mac air (11inch)? it says error platform something",
            "review_score": "1"
        },
        {
            "review_text": "Started as a tiny asian village, walked around the map stealing all the sheep then slaughtered my enemies.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Wouldnt play again because it was so long and so fun and I dont have to much of this thing one would call 'youth' to spend on it. But if you can overlook the design and focus on the story, it becomes really good.",
            "review_score": "1"
        },
        {
            "review_text": "  Just got this on Steam Sale, definately wait for a sale as the $35.00 is too much of an asking price. Still the same fun game I remember with great graphics 10/10 would prostagma again",
            "review_score": "1"
        },
        {
            "review_text": "One my personal favorites by Ensemble Studios. The extended edition brings very nice graphical and gameplay improvements, as well as the addition of the steam workshop!",
            "review_score": "1"
        },
        {
            "review_text": "Just like the classic with improved everything!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, don't get me wrong, however, one of the patches (not sure which) screwed up the Atlantean race, at least for me. With all requirements met (the 400 food and temple) it still won't allow the button to be pressed. I've tried it in the mission and a random map, but it's always the same result. Care to fix it please?  Not trying to dog on it, it truly is a great game.  I'm forgetting something. Prostagma?",
            "review_score": "1"
        },
        {
            "review_text": "There is a reason one of the tags for this game is, 'Masterpiece'",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. One of my favorites. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love the game. Played this way too much as a child.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much I can't stop playing it",
            "review_score": "1"
        },
        {
            "review_text": "This game is still good, play it.",
            "review_score": "1"
        },
        {
            "review_text": "good game lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "i must have at least 600 hours on here from the original disk, classic, awesome game. even better with the new extended edition.  ps: etimos",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying the classic game, not quite good enough again to be knowledgeable about balance but for those looking for the classic and don't have the CDs, this is for you!",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game since the first time it hit the shelves and in my opinion it's one of the best RTS games ever made.  I can go on about all the diffrent things that makes it great but I don't think it matters, if you like RTS games and have never played this you will most definently fall in love with it, as I did. Don't think about it, buy it and try it.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when it first came out and I still love it now. Though its graphics have been far surpassed by that of current games the storyline still compels me to play. For those who are interested mythology this game can tell you a lot about the myths of the cultures it encompasses.",
            "review_score": "1"
        },
        {
            "review_text": "A classic rts and one of my favourite games of all time. If you're a fan of other Ensemble Strategy games such as Age of Empires (in particular AoE 2) you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Since 2002, still among my favourite games, I keep finding new ways to play the main campaigns (Fall of the Trident best campaign ever), and the once huge community kept making excellent custom maps, scenarios, minigames and even campaigns for years. Too bad the community has declined from the golden age, but still a good purchase. I don't think it's worth the whole 27 euros if you already have the old edition + expansion, but it's at least a decent upgrade.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is just like I remember. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I wish they made a sequel to this game, the possible new civs and gods, would've been fun. There is something on the DS which is actually a turn based version, thats pretty decent.  This game is a classic. Super fun, I will be blinded by nostalgia for it. No reasoning with me here.",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this game before when i was young offline. but now i play online. A good game.",
            "review_score": "1"
        },
        {
            "review_text": "loved it to death as a kid loved it to death as a adult!",
            "review_score": "1"
        },
        {
            "review_text": "AOM:Ex provides the same great gameplay as the original with more great features like multiplayer, better lighting, better water and more!",
            "review_score": "1"
        },
        {
            "review_text": "A/5 updated textures cause the game to not work",
            "review_score": "1"
        },
        {
            "review_text": "Can't argue with the classic games. Was good then, is still good now.",
            "review_score": "1"
        },
        {
            "review_text": "textures aren't the greatest but then again its an old game but its perfect for those who love mythological beasts and gods, greek gods, norse gods, egyptian gods. and chinese gods personally I love the norse and chinese gods",
            "review_score": "1"
        },
        {
            "review_text": "Really good! definatly recomend!",
            "review_score": "1"
        },
        {
            "review_text": "this game was really fun i felt the stories were kinda lame. but the gameplay was great the differences between each factions were awesome. i would give this a 4 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "Going back to Age of Mytholgy after a few years it has now rekindled my excitement for the game",
            "review_score": "1"
        },
        {
            "review_text": "I first played AoM when I was very young, and enjoyed it greatly. The only game I could find to do with mythology.  I was disappointed to find that the graphics are no better than before really. But theres quite a few retexture mods out there.   The online play is great, I've had no problem with it. I don't have the newest dlc so i have no comment on it. I don't plan on getting it until its debugged.   I've never had any problems with gameplay or online play.   If you like mythology you're likely to enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game! updated for today,like to see a new version come out along with AOE 4.",
            "review_score": "1"
        },
        {
            "review_text": "This was a good buy. It kept all the same feel as the original but the additions to it really helped to enhance it. And still to this day remain one of my favorite games since i was 6 (although the defeat the horde achievement was brutal and long)",
            "review_score": "1"
        },
        {
            "review_text": "For an offshoot of a 'realistic' RTS franchise, AoM is surprisingly good. Definitely worth your time. Think Age of Empires with mythological units and, ever so often, Black &amp; White-like powers that can tip the balance. Robust campaign, too.",
            "review_score": "1"
        },
        {
            "review_text": "O CANADA  This game gave me immense respect for both Canada and her bears.",
            "review_score": "1"
        },
        {
            "review_text": "It's Age of Mythology is anamazing game but too expensive considering its age. Wait for a sale",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best strategy/warlike games I have ever played!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Need's Mac version",
            "review_score": "1"
        },
        {
            "review_text": "I've always been a fantasy fan so I may be a little biased. I played this when it first came out before the days of the steam library, though I have to say there are some glitches now that they didn't have when running off of a cd. Some lag issues and a few crashes mar this classic but all in all still a good game.",
            "review_score": "1"
        },
        {
            "review_text": "just like the good old days good game play . runs smooth  sadly last update cant be instaled . disk error . while i dont have disk",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun RTS that is for casual gaming and brings a historical/mythological aspect to a game like Starcraft. As in the title, its with the gods of the old era and is a diffrent take on say Age of Empires does but doesnt fault in any aspect of quality. Would recommend anyone wanting to get into playing fun RTS's, wait till it goes on sale though.",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as when I got the game on cd. Just wish the online was as lively as it was back then.",
            "review_score": "1"
        },
        {
            "review_text": "I first played AoM when I was very young, and enjoyed it greatly. The only game I could find to do with mythology.  I was disappointed to find that the graphics are no better than before really. But theres quite a few retexture mods out there.   The online play is great, I've had no problem with it. I don't have the newest dlc so i have no comment on it. I don't plan on getting it until its debugged.   I've never had any problems with gameplay or online play.   If you like mythology you're likely to enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game just needs more players online for the multiplayer! Would reccomend buying elsewhere though since 30 dollars is way too much lol...",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game, It's one of the things that got me into playing computer games. It's even better now that it's on Steam. Too bad the workshop has nothing but translators on it.. Also, my ♥♥♥♥ing AVG keeps deleting my launcher because it thinks it's a threat. Stupid ♥♥♥♥ing piece of hardwear. I'm ♥♥♥♥♥♥. Great game, really groovy.",
            "review_score": "1"
        },
        {
            "review_text": "dude i just got the game and it keeps crashing i cant even play online i dont understand ",
            "review_score": "-1"
        },
        {
            "review_text": "THROW THINGS AT ME",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would reccomend for a fap",
            "review_score": "1"
        },
        {
            "review_text": "Troubled sleep,  This is a game that I always come back to, time and time again. In fact, besides age of empires gold edition this was my first game I ever owned on a PC. I could not get enough of this game back in the day. I clocked soo many hours into it the timer would say 'damn' Now before I go into detail on why I should reccomend this game I should talk about the problems I ran into  1. The visuals. Maybe it is just me but the new grass textures just destroys my eyes. I actually got a headache playing my first match on Islands. The textures are not bad but they seem too grainy but hey its age of mythology. 2. Glitches I ran into this problem alot trying to face multiple enemies one would not even appear on the map and the other would just sit there and do literally nothing. Also, I ran into problems with icons for certain units not appearing for instance the anti-foreign soldiers of egyptians would just be a blank icon.  3. DLC glitches this is only for the people that bought the game and not its expansion alot of times when trying to load a random map with a random enemy for some reason the dlc somehow glitches itself into the game crashing it and forcing me back to the main menu....  4. Sill has that AI jump This is a problem for alot of beginners, when you first play on aom its more than likely on easy and the enemy will basically stand stil until very late in the game, well lets play moderate and you are chugging along and all of a sudden at about 7:31 you see a sizeable force of random soldiers slaughtering all of your villagers... If I ask for a patch it is this... FIX the AI difficulty curve it is wayy to steep and it could poetentially break a sale away from the company.,   (please note that these are the things I saw in the game and your experiance will more than likely vary.)  On to the reccomendations  The visuals, While not major I got a good glimpse at the incrase of quality that was transferred over from its 2000's counterpart. Alot of the edges of buildings are alot smoother and a AI animations and textures run ALOT smoother. This provides the user with a more stable and smoother running game than sometimes before.   Slight AI improvement I found this out while fighting certain enemies I could not exploit mechanics like I used to be able to. I saw that the AI had more flexablility than what it used to be. Now this does have a problem. The AI is still STUPID, military units still have that dumb short range of sight and wont hesitate to move if you destroy everything AROUND that circle of sight.   What I like Soo I touched on more bad things than I did good, dont get me wrong. I love this game it brings back alot of memories and what I touched on in my review is the differences that I saw ( or none there of). This game is still a really great and balanced RTS game even to this day. Its simplicity and yet it complex structure is what makes me always come back to it.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive as always!",
            "review_score": "1"
        },
        {
            "review_text": "Classic game that needs a part 2. Gameplay is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Writing long reviews is boring, this game isn't. If you like any strategy games or ancient mythology you will like this. I've been playing it since I was a little kid.",
            "review_score": "1"
        },
        {
            "review_text": "One of my most favourite games! I played it twice and i wouldnt mind playing it again. It mixes fun and strategy! Highly Recommend it to all users on steam!",
            "review_score": "1"
        },
        {
            "review_text": "Grew up with this game and really enters you into the gaming world of strategy with a really awesome main story.",
            "review_score": "1"
        },
        {
            "review_text": "Came back 12 years later and it's just as awesome, if not better.",
            "review_score": "1"
        },
        {
            "review_text": "best ever banana bread 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game brings me back to a time when games were not too fancy but full of content and gameplay! It's a true gem!!",
            "review_score": "1"
        },
        {
            "review_text": "I leaned Greek with it, so it's worth it. NE ! VULUME ! MALESTA ! KALOS ! PROSESHE ! IZVOLI ! METALLES ! VRITTOMOS ! PORO ! LEJE ! THIREFTIS !",
            "review_score": "1"
        },
        {
            "review_text": "Pretty broken new Chinese campaign, but new units and and civ are a decent edition, even if they aren't revolutionary. Not as offensive as some people make out, but certainly in need of patching and perhaps give the campaign a miss until that point. Think hard about whether you want to spend your hard-earned money on this one",
            "review_score": "1"
        },
        {
            "review_text": "It's a good remaster of a game that was in dire need of revival, the DLC it comes with breathes new life into it, despite it's many setbacks. I'd get it if you love history, and the mythology of various nations.",
            "review_score": "1"
        },
        {
            "review_text": "If you love Age of Empires you will love this game, typical stratergy with a mythoilogy twist to it.",
            "review_score": "1"
        },
        {
            "review_text": "It is age of mythology. AGE OF MYTHOLOGY. OH IT'S THIRTY DOLLARS, WELL ♥♥♥♥ YOU PAY FOR IT ANYWAYS.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive as always!",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ING AMAZING BUY IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for the nostalgia.   It was honestly great.  The best part was when I used to play this with a ♥♥♥♥ PC. But today I'm happy playing this game at a crisp 120+ FPS",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game since roughly 2007, I was five years old, TBH this is the best RTS I have ever played and seriously one of the best games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite multi-player games, which wouldn't run from my 15-year-old CD-rom(s) on Windows 10. This version does work for me, and turned disappointment at potentially never being able to play this game again into excitement!",
            "review_score": "1"
        },
        {
            "review_text": "A classic RTS game that still holds up surprisingly well today. While the units seem rather blocky by modern standards (alright, very blocky), the scenery still looks beautiful, the gameplay is solid and you can sink dozens of hours in the campaigns before you even bother with single player matches or multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry but this game sucks! Does not feel like an AoE game :(",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game when I was young it was mindblowing! Really happy to see it back. :) Amazing game to play if you enjoy faster paced RTS's.",
            "review_score": "1"
        },
        {
            "review_text": "Played this as a kid, still holds up very well",
            "review_score": "1"
        },
        {
            "review_text": "If you played it before go for it! It has aged well.",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy game I had ever played. Please nominate this game for the 'Endure the Test of Time' steam awards.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that will always be close to my heart as I have played it since I was a kid. The campaigns are long with a rich storyline. Each time you move up an age you have your choice of 2 God/esses that each have their own speciality.  An oldie but a goodie!",
            "review_score": "1"
        },
        {
            "review_text": "Sheep. Best use of farm animal for creating more villagers!",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game especially for people who are fans of older RTS design.",
            "review_score": "1"
        },
        {
            "review_text": "For those of you who played the original game, this is not much better in terms of anything except for the resolution. Not worth paying full amount for, bought it on steam sale just because of nostalgia.  7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the greatest game of all time. You'd have to argue for a very long time though",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when I was young it was mindblowing! Really happy to see it back. :) Amazing game to play if you enjoy faster paced RTS's.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry but this game sucks! Does not feel like an AoE game :(",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun game for those who like RTS o3o",
            "review_score": "1"
        },
        {
            "review_text": "Great re-release, with interesting new dlc",
            "review_score": "1"
        },
        {
            "review_text": "OMG I LOVE THIS GAME EVERY ONE IF YOU LIKE RTS BUY IT!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The Graphics are not like the screenshots minecraft graphics are better !!",
            "review_score": "-1"
        },
        {
            "review_text": "making slaves was my dream ever since i was a kid   10/10 ign- would make slaves again",
            "review_score": "1"
        },
        {
            "review_text": "Hello readers,  Age of Mythology. To start off, the game has been turned into a cartoon. It feels very solid and is certainly not like its brothers of the series Age of Empires. The RTS on this game is a lot more smaller scale and the gameplay feels fixed compared to AoE.  However, this game is a great addition to the RTS community and should not be missed out because it is one of a kind.  If you want to buy an RTS, going for AoE 2 would server you correctly.  I rate it a 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Hello readers,  Age of Mythology. To start off, the game has been turned into a cartoon. It feels very solid and is certainly not like its brothers of the series Age of Empires. The RTS on this game is a lot more smaller scale and the gameplay feels fixed compared to AoE.  However, this game is a great addition to the RTS community and should not be missed out because it is one of a kind.  If you want to buy an RTS, going for AoE 2 would server you correctly.  I rate it a 6/10",
            "review_score": "1"
        },
        {
            "review_text": "An absolute gem that is a must play for any Age of Empires fan (or RTS fan in general). The Extended Edition has added quite a bit of features to an already unforgettable computer game from the Windows XP era. Outside of support for newer operating systems such as Windows 8.1, the team behind the new revamped line of classic PC games for Steam audiences added stuff like TwitchTV, steam friend invites in the multiplayer lobby, new graphical effects (mostly with lighting and the new water textures), new native resolutions for widescreen monitors, and other visual tweaks mostly...but have the left the fun gameplay largely intact (for those not wanting a tainted AOM). All the great single player campaign and multiplayer content from the original AOM is here, as well as the included content from the Titans expansion pack. Probably a bit too pricey at its suggested retail price ($29.99) for a title that has recieved numerous reprints via jewel case release, but a MUST BUY if you catch this particular version on a Steam sale (especially for someone running a new monitor/GPU/OS).",
            "review_score": "1"
        },
        {
            "review_text": "buy this game just do it do it now buy it ",
            "review_score": "1"
        },
        {
            "review_text": "Please, get this game. I remember playing it as a kid, and the feel is still the same. This game is the one you tell your grandkids about. Game of All the Years. It's been with me through good times and bad. Thank the gods it has.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game with workshop support, achievements, all expansions and all the fun from the good old days. A must get!",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this game and now I found it on steam and just bought it. It's still amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Best game I ever played, I will never forget it.  Also it is the only game to feature Amos-exclusive content, so if you're name is Amos you can get the game and it has free Amos content.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A great game and all aspects of the original have been improved, with better animations on characters.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game when I was 6 years old... Now with the win10 Update my CD version didn't work anymore so I bought it on steam and stil had fun playing it! I love that they stil brought us a DLC after 10 years release. I would recommend everybody this game even tho they are not into strategic games and stuff. ",
            "review_score": "1"
        },
        {
            "review_text": "abut 15 people play this game and around 23 when after schools get out and then after a while it dies back to 15 you guys need to bring down the price on this game it isnt worth 30$ i dont recomend it unless it goes down ",
            "review_score": "-1"
        },
        {
            "review_text": "Not much has changed...still stupid pop limit, still stupid build limit. Sorry but so much more could of been done I feel.",
            "review_score": "-1"
        },
        {
            "review_text": "wow ive been playing this game ever since it came out, hoping one day that they would publish it on Steam as they did with Age Of Empires 2. Sadly, this 'hd' remake made the game look horrible on my computer and it even made AoE2HD look better.. I love this game and the campaign is still somewhat playable although the lag spikes and frame drops, but whats really horrible is the ♥♥♥♥ing multiplayer. everyone lags, there are no games to join, everyone is in the lobby hoping for someone to create a game, but the lag on the online gameplay is just horrible. For a game that I've been playing a ♥♥♥♥♥♥♥♥, this dissapointed me. and I was so happy for it to come out.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game when I was 6 years old... Now with the win10 Update my CD version didn't work anymore so I bought it on steam and stil had fun playing it! I love that they stil brought us a DLC after 10 years release. I would recommend everybody this game even tho they are not into strategic games and stuff. ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent remake, much better graphics, and still amazingly fun. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "awsome!",
            "review_score": "1"
        },
        {
            "review_text": "A timeless classic.",
            "review_score": "1"
        },
        {
            "review_text": "ALways loved strategy games AOM was one of my best childhood games we are talking like 12 years ago and with the extended edition its a +++",
            "review_score": "1"
        },
        {
            "review_text": "The nostalgia is real. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I really got in touch with my germanic furry heritage via the norse mythology trees. Also pharaohs aren't n iggers, please redo Egypt so only the mercenaries are nubian monkies. Thanks.",
            "review_score": "1"
        },
        {
            "review_text": "What is love?",
            "review_score": "1"
        },
        {
            "review_text": "This Game's server suck so bad. I love ths game ever since the first one came out, but i cant play the onlie without it kicking me out within the first 2 mins. So i guess they got their money and dont care anymore. Each update 'fixes' the game but all i see is it getting worse.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy as hell. Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy as hell. Don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just boring. Very low FPS for an old game for no apparent reason. If you already have Age of Empires 2 with all DLC, Age of Empires 3 with all DLC, and Rise of Nations Extended Version (which is my case), there's absolutely no need for this game, even if you're a strategy game affictionate.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game, but not many changes and idk if its worth that much",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when it first came out so when i found out it was on steam i brought it straight away, i ove the game but sadly i can't seem to go through 30 minutes of gamepey wihout the game crashing, is this happening to anyone else. This is the only game that this seems to happen.",
            "review_score": "-1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°) 10/10 IGN Rated ( ͡° ͜ʖ ͡°)  ( ͡° ͜ʖ ͡°) Worlds Best Game Of The Ages ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Highly Recommended !",
            "review_score": "1"
        },
        {
            "review_text": "When playing the Egyptians, you can form the ku-Klux-klan (priests) and throw some rocks at a big black guy (Atlantean titan).  ==&gt; A place in my dreams   Sidenote: Great Game and fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "i havent really played it yet but it looks really gay lol",
            "review_score": "-1"
        },
        {
            "review_text": "It's an overcomplicated mess that has too much 'content'. You could fill a freaking textbook with all the stuff you need to know, and no, the tutorial doesn't teach you. As I recall, the tutorial doesn't even tell you your objective.  Oh and, personal opinion: RTS's suck. hehe.",
            "review_score": "-1"
        },
        {
            "review_text": "Its my childhood all over again! And now it looks better! Love the game, but there is nothing different. Multiplayer servers are kinda barren, but LAN games are still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody expensive as hell and doesn't run as well as the original online, but the game itself is legendary. Buy it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I loved it in High School 15+ years ago and I still love it today. Just the entire mythology aspect mixed with the gameplay I loved in Warcraft 2 and Starcraft. I sometimes get lost in creating a bigger empire than I should but it's just that much fun in my opinion. You can easily get lost in this for hours, without realizing the time go by.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game before and love it even more in its remastered version :D",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game. Its really fun, and the myth units add another element to the game.",
            "review_score": "1"
        },
        {
            "review_text": "Unless you are a hardcore fan of this game when it first came out don't buy it. I was looking for a nice, casual game to play on my free time. Not very exciting, mediocre.",
            "review_score": "-1"
        },
        {
            "review_text": "GAY AF, there is a bug where everything is set to zero once it reaches a certain amount",
            "review_score": "-1"
        },
        {
            "review_text": "I really played Age of Mythology from the day it was released. I really loved it even the multiplayer. But I missed it when microsoft abandoned it. So I left it. Extended Edition gives the chance to get back to the game and with a lot better graphics and with multiplayer. Also new achievements to be completed. Good luck guys.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favourite games of all times. It's Age of Empires with Gods who give you monsters and powers. It adds a real edge to an already great series. Plus the fact you get cheats that are easy to learn and use just makes you feel badass.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun RTS and is well balanced. I recommend if you like mythology or RTS's in general",
            "review_score": "1"
        },
        {
            "review_text": "The sold product of the game is really good, and nostalgic for those who played it back in the day. Also the Steam Workshop intergration is wonderful, because there are so many awesome gameplay changing mods that really extend your experience! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Blast from the past, great RTS. Bit pricey though",
            "review_score": "1"
        },
        {
            "review_text": "Keeps crashing.  AI is terrible, example: enemy ships would chase a fishing ship around while getting shot at by other combat ships.  Do not buy, yet, you will probably be dissapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "This is basically the same game as the original, the graphics are still quite dated. Definitely worth the money since I never played the Titans expansion before but I'll be done with it once I finish the campaign.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say... this was one of my first proper PC games back in the day... I used to play it to death, and unlike most things of old, often the ones we hold highest dont stand up to the test of time... I still love this.",
            "review_score": "1"
        },
        {
            "review_text": "Epic game. If you like Strategy games and mythology this is perfect",
            "review_score": "1"
        },
        {
            "review_text": "Not an actual full review, but really just a quick warning/reminder/notice (but nothing bad, since I love AoM!)   Anyone that expects it to be a full on HD remake, is sadly mistaken, because it is almost exactly identical to the original Age of Mythology. Unless you pay good attention, the only real notices are the menus (obviously!), shadowing on objects, slightly better colour and looks a tiny bit more vibrant, and the sound quality (which I'm not sure if its just me, or the headphones I'm using).  Please don't mistake this for a bad review, but just to let people know. The trailer was as like nearly all trailers, a little misleading, as I thought they actually re-made the game. I have been waiting to get this since it was announced, and can't wait to play through it again.   P.S: I'm not sure if its just me or if its the game or my computer setup, but it seems a little glitchy in some areas, like when moving the camera around it seems a little jumpy? May just be me.   Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Has some issues but they are easy to overlook when you get into the game and go Titan crazy.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you steam and Microsoft studios, you brought me back my childhood days. I love you guys.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. I've been playing the vanilla, expansion, and modded versions of this game since it was released. I've looged, undoubtably, thousands of hours on the game. This version is true to the original, although it lacks some of the updates that various mods have added throughout the years. That being said, Steam workshop is adding the updates quickly and is only getting better. If this is a game that you liked growing up, this is a worthy update to try out!",
            "review_score": "1"
        },
        {
            "review_text": "great fun to play. wish there was a little bit more content but not bad",
            "review_score": "1"
        },
        {
            "review_text": "da epicness begins when u play dis",
            "review_score": "1"
        },
        {
            "review_text": "What can I say. Its a classic. Always a fun game to go back to once in a while.",
            "review_score": "1"
        },
        {
            "review_text": "It's my childhood all over again. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I admit I'm walking into this with extreme bias, that is due to the fact that I actually grew up with the rts genre before moving on to other types of gaming and only recently picking it up again. Also I before even purchasing this version already thought fondly of the game series, buying the extended edition twice due to losing one copy of it, and I was extremely young, therefore you could say I grew up on it.  Review Start:  This enhanced edition is pretty much a slightly prettier version of the vanilla game, that being said, the vanilla game is extremely strong. Just from one of the two vanilla stories, it's worth it's price tag, and there are 2 whole stories to it, a level editor, multiplayer.  There are problems with this version that weren't there in the previous versions.  For one, they took out the cheat codes, even in the vanilla story mode. I personally have fond memories of giant canadian caped flying bears who would shoot laser beams to take out the strongest of enemies, of running over building with giant 4 wheelers, and so forth, which actually takes away from the enjoyment heavily.  That being said, this game is still strong without the wackiness, it's a good way to get you interested in Greek Mythology like it did to me as a kid, and it's a solid rts game with decent balance and variances between the different religions/civilizations.   In reality, I would rank it as one of the better rts games to my knowledge, which is extremely dated and probably took place from 14 or so years ago up to around 7 years ago. I consider this game only second to the Battle for Middle Earth series and it's deeply ingrained into my childhood.  The characters are never really all that fleshed out even though you're supposed to have an attachment to the characters, especially the villains who seem like named canon fodder hero enemies, but the troops are all fairly unique to each other, even though you'll almost never be using human troops even fully upgraded in later ages (progression system in specific matches)  Overall it's a solid game that's worth trying out, but the enhanced edition doesn't actually enhance anything but the water and day and night cycle when it would have been interesting to have myth troops. If you're a completionist, you'll enjoy the achievements, if you want a solid rts with an interesting theme and fun dynamics to different cultures, this is a good buy. If you're a psychopath like me, you'll also enjoy level editor where you'll talk like you're the characters and make your own story.  7/10 Masterpiece when viewed with nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "This game was as good as i remember but im really hoping we get the dlc content that came with age of mythology on top of this awesome updated version.",
            "review_score": "1"
        },
        {
            "review_text": "The best ever game by ensemble. Period.",
            "review_score": "1"
        },
        {
            "review_text": "one of my favs games",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I loved it in High School 15+ years ago and I still love it today. Just the entire mythology aspect mixed with the gameplay I loved in Warcraft 2 and Starcraft. I sometimes get lost in creating a bigger empire than I should but it's just that much fun in my opinion. You can easily get lost in this for hours, without realizing the time go by.",
            "review_score": "1"
        },
        {
            "review_text": "Classic RTS played this allot when it first came out way back.....  Still a really good game but now it lags like crazy....",
            "review_score": "1"
        },
        {
            "review_text": "You have likely forgotten how great this games is.",
            "review_score": "1"
        },
        {
            "review_text": "this game makes me feel so nostalgic. played hundreds of hours back when i was 10-12yo and i'm happy to play it again.  IMO, the only problem in the game is that the graphics didn't improve much and it doesnt support 1280-1024 and 1980-1080 resolutions",
            "review_score": "1"
        },
        {
            "review_text": "The game doesnt work, i loved the ds version of it. If you look at the forum everyone has issues and there is nothing to fix it... the makers say yeah delete this file and it should work. well it doenst  DO NOT BUY THIS GAME, DOENS'T WORK",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game!  I am so glad they brought it back in this package of games!  I have been waiting for it forever.  One of the best additions of games back to the community!  Two thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, tons of replay. Updated game/graphics isn't/are not worth it. But if your buying for the 1st time it's easier on the eyes.   Alot of fun, don't need to think just drag click and destroy your enemy. Old school game",
            "review_score": "1"
        },
        {
            "review_text": "man this game takes me back years. the gameplay while a little dated is still fun as ever and i can now lose countless hours in HD!",
            "review_score": "1"
        },
        {
            "review_text": "A real time strategy based game and used to play the original version when I was a kid and loved it and years later found it on steam as a extended addition and is even better than I remember.",
            "review_score": "1"
        },
        {
            "review_text": "Sex on a plate",
            "review_score": "1"
        },
        {
            "review_text": "Do you like AoM ? If you like it dont buy this.   I am so stupid that i bought it. I should be smarter coz i own AoE II HD - LAGS LAGS LAGS evrywhere.   MP is basically unplayable in AoM:/ and other changes are not important or pointless. This game now definetly doenst worth for full price.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Not many improvements on a really old game. Nostalgia made me buy it. I made an army of Hades' special archers and colossi. Then I used all the cheat codes. It was fun.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It runs very well if I'm playing the non-steam version that I've owned for 5+ years. Sadly, the steam edition is unplayable through stuttering and graphical glitches. I can't recommend this until the devs take a look at some of these problems.",
            "review_score": "-1"
        },
        {
            "review_text": "Age of Empires 2 but with mythological creatures and much more fun! :D Even for its 'classical' age ( lol ) the game was brilliant for its time and still stands a fun game to play today. 11/10 would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion one of the best real-time strategy games! Choosing different gods, using different troops etc. makes every player unique in a special way. Really nice :)",
            "review_score": "1"
        },
        {
            "review_text": "great game!! can get confusing at times but that is what makes the game :)",
            "review_score": "1"
        },
        {
            "review_text": "At first didn't know if I was going to know if it was just worth buying a 'remastered' version of the game. But went ahead anyway, and i'm glad I did. This version offers a new and fresh atmosphere for players, while still maintaining the fun. Definitily worth getting if you liked the old version or want to try this game for the first time!",
            "review_score": "1"
        },
        {
            "review_text": "A Epic return for a Epic Game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game enough said!",
            "review_score": "1"
        },
        {
            "review_text": "Yes i recommend this game it is a classic!",
            "review_score": "1"
        },
        {
            "review_text": "Its soo good. One of the best campaigns Ive played. Im a little afraid to go online, so I cant judge that. But the fact that it comes with the expansions is awesome. Very High replay value. Feel like I was ripped off by missing out ten years ago!",
            "review_score": "1"
        },
        {
            "review_text": "lot's of fun",
            "review_score": "1"
        },
        {
            "review_text": "EPIC GAME: - High replay value - Great Single Player - Can run well on low spec. PCs (low settings)",
            "review_score": "1"
        },
        {
            "review_text": "Another re-implementation of one of the 'Age of' games by Ensemble Studios. This time, it is much easier to modify the game to add textures, buildings, UI elements and units. Throw in some working multiplayer and you have effectively made a good game even better than it was before. I myself am not a big fan of RTS games, being terrible at strategy, but this one I love.",
            "review_score": "1"
        },
        {
            "review_text": "Enemy army invading. Shiny hero in lead. I lightning bolt a bloody chicken, and then drop both ends of my underworld passage on my own island. Just as annoying as it was ten years ago. LOVE IT!  If you can catch it on sale grab it. Though had you purchased the game ten years ago or anytime in between I can not reccomend it at a thirty dollar pricetag.",
            "review_score": "1"
        },
        {
            "review_text": "Certaintly worth getting. Brings back the memories of the first version. Though this is merely a simple revamp of the old game, it has not lost any of the fun factor it once had! Have fun in campaigne or the new multiplayer, or even just screw around with cheats! All good fun!",
            "review_score": "1"
        },
        {
            "review_text": "Well, AoM is a classic of course and only to recommend. But the Extended Edition is a bit underwhelming (as for AOE 2 as well) for the full price. Get it on sale but don't pay the full price for this.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Been playin since i was like 10. Amazing game that instantly became a classic!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun revamp! hours and hours of fun, especially with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very fun, but not for this price. Lots of frame drops, lag, and game freezes. I await the patches.",
            "review_score": "-1"
        },
        {
            "review_text": "Always loved this game. Needs more online players though.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is a great strategy game and i have had a great time playing it",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of mythology this is my favorite thing ever.",
            "review_score": "1"
        },
        {
            "review_text": "At first didn't know if I was going to know if it was just worth buying a 'remastered' version of the game. But went ahead anyway, and i'm glad I did. This version offers a new and fresh atmosphere for players, while still maintaining the fun. Definitily worth getting if you liked the old version or want to try this game for the first time!",
            "review_score": "1"
        },
        {
            "review_text": "As a kid I loved this game. And it turns out I havent changed. Rate it 9.9999999999999999/10",
            "review_score": "1"
        },
        {
            "review_text": "Yes i recommend this game it is a classic!",
            "review_score": "1"
        },
        {
            "review_text": "I've played the original AOM, and it was undoubtedly one of the best games i've ever played. When i saw the Extended Edition here, i bought it without a second thought. Awesome game, highly recommend. :)",
            "review_score": "1"
        },
        {
            "review_text": "I loved Age of Mythology... the first one that is. I bought the extended version today, and played it for about an hour. i was not pleased with my purcahse. The game's graphics are bad compared to the original AoM (I own both copies now). I have good online connections at my house, but this online - don't get me started. Lastly, it crashed three times within the hour. I wholeheartedly recommend this: buy the first AoM; don't buy this Extended Edition crap, even if it is one sale!",
            "review_score": "-1"
        },
        {
            "review_text": "From what I have played so far, it's a really good game. Kinda reminds me a bit of AoEO",
            "review_score": "1"
        },
        {
            "review_text": "I was so excited to download this game.. however my happiness short lived.. the games crashes as soon as it launches... Is there a fix for this ?",
            "review_score": "1"
        },
        {
            "review_text": "One of the first games I played on the computer, one of the best. UNTILL, Steam came along and brought the EXTENDED Edition upon us... My advice, don't buy it! Download it from pb. make sure your friends have the same version so everybody is compatible and play it via Gameranger. It's definitely not worth the money, they flunked in every aspect (updated visuals &amp; multiplayer). Props for the singeplayer, they changed nothing, that's a good thing!",
            "review_score": "-1"
        },
        {
            "review_text": "Enemy army invading. Shiny hero in lead. I lightning bolt a bloody chicken, and then drop both ends of my underworld passage on my own island. Just as annoying as it was ten years ago. LOVE IT!  If you can catch it on sale grab it. Though had you purchased the game ten years ago or anytime in between I can not reccomend it at a thirty dollar pricetag.",
            "review_score": "1"
        },
        {
            "review_text": "Truely a classic RTS, the pace of it is slower though. It has a relatively simple infrastructure, but it's not exactly trying to be Civ 5. The true fun for me has always been building armies filled with mythical beasts and bashing through a player's defenses.  I'm unsure about the competitive scene, If there is any, but multiplayer is definitely an option. I tend to LAN it with a couple of friends which makes for a great time ususally.  Loved it when it first came out, and I appreciate the visual enhancements they've made in refurbishing it. If you're looking for an RTS that isn't going to break your wallet then I'd suggest this one.",
            "review_score": "1"
        },
        {
            "review_text": "Great revamp for a classic game that I used to play in my childhood, also probably my first real gaming experience. Fairly primitive graphics and some minor bugs but it is still a very fun RTS, can be played on some laggy computers. However, the multiplayer is full of tryhards and zerg rushers.",
            "review_score": "1"
        },
        {
            "review_text": "This game began on my path for strategy game domination al the way back in elementary school. Great game, it never gets old. in face every new playthrough only gets better.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game. I enjoy these types of games because it is a feeling of free build and its different each time you play on a random map skirmish. THAT is why I give it a thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "An old addiction has returned, with none of its former power diminished. I loved this game years ago and was sorry to leave it behind when the Windows 98 platform I played on became dead in the water. When I heard it was on Steam, I quite literally squeed out loud - and then paid full Steam price for it. Worth. Every. Penny. - and now I'm buying it for my grown children. They, too, loved this game in the past and their faces lit up when I told them it was available on Steam. Thank you, Steam! LOVE. THIS. GAME.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Age of Empires, then you'll love the superior version of it that you should have been playing to begin with.",
            "review_score": "1"
        },
        {
            "review_text": "I very much enjoy this game, it is a real-time strategy game. Sometimes it is rage inducing but other than that I love it! :D",
            "review_score": "1"
        },
        {
            "review_text": "It gave me the opportunity to choose gods. -10*14+34.75/10",
            "review_score": "1"
        },
        {
            "review_text": "So much nostalgia! I have this game on disk for my old Mac; I was ecstatic when I saw this game on the front page of the steam store. I instantly bought it, (One of those 'shut up and take my money' moments) and proceeded to play all night. I was not disappointed, this game is every bit how I remembered it. Definitely recommended for everyone out there who loves RTS games!",
            "review_score": "1"
        },
        {
            "review_text": "70 out of 100  If you've played the original at the competitive level, you will be very dissapointed in the current state of the online modes. But the single player experience is decent.",
            "review_score": "1"
        },
        {
            "review_text": "good old RTS game, still more enjoyable than most of the games that made recently year",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful game that i have played over and over again long before Steam brought it out here!   A wonderful mix of mythology and tactics to make a great fighting game that you can make as difficult as you want or as easy with many little hidden extra's if you know the codes that can bring in some very fun and strange creatures. It also brings into focus three different forms of culture in a basic way through their myths and legends.  A great game that you can get enjoyment out of for many hours with the quests or even just quick play games. A definate buy if you liked the AoE games or if you want to watch a minotaur beat up a scarab. :D",
            "review_score": "1"
        },
        {
            "review_text": "It's Super Sweet.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Not too easy. You will enjoy this if you know AoE series.  Lots of replay ability.   Glad I bought this when it went on special. Value for what I payed.  ",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "In middle school I became insanely interested in mythology, and thanks to this game, I broadened my horizons on the subject. It was so cool being able to not only create a civilization based arround the Ancient Egyptians (Personal favorite mythology and probably the best civ in the game), but also bringing to life their myths. The release of this HD version was a godsend, as not only do I have the game improved visualy, but I do not need to go through that pesky download from the CDs. It's all here digitally online.",
            "review_score": "1"
        },
        {
            "review_text": "I played the original version of this game  I will say this: I love this game, even if it didn't come without the new bells and whistles, I still would of bought it off Steam. Why?: the campaigns were fun of course, but my main reason has always been the custom maps that the community creates, Sims, or some RPG set up or a 'Build your ' etc, or 'Cat and Mouse' or even a few maps that were set up to where one person was suppose to pretend to be a god and give you units, were all interesting and unique to play. There are even a number of maps off the original AOM community website I have yet to try or play. The map editor itself is a fantastic tool, once you've learned how to handle the event editor within it, of course. The game as a whole is even such that I can look past how horrible I am at real time stratedgy, I just have fun playing it no matter what mode it is I play in.  This game being on steam makes it so much easier to play it when I can't bring the original's disks around with me. My only hope now is that there would be more expansions for this game such that even more civilizations/mythologies are added in, theres a whole other bunch of mythologies that could be thrown in... Chinese, Japanese, Indian, anything else with mythological beasts and multiple deities, really.  I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "to much lag, not even that goodlooking, not worth my money. I'd rather play the original",
            "review_score": "-1"
        },
        {
            "review_text": "if you ever liked any rts game then get this, it is one of, if not thee best ones to date  if you already own it though... do not buy it here online multiplayer lags worse than anything i have ever played (the online portion really is unplayable) but the single player game itself more than makes up for it   ===============================================  revised review, after the update when they released the new expansion (which i did not buy but was going to) the game runs into errors and single player maps (didn't try the story since i beat it already) all settlements get destroied as soon as the game starts, as of now it is unplayable and i can no longer recomend buying it on steam until the issue is fixed",
            "review_score": "-1"
        },
        {
            "review_text": "I keep playing this game over and over. My sister used to play it for days at a time. It's very addictive and puts you in a good trancelike state. The music is fantastic. Not too jarring and not too boring. I love the upgraded graphics. I'd highly recommend this for any RTS fans.",
            "review_score": "1"
        },
        {
            "review_text": "OMG I LOVE THIS GAME i have been playing since the old age of mythology lets just say i recommend this to everyone who sees this review",
            "review_score": "1"
        },
        {
            "review_text": "Age of Empires II/Star Wars: Galactic Battlegrounds was my favorite game for a long time but this game takes everything I like about them and puts it together.",
            "review_score": "1"
        },
        {
            "review_text": "this is the game i would play all the time as a kid. this and runescape. i never went to school (well not really) so i learned a lot from these two games at this time. valve seems to have all the good deals inbetween my pay periods so im glad i invest in all those weapon skins valued at 8$ today. gg valve",
            "review_score": "1"
        },
        {
            "review_text": "I personally grew up with this game. This might be a little bit biased, but this game is just amazing. No questions asked.",
            "review_score": "1"
        },
        {
            "review_text": "Ok my computer was all freaked out when it played this game it had a black screen and I tried and tried to fix it, But for some reason I guess the Computer fairy came down and fixed the game so I could play it! :D",
            "review_score": "1"
        },
        {
            "review_text": "A good game you have try it",
            "review_score": "1"
        },
        {
            "review_text": "i love this game, the price needs to be more competative to get a decent community going. around £5.99 -£9.99 would be a fare price.",
            "review_score": "1"
        },
        {
            "review_text": "'cause it's good and 'cause I can :3",
            "review_score": "1"
        },
        {
            "review_text": "Stole our money.... Game forces you to buy expansion in order to be playable. SCUMBAGS  Edit: This was fixed a while back and AOM is still the excellent game it was back when it launched all those years ago. I am still disappointed with the lack of effort by the dev. team overall but it is too hard to keep a downvote on such a fine RTS game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, with extended issues. It's great that there is always people ready to play a game online but about 50% of the time the game will end in a sync error or worse, it will lag the whole way through. Even so, this is my favorite RTS out there. I'd recommend it just for the random map game type. The online stuff needs work.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing really has been added with the ''Extended Edition''. You would expect them to fix bugs but no. 2 of my friends with brand new computers, can't open this game. No real solutions from google so please don't blindly dislike this but, like it so creators can give attention this problem and hopefully solve it. ( I would love to change it back to my previous state - recommend , with a new fix )",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing bad to find in this game. It's a great strategy game of the Age of Empires-series, but with a mythical touch. The campaign has an interesting story and it's great to get to know all tribes to decide who you like playing with most.  Time flies when playing.. and you can keep on playing. I was lucky to buy it on a sale, but it's definitely worth the full price too!",
            "review_score": "1"
        },
        {
            "review_text": "Not as bad as everyone says. Try it. Worth the shot. But some improvements and elongation of the campaign is required.",
            "review_score": "1"
        },
        {
            "review_text": "Everybody raves about Age of Empires, but they have never leveled a city with meteors and minotaurs. Had no bugs in this version and it runs well.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best game from childhood. Where the family joke 'I hate Norse people.' came from. dlc is meh, not really worth it.",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of difficult to say why I like this game. The graphics are well, not bad, but not so awesome either, the AI is often so stupid, I wish there would be some more options on military commands, and some other things also.  But I still keep on returning to this game and playing it. I guess it's the enough simple, yet enough complicated gameplay that keeps me enjoying this game. I also like the campaign story a lot.  In my opinion, the beginning of any map is always the most interesting point of game. What is around you, how can you use the surroundings, where to build defences and where to spot your soldiers, so you gain good base for the start.  Exploring, defending, harvesting and attacking in a nice messy combination, which is always slightly different.  If you have some Christopher Columbus in you, I believe you can enjoy this game, just like I do.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game blast from the past for me brings back memories of when I used to play it with my Grandmother. The game play is entertaing if not a little repetertive but thousands of houres of entertainment. The multiplayer is quiet diverse there louds of unique maps and senarios.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, Age of Mythology is a worthy game for any gamer that has interest in strategy! Honestly i could be writing a huge review but rather playing this awesome game! Lastly you also get a active modding community so give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Age of Mythology has always been a great favourite of mine, wasted many thousands of hours on it (and in a good way) I even went as far to create a massive modification/overhaul of it called Expanded Mod for the Titans expansion.  However Extended Edition is a very mixed bag, most of the time, the crappy work of the exe by Skybox Labs. and the code itself has caused many issues with lag, OOS etc overtime they have fixed this, but mostly because the small 1k community has coerced them into somewhat fixing it. Rundown:  PROS: + All the Benefits of The Titans + Four New Vanilla units (Patch 2.0 onwards) and 1 scenario editor/easter egg unit + Addition of all extra-optional content by ES themself (Away from Home, +2 RMs, Golden Gift Campaign) + Some Decent Balance + Readdition of the Beta Ambient Lighting + Improved Shadows (now dynamic, render based not .DCL/Texture files) + Somewhat decent Mod Support, but...   NEGS: - Crap Optimization, (run it with footprints + Amb Lights in 1024x768 should get around 45 FPS on most 2009 onwards Comps) - Nothing Spectacular content wise, if you know the Beta, AoE Twitch Livestreams, Alphas and Extra ES-made content. - Many Murky/Cloudy Textures, some texture stuff won't render correctly. - Eh Pathfinding - Still Needs a lot of fixing. - Lack of Dev Support - Almost no active community  Yeah only 1k players play Online properly (even though there's 14k playing per 2 weeks, and only some 2-30 people playing non-private MP), even, also via the some 900,000+ purchases (roughly 27 million USD) Dev Support is really whack, so it's obvious that it's a money laundering scheme (MS is pretty infamous for that)  Only get it, if your a non-Casual or below Age of Empires fan ",
            "review_score": "-1"
        },
        {
            "review_text": "Still just as good as I remember it being when I played as a kid. Probably moreso given that I actually know what I'm doing now.",
            "review_score": "1"
        }
    ]
}