{
    "app_id": 267220,
    "name": "Line Of Defense Tactics - Tactical Advantage",
    "release_date": "2014-03-17",
    "developer": [
        "3000AD"
    ],
    "publisher": [
        "3000AD"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 2,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "A real-time strategy combat game based on the world of the Line Of Defense. Command a team of four Galactic Command marines in highly classified missions in space and on planets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/267220/header.jpg?t=1467766945",
    "minimum_requirements": "OS: Windows 7 SP1 Processor: Dual Core Memory: 2 GB RAM Graphics: DirectX compliant with 2GB memory DirectX: Version 9.0c Storage: 500 MB available space Sound Card: DirectX compliant",
    "recommended_requirements": "OS: Windows 7 SP1 Processor: Quad Core Memory: 4 GB RAM Graphics: DirectX compliant with 2GB memory DirectX: Version 9.0c Storage: 500 MB available space Sound Card: DirectX compliant",
    "reviews": [
        {
            "review_text": "I want to love this game, there is so much potential. Its let down by an appaling interface. You cant pause without giving an order... Whats wrong with the spacebar to pause??? it works for every other game like this. Also why use radial menus? they are for console games. PC games use the mouse and keyboard. List the squad members across the bottom of the screen and place the order buttons for each one above their picture, that way you can see their status and what they have avaibable easily. Every time i play this my squad gets whiped out because i deliver an order to charge forward out of cover by accident. Anything more complex than move and shoot is too complex in the heat of battle... which defeats the point of this game.",
            "review_score": "-1"
        }
    ]
}